{
  "created_at": "2025-01-06T01:06:12.621775+00:00",
  "objectID": "d0f5d389eecc2bc51ffe65b7ae1eaddb",
  "ref": "salt-line-walking-and-cycle-route",
  "title": "Salt Line Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Hassall_Green_station_geograph-3614753-by-Ben-Brooksbank.jpg/512px-Hassall_Green_station_geograph-3614753-by-Ben-Brooksbank.jpg",
  "nearby": [
    {
      "description": "Sandbach",
      "objectID": "01df7b8ad63f4215515ecdc8438bdae7",
      "ref": "sandbach-walking-route"
    },
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d0f5d389eecc2bc51ffe65b7ae1eaddb.gpx",
  "_geoloc": {
    "lat": 53.145582548,
    "lng": -2.3596765183
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Hassall_Green_station_geograph-3614753-by-Ben-Brooksbank.jpg/512px-Hassall_Green_station_geograph-3614753-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank / Site of Hassall Green station",
      "caption": "Hassall Green station near the start of the route. View SE, towards Harecastle: ex-North Stafford Harecastle - Sandbach branch. The station had been closed to passengers 28/7/30 (to goods 1/11/47), but the line remained in use for freight until 4/1/71. Ahead is the M6 Motorway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Salt_Line_Alsager_-_geograph.org.uk_-_26670.jpg",
      "title": "Dennis Thorley / Salt Line Alsager",
      "caption": "Salt Line Alsager. The Salt Line is now a linear nature trail and cycleway starting near to the Wilbraham Arms in Alsager. It follows the old mineral line from the Potteries through to Sandbach and the salt towns of S Cheshire. Coal and limestone was carried into Cheshire where brine was heated in large open pans to leave white salt crystals which were then used in the making of washing soda, glass, soap and detergents. The trail is now in the ownership of Congleton Borough Council."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Bank_Farmhouse_nr_Hassall_Green.jpg/512px-Bank_Farmhouse_nr_Hassall_Green.jpg",
      "title": "Dave.Dunford, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Bank Farmhouse nr Hassall Green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/The_Borrow_Pit_-_geograph.org.uk_-_26671.jpg",
      "title": "Dennis Thorley / The Borrow Pit",
      "caption": "The Borrow Pit. A worked out sand pit alongside the Salt Line (see SJ7956). Now flooded and stocked with fish. Small flock of Canada geese, coot and other waterfowl."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Wilbraham_Arms_Alsager_-_geograph.org.uk_-_26254.jpg",
      "title": "Dennis Thorley / Wilbraham Arms Alsager",
      "caption": "Wilbraham Arms Alsager. The first pub as you enter Alsager from the M6 at Sandbach. Built on the site of Cresswellshawe Farm and named after the Wilbraham family major landowners of part of Alsager in days gone by."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Transport_through_the_ages_-_geograph.org.uk_-_208416.jpg",
      "title": "Steve Lewin / Transport through the ages",
      "caption": "View of the Trent and Mersey Canal near the start of the route. In the photo a barge on the canal passes under the M6 motorway bridge just to the west of Hassall Green Locks."
    }
  ],
  "distance_km": 2.8,
  "description": "This route follows a disused railway line near Alsager and Sandbach. The trail runs for just under 2 miles along a surfaced path, suitable for cyclists and walkers. Start the walk from the Salt Line and Borrow Pit Meadows car park at Smithy Grove. It's located just south of the Trent and Mersey Canal at Hassall Green (postcode for sat navs CW11 4YB). From here you can pick up the trail and follow it south east to Day Green and Lawton Heath End on the outskirts of Alsager. On the way you'll pass the Borrow Pit Meadows nature reserve where you'll find habitats including meadows, woodland, wetland, grassland, farmland and scrub. The reserve is a nice place for a stroll with lots of birdlife to look out for.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Wilbraham Arms is nicely located at the end of the route. The pub takes its name from the prominent local family that owned the nearby Rode Hall. It is positioned on the site of a former Cheshire farmhouse and includes extensive grounds, with two separate drinks terraces as well as a lawn seating area. It's a lovely place to relax in the summer months and can be found at a postcode of ST7 2AX."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is a nice one to do with your dog and The Wilbraham Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just east of the trail you'll find the noteworthy Rode Hall. The Georgian country house is surrounded by lovely parkland with woodland, gardens and a large lake. It's a nice place to continue your walking during the spring and summer months. The Alsager Walk uses the trail and the canal to create a circular route which visits the hall. Head north west along the canal and you can pick up another rail trail near Sandbach. The Wheelock Rail Trail is another flat surfaced path providing easy cycling and walking opportunites in the area. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KEiCW6pN8FQ",
  "postcode": "CW11 1FR",
  "district": "Sandbach",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dingle Lane, Sandbach Heath, Sandbach, Cheshire East, England, CW11 1FR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1 hour",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "grassland",
    "wetland"
  ],
  "points_of_interest": [
    "nature reserve",
    "birdwatching"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "linear",
  "activities": [
    "walking",
    "cycling"
  ]
}