{
  "created_at": "2025-01-06T03:15:26.080447+00:00",
  "objectID": "d122222572365349259ebb75697e2897",
  "ref": "horning-walking-route",
  "title": "Horning Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Boats_moored_at_Horning_-_geograph.org.uk_-_904102.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d122222572365349259ebb75697e2897.gpx",
  "_geoloc": {
    "lat": 52.7058205272,
    "lng": 1.4621043161
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Boats_moored_at_Horning_-_geograph.org.uk_-_904102.jpg",
      "title": "Evelyn Simak / Boats moored at Horning",
      "caption": "Boats moored at Horning. The view is northerly towards the sharp bend the River Bure takes here, changing direction from northeasterly to southeasterly as it passes through the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Off_on_a_trip_-_geograph.org.uk_-_904150.jpg",
      "title": "Evelyn Simak / Off on a trip",
      "caption": "Off on a trip. The Southern Comfort, moored near the Swan Inn by the sharp bend in the River Bure is embarking on a trip to Ranworth Broad. But first it has to turn around in order to be headed in the right direction and a shrill horn is sounded to warn other boats of the impending obstacle. Being able to reverse upstream into the wide bend in the river gives more room to manoeuvre and is presumably the main reason why the cruiser is moored at this location. The Southern Comfort is a paddle steamer that was purpose built for the Broads; the luxury river cruiser has a capacity of 100 passengers for public trips or private hire and runs regular trips from Horning, along the River Bure, to Ranworth Broad and back."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Horning_Ferry_Mill.jpg",
      "title": "Renata Edge / Horning smock mill",
      "caption": "Horning Ferry Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Ferry_Inn_at_Horning_-_geograph.org.uk_-_1025869.jpg",
      "title": "John Maris / Ferry Inn at Horning",
      "caption": "Ferry Inn at Horning. View from South bank of River Bure at Woodbastwick Marshes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Boardwalk_by_the_river_Bure_-_geograph.org.uk_-_1257112.jpg",
      "title": "Morley Sewell / Boardwalk by the river Bure",
      "caption": "Boardwalk by the river Bure. This boardwalk leads from the landing point for the foot ferry across the Bure from Lower Horning to the bird sanctuary of Cockshoot Broad."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Ice_cream_boat_doing_trade_at_Salhouse_Broad_-_geograph.org.uk_-_400247.jpg",
      "title": "Nick Smith / Ice cream boat doing trade at Salhouse Broad",
      "caption": "Ice cream boat doing trade at Salhouse Broad"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Channel_leading_south_from_Salhouse_Broad_-_geograph.org.uk_-_433243.jpg",
      "title": "David Robertson / Channel leading south from Salhouse Broad",
      "caption": "Channel leading south from Salhouse Broad. A channel bordered by carr woodland. The structures in the centre of the pictures are the remains of two boats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Woodbastwick_Village_Green_-_geograph.org.uk_-_1601812.jpg",
      "title": "Gareth Hughes / Woodbastwick Village Green",
      "caption": "Woodbastwick Village Green. The pump house on the village green. Behind, to the left, are the almshouses which were provided (like the pump) by the Cator family in the late nineteenth century."
    }
  ],
  "distance_km": 13.3,
  "description": "This Norfolk Broads village has some lovely waterside walks along the River Bure and the surrounding broads. It's one of the finest Broads villages with waterside pubs, shops, restaurant, tea-rooms and boat trips making it very popular with tourists. This walk from the village takes you to the Horning Ferry before heading to Bure Marshes, Woodbastwick and Salhouse Broad. Look out for lots of water loving birds as you make your way along the waterways of this lovely area. The walk starts by heading through the village towards Horning Ferry, just to the south east. Here you'll find a fine riverside pub and a ferry service to take you across the River Bure. Check the website for running times. The route then takes a small detour to visit the boardwalk which runs along the Cockshoot Dike to Cockshoot Broad. You then head through Bure Marshes before following Ferry Road to Woodbastwick. From here follow Salhouse Road west before picking up a footpath heading north to the pretty Salhouse Broad.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ferry Inn is the ideal place for some post walk refreshment. Here you can sit outside and watch the boats go by on the water. You can find them at postcode NR12 8PS. They are dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west towards neighbouring Wroxham and you can pick up the Bure Valley Path to visit Coltishall. In Wroxham you can also pick up the Hoveton Walk which visits the nearby Hoveton Hall. The 19th century house includes some beautiful grounds with stunning gardens, a pretty lake and popular snowdrop walks in February. Just to the east there's Ranworth Broad where there's a boardwalk and a Wildlife Centre where you can learn all about the birdlife that visits the area. For more walking ideas in the area see the Norfolk Broads Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cxzumdGdWTk",
  "district": "Norwich",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Swan Inn, 10, Lower Street, Horning, Norwich, Norfolk, England, NR12 8AA, United Kingdom",
  "postcode": "NR12 8AA",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "waterway",
    "marsh"
  ],
  "points_of_interest": [
    "waterbirds",
    "boardwalk"
  ],
  "facilities": [
    "pub",
    "ferry",
    "shop",
    "restaurant",
    "tea-rooms"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}