{
  "created_at": "2025-01-06T02:12:39.971003+00:00",
  "objectID": "d135e7096cec647b482fb54ea15b2637",
  "ref": "storrington-walking-route",
  "title": "Storrington Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/42/High_Street_-_geograph.org.uk_-_1002929.jpg",
  "nearby": [
    {
      "description": "Chanctonbury Ring",
      "objectID": "363ee78a1c92cc96afd9561d72428d2c",
      "ref": "chanctonbury-ring-walking-route"
    },
    {
      "description": "Amberley Circular Walk",
      "objectID": "dfc70c8eaadf50af80a5e1b81eba1291",
      "ref": "amberley-circular-walk-walking-route"
    },
    {
      "description": "Amberley to Arundel",
      "objectID": "03b9d24e9337229363907c90e8cef6ba",
      "ref": "amberley-to-arundel-walking-route"
    },
    {
      "description": "Pulborough",
      "objectID": "416e092e3c67777693efdefbd8795fa5",
      "ref": "pulborough-walking-route"
    },
    {
      "description": "Parham House",
      "objectID": "5d11f74cf457762f311fb8a1a862e459",
      "ref": "parham-house-walking-route"
    },
    {
      "description": "Knepp Castle",
      "objectID": "3493d64868e87b4daa2c51a46b5463f1",
      "ref": "knepp-castle-walking-route"
    },
    {
      "description": "West Chiltington",
      "objectID": "1d52d4e2f5722a206ba365c1ec3204c6",
      "ref": "west-chiltington-walking-route"
    },
    {
      "description": "Rackham Woods",
      "objectID": "3683204c24f53c6c8d8fb76776c247ce",
      "ref": "rackham-woods-walking-route"
    },
    {
      "description": "Findon",
      "objectID": "ebb9c1fe2a332cf85b429ff11aaeabab",
      "ref": "findon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d135e7096cec647b482fb54ea15b2637.gpx",
  "_geoloc": {
    "lat": 50.9188104062,
    "lng": -0.4589543579
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/High_Street_-_geograph.org.uk_-_1002929.jpg",
      "title": "Simon Carey / High Street",
      "caption": "High Street view in Storrington. The shops and houses at the top end of the street are in The Square. The road is also the busy A283. Whilst being the size of a village Storrington's facilities are more akin to a small town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Footpath_south_of_Storrington_-_geograph.org.uk_-_869744.jpg",
      "title": "Slbs / Footpath south of Storrington",
      "caption": "Footpath south of Storrington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Bridleway_up_Chantry_Hill_-_geograph.org.uk_-_1003068.jpg",
      "title": "Simon Carey / Bridleway up Chantry Hill",
      "caption": "Bridleway up Chantry Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/On_Kithurst_Hill_-_geograph.org.uk_-_985032.jpg",
      "title": "Colin Smith / On Kithurst Hill",
      "caption": "On Kithurst Hill. Path junction where the South Downs Way meets the Storrington Link. The underlying chalk is easily seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/South_Downs_Way_near_the_top_of_Sullington_Hill_-_geograph.org.uk_-_870241.jpg",
      "title": "Slbs / South Downs Way near the top of Sullington Hill",
      "caption": "South Downs Way near the top of Sullington Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Former_Blockhouse%2C_Highden_Hill_-_geograph.org.uk_-_1003359.jpg",
      "title": "Simon Carey / Former Blockhouse, Highden Hill",
      "caption": "Former Blockhouse, Highden Hill. A relic of the time when this part of the Downs was closed to all bar military access as between 1939-45 the area around Highden Hill was used mainly as a flamethrower practice range. These remains are in a field next to the cross dyke just north of the South Downs Way. The woods of Biggen Holt are just beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Chanctonbury_Ring_-_geograph.org.uk_-_991317.jpg",
      "title": "Simon Carey / Chanctonbury Ring",
      "caption": "View of the Chanctonbury hill in the early autumn of 2008. Chanctonbury Hill is the highest point here and affords views to the North Downs and the Isle of Wight, you can even make out the towers of Fawley Oil Refinery in the evening sun. First inhabited by tribesman from the Bronze Age, the defensive works are from the Iron Age, whilst the Romans built a temple in the middle and the Saxons used it as a fort. Throughout the ages it has been used as a beacon and had become a tourist attraction by the early 19th century. The ring has also been associated with hauntings, fairies and UFOs. The trees were planted in the earthworks by the Goring family from Wiston House below in around 1760 though most of those were lost in the hurricane of 1987. However, a descendent of Charles Goring replanted the crown with beech trees soon after."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Washington_Village_Hall_-_geograph.org.uk_-_814904.jpg",
      "title": "Peter Holmes / Washington Village Hall",
      "caption": "Washington Village Hall"
    }
  ],
  "distance_km": 16.0,
  "description": "This picturesque small town in West Sussex is in a nice position on the northern edge of the South Downs. There's miles of trails here and some decent riverside trails along the Adur to the west of the town. The town itself is also very pretty with a mill pond and good selection of shops and pubs. This circular walk from the town heads into the South Downs where you can pick up The South Downs Way National Trail. It then heads east to visit the Chanctonbury Ring Hill Fort on the Downs. Start the walk from the town centre where you can pick up footpaths heading south towards Kithurst Hill and Chantry Hill. There's excellent views here towards the English Channel and the Isle of Wight. Near here you can pick up the South Downs Way and follow the waymarked footpath east to Sullington Hill, Highden Hill, Biggen Holt and Chanctonbury Ring. There are excellent views over the area from the elevated position of this Iron Age hill fort. It's also a great area for flora and fauna with wildflowers in the summer months and some woodland trails to enjoy. After exploring the fort the route then heads north west to visit the neighbouring village of Washington. You continue west past Rowdell before following bridleways past Sullington Farm. At Waterfall Cottage you turn north west to return to Storrington.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the town centre you can enjoy refreshments at The Moon. The contemporary pub has a great menu and a nice walled garden area for warmer days. You can find them on the High Street with a postcode of RH20 4DR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the walk are ideal for fit dogs. The Moon pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head west along the South Downs Way from Kithurst Hill you will soon come to the attractive town of Amberley. Here you can try the Amberley Circular Walk, the Amberley to Arundel Walk or the Rackham Woods Walk. Near to the town there is the village of Findon and the noteworthy Cissbury Ring. It is the second largest hill fort in England, dating back to around 250 BC. To the north west there's the Pulborough Walk which visits the lovely Pulborough Brooks nature reserve where there's lots of wildlife to look out for. Near here is the delightful village of West Chiltington where there's a smock windmill, 17th century stocks, winding lanes and an ancient 12th century church to see. Another highlight of the area is Parham House located just to the west of the town centre. Here you can explore the beautiful parkland and gardens surrounding this Elizabethan House. For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PwELflZ90PM",
  "postcode": "RH20 4JD",
  "district": "Storrington",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Monastery Lane, Storrington and Sullington, Storrington, Horsham, West Sussex, England, RH20 4JD, United Kingdom",
  "state": "England"
}