{
  "created_at": "2025-01-06T10:38:01.011668+00:00",
  "objectID": "d140cb35c93c2db677b72c8fb9fb5738",
  "ref": "hockley-viaduct-walking-route",
  "title": "Hockley Viaduct Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Hockley_Viaduct_spans_River_Itchen_-_geograph.org.uk_-_54131.jpg",
  "nearby": [
    {
      "description": "St Catherine's Hill Winchester",
      "objectID": "ada71fffaace86ab9f2951ef046a6dad",
      "ref": "st-catherines-hill-winchester-walking-route"
    },
    {
      "description": "Clarendon Way",
      "objectID": "be9b3d39a746039072310331122caf4a",
      "ref": "clarendon-way-walking-route"
    },
    {
      "description": "National Cycle Route 23",
      "objectID": "062ecf06345658041d2f870cf171272b",
      "ref": "national-cycle-route-23"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d140cb35c93c2db677b72c8fb9fb5738.gpx",
  "_geoloc": {
    "lat": 51.0606691351,
    "lng": -1.308343379
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Hockley_Viaduct_spans_River_Itchen_-_geograph.org.uk_-_54131.jpg",
      "title": "Peter Facey / Hockley Viaduct spans River Itchen, via Wikimedia Commons",
      "caption": "Hockley Viaduct spans River Itchen. Photo taken from the river bank"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Permissive_path_along_Hockley_Viaduct_north_of_the_M3_-_geograph.org.uk_-_269254.jpg",
      "title": "Jim Champion / Permissive path along Hockley Viaduct north of the M3, via Wikimedia Commons",
      "caption": "Permissive path along Hockley Viaduct north of the M3"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Hockley_Viaduct_notice_-_geograph.org.uk_-_270598.jpg/512px-Hockley_Viaduct_notice_-_geograph.org.uk_-_270598.jpg",
      "title": "Jim Champion / Hockley Viaduct notice, via Wikimedia Commons",
      "caption": "Hockley Viaduct notice. At each end of the Hockley Viaduct there is a sign like this. Winchester City Council bought the land along the line after its closure in 1968, including the viaduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/River_Itchen_from_Hockley_Viaduct_-_geograph.org.uk_-_270591.jpg",
      "title": "Jim Champion / River Itchen from Hockley Viaduct, via Wikimedia Commons",
      "caption": "River Itchen from Hockley Viaduct. Looking northwest across the River Itchen and its floodplain from the permissive path along Hockley Viaduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Wharf_Bridge%2C_Winchester_-_geograph.org.uk_-_1338858.jpg",
      "title": "Dr Neil Clifton / Wharf Bridge, Winchester, via Wikimedia Commons",
      "caption": "Wharf Bridge, Winchester Officially the head of navigation, (although a few boats worked a short distance further upstream to serve Wharf Mill), this bridge, built in the 1760s, is the oldest surviving bridge over the River Itchen. The public right of navigation on the Itchen has never been statutorily extinguished."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Winchester_College_Boat_Club_-_geograph.org.uk_-_1338845.jpg",
      "title": "Dr Neil Clifton / Winchester College Boat Club, via Wikimedia Commons",
      "caption": "Winchester College Boat Club Photographed from Wharf Bridge. Whether this is the site of a former wharf is not known to me, but appears likely. This is privately owned, and the public launching of boats here is not allowed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/St._Catherine%27s_Hill%2C_Winchester%2C_Hampshire.jpg",
      "title": "Dianthus33 [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "View of St Catherine's Hill from the water meadows"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/The_Itchen_Navigation%2C_Winchester_-_geograph.org.uk_-_1736965.jpg/512px-The_Itchen_Navigation%2C_Winchester_-_geograph.org.uk_-_1736965.jpg",
      "title": "Peter Trimming / The Itchen Navigation, Winchester, via Wikimedia Commons",
      "caption": "The Itchen Navigation, Winchester A section of disused canal navigation, south of Winchester. Towpaths run along both banks."
    }
  ],
  "distance_km": 20.0,
  "description": "This circular walk in Winchester visits the historic Hockley Railway Viaduct. From the top of the viaduct there are fine views over the river towards Winchester and St Catherine's Hill. A Winchester City Council information board says 'The viaduct offers a unique opportunity to view contrasting local landscape features from a high level. To the north and west are some of the best views of the Itchen Valley (Winchester Meadows) Site of Special Scientific Interest.' The walk starts in the centre of Winchester, near to the cathedral. Head east and you can pick up paths heading south along the Itchen to Wharf Hill Bridge which spans the river. Built in the 1760s, it is notable as the oldest surviving bridge over the River Itchen. There are nice views down the river to Winchester College Boat Club from here. The route continues south passing St Catherine's Hill on your left before coming to the viaduct. The structure, was built in the late 1880s by the London and South Western Railway. It provided a link over the River Itchen and water meadows, from the Didcot, Newbury and Southampton Railway (DN&SR), to the LSWR's main line. The newly restored viaduct was officially opened on 26 February 2013 by the World Champion cyclist Dani King. It now forms part of the National Cycle Route 23 and is popular with walkers and cyclists. There are great views over the city of Winchester and the Itchen Valley countryside from the elevated position of the viaduct. After crossing the viaduct you head north to St Cross where you pick up a section of the Clarendon Way to take you back into the city centre.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/yHtjDiOGnAM",
  "postcode": "SO23 0HU",
  "district": "Winchester",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Colebrook Street, The Soke, Winchester, Hampshire, England, SO23 0HU, United Kingdom",
  "state": "England"
}