{
  "created_at": "2025-01-06T01:12:11.541225+00:00",
  "objectID": "d1591e432fcacbda3d5610552e563e79",
  "ref": "five-weirs-walk-walking-and-cycle-route",
  "title": "Five Weirs Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Five_Weirs_Walk.jpeg/512px-Five_Weirs_Walk.jpeg",
  "nearby": [
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "Sheffield Canal",
      "objectID": "a8acf85eb57fa3dafcfca812411dce05",
      "ref": "sheffield-canal-walking-route"
    },
    {
      "description": "River Sheaf Walk",
      "objectID": "06b559f08c3608dc5720163e2e35bfff",
      "ref": "river-sheaf-walk"
    },
    {
      "description": "Don Valley Way",
      "objectID": "e9257c081d15493743a2302d2cf4bc68",
      "ref": "don-valley-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d1591e432fcacbda3d5610552e563e79.gpx",
  "_geoloc": {
    "lat": 53.3852844674,
    "lng": -1.4641659183
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Five_Weirs_Walk.jpeg/512px-Five_Weirs_Walk.jpeg",
      "title": "Saul Good1 [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Five Weirs Walk. A view from Attercliffe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/The_end_of_the_Five_Weirs_Walk_%28geograph_3672711%29.jpg",
      "title": "Graham Hogg / The end of the Five Weirs Walk, via Wikimedia Commons",
      "caption": "The end of the Five Weirs Walk. Meadowhall shopping centre built on the Hadfields steelworks site and their weir on the Don. Meadowhall is the largest shopping centre in Yorkshire and was constructed in the 1990s. Features include a wide range of retail shops, the Oasis dining area and a cinema. There are also two tram stops here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/The_last_of_Sheffield%27s_five_weirs_walk_%28or_the_first_if_you_are_starting_here%29_-_geograph.org.uk_-_1251399.jpg",
      "title": "Steve F [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The last of Sheffield's five weirs (or the first if you are starting here). Appropriately named Walk Mill weir,the city centre is now very near."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/The_Bailey_Bridge_%28geograph_3669971%29.jpg",
      "title": "Graham Hogg / The Bailey Bridge, via Wikimedia Commons",
      "caption": "The Bailey Bridge. Erected here in 2006 to carry the Five Weirs Walk over the River Don between Effingham Road and Thomas W. Ward's Albion Works. The bridge dates from WWII and is thought to have been used in the D-Day landings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Salmon_Pastures_Local_Nature_Reserve_-_geograph.org.uk_-_1237957.jpg",
      "title": "Martin Speck / Salmon Pastures Local Nature Reserve, via Wikimedia Commons",
      "caption": "Salmon Pastures Local Nature Reserve. This footpath, part of the walk, runs between the Salmon Pastures Local Nature Reserve and the River Don. This area was once the slag heap of the Nunnery Coal Company's coke ovens. The acidic soil conditions have created an 'acid heath' environment which is maintained by periodically clearing invasive birch trees. The reserve is managed by the Wildlife Trust for Sheffield and Rotherham. You can look out for birdlife including mistle thrush, bullfinch, goldfinch and long tailed tit. Kingfishers, little grebe, moorhens and mallards can also be spotted on the adjacent banks of the River Don. Other species include dragonflies, moths, butterflies and hoverfly."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Spider_Bridge%2C_Sheffield_-_geograph.org.uk_-_725515.jpg",
      "title": "Stephen McKay / Cobweb Bridge, Sheffield, via Wikimedia Commons",
      "caption": "Spider Bridge. At this point the walk is suspended below the railway arches that once supported Victoria station and above the River don."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/River_Don_at_Attercliffe_Road_-_geograph.org.uk_-_1222761.jpg",
      "title": "Martin Speck / River Don at Attercliffe Road",
      "caption": "River Don at Attercliffe Road. The River Don looking towards the Midland Railway viaduct as seen from the 'Birdcage' on the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/The_River_Don_near_Attercliffe_Cemetery_-_geograph.org.uk_-_1426434.jpg",
      "title": "Martin Speck / The River Don near Attercliffe Cemetery",
      "caption": "The River Don near Attercliffe Cemetery. This section of the Don once took a longer loop South of here. The river was diverted and canalised by the Duke of Norfolk Estate in 1884. The left bank of the in this picture is part of the trail."
    }
  ],
  "distance_km": 9.5,
  "description": "This popular cycling and walking trail follows National Cycle Route 6 along the River Don from Sheffield City Centre to the Meadowhall Shopping centre. The route starts at Lady's Bridge in Sheffield City Centre, and heads over the Cobweb Bridge, past Bailey Bridge, and through Attercliffe to Meadhowhall. Along the way you will pass the five weirs from which the route takes its name. It's also a great way to see Sheffield's industrial past and present with lots of interesting riverside buidlings along the way. The path is flat and well maintained so it's a good cycle ride for families. At Meadowhall the route links with the Sheffield Canal. If you're on foot you could return along the canal (the towpath is a bit narrow for bikes). This would turn it into the 8-mile circular walk known as The Sheffield Blue Loop. You could also continue along the river to Rotherham along the Trans Pennine Trail. This takes you past the Blackburn Meadows Nature Reserve and into the city centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The large shopping complex of Meadowhall has a number of good options for refreshments at the end of your exercise."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The walk forms part of the Don Valley Way, a long distance route which can be followed all the way to Doncaster along the river. It runs for just under 30 miles with long sections also suitable for cyclists. For more riverside walking in the city you could pick up the River Sheaf Walk at Granville Square, near the train station. The trail will take you to the attractive Millhouses Park and Beauchief, where you will find a medieval monastic house with parkland and ancient ruins."
    }
  ],
  "video_url": "https://www.youtube.com/embed/f_BkUOGT80k",
  "postcode": "S3 8LE",
  "district": "Sheffield",
  "region": "South Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Castlegate, Burngreave, Sheffield, South Yorkshire, England, S3 8LE, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "river",
    "urban"
  ],
  "points_of_interest": [
    "industrial buildings",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "canal"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}