{
  "objectID": "d160e2fff78c89adeca66aaf260a687b",
  "created_at": "2024-12-18T13:53:52.105390+00:00",
  "ref": "bibury-river-coln-arlington-row-walking-route",
  "title": "Bibury to Coln St Aldwyns River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d6/The_River_Colne_in_Bibury_-_geograph.org.uk_-_1440310.jpg",
  "nearby": [
    {
      "description": "Chedworth Roman Villa",
      "objectID": "e757ea971115b9694f5c83395e766d4e",
      "ref": "chedworth-roman-villa-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Macmillan Way",
      "objectID": "cf3f4a199da30cc9ae551d49d13ec8f4",
      "ref": "macmillan-way-walking-route"
    },
    {
      "description": "Coln St Aldwyns",
      "objectID": "bfb53db22cfee4fc03936dc5eb622548",
      "ref": "coln-st-aldwyns-walking-route"
    },
    {
      "description": "Eastleach",
      "objectID": "96ef057d8655ba756dd8c6a2e836b9cb",
      "ref": "eastleach-walking-route"
    },
    {
      "description": "Southrop",
      "objectID": "fbb308c5a0e2908a1faf66bfc0ed9d63",
      "ref": "southrop-walking-route"
    },
    {
      "description": "Quenington",
      "objectID": "c9e32b712bf853cebfa9fa84adb3a676",
      "ref": "quenington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d160e2fff78c89adeca66aaf260a687b.gpx",
  "_geoloc": {
    "lat": 51.7574124083,
    "lng": -1.830695973
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/The_River_Colne_in_Bibury_-_geograph.org.uk_-_1440310.jpg",
      "title": "Steve Daniels / The River Colne in Bibury",
      "caption": "The River Coln in Bibury. The river is a picturesque waterway rising near Brockhampton in Gloucestershire and flowing southeast for about 50 kilometres before joining the Thames near Lechlade. Along its course, the river meanders through charming villages such as Withington, Bibury, and Coln St Aldwyns, offering scenic views of traditional Cotswold landscapes. Here in Bibury, the River Coln is a central feature, winding through the village and past Arlington Row. This section is particularly noted for its beauty, with the river's crystal-clear waters providing a habitat for trout and other aquatic life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/A_Riverside_Cottage%2C_Bibury_-_geograph.org.uk_-_1575499.jpg",
      "title": "Cameraman / A Riverside Cottage, Bibury",
      "caption": "A stone Riverside Cottage. Just across the river from Arlington Row. The village is rich in history, with highlights including the Bibury Trout Farm, established in 1902, which continues to produce brown trout for local waterways. Nearby, the Rack Isle, a former storage and drying ground for wool, now serves as a tranquil wildlife haven, attracting species like dragonflies, kingfishers, and various wildflowers. Bibury also boasts the elegant Bibury Court, a Jacobean mansion dating back to the late 16th century, and Arlington Mill, once a hub of the wool trade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Arlington_Row%2C_Bibury_-_geograph.org.uk_-_231329.jpg",
      "title": "Katy Walters / Arlington Row, Bibury",
      "caption": "Arlington Row. A row of weavers' cottages now owned by the National Trust and attracting coachloads of tourists. Arlington Row is a quintessential symbol of English heritage and Cotswold charm. Originally built in 1380 as a monastic wool store, the row was converted into weavers’ cottages in the 17th century. The cottages housed workers who produced cloth for Arlington Mill, located nearby. This transition highlights Bibury’s historical significance in the wool trade, which was central to the economy of the Cotswolds during the medieval and post-medieval periods.  Now managed by the National Trust, Arlington Row is a Grade I listed structure and one of England’s most photographed landmarks. Its honey-coloured limestone cottages, steeply pitched roofs, and idyllic setting along the River Coln have made it an enduring symbol of rural England. The cottages are still occupied, though one is available as a holiday let through the National Trust, allowing visitors a chance to experience this iconic site firsthand."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/River_and_Road_Bridge%2C_Bibury_-_geograph.org.uk_-_1575491.jpg",
      "title": "Cameraman / River and Road Bridge, Bibury",
      "caption": "A delightful scene with the river and road bridge. The river supports a variety of flora and fauna. Its banks are often lined with willows, reeds, and sedges, providing shelter for water voles and kingfishers. The surrounding meadows are a haven for butterflies, dragonflies, and wildflowers, such as meadowsweet and purple loosestrife. Conservation efforts in areas like Coln Rogers have focused on restoring habitats, benefiting both wildlife and the river's natural floodplain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Swan_Hotel%2C_Bibury_-_geograph.org.uk_-_553082.jpg",
      "title": "David Stowell / Swan Hotel, Bibury",
      "caption": "Swan Hotel. Looking across the hotel gardens and the river Coln to the hotel itself in this very popular tourist spot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Stained_Glass_Window_%2C_Church_at_Bibury_-_geograph.org.uk_-_161894.jpg",
      "title": "Pam Brophy / Stained Glass Window : Church at Bibury",
      "caption": "Stained Glass Window : Church at Bibury. The stained glass window at the bottom end of the knave in the church with the late afternoon sun shining through. Inside the church, visitors can admire stained glass spanning from medieval fragments to 20th-century designs by Karl Parsons. The churchyard includes historic table tombs from the 17th and 18th centuries. St Mary’s continues to function as a parish church and is part of an eco-conscious initiative to achieve net-zero carbon emissions by 2030​."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Church_of_St_Mary%2C_Bibury%2C_Gloucestershire_%28geograph_4661089%29.jpg/512px-Church_of_St_Mary%2C_Bibury%2C_Gloucestershire_%28geograph_4661089%29.jpg",
      "title": "Les Hull / Church of St Mary, Bibury, Gloucestershire",
      "caption": "The Church of St Mary in Bibury is an exceptional example of historic ecclesiastical architecture, embodying centuries of history. Likely established in the Saxon period, the church was first mentioned in the Domesday Book of 1086. It was associated with St Mary’s Priory in Worcester and later transferred to Osney Abbey near Oxford until the Dissolution of the Monasteries. The church showcases a blend of architectural styles. Its Saxon origins are visible in remnants of gravestones and the chancel columns, while Norman influences are evident in the doorway arches. The 13th-century modifications brought Gothic features, such as the square font and a distinctive chancel arch that uniquely combines Saxon and Gothic elements. The 15th-century additions include the striking timber roof and a large Perpendicular-style west window. Noteworthy too are the nine aumbry cupboards in the chancel, suggesting the church once housed a significant collection of valuables."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Arlington_Mill_in_Bibury_-_geograph.org.uk_-_1440332.jpg",
      "title": "Steve Daniels / Arlington Mill in Bibury",
      "caption": "Arlington Mill in Bibury. Arlington Mill is a historic 17th-century watermill by the River Coln. Originally built as a corn mill, it later played a role in Bibury's thriving wool trade, reflecting the Cotswolds’ rich industrial heritage. The mill's operation would have been powered by the river, and its proximity to Rack Isle—historically used for drying wool—ties it to the village's weaving and fabric-making past. Today, the mill is a private residence and no longer open to the public. However, its exterior remains an integral part of Bibury's charm, showcasing traditional Cotswold stone architecture and a beautiful riverside setting. Arlington Mill stands near other iconic locations like Arlington Row and the Rack Isle nature reserve, making it a key landmark in a village celebrated for its history and unspoiled beauty"
    }
  ],
  "distance_km": 10.0,
  "description": "This circular walk takes you around the delightful village of Bibury and the surrounding countryside. Bibury is a typically lovely Cotswolds village with pretty stone cottages and a wonderful Saxon church. This walk takes you through the village and then along a riverside footpath to the nearby village of Coln St Aldwyns. You'll follow the River Colne into the village before returning to Bibury through the countryside on footpaths and bridleways. You'll also pass the famous Arlington Row cottages, built in the 14th century. The picturesque dwellings are one of the most photographed Cotswold scenes. In Coln St Aldwyns you'll find an old mill house, a Norman church and a fine 16th century inn for refreshment. Near here you could also visit pretty Quenington with its large medieval dovecote and a Grade I listed church built mainly in the 11th century",
  "video_url": "https://www.youtube.com/embed/8y6hoNrf2Zo",
  "district": "Bibury",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England"
}