{
  "created_at": "2025-01-06T00:54:53.290511+00:00",
  "objectID": "d19d8e7c67e1d2e49e2d9860c0bb199b",
  "ref": "ilmington-walking-route",
  "title": "Circular Walk Around Ilmington Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Ilmington%2C_St._Marys%2C_Warwickshire.jpg/512px-Ilmington%2C_St._Marys%2C_Warwickshire.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d19d8e7c67e1d2e49e2d9860c0bb199b.gpx",
  "_geoloc": {
    "lat": 52.08899976,
    "lng": -1.69661521
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Ilmington%2C_St._Marys%2C_Warwickshire.jpg/512px-Ilmington%2C_St._Marys%2C_Warwickshire.jpg",
      "title": "saffron100_uk [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Ilmington, St. Marys Church. The building is Norman in origin, and parts of the twelfth century structure still survive, though the present cruciform church is largely the result of fourteenth century rebuilding"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Thatched_cottage_in_Ilmington_%28geograph_5121842%29.jpg",
      "title": "pam fray / Thatched cottage in Ilmington, via Wikimedia Commons",
      "caption": "Picturesque thatched cottage in Ilmington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/The_Howard_Arms%2C_Ilmington_-_geograph.org.uk_-_1468385.jpg",
      "title": "Kenneth Allen / The Howard Arms, Ilmington, via Wikimedia Commons",
      "caption": "The Howard Arms, Ilmington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/View_from_Knowlands_Hill_-_geograph.org.uk_-_100782.jpg",
      "title": "Philip Halling / View from Knowlands Hill, via Wikimedia Commons",
      "caption": "Foxcote House viewed from Knowlands Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Hidcote_Manor.jpg/512px-Hidcote_Manor.jpg",
      "title": "VashiDonsk at the English language Wikipedia [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Signature bird topiaries found in Hidcote Manor's gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/HIDCOTE_MANOR.JPG/512px-HIDCOTE_MANOR.JPG",
      "title": "HARTLEPOOLMARINA2014 [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "The manor house across the border"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Darlingscott_-_geograph.org.uk_-_92504.jpg",
      "title": "David Stowell / Darlingscott, via Wikimedia Commons",
      "caption": "Darlingscott House (left) and Lower Farmhouse (right), Darlingscott, near Tredington, Warwickshire. This view looks northeast where the lane from Blackwell enters the hamlet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/The_Dower_House%2C_Ilmington_-_geograph.org.uk_-_1467286.jpg",
      "title": "Kenneth Allen / The Dower House, Ilmington, via Wikimedia Commons",
      "caption": "The Dower House, Ilmington"
    }
  ],
  "distance_km": 17.0,
  "description": "This walk from Ilmington makes use of three waymarked trails to create a fine circular route through the countryside surrounding the Cotswolds village. You'll follow sections of the Warwickshire Centenary Way, the Monarch's Way and the Cotswolds Link on this 10 mile tour of this lovely area of the Cotswolds. The walk starts in Ilmington at the noteworthy St. Marys church which is Norman and dates from about the middle of the 12th century. You pass through the pretty village with its thatched cottages and fish ponds, heading west into the countryside along the Warwickshire Centenary Way. At Admington you turn south along the Monarch's Way towards Hidcote Manor. The National Trust run gardens were created by American horticulturist, Major Lawrence Johnston and contain a number of beautifully designed outdoor 'rooms'. Highlights include the kitchen garden, plant house, herbaceous borders and the orchard. At the manor you pick up the Cotswold Link and follow it east along a series of bridleways. You'll pass Nebsworth and Knowlands Hill before coming to Darlingscott. The route turns north east here, taking you to Glebe Farm where you pick up the Centenary Way again and follow it west through Blackwell to Ilmington. After your exercise head to the Howard Arms Pub for some well earned refreshments. Peacefully overlooking the old chestnut tree on the green, it lies in the heart of the village at postcode CV36 4LT. It also includes a delightful beer garden where you can relax outside in the summer months. Just to the south of the route you can extend your walk by visiting Ebrington Hill and the Foxcote Estate. It's a lovely area with pretty streams, woodland and a lake near to the house. Look out for wildlife including buzzards, pheasants and deer.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's some nice places to eat in Ilmington but one of the finest pubs in the country is located just to the south in the village of Ebrington. Here you'll find The Ebrington Arms an award winning pub which does excellent food and is set in a wonderful village location with fine views of the surrounding Cotswolds countryside. It's a special place and was recently voted the UK's number 1 village pub by The Times. The inn also has an interesting history, with its charming stone building dating all the way back to the 1640s. Inside there's period pieces including wooden fireplaces and beamed ceilings. You can find it in the village on May Lane at a postcode of GL55 6NH for your sat navs. The pub is also very dog friendly and can provide treats for your pet."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Follow the Warwickshire Centenary Way south east and it will take you to Tredington and the neighbouring town of Shipston on Stour. Near here is the worthy village of Tysoe where you could enjoy a climb to the Tysoe Windmill. The photogenic old mill sits on top of a 184 metre hill with excellent views over the Cotswolds. Just to the north east there's Ettington Park to explore. Here you'll find a Grade I listed Victorian mansion surrounded by 40 acres of lovely parkland with well laid out gardens, an Orangery, an ancient Norman Chapel and views of the River Stour. For more walking ideas in the area see the Warwickshire Walks and Cotswolds Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/w24Miqwwtac",
  "postcode": "CV36 4LJ",
  "district": "Stratford-on-Avon",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Back Street, Ilmington CP, Stratford-on-Avon, Warwickshire, England, CV36 4LJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "natural areas"
  ],
  "facilities": [
    "pub/cafe",
    "beer garden",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}