{
  "objectID": "d1cabfe0de094f88d0210e237c45b6c1",
  "created_at": "2024-12-18T21:54:21.526016+00:00",
  "ref": "reigate-hill-and-gatton-park-walking-route",
  "title": "Reigate Hill and Gatton Park Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Sunrise_at_Reigate_Hill_-_geograph.org.uk_-_603818.jpg",
  "nearby": [
    {
      "description": "Colley Hill",
      "objectID": "330c2b129f9e085e7ea900828eba9f24",
      "ref": "colley-hill-walking-route"
    },
    {
      "description": "Reigate and Banstead Millennium Trail",
      "objectID": "a43ef41680490a2489ea84e47e05c346",
      "ref": "reigate-and-banstead-millennium-trail-walking-route"
    },
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Reigate Heath",
      "objectID": "f83d9593621fb4bd90df754cd5f4ff10",
      "ref": "reigate-heath-walking-route"
    },
    {
      "description": "Redhill and Earlswood Common",
      "objectID": "75a32500553f115f1ccc78d63f8bead7",
      "ref": "redhill-and-earlswood-common-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/0C8FF176930F9D1980257F36005412A5/$FILE/Reigate Hill and Gatton Park.gpx",
  "_geoloc": {
    "lat": 51.2564606896,
    "lng": -0.1914849608
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Sunrise_at_Reigate_Hill_-_geograph.org.uk_-_603818.jpg",
      "title": "Ian Capper / Sunrise at Reigate Hill, via Wikimedia Commons",
      "caption": "The view from Reigate Hill car park at sunrise, with Reigate and the Priory Park ridge in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Milestone_on_Reigate_Hill_-_geograph.org.uk_-_726242.jpg",
      "title": "Ian Capper / Milestone on Reigate Hill, via Wikimedia Commons",
      "caption": "Milestone on Reigate Hill. Situated on the A217 north out of Reigate, this limestone milestone dates from the early 19th century and is Grade II listed. On the south face (visible) is written London 20, Sutton 9, and on the east face Brighton 31 5/8, Reigate 5/8."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Reigate_Hill_masts_-_geograph.org.uk_-_1133373.jpg",
      "title": "Ian Capper / Reigate Hill masts, via Wikimedia Commons",
      "caption": "Reigate Hill masts. Viewed from the upper slopes of Reigate Hill, in an area below Reigate Fort now cleared of scrub to recreate open downland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/The_Viaduct%2C_Gatton_Park-geograph-2307765.jpg",
      "title": "Ian Capper / The Viaduct, Gatton Park, via Wikimedia Commons",
      "caption": "The Viaduct, Gatton Park. Part of the restored gardens at Gatton Park, this bridge is known to have existed in 1780, and may have been part of the Capability Brown design of the parkland. Grade II listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Bridleway%2C_Gatton_Park_-_geograph.org.uk_-_1320004.jpg",
      "title": "Peter Trimming / Bridleway, Gatton Park, via Wikimedia Commons",
      "caption": "Gatton Park. View along the bridleway, with Nut Wood to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Gatton_Park_-_geograph.org.uk_-_872807.jpg",
      "title": "Ian Capper / Gatton Park, via Wikimedia Commons",
      "caption": "This newly restored track is on the route from Gatton Park towards the lodge on Croydon Road, leading on to Reigate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Hop_Garden_Pond%2C_Gatton_Park_-_geograph.org.uk_-_1319827.jpg",
      "title": "Peter Trimming / Hop Garden Pond, Gatton Park, via Wikimedia Commons",
      "caption": "Hop Garden Pond, Gatton Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Bridge_near_Rock_Garden%2C_Gatton_Park%2C_Reigate_-_geograph.org.uk_-_1242838.jpg",
      "title": "Richard Rogerson / Bridge near Rock Garden, Gatton Park, Reigate, via Wikimedia Commons",
      "caption": "Bridge near Rock Garden, Gatton Park. Reigate Gatton Park is a 250-acre estate near Reigate, Surrey. The park was landscaped by \u0093Capability\u0094 Brown in the 1760s. The bridge formed part of a circular walk around the park."
    }
  ],
  "distance_km": 9.5,
  "description": "This circular walk explores Reigate Hill and Gatton Park in the North Downs. It's a great area for walking with the North Downs Way and other good footpaths to follow. The area of chalk download includes woodland trails and grassland with wildflowers. You can also enjoy lovely views over Gatton Park. It was landscaped in the mid-18th century by Lancelot Capability Brown and includes several ponds and a large, picturesque lake. You start off at the Wray Lane car park and follow woodland paths towards Gatton Park. There's a super viewpoint over the park and the Serpentine Lake, Japanese Garden, Rock Garden and Walled Garden.  Shortly after you come to the fascinating stone circle. They were constructed to celebrate the turn of the millennium with each stone representing a 200 year time period and inscribed with quotes and poems of the era. The next section takes you through open parkland of Gatton Park before a woodland section through Nut Wood returns you to the car park. From here you then head west to visit Colley Hill and Reigate Hill. Here you'll pass the historic Reigate Fort which was used from Napoleonic times to WW2. There's fine views from the elevated position of the hill towards South London and the North Downs. If you'd like to extend your walk you could climb Colley Hill which is about a mile to the west. You could also pick up the Reigate and Banstead Millennium Trail or continue along the North Downs Way . Reigate Heath is another good option with its pretty heathland, grassland and old windmill.",
  "video_url": "https://www.youtube.com/embed/GMGD6bIbbXw",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}