{
  "created_at": "2025-01-06T08:11:14.954264+00:00",
  "objectID": "d1fdaebb691313b8fe16c12c4398543e",
  "ref": "truro-walking-route",
  "title": "Truro Walks - City and River",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Truro_Cathedral_-_geograph.org.uk_-_905437.jpg/256px-Truro_Cathedral_-_geograph.org.uk_-_905437.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d1fdaebb691313b8fe16c12c4398543e.gpx",
  "_geoloc": {
    "lat": 50.2637487519,
    "lng": -5.0513263266
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Truro_Cathedral_-_geograph.org.uk_-_905437.jpg/256px-Truro_Cathedral_-_geograph.org.uk_-_905437.jpg",
      "title": "Sarah Smith / Truro Cathedral",
      "caption": "Truro Cathedral. The cathedral was built on the site of the Parish Church of St Mary and the foundation stone was laid in 1880. The building was completed in 1910."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Truro_River_-_geograph.org.uk_-_1370008.jpg",
      "title": "Fred James / Truro River",
      "caption": "Truro River. View of the east shore showing housing along Malpas Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Boscawen_Park_-_geograph.org.uk_-_586055.jpg",
      "title": "Tony Atkin / Boscawen Park",
      "caption": "Boscawen Park. This park was built on an area of reclaimed marshland in the Truro Estuary"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Truro_River_-_geograph.org.uk_-_550053.jpg",
      "title": "Derek Harper / Truro River",
      "caption": "Truro River. Looking across the river from a small slipway on Newham Road. On the far side is Boscawen Park, beyond which trees follow the hedges alongside narrow fields across the hill below Little Park Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Truro_Cathedral_%283164614770%29.jpg/256px-Truro_Cathedral_%283164614770%29.jpg",
      "title": "Tim Green from Bradford, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Truro Cathedral and city as viewed from Boscawen Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/The_bathing_hut_at_Sunny_Corner_-_geograph.org.uk_-_945779.jpg",
      "title": "Fred James / The bathing hut at Sunny Corner",
      "caption": "The bathing hut at Sunny Corner. Built in the 1930s. Swimming was very popular here for a while but has declined lately."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Path_through_the_trees_below_the_Malpas_Road_-_geograph.org.uk_-_763082.jpg/256px-Path_through_the_trees_below_the_Malpas_Road_-_geograph.org.uk_-_763082.jpg",
      "title": "Rod Allday / Path through the trees below the Malpas Road",
      "caption": "Path through the trees below the Malpas Road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Malpas._The_Heron_Inn_-_geograph.org.uk_-_945789.jpg",
      "title": "Fred James / Malpas. The Heron Inn",
      "caption": "Malpas. The Heron Inn. Malpas was always called Mopus by locals in the past and was often written as such by local authors. The Heron Inn was formerly The Park Hotel."
    }
  ],
  "distance_km": 6.5,
  "description": "Truro is notable as Cornwall's only city and mainland Britain's southernmost city. It is well known for its Gothic-revival cathedral and some wonderful Georgian architecture. There's also some nice walks to be found with a local nature reserve, some nearby woods and easy riverside trails to enjoy. This walk takes you from the city centre, along the Truro River to nearby Malpas, visiting Boscawen park on the way. The walk starts from the 19th century cathedral and heads south along a footpath running along the river and the Malpas Road. Follow the paths south and they will take you to Boscawen Park. This pretty riverside park has some nice trails, wide lawns, formal floral bedding displays and good views back down the river to Truro. There's also some tennis courts and a cafe if you wish to stop for some refreshments. On the other side of the park there's Trennick Mill where you'll find a picturesque duck pond which is laid out to shrub and herbaceous borders and maintained with wildlife in mind. After exploring the park you can continue further south along the river to the village of Malpas. This riverside village sits in a pleasant spot at the confluence of the Truro River and the Tresillian River. There is a pub here where you could stop for a drink before retracing your steps to Truro. On the route look out for a variety of birds, particularly around the estuary at Malpas. You can see Egrets, Curlews, Ospreys and Grey Heron in this area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Malpas head to the Heron Inn Heron Inn for some refreshment. The Inn is in a splendid location, overlooking the river in the village. You can sit outside in the garden area and enjoy a view of the estuary with your meal. The inn can be found at Trenhaile Terrace with a postcode of TR1 1SL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trail is a nice one to do with your dog. You are asked to keep them on leads in the Boscawen Park area. The Heron Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the south of the city you will find Trelissick House and Gardens. The site is a lovely place for walking with a 300-acre estate to explore. There's beautiful gardens, peaceful woodland trails and fine views of the River Fal estuary to enjoy here. Also to the south is the wonderful Roseland Peninsula where there are miles of coastal trails. Also nearby you'll find Idless Woods. These peaceful woods have a series of good walking and cycling trails. Other features include an Iron Age hill fort, lots of pretty bluebells in the spring and views of the River Allen which runs through the area. You can reach the woods by following country lanes north past the Daubuz Moors Nature Reserve to Idless. It's about a 2 mile walk from the city centre. Just a few miles to the north east you'll find the little village of Ladock and Ladock Woods. It's a serene place with pleasant woodland trails and some nice views of the Tresillian River in the village. The village also includes a 17th century pub which is worthy of some investigation. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dFpVuOPzYjM",
  "postcode": "TR1 2QS",
  "district": "Truro",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Godolphin House, 7-8, Cathedral Lane, Moresk, Truro, Cornwall, England, TR1 2QS, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "woodland"
  ],
  "points_of_interest": [
    "park",
    "river"
  ],
  "facilities": [
    "cafe",
    "pub",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "bird watching"
  ]
}