{
  "created_at": "2025-01-06T00:31:43.934222+00:00",
  "objectID": "d2c6b68acfdd851ba402c618b1842482",
  "ref": "newmarket-walking-route",
  "title": "Newmarket Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Warren_Towers%2C_Newmarket_-_geograph.org.uk_-_1394221.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d2c6b68acfdd851ba402c618b1842482.gpx",
  "_geoloc": {
    "lat": 52.244758159,
    "lng": 0.4074245284
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Warren_Towers%2C_Newmarket_-_geograph.org.uk_-_1394221.jpg",
      "title": "Bob Jones / Warren Towers, Newmarket",
      "caption": "Warren Towers, Newmarket. Leading racehorse owner Sheikh Mohammed inherited Warren Towers; it has been redeveloped during the past twenty years and is now said to accommodate more than 80 people. The original mansion was a Barnardo Home during the Second World War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Devil%27s_Dyke_and_the_July_Course%2C_Newmarket_-_geograph.org.uk_-_189834.jpg",
      "title": "Bob Jones / Devil's Dyke and the July Course, Newmarket",
      "caption": "Devil's Dyke and the July Course. The Devil's Dyke, a designated SSSI, stretches in a near perfect straight line for 12 km from the Fen edge at Reach, across the open chalk landscape near Newmarket and towards the more wooded landscape on the clay ridges, ending at Ditton Green. It reaches to around 4 metres below present ground level and up to 6 metres above. Although privately-owned, a public footpath runs along its length. Here, the Dyke runs adjacent to the July Course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Racehorse_statue_at_Newmarket_-_geograph.org.uk_-_25663.jpg",
      "title": "Bob Jones / Racehorse statue at Newmarket",
      "caption": "Racehorse statue. This statue has been erected on the roundabout which marks the entrance to Newmarket racecourse. The road in the distance is the A1304 towards Cambridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Devil%27s_Ditch_near_Newmarket%2C_Suffolk_-_geograph.org.uk_-_49045.jpg",
      "title": "mike / Devil's Ditch near Newmarket, Suffolk",
      "caption": "Devil's Ditch. Taken from on top of the Anglo Saxon earthwork, looking SE. The railway and B1061 road run left to right across the centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/The_Stetchworth_War_Memorial_in_Church_Lane_-_geograph.org.uk_-_1442689.jpg",
      "title": "Robert Edwards / The Stetchworth War Memorial in Church Lane",
      "caption": "The Stetchworth War Memorial in Church Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/New_River_-_geograph.org.uk_-_380305.jpg",
      "title": "Bob Jones / New River",
      "caption": "New River. The New River rises from springs on the margins of the chalk uplands, near Newmarket. Also known as Monks' Lode, it helps to drain the low-lying fenland into the River Cam and thence into the Great Ouse. Here, east of Wicken, it is crossed by a public footpath over a wide unfenced footbridge. There are also footpaths along either bank; the one on the far side is on land managed by the National Trust as part of the Wicken Fen National Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Newmarket%2C_The_Jockey_Club_-_geograph.org.uk_-_882045.jpg",
      "title": "Nigel Cox / Newmarket: The Jockey Club",
      "caption": "The front façade of the Jockey Club building on Newmarket High Street. Outside is a sculpture of Hyperion the renowned horse that won the Derby in 1933. Contrary to some public misconceptions the Jockey Club is not a club for horse-racing jockeys. It was founded in 1752 as a private members' club and many of its members have been and are prominent racehorse owners. Through the patronage of these members it became the main governing body in horseracing, concerning itself, amongst other matters, with rules of conduct, the licensing of racecourses, jockeys and trainers, and the health and safety of riders and horses. However in 2006, during a major reorganization of the horseracing industry, it voluntarily passed some of these regulatory responsibilities to the new Horseracing Regulatory Authority. In 2007 the latter body itself ceased to exist and all regulatory matters passed to the British Horseracing Authority. Since 2006 the Jockey Club has concentrated on the commercial aspects of running its racecourses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Newmarket%2C_The_Palace_House_-_geograph.org.uk_-_881938.jpg",
      "title": "Nigel Cox / Newmarket: The Palace House",
      "caption": "The Palace House in the town. Looking for all the world like a 1980s office building the lower two storeys of this building are the main surviving remnants of King Charles II's Royal Palace, built in 1671 when he patronized Newmarket and its horse racing activities. This fact is borne out by the details on the stone tablet below the middle window. Unfortunately most of the palace was demolished in Regency times. Indeed this was history repeating itself because both King James I and King Charles I, the grandfather and father of Charles II, also patronized Newmarket and James built a large palace here only for it to be razed to the ground during the Cromwellian era. The Palace House is now the local tourist office."
    }
  ],
  "distance_km": 8.0,
  "description": "This walk uses sections of the Stour Valley Path and Icknield Way Path long distance trails to take you past the famous racecourse and into the countryside surrounding the Suffolk town of Newmarket. The walk begins in the centre of town, near the tourist information centre and the former palace of Charles II. You then pick up the waymarked Stour Valley Path and follow it south west along the racecourse. Look out for thoroughbred horses galloping on the exercise track. The route turns south east along the Devil's Dyke, with nice countryside views and a short woodland section. The Devil's Dyke is the largest of several earthworks in south Cambridgeshire which were designed to control movement along the ancient Roman roads. It is over 7 miles (11 km) long and is the largest of a series of ancient Cambridgeshire dykes. The route then finishes at the village of Stetchworth. Before or after your walk be sure to visit the fascinating National Horseracing Museum in the town. It tells the story of horse racing from its earliest origins to the world-wide phenomenon it is today. This is explored through works of art, silver, bronzes and artifacts including silks worn by famous jockeys such as Lester Piggott and Frankie Dettori. You can find it on Palace Street at postcode CB8 8EP for your sat navs.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town The Bull is a good choice for post walk refreshment. It's a historic pub dating back to the 18th century and includes a large garden area for sunny days. You can find them on the High Street at postcode CB8 8LB for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue south along the Icknield Way you could visit the nearby villages of Burrough Green and Brinkley. You could also turn this route into a longer circular walk by following the trail back into Newmarket along the Woodditton Road. Newmarket is located only a few miles east of Cambridge. Here you can try the popular Cambridge Backs Walk and explore the historic university buildings of the famous city. To the east is Bury St Edmunds where you can visit the splendid Ickworth Park and Nowton Park. Mildenhall, Cavenham Heath and the splendid ancient watermill at Tuddenham are just to the north east. Just to the east is idyllic Moulton where you can enjoy views of the River Kennet, visit the fine 14th century church and photograph the splendid medieval Packhorse Bridge. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ls8nwRTf2iQ",
  "postcode": "CB8 8LF",
  "district": "Newmarket",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}