{
  "created_at": "2025-01-06T01:06:25.017677+00:00",
  "objectID": "d2ecadc83a2be47aca2864734ae24bd2",
  "ref": "millington-woods-walking-route",
  "title": "Millington Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Post_at_Millington_Pastures-_Wood_-_geograph.org.uk_-_1476029.jpg",
  "nearby": [
    {
      "description": "Minster Way",
      "objectID": "27c22b8c3ab40d27b053a9bb80337b34",
      "ref": "minster-way-walking-route"
    },
    {
      "description": "Yorkshire Wolds Way",
      "objectID": "3857d94bed0386c563af9fd8be850748",
      "ref": "yorkshire-wolds-way-walking-route"
    },
    {
      "description": "Pocklington Canal",
      "objectID": "5daf2488bb0abf0309563fd5cee39f83",
      "ref": "pocklington-canal-walking-route"
    },
    {
      "description": "Stamford Bridge",
      "objectID": "57936c3f6afc3a6cf113c8a7949b42fe",
      "ref": "stamford-bridge-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d2ecadc83a2be47aca2864734ae24bd2.gpx",
  "_geoloc": {
    "lat": 53.9661631228,
    "lng": -0.7238006129
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Post_at_Millington_Pastures-_Wood_-_geograph.org.uk_-_1476029.jpg",
      "title": "Gary Allan D / Post at Millington Pastures/ Wood, via Wikimedia Commons",
      "caption": "From Millington Woods to Millington Village. Post at Millington Pastures/ Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/From_Millington_Woods_to_Millington_Village_-_geograph.org.uk_-_728836.jpg",
      "title": "Peter Church / From Millington Woods to Millington Village, via Wikimedia Commons",
      "caption": "A further ancient pathway can be seen descending across the pasture in the top-centre of the photograph; this descends from the Minster Way and joins the Roman Road. Millington was probably one of the early settlements as it had, unusually for the Yorkshire Wolds, springs which gave rise to Millington Beck and a ready supply of running water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Track_through_Millington_Woods_-_geograph.org.uk_-_1563587.jpg",
      "title": "JThomas / Track through Millington Woods, via Wikimedia Commons",
      "caption": "Track through the woods with autumn leaves showing"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Millington_Wood_-_geograph.org.uk_-_555653.jpg/256px-Millington_Wood_-_geograph.org.uk_-_555653.jpg",
      "title": "bernard bradley / Millington Wood, via Wikimedia Commons",
      "caption": "Western flank of Lily Dale. View from the footpath in Millington Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Millington_Wood_-_geograph.org.uk_-_555688.jpg/256px-Millington_Wood_-_geograph.org.uk_-_555688.jpg",
      "title": "bernard bradley / Millington Wood, via Wikimedia Commons",
      "caption": "Descending woodland track leading out of the wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Track_through_Millington_Wood_-_geograph.org.uk_-_555659.jpg/256px-Track_through_Millington_Wood_-_geograph.org.uk_-_555659.jpg",
      "title": "bernard bradley / Track through Millington Wood, via Wikimedia Commons",
      "caption": "Track in the summer"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Staghorn_Fungus_in_Millington_Wood_-_geograph.org.uk_-_638148.jpg/256px-Staghorn_Fungus_in_Millington_Wood_-_geograph.org.uk_-_638148.jpg",
      "title": "bernard bradley / Staghorn Fungus in Millington Wood, via Wikimedia Commons",
      "caption": "Staghorn Fungus"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Herb_Robert_in_Millington_Wood_-_geograph.org.uk_-_555693.jpg/256px-Herb_Robert_in_Millington_Wood_-_geograph.org.uk_-_555693.jpg",
      "title": "bernard bradley / Herb Robert in Millington Wood, via Wikimedia Commons",
      "caption": "Herb Robert, an example of the interesting flora in the wood"
    }
  ],
  "distance_km": 1.5,
  "description": "Visit these delightful woods in the Yorkshire Wolds on this short walk near Pocklington. The site consists of the best ancient ash woods in the Yorkshire Wolds. You can also enjoy carpets of bluebells, giant bellflowers and the scent of wild garlic. There's a nice surfaced walking trail running from the car park to a view point where you can admire a fine panoramic view across the treetops. The Minster Way and the Yorkshire Wolds Way both run past the woods so you could pick up these long distance footpaths to extend your walk. You could then explore the lovely Sylvan Dale and Millington Dale which are right next to the woods. You could actually reach the woods by following the Wolds Way from Pocklington. National Cycle Network Route 164 also runs to the woods from Pocklington so it's easy to cycle there too. There's also a car park just off Wood Gate Road at the southern end of the site.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into the little village of Millington and visit the charming Gait Inn for some refreshments after your walk. The pub has a delightful large garden area to relax in on warmer days. There's a good selection of drinks, a fine menu and a friendly atmosphere too. The pub also has an interesting history, dating from the 16th century. They provide accommodation in the shape of two pretty cottages so you can stay over if you need to. You can find the pub in the pretty little village with a postcode of YO42 1TY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are a lovely place for a dog walk and the Gait Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to follow the Wolds Way south from the woods and visit Londesborough Park. You can follow the waymarked trail all the way to the park where you'll find pretty streams, pockets of woodland and two small lakes. Allerthorpe Woods are also located close to the site, and have some nice walking trails to try. In Pocklington we recommend a visit to the very pretty Burnby Hall Gardens. It's a lovely place for an afternoon stroll with landscaped gardens and two lakes. The park is notable for over 100 types of water lilies displayed in the lakes where you can also feed the fish. There's also an ornamental bridge, a Victorian Garden, an Aviary Garden, a newly restored Edwardian Rock Garden, a Stumpery, and a Birch Walk, the latter being the most recent horticultural addition. You can find out about the history of the area in the Stewart Museum. It houses a fascinating collection of artefacts collected by Major Stewart on eight world tours that were undertaken between 1906 and 1926, several of which have been deemed by UNESCO as being of national and international importance. Afterwards visit the cafe where you can enjoy refreshments with a view. You can find the park in the town centre with a postcode of YO42 2QF for your sat navs.  Burnby Hall - Victorian Gardens and Dragonfly Pond To Bishop Wilton Walk starts from the neighbouring village and visits the woods by following the Minster Way. The pretty village includes a Grade I listed medieval church and the highest point in the Wolds at the nearby Garrowby Hill. Just to the south is Kilnwick Percy where you can visit the noteworthy Kilnwick Percy Hall. The Grade II listed hall is now a peaceful meditation centre with woodland walks, a lake, a cafe and tours of the historic house."
    }
  ],
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Millington Woods, Millington, East Riding of Yorkshire, England, YO42 1TZ, United Kingdom",
  "postcode": "YO42 1TZ",
  "district": "Millington",
  "state": "England"
}