{
  "created_at": "2025-01-06T00:55:55.527537+00:00",
  "objectID": "d2f7dc7a367c89e53d0ee9945141c3e2",
  "ref": "rudston-walking-route",
  "title": "Rudston Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Long_Street%2C_Rudston_-_geograph.org.uk_-_464171.jpg",
  "nearby": [
    {
      "description": "Bridlington to Flamborough Head Coastal Walk",
      "objectID": "8eaa8953fa758bb53a88ac88a3353cbf",
      "ref": "bridlington-to-flamborough-head-coastal-walk-walking-route"
    },
    {
      "description": "Barmston and Fraisthorpe To Bridlington Beach Walk",
      "objectID": "fcb90d1194c9c771b4dd731cdc29efed",
      "ref": "barmston-and-fraisthorpe-to-bridlington-beach-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d2f7dc7a367c89e53d0ee9945141c3e2.gpx",
  "_geoloc": {
    "lat": 54.0941009765,
    "lng": -0.3221136468
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Long_Street%2C_Rudston_-_geograph.org.uk_-_464171.jpg",
      "title": "Paul Glazzard / Long Street, Rudston",
      "caption": "Looking north from the corner of Long Street and East Gate in the picturesque village of Rudston, famed for its Roman Villa and Neolithic monolith."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Rudston_Monolith_-_geograph.org.uk_-_464142.jpg/256px-Rudston_Monolith_-_geograph.org.uk_-_464142.jpg",
      "title": "Paul Glazzard / Rudston Monolith",
      "caption": "Rudston Monolith, Rudston, East Riding of Yorkshire, England. Neolithic standing stone in the churchyard at the Parish Church of All Saints, Rudston. At 7.5 metres high it is said to be the tallest standing stone remaining in England and as the churchyard was raised by 1.5 metres in 1861, more of it was probably above ground in the past. The stone is basically a huge slab of moor grit conglomerate which is found naturally about 16 kilometres north of here, inland of Whitby. Some think it was brought here by Neolithic people but it seems just as likely it was carried here by the same glacial action which carved out the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Footpath_at_Rudston_-_geograph.org.uk_-_1408756.jpg",
      "title": "Dr Patty McAlpin / Footpath at Rudston",
      "caption": "This shows the start of the public footpath from Rudston towards Zigzag plantation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Passing_South_Side_Plantation_-_geograph.org.uk_-_1408838.jpg",
      "title": "Dr Patty McAlpin / Passing South Side Plantation",
      "caption": "Beyond Zigzag Plantation the public bridleway continues its ascent past South Side Plantation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Rudston_Cursus_-_geograph.org.uk_-_1863.jpg",
      "title": "Paul Allison / Rudston Cursus",
      "caption": "Looking West from the road running North - south. The chalky stripe running across the photo is the remains of one of four Neolithic Cursuses found centred on this village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/All_Saints_Church%2C_Rudston_-_geograph.org.uk_-_505862.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Rudston's All Saints Church is nearly as famous as the Monolith attracting hundreds of visitors each year. It has a 12th Century chancel arch and a Norman tower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Gypsey_Race.jpg/256px-Gypsey_Race.jpg",
      "title": "Paul Glazzard / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The Gypsey Race near the corner of Middle Street and Marton Lane, Rudston. This intermittent and irregular watercourse is believed to be affected by a siphoning action in underground reservoirs and can come into flood apparently regardless of recent rainfall in the local vicinity. This seemingly magical property is thought to be responsible for the number of significant neolithic sites along its course, including the Rudston monolith and the ancient burial mound of Duggleby Howe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/East_Gate_Bridge_at_Rudston.jpg",
      "title": "Dr Patty McAlpin / East Gate Bridge at Rudston",
      "caption": "The Gypsey Race flows beneath East Gate Bridge at Rudston. The Gypsey Race is the only (albeit intermittent) surface stream on the high Wolds and reaches the sea at Bridlington."
    }
  ],
  "distance_km": 6.5,
  "description": "A circular walk around the East Riding of Yorkshire village of Rudston visiting the Rudston Monolith and the countryside to the south east of the village. The pretty village is located just east of the coast near Bridlington. It's well known for it's ancient monolith and adjacent Grade I listed church. There's also nice views of the Gypsey Race, a pretty stream which runs through the village. The route starts in the village at the ancient monolith which is located in the churchyard of the Norman church. The stone stands at a height of just under 8 metres and dates to the Late Neolithic or Early Bronze Age period. It's a photogenic spot which attracts many visitors each year. From the village you then head south east to visit the woodland of the Zigzag Plantation and the South Side Plantation. There's some nice bridleways around here with good views of the surrounding countryside. You can follow them south past the woodland to the Roman Road before returning on alternative path to create a circular walk.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head east to the coast and try the Bridlington to Flamborough Head Coastal Walk. The trail passes Sewerby Park before coming to the headland where you can look out for a wide variety of sea birds. If you head south of the village you can visit the market town of Driffield and try the Driffield Canal Walk which takes you along the recently restored waterway. For more walks in the area see the Yorkshire Wolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Emf6r7utkxY",
  "postcode": "YO25 4UY",
  "district": "Rudston",
  "county": "East Riding of Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}