{
  "created_at": "2025-01-06T01:46:50.311150+00:00",
  "objectID": "d37497466d6d178bfa6bb50dafc1fb2a",
  "ref": "kings-langley-walking-route",
  "title": "Kings Langley Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/66/Kings_Langley_Common_-_geograph.org.uk_-_69834.jpg",
  "nearby": [
    {
      "description": "Grand Union Canal Walk",
      "objectID": "dae6d837fcdb83dc44e94da2b24b4040",
      "ref": "grand-union-canal-walk-walking-route"
    },
    {
      "description": "Chipperfield Common",
      "objectID": "975cde8ec9cf04c9a8ddc73aae1a02f6",
      "ref": "chipperfield-common-walking-route"
    },
    {
      "description": "Hemel Hempstead",
      "objectID": "ac86a5e6ae17f72bb4b531891ee03106",
      "ref": "hemel-hempstead-walking-route"
    },
    {
      "description": "Hertfordshire Way",
      "objectID": "122beca6a3afb5c24d0ef76fc7326e27",
      "ref": "hertfordshire-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d37497466d6d178bfa6bb50dafc1fb2a.gpx",
  "_geoloc": {
    "lat": 51.7151489398,
    "lng": -0.4584207192
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Kings_Langley_Common_-_geograph.org.uk_-_69834.jpg",
      "title": "Nigel Cox / Kings Langley Common",
      "caption": "Kings Langley Common. Viewed looking north eastwards from Love Lane, the red netting surrounds the cricket pitch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Kings_Langley%2C_Site_of_the_former_Royal_Palace_-_geograph.org.uk_-_1338218.jpg",
      "title": "Nigel Cox / Kings Langley: Site of the former Royal Palace",
      "caption": "Kings Langley, Site of the former Royal Palace. The former Royal Palace at Kings Langley was built under the supervision of Eleanor of Castile (1241 - 1290), wife of King Edward I. It appears to have been started around 1276 and to have been completed by 1299. This is how the village of Langley got its epithet Kings. Edmund de Langley, the first Duke of York and fifth son of King Edward III, was born here in 1341. Around 1349, during the outbreak of plague, known as the Black Death, King Edward III used the Royal Palace as his seat of government away from London. The Palace seems to have fallen into disuse during the Wars of the Roses, and was demolished around 1469. Apart from occasional underground finds during construction works for the nearby Rudolf Steiner school nothing remains of the former structure. The Ordnance Survey 1:10,000 scale map shows the centre of the site to be in the rear gardens of the houses in the photograph, probably the second house from the right being where the actual symbol is. This photograph was taken from the footpath leading south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Kings_Langley%2C_The_Nap_-_geograph.org.uk_-_1336559.jpg",
      "title": "Nigel Cox / Kings Langley: The Nap",
      "caption": "Kings Langley, The Nap. The Ordnance Survey 6\" to the mile map of 1883 shows this road as the intriguingly named \"The Nap\", leading down from the High Street via Mill Lane to Langley Waterside. A street nameboard can just be seen in front of the yellow salt bin on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Kings_Langley%2C_The_Church_House_-_geograph.org.uk_-_1334222.jpg",
      "title": "Nigel Cox / Kings Langley: The Church House",
      "caption": "The Church House is on the other side of Church Lane to All Saints' parish church, and was built in 1826. The chequered patterns on the elvations have been created by using brick and flints. The building is currently in use as offices."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Kings_Langley%2C_High_Street_-_geograph.org.uk_-_1337871.jpg",
      "title": "Nigel Cox / Kings Langley: High Street",
      "caption": "High Street. At one time this road formed a section of the Sparrows Herne turnpike that ran between London and Aylesbury from 1762 to 1872. It later became part of the busy arterial A41 trunk road, but with the opening of the Kings Langley Bypass to the west of the village, the road was downgraded to the A4251 and now only carries local traffic."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Canalbank%2C_Kings_Langley_-_geograph.org.uk_-_1511571.jpg",
      "title": "Colin Smith / Canalbank, Kings Langley",
      "caption": "Canalbank. Modern houses at Kings Mead backing onto the Grand Union Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Housing_development_and_Canal_and_footbridge_at_Kings_Langley_-_geograph.org.uk_-_27968.jpg",
      "title": "Jack Hill / Housing development and Canal and footbridge at Kings Langley",
      "caption": "Housing development and Canal and footbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Narrowboat_at_Kings_Langley_-_geograph.org.uk_-_1511677.jpg",
      "title": "Colin Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Narrowboat negotiating the lock on the Grand Union Canal at the south end of the village."
    }
  ],
  "distance_km": 4.2,
  "description": "This attractive Hertfordshire based village has some nice canal and country trails to try. The settlement is also close to the Chilterns where there are numerous walking routes available. This circular walk from the village visits Kings Langley Common and a particularly lovely section of the Grand Union Canal which runs past the eastern side of the village. The walk starts on the green space on the common and then heads east through the village to link up with the canal. You can follow the towpath south passing weirs, locks and a small fishing lake. The route then heads west along part of the Hertfordshire Way and then north to pass the site of the former Royal Palace and the Rudolf Steiner School. From here it is a short strol back to the common where the walk finishes. The route passes very close to Kings Langley train station at its south eastern tip. This could make an alternative start point if you are coming by public transport.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rose and Crown is a good choice for some post walk refreshment. They serve good quality food and have a nice courtyard to sit out in during the summer months. There's a cosy interior too with open fires and wooden beams. You can find them at 60 High St, WD4 9HT."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west of the village there's a series of nice trails around the pretty Chipperfield Common to try. You could also follow the canal towpath north to visit Hemel Hempstead. For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iwa3XFzgA9U",
  "district": "Dacorum",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Kings Langley Cricket Club, Vicarage Lane, Rectory Farm, Kings Langley, Dacorum, Hertfordshire, England, WD4 9HR, United Kingdom",
  "postcode": "WD4 9HR",
  "state": "England"
}