{
  "created_at": "2025-01-06T04:42:41.084050+00:00",
  "objectID": "d381d840a95bb1dffa99966661feff05",
  "ref": "pendle-hill-walk-from-sabden-walking-route",
  "title": "Pendle Hill Walk From Sabden Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Main_Street%2C_Sabden_-_geograph.org.uk_-_59187.jpg",
  "nearby": [
    {
      "description": "Waddington",
      "objectID": "7207b20575fbab1ef8d038624d384989",
      "ref": "waddington-walking-route"
    },
    {
      "description": "Sawley",
      "objectID": "ccc73a07c553d064972fbb2f5cac7aa3",
      "ref": "sawley-walking-route"
    },
    {
      "description": "Barley",
      "objectID": "6ce3b9f081b30c561e4815636d1273e2",
      "ref": "barley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d381d840a95bb1dffa99966661feff05.gpx",
  "_geoloc": {
    "lat": 53.8352450784,
    "lng": -2.3357410842
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Main_Street%2C_Sabden_-_geograph.org.uk_-_59187.jpg",
      "title": "Mike and Kirsty Grundy / Main Street, Sabden",
      "caption": "Main Street, Sabden. Village in the shadow of Pendle Hill. Famous for many things including the Pendle witches and an alleged treacle mine. The local handloom weavers of old were said to weave parkin using oatmeal as the warp and treacle as the weft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Churn_Clough_Reservoir_nr_Sabden_-_geograph.org.uk_-_59200.jpg",
      "title": "Mike and Kirsty Grundy / Churn Clough Reservoir nr Sabden",
      "caption": "Churn Clough Reservoir near Sabden. Nestling under Pendle Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Pendle_Hill_-_geograph.org.uk_-_899996.jpg",
      "title": "Gerald England / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The view towards Sabden from the Nick of Pendle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Pendle_Hill_-_geograph.org.uk_-_71650.jpg",
      "title": "Jon Royle / Pendle Hill",
      "caption": "Taken from the Nick'o'Pendle looking NNE across Pendleton Moor onto Mearley Moor, the southwest end of Pendle Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Nick_of_Pendle_and_Sabden_-_geograph.org.uk_-_1297579.jpg",
      "title": "Richard Johnson / Nick of Pendle and Sabden",
      "caption": "Nick of Pendle and Sabden Forest of Pendle. View from Car Park at Padiham Heights"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Black_Hill_Trig_Point_on_a_fine_day_-_geograph.org.uk_-_340626.jpg",
      "title": "John Darch / Black Hill Trig Point on a fine day",
      "caption": "Black Hill Trig Point on a fine day Pendle Hill in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/On_Pendle_Hill_-_geograph.org.uk_-_30876.jpg",
      "title": "Richard Webb / On Pendle Hill",
      "caption": "On Pendle Hill. Looking up the final gentle slopes to the summit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/View_over_Barley_from_the_summit_of_Pendle_Hill_-_geograph.org.uk_-_1538944.jpg",
      "title": "Dr Neil Clifton / View over Barley from the summit of Pendle Hill",
      "caption": "View over Barley from the summit of Pendle Hill"
    }
  ],
  "distance_km": 9.5,
  "description": "This walk climbs to Pendle Hill from the village of Sabden in Lancashire. The village is located a few miles south west of the hill summit and makes for an alternative start point to the Pendle Hill walk from Barley. It's about a 3 mile walk from the village so roughly 6 miles there and back. The walk starts in the village and follows footpaths north, passing Calf Hill and Churn Clough Reservoir. You continue past Badgers Well Water and Chartist's Well where you turn north east to Badgers Well Hill. The route continues past Black Hill, Pendle Moor and Ogden Clough before coming to the hill summit which stands at a height of 557 metres (1,827 ft). From here there are wonderful views over the South Pennines to the east, the Bowland Fells to the northwest, and the West Pennine Moors to the south. This walk starts from the village but you could also start from the Nick of Pendle car park which is located just to the north west of the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Hart is a good choice for some post walk refreshments. The traditional country pub has a roaring open fire, a very good menu and award winning cask ales. You can find the pub in Sabden at 36 Padiham Road with a postcode of BB7 9EW for your sat navs. Also in the village is the Sanwitches Cafe. The friendly cafe is set in the beautiful old mill on Wesley Street. They have a fine menu with a theme based around the Pendle Witches legends. You can find them at postcode BB7 9EH."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a fine walk to do with your dog providing they are in good shape. The White Hart pub mentioned above is also dog friendly with a separate dining area for you and your pet."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can pick up the Pendle Way and the Pendle Hill Witches Walk to further explore the area on waymarked trails. The town of Clitheroe, the delightful village of Waddington and Sawley Abbey and Gisburn are also nearby. Head a few miles north of Sabden and you can visit the neighbouring village of Downham. The village is very attractive and considered one of the prettiest in the county. There are some nice country trails to the local mills and becks to try in the area.  For more walking ideas in the area see the Forest of Bowland Walks page."
    }
  ],
  "postcode": "BB7 9HE",
  "district": "Ribble Valley",
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Crowtrees Road, Sabden, Ribble Valley, Lancashire, England, BB7 9HE, United Kingdom",
  "state": "England"
}