{
  "created_at": "2025-01-06T02:44:45.945573+00:00",
  "objectID": "d3e4b0818b8f325a04ebe1b81db03265",
  "ref": "stockbridge-walking-route",
  "title": "Stockbridge Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Stockbridge_-_Bridge_To_Stockbridge_Common_-_geograph.org.uk_-_777014.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d3e4b0818b8f325a04ebe1b81db03265.gpx",
  "_geoloc": {
    "lat": 51.1138234343,
    "lng": -1.489736246
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Stockbridge_-_Bridge_To_Stockbridge_Common_-_geograph.org.uk_-_777014.jpg",
      "title": "Chris Talbot / Stockbridge - Bridge To Stockbridge Common",
      "caption": "This bridge leads on to Stockbridge Common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Stockbridge_-_geograph.org.uk_-_32639.jpg",
      "title": "Nigel Freeman / Stockbridge",
      "caption": "Stockbridge centre. The town is situated on the Test. The hotel shown is the Grosvenor (classical Georgian) and the church is St Peters. The road is wide and the views are varied."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/River_Test%2C_south_of_Stockbridge_-_geograph.org.uk_-_123646.jpg",
      "title": "Peter Facey / River Test, south of Stockbridge",
      "caption": "River Test, south of Stockbridge. Looking N in evening light from National Trust \"Common Marsh\" site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/King%27s_Somborne_from_Clarendon_Way_-_geograph.org.uk_-_37649.jpg",
      "title": "Dave Jacobs / King's Somborne from Clarendon Way",
      "caption": "King's Somborne from Clarendon Way. The Clarendon Way - from Winchester to Salisbury Cathedrals - drops down into King's Somborne from the south-east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Lone_rider_on_Stockbridge_Down_-_geograph.org.uk_-_213556.jpg",
      "title": "Jim Champion / Lone rider on Stockbridge Down",
      "caption": "Lone rider on Stockbridge Down. Riding is permitted on the National Trust land at Stockbridge Down, although apparently you have to have permission if you intend to gallop or race. The downland survives almost untouched since prehistoric times - the area is littered with barrows and the remains of early British field systems"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Woolbury_Ring_in_summer%2C_Stockbridge_Down_-_geograph.org.uk_-_213554.jpg/256px-Woolbury_Ring_in_summer%2C_Stockbridge_Down_-_geograph.org.uk_-_213554.jpg",
      "title": "Jim Champion / Woolbury Ring in summer, Stockbridge Down",
      "caption": "Woolbury Ring in summer, Stockbridge Down. The interior of the Iron Age hillfort called Woolbury is private land. The southern ramparts are part of the National Trust owned Down. The fencepost in this photo stands in the original entrance to the hillfort."
    }
  ],
  "distance_km": 16.0,
  "description": "This small Hampshire town is beautifully positioned with riverside walks, nature reserves, woodland and hill climbs to enjoy. Several waymarked walking trails also pass through the area surrounding the town. This circular walk uses the Test Way and the Clarendon Way to visit some of the walking highlights around Stockbridge. You'll enjoy riverside paths along the River Test, visit the National Trust's Stockbridge Marsh, pass through the pretty village of King's Somborne and then climb up onto Stockbridge Down for fine views of the area. The route starts near the centre of the town at the Lion's Den Car Park (postcode:SO20 6JA). From here you can pick up the Test Way and follow the waymarked footpath south to take you past Common Marsh (owned by the National Trust), Marsh Court, Yew Hill and Hooper's Farm. On Stockbridge Marsh look out for a variety of wildlife including reed and sedge warblers, swans, moorhens, kingfishers, mistle thrush and reed buntings. When you reach How Park Farm you can pick up the Clarendon Way and follow it east into King's Somborne where there are some pretty thatched cottages. After passing the village the route turns north to follow paths through the countryside to North Park Wood and then up onto Stockbridge Down. The down is a great place for a walk with great views across Hampshire and Salisbury Plain from its elevated position. It's run by the National Trust and is set in a sea of intensively farmed land, with horses and cattle. After exploring the Down the route then descends to the south and west before returning to the town centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Greyhound on the Test is a great choice for some post walk refreshments. The pub does good food and has a delightful garden area in the back. With views over the tranquil river it's the perfect spot to relax in if the weather is fine. You can find it on the High Street at a postcode of SO20 6EY. In the rural village of King's Somborne there's the Crown Inn for a pit stop on the walk. It's an attractive and historic thatched pub dating from the 17th century. They serve good quality dishes and have a nice garden area to sit out in on warmer days. You can find them at postcode SO20 6PW for your sat navs. The pub is dog friendly. The village is also a nice place for a stroll with a noteworthy 13th century church and a pretty village green."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking, especially up on Stockbridge Down where you are bound to see plenty of other owners with their pets. The nearby Danebury Hill Fort and Harewood Forest are other good choices for you and your dog. The Greyhound pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you were to continue south along the river path it would soon take you to Mottisfont Abbey. The historic abbey ruins are another of the highlights near the town. Just to the north west of the town you can enjoy a climb up to Danebury Hill Fort where there are more fine views over the Test Valley. Head north of the town and you'll come to the village of Chilbolton where there's nice walks across the common to the River Anton."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aQnCihfxC0Y",
  "district": "Test Valley",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Old Swan House, High Street, Winton Hill, Stockbridge, Test Valley, Hampshire, England, SO20 6EU, United Kingdom",
  "postcode": "SO20 6EU",
  "state": "England"
}