{
  "created_at": "2025-01-06T01:41:50.193498+00:00",
  "objectID": "d4c56e66c9ea59d8a17b7948a3d58f8b",
  "ref": "hartest-walking-route",
  "title": "Hartest Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Village_view_from_Hartest_Hill_-_geograph.org.uk_-_3935113.jpg/512px-Village_view_from_Hartest_Hill_-_geograph.org.uk_-_3935113.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d4c56e66c9ea59d8a17b7948a3d58f8b.gpx",
  "_geoloc": {
    "lat": 52.1401457166,
    "lng": 0.6774491531
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Village_view_from_Hartest_Hill_-_geograph.org.uk_-_3935113.jpg/512px-Village_view_from_Hartest_Hill_-_geograph.org.uk_-_3935113.jpg",
      "title": "Village view from Hartest Hill by Bob Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Village view from Hartest Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Bright_cottages_lining_the_green_at_Hartest_-_geograph.org.uk_-_971518.jpg",
      "title": "Andrew Hill / Bright cottages lining the green at Hartest",
      "caption": "Bright cottages lining the green at Hartest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Hartest_Stone_-_Glacial_erratic_-_geograph.org.uk_-_3594218.jpg",
      "title": "Hartest Stone - Glacial erratic by Ashley Dace, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hartest Stone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Hartest_Village_Green_-_geograph.org.uk_-_4000909.jpg/512px-Hartest_Village_Green_-_geograph.org.uk_-_4000909.jpg",
      "title": "Hartest Village Green by Roger Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hartest Village Green"
    }
  ],
  "distance_km": 1.0,
  "description": "This Suffolk village is located in the Babergh district of the county. It's a charming place located just a few miles north of Glemsford and arranged around a large green, surrounded by delightful period cottages. Its name derives from Old English, meaning 'Hart's Wood', indicating an area frequented by deer. A prominent feature on the village green is the Hartest Stone, a sizable granite block found in Somerton in 1713. This stone was transported to Hartest to celebrate the Treaty of Utrecht, which concluded the War of the Spanish Succession. The end of the war on 7 July 1713 was marked by nationwide festivities, and in Hartest, the arrival of the stone to the green, hauled by 40 horses and a trumpeter, commemorated this occasion. Local lore suggests that the stone turns over at midnight, and sitting on it at this time supposedly brings good luck or a spouse. Hartest is home to over 50 listed buildings, a testament to its traditional character, with the oldest being a timber-framed Wealden house from 1470. Near the green stands one such listed building, the All Saints parish church. This beautiful church, primarily 15th century with significant Victorian restorations, boasts a two-tier octagonal Jacobean pulpit inside. Not all of Hartest's historic structures are ancient; the Boxted and Hartest Institute, established in 1888 by Thomas Weller-Poley as a Reading room, was designed by architect Reginald T Blomfield, later President of the R.I.B.A. The Institute, in the Arts and Crafts style, now hosts various events such as meetings, dances, and weddings. The village lies at the foot of Hartest Hill, reportedly Suffolk's steepest hill. On the village's outskirts is Hartest Wood, a 1.21-hectare broadleaf woodland planted in 1999, its layout mirroring the village map. Please scroll down for the full list of walks near and around Hartest. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Tucked away behind a tall screen of trees near the church, you'll find The Crown Inn, a charming and historic pub. Originally, The Crown served as Hartest Hall, a residence for the Bishop of Ely's steward. In the 16th century, it functioned as a courthouse. It underwent a transformation into a pub in the 18th century, though it continued to host petty sessions until at least 1766. In 1778, Ann Butts, the wife of the Bishop, bequeathed the inn to her daughter. Since then, The Crown has remained under private ownership. You can find them at postcode IP29 4DH. The pub is dog friendly."
    }
  ],
  "district": "Babergh",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B1066, Cross Green, Hartest, Babergh, Suffolk, England, IP29 4DH, United Kingdom",
  "postcode": "IP29 4DH",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "religious sites",
    "architecture"
  ],
  "facilities": [
    "car park",
    "community hall"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}