{
  "objectID": "d4c63a4b38ac2a434d1f2ee4bce752a5",
  "created_at": "2024-12-19T19:47:48.288380+00:00",
  "ref": "minstead-walking-route",
  "title": "Minstead Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Minstead_Village_Green_-_geograph.org.uk_-_332598.jpg",
  "nearby": [
    {
      "description": "Furzey Gardens",
      "objectID": "a19083a5b087cb4ca77a06d9d41e99ca",
      "ref": "furzey-gardens-walking-route"
    },
    {
      "description": "Bolderwood Deer Sanctuary",
      "objectID": "2f68923b09d298914b749b55675c8d63",
      "ref": "bolderwood-deer-sanctuary-walking-route"
    },
    {
      "description": "Lyndhurst",
      "objectID": "6004e8b0ac8ca159efad3e2fed7d73fe",
      "ref": "lyndhurst-walking-route"
    },
    {
      "description": "Rufus Stone",
      "objectID": "c9194925c918207b744af74f4a01ded2",
      "ref": "rufus-stone-walking-route"
    },
    {
      "description": "Acres Down",
      "objectID": "b2b9888789d1f10cfda8211dc5acb2b7",
      "ref": "acres-down-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/742A83D6DA3815CC8625860F005F1116/$FILE/Minstead.gpx",
  "_geoloc": {
    "lat": 50.8991877439,
    "lng": -1.6023186445
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Minstead_Village_Green_-_geograph.org.uk_-_332598.jpg",
      "title": "Gillian Moy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Minstead Village Green. To the right of the green is the Trusty Servant Inn and to the left is the village shop"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Minstead_Church_-_geograph.org.uk_-_332628.jpg",
      "title": "Gillian Moy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The 13th century Minstead Church. The grave of the novelist Sir Arthur Conan Doyle, creator of famous detective Sherlock Holmes, is under a large tree in the churchyard. Sir Arthur was originally buried in a vertical position in Crowborough and re-interred in Minstead by the family of his deceased first wife after the death of the second Lady Conan Doyle. The village figured prominently in Conan Doyle's historical novel The White Company. Alleyne Edricson, the main character is the second son of the late Franklin of Minstead and brother of the Simon, Socman of Minstead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Trusty_Servant_Inn%2C_Minstead_-_geograph.org.uk_-_154931.jpg",
      "title": "Peter Facey / Trusty Servant Inn, Minstead",
      "caption": "Trusty Servant Inn. The village pub has an unusual sign of a man with a donkeys ears, a pig's snout and a stag's feet. The snout has padlocked lips to signify discretion. This implies some past link with Winchester College, where a similar wall-painting of this legendary creature hangs outside the kitchen of the college."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/The_Rufus_Stone_-_geograph.org.uk_-_1432228.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Rufus Stone. The Rufus Stone was erected by Earl De La Warr in 1745 and marks the presumed spot where William II was killed by an arrow fired by Walter Tyrrell, while hunting on 2nd August 1100. The killing was said to be accidental. The King's youngest brother, Henry, hearing of his brother's death, rode to Winchester, seized the treasury and had himself proclaimed king by the barons, forestalling the claims of his eldest brother, Robert of Normandy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/New_Forest_ponies_grazing_near_Stricknage_Wood%2C_southwest_of_the_Rufus_Stone_-_geograph.org.uk_-_26523.jpg/256px-New_Forest_ponies_grazing_near_Stricknage_Wood%2C_southwest_of_the_Rufus_Stone_-_geograph.org.uk_-_26523.jpg",
      "title": "Jim Champion / New Forest ponies grazing near Stricknage Wood, southwest of the Rufus Stone",
      "caption": "New Forest ponies grazing near Stricknage Wood, southwest of the Rufus Stone. Typical scene of ponies grazing on the lawn with a clump of holly and oak in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Clearing_between_Blackwool_and_King%27s_Garn_Gutter_Inclosure%2C_New_Forest_-_geograph.org.uk_-_805076.jpg",
      "title": "Jim Champion / Clearing between Blackwool and King's Garn Gutter Inclosure, New Forest",
      "caption": "Clearing between Blackwool and King's Garn Gutter Inclosure, New Forest. Looking uphill towards the concrete road that runs up through the Long Beech caravan and camp site on the southern edge of King's Garn Gutter Inclosure. A path off to the left leads up Tom Pook's Hill, the cycle track off to the right enters King's Garn Gutter Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Ford_between_Stricknage_Wood_and_Blackthorn_Copse%2C_New_Forest_-_geograph.org.uk_-_805031.jpg",
      "title": "Jim Champion / Ford between Stricknage Wood and Blackthorn Copse, New Forest",
      "caption": "Ford between Stricknage Wood and Blackthorn Copse. This ford crosses a stream on the damp area of lawn between Stricknage Wood and Blackthorn Copse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Lawn_and_open_woodland%2C_Castle_Malwood_Walk%2C_New_Forest_-_geograph.org.uk_-_63021.jpg",
      "title": "Jim Champion / Lawn and open woodland, Castle Malwood Walk, New Forest",
      "caption": "Lawn and open woodland, Castle Malwood Walk. This view is typical of this grid square, with its open woodland and areas of lawn. In the distance are the trees of Stricknage Wood. Castle Malwood \"Walk\" is not a particular feature, but an old administrative area of the Forest."
    }
  ],
  "distance_km": 8.0,
  "description": "This pretty New Forest village is located just north of Lyndhurst. The little village is very attractive with a photogenic village green, thatched cottages, a popular local pub and a historic 13th century church. It also has literary connections with novelist Sir Arthur Conan Doyle, who is buried in the churchyard here. This walk from Minstead visits some of the highlights of the area including Furzey Gardens, the Rufus Stone, Castle Malwood Walk and the Long Beech Enclosure. The walk starts in the village and follows a footpath north west to visit the lovely Furzey Gardens. Here you'll find a picturesque lake, Azaleas, Rhododendrons and woodland glades. After exploring the gardens you continue north toward Stoney Cross where you cross the A road on the underpass. Head north east and you will soon come to the Rufus Stone. This historical stone apparently marks the spot where King William II was fatally wounded with an arrow, during a royal hunting outing in the Forest, in the year 1100. It is so called because the King's nickname was Rufus, due to his ruddy complexion and red hair. He was the son of King William I who was responsible for designating the area as the royal hunting ground that we know today as the New Forest. It's a lovely peaceful spot ideal for short walks and a picnic. From the stone you then head north west to visit Tom Pook's Hill, the Long Beech Enclosure and Castle Malwood Walk. There's some nice woodland trails to follow around here before returning to the village on the same paths via Stoney Cross.",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}