{
  "created_at": "2025-01-06T02:00:00.084148+00:00",
  "objectID": "d4fac20072901d19c39b91b8b2cf868b",
  "ref": "bellingham-walking-route",
  "title": "Walk Around Bellingham Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Bridge_Over_North_Tyne_at_Bellingham_-_geograph.org.uk_-_948602.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d4fac20072901d19c39b91b8b2cf868b.gpx",
  "_geoloc": {
    "lat": 55.1444146858,
    "lng": -2.2539593708
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Bridge_Over_North_Tyne_at_Bellingham_-_geograph.org.uk_-_948602.jpg",
      "title": "Ed Jennings / Bridge Over North Tyne at Bellingham",
      "caption": "Bridge Over North Tyne at Bellingham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/River_North_Tyne_-_geograph.org.uk_-_1363369.jpg",
      "title": "Simon Johnston / River North Tyne",
      "caption": "River North Tyne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Riverdale_Hall_cricket_field_-_geograph.org.uk_-_1343889.jpg",
      "title": "Simon Johnston / Riverdale Hall cricket field",
      "caption": "Riverdale Hall cricket field"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Riverdale_Hall_-_geograph.org.uk_-_1363372.jpg",
      "title": "Simon Johnston / Riverdale Hall",
      "caption": "Riverdale Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/River_North_Tyne_-_geograph.org.uk_-_1429847.jpg",
      "title": "Pete Saunders / River North Tyne",
      "caption": "River North Tyne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Gun_by_Townhall%2C_Bellingham_-_geograph.org.uk_-_1143304.jpg",
      "title": "Andrew Curtis / Gun by Townhall, Bellingham",
      "caption": "Gun by Townhall, Bellingham"
    }
  ],
  "distance_km": 4.8,
  "description": "The village of Bellingham is located in an attractive area of the Northumberland National Park. There's nice riverside trails along the River North Tyne which runs right through the village. You can also pick up the Pennine Way long distance trail or pay a visit to the Hareshaw Linn waterfall, just to the north of the village. This short walk takes you along a riverside path just to the west of Bellingham. It runs for about 1.5 miles on fairly flat paths to Cuddies Loup. On the way you'll pass the lovely Riverdale Hall which has a cricket field and salmon river in its own delightful grounds. There's also nice views of Dunterley Fell to enjoy on the way. Back in the village you can pay a visit to the Grade-I listed St Cuthbert's Church which dates from the 13th century. There's also Bellingham Bridge, a Grade II listed building built in 1834. The Heritage Centre is the local museum. It has exhibitions on the Border Counties Railway, the Border reivers, mining, farming, the photography of W P Collier, and the Stannersburn Smithy. To continue your walking in the area you can head west to explore the expansive Kielder Forest. There's miles of great cycling and walking trails here with a fantastic route around Kielder Water. The town is also not far from the epic Hadrian's Wall Path which is also located to the south of the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Carriages Tea Room at Bellingham Station is an interesting place to visit. You can enjoy a range of light lunches, freshly baked scones and homemade cakes on-board the old 1957 Mark 1 Carriages. The restored Carriage's still contain the original seats and many of the original fixtures and fittings from when the train was last used for public service. They do a very good afternoon tea for a reasonable price. You can find the cafe at Station Yard, Woodburn Road, Bellingham with a postcodfe of NE48 2DG for your sat navs. The Cheviot Hotel is another good option in the village. The hotel contains a decent bar with a good menu and a nice outdoor seating area. It's also dog friendly if you have your pet with you. You can find it on Main Street at a postcode of NE48 2AU."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the east of the town you'll find some pleasant woodland and waterside walking around Colt Crag Reservoir and Sweethope Loughs. These pretty lakes are also a good spot for wildlife watching with various wildfowl visitors to look out for on the water. For more walking ideas in the area see the Northumberland National Park Walks page."
    }
  ],
  "postcode": "NE48 2AA",
  "district": "Bellingham",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "High Street, Bellingham, Northumberland, North East, England, NE48 2AA, United Kingdom",
  "state": "England"
}