{
  "created_at": "2025-01-06T05:16:01.327940+00:00",
  "objectID": "d503c01fb830b414e92ae1fb776170e0",
  "ref": "belvedere-house-and-lough-ennell-walking-route",
  "title": "Belvedere House and Lough Ennell Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Lakeshore_reeds_-_geograph.org.uk_-_903724.jpg",
  "nearby": [
    {
      "description": "Lough Derravaragh",
      "objectID": "3d73b4e678bbdc8b887df16047cdd18d",
      "ref": "lough-derravaragh-walking-route"
    },
    {
      "description": "Durrow Abbey",
      "objectID": "de86b556afffb7434a2a927ab2488670",
      "ref": "durrow-abbey-walking-route"
    },
    {
      "description": "Fore Abbey",
      "objectID": "ad6b2070da2e4cd974c30279364e9fcd",
      "ref": "fore-abbey-walking-route"
    },
    {
      "description": "Lough Ree Park Walking Trail",
      "objectID": "7c68bba4f76e1b12a36100fa10d37e5c",
      "ref": "lough-ree-park-walking-trail"
    },
    {
      "description": "Lough Owel",
      "objectID": "1e6df88c79aa6b651c86c48d6f529c34",
      "ref": "lough-owel-walking-route"
    },
    {
      "description": "Athlone",
      "objectID": "472c0ee3ef3f20d4bb9a13ca6868e40b",
      "ref": "athlone-walking-route"
    },
    {
      "description": "Loughcrew",
      "objectID": "6f88f809f1ae4511ccdffc3ec70a600f",
      "ref": "loughcrew-walking-route"
    },
    {
      "description": "Athlone - Mullingar Greenway",
      "objectID": "6fdd7663a34df7e00bde73658f6f4bc1",
      "ref": "athlone---mullingar-greenway-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d503c01fb830b414e92ae1fb776170e0.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Lakeshore_reeds_-_geograph.org.uk_-_903724.jpg",
      "title": "kevin higgins / Lakeshore reeds",
      "caption": "Lakeshore reeds. Reed choked channel between Blind Island and shore of Lough Ennell. The main river flowing into Lough Ennell is the River Brosna, which enters on the Mullingar side of the lake and exits on the opposite side at Lilliput. Lilliput and Lilliput House were frequently used by Jonathan Swift as a holiday home and place to write, local tradition states that Jonathan Swift was in a boat on the lake when he looked back at Lilliput and noticed how small the people looked at that distance, hence the inspiration for his most famous book Gulliver's Travels"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Lake_Shore_-_geograph.org.uk_-_904050.jpg",
      "title": "kevin higgins / Lake Shore",
      "caption": "Lake Shore"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Lough_Ennell_from_the_grounds_of_Belvedere_House_-_geograph.org.uk_-_2497047.jpg",
      "title": "Lough Ennell from the grounds of Belvedere House by Mike Searle, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lough Ennell from the grounds of Belvedere House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/The_Jealous_Wall%2C_2021-07-21.jpg/512px-The_Jealous_Wall%2C_2021-07-21.jpg",
      "title": "瑞丽江的河水, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "The Jealous Wall. A large 18th century Gothic folly made from limestone located in the Belvedere House and Gardens in Mullingar, County Westmeath, Ireland. It is notable for being the largest folly in Ireland. It was built by Robert Rochfort, 1st Earl of Belvedere to block off the view of his estranged brother's house nearby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Belvedere_House%2C_Mullingar_-_gazebo_folly_-_geograph.org.uk_-_2497021.jpg",
      "title": "Belvedere House, Mullingar - gazebo folly by Mike Searle, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gazebo Folly"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Belvedere_House%2C_Mullingar_-_geograph.org.uk_-_2497014.jpg",
      "title": "Belvedere House, Mullingar by Mike Searle, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Belvedere House, Mullingar"
    }
  ],
  "distance_km": 3.0,
  "description": "This walk visits the historic Belvedere House and Lough Ennell in Mullingar, County Westmeath. Belvedere House is a splendid Georgian House and Estate located next to the beautiful large lake. It's a lovely place for a stroll with lakeshore walks, woodland trails and a Victorian Walled Garden to explore. There's also the fine architecture of the 18th century house and some highly photogenic ruined follies to admire here. In particular look out for 'The Jealous Wall' created as a result of a quarrel between Robert Rochfort and his brother George, the owner of nearby Rochfort House. In the expansive woodland look out for some fine Specimen trees, statues and lots of wildlife. The walled garden contains a wide range of flowers and an arboretum. There's also a delightful fairy garden with little streams, bridges and sprites fluttering in the wind.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site Lakeshore Café is a fine place to relax after your exercise. They sell a good range of meals, snacks and treats here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland are ideal for dog walking. You are requested to keep them on leads on the estate."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and there's more lakeside walking to be found at Lough Derravaragh. There's some pleasant trails through the peaceful woodland and fine views across the water from the shoreline trails. On the way you would pass Lough Owel where there's walks, swimming and the wildlife rich Scragh Bog Nature Reserve. Near here there's more local historic interest located at Fore Abbey. The ancient abbey dates back to the 13th century and includes a circular walk taking you around the historic buildings and the village of Fore. The area also includes the fascinating Loughcrew. This ancient site includes includes a number of tombs thought to date to the 4th millennium BC. There are great views from the hill top to enjoy here as well. To the south there's more local historic interest at Durrow Abbey. The interesting medieval site includes several notable ancient features, a picturesque walled garden and some peaceful woodland trails. To the west there's the Lough Ree Park Walking Trail, a popular place for easy strolls and lakeside picnics. The lough is located near the town of Athlone where you can enjoy a nice walk along the River Shannon, Ireland's longest River."
    }
  ],
  "video_url": "https://www.youtube.com/embed/kDNYjAtVypM",
  "gazetteer_found": false
}