{
  "created_at": "2025-01-06T00:47:21.739399+00:00",
  "objectID": "d53628c0f95a06b01cdc873d0a17a8eb",
  "ref": "shouldham-warren-walking-route",
  "title": "Shouldham Warren Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Shouldham_warren_-_geograph.org.uk_-_823110.jpg",
  "nearby": [
    {
      "description": "King's Lynn and The Walks",
      "objectID": "56652f8a61235771b1c5a95d57616747",
      "ref": "kings-lynn-and-the-walks-walking-route"
    },
    {
      "description": "Nar Valley Way",
      "objectID": "38bb691f170838e05ddfd5fc8732c107",
      "ref": "nar-valley-way-walking-route"
    },
    {
      "description": "Castle Acre",
      "objectID": "991e111ff7aed6a1c76d339c12e1ed7b",
      "ref": "castle-acre-walking-route"
    },
    {
      "description": "Pentney Lakes",
      "objectID": "7d87fa9f338021989c869697aba49b3e",
      "ref": "pentney-lakes-walking-route"
    },
    {
      "description": "Downham Market",
      "objectID": "e2ffdea07b40bdca82980950a30ef4b7",
      "ref": "downham-market-walking-route"
    },
    {
      "description": "Great Massingham",
      "objectID": "69cecf30872eea75e93e9df4cbb428ea",
      "ref": "great-massingham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d53628c0f95a06b01cdc873d0a17a8eb.gpx",
  "_geoloc": {
    "lat": 52.6653813235,
    "lng": 0.4817093562
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Shouldham_warren_-_geograph.org.uk_-_823110.jpg",
      "title": "Keith Evans / Shouldham warren",
      "caption": "Shouldham warren entrance sign and car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Walking_the_dogs_-_geograph.org.uk_-_1739287.jpg",
      "title": "Evelyn Simak / Walking the dogs",
      "caption": "Walking the dogs. The tracks and paths traversing Shouldham Warren are favoured by horse riders and walkers, with or without dogs. The warren is a wooded area on the edge of the fens, located a short distance to the north of the village of Shouldham with a track to the parking and picnic area turning off Spring Lane. The undulating site is traversed by numerous unmarked paths offering good views across the open fenland. Much of the northern part, which slopes upwards towards a central plateau, is covered by conifers, some of which has recently been cleared. A deep ditch crossable only in three places - separates the northern from the southern parts of the woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Deep_ditch_in_Shouldham_Warren_-_geograph.org.uk_-_1739206.jpg",
      "title": "Evelyn Simak / Deep ditch in Shouldham Warren",
      "caption": "The deep ditch seen here is crossable only in three places and separates the northern from the southern parts of the woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Picnic_area_in_Shouldham_Warren_-_geograph.org.uk_-_1739200.jpg",
      "title": "Evelyn Simak / Picnic area in Shouldham Warren",
      "caption": "Picnic area in Shouldham Warren"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Path_in_Shouldham_Warren_-_geograph.org.uk_-_1739190.jpg",
      "title": "Evelyn Simak / Path in Shouldham Warren",
      "caption": "Wide footpath at the site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/The_church_of_All_Saints_in_Shouldham_-_geograph.org.uk_-_1738498.jpg",
      "title": "Evelyn Simak / The church of All Saints in Shouldham",
      "caption": "A view of the village church of All Saints in Shouldham. The church is situated on an elevation to the east of the village, looking down a hillside that shows evidence of extensive earthworks. The building dates mainly from the 14th century and is constructed from locally found carstone. It was extensively restored - with the chancel rebuilt to the designs of the London-based architect RJ Withers - in 1871. The pews date from 1871 and medieval bench ends were mounted onto some of them. The nave also contains several original C15 benches which have square ends with tracery cut into them, and the fine hammerbeam roof with carved angels is original also. The glass in the east window comes from Bell and Almond and was installed in 1877. The north nave window and the south chapel window are by the same artists and date from 1871 and 1872 respectively. An unusual memorial to Thomas Allen (d 1841) stands in the north-east corner of the chancel. The sculpture depicts Faith and is signed by W Groves who exhibited it in 1842 at the Royal Academy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Cottages_in_Shouldham_-_geograph.org.uk_-_1738619.jpg",
      "title": "Evelyn Simak / Cottages in Shouldham",
      "caption": "Cottages in Shouldham village. The village of Shouldham lies just to the south of the reserve about 10 kilometres north-east of Downham Market (South West Norfolk) and has a population of approximately 500."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/The_green_in_Shouldham_-_geograph.org.uk_-_1738593.jpg",
      "title": "Evelyn Simak / The green in Shouldham",
      "caption": "The green in Shouldham. Immediately to the east and north-east of the village, on the south side of the Nar valley bottom which used to be a fen in medieval times, lies the site of the Priory of the Holy Cross and the Blessed Virgin. This site is a designated National Monument and contains the buried remains of monastic buildings, earthwork enclosures and remains of an extensive water management system including fishponds. The site can be accessed via the public footpath turning off Eastgate Street and leading to Marham, further to the east, which traverses it. Found within the same area there are also remains of a section of road which is believed to date from Roman times, and a Bronze Age cremation cemetery. The church of All Saints stands on an elevation above the site, looking down onto the village."
    }
  ],
  "distance_km": 3.0,
  "description": "This nature reserve near King's Lynn has some peaceful woodland walking trails. There's also cycling opportunities with some good mountain bike (mtb) trails to try. Start the walk from the car park located about a mile north of Shouldham village. From here you can pick up the woodland trails which include two colour coded waymarked walks: the Yellow walk (1 kilometre) and the Red walk (about 3 kilometres). In the reserve there's beautiful pine woodlands and fine views across the fenland countryside and the Nar Valley from the outskirts. There's also a stunning Rhododendron Avenue and a nice picnic area. After you've explored the nature reserve you can head into Shouldham village where there are picturesque cottages, a village green and an interesting 14th century church to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Shouldham village and you can enjoy some post walk refreshments at The King's Arms. The 17th century pub is located in a nice spot next to the village green. It is notable as West Norfolk's first community owned pub. It was West Norfolk CAMRA Pub of the Year 2016, 2017, 2018 and 2020. They have a good menu and a sunny garden at the back of the pub. You can find them at 28 The Green with a postcode of PE33 0BY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The expansive reserve with its lovely wide woodland trails is ideal for a peaceful dog walk. You will probably see other owners with their pets on a fine day. The King's Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Nar Valley Way passes through the forest providing and opportunity for extending your walking in the area. You could follow the waymarked path east along the river to Narborough, Narford Lake and Castle Acre. The village is one of the highlights of the area with the atmospheric ruins of and 11th century castle and priory to see. There's also some lovely waterside trails along the River Nar through the picture postcard village. The attractive village of Great Massingham and the historic Houghton Hall gardens are also located in this area. Just to the north east you'll find Pentney Lakes and West Bilney Wood where there are more nice trails to try. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/I1yNom_ck-g",
  "postcode": "PE33 0DQ",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Warren Road, Shouldham, King's Lynn and West Norfolk, Norfolk, England, PE33 0DQ, United Kingdom",
  "district": "King's Lynn and West Norfolk",
  "state": "England"
}