{
  "created_at": "2025-01-06T09:16:31.561133+00:00",
  "objectID": "d53ffb59f5df794ccfb70a7400a772a8",
  "ref": "macclesfield-to-marple---middlewood-way-walking-and-cycle-route",
  "title": "Middlewood Way Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/28/Middlewood_Way_-_geograph.org.uk_-_1301107.jpg",
  "nearby": [
    {
      "description": "Macclesfield Canal",
      "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
      "ref": "macclesfield-canal-walking-route"
    },
    {
      "description": "Lyme Park",
      "objectID": "f5f02b4b8e24938b1c37c524f487d0d0",
      "ref": "lyme-park-walking-route"
    },
    {
      "description": "Mellor",
      "objectID": "4062fc11cde48f05d38878c3a7522d11",
      "ref": "mellor-walking-route"
    },
    {
      "description": "Pott Shrigley",
      "objectID": "48cfa54df0668d9f67451620d6d8ef96",
      "ref": "pott-shrigley-walking-route"
    },
    {
      "description": "Marple Bridge",
      "objectID": "9747851de3de94202f57209182c61ce7",
      "ref": "marple-bridge-walking-route"
    },
    {
      "description": "Biddulph Valley Way",
      "objectID": "22d544993c7c64de4f5868d761694568",
      "ref": "biddulph-valley-way-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d53ffb59f5df794ccfb70a7400a772a8.gpx",
  "_geoloc": {
    "lat": 53.266483487,
    "lng": -2.1247708797
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Middlewood_Way_-_geograph.org.uk_-_1301107.jpg",
      "title": "Gerald England / Middlewood Way, via Wikimedia Commons",
      "caption": "Nice view of the tree lined, surfaced path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Welcome_to_the_Middlewood_Way_-_geograph.org.uk_-_385561.jpg/256px-Welcome_to_the_Middlewood_Way_-_geograph.org.uk_-_385561.jpg",
      "title": "Stephen McKay / Welcome to the Middlewood Way, via Wikimedia Commons",
      "caption": "Welcome sign at the start of the route"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Middlewood_Way_-_geograph.org.uk_-_1778781.jpg/512px-Middlewood_Way_-_geograph.org.uk_-_1778781.jpg",
      "title": "Alan Murray-Rust / Middlewood Way, via Wikimedia Commons",
      "caption": "Looking south from Prince Road bridge. The Way is split into all-user (right) and pedestrian-only (left) paths. When created, trees were planted in the median strip but these were found to create a very dark atmosphere, as well as significantly adding to maintenance costs of the pathways, so they have recently been removed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Middlewood_Way_-_geograph.org.uk_-_1475566.jpg/256px-Middlewood_Way_-_geograph.org.uk_-_1475566.jpg",
      "title": "Mike Kirby / Middlewood Way, via Wikimedia Commons",
      "caption": "This section, viewed from Lyme Road bridge, used to be Higher Poynton rail station. It's now a beautifully landscaped picnic area, ideal for stopping at for a sandwich on the route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Bridge_over_Middlewood_Way_-_geograph.org.uk_-_1352932.jpg",
      "title": "John Darch / Bridge over Middlewood Way, via Wikimedia Commons",
      "caption": "Bridge over the trail, carrying the Adlington to Pott Shrigley Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Middlewood_Way_bridge_over_Middlewood_Station_%28geograph_3065607%29.jpg/512px-Middlewood_Way_bridge_over_Middlewood_Station_%28geograph_3065607%29.jpg",
      "title": "Peter Turner / Middlewood Way bridge over Middlewood Station, via Wikimedia Commons",
      "caption": "Middlewood Way bridge over Middlewood Station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/The_Middlewood_Way_at_Higher_Poynton%2C_Cheshire_-_geograph.org.uk_-_568809.jpg/256px-The_Middlewood_Way_at_Higher_Poynton%2C_Cheshire_-_geograph.org.uk_-_568809.jpg",
      "title": "Roger Kidd / The Middlewood Way at Higher Poynton, Cheshire, via Wikimedia Commons",
      "caption": "The path at Higher Poynton on a sunny summer day"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Middlewood_Way_near_Lyme_Road_-_geograph.org.uk_-_1177787.jpg",
      "title": "Chris Wimbush / Middlewood Way near Lyme Road, via Wikimedia Commons",
      "caption": "Lyme Road"
    }
  ],
  "distance_km": 18.0,
  "description": "Follow the Middlewood Way - a lovely off road cycle and walking path running from Macclesfield to Marple and passing by the Macclesfield Canal. The route runs along the track of the old Macclesfield, Bollington and Marple railway which closed in 1970. It covers a distance of about 11 miles on a flat resurfaced path suitable for most types of bike. As such its a nice easy ride suitable for most abilities and ideal for families looking for a safe ride in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Miner's Arms is located a couple of minutes walk from the Adlington Basin on the Macclesfield canal. The trail passes right next to it so it's a good pit stop on the route. The classic old country pub does good food and has a nice large beer garden to sit out and relax in on warmer days. There's a cosy fire indoors, a good sized car park and it's also dog friendly. You can find the pub on Wood Lane North, just south east of Poynton at a postcode of SK10 4PF for your sat navs. The Adlington Basin and adjacent Lyme House Marina are also worth stopping at for a rest. There's benches here where you can sit and watch the boats cruise down the canal.  Pictured above, the Adlinton Basin on the Macclesfield Canal which runs parallel to the trail. The former Adlington Colliery Basin on the Macclesfield Canal is now a thriving marina with nearby cafe and restaurant. It's a nice place to stop at and enjoy a rest before continuing your ride."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The tree lined path is nice for a dog walk. Please keep them under close control though as there are generally a lot of bikes passing by."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route is very accessible by public transport with Middlewood Train Station right next to the trail. The station is on the Stockport to Buxton line. There is a generally a two-hourly service each day (including Sundays) to Manchester Piccadilly northbound and to Buxton southbound, with additional services at peak periods. Just to the east of Middlewood you will find the excellent Lyme Park. The expansive park has miles of cycling and walking trails with woodland, ponds and deer to look out for on the way. It's a great way to extend your outing and easy to access from the path.  Pictured above, the splendid Lyme Park. The National Trust owned park is located very close to the route and well worth an extension to your outing. At Bollington the trail passes below White Nancy. Here you will find an unusual folly in the shape of a small domed sugar loaf and thought to have been built in 1817 by Colonel Gaskell as a monument to the Battle of Waterloo. It's worth a slight detour east from the trail to this fine viewpoint. Just to the south east of Marple there's the climb to the Mellor Cross to try. The religous cross marks the site where Methodist John Wesley preached during the 18th century. There are fine views from the elevated position of the site. The route runs along National Cycle Route 55. The long distance trail runs from Ironbridge to Preston via Cheshire and Greater Manchester. Following the trail north would take you towards Macclesfield while heading south leads you towards Kidsgrove and Stoke on Trent. You could extend your ride along the trail by heading west into Stockport and Chorley. Heading south would take you towards Congleton where you could pick up the Biddulph Valley Way which also runs along an old railway line. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cGy_UiU0miU",
  "postcode": "SK10 2EE",
  "district": "Macclesfield",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Middlewood Way, Tytherington, Macclesfield, Cheshire East, England, SK10 2EE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "paved"
  ],
  "points_of_interest": [
    "historical sites"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activity_type": [
    "cycling",
    "walking"
  ]
}