{
  "created_at": "2025-01-06T00:11:19.809007+00:00",
  "objectID": "d55780f68eb358f7b92cfd5f99dca9d7",
  "ref": "thruscross-reservoir-walking-route",
  "title": "Thruscross Reservoir Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/98/Thruscross_Reservoir_-_geograph.org.uk_-_28245.jpg",
  "nearby": [
    {
      "description": "Fewston Reservoir",
      "objectID": "f870c6905352a5cd4636cb7612225f48",
      "ref": "fewston-reservoir-walking-route"
    },
    {
      "description": "Swinsty Reservoir",
      "objectID": "3e7bc3fde9574c0926d11fb1b2480c4a",
      "ref": "swinsty-reservoir-walking-route"
    },
    {
      "description": "Nidderdale Way",
      "objectID": "0dc8fa01c0ab155c1791cb829f1f1e1d",
      "ref": "nidderdale-way-walking-route"
    },
    {
      "description": "Greenhow Hill",
      "objectID": "ecfdbfaafecadefc52bd4d52c5ed46c6",
      "ref": "greenhow-hill-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d55780f68eb358f7b92cfd5f99dca9d7.gpx",
  "_geoloc": {
    "lat": 54.0125299958,
    "lng": -1.7680134289
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Thruscross_Reservoir_-_geograph.org.uk_-_28245.jpg",
      "title": "Mick Melvin / Thruscross Reservoir, via Wikimedia Commons",
      "caption": "Old trees appear on the exposed side of the reservoir during a low water period."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Water_Tower%2C_Thruscross_-_geograph.org.uk_-_281645.jpg",
      "title": "Chris Heaton / Water Tower, Thruscross, via Wikimedia Commons",
      "caption": "Water Tower, Thruscross. This tower can be seen by the road to Greenhow, at Stonehouse Crossroads"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/River_Washburn_flowing_south_west_into_Thruscross_Reservoir_-_geograph.org.uk_-_425631.jpg",
      "title": "Joe Regan / River Washburn flowing south west into Thruscross Reservoir, via Wikimedia Commons",
      "caption": "River Washburn flowing south west into Thruscross Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Thruscross_Reservoir_Dam_-_geograph.org.uk_-_489836.jpg",
      "title": "Andrew Whale / Thruscross Reservoir Dam, via Wikimedia Commons",
      "caption": "Wonderful view of the dam"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Thruscross_Reservoir_spillway_-_geograph.org.uk_-_425636.jpg",
      "title": "Joe Regan / Thruscross Reservoir spillway, via Wikimedia Commons",
      "caption": "Spillway view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Thruscross_Reservoir_Spillway_and_Weir_-_geograph.org.uk_-_489823.jpg/256px-Thruscross_Reservoir_Spillway_and_Weir_-_geograph.org.uk_-_489823.jpg",
      "title": "Andrew Whale / Thruscross Reservoir Spillway and Weir, via Wikimedia Commons",
      "caption": "Spillway and Weir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Thruscross_dam_-_geograph.org.uk_-_685811.jpg",
      "title": "Gordon Hatton / Thruscross dam",
      "caption": "Thruscross dam. The dam was constructed in the 1960's and holds back the waters of Thruscross Reservoir, the newest and highest of 4 reservoirs in the Washburn valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Thruscross_Reservoir_and_Menwith_Hill_Radomes_looking_east_from_Rocking_Hall_-_geograph.org.uk_-_403850.jpg",
      "title": "Joe Regan / Thruscross Reservoir and Menwith Hill Radomes looking east from Rocking Hall",
      "caption": "View from above the reservoir. Thruscross and Menwith Hill Radomes looking east from Rocking Hall"
    }
  ],
  "distance_km": 8.0,
  "description": "This is a delightful waterside walk around Thruscross Reservoir in the Yorkshire Dales. It's a beautiful area with the tranquil waters of the reservoir surrounded by peaceful woodland and beautiful countryside. The circular route runs for a distance of about 5 miles with small hill climbs long the way. As such it should take just under 2 hours to walk all the way around. The walk begins at the car park at the southern end of the reservoir and takes you along a good footpath to Whit Moor, Far Comb Hill and past the hugely impressive dam. It is a fairly easy walk with woodland sections, waterside sections and some moderate climbs. Highlights include the impressive Washburn Dam near the start. This historical landmark makes for a great photo. Thruscross is located near to Leeds and Harrogate. You can easily extend your walk by heading to the adjacent Fewston Reservoir. A riverside footpath along the River Washburn will take you there. Swinsty Reservoir is also just a little further south and offers a shorter walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east of the reservoir you'll find the conveniently located Stone House Inn. The traditional country pub does food and has an outdoor seating area with nice views of the area. You can find the pub on Greenhow Hill Road with a postcode of HG3 4AH for your sat navs. The Fewston Farm Shop is another nice place to visit in the area. Located just to the east of Fewston Reservoir the shop includes a cafe serving a large variety of teas and coffee and a selection of cakes and scones to accompany them. It's a lovely country spot with adjacent fields holding ponies, goats and other animals. On warmer days you can relax outside and enjoy the views of the surrounding Yorkshire countryside. You can find the shop just off the Skipton Road (A59) at a postcode of HG3 1SR."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail around the reservoir is ideal for dog walking and you'll probably see other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the southern end of the reservoir the Dales Way Link waymarked trail can be found. You could pick up the trail and follow it west up onto Rocking Moor. There's fine views over the surrounding area from the elevated position of the moor. A few miles to the east you can pick up the Nidderdale Way. Another long distance waymarked trail, this one has some nice riverside paths to try around Dacre Banks and Summerbridge.If you head north along the Redlish Road just to the east of the water, you can visit Greenhow Hill. The village is a significant location for cyclists as it was part of the Tour of Yorkshire in 2016. The summit stands at a height of 306 feet (398 m) offering fine views over Nidderdale and Wharfedale. The church in the village (St Mary's) is reputedly the highest parish church in England still in use. It's an interesting place to visit and includes the Toft Gate Barn Cafe which is a great place to enjoy refreshments with a view. At nearby Swinsty Reservoir you'll find the interesting Washburn Valley Heritage Centre. Inside there's informative exhibitions about the history and heritage of the Valley. This includes the history of Fewston Church from its 14th century tower and its rebuilding in 1697. There's also a series of information boards on the geology and natural landscape of the valley. The building includes a nice tea room where you can enjoy some refreshments after your exercise too. Near the reservoir there's the peaceful Beaver Dyke Reservoir and John O'Gaunt Reservoir. The photogenic ruins of John O'Gaunt Castle can also be found in this area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/kDJrOQy6p5k",
  "postcode": "HG3 4BB",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Reservoir Road, Thruscross, North Yorkshire, York and North Yorkshire, England, HG3 4BB, United Kingdom",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "waterside",
    "hill"
  ],
  "points_of_interest": [
    "dam",
    "historical landmark"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}