{
  "objectID": "d58960f2020f5984d68896ef5563901c",
  "created_at": "2024-12-20T07:28:40.124706+00:00",
  "ref": "bournville-walking-route",
  "title": "Bournville Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/74/The_Bourn_flowing_through_Bournville_Park_-_geograph.org.uk_-_315165.jpg",
  "nearby": [
    {
      "description": "Worcester and Birmingham Canal",
      "objectID": "06cdf2fadd9f580d8ef5c82d462b5a43",
      "ref": "worcester-and-birmingham-canal-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d58960f2020f5984d68896ef5563901c.gpx",
  "_geoloc": {
    "lat": 52.4306388705,
    "lng": -1.9341440788
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/The_Bourn_flowing_through_Bournville_Park_-_geograph.org.uk_-_315165.jpg",
      "title": "Phil Champion / The Bourn flowing through Bournville Park",
      "caption": "The Bourn flowing through Bournville Park. The stream continues through / under the chocolate factory to join the River Rea. This should not be confused with the Bourn Brook, which joins the Rea a mile or so further north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Bournville_Station_and_the_Worcester_and_Birmingham_Canal_-_geograph.org.uk_-_965663.jpg",
      "title": "Roger  Kidd / Bournville Station and the Worcester and Birmingham Canal",
      "caption": "Bournville Station and the Worcester and Birmingham Canal. The distinctive purple colour of Cadbury's Dairy Milk Chocolate wrappers brightens up the station, with its easy access from good moorings on the Worcester and Birmingham Canal. Cadbury's World is nearby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/The_Rest_House%2C_Bournville_Village_Green_-_geograph.org.uk_-_319433.jpg",
      "title": "Phil Champion / The Rest House, Bournville Village Green",
      "caption": "The Rest House, Bournville Village Green. The Rest House is modelled on the Yarn Market at Dunster, Somerset: 936 Inside an inscription reads \"This Rest House was erected to commemorate the Silver Wedding of Mr & Mrs George Cadbury by the employees of Cadbury Brothers Ltd at Bournville and in all parts of the world. A lasting memorial of esteem and affection as an expression of gratitude for the unceasing interest in their welfare and in admiration of manifold services to the world at large.\". The building now houses a gift shop and the Carillon Visitor Centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Parade_of_shops_opposite_Bournville_village_green_-_geograph.org.uk_-_315215.jpg",
      "title": "Phil Champion / Parade of shops opposite Bournville village green",
      "caption": "Parade of shops opposite Bournville village green. This row of shops was designed by Bedford Tylor and built between 1905 and 1908."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Junior_School_and_Carillon%2C_Bournville_-_geograph.org.uk_-_315194.jpg/256px-Junior_School_and_Carillon%2C_Bournville_-_geograph.org.uk_-_315194.jpg",
      "title": "Phil Champion / Junior School and Carillon, Bournville",
      "caption": "Junior School and Carillon, Bournville, West Midlands. Atop the Arts and Crafts style Junior School is a 48 bell carillon. This musical instrument is one of only two working examples in the country. George Cadbury was inspired to build the carillon after viewing one in Bruges, which dates back to 1675. The Bournville Carillon can be heard most weekends."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Selly_Manor_-_geograph.org.uk_-_317952.jpg",
      "title": "Phil Champion / Selly Manor",
      "caption": "Selly Manor. The Manor was moved to its current location in Bournville by George Cadbury. The house is now a museum."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/GandS_Canal_and_former_Cadbury%27s_factory_-_geograph.org.uk_-_103806.jpg",
      "title": "Phil Champion / G&S Canal and former Cadbury's factory",
      "caption": "G&S Canal and former Cadbury's factory. Cadbury's opened a factory adjacent to the Gloucester & Sharpness canal near Fretherne Bridge in 1916. The factory produced chocolate crumb from ground cocoa beans, sugar, and milk from local farms before being transported to the Bournville factory in Birmingham by narrowboat. The silo in the centre of the picture was added later to provide additional storage. The factory is now occupied by several businesses including Shipton Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Stirchley_Public_Baths_-_geograph.org.uk_-_111023.jpg",
      "title": "Phil Champion / Stirchley Public Baths",
      "caption": "Stirchley Public Baths. Stirchley Bath are situated at the Junction of Bournville Lane and Hazelwell Street. This grade II listed building was opened in 1904 on land provided by Cadbury's. The baths have been closed for 20 years or more and are in a very poor state. The state of the baths mirrors the general economic decline in the Stirchley area in the 1970s/80s. There are plans to regenerate the area and several applications being considered for various retail developments on adjacent sites. Proposals by the co-op, who have a very large superstore nearby, include renovation of the baths."
    }
  ],
  "distance_km": 2.0,
  "description": "Explore the fascinating little village of Bournville on this short walk in Birmingham. The area is famous for the Cadbury World chocolate factory producing Bournville chocolate and other confectionary. The village is very pretty with old buildings and fine houses created to originally house the factory workers. It's a nice place for a stroll with good footpaths through Bournville park with its pretty stream, gardens and a lake where you can see lots of little model boats in operation. The start point for the walk is the 14th century Selly Manor. It is located near to Bournville Green and not far from Bournville train station. The old house includes a magnificent cruck-framed medieval hall and pretty gardens. You can explore the house and museum for a small fee. The walk then heads across Bournville Green where you can see a number of historic buildings with an information panel describing the area. After leaving the green head across the A4040 at the traffic lights and you will enter Bournville Park. Here you can enjoy a pleasant stroll along the Merrits Brook Greenway to the little lake. You can circle the lake on waterside footpaths before returning to the green on the same paths. To extend your walk you can continue along the brook to the nearby Manor Farm Park and Ley Hill Park. On the way you will pass waterfalls, lakes, woodland and gardens with good footpaths and cycling trails. You could also pick up the Worcester and Birmingham Canal which runs through nearby Stirchley.",
  "video_url": "https://www.youtube.com/embed/72_4uLWawf0",
  "district": "Birmingham",
  "region": "West Midlands",
  "country": "England"
}