{
  "created_at": "2025-01-06T04:58:29.461176+00:00",
  "objectID": "d5a7a05e57094112ef04b37d3a31ea1c",
  "ref": "beaminster-walking-route",
  "title": "Beaminster Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/63/Beaminster%2C_The_Square_-_geograph.org.uk_-_922596.jpg",
  "nearby": [
    {
      "description": "Mapperton House",
      "objectID": "017bfc09f3363a5b6b6d2bd9456756b3",
      "ref": "mapperton-house-walking-route"
    },
    {
      "description": "Wessex Ridgeway",
      "objectID": "43cab8ae3f5228bfec0a5cd93960fe13",
      "ref": "wessex-ridgeway-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Lewesdon Hill",
      "objectID": "09e0dcc0017bd705b92bd95689d47d5c",
      "ref": "lewesdon-hill-walking-route"
    },
    {
      "description": "Jubilee Trail",
      "objectID": "a10dd9b1273dd332de7ea385fa8d7f08",
      "ref": "jubilee-trail-walking-route"
    },
    {
      "description": "Wessex Ridgeway Trail",
      "objectID": "9f92740c79886bdf30676843536adf56",
      "ref": "wessex-ridgeway-trail-walking-and-cycle-route"
    },
    {
      "description": "Brit Valley Way",
      "objectID": "61ba1045491f0b44b5ea9ea1e9d3233e",
      "ref": "brit-valley-way-walking-route"
    },
    {
      "description": "Pilsdon Pen",
      "objectID": "68b6540d8d3ac4be085c018b4474ab18",
      "ref": "pilsdon-pen-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d5a7a05e57094112ef04b37d3a31ea1c.gpx",
  "_geoloc": {
    "lat": 50.8093297174,
    "lng": -2.7389303127
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Beaminster%2C_The_Square_-_geograph.org.uk_-_922596.jpg",
      "title": "Martin Bodman / Beaminster: The Square",
      "caption": "Beaminster: The Square With the Greyhound prominent. Two other former public houses can be seen: the Black Cat Bistro, extreme left, and to its right, in Hogshill Street, White Hart Yard \u0096 once an hotel. The turning to Corscombe and Halstock is on the right. Crewkerne, six miles to the north, has had heavy rain, as the dark skies indicate on this August afternoon in 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Beaminster-_Julia_the_market_cross_%28geograph_4406451%29.jpg",
      "title": "Chris Downer / Beaminster: Julia the market cross",
      "caption": "Beaminster- Julia the market cross"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Church_Street%2C_Beaminster_-_geograph.org.uk_-_1173609.jpg",
      "title": "Sarah Smith / Church Street, Beaminster",
      "caption": "View of Church Street winding up to the market square and Hogshill Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Beaminster%2C_ford_and_cottage%2C_Woodswater_Lane_-_geograph.org.uk_-_1383395.jpg/256px-Beaminster%2C_ford_and_cottage%2C_Woodswater_Lane_-_geograph.org.uk_-_1383395.jpg",
      "title": "Chris Downer / Beaminster: ford and cottage, Woodswater Lane",
      "caption": "Beaminster: ford and cottage, Woodswater Lane. Looking across Woodswater Lane by the ford across the River Brit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Beaminster%2C_converted_watermill_-_geograph.org.uk_-_922625.jpg",
      "title": "Martin Bodman / Beaminster: converted watermill",
      "caption": "Converted watermill in the town. This mill was once powered by a leat from the river Brit. It was originally Southgate Mill - a grain mill with four pairs of stones worked by a 16' by 10' waterwheel - and was disused by 1905. Now a private residence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/The_Manor_House_-_Toller_Whelme_-_geograph.org.uk_-_698143.jpg",
      "title": "Mike Searle / The Manor House - Toller Whelme",
      "caption": "The Manor House - Toller Whelme. The original and hidden (in this view) C15 core is at the rear of the property. The front, seen here, is essentially C17 together with an C18 extension also at the rear. The home of the Penne family from 1630, it was subsequently bought by George Richards of Long Bredy in 1708, and then became the home of William Pope and his descendants for well over a hundred years. Sadly the family lost the manor when it was mortgaged to fund the escalating costs of building the church, a project the family had financed. After suffering mixed fortunes, the house has since been carefully restored over the years by a succession of sympathetic owners. The property is Grade II* Listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Mapperton_Manor_House_-_geograph.org.uk_-_868201.jpg",
      "title": "Mike Searle / Mapperton Manor House",
      "caption": "Mapperton Manor House. Mapperton dates from the mid-C16 when it was built between 1540 and 1560 by its owner Robert Morgan. Only the north range (the Tudor wing) to the left remains of the original house, the remainder - the main front, is early C17. Today's owners are the Earl and Countess of Sandwich, whose family connections to Mapperton date back to the 1760s. Grade I Listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Parnham_House_-_geograph.org.uk_-_1178676.jpg",
      "title": "Sarah Smith / Parnham House",
      "caption": "Parnham House, just to the south of the town. Parnham was built circa 1400 and since then much restoration has taken place right up into the 20th Century. Stephen de Parnham was the first recorded owner and then the Strode and Oglander families lived there. More recently in the 1920's the house became a country club and an army hospital during WWII. In 1976 John Makepeace the well-known cabinet maker and craftsman established his school there. It is now in private ownership."
    }
  ],
  "distance_km": 17.7,
  "description": "This attractive Dorset town is well served by several waymarked footpaths running through the town and into the surrounding West Dorset countryside. It is also very near to several historic manor houses and the highest point in the county. This circular walk from the town climbs to Beaminster Down before visiting the historic Toller Whelme Manor House, Parnham House and Mapperton House. There's some lovely Dorset countryside with fine views from the hills to the north of the town. For most of the way the route makes use of the waymarked Wessex Ridgeway footpath which runs through the town and surrounding area. The route starts in the town centre and follows the Wessex Ridgeway north to Meerhay before picking up the Monarch's Way and following it east across Beaminster Down to Beaminster Bottom. You then head south, picking up the Wessex Ridgeway again and following it to Toller Whelme Manor House. The route continues south west past Dimstone Hill and Coltleigh Hill before arriving at another of the area's highlights at Mapperton House. After exploring the house you continue west past Coombe Down Hill and the 16th century Parnham House. The final section heads north along the River Brit on the Brit Valley Way, taking you back into Beaminster.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ollerod is a fine choice for some post walk refreshment. The food is of a very high quality and there's a lovely terrace and garden to sit out in on warmer days. You can find them at 3 Prout Bridge DT8 3AY. The Greyhound is another option in the town centre. They serve good quality pub food and provide a decent selection of ales. You can find them on the Square at postcode DT8 3AW."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails are ideal for dog walking. The Greyhound mentioned above is also very dog friendly. At Mapperton dogs are allowed on leads outside the Coach House but not in the Gardens or the House."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around the town follow the Wessex Ridgeway west to visit Lewesdon Hill, the highest point in Dorset. You could also pick up the Brit Valley Way in the town. Follow it south and it will take you along the River Brit to the Jurassic Coast at West Bay. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/By-Z-b3WY5k",
  "postcode": "DT8 3AW",
  "district": "Beaminster",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brassica Mercantile, Lynden Way, Beaminster, Dorset, England, DT8 3AW, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "pasture"
  ],
  "points_of_interest": [
    "historic manor houses",
    "countryside views",
    "footpath"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}