{
  "objectID": "d5e02efb6c76025b205bbeb6d425b573",
  "created_at": "2024-12-18T12:46:59.544811+00:00",
  "ref": "instow-walking-route",
  "title": "Instow Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Appledore%2C_viewed_from_the_beach%2C_at_Instow_-_geograph.org.uk_-_3055408.jpg/512px-Appledore%2C_viewed_from_the_beach%2C_at_Instow_-_geograph.org.uk_-_3055408.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/1BD569CD683CF056862588B5004BB91F/$FILE/Instow.gpx",
  "_geoloc": {
    "lat": 51.0519331855,
    "lng": -4.1810778148
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Appledore%2C_viewed_from_the_beach%2C_at_Instow_-_geograph.org.uk_-_3055408.jpg/512px-Appledore%2C_viewed_from_the_beach%2C_at_Instow_-_geograph.org.uk_-_3055408.jpg",
      "title": "Appledore, viewed from the beach, at Instow by Roger Cornfoot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Appledore, viewed from the beach, at Instow. The village includes this iver beach and sand dunes, which are home to some rare species of orchid including the pyramid orchid. During the height of the tourist season in the summer, the beach, also referred to as Instow Sands, is heavily frequented. The sandbanks at the mouth of the estuary cancel out most of the ocean swell, making the beach calm and ideal for families. On the sands, there are many anchored boats. Many can only be reached at low tide or by dinghy or what is known as a \"tender\" in the area. Utilising the open space and calm waters, windsurfing and kitesurfing have grown in popularity. Canoeing and kayaking are also popular."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/St_John%27s_church%2C_Instow_-_geograph.org.uk_-_3513412.jpg",
      "title": "St John's church, Instow by Mike Searle, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St John's church, Instow. The village is served by the Church of St John the Baptist, which has 13th/14th century origins and is designated as a Grade I listed building. This photo shows the churchyard with the estuary in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Instow_-_geograph.org.uk_-_31614.jpg",
      "title": "Tony Atkin / Instow",
      "caption": "This picture is taken from the south of the village and shows the old quayside where you can catch the ferry. In the summer, the service connects Appledore slipway and Instow Quay across the Torridge estuary. There are two hours of service on either side of high tide. This service, which is aimed at both residents and visitors who use the Tarka Trail and South West Coast Path, has recently been provided on days when the estuary's water levels have been high enough as a not-for-profit endeavour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Marine_Parade%2C_Instow_-_geograph.org.uk_-_3055386.jpg/512px-Marine_Parade%2C_Instow_-_geograph.org.uk_-_3055386.jpg",
      "title": "Marine Parade, Instow by Roger Cornfoot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Marine Parade, Instow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Abandoned_boats_on_the_Torridge_-_geograph.org.uk_-_1359442.jpg",
      "title": "Philip Halling / Abandoned boats on the Torridge",
      "caption": "Abandoned boats on the Torridge north of Bideford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Bideford_Long_Bridge_-_geograph.org.uk_-_2824681.jpg/512px-Bideford_Long_Bridge_-_geograph.org.uk_-_2824681.jpg",
      "title": "Bideford Long Bridge by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bideford Long Bridge. The bridge spans the River Torridge near its estuary and connects the old part of the town, and formerly important river port, of Bideford on the left bank (west side) with East-the-Water on the right bank (east side). It is one of the longest mediaeval bridges in England, being 677 feet (222 yards) long with 24 arches."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/The_River_Torridge_-_geograph.org.uk_-_1363228.jpg",
      "title": "Philip Halling / The River Torridge",
      "caption": "The River Torridge near Northam viewed from the Torridge Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Appledore_riverfrontage_%28geograph_4436071%29.jpg",
      "title": "Philip Halling / Appledore riverfrontage",
      "caption": "Appledore river frontage. The village is the home of Appledore Shipbuilders, a lifeboat slipway and Hocking's Ice Cream, a brand of ice cream only sold in North Devon. Appledore is a charming fishing community with a rich maritime history and deilightful pastel homes. It has winding, narrow streets and colourful houses. The village was founded on an ongoing tradition of fishing and boat building. For many years, Appledore served as a significant shipbuilding hub for the area, and many locals still find work in the village's sizable indoor shipyard. The North Devon Maritime Museum is now located in the village due to its long maritime history."
    }
  ],
  "distance_km": 10.0,
  "description": "This delightful Devon village sits in a lovely spot where the rivers Taw and Torridge meet. Notable features include a lovely riverside beach and a church dating back to the 13th century. This route from the village makes use of the Tarka Trail and the South West Coast Path to visit neighbouring Appledore on the opposite side of the river. During the summer months you can catch the ferry back at the end of the walk. The walk starts from the village quay and takes you south along the River Torridge and the Tarka Trail to Bideford. Here you cross the river on Bideford Old Bridge and pick up the South West Coast Path on the other side. Follow the path north and it will take you past Northam to Appledore where you can pick up the seasonal ferry service to return you to Instow.",
  "video_url": "https://www.youtube.com/embed/7eLs_1cG8kA",
  "postcode": "EX39 4JW",
  "district": "Instow",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}