{
  "created_at": "2025-01-06T04:56:47.845392+00:00",
  "objectID": "d5e9fc0d00df9c3fdbe385a836f71f93",
  "ref": "lyveden-way-walking-route",
  "title": "Lyveden Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/32/The_Lyveden_Way_-_geograph.org.uk_-_49314.jpg",
  "nearby": [
    {
      "description": "Fermyn Woods",
      "objectID": "0cdf6632ade4d869c2e2ab1c1df278b4",
      "ref": "fermyn-woods-walking-and-cycle-route"
    },
    {
      "description": "Titchmarsh Nature Reserve",
      "objectID": "ce52019fa42cc2e75f7bab25f7d24381",
      "ref": "titchmarsh-nature-reserve-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d5e9fc0d00df9c3fdbe385a836f71f93.gpx",
  "_geoloc": {
    "lat": 52.4545094007,
    "lng": -0.599622847
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/The_Lyveden_Way_-_geograph.org.uk_-_49314.jpg",
      "title": "Kokai / The Lyveden Way",
      "caption": "A new bridge has been installed on this section of the trail near Wadenhoe and Lilford Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/The_Lyveden_Way_-_geograph.org.uk_-_49337.jpg",
      "title": "Kokai / The Lyveden Way",
      "caption": "Assart's Coppice is to the left. Sling's Nook is ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Lyveden_Way_way-marker_in_Fermyn_Wood_Country_Park_-_geograph.org.uk_-_378627.jpg",
      "title": "Tim Heaton / Lyveden Way way-marker in Fermyn Wood Country Park",
      "caption": "Lyveden Way way-marker in Fermyn Wood Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Green_Side_Wood_-_geograph.org.uk_-_49331.jpg",
      "title": "Kokai / Green Side Wood",
      "caption": "Green Side Wood. Footpath through edge of the wood - part of the Lyveden Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Lyveden_New_Bield%2C_Snail_Mount_and_Moat_-_geograph.org.uk_-_324723.jpg",
      "title": "Nigel Stickells / Lyveden New Bield, Snail Mount & Moat",
      "caption": "Lyveden New Bield, Snail Mount & Moat. Lyveden New Bield was built between 1595 & 1605 by Sir Thomas Tresham to represent his Catholic faith. The building, of cruciform plan and with many decorative religious devices, was never completed after his death in 1605. The snail mount on the left and moat were all part of his elaborate design for a typical Elizabethan garden, including the orchard shown in other views within this square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Memorial_at_entrance_to_Lyveden_Airfield_-_geograph.org.uk_-_378090.jpg",
      "title": "Tim Heaton / Memorial at entrance to Lyveden Airfield",
      "caption": "Memorial at entrance to Lyveden Airfield. In memory of aircrew from the Royal Australian Air Force and the RAF killed during a Lancaster crash in 1943."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Orchard_Trees_at_Lyveden_New_Bield_-_geograph.org.uk_-_324718.jpg",
      "title": "Nigel Stickells / Orchard Trees at Lyveden New Bield",
      "caption": "Orchard Trees at Lyveden New Bield. These trees newly planted by the National Trust include the Juglan Regia or Walnut shown nearest camera, as well as various original varieties of apple, pear, cherry and plum/damson/gage. Also visible in the background is one of the two original garden Viewing Mounts connected by the Raised Terrace Walk running across the top of the orchard."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/The_New_Orchard_at_Lyveden_New_Bield_-_geograph.org.uk_-_324714.jpg",
      "title": "Nigel Stickells / The New Orchard at Lyveden New Bield",
      "caption": "The New Orchard at Lyveden New Bield. Sir Thomas Tresham described the planting of an orchard at Lyveden in 1597 but shortly after his death in 1605, it is thought that the orchard was lifted and some trees sold to Robert Cecil for his new house at Hatfield. This new orchard was re-planted from 2002 by the National Trust with the help of private sponsors. Also visible in this view is the roofline of Lyveden Old Bield."
    }
  ],
  "distance_km": 16.0,
  "description": "This fine long distance path explores the woodland and country trails around Fermyn Woods in Northamptonshire. It runs for just under 10 miles on a series of fairly flat public footpaths. Start the walk from the car park at Fermyn Woods and then follow the trails east along the edge of the Tresham Coppice. The route continues south east to Assart's Coppice and then through Lady Wood and Souther Wood where you emerge into the countryside. Continue heading east and you will soon come to the River Nene and the village of Wadenhoe. It's a very pretty little village with old cottages and mills next to the river. At the village you turn around and head north west to Wadenhoe Wood and Lilford Wood before coming to Lyveden itself. This fine National Trust property includes an Elizabethan lodge and moated garden. Work on the mansion stopped in 1605 and it has remained in its incomplete state since then. Highlights include the picturesque moat and the Elizabethan orchard. There is an audio tour where you can find out about the Trensham family who built the home. It's an interesting story as they were involved with the Gunpowder Plot. The final section takes you west from the house to pick up the paths back through Fermyn Woods to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back at Fermyn Woods you can enjoy refreshments at the Skylark cafe. There's seating inside and out plus a good range of meals and snacks to choose from. On the route you could stop off at the 17th century King's Head in Wadenhoe. They have a particularly lovely garden area next to the river where you can watch the boats go by with your meal. You can find the pub at postcode PE8 5ST for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "With its country and woodland trails the route is ideal for dog walking. You'll see plenty of other dogs, especially around Fermyn Woods. The King's Head mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At Wadenhoe the route links with the Nene Way where you can enjoy some nice riverside paths. You could follow the river south to visit Titchmarsh Nature Reserve where there are some excellent wildlife spotting opportunites. For more walking ideas in the area see the Northamptonshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BbAqEhqkeT8",
  "postcode": "NN14 3JE",
  "county": "North Northamptonshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brigstock Bypass, Brigstock, North Northamptonshire, England, NN14 3JE, United Kingdom",
  "district": "Brigstock",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "country"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "gardens",
    "museum"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "audio tour",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}