{
  "created_at": "2025-01-06T08:01:08.796706+00:00",
  "objectID": "d5ee48b15f4e68a98d723006c80aab1d",
  "ref": "arlington-reservoir-walking-route",
  "title": "Arlington Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Arlington_Reservoir_-_geograph.org.uk_-_1385039.jpg",
  "nearby": [
    {
      "description": "Abbot's Wood",
      "objectID": "bdaf781d2482e7bbc0b7be94090cbc6f",
      "ref": "abbots-wood-walking-route"
    },
    {
      "description": "Vanguard Way",
      "objectID": "d526829c942476c5ae331b2b89b7b812",
      "ref": "vanguard-way-walking-route"
    },
    {
      "description": "Wealdway",
      "objectID": "3ab807df03695a62363e92d8ce79393c",
      "ref": "wealdway-walking-route"
    },
    {
      "description": "Hailsham",
      "objectID": "62fdd68cd42a7bff1325f1c6ad72f834",
      "ref": "hailsham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d5ee48b15f4e68a98d723006c80aab1d.gpx",
  "_geoloc": {
    "lat": 50.8463035269,
    "lng": 0.1701954709
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Arlington_Reservoir_-_geograph.org.uk_-_1385039.jpg",
      "title": "Simon Carey / Arlington Reservoir, via Wikimedia Commons",
      "caption": "Arlington Reservoir. Catching the late evening sun. The valve tower is to the right with the tower of St Pancras church Arlington beyond whilst the nature reserve on the north bank is visible to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Arlington_Reservoir_-_geograph.org.uk_-_1384730.jpg",
      "title": "Simon Carey / Arlington Reservoir, via Wikimedia Commons",
      "caption": "Looking across the reservoir from the north east with Windover Hill providing the backdrop. The reservoir was constructed in 1971 cutting out a loop in the Cuckmere River."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Arlington_Reservoir_-_geograph.org.uk_-_1384722.jpg",
      "title": "Simon Carey / Arlington Reservoir, via Wikimedia Commons",
      "caption": "The western edge of the reservoir that juts out into this square. Constructed in 1971 cutting out a loop in the Cuckmere River with much of the spoil used to create the nature reserve to the north. The reservoir is also used for fishing and water sports."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Arlington_Reservoir_-_geograph.org.uk_-_942028.jpg",
      "title": "Simon Carey / Arlington Reservoir, via Wikimedia Commons",
      "caption": "Small portion of the reservoir that sticks out into this square. Built in 1971 to provide water for the Eastbourne area it is also a nature reserve. Windover Hill is in the background."
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy a nice easy stroll around the pretty Arlington Reservoir on this short circular walk near Hailsham. There's parking on the western side of the reservoir and a good path running around the perimeter. The walk includes a woodland section at the start before reaching the dam where there are fabulous views across the Downs and the Long Man of Wilmington, The area is also a nature reserve and excellent for bird watching with 173 recorded bird species and a wintering population of up to 10,000 wildfowl. Look out for great crested grebe, swallow, mallard, pied wagtail and cormorants.These can best be observed from the bird hide. The reservoir can also be easily accessed by train - get off at Berwick station and a short walk north takes you to the start of the walk. If you'd like to continue your walking in the area then you could pick up either the Vanguard Way or the Wealdway which both run past Arlington. About a mile to the east you will find the pretty Abbot's Wood. There's two nice waymarked walking trails to try in the bluebell woods.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east of the reservoir you'll find the noteworthy Old Oak Inn. This 18th Century oak beam traditional English pub has a good menu and selection of drinks. There's also a splendid garden area where you can sit out and enjoy lunch on fine days. Large family tables for 8 offer outside seating for up to 150 persons with views of the countryside and the adjacent Abbot's Wood. It's the ideal spot to relax in when the sun is shining. You can find the pub in the little village of Arlington on the western fringes of the woods. The postcode for your sat navs is BN26 6SJ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir is a nice place for dog walk and you will probably see other owners on your outing. The Old Oak Inn mentioned above is also dog friendly and Abbot's Wood, next to the pub, is another popular spot to walk your pooch."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The reservoir is reachable on foot from Hailsham by following the waymarked Wealdway south west. This section of the path will take you past one of the notable local attractions at Michelham Priory at Upper Dicker. This former Augustine Priory dates from the 13th century and includes some original buildings which are Grade I and Grade II listed. It's a very pretty site with a watermill in the grounds of the priory which has been restored to working order and is open to the public. You can easily walk there from the reservoir by following the waymarked trail north along the Cuckmere River for about 1.5 miles.  Above:Michelham Priory views. An idyllic setting with with the lovely pond and house on the right."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ryh6CCblOns?si=pmytmYCn8FeA4xIU",
  "postcode": "BN26 6TG",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Station Road, Arlington, Wealden, East Sussex, England, BN26 6TG, United Kingdom",
  "district": "Wealden",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "path"
  ],
  "points_of_interest": [
    "viewpoints",
    "nature reserve",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "bird hide",
    "waymarked trails"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}