{
  "created_at": "2025-01-06T02:58:40.353676+00:00",
  "objectID": "d64a22f345b4eec18f806ccd466f1618",
  "ref": "kirkstall-abbey-walking-route",
  "title": "Kirkstall Abbey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Kirkstall_Abbey_grounds_-_geograph.org.uk_-_140549.jpg",
  "nearby": [
    {
      "description": "Leeds Canal Walk",
      "objectID": "00101010e3bcde4ddc7de1c1bbef8aa2",
      "ref": "leeds-canal-walk-walking-route"
    },
    {
      "description": "Rodley Nature Reserve",
      "objectID": "becce7e98c353aa03d8035888c07204c",
      "ref": "rodley-nature-reserve-walking-route"
    },
    {
      "description": "Aire Valley Towpath",
      "objectID": "0ad5eba480cfa21abd6d9c6f5cf89ffc",
      "ref": "aire-valley-towpath-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d64a22f345b4eec18f806ccd466f1618.gpx",
  "_geoloc": {
    "lat": 53.8196278175,
    "lng": -1.6045412736
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Kirkstall_Abbey_grounds_-_geograph.org.uk_-_140549.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Crocuses in the grounds of the Abbey in the spring of 2006. At the western end looking north towards the tennis courts and Abbey Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Kirkstall_Abbey_-_geograph.org.uk_-_140574.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Kirkstall Abbey. Seen from the grounds to the south-west. The Lay Brothers Reredorter (buildings in the foreground) is being converted into a Visitor Centre. Composite of 2 photos."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Sluice_gate%2C_River_Aire%2C_Kirkstall_Abbey%2C_Leeds_-_geograph.org.uk_-_105028.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Sluice gate, River Aire. This is the sluice gate at the entrance to the goit (millrace) which leaves the River Aire at the weir by the Abbey. The weir is out of the picture at the right. The small building presumably houses the controls for the sluice gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Kirkstall_Abbey_-_geograph.org.uk_-_360977.jpg",
      "title": "Paul Glazzard / Kirkstall Abbey",
      "caption": "Western end of the ruined church at Kirkstall Abbey, built by Cistercian monks from Fountains Abbey between 1152 and 1182. Located on the northern bank of the River Aire it was closed by Henry VIII in November 1539, after which the buildings were stripped and the materials reused in local building projects."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/River_Aire_near_Kirkstall_Abbey_-_geograph.org.uk_-_140552.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "River Aire near the Abbey. Taken from the western end of the Abbey grounds, looking north-west. The river flows towards the camera."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Remains_of_the_Guesthouse%2C_Kirkstall_Abbey_-_geograph.org.uk_-_140584.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Remains of the Guesthouse. This is part of the remains of the Guesthouse of the Abbey, the main part in the foreground, and the Great Chamber beyond, with part of its outside wall standing above the rest. The building in the background is the Abbey House Museum, which incorporates the original gatehouse - the gate was in the round arch between 2 trees on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Bridge_in_Kirkstall_Abbey_grounds_-_geograph.org.uk_-_140547.jpg/256px-Bridge_in_Kirkstall_Abbey_grounds_-_geograph.org.uk_-_140547.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Bridge in the Abbey grounds. This bridge crosses a ditch at the western end of the grounds of Kirkstall Abbey (which can be seen through the trees). The River Aire is out of the picture to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Goit_by_Kirkstall_Abbey%2C_Leeds_-_geograph.org.uk_-_104906.jpg",
      "title": "RichTea / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Goit by the Abbey. A goit is a man-made channel, which carries water from a river to drive a mill further down stream. This picture was taken from the platform above the sluice gates where the goit starts by the weir at the Abbey."
    }
  ],
  "distance_km": 1.0,
  "description": "This walk explores the ruins of a former Cistercian monastery on the River Aire in Leeds. There's some nice paths to follow around the grounds of the 12th century abbey with views of the River Aire and woodland trails to enjoy on the way. There's also a visitor centre with interactive exhibits where you can find out about the lives of the monks who made the abbey their home. You'll also learn about the history of the site which was constructed in 1152 and is now a Grade I listed building and Scheduled Ancient Monument. You can start your walk from the large free car park situated next to Abbey House Museum on Abbey Walk. Entrance to the ruins is also free. To continue your walking in the area you can pick up the Leeds Canal Walk which takes you along the Leeds & Liverpool Canal into the city centre. On the way you can visit the nearby Kirstall Valley Nature Reserve and the Rodley Nature Reserve where there are more nice trails and lots of wildlife to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site Gatehouse Café is a lovely place for some refreshments after your walk. It's set in a splendid building with Cistercian arches and gothic style windows. Outside there's a delightful courtyard where you can relax on warmer days."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is dog friendly but they do need to be on leads within the fenced off area around the ruins."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's a splendid outdoor market set within the abbey grounds on the last weekend from March to November. It features unique makers and producers from Leeds and the surrounding areas. If you pick up the canal towpath you could head west and visit Calverley Woods. The woods have a network of footpaths and mountain bike trails and include bluebell woodland, an old walled garden and hidden grottoes. Just west of the abbey you can visit the attractive Horsforth Hall Park where there is a lovely Japanese Garden to see. For more walking ideas in the county see the For more walking ideas in the area see the Yorkshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tKT1RfbCYjY?start=103",
  "postcode": "LS5 3JF",
  "district": "Leeds",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Abbey Road, Kirkstall, Leeds, West Yorkshire, England, LS5 3JF, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserves",
    "museum"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}