{
  "objectID": "d665e7d51cfcd4028798f8e1a0ff745a",
  "created_at": "2024-12-18T10:00:08.614488+00:00",
  "ref": "hadleigh-country-park-walking-and-cycle-route",
  "title": "Hadleigh Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/74/Autumn_in_Hadleigh_Castle_Country_Park_-_geograph.org.uk_-_1011126.jpg",
  "nearby": [
    {
      "description": "Canvey Island",
      "objectID": "8e280b955853b00dd08c83747ede36a2",
      "ref": "canvey-island-walking-route"
    },
    {
      "description": "Saffron Trail",
      "objectID": "564ec8229b64f39c61218304a8fd9110",
      "ref": "saffron-trail-walking-route"
    },
    {
      "description": "Two Tree Island",
      "objectID": "ea9b4a7741ca9b27744d000dffe8c42d",
      "ref": "two-tree-island-walking-route"
    },
    {
      "description": "Essex Way",
      "objectID": "d9046b5c14755e51bd15de0c582f5292",
      "ref": "essex-way-walking-route"
    },
    {
      "description": "Stoke By Nayland",
      "objectID": "775d344c816bcbe2e47b2443eed12602",
      "ref": "stoke-by-nayland-walking-route"
    },
    {
      "description": "Polstead",
      "objectID": "cf36d08184ea3c9ea72a1e58299785a2",
      "ref": "polstead-walking-route"
    },
    {
      "description": "Benfleet to Leigh on Sea",
      "objectID": "11eec23830d48ee9e55272460e332188",
      "ref": "benfleet-to-leigh-on-sea-walking-route"
    },
    {
      "description": "Belfairs Woods",
      "objectID": "16337b2a36dfaf76b69e2a3426d58439",
      "ref": "belfairs-woods-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/709456FB60CA9CEA86257C7D004AF0AC/$FILE/Hadleigh Country Park.gpx",
  "_geoloc": {
    "lat": 51.5522829451,
    "lng": 0.5938250954
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Autumn_in_Hadleigh_Castle_Country_Park_-_geograph.org.uk_-_1011126.jpg",
      "title": "Trevor Harris / Autumn in Hadleigh Castle Country Park",
      "caption": "A dog poses for a photo in the autumn sun"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Aerial_view_of_Hadleigh_Country_Park%2C_parking_area_-_geograph.org.uk_-_1564297.jpg",
      "title": "Edward Clack / Aerial view of Hadleigh Country Park, parking area",
      "caption": "Aerial view of Hadleigh Country Park, parking area. The car parking are for the Country Park (accessed via Chapel Lane) lies below left of centre. Chapel Lane itself lies out of view below the area of the photo. The road running from near the upper centre, down to the below centre right is Benfleet Road. The darker of the two pools visible here is long established, the paler pool (bottom left) is more recent in origin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Canvey_Island_seen_from_Hadleigh_Country_Park_-_geograph.org.uk_-_552852.jpg",
      "title": "Dave Playfair / Canvey Island seen from Hadleigh Country Park",
      "caption": "Canvey Island seen from Hadleigh Country Park. The sun shining over Canvey Leigh Beck and reflecting off the waters of Benfleet Creek on a bright winter's day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Aerial_view_of_Hadleigh_Country_Park%2C_western_end_-_geograph.org.uk_-_1564208.jpg",
      "title": "Edward Clack / Aerial view of Hadleigh Country Park, western end",
      "caption": "Aerial view of the western end of the park. This shows the two types of habitat in Hadleigh Country Park. The higher ground and slopes (Hadleigh Downs) occupy a band from just above centre-left to just below centre-right. Below and to the right of this is the Hadleigh Marsh. The pale line at the edge of this is to top of the (recently completed) new sea wall. To the left of this is Benfleet Creek, with Canvey Island on the other side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Opening_of_Hadleigh_Castle_Country_Park_in_1987_-_geograph.org.uk_-_1535748.jpg",
      "title": "John Rostron / Opening of Hadleigh Castle Country Park in 1987",
      "caption": "Opening of Hadleigh Castle Country Park in 1987. The park was a long time in gestating. Much of the drive for its establishment came from Councillor Dennis Nisbet, seen in this image at the opening ceremony. The park was officially opened at this event by Sir Derek Barber, chairman of the Countryside Commission. However, I have shown Dennis Nisbet as I consider he was the one worthy of illustration! The date was sometime in the summer of 1987."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Aerial_view_of_Hadleigh_Castle_and_Country_Park_-_geograph.org.uk_-_1563595.jpg",
      "title": "Edward Clack / Aerial view of Hadleigh Castle and Country Park",
      "caption": "Aerial view of Hadleigh Castle. Hadleigh Castle is not actually in the country park (which is probably why they changed the name from 'Hadleigh Castle Country Park' to 'Hadleigh Country Park'). This view shows the remains of the castle on a mound overlooking the estuary. In its heyday, the castle would have been right next to the estuary. Today, the middle distance is occupied by Hadleigh Marsh. The area of this beyond the railway line (across the centre) is now used for growing vegetables. Beyond this, near the top centre, the triangular pool is at the western tip of Two-Tree Island. Since this photo was taken, this pool has been colonised by Avocets, and these have recently bred successfully there."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Aerial_view_of_the_Salvation_Army_Farm%2C_Hadleigh_-_geograph.org.uk_-_1594246.jpg",
      "title": "Edward Clack / Aerial view of the Salvation Army Farm, Hadleigh",
      "caption": "Aerial view of the Salvation Army Farm, Hadleigh. The Salvation Army Farm is part of a wider training centre offered by the Salvation Army. The farm has been a presence in the local landscape since 1891 when William Booth founded the Farm Colony. Today it offers a Tea Room facility for visitors to Hadleigh Country Park and the Farm itself."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Aerial_view_of_the_western_end_of_Benfleet_Downs_-_geograph.org.uk_-_1599042.jpg",
      "title": "Edward Clack / Aerial view of the western end of Benfleet Downs",
      "caption": "Aerial view of the western end of Benfleet Downs. The lower part of the photo is the western end of Benfleet Downs (Hadleigh Country Park). Much of the woodland is Hawthorn scrub which, over the intervening years, has extended and been cut back. The road bordering the downs is St Mary's Road, and Essex Way runs across the top half."
    }
  ],
  "distance_km": 5.5,
  "description": "This lovely park is located on the Thames Estuary near Southend on Sea. The park is nearly 400 acres in size and includes a mix of woodland, pasture, hay meadow and marsh.  There are a number of great trails suitable for cyclists and walkers. There is also the 13th century Hadleigh castle ruins where there are fabulous views of the surrounding Essex countryside and the River Thames. The Saffron Trail passes through the park so you can pick this up to extend your walk. The long distance trail takes you from the coast at Southend-on-Sea to Saffron Walden through some lovely Essex countryside. Just to the east of the park you will find the Two Tree Island nature reserve. The expansive site has some nice footpaths taking you around grassland, scrub, reedbed and lagoons. If you head south from the park you can cross Benfleet Creek and pick up the coastal path around Canvey Island .",
  "postcode": "SS7 1QF",
  "district": "Hadleigh",
  "county": "Essex",
  "region": "Eastern",
  "country": "England"
}