{
  "created_at": "2025-01-06T00:41:01.044517+00:00",
  "objectID": "d71bdff5b4bc7511bbd8ce85fadd0d35",
  "ref": "worth-way-walking-and-cycle-route",
  "title": "Worth Way Walk and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/be/A_snowy_Worth_Way_-_geograph.org.uk_-_1653024.jpg",
  "nearby": [
    {
      "description": "Crawley",
      "objectID": "16cdf0fc2f3a8e9a62fc034b164818fd",
      "ref": "crawley-walking-route"
    },
    {
      "description": "East Grinstead",
      "objectID": "ca98d53eb035b1793d8a78c8e54f12ce",
      "ref": "east-grinstead-walking-route"
    },
    {
      "description": "Tilgate Country Park",
      "objectID": "932784aa773770c9eb2712300180605a",
      "ref": "tilgate-country-park-walking-and-cycle-route"
    },
    {
      "description": "National Cycle Route 21",
      "objectID": "3c9665254d29bb047cc9d28285bcaf79",
      "ref": "national-cycle-route-21-cycle-route"
    },
    {
      "description": "Crawley Down",
      "objectID": "1a5877e6232fbecafc34248117dc2fbc",
      "ref": "crawley-down-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d71bdff5b4bc7511bbd8ce85fadd0d35.gpx",
  "_geoloc": {
    "lat": 51.1153227197,
    "lng": -0.160176099
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/A_snowy_Worth_Way_-_geograph.org.uk_-_1653024.jpg",
      "title": "Robin Webster / A snowy Worth Way",
      "caption": "A snowy Worth Way. A long straight embanked section of the old railway, normally a fairly open part in winter, but today shaded by the heavy snow cover. The trail follows much of the route of the dismantled Three Bridges to Tunbridge Wells Central Line, which opened in 1855 and closed in 1967 as part of the railway cuts led by Richard Beeching, a local resident of East Grinstead and Chairman of the British Transport Commission. In 1977, West Sussex County Council purchased approximately four miles (6.4 km) of the disused line, mostly within the parish of Worth, and officially reopened it as a footpath and bridleway on 10 July 1979."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Path_junction%2C_Worth_Way_-_geograph.org.uk_-_1619037.jpg",
      "title": "Robin Webster / Path junction, Worth Way",
      "caption": "Path junction, Worth Way. The trail goes straight on in a deepening cutting to pass under the B2028, the turn left follows the edge of the cutting uphill to reach the B2028 on the level. The trail is managed by Crawley Borough Council for the section between Three Bridges and the M23, while West Sussex County Council oversees the remainder of the route. It is maintained through careful and sympathetic management aimed at preserving a balance of tree and shrub diversity. This involves coppicing, where trees and shrubs are cut back to their base on a rotating schedule, promoting regrowth that provides nesting habitats for birds. Open areas are regularly mown to prevent encroachment by scrub, creating ideal conditions for species that thrive in open environments, such as primroses and various insects. Additionally, the ditches along the route are important for both maintaining dry paths and supporting wildlife. The Crawley Down Pond is also a focal point for local environmental efforts. Originally started in 1999 by a small group of volunteers collecting litter, this environmental group has since grown, meeting monthly between September and May to carry out projects such as installing a new bank to prevent flooding. This management approach helps ensure the Worth Way remains a valuable habitat for wildlife while offering a well-maintained route for walkers and nature enthusiasts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Security_Gate_by_Worth_Way_-_geograph.org.uk_-_1653007.jpg",
      "title": "Robin Webster / Security Gate by Worth Way",
      "caption": "Security Gate by the trail. The Way, following the old railway, crosses the road on the level at the viewpoint - the abutment of the dismantled railway bridge is at left. The road goes to Rowfant Business Centre, formerly a brickworks. The trail is now designated as a Site of Nature Conservation Importance within an Area of Outstanding Natural Beauty. Over time, the former railway cuttings and embankments have transformed into rich woodland, with trees like silver birch, ash, hazel, and sallow establishing themselves. This habitat is especially beneficial for wildlife, supporting over 200 species of insects, butterflies such as the brimstone, white admiral, and meadow brown, and a variety of birds like the nuthatch and chiffchaff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Wallage_Lane_from_Worth_Way_-_geograph.org.uk_-_43992.jpg",
      "title": "Simon Carey / Wallage Lane from Worth Way",
      "caption": "Wallage Lane from the trail. Taken from the former railway bridge just after the lane has taken a sharp right to go underneath it. On the trail you can look out for reptiles including adders, grass snakes, and the common lizard. Roe deer and foxes thrive in the adjoining farmland. The kingfisher has even been spotted at Crawley Down Pond, and bats can be seen near dusk. The Worth Way's transformation into a thriving wildlife corridor highlights its ecological importance to the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Bridge_over_old_railway_-_geograph.org.uk_-_1093762.jpg",
      "title": "Ian Capper / Bridge over old railway",
      "caption": "Bridge over old railway. This is where Church Road, Worth, crosses the cutting of the former Three Bridges to East Grinstead railway, opened in 1855 and closed in the 1960s. To the west of here, the trackbed forms part of the Worth Way cycle/footpath, which is part of National Cycle Network route 21. However, due to cutting infill further east, including the blocking of the route by the M23 motorway, the cycle route leaves the old railway at this point for around a mile."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Imberhorne_Lane_bridge_-_geograph.org.uk_-_44011.jpg/256px-Imberhorne_Lane_bridge_-_geograph.org.uk_-_44011.jpg",
      "title": "Simon Carey / Imberhorne Lane bridge",
      "caption": "Imberhorne Lane bridge. Carries Imberhorne Lane over Worth Way. In the summer of 1999, the Worth Way trail underwent resurfacing to enable its integration into the Sustrans National Cycle Network. Contractors Edburtons laid a 2.5m wide path using a combination of natural materials to accommodate walkers, cyclists, and horse riders. This project, which lasted for eight weeks, cost £300,000 and was jointly funded by West Sussex County Council, Mid Sussex County Council, the National Lottery Millennium Fund, and Eurobell (now Virgin Media), the latter of which contributed funds in exchange for laying telecommunications cables under the path. The works were completed alongside the final section of the Worth Way at Station Hill near Three Bridges station, creating a new connection with the Forest Way trail at Herontye Drive in East Grinstead. This link extended Route 21 of the National Cycle Network, connecting London, Reigate, and Gatwick Airport with East Grinstead, Heathfield, and Eastbourne. This project improved the accessibility of the Worth Way for multiple users and reinforced its place as part of a wider cycling and walking infrastructure in the region."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Old_railway_route_-_geograph.org.uk_-_1093766.jpg",
      "title": "Ian Capper / Old railway route",
      "caption": "Old railway route. The cutting of the former Three Bridges to East Grinstead railway, opened in 1855 and closed in the 1960s. The trackbed here forms part of the Worth Way cycle/footpath, which is part of National Cycle Network route 21, towards Three Bridges."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/NCN_Millennium_Milepost_MP1006_East_Grinstead_West_Sussex.jpeg/512px-NCN_Millennium_Milepost_MP1006_East_Grinstead_West_Sussex.jpeg",
      "title": "Peter Trimming / Worth Way",
      "caption": "NCN Millennium Milepost MP1006. East Grinstead West Sussex"
    }
  ],
  "distance_km": 11.0,
  "description": "This 7 mail long bridleway and footpath runs along National Cycle Route 21 from Crawley to East Grinstead. The tree lined path follows the trackbed of a disused railway line making for a nice flat easy walk or cycle ride. The path and surrounding area are also blessed with a variety of wildlife - look out for Roe Deer, foxes and Kingfishers as you make your way along the path. On the way you'll pass the village of Crawley Down where there's the Worth Way Country Park and a pretty pond.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In East Grinstead The Ship Inn is a good choice for a pit stop. They do very good food and have an attractive interior with a cosy fire for cold days. If the weather is fine there's a nice terraced garden outside too. You can find the pub on Ship Street at a postcode of RH19 4EG for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Crawley head to Tilgate Forest Park to continue your exercise. The expansive forest has some good mountain bike trails and miles of footpaths to try. There's also lakes, lawns and gardens to explore. For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/p1odfLb71bw",
  "postcode": "RH10 7AU",
  "district": "Crawley",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}