{
  "created_at": "2025-01-06T03:58:21.419030+00:00",
  "objectID": "d7961b2f81b9501656106a84df0c8c49",
  "ref": "high-stile-walking-route",
  "title": "High Stile Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Buttermere_-_geograph.org.uk_-_286845.jpg",
  "nearby": [
    {
      "description": "Ennerdale Water",
      "objectID": "e80e86107013e92fb3a9b4fb58254edd",
      "ref": "ennerdale-water-walking-route"
    },
    {
      "description": "Crummock Water",
      "objectID": "778948ecf18acc2fa4dcc7adb47b1ed1",
      "ref": "crummock-water-walking-route"
    },
    {
      "description": "Buttermere",
      "objectID": "9e5cd22c37b1be41a492341eb97fe4f6",
      "ref": "buttermere-walking-route"
    },
    {
      "description": "Langdale Pikes",
      "objectID": "e13b02cbeda30e31600a89d9170e0f47",
      "ref": "langdale-pikes-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d7961b2f81b9501656106a84df0c8c49.gpx",
  "_geoloc": {
    "lat": 54.5422929707,
    "lng": -3.2733303465
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Buttermere_-_geograph.org.uk_-_286845.jpg",
      "title": "Richard Webb / Buttermere",
      "caption": "Buttermere village. View past the Fish to Dodd, a little mentioned 2000' top of High Stile"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Sour_Milk_Gill_with_Dodd_behind_-_geograph.org.uk_-_320312.jpg",
      "title": "Espresso Addict / Sour Milk Gill with Dodd behind",
      "caption": "Sour Milk Gill with Dodd behind. View up Sour Milk Gill, showing typical vegetation at this elevation of heather with occasional stunted trees, including larch and rowan. One of many waterfalls on the stream can be seen. The popular footpath up the Gill is just visible on the left, showing the stone steps to reduce erosion damage. The hill behind is Dodd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/High_Stile_-_geograph.org.uk_-_290360.jpg",
      "title": "Richard Webb / High Stile",
      "caption": "High Stile. The ridge dividing Buttermere and Ennerdale. Approach from Red Pike. The summit is not visible, it is on a side ridge to the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/View_of_Red_Pike_from_the_ascent_of_High_Stile_-_geograph.org.uk_-_320319.jpg",
      "title": "Espresso Addict / View of Red Pike from the ascent of High Stile",
      "caption": "View of Red Pike from the ascent of High Stile. View northwards along the broad grassy ridge joining High Stile (foreground) with Red Pike in NY1615. The reddish tinge to the ridge connecting Red Pike with Dodd (right) is clearly visible from this view. Bleaberry Tarn lies in the hollow between the two ridges. In the distance, Crummock Water is just visible (right)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Red_Pike_and_Bleaberry_Tarn_-_geograph.org.uk_-_216929.jpg/256px-Red_Pike_and_Bleaberry_Tarn_-_geograph.org.uk_-_216929.jpg",
      "title": "Espresso Addict / Red Pike and Bleaberry Tarn",
      "caption": "Red Pike and Bleaberry Tarn. The reddish soil that presumably gives Red Pike its name is in evidence here"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Comb_Crags_-_geograph.org.uk_-_782556.jpg",
      "title": "Andrew Smith / Comb Crags",
      "caption": "Comb Crags. Crags at the top of Burtness Comb on the ridge between High Stile and High Crag. In the background are the Scafell Pikes to the right and Great Gable to the left of centre. Kirk Fell is the sunlit fell below the skyline. The Langdale Pikes are in the far distance to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/High_Crag_-_geograph.org.uk_-_782576.jpg",
      "title": "Andrew Smith / High Crag",
      "caption": "High Crag"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Looking_down_on_Seat_-_geograph.org.uk_-_879446.jpg",
      "title": "Slbs / Looking down on Seat",
      "caption": "Looking down on Seat. The path down from High Crag that leads to Seat is quite steep and rubble-strewn."
    }
  ],
  "distance_km": 12.0,
  "description": "This walk climbs to the summit of High Stile in the Lake District. The walk follows the High Stile Ridge taking in the Buttermere fells of Red Pike, High Stile and High Crag. It's a challenging walk with a steep ascent and descent, but you are rewarded with fabulous views over the surrounding lakes and the North Western Fells. The walk starts in Buttermere, passing the lake before climbing Red Pike via the pretty Bleaberry Tarn. From the summit of Red Pike there are wonderful views over a number of lakes including Derwentwater, Buttermere, Crummock Water, Ennerdale Water and Loweswater. The route then climbs to the summit of High Stile, passing Chapel Crags. The summit is 807 metres (2,648 ft) high and has two main cairns side by side. The walk then continues to the 744 m (2,441 ft) High Crag. From here there are views of Great Gable and the Scafells with Skiddaw and the Helvellyn range in the distance. From High Crag you descend to Scarth Gap and then to the shores of Buttermere via Buttermere Fell. The final waterside section takes you along Buttermere Lake to the finish point at Buttermere Village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Fish Inn in Butteremere village is a lovely place to go for some post walk refreshment. The inn has an interesting history being one of the oldest inns in the Lake District. They do good food and there's a comfy lounge with sofas and a fireplace to relax in indoors. There's also seating outside with fabulous views of the surrounding fells. You can easily find it in the village at postcode CA13 9XA.The Bridge Inn is also located right in the village. There's another fine garden area with one of the best views in England here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jD2NAvRQ8Z0",
  "county": "Cumberland",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}