{
  "objectID": "d7972571afb8aab4ff1084a675e2938d",
  "created_at": "2024-12-18T09:14:56.558171+00:00",
  "ref": "sherwood-forest-country-park-walking-and-cycle-route",
  "title": "Sherwood Forest Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Waymark_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_890690.jpg",
  "nearby": [
    {
      "description": "Clumber Park",
      "objectID": "ab4c34c84ac5b84136555d8306a71c18",
      "ref": "clumber-country-park-walking-and-cycle-route"
    },
    {
      "description": "Robin Hood Way",
      "objectID": "e72ffb12ff717d64aebbc0af8854daaa",
      "ref": "robin-hood-way-walking-route"
    },
    {
      "description": "Nottingham to Worksop",
      "objectID": "ceb29321991950cb3f4c90f9f7136108",
      "ref": "nottingham-to-worksop-cycle-route"
    },
    {
      "description": "Rufford Country Park",
      "objectID": "fce79a9fa7cc74d4957c983267d30ec4",
      "ref": "rufford-country-park-walking-route"
    },
    {
      "description": "National Cycle Route 6 Mansfield",
      "objectID": "69d0043d5505f95795ab86ddfd75e6b2",
      "ref": "national-cycle-route-6-mansfield-cycle-route"
    },
    {
      "description": "Southwell Trail",
      "objectID": "f9a3ebf1eb5e80d0c3886a0bc14b58e0",
      "ref": "southwell-trail-walking-and-cycle-route"
    },
    {
      "description": "Edwinstowe",
      "objectID": "0cbbe051aa2e2d752d244854fa89149a",
      "ref": "edwinstowe-walking-route"
    },
    {
      "description": "Walesby Forest",
      "objectID": "a47d12b8e4aabe58c16e938247df24c5",
      "ref": "walesby-forest-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/B408A99B9FDA933386257C6700546126/$FILE/Sherwood Forest Country Park.gpx",
  "_geoloc": {
    "lat": 53.1912254756,
    "lng": -1.0940226703
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Waymark_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_890690.jpg",
      "title": "David Lally / Waymark Sherwood Forest Country Park",
      "caption": "Waymark Sherwood Forest Country Park. Looks to be carved out of an unusually twisted birch trunk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Gleadthorpe_Open%2C_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1330942.jpg",
      "title": "Kate Jewell / Gleadthorpe Open, Sherwood Forest Country Park",
      "caption": "Gleadthorpe Open in the park. The lack of flowering plants and trees on Gleadthorpe Open is due to a number of factors. The old common rights custom of 'pannage', bringing livestock into the forest to graze, meant that pigs grubbed out the root stock whilst foraging; fire was the probable cause of the tree loss and as it is low lying Gleadthorpe Open is susceptible to late frosts. Queen Oak Plantation is straight ahead. This probably originates from the 19th Century when a common name for the Major Oak was The Queen Oak."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Path_in_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1330930.jpg",
      "title": "Kate Jewell / Path in Sherwood Forest Country Park",
      "caption": "Path view. Gleadthorpe Open on the left and Robert's Plantation on the right. If you carry on walking you will eventually come to the B6034."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Young_English_oak_leaves_in_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1334893.jpg",
      "title": "Kate Jewell / Young English oak leaves in Sherwood Forest Country Park",
      "caption": "Young English oak leaves in the park. Note the male flower tassel hanging beneath the leaves. The oaks in Sherwood are both the Pedunculate or English Oak (Quercus robur) and the Sessile Oak (Quercus petraea). One of the features which differentiates the two species is the leaf stalk or petiole. On the Pedunculate oak this is very short, typically less than 0.5 cm. long, whereas on the Sessile oak the petiole is 1-2 cm. in length. As Sessile and Pedunculate oak hybridise naturally with each other, producing trees of intermediate characteristics, this can make it difficult to accurately identify the tree to the species level. This is a common factor in Sherwood and many intermediate trees can be found."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Fallen_tree_in_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1334875.jpg/256px-Fallen_tree_in_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1334875.jpg",
      "title": "Kate Jewell / Fallen tree in Sherwood Forest Country Park",
      "caption": "Fallen tree. Because of its national ecological importance the Country Park was designated a National Nature Reserve in 2002 by Natural England, the Government agency responsible for safeguarding our natural environment. It is home to hundreds of insect species and fallen timber is left on the forest floor to provide feeding and breeding grounds for these, not least of which are over two hundred species of spiders. Note the bracket fungus, Fomes fomentarius commonly known as Tinder Fungus or Hoof Fungus, growing on this trunk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/The_Major_Oak_-_geograph.org.uk_-_1328654.jpg",
      "title": "Kate Jewell / The Major Oak",
      "caption": "The Major Oak. This ancient tree is the major tourist attraction in the Sherwood Forest Country Park. It is reputed to be over 1,000 years old. in the first half of the 20th Century visitors could walk right up to the tree but now it is fenced off to protect the soil around the trunk from erosion and the tree itself.\nIn the mid 18th Century the tree was known as the Cock Pen Tree as it was used as a holding site for fighting cocks which were stacked in wicker baskets and hessian sacks inside the hollow trunk before they were released for the now illegal sport of cock fighting"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/The_Major_Oak_-_geograph.org.uk_-_1328984.jpg",
      "title": "Kate Jewell / The Major Oak",
      "caption": "A close up view of the Major Oak. In 1790 a Major Hayman Rooke wrote a popular book called \"Remarkable Oaks in the Park of Welbeck in the County of Nottinghamshire\" in which he mentioned the tree. A short time later the tree was renamed the Major's Oak which was quickly modified to the Major Oak. Apart from a short period in the 19th Century when it acquired the additional name of the Queen Oak, it retains this name to this day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Seymour_Grove%2C_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1802517.jpg",
      "title": "Mick Garratt / Seymour Grove, Sherwood Forest Country Park",
      "caption": "Seymour Grove. This part of the park is enclosed and is grazed by Longhorn cattle in an attempt to restore a more sustainable forest ecology."
    }
  ],
  "distance_km": 10.0,
  "description": "Explore 450 acres of peaceful woodland in this famous park and Nature Reserve in Nottinghamshire. In Sherwood Forest you'll pass the 800 year old Major Oak which is rumoured to be the base of Robin Hood. There are also excellent facilites with a Visitor Centre and cafe. This circular trail runs for about 6 miles using the waymarked paths around the visitor centre which is located just north of Edwinstowe. There's a good sized car park located here too. There are numerous cycling and walking tracks running through the park with National Cycle Route 6 passing through the centre of the park (see the Nottingham to Worksop Cycle Route ). The Robin Hood Way Walk also passes right through the park. Our Mansfield Cycle Route passes through the park and will take you to the nearby Clumber Park where there's miles of nice trails and a beautiful lake.",
  "video_url": "https://www.youtube.com/embed/emAyq93akmo",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "England"
}