{
  "created_at": "2025-01-06T08:17:42.324623+00:00",
  "objectID": "d8492f6a9762622c8f76550d2052b7e7",
  "ref": "princes-risborough-walking-route",
  "title": "Princes Risborough Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Coombe_Hill_Monument_2.jpg/512px-Coombe_Hill_Monument_2.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d8492f6a9762622c8f76550d2052b7e7.gpx",
  "_geoloc": {
    "lat": 51.7181480489,
    "lng": -0.8406364988
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Coombe_Hill_Monument_2.jpg/512px-Coombe_Hill_Monument_2.jpg",
      "title": "Rich Barrett-Small from London, United Kingdom [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Coombe Hill Monument"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/The_Ridgeway_on_Whiteleaf_Hill_-_geograph.org.uk_-_1458761.jpg",
      "title": "Steve Daniels / The Ridgeway on Whiteleaf Hill, via Wikimedia Commons",
      "caption": "The Ridgeway on Whiteleaf Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Woods_below_Pulpit_Hill_-_geograph.org.uk_-_1472423.jpg",
      "title": "Tim S Addison / Woods below Pulpit Hill, via Wikimedia Commons",
      "caption": "Woods below Pulpit Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Chequers_and_Coombe_Hill_Boer_War_Memorial_-_geograph.org.uk_-_10025.jpg",
      "title": "The Dewdrops [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Chequers and Coombe Hill Boer War Memorial"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/The_Market_House_in_Princes_Risborough_-_geograph.org.uk_-_3557162.jpg/512px-The_Market_House_in_Princes_Risborough_-_geograph.org.uk_-_3557162.jpg",
      "title": "The Market House in Princes Risborough by Steve Daniels, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Market House in Princes Risborough"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Princes_Risborough%2C_Church_Street_%282%29_-_geograph.org.uk_-_745967.jpg",
      "title": "Nigel Cox / Princes Risborough: Church Street (2)",
      "caption": "Church Street. Viewed looking towards the Market Square with an historic half-timbered building on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Princes_Risborough%2C_The_former_British_School_-_geograph.org.uk_-_748436.jpg",
      "title": "Nigel Cox / Princes Risborough: The former British School",
      "caption": "The former British School. The British School was established in the Parkfield area of Princes Risborough in 1836. It is now used as a studio. The A4010 Wycombe Road is to the left and the B4444 Station Road to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Princes_Risborough%2C_Duke_Street_-_geograph.org.uk_-_745991.jpg",
      "title": "Nigel Cox / Princes Risborough: Duke Street",
      "caption": "Duke Street. This street forms the northern entrance into the historic Market Square."
    }
  ],
  "distance_km": 17.0,
  "description": "This Buckinghamshire based town is in a great location for exploring the beautiful Chiltern Hills AONB. This walk from the town's train station takes you to some of the highlights of the area. You'll climb to Coombe Hill, Pulpit Hill and Whiteleaf Hill with some fabulous views over the surrounding countryside to enjoy on the way. You'll also pass Chequers, the country house retreat of the Prime Minister. The walk starts from the train station where you can pick up The Ridgeway National Trail. The waymarked path will take you up to Whiteleaf Hill, a local nature reserve. The hill has five scheduled ancient monuments, including some dating to the Neolithic and Bronze Ages and the Whiteleaf Cross, a chalk carving thought to date to the eighteenth century. There's also attractive woodland and lots of butterflies to look out for in the summer months. From here it's a short walk to Pulpit Hill which is another notable area in this part of the Chilterns. The area is run by the National Trust and includes more beech woodland, a Bronze age hill fort and lots of interesting flora and fauna. After exploring the site the route continues east passing Chequers. There's been house on the site since the 12th century and once housed a royal prisoner, Lady Mary Grey, the younger sister of Lady Jane Grey and granddaughter of King Henry VII. It also contains one of the country’s largest collections of art and memorabilia about Oliver Cromwell. After passing the house the route bends round to the north to climb Coombe Hill. The popular hill is the highest viewpoint in the Chiltern Hills and commands wonderful views over Aylesbury Vale and the Cotswolds. The summit also includes the iconic Coombe Hill Monument. It was erected in 1904 in memory of 148 men from Buckinghamshire who died during the Second Boer War. There's also more nice views down to Chequers from here. The walk then returns to the train station using the same paths. You can extend the walk by continuing along the Ridgeway to Wendover where you can visit Wendover Woods. Three other long distance trails also pass very close to the town. You can pick up the Aylesbury Ring, North Bucks Way and the Midshires Way to further explore the area on waymarked paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the The Red Lion for some post walk refreshments. It's a delightful village pub sat in the hamlet of whiteleaf and on The Ridgeway National Trail. There's a cosy interior and a pretty garden area where you can sit outside on warmer days. You can find the pub at a postcode of HP27 0LL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and woods surrounding the town are ideal for dog walking. The Red Lion pub mentioned above is also very dog friendly so you'll probably see other owners in there if you pop in for a drink."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to catch the heritage Chinnor Railway which runs from the town to neighbouring village of Chinnor. There's some lovely country views to enjoy as you travel along on the old steam train. At your destination you can then try the Chinnor Circular Walk which explores the woodland, nature reserves and hills to the south east of the village. Though more of a cycle route the Phoenix Trail is also suitable for walkers. The route follows a disused railway line along a flat path to the attractive market town of Thame. In this area you can also visit the worthy village of Long Crendon. Here you'll find a number of medieval timber framed properties including Long Crendon Courthouse which dates to the 15th century and is run by the National Trust. From the village there is also a pleasant footpath to the remains of Notley Abbey, an Augustinian abbey founded in the 12th century and located in a scenic spot by the River Thame. The circular Bledlow Ridge Walk can be picked up to the south west of the town. It's an attractive settlement which includes a fine old pub and the Yoesden Wood Nature Reserve where there's some interesting flora and fauna to observe. For cyclists the town makes a good entry point for the epic Chilterns Cycleway. The signed circular trail runs for about 170 miles through the Chilterns AONB on quiet country lanes, visiting a series of delightful villages. For more walks in the county see the Buckinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FN4h8x3vvsc",
  "postcode": "HP27 9BP",
  "district": "Princes Risborough",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Soft Water Shop, 75, Station Road, Horsenden, Princes Risborough, Buckinghamshire, England, HP27 9BP, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve",
    "monuments"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}