{
  "created_at": "2025-01-06T02:34:52.376810+00:00",
  "objectID": "d86ae8a474db0bb59dfdd11d4adb1b7a",
  "ref": "wandlebury-country-park-walking-route",
  "title": "Wandlebury Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/52/The_Lodge_at_the_entrance_to_Wandlebury_-_geograph.org.uk_-_850685.jpg",
  "nearby": [
    {
      "description": "Gog Magog Hills",
      "objectID": "6509fabe604a0870d8c384b14db027dd",
      "ref": "gog-magog-hills-walking-route"
    },
    {
      "description": "Cambridge Backs Walk",
      "objectID": "24a56d859a8200c5f219a610a9e57ce8",
      "ref": "cambridge-backs-walk-walking-route"
    },
    {
      "description": "Fleam Dyke and Roman Road",
      "objectID": "6249ed5f9d46bc3c4f9606d0a06ada68",
      "ref": "fleam-dyke-and-roman-road-walking-route"
    },
    {
      "description": "Harcamlow Way",
      "objectID": "bb6518acb599bd810287707809e3ef55",
      "ref": "harcamlow-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d86ae8a474db0bb59dfdd11d4adb1b7a.gpx",
  "_geoloc": {
    "lat": 52.1574161016,
    "lng": 0.1801777009
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/The_Lodge_at_the_entrance_to_Wandlebury_-_geograph.org.uk_-_850685.jpg",
      "title": "Duncan Grey / The Lodge at the entrance to Wandlebury",
      "caption": "The Lodge at the entrance to Wandlebury with a view of the spacious on site car park in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Archway_House%2C_Wandlebury_-_geograph.org.uk_-_850692.jpg",
      "title": "Duncan Grey / Archway House, Wandlebury",
      "caption": "Archway House, Wandlebury. The grave of the Godolphin Barb horse, which died in 1753, can be seen under the archway. Maps and leaflets are available from the porch at all times and from a shed in car park on summer Sundays."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Cupola_Stable_Block%2C_Wandlebury_Ring_-_geograph.org.uk_-_1439258.jpg",
      "title": "Simon Judd / Cupola Stable Block, Wandlebury Ring",
      "caption": "The 18th century Cupola stable block at Wandlebury Ring. The clock has only one hand on each of its four faces. The Wandlebury Estate was acquired by the Cambridge Preservation Society in 1954. The House, home of Francis Godolphin, 2nd Earl of Godolphin, stood within the Ring. It has since been demolished but this monumental stable block remains, now used for accommodation and as headquarters office of Cambridge Past Present & Future. The society runs the nature reserve on Wandlebury Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Tadlow_Granary_-_Wandlebury_-_geograph.org.uk_-_1147617.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tadlow Granary - Wandlebury. \"Report on the tree-ring dating of oak timbers from a granary of plank and muntin construction to the period 1415-1425. The granary was dismantled in 1971, and repaired and re-erected at the Cambridge Preservation Society's country park at Wandlebury, Stapleford, southeast of Cambridge, in 1981.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Disabled_access_to_Wandlebury_ring_-_geograph.org.uk_-_1147647.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Disabled access to the site. The driveway leads round to parking next to the cottages and information centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/The_Games_Area_-_geograph.org.uk_-_1147601.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Games Area. Just outside the Wandlebury ring. Served as a bowling green in the 1840s and later as a cricket pitch for the servants."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Wooded_chalk_grassland_-_geograph.org.uk_-_1147610.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wooded chalk grassland. A relatively unspoilt patch of vegetation just outside the Wandlebury ring. It has not been cut or grazed for many years and a variety of wild species of flowers and grasses have now established themselves here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Path_in_the_iron_age_ditch_-_geograph.org.uk_-_1142099.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path in the iron age ditch. The area was already inhabited during the Bronze Age and around 2500 years ago there was an Iron Age hill fort known as Wandlebury Ring. This hill fort once had concentric ditches and earthen walls which were kept in place by wooden palisades. Although the fort has vanished, the ditch (the Ring) dug around the edge can clearly be seen and walked along, being 5 metres deep in places and offering an adventurous route along its edge."
    }
  ],
  "distance_km": 2.0,
  "description": "This walk takes you around the delightful Wandlebury Country Park in Cambridge. The park is part of the Gog Magog Hills, a ridge of low chalk hills extending for several miles to the southeast of Cambridge. The park includes Wandlebury Hill where an Iron Age Hill Fort once stood. You can climb to the top for fine views over the Cambridgeshire countryside. Wandlebury is also a Nature Reserve and is perfect for bird watching. Other features include a picturesque beech avenue, highland cattle and beautiful wildflower meadows in the summer months. Please not cycling is not permitted in the park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a pop up cafe on the weekends where you can enjoy refreshments after your walk. If you fancy a pub lunch one nice idea is to head to nearby Great Shelford. Here you'll find The Square and Compasses, a splendid village pub serving traditional English food. There's a cosy interior and a nice garden area for warmer days. They are located on the High Street at postcode CB22 5EH. The Plough is another good option in the village. They have a pizza oven outside in the garden area where you can relax on warmer days. You can find them on the High Street at postcode CB22 5EH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland trails are ideal for dog walking so you'll probably bump into other owners on your visit. The Plough pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into the city of Cambridge and you could try the popular Cambridge Backs Walk which explores the historic university. Just to the east of the park you can pick up the Fleam Dyke Walk which visits some significant local archaeological sites and an impressive earthwork. The epic Harcamlow Way can also be picked up in nearby Fulbourn. Just a few miles to the west there's the worthy village of Haslingfield. Here you'll find pleasant walks along the River Rhee, rows of quaint thatched cottages, a church dating back to the 12th century and a noteworthy Tudor Manor House where Queen Elizabeth I stayed during the 16th century. Near here there's also the new settlement of Cambourne. There's some pleasant walks around this modern village with a lovely local nature reserve to explore. The wildlife rich reserve includes pretty lakes, wildflower meadows and wetland areas. On the walk you can also visit the ancient Bourn Windmill, the oldest surviving windmill in the United Kingdom. Just to the south there's also the stunning gardens at the historic Wimpole Hall. For more walking ideas in the area see the Cambridgeshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/RlBMNStmhG8",
  "postcode": "CB22 3AE",
  "county": "Cambridgeshire",
  "region": "Cambridgeshire and Peterborough",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wandlebury, Stapleford, South Cambridgeshire, Cambridgeshire, Cambridgeshire and Peterborough, England, CB22 3AE, United Kingdom",
  "district": "South Cambridgeshire",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "meadow"
  ],
  "points_of_interest": [
    "hill fort",
    "nature reserve"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "bird watching"
  ]
}