{
  "created_at": "2025-01-06T07:55:45.750491+00:00",
  "objectID": "d9331ba3b02f10e13bcb51f1056c8805",
  "ref": "rivelin-valley-nature-trail-walking-route",
  "title": "Rivelin Valley Nature Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Waterfall_-_Rivelin_Valley_-_panoramio.jpg/256px-Waterfall_-_Rivelin_Valley_-_panoramio.jpg",
  "nearby": [
    {
      "description": "Redmires Reservoir",
      "objectID": "bcd6cccaa66f54aa578439a7a5da6292",
      "ref": "redmires-reservoir-walking-route"
    },
    {
      "description": "Rivelin Dams",
      "objectID": "401599bf016a8da22abf93fabfb7e457",
      "ref": "rivelin-dams-walking-route"
    },
    {
      "description": "Lodge Moor",
      "objectID": "ae239807012db02980630d44821cea1f",
      "ref": "lodge-moor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d9331ba3b02f10e13bcb51f1056c8805.gpx",
  "_geoloc": {
    "lat": 53.3952725761,
    "lng": -1.5140810762
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Waterfall_-_Rivelin_Valley_-_panoramio.jpg/256px-Waterfall_-_Rivelin_Valley_-_panoramio.jpg",
      "title": "Tejas Itraj [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Waterfall on the trail. The trail is maintained by volunteers from the Rivelin Valley Conservation Group"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Lake_in_Rivelin_Valley_-_panoramio.jpg/256px-Lake_in_Rivelin_Valley_-_panoramio.jpg",
      "title": "Tejas Itraj [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Lake in the Rivelin Valley. The river valley is home to wildlife including mallard, the dipper, the kingfisher, the long-tailed tit, grey heron and the wren. At Fox Hagg nature reserve on the south side of the river it is possible to see meadow and tree pipits, common redstarts and linnets and a number of warblers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Footbridge_reflected_in_River_Rivelin.jpg/512px-Footbridge_reflected_in_River_Rivelin.jpg",
      "title": "Graham Hogg / Footbridge reflected in the River Rivelin, via Wikimedia Commons",
      "caption": "18th-century packhorse bridge over the River Rivelin at Rails, southwest of Stannington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/The_Rivelin%2C_Tofts_Lane%2C_Rivelin_Valley%2C_Sheffield_-_geograph.org.uk_-_1080541.jpg",
      "title": "Terry Robinson / The Rivelin, Tofts Lane, Rivelin Valley, Sheffield, via Wikimedia Commons",
      "caption": "The Rivelin pub, Tofts Lane. At the top of a very steep road off Rivelin Valley Road ... or more easily accessible from Stannington via Roscoe Bank. Great views across the valley towards the Bell Hagg Inn. Behind the hotel is the Man's Head Rock, a once well known rock formation shown on many postcards, now hidden by mature trees. This is the only public house in the rural part of the valley; the premises were formerly farm buildings before being converted into a pub."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Wolf_Wheel_Mill_pond_-_geograph.org.uk_-_2568006.jpg/512px-Wolf_Wheel_Mill_pond_-_geograph.org.uk_-_2568006.jpg",
      "title": "Wolf Wheel Mill pond by Graham Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wolf Wheel Mill pond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Upper_Coppice_Wheel_tail_goit_-_geograph.org.uk_-_1411918.jpg",
      "title": "Martin Speck / Upper Coppice Wheel tail goit",
      "caption": "Water from the Upper Coppice Wheel falling into the tail goit. Potential energy from the water in the tail goit is not wasted by returning it directly to the river straight away. Instead it is diverted into the head goit of the Second Coppice Wheel. The Upper Coppice wheel also has an inflow, via a tunnel from the Rivelin Mill Dam, upstream. The peaty brown water of the River Rivelin flows into the River Loxley and then the River Don, or Dun as it was once called, named after the colour of the water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Icicles_and_Stepping_Stones_-_geograph.org.uk_-_2206791.jpg/512px-Icicles_and_Stepping_Stones_-_geograph.org.uk_-_2206791.jpg",
      "title": "Icicles and Stepping Stones by Jonathan Clitheroe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Icicles and Stepping Stones. A frozen winter view of the river. The river rises on the Hallam moors, in north west Sheffield, and joins the River Loxley at Malin Bridge, a suburb in the north west of Sheffield."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Weir_on_the_River_Rivelin_-_geograph.org.uk_-_2340127.jpg/512px-Weir_on_the_River_Rivelin_-_geograph.org.uk_-_2340127.jpg",
      "title": "Weir on the River Rivelin by Graham Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A weir in the park area in early spring. New facilities were built for the park in the early 1950s on the site of the Spooner’s wheel, which dated from the late 18th century. The mill buildings were demolished and the small reservoir filled in, and were replaced by the children’s playground and café. At the same time paddling pools were constructed between Rivelin Valley Road and the River Rivelin."
    }
  ],
  "distance_km": 4.0,
  "description": "This walk takes you through the lovely Rivelin River valley in Sheffield. The nature trail runs along the side of the rushing river which is surrounded by attractive woodland. Along the way you'll pass a series of weirs, and little waterfalls with a variety of interesting flora and fauna. The walk starts at the car park off the Rivelin Valley Road and picks up the waterside trail to the pretty Rivelin Park. The park has a cafe, toilets and play area. You then follow the riverside path for about 2.5 miles with pretty ponds and stepping stones to look out for on the way. The area has a rich milling history with a series of dams and wheel pits dotted along the route. To extend your walking in the area you can head east to the pretty Rivelin Dams. Here you can pick up a delightful waterside trail through the Wyming Brook Nature Reserve. This will lead you to the Redmires Reservoirs. These three interestingly shaped reservoirs have a great circular walking trail with woodland paths, climbs across the Peak District Moors and a wide variety of wildfowl and waders to look out for on the water.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the trail you will pass the splendid Rivelin Hotel at Tofts. You could stop here and enjoy a drink in the lovely beer garden which offers views of the green fields surrounding the pub. There's a great menu and selection of ales too. You can find the pub on Tofts Lane, just north of the river, at a postcode of S6 5SL. At the western end of the trail you'll be very close to The Three Merry Lads pub. It's a great place for refreshments with a good menu and a nice beer garden with lovely views of the surrounding countryside. The fine Georgian pub can be found about half a mile south west of the route end at 610 Redmires Road with a postcode of S10 4LJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail makes for a great dog walk with lots of opportunities for a paddle! The pubs mentioned above are also dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Tnhuv7hsl3c",
  "postcode": "S6 5FY",
  "district": "Sheffield",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}