{
  "objectID": "d97af80872a82e4c48cecb435504e5ff",
  "created_at": "2024-12-18T15:33:49.943848+00:00",
  "ref": "radcliffe-canal-walk-walking-route",
  "title": "Radcliffe Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Canal_Towpath_at_Radcliffe_-_geograph.org.uk_-_6562775.jpg/512px-Canal_Towpath_at_Radcliffe_-_geograph.org.uk_-_6562775.jpg?20240807184121",
  "nearby": [
    {
      "description": "Irwell Sculpture Trail",
      "objectID": "7b491815b9290d73a8137e8a38d25ec5",
      "ref": "irwell-sculpture-trail-walking-route"
    },
    {
      "description": "Elton Reservoir",
      "objectID": "b38e7304c30c7b48933cfe0b0d6a68c2",
      "ref": "elton-reservoir-walking-route"
    },
    {
      "description": "Peel Tower",
      "objectID": "cc1ad1dce04225c45f904ca3ca1cb8d8",
      "ref": "peel-tower-walking-route"
    },
    {
      "description": "Clifton Country Park",
      "objectID": "47aa17e2e6f7621a98067299fc90805f",
      "ref": "clifton-country-park-walking-and-cycle-route"
    },
    {
      "description": "Outwood Trail",
      "objectID": "69053d6030cfe5e7add7cbc2e379d3bc",
      "ref": "outwood-trail-walking-and-cycle-route"
    },
    {
      "description": "Burrs Country Park",
      "objectID": "6d4718dfe9b5900149c70f84c90eb03e",
      "ref": "burrs-country-park-walking-route"
    },
    {
      "description": "Prestwich Forest Park",
      "objectID": "0d2819d39876ac4ad1f44fc3f024f464",
      "ref": "prestwich-forest-park-walking-and-cycle-route"
    },
    {
      "description": "Bolton",
      "objectID": "f9d56f08fe3684608df06d2eb1dd061b",
      "ref": "bolton-walking-route"
    },
    {
      "description": "Salford Trail",
      "objectID": "5d09f70be9223fd178fa30bdc3378cc9",
      "ref": "salford-trail-walking-route"
    },
    {
      "description": "Summerseat",
      "objectID": "9fecf42c6853e4fd34e6f45ab32b2dd0",
      "ref": "summerseat-walking-route"
    },
    {
      "description": "Redisher Wood",
      "objectID": "a1a1f69c43853a321f1503c5977ed7c5",
      "ref": "redisher-wood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d97af80872a82e4c48cecb435504e5ff.gpx",
  "_geoloc": {
    "lat": 53.5567111263,
    "lng": -2.3416075261
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Canal_Towpath_at_Radcliffe_-_geograph.org.uk_-_6562775.jpg/512px-Canal_Towpath_at_Radcliffe_-_geograph.org.uk_-_6562775.jpg?20240807184121",
      "title": "Canal Towpath at Radcliffe by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Canal Towpath at Radcliffe. The Manchester Bolton & Bury Canal is a historical waterway of north west England. It was constructed to connect the industrial towns of Bolton and Bury with Manchester, facilitating the transportation of goods during the Industrial Revolution. The canal, which fully opened in 1796, spanned 15 miles and 1 furlong (24 km) and included 17 locks. These locks allowed the canal to ascend from the River Irwell in Salford, moving through Pendleton and northwest towards Prestolee, where the canal then split into two branches: one leading northwest to Bolton and the other northeast to Bury. The canal's design featured six aqueducts to traverse the rivers Irwell and Tonge, as well as several minor roads. Interestingly, the section of the canal between Bolton and Bury was on a level plane and required no locks, making it unique among the canal's various stretches. The Manchester Bolton & Bury Canal played a significant role in the region's industrial growth but fell into disuse in the 20th century. Efforts are ongoing to restore parts of the canal for leisure and historical preservation purposes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Canal_Towpath%2C_Radcliffe_-_geograph.org.uk_-_3880927.jpg?20221004230943",
      "title": "Canal Towpath, Radcliffe by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Canal was commissioned in 1791 by a group of local landowners and businessmen. Its construction spanned from 1791 to 1808, a period known as the Golden Age of canal building. The canal was initially designed for narrow gauge boats, which were typical of the time. However, during its construction, it was altered into a broad gauge canal. This change was made to accommodate a potential connection with the Leeds and Liverpool Canal, although this connection was never realised. The canal cost £127,700 to build, a sum equivalent to approximately £12.5 million today. After the canal was completed, the company that managed it eventually transitioned into a railway company. This led to the construction of a railway line that followed the canal's route closely, particularly requiring modifications to the Salford arm of the canal to accommodate the new railway infrastructure. Despite these changes, the canal fell into disuse by the mid-20th century, with portions of it now undergoing restoration efforts for historical and recreational purposes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Manchester%2C_Bolton_and_Bury_Canal%2C_Radcliffe_-_geograph.org.uk_-_3527912.jpg?20220516221318",
      "title": "Manchester, Bolton and Bury Canal, Radcliffe by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The canal primarily transported coal from local collieries, which was a significant part of the industrial infrastructure in the area. However, as these mines began to close and the coal industry declined, sections of the canal fell into disuse and disrepair. This gradual decline led to the canal being officially abandoned in 1961. In response to its deterioration, a group of enthusiasts formed the Manchester Bolton & Bury Canal Society in 1987, with the aim of restoring the canal for leisure purposes. Their efforts began to materialize in 2006, when restoration work started near the canal's junction with the River Irwell in Salford. As of now, the canal has been restored and is navigable up to Oldfield Road in Salford, bringing new life to this historic waterway for recreational use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Manchester%2C_Bolton_and_Bury_Canal%2C_Radcliffe_-_geograph.org.uk_-_3012703.jpg?20220107025011",
      "title": "Manchester, Bolton and Bury Canal, Radcliffe by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A serene scene with a willow tree over the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Prestolee_Aqueduct_-_geograph.org.uk_-_2164050.jpg?20210614043316",
      "title": "Prestolee Aqueduct by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Prestolee Aqueduct. The canal features several significant structures that highlight its historical and engineering importance. Among these are the Prestolee Aqueduct and Clifton Aqueduct, both of which are designated as Grade II listed buildings. These aqueducts were essential in allowing the canal to traverse the River Irwell and other watercourses, serving as crucial points along the canal's route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/View_From_Nob_End_Locks_-_geograph.org.uk_-_2937149.jpg?20211225101720",
      "title": "View From Nob End Locks by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View From Nob End Locks. Nob End Locks, also known as Prestolee Locks, are another key feature. These locks are located at the canal's junction at Nob End and consist of two sets of three staircase locks separated by a passing basin. This intricate lock system was designed to lower the canal by 64 feet over a distance of 600 feet. Although the upper staircase remains visible, much of the lower staircase was filled in during the 1950s, with some of the original stonework removed. A significant breach on the Bury arm of the canal exposed the advanced engineering techniques used in constructing the canal’s retaining walls. Notably, railway rails were embedded within the walls to reinforce their structure, a feature that is still visible today. One of the canal's most intriguing features is the Mount Sion steam crane, which has become an emblem for the Manchester Bolton & Bury Canal Society. Located on the Bury arm, this crane, dating back to around 1875–1884, was manufactured by Thomas Smith & Sons of Rodley. It was originally used to unload coal from barges into the adjacent yard at Mount Sion Bleach Works. The crane, one of the earliest surviving examples in England, was granted Grade II listed status in 2011. These features reflect the canal's rich industrial heritage and the complex engineering solutions that were employed during its construction and operation."
    }
  ],
  "distance_km": 4.0,
  "description": "This walk takes you along the Manchester Bolton & Bury Canal in the town of Radcliffe in Greater Manchester. The route starts just to the west of the town, following a section of the Irwell Sculpture Trail north east towards Bury. The route finishes at the picturesque Elton Reservoir where you can extend the walk on the lakeside footpath. Along the way you can see the old historic mills and enjoy some fine views of the surrounding countryside.",
  "video_url": "https://www.youtube.com/embed/Qr0pIB-9Vmk?si=_nwxGZbMUKnznHrp",
  "postcode": "M26 3SW",
  "region": "North West",
  "country": "England"
}