{
  "created_at": "2025-01-06T04:41:19.144298+00:00",
  "objectID": "d97b80091178471ba668033e3a19d518",
  "ref": "teifi-pools-walking-route",
  "title": "Teifi Pools Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/16/Eastern_branch_of_Llyn_Teifi_-_geograph.org.uk_-_657730.jpg",
  "nearby": [
    {
      "description": "Claerwen Reservoir",
      "objectID": "d9dd10f80446ecd0f7760adc6b122012",
      "ref": "claerwen-reservoir-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d97b80091178471ba668033e3a19d518.gpx",
  "_geoloc": {
    "lat": 52.2752010148,
    "lng": -3.839635987
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Eastern_branch_of_Llyn_Teifi_-_geograph.org.uk_-_657730.jpg",
      "title": "Rudi Winter / Eastern branch of Llyn Teifi, via Wikimedia Commons",
      "caption": "View of the Eastern branch of Llyn Teifi. This is the smaller, Eastern branch of the reservoir. The lake continues around the headland on the left of the picture. The higher ground on the right is part of Graig Felen, the narrow ridge that separates Llyn Teifi from Llyn Hir, which lies about 40m higher and to the east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Llynnoedd_Hir_and_Teifi_-_geograph.org.uk_-_657769.jpg",
      "title": "Rudi Winter / Llynnoedd Hir and Teifi, via Wikimedia Commons",
      "caption": "Llynnoedd Hir and Teifi. Graig Felen separates the two lakes (Llyn Hir to the left, east, and Llyn Teifi to the right, west). Llyn Teifi is about 40m lower in altitude. The plain of the lower Cwm Teifi, beyond Pontrhydfendigaid, can be seen in the distance beyond Llyn Teifi. A storm is approaching from the south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Graig_Felen_-_geograph.org.uk_-_657734.jpg/256px-Graig_Felen_-_geograph.org.uk_-_657734.jpg",
      "title": "Rudi Winter / Graig Felen, via Wikimedia Commons",
      "caption": "Graig Felen. Graig Felen is a narrow ridge separating Llyn Teifi, from Llyn Hir and Llyn y Gorlan (east). Although the ridge runs roughly north-south, the rock strata on it, folded up almost vertically, run east-west ( The lake on the left is Llyn y Gorlan. A storm front is beginning to move in from across the Teifi valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Moorland_south_of_the_Teifi_pools_-_geograph.org.uk_-_1706396.jpg/512px-Moorland_south_of_the_Teifi_pools_-_geograph.org.uk_-_1706396.jpg",
      "title": "Rudi Winter / Moorland south of the Teifi pools, via Wikimedia Commons",
      "caption": "Moorland south of the pools. The Teifi pools area is a moorland plateau characterised by grassy ridges and boggy depressions around 400-450m. It is delimited by Cwm Egnant in the south, the deep valley whose top can be seen in this picture. The Nant Hafod-frith, which drains towards the Nant Egnant, runs in the depression on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Llyn_Teifi_dam_-_geograph.org.uk_-_1704109.jpg/512px-Llyn_Teifi_dam_-_geograph.org.uk_-_1704109.jpg",
      "title": "Rudi Winter / Llyn Teifi dam, via Wikimedia Commons",
      "caption": "Llyn Teifi dam. The only section of dam which is actually a dam, rather than just a wall similar to the one shown here on natural ground. Altogether the dam/wall extends for some 800m around the southwestern side of the reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Ridgetop_and_Llyn_Teifi_-_geograph.org.uk_-_1706358.jpg/512px-Ridgetop_and_Llyn_Teifi_-_geograph.org.uk_-_1706358.jpg",
      "title": "Rudi Winter / Ridgetop and Llyn Teifi, via Wikimedia Commons",
      "caption": "Ridgetop and Llyn Teifi. The 440m point shown on the 1:25k map is the rocky outcrop in the foreground. The area around the Teifi pools consists of many small ridges in the 400-450m region. They all have rocky outcrops among dry grass cover. The depressions between the ridges are around the 400m mark and are mostly covered in wet bogland with long grass. The southwestern edge of Llyn Teifi and its various dams and walls 1704109 can be seen as a backdrop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Llyn_Teifi_-_geograph.org.uk_-_1703988.jpg/512px-Llyn_Teifi_-_geograph.org.uk_-_1703988.jpg",
      "title": "Rudi Winter / Llyn Teifi, via Wikimedia Commons",
      "caption": "Llyn Teifi. Water flows rapidly through this gutter-like structure into Llyn Teifi. The structure is located just next to the overflow of the reservoir. I wonder if this is a conduit linking Llyn Teifi and nearby Llyn Pond Gwaith"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Dam%2C_Llyn_Pond_Gwaith_-_geograph.org.uk_-_1700934.jpg/256px-Dam%2C_Llyn_Pond_Gwaith_-_geograph.org.uk_-_1700934.jpg",
      "title": "Rudi Winter / Dam, Llyn Pond Gwaith, via Wikimedia Commons",
      "caption": "Dam, Llyn Pond Gwaith. The dam of the small reservoir is made from small regular stones. An overflow is at its centre. Surprisingly, the reservoir was nowhere near full on this occasion despite the considerable snowmelt the week before. This may have something to do with the structure on nearby Llyn Teifi, which could be a conduit linking the two lakes."
    }
  ],
  "distance_km": 15.0,
  "description": "This splendid circular walk in the Cambrian Mountains takes you around a series of beautiful lakes. The lakes of Llyn Teifi, Llyn Hir, Llyn Gorlan, and Llyn Egnant are collectively known as the Teifi Pools. A footpath starts from the car park at the Strata Florida Abbey near Tregaron and Pontrhydfendigaid in the county of Ceredigion. The former Cistercian abbey was originally founded in 1164. You can explore the ruins which include a largely in tact main entrance archway. The 9 mile walk then follows country lanes and footpaths to the lakes. It is quite a challenging walk as you must climb up to the lakes which are in a elevated position of about 1400ft. You'll climb to Cwm Teifi before heading around and between the lakes. The route then descends past Graig Wen and Nant Egnant to the abbey car park. It's a challenging route but you are rewarded with wonderful views over the Cambrian Mountains and the lovely countryside of the River Teifi Valley. You can see the route start point of the abbey ruins and car park on the google street view link below! If you enjoy this walk then you could head to the nearby Claerwen Reservoir and follow the waterside cycle and walking track along the lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The village of Pontrhydfendigaid is located just to the west of the abbey at the start of the walk. Here you can visit the Red Lion and enjoy some post walk refreshments. It's a dog friendly pub with a good menu and garden to sit outside in. After your meal you could explore the little village and enjoy a stroll along the River Teifi which runs through the centre of Pontrhydfendigaid. You can find the pub close to the river on Bridge Street with a postcode of SY256BH for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3X79WKl5MeE",
  "county": "Ceredigion",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Abbey Road, Great Abbey Farm, Ystrad Fflur, Strata Florida, Ceredigion, Cymru / Wales, SY25 6ES, United Kingdom",
  "postcode": "SY25 6ES",
  "district": "Strata Florida",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "hard",
  "terrain": [
    "mountain",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "lake views"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}