{
  "created_at": "2025-01-06T19:01:36.868580+00:00",
  "objectID": "d983d0cdf9b343988f28444b87761ce9",
  "ref": "tralee-canal-walk",
  "title": "Tralee Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9e/The_sea_lock%2C_Tralee_Canal_-_geograph.org.uk_-_1415913.jpg?20110301172225",
  "nearby": [
    {
      "description": "Ballybunion Cliff Walk",
      "objectID": "0ee922ebbfbf21f81be049a78512b6c2",
      "ref": "ballybunion-cliff-walk-walking-route"
    },
    {
      "description": "Annascaul Lake",
      "objectID": "67e5be52b3d7ec452c385c701d859c0b",
      "ref": "annascaul-lake-walking-route"
    },
    {
      "description": "Dingle Way",
      "objectID": "6fffbd347c9117478d29580ce3d17c1d",
      "ref": "dingle-way-walking-route"
    },
    {
      "description": "Glanageenty Loop",
      "objectID": "9dc8ba0c97c15797bc7af717803b5c23",
      "ref": "glanageenty-loop-walking-route"
    },
    {
      "description": "Castleisland River Walk",
      "objectID": "1354d8c1f236c9853fdf290651caf89a",
      "ref": "castleisland-river-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/d983d0cdf9b343988f28444b87761ce9.gpx",
  "_geoloc": {
    "lat": 52.26613,
    "lng": -9.70489
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/The_sea_lock%2C_Tralee_Canal_-_geograph.org.uk_-_1415913.jpg?20110301172225",
      "title": "Adrian Platt / The sea lock, Tralee Canal",
      "caption": "This is the sea lock where the Tralee Canal enteres Tralee Bay. As the tide rises seawater pours over both gates and then into the canal; when the tide falls the gates stop water leaving thus maintaining a constant water level in this short half-mile long canal which was completed in the 1830's. The cottage and sheds were presumably built for the lock keeper. In the distance can be seen Blennerville windmill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Tralee_Ship_Canal_-_geograph.org.uk_-_4666826.jpg?20230422001532",
      "title": "Tralee Ship Canal by Oliver Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Tralee Ship Canal was constructed to accommodate larger vessels sailing into Tralee, as the existing quay in Blennerville had become impractical due to silting. Merchants in Tralee were also dissatisfied with its facilities at the start of the 19th century. An Act of Parliament authorising the canal was passed by the House of Commons in June 1829, and work began in 1832. Due to funding issues, the canal wasn't completed until 1846, when it was finally opened to ships. The canal extended 2 miles (3.2 km) and included a new basin in Tralee, lock gates, and a wooden swing bridge in Blennerville. Large ships of up to 300 tonnes could navigate the canal, but it too began to suffer from silting soon after opening. By the 1880s, Fenit Harbour was constructed as a deep water harbour that did not experience silting issues. A railway was subsequently built between Fenit and Tralee to carry cargo and freight from ships moored there. Due to ongoing silting and the increased use of Fenit, the canal fell into disuse and was officially closed in 1951."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Sea_lock%2C_Tralee_Canal_-_geograph.org.uk_-_1415873.jpg?20110301165500",
      "title": "Adrian Platt / Sea lock, Tralee Canal",
      "caption": "This is the seaward gate of the sea lock where the Tralee Canal enters Tralee Bay, and shows the dredged channel leading out into deeper water. The Slieve Mish mountains on the left are partly obscured in the orographic clouds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Sunset_at_low_tide%2C_Tralee_Canal_-_geograph.org.uk_-_1397220.jpg?20110228231755",
      "title": "Adrian Platt / Sunset at low tide, Tralee Canal",
      "caption": "Sunset at low tide. The channel leads from Tralee Bay to the entrance lock of the Tralee Canal that is behind the photographer. Beyond is the vast expanse of Tralee Bay, with the pier at Fenit just visible in the centre. This proved to be a excellent spot for watching midsummer sunsets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Blennerville_windmill1.jpg/512px-Blennerville_windmill1.jpg?20200730153952",
      "title": "CM Cogollo, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Blennerville windmill. Following the restoration of Blennerville Windmill in the early 1990s, it was envisaged that the Tralee Ship Canal could also be restored as a tourist attraction. In 1999, the Office of Public Works (OPW) initiated a restoration project for the canal at a cost of IR£650,000. This project involved the excavation of the canal basin, the construction of a new swing bridge at Blennerville, the restoration of the lock gates, and the dredging of silt from the canal. The basin area was redeveloped, with apartment blocks built as part of a proposed marina, while the towpath along the canal was upgraded, transforming it into a pleasant amenity used by walkers as part of the Dingle Way. Additionally, Tralee Rowing Club uses the canal and has established a boathouse at the basin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/The_Rose_Garden_%2C_Town_Park%2C_Tralee_-_geograph.org.uk_-_332932.jpg?20101230224238",
      "title": "Colin Park / The Rose Garden, Town Park, Tralee",
      "caption": "The Rose Garden, Town Park, Tralee. You can start the walk in this pretty park which has car parking nearby."
    }
  ],
  "distance_km": 7.1,
  "description": "This walk takes you along the Tralee Ship Canal in the town of Tralee in Kerry. The canal fell into disuse in the mid-20th century but has since been restored. There is a nice walking path running along the water from the town to Tralee Bay. On the walk you can enjoy some lovely views over the bay and to the Slieve Mish Mountains. The walk starts in the town park and then heads south west to pick up the trail along the canal. It uses part of the Dingle Way long distance footpath which you can use to extend your walk if you have time.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and there's some splendid cliff top walking on the Ballybunion Cliff Walk. There's great beaches and lots of wildlife including sea birds on the cliffs and dolphins in the waters below. To the west there's more waterside walking along the beautiful Annascaul Lake. Head east and you can pick up the waymarked Glanageenty Loop and explore the delightful Glanageenty Forest. Here you can enjoy pretty streams, peaceful woodland trails, a waterfall and lots of birdlife to see. Near here there's also the historic town of Castleisland where you can pick up the Castleisland River Walk and enjoy an easy stroll along the River Maine."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lkL7k7Fhexs?si=1oY83EVEABlrdpXN",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Tralee Playground, Rose Walk, Tralee Urban ED, Tralee Municipal District, County Kerry, Munster, V92 N9FT, Éire / Ireland",
  "postcode": "V92 N9FT",
  "district": null,
  "county": "County Kerry",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "waterfront",
    "rural"
  ],
  "points_of_interest": [
    "views",
    "mountains"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}