{
  "created_at": "2025-01-06T00:39:27.961442+00:00",
  "objectID": "da3bcef561cd96e3cc03d51021886db7",
  "ref": "chew-valley-lake-walking-route",
  "title": "Chew Valley Lake Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3d/ST553599_From_Kingshill_Lane_over_Chew_Valley_Lake_-_geograph.org.uk_-_67300.jpg",
  "nearby": [
    {
      "description": "Greyfield Woods",
      "objectID": "28953823683ba3fe4927607b459e7b50",
      "ref": "greyfield-woods-walking-route"
    },
    {
      "description": "Two Rivers Way",
      "objectID": "9b0267da75d536c948959460dc124a94",
      "ref": "two-rivers-way-walking-route"
    },
    {
      "description": "Three Peaks Walk",
      "objectID": "105949584ee9dfee0603bf157ea98d78",
      "ref": "three-peaks-walk-walking-route"
    },
    {
      "description": "Limestone Link",
      "objectID": "232478192ef18f177b33fabfa5426e3f",
      "ref": "limestone-link-walking-route"
    },
    {
      "description": "Chew Magna",
      "objectID": "ee10a4743bfde84d05321244549d8a7d",
      "ref": "chew-magna-walking-route"
    },
    {
      "description": "Paulton",
      "objectID": "d1a7695e7d8b079ef71c441a5a4ebb55",
      "ref": "paulton-walking-route"
    },
    {
      "description": "Litton Reservoir",
      "objectID": "2226c87addfc6077bffba986ec4e6e1e",
      "ref": "litton-reservoir-walking-route"
    },
    {
      "description": "Timsbury",
      "objectID": "834c738feddeed46266cb54881a40fe1",
      "ref": "timsbury-walking-route"
    },
    {
      "description": "Compton Martin",
      "objectID": "a0c8853acf9ce444b5c8dc11b68a8222",
      "ref": "compton-martin-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/da3bcef561cd96e3cc03d51021886db7.gpx",
  "_geoloc": {
    "lat": 51.3461092551,
    "lng": -2.6078276111
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/ST553599_From_Kingshill_Lane_over_Chew_Valley_Lake_-_geograph.org.uk_-_67300.jpg",
      "title": "Colin S Pearson / ST553599 From Kingshill Lane over Chew Valley Lake, via Wikimedia Commons",
      "caption": "From Kingshill Lane over Chew Valley Lake. From a bend in Kingshill Lane, looking east over the lake past Nunnery Copse. The B3114 road is just visible in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Chew_Valley_Lake_-_geograph.org.uk_-_758501.jpg",
      "title": "David Brown / Chew Valley Lake, via Wikimedia Commons",
      "caption": "Chew Valley Lake 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Chew_Valley_Lake_-_geograph.org.uk_-_758507.jpg",
      "title": "David Brown / Chew Valley Lake, via Wikimedia Commons",
      "caption": "Chew Valley Lake 3"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Chew_Valley_Lake%2C_World_Heritage_Site_-_geograph.org.uk_-_758.jpg",
      "title": "Pam Brophy / Chew Valley Lake: World Heritage Site, via Wikimedia Commons",
      "caption": "Chew Valley Lake: World Heritage Site. Taken on the B3114 at the weir and blurb boards about the Wetlands and its World Heritage Status. View looks north west across the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Chewvalleylakeplaque.JPG",
      "title": "The original uploader was Rodw at English Wikipedia. [CC BY 2.5 (https://creativecommons.org/licenses/by/2.5)], via Wikimedia Commons",
      "caption": "Showing the plaque at the lake to celebtrate Queen Elizabth II opening the lake in 1956"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Chew_Valley_Lake_from_Hinton_Blewett._-_panoramio.jpg/512px-Chew_Valley_Lake_from_Hinton_Blewett._-_panoramio.jpg",
      "title": "Bob&Anne Powell [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The lake from Hinton Blewett."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Chew_Valley_Lake_-_geograph.org.uk_-_56993.jpg",
      "title": "Dominic Dawn Harry and Jacob Paterson / Chew Valley Lake, via Wikimedia Commons",
      "caption": "The lake from the picnic area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/ST570615_northern-most_edge_of_Chew_Valley_Lake_-_geograph.org.uk_-_67299.jpg",
      "title": "Colin S Pearson / ST570615 northern-most edge of Chew Valley Lake, via Wikimedia Commons",
      "caption": "Northern-most edge of the lake. Standing at ST570615 on northern-most edge of the lake, looking directly east"
    }
  ],
  "distance_km": 1.2,
  "description": "This walk follows the delightful nature trail which runs along the eastern side of this large lake in Chew Stoke. The trail is well surfaced and offers great views across the lake towards Denny Island, a nesting site for Great Crested Grebe, Tufted Duck and Canada Geese. You will also pass the reed beds where you can look out for Reed Bunting and in the summer, enjoy the purple flowers of March Woundwort. The trail includes an area of woodland with Sweet Chestnut, Beech and Sycamore trees. Look out for Coal Tits, Chaffinches and the brown Tree Creeper in this area. There's also a pond, a wildflower meadow and wonderful views across the lake towards the Mendip Hills. After your walk you can enjoy refreshments in the lakeside cafe. The lake is located just south of Chew Magna and has a car park at the start of this route. You can easily reach the lake from the village by following our Chew Magna Circular Walk which visits the River Chew and Knowle Hill before descending to the lakeside. The Two Rivers Way walking route runs past the lake too so you could pick this up to extend your walk. Heading west takes you towards Buttcombe where you can visit the lovely Blagdon Lake with more nice nature trails to try. You can also pick up the Three Peaks Walk on the eastern side of the water at Hollow Brook. This lovely long distance trail will take you further into the Chew Valley where you could visit High Littleton and Greyfield Woods. National Cycle route 3 runs along Herons Green Bay on the the western side of the lake. You can use the signed route and minor roads on the eastern side to create a circular route around the lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "For a bite to eat after your exercise head to the Salt & Malt restaurant at the northern end of the lake. (postcode BS40 8XS). It was awarded Best Fish & Chips at the Bristol Good Food Awards 2018 and also provides fine views over the water. Also highly recommended is the Pony and Trap (Postcode:BS40 8TQ). The 200 year old gastro-pub is prized for its bar food as well as its Michelin-starred dining room. It's located just to the east of the lake on Moorledge Road in a lovely country setting. There's outdoor seating with fine views over the Chew Valley. Just to the south of the lake is the pretty village of Compton Martin. Here you will find a noteworthy Norman church and the picturesque millpond which is the source of the Congresbury Yeo River. There's also the The Ring O' Bells, an historic pub dating back to the 16th century. There's a wonderful old interior with plenty of original features such as dark wooden beams, wooden flooring, stone walls and a large inglenook fireplace. Outside there's a fantastic, large beer garden with views of the surrounding countryside. It's a great place to relax in on warmer days. You can find them at postcode BS40 6JE for your sat navs. They are dog friendly."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake is a great place for dog walking although they do have to be kept on the lead here as it is not good for them to go into the water. Blue-green algae forms on the lake and is toxic to dogs but providing they are kept on a lead it's a lovely place for a dog walk."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a couple of miles to the south there's the less well known Litton Reservoir. There's more lovely waterside footpaths here, running alongside two pretty lakes. There's also an excellent award winning pub in the little village of Litton, just south of the lakes. Cycling Information: The Avon Cycleway passes along the northern edge of the lake. The long distance circular ride explores the area around Bristol, visiting the edge of the Cotswolds and the coast around Clevedon. For more walking ideas in the area see the Mendip Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rWvQBYa-cT8",
  "county": "Bath and North East Somerset",
  "region": "West of England",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Walley Lane, Chew Magna, Bath and North East Somerset, West of England, England, BS40 8TG, United Kingdom",
  "postcode": "BS40 8TG",
  "district": "Chew Magna",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake",
    "grassland"
  ],
  "points_of_interest": [
    "wildflower meadow",
    "lake views",
    "reed beds",
    "Mendip Hills views"
  ],
  "facilities": [
    "car park",
    "cafe",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}