{
  "created_at": "2025-01-06T04:38:22.219367+00:00",
  "objectID": "daa137623f40f524ab27253c4bd999ee",
  "ref": "hertfordshire-chain-walk-walking-route",
  "title": "Hertfordshire Chain Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/49/Long_distance_trail_bridleway%2C_Hertfordshire_Chain_Walk_-_geograph.org.uk_-_534964.jpg",
  "nearby": [
    {
      "description": "Whitewebbs Park",
      "objectID": "d9d4b0334c0db4ec7e125d7d19788b7e",
      "ref": "whitewebbs-park-walking-route"
    },
    {
      "description": "Enfield",
      "objectID": "13baca9cfcce8f494dc698c77578e4f4",
      "ref": "enfield-walking-route"
    },
    {
      "description": "Welwyn Garden City",
      "objectID": "5e692e216286c9ef7423044102462363",
      "ref": "welwyn-garden-city-walking-route"
    },
    {
      "description": "Ashwell",
      "objectID": "254f7f510e0c941e12731383b7a282c8",
      "ref": "ashwell-walking-route"
    },
    {
      "description": "Tewin",
      "objectID": "c05f9420da1585c8ee021b38920ce490",
      "ref": "tewin-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/daa137623f40f524ab27253c4bd999ee.gpx",
  "_geoloc": {
    "lat": 51.6841547064,
    "lng": -0.1094563164
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Long_distance_trail_bridleway%2C_Hertfordshire_Chain_Walk_-_geograph.org.uk_-_534964.jpg",
      "title": "Jodie Whiteley / Long distance trail bridleway, Hertfordshire Chain Walk",
      "caption": "Long distance trail bridleway, east of Stevenage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Tewin%2C_The_Hertfordshire_Chain_Walk_-_geograph.org.uk_-_1562027.jpg",
      "title": "Nigel Cox / Tewin: The Hertfordshire Chain Walk",
      "caption": "Tewin. The Hertfordshire Chain Walk is a long distance footpath that crosses the county from south to north, from the outskirts of London to Cambridgeshire. It is actually a series of consecutive circular walks hence the chain name. This section is looking south from near Queen Hoo Hall towards Bramfield Park Wood. This section of track is called Park Lane, a far cry from its more illustrious cousin in London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Bull%27s_Green%2C_The_Hertfordshire_Chain_Walk_-_geograph.org.uk_-_1562583.jpg",
      "title": "Nigel Cox / Bull's Green: The Hertfordshire Chain Walk",
      "caption": "Bull's Green. This section is looking north from near Queen Hoo Hall down an unnamed lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Approaching_the_Green_at_Therfield%2C_Herts_-_geograph.org.uk_-_2871374.jpg",
      "title": "Approaching the Green at Therfield, Herts by Mick Malpass, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Approaching the Green at Therfield. The village is a nice place to stop at with its pub by the pretty village green."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Chain_Walk_-_geograph.org.uk_-_4208632.jpg/512px-Chain_Walk_-_geograph.org.uk_-_4208632.jpg",
      "title": "Chain Walk by Hugh Venables, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Chain Walk near Therfield"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Stubble_field_by_Chain_Walk_-_geograph.org.uk_-_4208645.jpg/512px-Stubble_field_by_Chain_Walk_-_geograph.org.uk_-_4208645.jpg",
      "title": "Stubble field by Chain Walk by Hugh Venables, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Stubble field by Chain Walk"
    }
  ],
  "distance_km": 62.0,
  "description": "The Hertfordshire Chain Walk is a series of circular walks running through Hertfordshire. This route is a combination of these walks, forming a linear route which runs from Enfield in London, through Hertfordshire to Ashwell & Morden Station in Cambridgeshire. The walk begins at Crews Hill Station in Enfield and heads towards Welwyn Garden City, passing through Whitewebbs Park, Derry's Wood and Wormley Wood Nature Reserve on the way. Near Welwyn you cross the River Mimram, before passing through Bramfield Woods on your way to Watton at Stone, crossing the River Beane on your way. The final section then takes you through Cottered and Kelshall before finishing at Ashwell & Morden Station. This walk gives super views of the flat lands of Cambridgshire while also visiting a series of delightful Hertfordshire parks, woods and nature reserves.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rose & Crown in Tewin is a nice village tavern where you can enjoy a pit stop. The oak-beamed pub serves good quality food and has an excellent selection of real ales. You can find them at Upper Green Rd, AL6 0LE. They are also dog friendly if you have your canine friend with you. Just to the south of the village you can take a small detour to visit Tewin Bury Farm. The hotel estate is well worth a visit with trails along the River Mimram, picturesque gardens, the Tewin Nature Reserve and the Grade I listed St Peter's Church to see. You can also enjoy a delicious afternoon tea here. In Watton at Stone there's the ancient Bull to investigate. The pub dates back to the 15th century and has an interesting history. It is believed that Catholic priests hiding from Henry VIII's guards during the Dissolution of the Monasteries would take refuge up the chimney of the huge inglenook fireplace that sits at the heart of the building. There's a charming olde worlde interior and a patio/heated terrace outside. You can find them on the High Street at postcode SG14 3SB. Near the village you can also explore the Woodhall Estate with its Grade I listed 18th century manor and riverside walks along the River Beane. In Therfield there's the noteworthy Fox and Duck. This award winning gastropub is located in a lovely spot on the green. The pub dates back to 1700 and includes a charming interior with a rustic and traditional feel. There's also a number of interesting historical artifacts donated by the Royston and District Museum. These include summarised accounts from 1900 to 1926 showing the impact of WW1 on the village pub. The pub serves high quality food which you can enjoy in the garden area with views of the village. You can find them at postcode SG8 9PN for your sat navs. In this area the trail also passes close to the popular Royston Heath. The heath is well worth a small detour from the route with its fine viewpoint and interesting wildlife. The site also includes a decent on site cafe with outdoor seating overlooking the heath. Just south of Hertford you'll pass through Little Berkhamsted where you can visit the Grade II listed Stratton's Tower, an excellently preserved five-storey observatory dating to 1789. For refreshment there's the Five Horseshoes. The Grade II listed pub serves a fine Sunday lunch and has a pleasant garden area to relax in. They are located on Church Road at postcode SG13 8LY for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Hertfordshire Walks, London Walks and Cambridgeshire Walks pages."
    }
  ],
  "postcode": "EN2 8BA",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "1,2, Cattlegate Road Crews Hill, London Borough of Enfield, London, Greater London, England, EN2 8BA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "parks",
    "woods",
    "nature reserves"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "linear",
  "activity_type": [
    "walking"
  ]
}