{
  "objectID": "daa15608b472b1da528cf823bef88aa3",
  "created_at": "2024-12-18T01:03:54.902280+00:00",
  "ref": "middlesbrough-walking-route",
  "title": "Walks in Middlesbrough Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Entrance_to_Middlesbrough_Docks_-_geograph.org.uk_-_893836.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/daa15608b472b1da528cf823bef88aa3.gpx",
  "_geoloc": {
    "lat": 54.5803013378,
    "lng": -1.2205602484
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Entrance_to_Middlesbrough_Docks_-_geograph.org.uk_-_893836.jpg",
      "title": "Mick Garratt / Entrance to Middlesbrough Docks",
      "caption": "Entrance to Middlesbrough Docks. On the far side the new Middlesbrough College is almost complete, the first students arriving in a couple of months. Nearer to the camera one of the old lock gates is permanently in an open position."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Statue_of_George_Hardwick_at_Riverside_Stadium_Middlesbrough_-_geograph.org.uk_-_1691646.jpg/512px-Statue_of_George_Hardwick_at_Riverside_Stadium_Middlesbrough_-_geograph.org.uk_-_1691646.jpg",
      "title": "peter robinson / Statue of George Hardwick at Riverside Stadium Middlesbrough",
      "caption": "Statue of George Hardwick at Riverside Stadium. An international capped 26 times for England during a successful period as a Middlesbrough Football Club full-back"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Flatts_Lane_Country_Park_-_geograph.org.uk_-_604216.jpg",
      "title": "Mick Garratt / Flatts Lane Country Park",
      "caption": "Flatts Lane Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Ormesby_Hall_-_geograph.org.uk_-_184677.jpg",
      "title": "Mick Garratt / Ormesby Hall",
      "caption": "The 18th century Ormesby Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/View_From_the_Bandstand_to_the_Central_Fountain_-_geograph.org.uk_-_609509.jpg/256px-View_From_the_Bandstand_to_the_Central_Fountain_-_geograph.org.uk_-_609509.jpg",
      "title": "Mick Garratt / View From the Bandstand to the Central Fountain",
      "caption": "View From the Bandstand to the Central Fountain. Albert Park was donated to Middlesbrough by the Ironmaster Henry Bolchow. It was opened on 11th August 1868 by Prince Arthur Duke of Connaught the youngest son of Queen Victoria. The park was named after Prince Albert the late husband of the Queen. It was designed by William Barratt and since 2000 has undergone a multi million pound restoration including the fountain and the recreation of this bandstand."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Folly%2C_Stewart_Park_-_geograph.org.uk_-_967541.jpg",
      "title": "Mick Garratt / Folly, Stewart Park",
      "caption": "Folly Temple, Stewart Park. A garden folly once part of the Marton Hall estate built by Teesside industrialist Henry Bolckow in 1858. In 1878 the estate passed to Bolckow's nephew Carl who managed to continue to lead an extravagant lifestyle despite the boom years of the iron industry being over. By 1907 the hall was empty, all fixtures being sold to pay off his debts. Apart from the billeting of troops during WW1 it was never lived in again. The estate was brought in 1925 by Thomas J Stewart who presented it to Middlesbrough as a park. The hall itself destroyed by fire in 1960. A few stoneworks remain."
    }
  ],
  "distance_km": 20.0,
  "description": "This large town in Yorkshire has a number of fine walks to try in the town and through the surrounding area. There's a number of attractive parks, river walks along the Tees and several interesting historical sites to visit. This walk heads south through the town to visit Normanby Hall, Flatts Lane Country Park and Ormesby Hall. The walk starts at Middlesbrough Dock on the River Tees, just to the east of the train station. Here you can pick up the Tees Link and follow the waymarked footpath south east past the Riverside Stadium, home to Middlesbrough F.C. It will take you past North Ormesby, Brambles Farm and Teesville. Here you can follow the Spencer Beck to Normanby Hall. The trail continues to Flatts Lane Park where there are miles of nice woodland trails to try. There are also fine views over the Eston Hills and the North York Moors from the elevated position of the park. Here you could take a detour from the route and head north across Eston Moor to visit Eston Nab. It's another fine viewpoint on the edge of the town. After exploring the park the route then heads through Ormesby to visit Ormesby Hall. This National Trust owned hall is a Grade I listed building, described as a classic Georgian Mansion built in the Palladian style. There's 250 acres of parkland and farmland to explore on a network of footpaths. You can extend the walk here by heading a short distance west to visit Stewart Park where there's more nice trails and a museum. After exploring the hall the route then follows a shared cycling and walking trail north to Pallister before heading east to pick up the Tees Link. You can then follow this back to the river and the finish point back at the dock.",
  "video_url": "https://www.youtube.com/embed/_YsBGxsTFCc",
  "district": "Middlesbrough",
  "county": "Middlesbrough",
  "region": "North East",
  "country": "England"
}