{
  "created_at": "2025-01-06T03:19:26.665344+00:00",
  "objectID": "daef58fa08cb8236e61843838be785f5",
  "ref": "york-river-walk-walking-route",
  "title": "York River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/York_River_Ouse_and_Lendal_Tower.jpg/512px-York_River_Ouse_and_Lendal_Tower.jpg",
  "nearby": [
    {
      "description": "York Walls Walk",
      "objectID": "9cd9dd3b7ecfe332939346de434003f2",
      "ref": "york-walls-walk-walking-route"
    },
    {
      "description": "Foss Walk",
      "objectID": "be083885197fc245ad5628e5643ef5fc",
      "ref": "foss-walk-walking-route"
    },
    {
      "description": "Ebor Way",
      "objectID": "460b6eaefa835488435e3937ef49f82d",
      "ref": "ebor-way-walking-route"
    },
    {
      "description": "York to Selby",
      "objectID": "e9a63bcbfc3ba486d36d8b87a3f3578c",
      "ref": "york-to-selby-walking-and-cycle-route"
    },
    {
      "description": "York to Bishopthorpe",
      "objectID": "fe3a387fccbfab19ceadf57a15809941",
      "ref": "york-to-bishopthorpe-walking-route"
    },
    {
      "description": "Naburn Locks",
      "objectID": "d5f8608067ae6dfdafa6812d7e60ef6e",
      "ref": "naburn-locks-walking-route"
    },
    {
      "description": "Minster Way",
      "objectID": "27c22b8c3ab40d27b053a9bb80337b34",
      "ref": "minster-way-walking-route"
    },
    {
      "description": "Wheldrake Woods",
      "objectID": "a01a166b8c6d08ed02c491af7c64f04e",
      "ref": "wheldrake-woods-walking-route"
    },
    {
      "description": "Stockton on the Forest",
      "objectID": "3e7526382c1d793053e92e900cf2d2fa",
      "ref": "stockton-on-the-forest-walking-route"
    },
    {
      "description": "Stamford Bridge",
      "objectID": "57936c3f6afc3a6cf113c8a7949b42fe",
      "ref": "stamford-bridge-walking-route"
    },
    {
      "description": "Nun Monkton",
      "objectID": "c4a692811ec4ffd1e8b44e8c31f3e406",
      "ref": "nun-monkton-walking-route"
    },
    {
      "description": "Beningbrough Hall",
      "objectID": "a6a35c7df77e510d32b4d2686dca2bfa",
      "ref": "beningbrough-hall-walking-route"
    },
    {
      "description": "Acaster Malbis",
      "objectID": "e910bca21683fbfb10cb8f204db8888b",
      "ref": "acaster-malbis-walking-route"
    },
    {
      "description": "Haxby",
      "objectID": "5761a0f88166b3443b8fa908f4590ccb",
      "ref": "haxby-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/daef58fa08cb8236e61843838be785f5.gpx",
  "_geoloc": {
    "lat": 53.9586526916,
    "lng": -1.085662697
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/York_River_Ouse_and_Lendal_Tower.jpg/512px-York_River_Ouse_and_Lendal_Tower.jpg",
      "title": "By Jhsteel (Own work) [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "River Ouse and Lendal Tower. This medieval tower formally formed part of the city defences. It is located on the east bank of the Ouse at the point where the river enters the walled city from the north-west. It is now available as rental accommodation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/York%2C_River_Ouse_-_panoramio.jpg/512px-York%2C_River_Ouse_-_panoramio.jpg",
      "title": "Paul Lakin [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Lovely view of the Ouse. The river is the sixth longest in the UK and (including the Ure) the longest to flow entirely in one county. It runs for a distance of about 52 miles (84 km). You'll see plenty of barges making their way along the river on your outing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/York_Castle_Clifford%27s_Tower_2007.jpg/512px-York_Castle_Clifford%27s_Tower_2007.jpg",
      "title": "By Steven Fruitsmaak (Own work) [Public domain], via Wikimedia Commons",
      "caption": "York Castle Clifford's Tower. The castle has a long and fascinating history having been built originally by William the Conqueror in the 11th century. It's purpose was to dominate the former Viking city of Jórvík. The castle then suffered a tumultuous early history before developing into a major fortification with extensive water defences. Today the castle is managed by English Heritage and classed as a Grade I listed building. It includes an interesting museum packed with local history. There are also excellent views over the city from the castle's elevated position."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Barges_in_the_River_Foss%2C_York_%289425017605%29.jpg/512px-Barges_in_the_River_Foss%2C_York_%289425017605%29.jpg",
      "title": "By Tim Green from Bradford (Barges in the River Foss, York) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Barges in the River Foss. The Foss is a left bank tributary of the Ouse, situated near York Castle. In 1069 William the Conqueror dammed the Foss just south of the castle, close to its confluence with the Ouse creating a moat around the castle. This lead to river to flooding further upstream in what is now the Hungate and Layerthorpe areas, forming a large lake that was known as the \"King's Pool\" or the \"King's Fish Pond\", providing fish for the markets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Rowntree_Park%2C_York_%2819304310343%29.jpg/512px-Rowntree_Park%2C_York_%2819304310343%29.jpg",
      "title": "By Tim Green from Bradford (Rowntree Park, York) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Rowntree Park canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Rowntree_Park.jpg/512px-Rowntree_Park.jpg",
      "title": "Dashwortley at the English language Wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Rowntree Park entrance. The park was created in memory of employees of the local confectioners Rowntree's who died in World War I. It was opened in July 1921 by local entrepreneur and philanthropist Joseph Rowntree. Also noteowrhy are the gates at the park's riverbank entrance which are eighteenth-century and were given by the company as a memorial to the people of York who died in World War II."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Millennium_Bridge%2C_York_%283352241036%29.jpg/512px-Millennium_Bridge%2C_York_%283352241036%29.jpg",
      "title": "By Tim Green from Bradford (Millennium Bridge, York) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Millennium Bridge 1. The impressive structure spans the River Ouse to the south of York, linking Hospital Fields Road and Maple Grove in Fulford with Butcher Terrace on the South Bank. The bridge carries a cycle path and a footpath, but is not open to cars. There are plenty of seats on the bridge where you can relax and enjoy the view down the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/York_Millennium_Bridge.jpg/512px-York_Millennium_Bridge.jpg",
      "title": "By Tim Green from Bradford (originally posted to Flickr as Millennium Bridge) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Millennium Bridge 2"
    }
  ],
  "distance_km": 3.5,
  "description": "Enjoy an easy stroll along the River Ouse on this waterside circular walk through York. You'll visit the splendid Rowntree Park, York Millennium Bridge, Tower Gardens and York Castle. There's also views of the famous York City Walls parts of which date from Roman times. The walk starts on the river next to All Saints Church and the bus station. You follow the western side of the river along Terry Avenue to Rowntree Park which is well worth a small detour off the route. In the park you will find lovely canal-side footpaths, ornate statues, a large lake and a water cascade. After exploring the riverside park you cross the river on the York Millennium Bridge. The impressive structure was opened on 10 April 2001, having cost £4.2 million to build. On the eastern side of the river you head north along New Walk to York Castle, passing the River Foss as you go. The now ruinous keep of Clifford's Tower sits in a prominent position above the rivers and the city. The castle has an interesting history stretching back to the 11th century. It is now open to the public and managed by English Heritage. After exploring the castle the route then crosses back to the western side of the river, returning to the start point near the train and bus stations. To continue your walking in this lovely city try the historic York Walls Walk. Much of the Roman walls are still intact, making for an excellent, elevated walk around the city. Near the castle you can pick up the Foss Walk and enjoy another riverside walk from York. The long distance trail runs north from the city to Haxby and Huntington. Part of this route uses a section of the Ebor Way. To extend the walk you could continue south along the trail to nearby Bishopthorpe. The York to Selby trail runs along the river in the other direction.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kings Arms is in a great location next to the river. You can sit outside and enjoy fine views over the water with your meal. They do good food and have a decent selection of ales too. You can find them close to the Jorvik Viking Centre at 3 King's Staith with a postcode of YO1 9SN for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the route you'll also find one of the highlights of the city at the Jorvik Viking Centre. The attraction inclides lifelike mannequins and life-size dioramas depicting Viking life in the city. Its name is derived from Jórvík, the Old Norse name for the city of York. You can find it at 19 Coppergate with a postcode of YO1 9WT. Head just a few miles south along the river and you'll find one of the hidden gems of the area at Naburn Locks. The photogenic site includes an impressive 18th century lock and weir with riverside paths, a nature trail and a sensory garden to see as well. There's also a lovely country pub in the nearby village of Naburn where you can enjoy refreshments after your walk. One nice idea to escape from the city is to pick up the Minster Way and follow it south east to the nearby Wheldrake Woods. The peaceful woods are a nice place for a quiet stroll with lots of woodland birds and deer to look out for. The historic Beningbrough Hall lies a few miles north west of the city. The grounds of this Georgian mansion are a fine place for a stroll with views of the River Ouse and beautiful gardens to enjoy. On the opposite side of the river you can also see the village of Nun Monkton which sits at the confluence of the River Nidd and Ouse. The village has some interesting features including a village green, duck pond, pretty cottages, riverside trails and the impressive 17th century Nun Monkton Priory. For more walking ideas in the county see the Yorkshire Walks page."
    }
  ],
  "postcode": "YO1 6JF",
  "district": "York",
  "county": "York",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "North Street, Bootham, Bishophill, York, York and North Yorkshire, England, YO1 6JF, United Kingdom",
  "state": "England"
}