{
  "created_at": "2025-01-06T00:30:19.846756+00:00",
  "objectID": "db427bcecb88984c8e3874e978665ca9",
  "ref": "loch-oich-walking-and-cycle-route",
  "title": "Loch Oich Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Loch_Oich_-_geograph.org.uk_-_488513.jpg",
  "nearby": [
    {
      "description": "Great Glen Way",
      "objectID": "b94ae1a45d71491d745f5c4e27b02dd1",
      "ref": "great-glen-way-walking-and-cycle-route"
    },
    {
      "description": "Loch Lochy",
      "objectID": "d36057e132870a010648b1e27ed625b0",
      "ref": "loch-lochy-walking-and-cycle-route"
    },
    {
      "description": "Caledonian Canal",
      "objectID": "1e8c5799de9d1a0c2c3049f9be3a7437",
      "ref": "caledonian-canal-walking-and-cycle-route"
    },
    {
      "description": "Loch Garry",
      "objectID": "4acce3d538e53d5a05c4004cd401b3bb",
      "ref": "loch-garry-walking-route"
    },
    {
      "description": "Loch Laggan",
      "objectID": "e3650372cbd5efb4b4e6e676218daad0",
      "ref": "loch-laggan-walking-route"
    },
    {
      "description": "Creag Meagaidh",
      "objectID": "e8a6b6876682940b25a32a6034f7fd8c",
      "ref": "creag-meagaidh-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/db427bcecb88984c8e3874e978665ca9.gpx",
  "_geoloc": {
    "lat": 57.0512116017,
    "lng": -4.7994838526
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Loch_Oich_-_geograph.org.uk_-_488513.jpg",
      "title": "John Allan / Loch Oich",
      "caption": "The south end of the loch, looking towards the Laggan swing bridge. The loch is the highest and shallowest of the Great Glen's four enclosed lochs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Loch_Oich_-_geograph.org.uk_-_418223.jpg",
      "title": "John Allan / Loch Oich",
      "caption": "Almost a full view of the grid square, taken from its north-west corner. The fields on this side of Loch Oich, and the steep wooded slope beyond, are all in the square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Loch_Oich_shoreline_-_geograph.org.uk_-_418220.jpg",
      "title": "John Allan / Loch Oich shoreline",
      "caption": "Shoreline. Looking towards Tobar nan Ceann (Well of the Heads), from the picnic area by the shore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Island_in_Loch_Oich_-_geograph.org.uk_-_488565.jpg",
      "title": "John Allan / Island in Loch Oich",
      "caption": "Island in Loch Oich. The island is linked to the southern shore of the loch by a narrow causeway - useful for fishermen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Loch_Oich_-_geograph.org.uk_-_890001.jpg",
      "title": "Colin Smith / Loch Oich",
      "caption": "Looking south-west over the loch towards Invergarry. A navigation channel had to be dredged through this loch, the shallowest on the Caledonian Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/The_buoyed_channel_through_Loch_Oich_-_geograph.org.uk_-_1456111.jpg",
      "title": "Des Colhoun / The buoyed channel through Loch Oich",
      "caption": "The buoyed channel through the loch. This picture was taken in a nor'easterly direction; the presence of the navigation buoys gives an idea of the varied topography of the loch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/A_nor%27easterly_view_along_Loch_Oich_-_geograph.org.uk_-_1455906.jpg",
      "title": "Des Colhoun / A nor'easterly view along Loch Oich",
      "caption": "A nor'easterly view along the loch. That's the crannog of Eilean Drynachan to port and in the distance you can see the red hull of the \"Fruitful Bough\", a trawler en route from the west coast grounds to the eastern fishing grounds. The swing bridge of Aberchalder is also visible in the mid distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Sailing_Through_Loch_Oich_-_geograph.org.uk_-_889963.jpg",
      "title": "Colin Smith / Sailing Through Loch Oich",
      "caption": "Sailing through the loch. Two-masted yacht heading south on Loch Oich towards Laggan Swing Bridge. In the background is ruined Invergarry Castle. The castle was the seat of the Chiefs of the Clan MacDonell of Glengarry, a powerful branch of the Clan Donald. Its position overlooking Loch Oich on Creagan an Fhithich – the Raven's Rock – in the Great Glen, was a strategic one in the days of clan warfare."
    }
  ],
  "distance_km": 16.0,
  "description": "Enjoy a circular cycle or walk around Loch Oich in the Scottish Highlands. On the western side of the loch you can follow challenging woodland trails through the forest above the loch in Invergarry. On the eastern side you can follow a flatter, waterside trail along the Great Glen Way. Good start points for the route are at the villages of Invergarry or Aberchalder. You could also start from the Forestry Commission car park at the southern end of the loch. Along the route you will pass the River Garry and the ruins of the 17th century Invergarry Castle. There's also attractive woodland and great views of the surrounding hills. You can extend the route by continuing along the Great Glen Way and the Caledonian Canal to the nearby Loch Lochy. Here you'll find a great traffic free cycle and walking trail running along the huge loch.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east and there's another lovely lochside walking and cycling trail along the expansive Loch Ericht. The path starts at Dalwhinnie train station and provides splendid views of Ben Alder. Loch Rannoch with its expansive forest is also located in this area. Head west and there's a viewpoint car park and nice trails along Loch Garry. Also to the east is Loch Laggan and the Ardverikie Estate. The loch includes the largest freshwater beach in Britain. The expansive estate was also used for the BBC series Monarch of the Glen. On the northern side of the loch there's also the Creag Meagaidh Nature Reserve. The area includes a wide variety of interesting flora and fauna with several nationally important plant species. There's also a circular waymarked trail which will take you to a fine viewpoint. For more walking ideas in the area see the Scottish Highlands Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/-CG39UYS6mg",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A82, North Laggan, Highland, Alba / Scotland, PH35 4HP, United Kingdom",
  "postcode": "PH35 4HP",
  "district": null,
  "state": "Alba / Scotland"
}