{
  "created_at": "2025-01-05T23:45:14.438515+00:00",
  "objectID": "db7fae31b321bf5af860bcb67af4f5bb",
  "ref": "the-diana-princess-of-wales-memorial-walk-walking-route",
  "title": "The Diana Princess of Wales Memorial Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/St_James%27s_Park_Lake_%E2%80%93_East_from_the_Blue_Bridge_-_2012-10-06.jpg/512px-St_James%27s_Park_Lake_%E2%80%93_East_from_the_Blue_Bridge_-_2012-10-06.jpg",
  "nearby": [
    {
      "description": "Kensington Gardens",
      "objectID": "160aef1493ad8f6d40fb5d178d290784",
      "ref": "kensington-gardens-walking-route"
    },
    {
      "description": "Regent's Canal",
      "objectID": "665ac8f0633d7dc72cfc564303ad322b",
      "ref": "regents-canal-walking-and-cycle-route"
    },
    {
      "description": "Regent's Park",
      "objectID": "9cce20d45cd68785674da3aa419c117b",
      "ref": "regents-park-walking-route"
    },
    {
      "description": "Jubilee Greenway",
      "objectID": "9d547964aacbc512d2fcffb356aff771",
      "ref": "jubilee-greenway-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/db7fae31b321bf5af860bcb67af4f5bb.gpx",
  "_geoloc": {
    "lat": 51.5080260992,
    "lng": -0.1869094225
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/St_James%27s_Park_Lake_%E2%80%93_East_from_the_Blue_Bridge_-_2012-10-06.jpg/512px-St_James%27s_Park_Lake_%E2%80%93_East_from_the_Blue_Bridge_-_2012-10-06.jpg",
      "title": "© User:Colin / Wikimedia Commons, via Wikimedia Commons",
      "caption": "St James's Park Lake – East from the Blue Bridge. To the north is the base of the Swire Fountain (not active); in the centre is Duck Island; to the south is the Tiffany Fountain on Pelican Rock. Past the lake to the north are the grounds known as Horse Guards Parade, with the Horse Guards building, the Old War Office building and Whitehall Court progressively behind. Past the lake to the south is the Foreign and Commonwealth Office, with the London Eye, the Shell Tower and The Shard progressively behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/London_St_James_Park_2011.JPG/512px-London_St_James_Park_2011.JPG",
      "title": "By Marcin Białek (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "London St James Park. The park is bounded by Buckingham Palace to the west, the Mall to the north, Horse Guards to the east, and Birdcage Walk to the south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Sunken_Garden_-_Kensington_Palace_-_geograph.org.uk_-_1862106.jpg/512px-Sunken_Garden_-_Kensington_Palace_-_geograph.org.uk_-_1862106.jpg",
      "title": "Sunken Garden - Kensington Palace by Colin Babb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sunken Garden - Kensington Palace. One of the many buildings associated with the Princess. The palace has been a residence of the British royal family since the 17th century, and is currently the official London residence of the Prince and Princess of Wales, the Duke and Duchess of Gloucester, the Duke and Duchess of Kent, and Prince and Princess Michael of Kent. The State Rooms here are open to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Hyde_Park_Corner_London_-_geograph.org.uk_-_1094795.jpg",
      "title": "PAUL FARMER / Hyde Park Corner London",
      "caption": "Hyde Park Corner London. Picture take from top of Wellington Arch showing rehearsal for Trooping the Colour. Hyde Park is the largest of the four Royal Parks and is divided by the Serpentine and the Long Water lakes. Free speech and demonstrations have been a key feature of Hyde Park since the 19th century. Speakers' Corner has been established as a point of free speech and debate since 1872, while the Chartists, the Reform League, the suffragettes, and the Stop the War Coalition have all held protests there. The park is also often used for major concerts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Avenue_of_Plane_Trees._Green_Park_London_-_geograph.org.uk_-_3020723.jpg",
      "title": "Avenue of Plane Trees. Green Park London by Derek Voller, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Avenue of Plane Trees. Green Park. First enclosed in the 16th century, the park was landscaped in 1820 and is notable among central London parks for having no lakes or buildings, and only minimal flower planting in the form of naturalised narcissus. Together with Kensington Gardens and the gardens of Buckingham Palace, these parks form an almost unbroken stretch of tended green land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Clarence_house.jpg/494px-Clarence_house.jpg",
      "title": "Clarence House, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clarence House. The building glimpsed on the left is Lancaster House. The brick building on the right is St James's Palace which adjoins Clarence House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/London_Princess_Diana_Memorial_Fountain_-20130715-RM-124600.jpg/512px-London_Princess_Diana_Memorial_Fountain_-20130715-RM-124600.jpg",
      "title": "Reinhold Möller, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Princess Diana Memorial Fountain. The sculpture was opened in 2004 and designed to express Diana's spirit and love of children."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/The_Diana%2C_Princess_of_Wales_Memorial_Walk_%E2%80%93_Green_Park.jpg",
      "title": "Vards Uzvards, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "One of the walk markers in Green Park. Green Park is one of the Royal Parks of London, located in the heart of the city. It covers an area of 47 acres and is situated between Buckingham Palace to the east and Hyde Park to the west. The park is named after its grassy lawns, which are a prominent feature of the landscape. The lawns are surrounded by mature trees and shrubs, which provide a pleasant and relaxing environment for visitors to enjoy. The park is also home to a variety of wildlife, including ducks, geese, and squirrels."
    }
  ],
  "distance_km": 11.0,
  "description": "This 7 mile walk in the capital visits four splendid London parks. The lovely trail is dedicated to the memory of Diana, Princess of Wales who had strong associations with many of the sites on the walk. These include buildings such as Kensington Palace, Spencer House, Buckingham Palace, St. James's Palace, and Clarence House. The trail passes through Kensington Gardens, Hyde Park, Green Park and St James's Park on a series of well laid out, surfaced footpaths. The paths are waymarked with ninety individual plaques, each of which has a heraldic rose etched in the centre. It's a wonderful way to explore several of London's best parks in an afternoon. Highlights on the walk include the Diana, Princess of Wales Memorial Fountain, the beautiful Serpentine Lake in Hyde Park and views of Big Ben and the London Eye from Blue Bridge in St James Park. Also look out for the famous Pelicans in this area. The walk is in a figure of eight pattern so you could start and finish from any number of places. Hyde Park Corner, St James's Park Tube, Green Park Tube or the Serpentine car park in Kensington Gardens are all good options. If you would like to extend your walk then you could pick up the Jubilee Greenway in Kensington Gardens and head north to Little Venice where you could follow the Regent's Canal to Regent's Park. At St James's Park you are very close to the River Thames where you could pick up the Thames Path and enjoy a riverside walk to the Houses of Parliament. You can virtually explore the parks using the google street view link below!",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Regent's Park there's a couple of fine options for refreshments. The Boathouse Cafe is a family restaurant with a large terrace seating area where you can sit outside and enjoy views of the lake. It is located on The Boating Lake near Hanover Gate and sells sandwiches, toasties, flat bread pizza’s, soup, stew, cakes and snacks. The Regent's Bar & Kitchen is located in the middle of Regent's Park on the Inner Circle, close to the Open Air Theatre and to the Queen Mary's Gardens. In good weather it includes a terrace BBQ offering burgers, hot dogs and vegetarian options alongside ice cold draft beer and Pimm's during the summer. In Hyde Park you will find the splendid Lido Cafe. There's a nice outdoor seating area where you can relax and enjoy a snack while enjoying views over the lovely Serpentine Lake. The cafe is located on the south side of the Serpentine, near the Diana Princess of Wales Memorial Fountain."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For cyclists Cycle Superhighway 3 passes through this area. The popular trail runs from Lancaster Gate to Greatfields Park in Barking, passing several of the city's highlights on the way. You could follow it around Hyde Park where there are some lovely traffic free paths to follow. Just west of Kensington Gardens there's Holland Park to explore. The historic park was formerly the grounds of a Jacobean mansion called Holland House. It's well worth a visit with beautiful gardens, wildlife rich woodland, a stunning Japanese garden with waterfalls and a nice cafe for refreshments."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Op-WzUQ7t1o",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Broad Walk, Bayswater, London, Greater London, England, W8 4PX, United Kingdom",
  "postcode": "W8 4PX",
  "state": "England"
}