{
  "created_at": "2025-01-06T01:02:13.323089+00:00",
  "objectID": "dc1d9fd2bd105e2d687f26a2aac50545",
  "ref": "carlisle-walking-route",
  "title": "Carlisle Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/de/Carlisle_castle_-_geograph.org.uk_-_1002217.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/dc1d9fd2bd105e2d687f26a2aac50545.gpx",
  "_geoloc": {
    "lat": 54.8967991844,
    "lng": -2.9429222377
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Carlisle_castle_-_geograph.org.uk_-_1002217.jpg",
      "title": "George Evans [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Carlisle Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Carlisle_Cathedral_03.JPG/512px-Carlisle_Cathedral_03.JPG",
      "title": "By The original uploader was Soloist at English Wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Carlisle Cathedral"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/A7_Roadbridge_over_River_Eden_in_Carlisle_-_geograph.org.uk_-_92889.jpg",
      "title": "Bob Jenkins [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A7 Roadbridge over River Eden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/River_Eden_From_Eden_Bridge_-_geograph.org.uk_-_838244.jpg",
      "title": "Andy Connor [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Eden From Eden Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Rickerby_Park_-_Carlisle_-_geograph.org.uk_-_503806.jpg",
      "title": "R J McNaughton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Rickerby Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Sheep_grazing_in_Rickerby_Park_-_geograph.org.uk_-_601293.jpg",
      "title": "Rose and Trev Clough [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Sheep Grazing in Rickerby Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Cenotaph_in_Rickerby_Park_-_geograph.org.uk_-_1283247.jpg",
      "title": "David Liddle [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cenotaph in Rickerby Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/In_Rickerby_Park_-_geograph.org.uk_-_940837.jpg",
      "title": "Oliver Dixon [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Footpath in the park"
    }
  ],
  "distance_km": 5.0,
  "description": "This circular walk visits the Cumbrian city of Carlisle, exploring the castle grounds before picking up riverisde footpaths on either side of the River Eden. You'll also visit the delightful riverside Rickerby Park and the picturesque Eden Bridge Gardens on this easy 3.5 mile walk. The walk starts from Carlisle Castle which dates from the 11th century. It was originally built during the reign of William II of England, the son of William the Conqueror. Given the proximity of Carlisle to the border between England and Scotland, it has been the centre of many wars and invasions. Today the castle is managed by English Heritage and is open to the public. The walk begins by following public footpaths around the castle to the river. Here you pick up trails heading east through Bitts Park to the Eden Bridge. Cross the river here and you will enter Rickerby Park. The traditional Victorian park is a lovely place for a stroll with nice footpaths and good river views. The parkland is dotted with mature trees, beneath which cattle and sheep graze the pasture grasses. After exploring the park you can return to the southern side of the river over the Memorial Bridge. You then pick up more riverside footpaths taking you back to the castle via the golf course. Carlisle Cathedral is located just to the south of the castle and well worth a visit too. Its notable features include figurative stone carving, a set of medieval choir stalls and the largest window in the Flowing Decorated Gothic style in England. The city centre is largely pedestrianised so also pleasant for walkers. Other medieval buildings include the Guildhall and the Tithe Barn while the law courts date from the 16th century. The area around the city is great walking country so there are many good options for extending your exercise. Carlisle sits on the edge of the Solway Coast AONB so one good option is to pick up the Hadrian's Wall Path and head west. This will take you right into the AONB where there are wonderful views over the Solway Firth into Scotland. At the southern edge of the city you can pick up the Cumbria Way long distance trail. This follows a nice waterside path along the River Caldew to nearby Dalston. Following the Hadrian's Wall Path in a north easterley direction will take you along Hadrian's Wall into Northumberland. Also of interest is the lovely Watchtree Nature Reserve just to the west of the city. Here you will find lots of cycling and walking trails with reedbeds, lagoons, woodland, wild flower meadows and an elemental garden. To the east of the city, near Brampton, you can visit Talkin Tarn Country Park with its large glacial tarn, mature woodland, gentle meadows and stunning views of the Pennine Hills.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east of the city and you can visit the small market town of Brampton. Here you can try the circular Brampton Walk which visits two of the highlights of the area at Talkin Tarn Country Park and Gelt Woods. Also to the east is the village of Wetheral where you can visit a ruined priory, the River Eden and the National Trust's Wetheral Woods. Just to the south east of the city there's nice trails along the River Petteril at Wreay Woods. The peaceful woods are great for flora and fauna with kingfishers, dippers and otters to see by the river. To the north is the market town of Longtown, close to the border with Scotland. There's nice walks along the River Esk, a 15th century church and the largest sheep market in England to see here. For more walking ideas around Carlisle see the Cumbria Walks and the North Pennines Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SFhu0xDraBU",
  "postcode": "CA3 8UR",
  "district": "Carlisle",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Carlisle Castle, Dacre Road, Caldewgate, Carlisle, Cumberland, England, CA3 8UR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "parkland",
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "historical sites",
    "river views",
    "gardens",
    "nature reserve",
    "long distance trail"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}