{
  "created_at": "2025-01-06T03:20:05.415745+00:00",
  "objectID": "dc5b71f0a44dd3edba890004e5093d1a",
  "ref": "howden-reservoir-and-margery-hill-walking-route",
  "title": "Howden Reservoir and Margery Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Howden_Dam_-_geograph.org.uk_-_122276.jpg",
  "nearby": [
    {
      "description": "Derwent Reservoir",
      "objectID": "0ef7dbe8936cd47120af76f1c111942e",
      "ref": "derwent-reservoir-walking-route"
    },
    {
      "description": "Derwent Dam",
      "objectID": "c84aa24d380169ebc9edab71826f9685",
      "ref": "derwent-dam-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/dc5b71f0a44dd3edba890004e5093d1a.gpx",
  "_geoloc": {
    "lat": 53.4028597139,
    "lng": -1.7418588459
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Howden_Dam_-_geograph.org.uk_-_122276.jpg",
      "title": "Roger May / Howden Dam, via Wikimedia Commons",
      "caption": "Howden Dam. The dam separating Howden Reservoir from Derwent. Derwent dam, lower down the valley, in turn separates Derwent reservoir from Ladybower. This was the series of dams used during World War II for the dambusters to practice, before their famous raid on dams on the Rühr in Germany. The nearer of the two towers is within the square, the further one is just out."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Howden_Dam_from_Cold_Side_-_geograph.org.uk_-_370893.jpg",
      "title": "John Fielding / Howden Dam from Cold Side, via Wikimedia Commons",
      "caption": "Howden Dam from Cold Side. Slippery Stones pack-horse bridge is the next destination going north along Cold Side Bridleway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Howden_Clough_entering_Howden_reservoir_-_geograph.org.uk_-_1140556.jpg",
      "title": "Steve F [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Howden Clough entering Howden reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Howden_Reservoir_-_View_from_footpath_near_the_Royal_Oak_Tree_-_geograph.org.uk_-_731141.jpg",
      "title": "Alan Heardman / Howden Reservoir - View from footpath near the Royal Oak Tree, via Wikimedia Commons",
      "caption": "Howden Reservoir - View from footpath near the Royal Oak Tree"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Howden_Reservoir_-_Dam_Wall_-_geograph.org.uk_-_868669.jpg",
      "title": "Alan Heardman / Howden Reservoir - Dam Wall, via Wikimedia Commons",
      "caption": "Howden Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Margery_Hill_cairn.jpg/512px-Margery_Hill_cairn.jpg",
      "title": "User:Espresso Addict [CC BY-SA 2.5 (https://creativecommons.org/licenses/by-sa/2.5)], via Wikimedia Commons",
      "caption": "The cairn on Margery Hill, which has recently been discovered to be a Bronze Age burial mound."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Moorland%2C_Margery_Hill_-_geograph.org.uk_-_385128.jpg",
      "title": "Dave Dunford / Moorland, Margery Hill, via Wikimedia Commons",
      "caption": "Moorland, Margery Hill Featureless, and frankly dull, heather moorland between Margery Hill and Stainery Clough."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Ewden_valley_from_Margery_Hill_-_geograph.org.uk_-_385123.jpg",
      "title": "Dave Dunford / Ewden valley from Margery Hill, via Wikimedia Commons",
      "caption": "Ewden valley from Margery Hill. The view eastwards from the slopes of Margery Hill - featureless heather moorland with the occasional pool or peat grough, and hard going underfoot. The slight dip in the distance in the centre of the picture is the valley of Ewden Beck."
    }
  ],
  "distance_km": 17.0,
  "description": "Enjoy a lovely waterside walk along Howden Reservoir before a climb to Margery Hill provides great views over the area. The 11 mile circular walk includes a moderate climb so a reasonable level of fitness is required. The walk starts at the Fairholmes car park, at the southern end of Derwent Reservoir. There are good facilities here with an excellent visitor centre and cafe. From here you can pick up trails heading north along the eastern side of Derwent Reservoir, passing the noteworthy Derwent Dam before eventually leading you to Howden Dam and Howden Reservoir. The reservoir is in an interesting position with the western half lieing in Derbyshire, whereas the eastern half is in Sheffield, South Yorkshire. The county border runs through the middle of the reservoir, following the original path of the River Derwent. Trails continue north along the eastern side of the water until you reach the end of the reservoir. Here you turn east to pick up footpaths climbing to Cranberry Clough and Howden Edge, before the final ascent to Margery Hill. The hill stands at a height of 546-metrea (1,791 ft) making it one of the high points on the Howden Moors. The area is managed by the National Trust as part of their High Peak Estate and has also been designated as a Scheduled Ancient Monument by English Heritage. There are nice views of the surrounding Peak District Hills and the Ewden valley below. After taking in the views the route then descends back to Howden Edge before heading south to Wilfrey Neild, Upper Ney and Howden Clough. A short woodland section through Clough Wood then leads you back down to the reservoir where you can follow the waterside paths back to the car park. To continue your walking in the area head south and visit the lovely Ladybower Reservoir .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the Ladybower Inn for refreshments. This traditional stone-built pub dates back to the 18th century when it served as a Coaching Inn. There's also a nice beer garden with views over the Ladybower reservoir. The pub is located on The Snake Pass, at the eastern end of the lower Ladybower reservoir. Postcode is S33 0AX."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the way look out for the historic Slippery Stones packhorse bridge at the northern end of Howden Reservoir. The 17th century bridge is a reminder of the former Derwent Village which was 'drowned' in 1944 when the Ladybower Reservoir was created."
    }
  ],
  "video_url": "https://www.youtube.com/embed/q6pFz9h6vAo",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Jubilee Cottages, Derwent, High Peak, Derbyshire, East Midlands, England, S33 0AQ, United Kingdom",
  "postcode": "S33 0AQ",
  "district": "High Peak",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "cafe",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}