{
  "created_at": "2025-01-06T03:16:10.039081+00:00",
  "objectID": "dcae27896312abf1091e5973a84ef27e",
  "ref": "camel-trail-walking-and-cycle-route",
  "title": "Camel Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/46/Cyclists_on_the_Camel_Trail_-_geograph.org.uk_-_1541492.jpg",
  "nearby": [
    {
      "description": "Prideaux Place",
      "objectID": "a2ef6a4283c9480f4c665b9db7c7e7c5",
      "ref": "prideaux-place-walking-route"
    },
    {
      "description": "Saints Way",
      "objectID": "8d883d251886cb93951db47f4c100ddb",
      "ref": "saints-way-walking-route"
    },
    {
      "description": "Wadebridge",
      "objectID": "6269ee00a4f131495643b32e3ef8693d",
      "ref": "wadebridge-walking-route"
    },
    {
      "description": "Grogley Woods",
      "objectID": "50edb742218de151d5171abe22b755f9",
      "ref": "grogley-woods-walking-and-cycle-route"
    },
    {
      "description": "Blisland",
      "objectID": "3550d865372c05629a4b239d05b7abe9",
      "ref": "blisland-walking-route"
    },
    {
      "description": "Copper Trail",
      "objectID": "392710c05a6a23e71cefc13e668a8ef2",
      "ref": "copper-trail-walking-route"
    },
    {
      "description": "National Cycle Route 32",
      "objectID": "7a8dca7439e707fb70c011fe171dba51",
      "ref": "national-cycle-route-32"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/dcae27896312abf1091e5973a84ef27e.gpx",
  "_geoloc": {
    "lat": 50.5380931064,
    "lng": -4.9349192992
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Cyclists_on_the_Camel_Trail_-_geograph.org.uk_-_1541492.jpg",
      "title": "Tony Atkin / Cyclists on the Camel Trail",
      "caption": "Family of Cyclists on the Camel Trail approaching Padstow. Looking east along the Camel Estuary adjacent to one of the many rest stops along the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Camel_trail_-_geograph.org.uk_-_1629261.jpg",
      "title": "roger geach / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Once the mineral railway that ran from Wenfordbridge to Boscarne junction, then onwards to Wadebridge, shut in 1984. Now forms the popular camel trail cycling and walking route"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Camel_Trail%2C_Padstow_-_geograph.org.uk_-_29535.jpg",
      "title": "Chris J Dixon / Camel Trail, Padstow",
      "caption": "The trail at Padstow. This disused railway bridge carries the Camel Train footpath over Little Petherick Creek"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Cutting_on_the_Camel_Trail_%283%29_-_geograph.org.uk_-_1286384.jpg",
      "title": "Andy F / Cutting on the Camel Trail (3)",
      "caption": "This view is looking south along the cutting south of the iron bridge over Little Petherick Creek."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Foreshore_near_the_Camel_Trail_-_geograph.org.uk_-_1286405.jpg",
      "title": "Andy F / Foreshore near the Camel Trail",
      "caption": "Foreshore near the Trail. This view is looking south-east from the Camel Trail near the iron bridge over Little Petherick Creek."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Little_Petherick_Bridge%2C_Camel_Trail_-_geograph.org.uk_-_690289.jpg",
      "title": "Katy Walters / Little Petherick Bridge, Camel Trail",
      "caption": "Cyclists on the Little Petherick Bridge. This bridge carries the 17-mile Camel Trail, named after the adjacent Camel River and Estuary; Little Petherick Creek flows beneath it. It was strengthened in 2001. The Sustrans trail follows a disused railway line and links Bodmin, Wadebridge and Padstow (in the distance), with another branch to Poley's Bridge to the north of Bodmin. Several bike hire businesses along the route cater for a variety of visitors, offering tandems and child trailers as well as \"normal\" bikes for all ages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Camel_Trail_carpark_-_geograph.org.uk_-_1626769.jpg",
      "title": "roger geach / Camel Trail carpark",
      "caption": "Car park at the entrance near Pooley's Bridge. This end of the trail is less busy then the Wadebridge to Padstow section. Most of the route is built along the old railway line and it was just behind me where the line crossed this minor road to serve the clay driers. The railway shut in October 1983 at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Gatehouse_to_Prideaux_Place_Geograph-2902783-by-Rob-Farrow.jpg/512px-Gatehouse_to_Prideaux_Place_Geograph-2902783-by-Rob-Farrow.jpg",
      "title": "Rob Farrow / Prideaux Place from the east",
      "caption": "Gatehouse to Prideaux Place"
    }
  ],
  "distance_km": 29.0,
  "description": "This wonderful riverside trail follows a disused railway line and the River Camel from Padstow to Poley's Bridge. You start by Padstow's lovely harbour near the delightful Prideaux Place with its deer park and gardens. You then follow the trail along the Camel estuary to the market town of Wadebridge which is an ideal place to stop for refreshments. The path continues towards Bodmin before a pleasant wooded section through Dunmere and Colquite Woods takes you to Hellanbridge. The trail finishes shortly after at Poley's Bridge. This is a nice easy walk that is also open to cyclists and horse riders.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One nice idea is to stop of at the tea rooms at Prideaux Place for some refreshments on the route. Situated in what was once the Old Schoolroom, the tearoom is supplemented in the summer months by the addition of a marquee on the Terrace overlooking the Deer Park. It's a lovely setting to enjoy light lunches, cakes, coffee, tea, ice creams and the internationally renowned Cornish Cream Tea. You can find the house at a postcode of PL28 8RP for your sat navs. In Padstow there is an excellent Rick Stein cafe where you can pick up delicous fish and chips. You can find it near the harbour and river on Middle Street at postcode PL28 8AP. Wadebridge is another good stopping point on the route. Here you'll find the delightful Old Tea House. They do a delicious cream tea and have some fine home made cakes as well. You can find them at 6 Polmorla Rd with a postcode of PL27 7ND for your sat navs. For a pub lunch head to the noteworthy Maltsters Arms. The 16th century pub is located in a lovely spot on the village green. Near the end of the route there's the splendid Blisland Inn in Blisland. It's an award winning pub of some note, having been voted three times Cornwall CAMRA Pub of the Year and in 2001 becoming the campaign's national Pub of the Year. The interior is full of character with items such as pumps, barometers, toby jugs and coffee mugs to admire. They serve good quality homemade food and also have a nice garden to sit out in. You can find them at postcode PL30 4JF for your sat navs. The Camelford Way long distance footpath can also be picked up near here. The trail explores the River Camel Valley, heading north to visit the town of Camelford."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is a nice place for a dog walk. Please keep them on leads though as there will often be plenty of cyclists around. The Old Tea House and The Maltsters Arms pub mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The trail runs along part of National Cycle Route 32 which runs from Bodmin to Truro via St. Columb Major, Padstow and Newquay. It's a good way of extending your ride if you have time. Between Wadebridge and Bodmin you will pass Grogley Woods. The woods are a popular place for mountain bikers with several black graded trails to try. The site is located just to the west of the river and makes a nice detour if you are on a mountain bike and would like to sample some downhill lines and jumps. Towards the end the route links up with the epic Copper Trail. The long distance circular walk explores the historic Cornish Copper mines on Bodmin Moor."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iRZnBxqXx8c",
  "district": "Padstow",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Railway Pay and Display Car Park, Riverside, Padstow, Cornwall, England, PL28 8DA, United Kingdom",
  "postcode": "PL28 8DA",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "woodland"
  ],
  "points_of_interest": [
    "gardens",
    "market town"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling",
    "horse riding"
  ]
}