{
  "created_at": "2025-01-06T08:44:30.875671+00:00",
  "objectID": "dce3bdc01a32dac13c530394bb91eeec",
  "ref": "herriot-way-walking-route",
  "title": "Herriot Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Main_Street_-_geograph.org.uk_-_2378005.jpg/512px-Main_Street_-_geograph.org.uk_-_2378005.jpg",
  "nearby": [
    {
      "description": "Aysgarth Falls",
      "objectID": "ee14df3fbe45481784f4c520b389f4ef",
      "ref": "aysgarth-falls-walking-route"
    },
    {
      "description": "Mill Gill and Whitfield Force Waterfalls",
      "objectID": "d23c6f6f0ee5657c04b5fda07aaa6161",
      "ref": "mill-gill-and-whitfield-force-waterfalls-walking-route"
    },
    {
      "description": "Hardraw Force Walk",
      "objectID": "af58e373850c70eac32a3a62a4053ed3",
      "ref": "hardraw-force-walk-walking-route"
    },
    {
      "description": "Great Shunner Fell",
      "objectID": "66312ea1778e74ee242c2b39ff222088",
      "ref": "great-shunner-fell-walking-route"
    },
    {
      "description": "Kisdon Force",
      "objectID": "ab94f20bb0fd8f1b08fc4a2838a3ee27",
      "ref": "kisdon-force-walking-route"
    },
    {
      "description": "Gunnerside Gill",
      "objectID": "ed6479a9104b5622bd8429f4e5633339",
      "ref": "gunnerside-gill-walking-route"
    },
    {
      "description": "Askrigg",
      "objectID": "83ed29aaf6bec8d97c03798534a2dae8",
      "ref": "askrigg-walking-route"
    },
    {
      "description": "Castle Bolton",
      "objectID": "699564f281e5b70ef16472247dc7543e",
      "ref": "castle-bolton-walking-route"
    },
    {
      "description": "Keld",
      "objectID": "77c45b2e5481370b1f1cf4ea004daa0e",
      "ref": "keld-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/dce3bdc01a32dac13c530394bb91eeec.gpx",
  "_geoloc": {
    "lat": 54.2919148323,
    "lng": -1.993743707
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Main_Street_-_geograph.org.uk_-_2378005.jpg/512px-Main_Street_-_geograph.org.uk_-_2378005.jpg",
      "title": "Keith Evans / Main Street",
      "caption": "Looking up Main Street, Askrigg, North Yorkshire, England. Skeldale House is on the right.The outside of this house (closer view) featured as the surgery where James Herriot practised in the TV series \"All Creatures Great and Small\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/The_King%27s_Arms_-_geograph.org.uk_-_1472821.jpg",
      "title": "James Allan / The King's Arms",
      "caption": "The King's Arms An Askrigg hotel inside which faded photographs illustrate its claim to television fame, when it was frequently used as the 'local' for characters in the James Herriot based series 'All Creatures Great and Small'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Hardraw_Force_-_geograph.org.uk_-_1082550.jpg",
      "title": "John Darch / Hardraw Force",
      "caption": "Hardraw Force Looking down from the top. You can gain access to the secluded waterfall through the 13th century Green Dragon Inn. The waterfall is notable as England's highest single drop waterfall, falling some 100ft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Castle_Bolton._-_geograph.org.uk_-_161378.jpg",
      "title": "Steve Partridge / Castle Bolton.",
      "caption": "Castle Bolton. As viewed from Bolton Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Bolton_Castle%2C_at_Castle_Bolton_-_geograph.org.uk_-_1390969.jpg",
      "title": "wfmillar / Bolton Castle, at Castle Bolton",
      "caption": "Bolton Castle, at Castle Bolton A medieval fortress situated in the heart of Wensleydale, inside the Yorkshire Dales National Park. Completed in 1399 and is well preserved."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Keld_-_geograph.org.uk_-_17908.jpg",
      "title": "Carl Bendelow / Keld",
      "caption": "The hamlet of Keld in upper Swaledale within the Yorkshire Dales National Park. A good place for walking as there is a good farmhouse tearoom"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Kisdon_Force_on_River_Swale_-_geograph.org.uk_-_613038.jpg",
      "title": "George Tod / Kisdon Force on River Swale",
      "caption": "Kisdon Force on River Swale. Bottom of a series of waterfalls that make up Kisdon Force on the River Swale. The lower part of the falls shown here is difficult to access unless the water level is quite low. The falls drop 10 metres (33 ft) over two cascades and are surrounded by Kisdon Force Woods with mixed broad-leaved woodland including ash, wych elm and rowan trees. The falls are located near the pretty village of Keld."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Gunnerside_Gill_-_geograph.org.uk_-_2682067.jpg/512px-Gunnerside_Gill_-_geograph.org.uk_-_2682067.jpg",
      "title": "Gunnerside Gill by Dennis Shevelan, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gunnerside Gill. This geological wonder includes dramatic scars, woodland, waterfalls and the pretty Gunnerside Beck. There are also several ruined mined buildings giving an insight into the area's industrial past."
    }
  ],
  "distance_km": 80.0,
  "description": "This long distance circular route takes you through areas of the Yorkshire Dales associated with the vet and author James Herriot. The walk begins in the pretty village of Aysgarth in Wensleydale. Here you can admire the wonderful Aysgarth Falls before following the River Ure to Askrigg. The village was used as the fictional Darrowby in the BBC TV series All Creatures Great and Small, based on the books by James Herriot. Just above Askrigg you can visit the lovely Mill Gill and Whitfield Force Waterfalls. After leaving Askrigg you continue to the village of Hardraw where you will find the splendid Hardraw Force Waterfall. The waterfall is England's highest single drop waterfall, falling some 100ft. The route then heads to the market town of Hawes before climbing Great Shunner Fell. It is the highest point in Wensleydale and commands wonderful views over Ribblesdale to the south west and Swaledale to the north, as well as views into Cumbria and County Durham. You descend the mountain to Thwaite and then on to the village of Keld where you will find the beautiful Kisdon Force, East Gill and Catrake Force waterfalls. From Keld you continue across Gunnerside Moor, passing the beautiful valley of Gunnerside Gill. It's a lovely area with a fascinating lead mining history. You can still see several ruined buildings from the period including the remains of Blakethwaite Smelt Mill and the old mine offices. The walk continues east to Healaugh, passing along Mill Gill. You then follow the River Swale into Reeth. You continue to Castle Bolton passing through open moorland with lots of pretty heather. Here you'll find the fascinating 14th-century Bolton Castle and the pretty village of Redmire. The final section takes you back to Aysgarth, passing through more lovely Yorkshire Dales countryside.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The trail passes right by the Green Dragon Inn, the gateway to the splendid Hardraw Falls. The pub has an interesting history dating right back to the 13th century. Hardraw is old English for Shepherds dwelling, and the land once formed part of land owned by the Cistercian Monks, who settled here before moving to Jervaulx Abbey in lower Wensleydale. They kept a Grange at Hardraw and possibly a small chantry chapel.The pub has a good selection of beers and a good menu if you wish to dine.  Pictured above, the exterior and interior of the Green Dragon in Hardraw near Hawes. The lovely old unspoilt and unaltered interior has a wealth of period features including a cosy real fire. There's also a few tables outside if the weather is decent."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For enthusiasts of the books head to Thirsk and visit The World of James Herriot. This award winning attraction is housed in a 1940s period house with veterinary science exhibits. It was the original practice of James Herriot, at 23 Kirkgate, known as \"Skeldale House\" in the books. The museum includes a recreation of the original living quarters and sets from the All Creatures Great and Small television series. This ran on the BBC during the 1970s and starred Christopher Timothy as the famous vet.  Pictured above, The World of James Herriot. Probably the most famous property in Thirsk, number 23 Kirkgate was the former veterinary practice of D.V Sinclair and J.A Wight, otherwise known as 'Farnon and Herriot'. This was the very centre of 'Herriot Country' until the death of Alf Wight in 1995. The house reopened as a museum in 1999 and is owned by Hambleton District Council. The veterinary practice continues in modern buildings on the industrial estate on York Road. On the right is one of the TV show's sets."
    }
  ],
  "video_url": "https://www.youtube.com/embed/IRKG3ywpUoc",
  "postcode": "DL8 3AB",
  "district": "Aysgarth",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Aysgarth Falls, Aysgarth, North Yorkshire, York and North Yorkshire, England, DL8 3AB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "mining history"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}