{
  "created_at": "2025-01-06T04:00:26.415772+00:00",
  "objectID": "dd6d03d36ac56a5bf738de8023a9e2cb",
  "ref": "bure-valley-path-walking-and-cycle-route",
  "title": "Bure Valley Path Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d4/A_busy_day_on_the_Bure_Valley_Railway_-_geograph.org.uk_-_1236489.jpg",
  "nearby": [
    {
      "description": "Wroxham",
      "objectID": "95e3ee4f695744d126f68779d652d920",
      "ref": "wroxham-walking-route"
    },
    {
      "description": "Blickling Hall",
      "objectID": "a593d691cedb661ce3eefc3bbc3798c0",
      "ref": "blickling-hall-walking-and-cycle-route"
    },
    {
      "description": "Aylsham",
      "objectID": "d43b9066b7a4736af0549e6f9dc99be5",
      "ref": "aylsham-walking-route"
    },
    {
      "description": "Marriot's Way",
      "objectID": "ac67b521462a354e31726a78bd96d2bc",
      "ref": "marriots-way-walking-and-cycle-route"
    },
    {
      "description": "Coltishall",
      "objectID": "2bfa9106a29293f2401bb322bf8c0b6a",
      "ref": "coltishall-walking-route"
    },
    {
      "description": "Marsham Heath",
      "objectID": "ab8aabc75d8893283f4ef0ceb344ae5c",
      "ref": "marsham-heath-walking-route"
    },
    {
      "description": "Hoveton",
      "objectID": "3cdbe0fdc8b5d722b72c294218fd0136",
      "ref": "hoveton-walking-route"
    },
    {
      "description": "Rebellion Way",
      "objectID": "ce673553ec15d7a7286596120f836ac9",
      "ref": "rebellion-way-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/dd6d03d36ac56a5bf738de8023a9e2cb.gpx",
  "_geoloc": {
    "lat": 52.7909376273,
    "lng": 1.255586416
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/A_busy_day_on_the_Bure_Valley_Railway_-_geograph.org.uk_-_1236489.jpg",
      "title": "Evelyn Simak / A busy day on the Bure Valley Railway",
      "caption": "A busy day on the Bure Valley Railway in the spring of 2009. A train of the Bure Valley Railway is heading east towards Buxton. It is passing walkers, who have turned out in large numbers in order to take part in a charity walk in aid of the Macmillan Cancer Trust"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/A_dilapidated_shed_-_geograph.org.uk_-_1059327.jpg",
      "title": "Evelyn Simak / A dilapidated shed",
      "caption": "A dilapidated shed Beside the Bure Valley Walk and Railway. The bridge seen in the background carries an unnamed country road which links Tunstead with St James, Coltishall. The Bure Valley Railway is Norfolk's longest fifteen inch gauge line. It runs between Aylsham and Wroxham, with stations in Brampton, Buxton and Coltishall. The railway operates services using either Steam or Diesel locomotives; ten buckets of coal are required for fuelling a steam locomotive on its 18 mile round trip."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/A_pleasant_walk_in_late_November_sunshine_-_geograph.org.uk_-_1059273.jpg/256px-A_pleasant_walk_in_late_November_sunshine_-_geograph.org.uk_-_1059273.jpg",
      "title": "Evelyn Simak / A pleasant walk in late November sunshine",
      "caption": "A pleasant walk in late November sunshine. Following the Bure Valley Walk along the Bure Valley Railway. The Bure Valley Railway is Norfolk's longest fifteen inch gauge line. It runs between Aylsham and Wroxham, with stations in Brampton, Buxton and Coltishall. The railway operates services using either Steam or Diesel locomotives; ten buckets of coal are required for fuelling a steam locomotive on its 18 mile round trip."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Approaching_Buxton_Station_-_geograph.org.uk_-_1236516.jpg",
      "title": "Evelyn Simak / Approaching Buxton Station",
      "caption": "Approaching Buxton Station. The railway runs on the trackbed of the East Norfolk Railway (ENR), opened in 1877 with the first section connecting Norwich and Cromer, and an extension from Wroxham to Aylsham in 1880. The line was taken over by the Great Eastern Railway in 1882 and amalgamated into the London & North Eastern Railway in 1923. Passenger service stopped in 1952 but freight service continued until the 1970s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Approaching_the_level_crossing_on_Belaugh_Green_Lane_-_geograph.org.uk_-_1059230.jpg/512px-Approaching_the_level_crossing_on_Belaugh_Green_Lane_-_geograph.org.uk_-_1059230.jpg",
      "title": "Evelyn Simak / Approaching the level crossing on Belaugh Green Lane",
      "caption": "Approaching the level crossing on Belaugh Green Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Bridge_1299_on_the_Bure_Valley_Railway_-_geograph.org.uk_-_1279091.jpg",
      "title": "Evelyn Simak / Bridge 1299 on the Bure Valley Railway",
      "caption": "Bridge 1299 on the Bure Valley Railway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Field_adjoining_the_Bure_Valley_Walk_and_Railway_-_geograph.org.uk_-_1059282.jpg",
      "title": "Evelyn Simak / Field adjoining the Bure Valley Walk and Railway",
      "caption": "Field adjoining the Bure Valley Walk and Railway. This view was taken in westerly direction across a field where the winter crop can be seen growing. The solitary trees seen in the distance grow alongside an unnamed country road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Houses_by_the_railway_line_-_geograph.org.uk_-_1244663.jpg",
      "title": "Evelyn Simak / Houses by the railway line",
      "caption": "Houses by the railway line"
    }
  ],
  "distance_km": 14.0,
  "description": "This walk and cycle track runs along Bure Valley Railway, and the River Bure from Aylsham to Wroxham. The route passes Brampton, Buxton and Coltishall with each having a station if you wish to rest your legs and take a trip on the railway. The Bure Valley Railway is Norfolk's longest fifteen inch gauge line. It opened on 10th July 1990, and the long distance footpath running parallel with it was opened a year later in 1991. It's a nice flat path which runs for about 9 miles. As such it makes for a leisurely stroll or an easy cycle ride. The long distance Rebellion Way passes along the route. The epic 232 mile circular ride visits some of the major highlights of Norfolk, using a series of quiet country lanes and traffic free paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Aylsham Station there's the Whistlestop Café where you can enjoy freshly baked cakes and sweet treats, hot and cold drinks, tea and fresh bean coffee, sandwiches, light snacks and ice creams. There's a more limited range of options at the other end of the route at Wroxham Station. Liberty in Wroxham is another good option. It's situated right next to the river and includes a lovely outdoor area where you can enjoy a view of the Wroxham broads. You can find them on Norwich Road with a postcode of NR12 8RX for your sat navs. In Coltishall there's an excellent riverside pub in the shape of The Rising Sun. You can enjoy refreshments in the lovely garden area with excellent views over the river. You can find the pub at 28 Wroxham Road with a postcode of NR12 7EA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The path makes for a nice dog walk and the railway is also very dog friendly. They are welcome in all public areas of the railway, including the Cafe. They specially put out dog bowls filled with fresh water too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Wroxham Walk uses part of the trail to explore the area around the town. There's also the Aylsham Walk which visits the historic Blickling Hall and the Marriot's Way rail trail. In Wroxham you can also pick up the Hoveton Walk which visits the nearby Hoveton Hall. The 19th century house includes some beautiful grounds with stunning gardens, a pretty lake and popular snowdrop walks in February. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/5_0odaBypCc",
  "district": "Broadland",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Aylsham, Buxton Road, Aylsham, Broadland, Norfolk, England, NR11 6JD, United Kingdom",
  "postcode": "NR11 6JD",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "path",
    "country lanes"
  ],
  "points_of_interest": [
    "historical sites",
    "countryside"
  ],
  "facilities": [
    "station",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}