{
  "objectID": "de21a224b740c34cb5fd06711008c9ca",
  "created_at": "2024-12-19T09:27:58.666298+00:00",
  "ref": "gillingham-walking-route",
  "title": "Gillingham Dorset Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e9/The_Square_in_Gillingham_looking_west_-_geograph.org.uk_-_1636243.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/de21a224b740c34cb5fd06711008c9ca.gpx",
  "_geoloc": {
    "lat": 51.0373318524,
    "lng": -2.2803800298
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/The_Square_in_Gillingham_looking_west_-_geograph.org.uk_-_1636243.jpg",
      "title": "Martin Hibbert / The Square in Gillingham looking west",
      "caption": "The Square in Gillingham looking west. This used to be the road to Wyke and Wincanton, until the bypass was built. Now a dead end."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Gillingham%2C_Town_Bridge_and_the_Methodist_church_-_geograph.org.uk_-_1434133.jpg",
      "title": "Chris Downer / Gillingham: Town Bridge and the Methodist church",
      "caption": "View across Town Bridge over Shreen Water at Gillingham, Dorset, looking east to the Methodist church. The plaque on the left states: \"Town Bridge Gillingham sketched by John Constable R.A. in 1829 The finished work is in the Tate Gallery\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/The_Old_Town_Lockup%2C_Gillingham_-_geograph.org.uk_-_1636329.jpg",
      "title": "Martin Hibbert / The Old Town Lockup, Gillingham",
      "caption": "The Old Town Lockup, Gillingham. Was apparently in use from 1750-1800. Now a shop selling crystals."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Footbridge_over_the_River_Stour_near_Chantry_Cottage_-_geograph.org.uk_-_1636226.jpg",
      "title": "Martin Hibbert / Footbridge over the River Stour near Chantry Cottage",
      "caption": "Footbridge over the River Stour near Chantry Cottage. The footpath goes from The Square to Chantry Cottage (which you can see in the background) and then on to the Waitrose Supermarket."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/New_Lake%2C_Stourton_-_geograph.org.uk_-_1145140.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "New Lake, Stourton. This is one of the medieval fishponds which were transformed into more formal lakes. This one, extended in the 19th Century, was remade yet again after its dam was destroyed as the result of a huge storm in 1917."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/The_White_Lion%2C_Bourton_-_geograph.org.uk_-_1145095.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The White Lion, Bourton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Looking_towards_a_Three_Counties_Meet_-_geograph.org.uk_-_1734856.jpg",
      "title": "Jonathan Billinger / Looking towards a Three Counties Meet",
      "caption": "Looking towards a Three Counties Meet. The actual meeting point is at the bottom of the upper Stour valley just beyond the tree in the centre. The woodland behind and to the left is in Dorset, to the right is in Somerset, and the foreground, and the camera position, is in Wiltshire. The whole is contained within Bullpits 9-hole golf course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/An_ancient_bus_in_an_ancient_village-_M460_JPA_in_Zeals%2C_Wiltshire%2C_3-4-2013_%288617201630%29.jpg/512px-An_ancient_bus_in_an_ancient_village-_M460_JPA_in_Zeals%2C_Wiltshire%2C_3-4-2013_%288617201630%29.jpg",
      "title": "Charlie from United Kingdom, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "An ancient bus in an ancient village, Wiltshire.  Part of New Road, Zeals, Wiltshire, with a bus on route 158 from Shaftesbury to Wincanton. The bus is a 1994 Mercedes-Benz 709D with an Alexander Sprint minibus body, registration mark M460 JPA, operated by South West Coaches. It was running in place of South West Coaches' usual bus on the route, which was a 2007 Optare Solo. The minibus was operated first by London Country from October 1994. It was later operated by Arriva Guildford and West Surrey, then Arriva in Leicestershire and then Sureline of Portland. South West Coaches bought it in October 2009."
    }
  ],
  "distance_km": 22.0,
  "description": "Gillingham is notable as the most northerly town in the county of Dorset. There's some lovely country walks along the River Stour and a significant National Trust property within walking distance of the town. Gillingham also plays a part in Thomas Hardy's novels as the fictional Leddenton. This circular walk from the town follows the Stour Valley Way north to visit one of the highlights of the area at Stourhead. There's some lovely Dorset, Somerset and Wiltshire countryside to enjoy as you pass the point where the three counties meet near Bourton. The walk starts in the town and heads west to pick up the Stour Valley Way. Follow the waymarked footpath north and it will take you to Milton on Stour, Silton and Bourton. The attractive village is notable as the most northerly in Dorset, located on the border with Somerset and Wiltshire. The route continues to Bonham before passing the pretty New Lake and turning east to Stourton and the Stourhead Estate. After exploring the estate you follow country lanes south to Zeals, Wolverton and Milton on Stour before returning to Gillingham.",
  "video_url": "https://www.youtube.com/embed/Z-BRXm6_F-Q",
  "postcode": "SP8 4NA",
  "district": "Gillingham",
  "county": "Dorset",
  "region": "South West",
  "country": "England"
}