{
  "created_at": "2025-01-06T02:57:08.403905+00:00",
  "objectID": "de90f7a60571e2e96b52b06e302b2701",
  "ref": "norsey-woods-walking-route",
  "title": "Norsey Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/42/Part_of_Norsey_Wood_-_geograph.org.uk_-_756213.jpg",
  "nearby": [
    {
      "description": "Hanningfield Reservoir",
      "objectID": "49593be2ab8f627a6dc977996a32d021",
      "ref": "hanningfield-reservoir-walking-route"
    },
    {
      "description": "Billericay",
      "objectID": "095aa13358bfca9288ad39339f84b145",
      "ref": "billericay-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/de90f7a60571e2e96b52b06e302b2701.gpx",
  "_geoloc": {
    "lat": 51.63408135,
    "lng": 0.441116094
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Part_of_Norsey_Wood_-_geograph.org.uk_-_756213.jpg",
      "title": "Robert Edwards / Part of Norsey Wood, via Wikimedia Commons",
      "caption": "This is a view from the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Norsey_Wood%2C_Billericay_-_geograph.org.uk_-_53925.jpg",
      "title": "John Winfield / Norsey Wood, Billericay, via Wikimedia Commons",
      "caption": "Norsey Wood, Billericay. This is desginated as ancient woodland and has Scheduled Ancient Monument status. Norsey Woods is owned and managed by Basildon Council and consists of 165 acres of mixed coppice woods. It is also an SSSI and local nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Norsey_Wood_during_the_winter_-_geograph.org.uk_-_681316.jpg",
      "title": "Robert Edwards / Norsey Wood during the winter, via Wikimedia Commons",
      "caption": "Woods during the winter. This view is seen as you leave the wood by car to join Outwood Common Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Norsey_Woods%2C_Billericay_-_geograph.org.uk_-_48295.jpg",
      "title": "Martin Tipper / Norsey Woods, Billericay, via Wikimedia Commons",
      "caption": "Burial mounds still exist in Norsey Woods evidencing its occupation in the Bronze and Iron Ages. Now, a recreation area managed by Basildon Council. A quite delightful place for a walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Norsey_Wood_during_the_winter_-_geograph.org.uk_-_681316.jpg",
      "title": "Robert Edwards / Norsey Wood during the winter",
      "caption": "A winter view of the woods in February. This view is seen as you leave the wood by car to join Outwood Common Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Coppiced_tree_at_path_junction_-_geograph.org.uk_-_2966660.jpg/512px-Coppiced_tree_at_path_junction_-_geograph.org.uk_-_2966660.jpg",
      "title": "Coppiced tree at path junction by Roger Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Coppiced tree at path junction in spring."
    }
  ],
  "distance_km": 3.0,
  "description": "These lovely woods near Billericay have some good waymarked footpaths to try. The site covers 165 acres with ancient coppiced sweet chestnut, oak and hornbeam woodland. It is also a local nature reserve with ponds, streams and lots of bluebells in the spring months. There's also a heather glade, bluebells in the spring and lots of wildflowers in the summer months. Look out for wildlife including dormouse, pipistrelle bat and newts around the ponds. The area is a well managed with a car park, visitor centre, toilets and picnic centre. To continue your walking in the Billericay area you can head about 2 miles to the north east and visit Hanningfield Reservoir. The southern end of the water has some good woodland trails with nice views over the water.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The woods are a lovely place for a dog walk and you will probably see several other owners on your outing."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the town you can visit the splendid Imperial Bird of Prey Academy. It's the leading Bird of Prey Centre in Essex, based at Barleylands Farm & Craft Village and one of the real highlights of the area. You can handle the birds and spend some time flying an owl. There's also a wonderful flying display, a reptile house and informative talks to enjoy. You can find it in Billericay at a postcode of CM11 2UD for your sat navs. The Billericay Walk starts in the lovely Park Meadows in the town centre. It visits the woods before heading to nearby Hanningfield Reservoir. Just to the north is the pretty village of Ingatestone where you can enjoy views of the River Wid and visit the 16th century Ingatestone Hall. For more walking ideas in the area see the Essex Walks page."
    }
  ],
  "county": "Essex",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}