{
  "created_at": "2025-01-06T04:24:35.426245+00:00",
  "objectID": "deaeed2d2c582aa7fdfd01f9dcce589a",
  "ref": "trent-valley-way-walking-route",
  "title": "Trent Valley Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Nottingham_War_Memorial_0369.JPG/512px-Nottingham_War_Memorial_0369.JPG",
  "nearby": [
    {
      "description": "Attenborough Nature Reserve",
      "objectID": "b7e367bf4456cdd77ed859556dcdd097",
      "ref": "attenborough-nature-reserve-walking-route"
    },
    {
      "description": "Gunthorpe",
      "objectID": "2d2420eddb6da4435de4ef52f9d8160b",
      "ref": "gunthorpe-walking-route"
    },
    {
      "description": "Shelford",
      "objectID": "725c142ad08b47ad2e360123cc5b9317",
      "ref": "shelford-walking-route"
    },
    {
      "description": "Radcliffe on Trent",
      "objectID": "f6d6ce0b05396da22dbe0dac68087256",
      "ref": "radcliffe-on-trent-walking-route"
    },
    {
      "description": "Fiskerton",
      "objectID": "abd60cc912e46e43844a884bfafd94f9",
      "ref": "fiskerton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/deaeed2d2c582aa7fdfd01f9dcce589a.gpx",
  "_geoloc": {
    "lat": 52.8925022051,
    "lng": -1.2549335771
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Nottingham_War_Memorial_0369.JPG/512px-Nottingham_War_Memorial_0369.JPG",
      "title": "By Photograph by Clem Rutter, Rochester, Kent. (www.clemrutter.net). (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Nottingham War Memorial. The City War Memorial, Nottingham is the main War Memorial for the City of Nottingham. It is located the Meadows which includes the Old Meadows, an area of predominantly pre-1919 privately owned terraced housing laid out in a traditional street pattern, and the New Meadows, an area of mainly social rented housing. The memorial was designed by T. Wallis Gordon, Nottingham City Engineer and Surveyor. The foundation stone was laid 1 August 1923. To the east is the River Trent, and to the west the Memorial Gardens with fountains and a statue of Queen Victoria."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/The_Trent_upstream_of_the_Clifton_Bridge_-_geograph.org.uk_-_753515.jpg",
      "title": "Tim Heaton [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Trent upstream of the Clifton Bridge. With Nottinghamshire's only Michelin-starred restaurant, the 'Sat Bains', amongst the trees on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Cromwell_Lock_and_Weir_-_geograph.org.uk_-_152301.jpg",
      "title": "Christine Hasman / Cromwell Lock and Weir",
      "caption": "Cromwell Lock and Weir. The weir marks the point at which the River Trent becomes tidal, and the huge Cromwell Lock enables river craft to continue upstream (from this viewpoint) towards Newark. The two narrowboats at the right of the picture are waiting for the lock to empty after the previous group of six cabin cruisers had passed through."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/The_Trent_Valley_Way_alongside_Trent_Fields_-_geograph.org.uk_-_866511.jpg",
      "title": "Tim Heaton / The Trent Valley Way alongside Trent Fields",
      "caption": "The trail alongside Trent Fields. The Way follows the south bank of the river alongside the large grassy flood plain of Trent Fields. This south side of the Trent will hopefully remain undeveloped, and an important foil to the development on the north bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Trent_Valley_Way_-_geograph.org.uk_-_956060.jpg",
      "title": "Tim Heaton / Trent Valley Way",
      "caption": "Following the west bank of the Trent towards Hoveringham. Toot Hill rises above the far bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Trent_Valley_Way_-_geograph.org.uk_-_1334820.jpg",
      "title": "Alan Murray-Rust / Trent Valley Way",
      "caption": "The Way runs from right to left. The track from which this view is taken is the farm access to the riverside meadows as well as to the right bank of Beeston Weir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Leaving_Shelford_on_the_Trent_Valley_Way_-_geograph.org.uk_-_1056162.jpg",
      "title": "Andy Jamieson / Leaving Shelford on the Trent Valley Way",
      "caption": "Leaving Shelford on the Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Trent_Valley_Way_along_%27The_Cliffs%27%2C_Radcliffe_on_Trent_-_geograph.org.uk_-_935533.jpg",
      "title": "Tim Heaton / Trent Valley Way along 'The Cliffs', Radcliffe on Trent",
      "caption": "'The Cliffs', Radcliffe on Trent"
    }
  ],
  "distance_km": 124.0,
  "description": "Follow the River Trent from Long Eaton in Derbyshire to West Stockwith in Nottinghamshire on this lovely waterside walk. The walk passes through Nottingham, Newark on Trent and a series of pretty riverside villages. On the path you will pass the Attenborough Nature Reserve and the Beeston Canal. There's also the 12th century ruins at Newark Castle, several pretty locks, watermills, old industrial buildings and historic churches.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "You could stop off in Collingham at The Royal Oak for some refreshments. The friendly Community Pub has a good menu and drinks selection. There's also a large garden which has been extended and landscaped with trees, plants, patio areas and lawn. It's a lovely spot to relax in on warmer days. You can find them on Station Road with a postcode of NG23 7RA for your sat navs. The walk passes through the delightful village of Gunthorpe. Here you'll find a pretty lock and a riverside hotel in the shape of the Unicorn hotel. Located on the banks of the river you can sit outside and enjoy fine views across the water with your meal. They serve very good food including particularly delicious rotisserie chicken. You can find them at postcode NG14 7FB for your sat navs. They are also dog friendly if you have your canine friend with you. In the neighbouring village of Shelford there's also the Earl of Chesterfield which is another fine village pub in the area. At Fiskerton there's The Bromley Arms. The pub is named after Lord Bromley, of East Stoke Hall on the other side of the river, who liked to hunt on this side. They serve fine food which you can enjoy on the lovely riverside terrace with bistro furniture and patio heaters. There's fine views over the river from here. You can find them at postcode NG25 0UL for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Newark you will pass the noteworthy Cromwell Lock. The lock includes one of the largest weirs on the Trent which marks the tidal limit of the river. Near the lock you'll also find a memorial garden with a block of Scottish granite bearing the names of ten members of the 131 Parachute Squadron, Royal Engineers. They were killed after a power failure caused the navigation lights on the weir to go out and their boat went over the crest. In Radcliffe there's the the Radcliffe on Trent Cliff Walk which takes you along an elevated tree lined path above the river. The area also includes the Rockley Memorial Park where you'll find lovely gardens in a peaceful setting. For more walking ideas in the area see the Nottinghamshire Walks page."
    }
  ],
  "postcode": "NG10 2GN",
  "district": "Long Eaton",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}