{
  "created_at": "2025-01-06T00:54:35.206819+00:00",
  "objectID": "df3dc9033248db991780140c286d884b",
  "ref": "high-willhays-walking-route",
  "title": "High Willhays Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cb/High_Willhays_-_geograph.org.uk_-_1575605.jpg",
  "nearby": [
    {
      "description": "Yes Tor",
      "objectID": "f3c1de54ee45a5150778c51094af7d3b",
      "ref": "yes-tor-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Granite Way",
      "objectID": "ec434790898a91f58b81016e2d809896",
      "ref": "granite-way-walking-and-cycle-route"
    },
    {
      "description": "Two Castles Trail",
      "objectID": "e9fce9036b34f4ce40ef5a801c3c9190",
      "ref": "two-castles-trail-walking-route"
    },
    {
      "description": "Meldon Reservoir",
      "objectID": "1d5341b9b1c74e75ed47c0541598cf9d",
      "ref": "meldon-reservoir-walking-route"
    },
    {
      "description": "Sticklepath",
      "objectID": "00eb16ae55dfd48a44fd7538496a24d7",
      "ref": "sticklepath-walking-route"
    },
    {
      "description": "Okehampton",
      "objectID": "c0c0ef073884cd4db4160c1fc42237bf",
      "ref": "okehampton-walking-route"
    },
    {
      "description": "Black A Tor Copse",
      "objectID": "21815e328cb5ca0967c9efeb8c13ecb0",
      "ref": "black-a-tor-copse-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/df3dc9033248db991780140c286d884b.gpx",
  "_geoloc": {
    "lat": 50.7070881877,
    "lng": -4.0372759314
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/High_Willhays_-_geograph.org.uk_-_1575605.jpg",
      "title": "Guy Wareham / High Willhays",
      "caption": "A pool very close to the summit"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/High_Willhays_-_geograph.org.uk_-_683652.jpg",
      "title": "Derek Harper / High Willhays",
      "caption": "The cairn that marks the highest point in England south of Herefordshire. Right of centre is Yes Tor in SX5890."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/The_Western_slopes_of_High_Willhays_-_geograph.org.uk_-_1326796.jpg",
      "title": "Chris Carlson / The Western slopes of High Willhays",
      "caption": "The Western slopes of High Willhays. The highest point of Dartmoor, standing at 621 metres above sea level. Photo taken looking down to the West Okement valley, Meldon and the Devon lowlands."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/The_ridge%2C_north_of_High_Willhays_-_geograph.org.uk_-_1423962.jpg",
      "title": "Roger Cornfoot / The ridge, north of High Willhays",
      "caption": "The ridge, north of High Willhays"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/On_the_way_up_High_Willhays_from_Meldon_-_geograph.org.uk_-_447294.jpg",
      "title": "Jon Coupland / On the way up High Willhays from Meldon",
      "caption": "On the way up High Willhays from Meldon. The red poles mark the danger areas when the army are firing on the north moors. These are marked on the Explorer map."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/West_Okement_River_-_geograph.org.uk_-_47707.jpg",
      "title": "Richard Webb / West Okement River",
      "caption": "West Okement River. Below High Willhays and Kitty Tor, deep in the moor. looking north."
    }
  ],
  "distance_km": 9.0,
  "description": "Climb to the highest point on Dartmoor on this splendid circular walk in the Dartmoor National Park. The walk starts at the car park at Meldon Reservoir and takes you to the 621 metres (2,039 ft) summit via Longstone Hill and Black Tor. You start with a pleasant waterside section along the shores of the pretty Meldon Reservoir. It has a spectacular dam with wonderful views over the West Okement valley. You then leave the reservoir climbing Longstone Hill towards Black Tor with its strking Logan Stone and great views over Walkhampton Common. The route then heads to the summit of High Willhays where there are fabulous views over Dartmoor and Devon. From the summit you descend to the impressive Yes Tor. It is the second highest peak on Dartmoor just two metres below High Willlhays. The final section descends over Okehampton Common to the reservoir and the finish point. It's a challenging walk but on generally good paths and wonderful views as the reward. Also look out for Dartmoor Ponies as you go. If you'd like to continue your walk you could follow the footpath around Meldon Reservoir or try the climb to Yes Tor which starts from the same car park. There's also the Dartmoor Way and Granite Way which also run past the reservoir. You could start the walk from the nearby town of Okehampton by following the Granite Way to the reservoir.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Highwayman Inn after your exercise for a great pub experience. The pub is considered England's most unusual inn with a marvellous interior and an interesting mix of ancient artifacts. It dates from the 11th-century and is also said to be haunted! The wonderful inn is located to the west of Meldon Reservoir at Sourton, postcode EX20 4HN. You could also head into Okehampton and visit The Fountain Inn. The inn has a lovely terrace and riverside garden area where you can relax on warmer days. They serve a fine Sunday carvery with a cosy interior and two real fires. You can find them on Fore Street with a postcode of EX20 1AP. The town itself is also well worth exploring with highlights including the 15th century Chapel of St James and the medieval ruins of Okehampton Castle which is now run as a tourist attraction by English Heritage."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east there's a fine climb to another prominent Dartmoor Peak on the circular Sticklepath and Cosdon Hill Walk. The riverside village is a lovely place for a stroll with paths along the River Taw to try. At Cosdon Hill there's a stone circle and more excellent views to the coast. The Black A Tor Copse Walk also starts from the reservoir car park. It will take you south to visit the noteworthy Black A Tor Copse National Nature Reserve. The wildlife rich reserve is a rare example of high altitude oak woodland and includes some pleasant trails along the West Okemont River. For more walking ideas in the area see the Dartmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/OSxpXclbsFc",
  "postcode": "EX20 4LU",
  "district": "West Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Granite Way, Meldon, Okehampton Hamlets, West Devon, Devon, England, EX20 4LU, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "waterland",
    "upland"
  ],
  "points_of_interest": [
    "viewpoints",
    "common"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}