{
  "created_at": "2025-01-06T08:23:00.393163+00:00",
  "objectID": "df67ad62aa20dd027c04d63e4ad434f8",
  "ref": "west-wycombe-park-walking-route",
  "title": "West Wycombe Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/West_Wycombe_House_Park_%2C_West_Wycombe_-_geograph.org.uk_-_193261.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/df67ad62aa20dd027c04d63e4ad434f8.gpx",
  "_geoloc": {
    "lat": 51.6440812422,
    "lng": -0.8046985915
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/West_Wycombe_House_Park_%2C_West_Wycombe_-_geograph.org.uk_-_193261.jpg",
      "title": "Jurek and Trish Sienkiewicz / West Wycombe House Park, West Wycombe",
      "caption": "West Wycombe House Park and West Wycombe Hill, with the Mausoleum and church within a prehistoric camp on its summit, as seen from the parkland of the National Trust owned House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/West_Wycombe_-_geograph.org.uk_-_4918.jpg",
      "title": "Brendan and Ruth McCartney / West Wycombe",
      "caption": "The Church Loft, a 15th-century building on the A40. On the wall under the archway a plaque reads: \"Church Loft Clock c1670. This clock was renovated in 2003 in memory of Peter Harris, who wound the clock daily for 50 years, 1950-2000\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/River_Wye_in_West_Wycombe_Park-geograph-3568677.jpg/512px-River_Wye_in_West_Wycombe_Park-geograph-3568677.jpg",
      "title": "Des Blenkinsopp / River Wye in West Wycombe Park",
      "caption": "River Wye in the park. Leaving the lake over this wide weir, the river is still an ornamental feature of the park right up to the far boundary."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/View_towards_High_Wycombe_from_West_Wycombe_hill_-_geograph.org.uk_-_591618.jpg",
      "title": "Peter Jemmett / View towards High Wycombe from West Wycombe hill",
      "caption": "View towards High Wycombe from West Wycombe hill. The walkers in the foreground give a good impression of the steepness and height of the hill. High Wycombe nestles in the valley in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/West_Wycombe%2C_The_Swan_Inn_-_geograph.org.uk_-_888606.jpg",
      "title": "Nigel Cox / West Wycombe: The Swan Inn",
      "caption": "The Swan Inn in the village. With the exception of the Village Hall, every building on the south side of the High Street in West Wycombe is listed. This is The Swan Inn with a later extension to the rear. Also in the photograph is The Swan Inn bus stop. The weekday hourly bus service to Stokenchurch, Chinnor and Thame stops here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/The_Music_Temple_and_lake_in_West_Wycombe_Park_%28geograph_5810445%29.jpg/512px-The_Music_Temple_and_lake_in_West_Wycombe_Park_%28geograph_5810445%29.jpg",
      "title": "Steve Daniels / The Music Temple and lake in West Wycombe Park",
      "caption": "The Music Temple and lake in the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/The_Temple_of_The_Winds-geograph-3561816.jpg/512px-The_Temple_of_The_Winds-geograph-3561816.jpg",
      "title": "Des Blenkinsopp / The Temple of The Winds",
      "caption": "The Temple of The Winds. One of several classical style ornamental buildings in the park. Said to have been based on the Tower of The Winds in Athens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/St_Lawrence_Church_West_Wycombe_-_geograph.org.uk_-_412225.jpg/256px-St_Lawrence_Church_West_Wycombe_-_geograph.org.uk_-_412225.jpg",
      "title": "Christina Burford / St Lawrence Church West Wycombe",
      "caption": "St Lawrence Church"
    }
  ],
  "distance_km": 8.0,
  "description": "Explore the beautiful estate surrounding West Wycombe House on this walk in the Chilterns AONB. The Palladian house has 45 acres of landscaped gardens with a lovely large lake, views of the River Wyre, woodland paths and sweeping lawns to enjoy. Look out for attractive temples and follies such as the Temple of the Four Winds. After strolling round the grounds you can climb to West Wycombe Hill for wonderful views over the Chilterns countryside. At the top of the hill you will find the 18th century Mausoleum. It is also a great spot to look out for the Red Kite. After descending the hill you can then continue your walk through miles of surrounding woodland and head towards nearby Bradenham. The village of West Wycombe also has many interesting features such as the Grade I listed church and the popular Hellfire Caves. This extraordinary network of man-made chalk and flint caverns is well worth a visit. If you'd like to extend your walk then you can head to the nearby Hughenden Park with its gardens, parkland, woodland and and riverside paths. Our longer circular walk from nearby High Wycombe takes in Hughenden, Naphill Common and Downley Common. There's lots of nice woodland trails and interesting flora and fauna to see on the commons.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into the village and you can enjoy some post walk refreshment at The George and Dragon Hotel. The 18th century inn serves high quality food and have a nice outdoor seating area in the back. You can find them on the High Street at postcode HP14 3AB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "No dogs are allowed inside the National Trust park grounds but there are woodland trails on public footpaths to the north of the village in Hearnton Wood. There's also miles of dog friendly trails just to the north east on Downley Common and Naphill Common. The George and Dragon Hotel is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Bledlow Ridge Walk can be picked up to the north west of the town. It's an attractive settlement which includes a fine old pub and the Yoesden Wood Nature Reserve where there's some interesting flora and fauna to observe. For more walking ideas in the area see the Buckinghamshire Walks, Chilterns Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UnTLU8ULzRk",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Kitty's Walk, West Wycombe, Buckinghamshire, England, HP14 3AE, United Kingdom",
  "postcode": "HP14 3AE",
  "district": "West Wycombe",
  "state": "England"
}