{
  "created_at": "2025-01-06T00:09:39.717370+00:00",
  "objectID": "df85ce2db682514bd7e1d0dd8d7119e7",
  "ref": "caversham-walking-route",
  "title": "Caversham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Wildfowl_at_Caversham_Bridge_-_geograph.org.uk_-_508636.jpg",
  "nearby": [
    {
      "description": "Twyford",
      "objectID": "d1c66f6f43a39507d445658215340198",
      "ref": "twyford-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Caversham Court Gardens",
      "objectID": "25c01a6b4cd7f8191e29396274fcd084",
      "ref": "caversham-court-gardens-walking-route"
    },
    {
      "description": "Clayfield Copse",
      "objectID": "4d4db6e5f21ce38c35096dd833459ed2",
      "ref": "clayfield-copse-walking-route"
    },
    {
      "description": "Burghfield Wokefield Common",
      "objectID": "4b555f81aaa5a1cac1f094f25835b2ce",
      "ref": "burghfield-wokefield-common-walking-route"
    },
    {
      "description": "Sonning to Shiplake Walk",
      "objectID": "138876dc72aacd49a2a91fcf1c849268",
      "ref": "sonning-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/d/df85ce2db682514bd7e1d0dd8d7119e7.gpx",
  "_geoloc": {
    "lat": 51.4681338549,
    "lng": -0.9809445205
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Wildfowl_at_Caversham_Bridge_-_geograph.org.uk_-_508636.jpg",
      "title": "Andrew Smith / Wildfowl at Caversham Bridge",
      "caption": "Wildfowl at Caversham Bridge. Showing the southern half of the bridge which consists of two symmetrical arches. The bridge is situated on the reach above Caversham Lock, carrying the A4155 road across the river and also providing pedestrian access to the adjacent mid-river Pipers Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Caversham_Lock%2C_River_Thames_-_geograph.org.uk_-_482220.jpg",
      "title": "Dr Neil Clifton / Caversham Lock, River Thames",
      "caption": "Caversham Lock, River Thames. This lock is a significant landmark on the river and located just below Reading Bridge. Both the lock and main weir are connected to De Bohun Island (colloquially known as Lock Island). The Thames Navigation Commissioners built the original lock in 1778. Additional sluices north of View Island and Heron Island form the whole weir complex. A footbridge passes over all three islands to connect Lower Caversham to Reading via a route other than George Street and Reading Bridge. The lock is about 400 metres east of Reading railway station and well connected to Kings Meadow, the largest park of central Reading."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/King%27s_Meadow%2C_Reading.jpg/512px-King%27s_Meadow%2C_Reading.jpg",
      "title": "Ben Sutherland from Forest Hill, London, European Union, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "King's Meadow, Reading. This riverside park stretches from the Coal Woodland (so-called because it used to be the site of a coal heap) to King's Meadow Road near Reading Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/The_River_Thames%2C_east_of_Reading_-_geograph.org.uk_-_112771.jpg",
      "title": "Andrew Smith / The River Thames, east of Reading",
      "caption": "The River Thames, east of Reading. Taken from the southeast of the gridsquare, looking southwest. The gas holders are at the confluence with the Kennet in the neighbouring square at SU732737. The land from which the photo was taken is part of Thames Valley Business Park, but is not built on as it is the flood-plain. Months of below-average rainfall means that river levels are low at present for the time of year. A boathouse is also visible on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Caversham_Court_-_the_House_Footprint.jpg",
      "title": "Rose and Trev Clough / Caversham Court - the House Footprint",
      "caption": "Caversham Court. The lawns outlined with brick and stone represent the location of different rooms in the demolished house. The park is listed as Grade II in the National Register of Historic Parks and Gardens. It surrounds the historic Caverhsma Court house and is one of the highlights of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/The_River_Thames%2C_Sonning_-_geograph.org.uk_-_409928.jpg",
      "title": "Andrew Smith / The River Thames, Sonning",
      "caption": "The River Thames, Sonning. Placid waters on this stretch between the lock and the bridge. It freezes during prolonged frosty weather, which doesn't happen these days."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Bull_Inn%2C_Sonning%2C_Berkshire_Geograph-1976465-by-SJB.jpg",
      "title": "SJB, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bull Inn, Sonning, Berkshire. A listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Former_gravel_pit%2C_Twyford_-_geograph.org.uk_-_604989.jpg",
      "title": "Andrew Smith / Former gravel pit, Twyford",
      "caption": "One of the many flooded pits strung along this part of the Loddon valley, this one is a Berks, Bucks and Oxon Wildlife Trust nature reserve. Wildfowl benefit from is sheltered wooded shoreline."
    }
  ],
  "distance_km": 22.0,
  "description": "This riverside village in Reading is considered one of the finest places to live in the country. There's lovely river walks and a particularly fine public park to explore on foot. This walk takes you along the river to neighbouring Sonning before visiting Twyford, Charvil Country Park and the Loddon Nature reserves. The walk starts at the delightful Caversham Court Gardens on the northern side of the river near Caversham Bridge. There's some beautiful gardens here with lakes, the foundations of a medieval house, a herb garden and a tree-lined park open to the public at no charge. After exploring the gardens you head west to cross Caversham Bridge where you can pick up the Thames Path National Trail and follow it east to King's Meadow and Sonning. At St Patrick's Bridge you leave the river to follow Milestone Avenue south to Charvil. Continue south east and you will come to the nature reserves to the west of Twyford village. There's some nice footpaths here around a number of pretty pools with lots of wildlife to look out for on the water. After exploring the reserves you retrace your steps to the river and follow it back into Caversham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At Caversham Court you'll find the delightful Tea Kiosk. They have some delicious home made cakes and an outdoor seating area with views over the gardens and the river. The friendly little cafe also provides support for local charities so it's an ideal place to stop off for a rest and a bite to eat."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your exercise pick up the Reading Canal Walk which will take you along the towpath of the Kennet and Avon Canal. You can also join with the Reading Circular River Walk as well. Just to the north of the village there's a pretty little nature reserve to visit in the shape of Clayfield Copse. The site includes woodland paths, a sculpture trail and a wildflower meadow. It's a nice place for a peaceful, easy stroll in the town. For more walking ideas in the area see the Berkshire Walks page."
    }
  ],
  "district": "Reading",
  "county": "Reading",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}