{
  "created_at": "2025-01-06T02:59:11.375301+00:00",
  "objectID": "502a76ff4f460eb1a7727886da8cc464",
  "ref": "mardon-down-walking-route",
  "title": "Mardon Down Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Mardon_Down_-_geograph.org.uk_-_1292629.jpg",
  "nearby": [
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Dartmoor Ramble",
      "objectID": "08234855982cc27e554434320a0b05b0",
      "ref": "dartmoor-ramble-walking-route"
    },
    {
      "description": "Dunsford Daffodil Circular Walk",
      "objectID": "4792bf4403f6d505df813f245561af41",
      "ref": "dunsford-daffodil-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/502a76ff4f460eb1a7727886da8cc464.gpx",
  "_geoloc": {
    "lat": 50.6613095286,
    "lng": -3.7643698569
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Mardon_Down_-_geograph.org.uk_-_1292629.jpg",
      "title": "Derek Harper / Mardon Down, via Wikimedia Commons",
      "caption": "The southern slopes of Mardon Down, with bracken, gorse and scattered trees, give a good view over Doccombe (in SX7786) in the valley below, with the B3212 climbing towards Cossick Cross."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Wall_on_Mardon_Down_-_geograph.org.uk_-_1292447.jpg",
      "title": "Derek Harper / Wall on Mardon Down, via Wikimedia Commons",
      "caption": "Wall on Mardon Down. A fine bit of drystone granite walling at the southeast corner of the eastern lobe of the down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Mardon_Down_-_geograph.org.uk_-_183387.jpg",
      "title": "Derek Harper / Mardon Down",
      "caption": "The lane down to Clifford Bridge runs between Mardon Down on the right and the woods dropping into the Teign valley on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/View_from_Mardon_Down_-_geograph.org.uk_-_1292991.jpg",
      "title": "Derek Harper / View from Mardon Down",
      "caption": "View from the Down. Taken from the road across the southern edge of Mardon Down. On the left is an unnamed wood above Yarningale (shown incorrectly as \"Yarningdale\" on the 1:25000 map). Fields descend a bowl-shaped valley towards Moretonhampstead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/North_Kingwell_from_Mardon_Down_-_geograph.org.uk_-_1292970.jpg",
      "title": "Derek Harper / North Kingwell from Mardon Down",
      "caption": "North Kingwell from the Down. The road across the southern edge of the Down offers lovely views across the Kingwell valley and beyond. The nearer farm, part hidden by the hillside, is North Kingwell; South Kingwell, on the left, is largely in SX7786. On top of Hingston Down, above the farm, are Hingston Rocks, indiscernible at this distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Doccombe_from_Mardon_Down_-_geograph.org.uk_-_1292660.jpg",
      "title": "Derek Harper / Doccombe from Mardon Down",
      "caption": "Doccombe view. Some of the roofs of the small village, tucked into a combe. The B3212 winds beyond it past Cossick Farm towards a little col at Cossick Cross, off to the right. On the horizon and trees and moorland at Pepperdon Down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Dandelions_near_Doccombe_Cross_-_geograph.org.uk_-_1292838.jpg",
      "title": "Derek Harper / Dandelions near Doccombe Cross",
      "caption": "Dandelions near Doccombe Cross. The lane from Doccombe Cross to Mardon Down offers great views. Here, across a dandelion-filled meadow, is the countryside east of Doccombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Field_near_Long_Park_-_geograph.org.uk_-_1467681.jpg",
      "title": "Derek Harper / Field near Long Park",
      "caption": "Field near Long Park. A view through the gate. The field slopes down into the valley of the Wadley Brook. Beyond is Moretonhampstead, with Mardon Down on the skyline."
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to Mardon Down on Dartmoor and enjoy wonderful far reaching views over the surrounding area. The hill is also home to a fascinating set of ancient stone circles and covered with lots of interesting plants and flowers. It's a really pretty spot and well worth the challenging climb. The walk starts in the village of Moretonhmapstead about 1.5 miles south west of the hill. You then follow footpaths towards Yarningdale before crossing the down. You'll pass a cairn circle before coming to Mardon Down stone circle which is the biggest on Dartmoor. The walk climbs to well over 1000 ft so it is a fairly challenging ascent. You are rewarded with wonderful views towards the Devon coast, Hay Tor, Hound Tor and Exmoor. It's great for wildlife too with birds such as stonechats, skylarks and cuckoos to look out for. You might also see Dartmoor ponies and rabbits as you make your way across the hill. You can continue across the down towards Cod Wood, Dunsford Nature Reserve and Meadhaydown Nature Reserve. These are all just a mile or so north east of Mardon Down. Both the Dartmoor Way and the Dartmoor Ramble pass Moretonhampstead so it is easy to extend your walking in the area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Dartmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/DHQFq7Y_wKI",
  "postcode": "TQ13 8LT",
  "district": "Moretonhampstead",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}