{
  "created_at": "2025-01-06T00:38:57.424128+00:00",
  "objectID": "506af976f76ebdd63d347bcfc27ec97d",
  "ref": "castle-combe-walking-route",
  "title": "Castle Combe Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/96/Castle_Combe_-_geograph.org.uk_-_1629155.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/506af976f76ebdd63d347bcfc27ec97d.gpx",
  "_geoloc": {
    "lat": 51.4935471637,
    "lng": -2.2291214536
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Castle_Combe_-_geograph.org.uk_-_1629155.jpg",
      "title": "Nigel Mykura / Castle Combe",
      "caption": "One of the streets in the centre of the village framed by one side of the shelter protecting the market cross."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Castle_Combe_-_geograph.org.uk_-_222249.jpg",
      "title": "Neil Kennedy / Castle Combe",
      "caption": "This setting is well known for being used in the first film of \"Dr. Doolittle.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Castle_Combe_-_geograph.org.uk_-_42725.jpg",
      "title": "Pam Brophy / Castle Combe",
      "caption": "The main street in the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Entering_Castle_Combe_-_geograph.org.uk_-_489069.jpg",
      "title": "Graham Horn / Entering Castle Combe",
      "caption": "Entering Castle Combe. The Macmillan Way footpath enters the village from the north. The picturesque village square and main street is hidden from view until the very last minute. One enters through this archway with the Castle Inn and Market Cross immediately beyond to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/The_Market_Cross_%2C_Castle_Combe_-_geograph.org.uk_-_42802.jpg/512px-The_Market_Cross_%2C_Castle_Combe_-_geograph.org.uk_-_42802.jpg",
      "title": "Pam Brophy / The Market Cross : Castle Combe",
      "caption": "The Market Cross. This historic monument is in the centre of the village. It is believed to date from the 14th century when the privilege to hold a weekly market was first granted. Just below this there is also a structure sometimes referred to as the 'buttercross', which was in fact for tethering and mounting horses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Trimmels%2C_Castle_Combe-geograph-3647997-by-Rob-Farrow.jpg/512px-Trimmels%2C_Castle_Combe-geograph-3647997-by-Rob-Farrow.jpg",
      "title": "Rob Farrow / Castle Combe - Trimmels",
      "caption": "This house called Trimmels is situated on the eastern side of The Street in Castle Combe almost opposite the Butter Cross, as the road starts to climb gently out of the village. It dates from the C17th & C18th."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Manor_House%2C_Castle_Combe_-_geograph.org.uk_-_42848.jpg",
      "title": "Pam Brophy / Manor House: Castle Combe",
      "caption": "Manor House. This grand manor house is now a hotel and is situated in the eastern half of the square. This picture was taken on the edge of the adjacent square looking north west into this square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Main_Street_in_Castle_Combe_-_geograph.org.uk_-_42634.jpg",
      "title": "Pam Brophy / Main Street in Castle Combe",
      "caption": "This is the south end of the village, looking towards the centre. Originally Castle Combe was a British hill fort which became occupied by the Romans due to its proximity to The Fosse Way. Then came the Normans, who built the fort up into a Castle."
    }
  ],
  "distance_km": 2.0,
  "description": "Enjoy a short circular walk around this delightful Cotswolds village. It's like stepping back in time with its pretty little thatched cottages, a beautiful old church with a medieval clock and traditional country pubs. The lovely Bybrook River also runs through the village with little footbridges to cross. All in all Castle Combe generally ranks very high in any 'prettiest English village' polls! This short circular walk starts in the centre of the village, near the Castle Inn and church. You then pass through the village and along the river before returning to the car park through woodland. The Macmillan Way long distance walk runs through the village so you can easily pick this up to extend your walk into the surrounding Cotswolds countryside. You could follow it further south along the Bybrook to Slaughterford or west along the Broadmead Brook. Heading north will take you towards the Badminton House and Estate where there are two large ponds, several deer, attractive parkland and the 17th century Badminton House. The Palladian Way also runs through the village. The long distance trail runs from Buckingham to Bath through the beautiful countryside of Buckinghamshire, Gloucestershire, Oxfordshire and Wiltshire. The trail is named after Andre Palladio's Italian architecture and visits several pretty villages and includes waterside sections along the Oxford Canal and the River Windrush. You could follow the trail north east and visit nearby Hullavington. Heading south west will take you to Colerne where there's nearly 90 historic listed buildings including a 13th century church and a noteworthy 17th century stone pub.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The village has some wonderful old pubs to visit after your walk. The Castle Inn dates from the 12th century with many features of the original construction still in place today. There's an attractive bar, a conservatory or a courtyard for warmer days. You can find the pub on West Street with a postcode of SN14 7HN for your sat navs. If you prefer a cafe then you could head to the charming Old Stables. This Rustic, old coverted barn serves delicious cakes and sandwiches. You can find them at The Estate Yard at a postcode of SN14 7HU."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area around the village is great for dog walking with plenty of countryside trails and woodland paths to the south and west. The Castle Inn pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Take time to explore the wonderful St Andrews Church in the village. The historic building dates all the way back to the 13th century. There's a splendid monument of a Norman Knight and beautiful fan vaulting reminiscent of Bath Abbey. There's also the faceless clock which is thought to be one of the oldest working clocks in the country. Head south and you could visit the neighbouring village of Biddestone. The settlement is very quaint with a village pond, attractive cottages and views of the Bybrook River which meanders through the area. Near here is the village of Box. The village includes more nice trails along the By Brook and the famous Box railway tunnel created by Isambard Kingdom Brunel in the early 19th century. For more walking ideas in the area see the Cotswolds Walks and Wiltshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cjRYLpAuQFI",
  "district": "Castle Combe",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}