{
  "created_at": "2025-01-06T01:53:21.327136+00:00",
  "objectID": "507405a48a05a2c658a833abfb2d7f1e",
  "ref": "ranworth-broad-walking-route",
  "title": "Ranworth Broad Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Broads_Wildlife_Centre%2C_Ranworth_Broad_-_geograph.org.uk_-_155553.jpg",
  "nearby": [
    {
      "description": "Coltishall",
      "objectID": "2bfa9106a29293f2401bb322bf8c0b6a",
      "ref": "coltishall-walking-route"
    },
    {
      "description": "Wroxham",
      "objectID": "95e3ee4f695744d126f68779d652d920",
      "ref": "wroxham-walking-route"
    },
    {
      "description": "Acle and the River Bure",
      "objectID": "46ebb284b2a1f53811a28182f1b7dd1b",
      "ref": "acle-and-the-river-bure-walking-route"
    },
    {
      "description": "Bure Valley Path",
      "objectID": "dd6d03d36ac56a5bf738de8023a9e2cb",
      "ref": "bure-valley-path-walking-and-cycle-route"
    },
    {
      "description": "Weavers Way Circular Walk",
      "objectID": "1684a7c8629d1f1c0dd5f1e8a545bab7",
      "ref": "weavers-way-circular-walk-walking-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Barton Broad Boardwalk",
      "objectID": "efd5d2467f9223754ba6b6dd256ba702",
      "ref": "barton-broad-boardwalk-walking-route"
    },
    {
      "description": "Hoveton",
      "objectID": "3cdbe0fdc8b5d722b72c294218fd0136",
      "ref": "hoveton-walking-route"
    },
    {
      "description": "Salhouse Broad",
      "objectID": "c93e211ed39909a07c3fe9ca41772aae",
      "ref": "salhouse-broad-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/507405a48a05a2c658a833abfb2d7f1e.gpx",
  "_geoloc": {
    "lat": 52.6777654637,
    "lng": 1.4887775233
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Broads_Wildlife_Centre%2C_Ranworth_Broad_-_geograph.org.uk_-_155553.jpg",
      "title": "Richard Slessor / Broads Wildlife Centre, Ranworth Broad",
      "caption": "Broads Wildlife Centre, Ranworth Broad. From here, good numbers of duck – wigeon, gadwall, teal, shoveler and pochard – can be watched in the winter. Great crested grebes are present all year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Thatched_Cottages%2C_Ranworth_-_geograph.org.uk_-_155560.jpg",
      "title": "Richard Slessor / Thatched Cottages, Ranworth",
      "caption": "Thatched Cottages, Ranworth village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Malthouse_Broad_-_geograph.org.uk_-_84750.jpg",
      "title": "Lynne Kirton / Malthouse Broad",
      "caption": "Malthouse Broad is adjacent to Ranworth Broad which is home to the Broads Wildlife Centre run by Norfolk Wildlife Trust. The Centre's floating thatched building is reached by an educational boardwalk which leads through woodland, reedbed and open water. Boats must moor in Malthouse Broad to visit Ranworth, as no boat traffic is allowed on Ranworth Broad."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/View_from_Ranworth_church_-_geograph.org.uk_-_84755.jpg",
      "title": "Lynne Kirton / View from Ranworth church",
      "caption": "View from Ranworth church. The church of St. Helen is known as the Cathedral of the Broads. Wide ranging views may be seen from the top of its 100 feet high tower. This one is looking north over part of Ranworth Broad. The church contains one of the finest examples of a medieval rood screen in the country, and an exquisite 15th century illuminated songbook known as the Ranworth Antiphoner"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Malthouse_Broad%2C_Ranworth_-_geograph.org.uk_-_1563093.jpg",
      "title": "Ian Taylor / Malthouse Broad, Ranworth",
      "caption": "Malthouse Broad. The berth in the foreground is used by the Mississippi-style paddle steamer Southern Comfort"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/The_Maltsters_-_geograph.org.uk_-_303098.jpg",
      "title": "Martyn Davies / The Maltsters",
      "caption": "The Maltsters pub. A worthy place to stop for some refreshments. Malthouse Broad is visible in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/South_Walsham_Broad_from_Fairhaven_Gardens_-_geograph.org.uk_-_1100358.jpg",
      "title": "John Goldsmith / South Walsham Broad from Fairhaven Gardens",
      "caption": "South Walsham Broad from Fairhaven Gardens. A Boxing Day tour listens to their guide as they stand at the point where a channel leads off from the broad into the woods/gardens, where it divides further into a network of medieval man-made waterways. You can take a small detour from the route to visit the gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Fairhaven_Water_Gardens_1_-_geograph.org.uk_-_251594.jpg",
      "title": "Colin Mitchell / Fairhaven Water Gardens 1",
      "caption": "Fairhaven Water Gardens. A wonderful display of Candelabra Primulas with the gardens leading down to South Walsham Broad."
    }
  ],
  "distance_km": 5.5,
  "description": "This circular walk in the Norfolk Broads visits the lovely village of Ranworth and its adjacent broad. Start the walk in the village where there is a public car park. From here you can pick up footpaths heading east along Malthouse Broad before turning south to visit South Walsham Broad. A track runs along the northern side of the broad before you turn north and then west along Priory Road. Country Lanes then head north to take you up to Ranworth Broad Boardwalk. You can follow the boardwalk up to the broad where you'll find the Wildlife Centre. There's lots of information on the huge variety of birdlife you can see on the water here. Species include great crested grebes, wigeons, gadwalls, kingfishers and cormorants. There are also areas of woodland and reedbeds at the reserve. After enjoying the broad the route then returns to the village car park. As you pass through the village pay a visit to the noteworthy Church of St Mary, known as the Cathedral of the Broads. You can climb the tower of the 16th century church for excellent views over the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Maltsers is located in an excellent spot close to Malthouse Broad. You can enjoy fine views over the water from their lovely terrace garden. They have a good menu with a particular popular selection of pizzas. You can find the pub at postcode NR13 6AB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Most of this walk is suitable for dogs though they are not allowed in the nature reserve and boardwalk area next to the broad. The Maltsers pub mentioned above is very dog friendly though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south of South Walsham Broad you will find the lovely Fairhaven Gardens where there's some lovely woodland and parkland trails with a wide range of attractive flora to see. Head a couple of miles south east and you can try the Acle and the River Bure Walk. Also from Acle you can pick up the Weavers' Way and try the Weavers Way Circular Walk. Head north west and you can pick up the Bure Valley Path and enjoy riverside walks to Coltishall and Wroxham. Here you can also pick up the Hoveton Walk which visits the nearby Hoveton Hall. The 19th century house includes some beautiful grounds with stunning gardens, a pretty lake and popular snowdrop walks in February. A couple of miles north and you'll find the splendid How Hill. This fine old house includes a nature reserve, tea rooms, beautiful gardens and riverside paths along the River Ant. Just to the north west there's the worthy village of Horning where there are some nice footpaths around the Bure Marshes Nature Reserve, a fine riverside pub and a foot ferry service to take you over the Bure. Salhouse Broad can also be accessed in this area. For more walking ideas in the area see the Norfolk Broads Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xR1HvKelyP8",
  "district": "Norwich",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Maltsters, Woodbastwick Road, Ranworth, Woodbastwick, Panxworth, Norwich, Norfolk, England, NR13 6AB, United Kingdom",
  "postcode": "NR13 6AB",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "broad"
  ],
  "points_of_interest": [
    "village",
    "church",
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}