{
  "objectID": "50d8bbb89051b3bf3d204dfb1cc11eeb",
  "created_at": "2024-12-18T16:44:59.361362+00:00",
  "ref": "bideford-walking-route",
  "title": "Bideford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/Bideford_Long_Bridge_-_geograph.org.uk_-_1324514.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/50d8bbb89051b3bf3d204dfb1cc11eeb.gpx",
  "_geoloc": {
    "lat": 51.0168881683,
    "lng": -4.2046682734
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Bideford_Long_Bridge_-_geograph.org.uk_-_1324514.jpg",
      "title": "Pauline Eccles [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bideford Long Bridge From The Quay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Chudleigh_Fort_Bideford_interior.jpg/256px-Chudleigh_Fort_Bideford_interior.jpg",
      "title": "User:Jack1956 [CC0], via Wikimedia Commons",
      "caption": "View of the interior of Chudleigh Fort at East-the-Water in Bideford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Abandoned_boats_on_the_River_Torridge_-_geograph.org.uk_-_1359428.jpg",
      "title": "Philip Halling / Abandoned boats on the River Torridge, via Wikimedia Commons",
      "caption": "Abandoned boats lie in the silt of the Torridge estuary at Bideford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/A_view_of_the_South_of_Bideford_-_geograph.org.uk_-_1588243.jpg",
      "title": "Roger A Smith / A view of the South of Bideford, via Wikimedia Commons",
      "caption": "A view of the South of Bideford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Beachfront_at_Instow%2C_Devon.jpg/256px-Beachfront_at_Instow%2C_Devon.jpg",
      "title": "Ethan Doyle White [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "The beachfront at Instow in North Devon. To the left of the image, across the bay, is Appledore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Boats_at_Instow_-_geograph.org.uk_-_1355650.jpg",
      "title": "Philip Halling / Boats at Instow, via Wikimedia Commons",
      "caption": "Boats at Instow. View across the River Taw, just after high tide at Instow, to Appledore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Appledore_waterfront_-_geograph.org.uk_-_1742561.jpg",
      "title": "David Gearing / Appledore waterfront, via Wikimedia Commons",
      "caption": "Appledore waterfront"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Appledore_Quay_-_geograph.org.uk_-_31622.jpg",
      "title": "Tony Atkin / Appledore Quay, via Wikimedia Commons",
      "caption": "Appledore Quay"
    }
  ],
  "distance_km": 10.0,
  "description": "This attractive North Devon town has some lovely walks along the estuary of the River Torridge. There's also two significant waymarked trails which pass through the area, a lovely country park and a nature reserve to explore. This circular walk takes you along both sides of the river, using sections of the South West Coast Path and the Tarka Trail long distance trails. It requires a ferry trip from Instow to Appledore which is only available in the summer months. The walk starts on Bideford Long Bridge which connects the old part of the town with East-the-Water on the right bank of the Torridge. It is one of the longest mediaeval bridges in England, being 677 feet (222 yards) long with 24 arches. Cross the bridge to the eastern side and you will come to Chudleigh Fort. The fort was built in about 1642 during the English Civil War. It was then reconstructed in the 19th-century and has been a Grade II listed building since 1949. There is also a nice park with a war memorial here as well. On the eastern side of the water you pick up the Tarka Trail and follow it north to Torridge Bridge, Westleigh and Instow. Instow is a lovely little village with a pretty quay with views over to Appledore on the other side. There is a small river beach and sand dunes, that home some rare species of orchid including the pyramid orchid. From the quay you can pick up a summer ferry to take you over the river to Appledore. Here you can pick up the South West Coast Path and follow it south through Northam to return to Bideford. To continue your walking around the Bideford area you can head a short distance to the north west to visit Northam Burrows Country Park. Here you will find over 600 acres of grassy coastal plain, salt marsh and sand dunes. On the northern side of the estuary you can visit the noteworthy Braunton Burrows and Crow Point. The reserve covers nearly 900 hectares making it the second largest dune system in England. If you head north east along the Tarka Trail you can visit Barnstaple where there's paths along the River Taw and the interesting Barnstaple Heritage Trail to try. You can also catch boats to Lundy Island from Bideford where there's more nice trails and marine wildlife to see.",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}