{
  "created_at": "2025-01-05T23:23:51.141309+00:00",
  "objectID": "50e38112ac3721d9d1fe24f250d83231",
  "ref": "dovedale-walking-route",
  "title": "Dovedale to Milldale Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/89/Bend_In_The_River_Dove_-_geograph.org.uk_-_1282751.jpg",
  "nearby": [
    {
      "description": "Dovedale Circular Walk",
      "objectID": "25f7d47f743822ba575c7d402a7b9d0b",
      "ref": "dovedale-circular-walk-walking-route"
    },
    {
      "description": "Wolfscote Dale",
      "objectID": "cd6ea5894c7749ec7e7fe0ecb5021856",
      "ref": "wolfscote-dale-walking-route"
    },
    {
      "description": "Thorpe Cloud",
      "objectID": "844ac9c53b13e8c408f239fc9406dc36",
      "ref": "thorpe-cloud-walking-route"
    },
    {
      "description": "Ilam Park",
      "objectID": "153ed8cdcfac9320d88a915330c96e57",
      "ref": "ilam-park-walking-route"
    },
    {
      "description": "Ashbourne to Dovedale Circular Walk",
      "objectID": "f380a823d1c0c7238f36f8c55eb60af5",
      "ref": "ashbourne-to-dovedale-circular-walk-walking-route"
    },
    {
      "description": "Ashbourne",
      "objectID": "34b3bc619bd8201b837af05edf6ead27",
      "ref": "ashbourne-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/50e38112ac3721d9d1fe24f250d83231.gpx",
  "_geoloc": {
    "lat": 53.0559281392,
    "lng": -1.7829105828
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Bend_In_The_River_Dove_-_geograph.org.uk_-_1282751.jpg",
      "title": "Hall Family / Bend In The River Dove, via Wikimedia Commons",
      "caption": "Bend In The River Dove. A very nice beauty spot as the River Dove bends on its way down through Dovedale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Below_Thorpe_Cloud_-_geograph.org.uk_-_1339836.jpg",
      "title": "Colin Smith / Below Thorpe Cloud, via Wikimedia Commons",
      "caption": "Below Thorpe Cloud. Busy footpath alongside the River Dove. To the left of the hill is Lin Dale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Dovedale_-_Climbing_up_to_Lover%27s_Leap_-_geograph.org.uk_-_861223.jpg",
      "title": "Alan Heardman / Dovedale - Climbing up to Lover's Leap, via Wikimedia Commons",
      "caption": "Climbing up to Lover's Leap"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Dove_Dale_Treasure_-_geograph.org.uk_-_1052959.jpg",
      "title": "Peter Barr / Dove Dale Treasure, via Wikimedia Commons",
      "caption": "Dove Dale Treasure. The tree stump and long log beside it have hundreds of coins hammered into their surfaces. These would not make very comfortable seats! Three more stumps further up river are treated in same curious way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Dove_Holes%2C_Dovedale_-_geograph.org.uk_-_1339722.jpg/256px-Dove_Holes%2C_Dovedale_-_geograph.org.uk_-_1339722.jpg",
      "title": "Colin Smith / Dove Holes, Dovedale, via Wikimedia Commons",
      "caption": "Dove Holes, Dovedale. Steep hillsides on the east bank of the wooded Dovedale. The caves in the rocky outcrops are visible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/River_Dove_-_Upstream_View_from_Stepping_Stones_-_geograph.org.uk_-_861185.jpg",
      "title": "Alan Heardman / River Dove - Upstream View from Stepping Stones, via Wikimedia Commons",
      "caption": "River Dove. Upstream View from Stepping Stones"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Dovedale_above_Coldeaton_Bridge_-_geograph.org.uk_-_309605.jpg",
      "title": "Philip Halling / Dovedale above Coldeaton Bridge",
      "caption": "Dovedale above Coldeaton Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Milldale_at_the_end_of_a_walk_down_Dovedale_-_geograph.org.uk_-_1052092.jpg",
      "title": "Andy Jamieson / Milldale at the end of a walk down Dovedale",
      "caption": "Milldale at the end of a walk down Dovedale"
    }
  ],
  "distance_km": 4.0,
  "description": "The beautiful Dovedale is one of the must see areas in the Peak District. The area attracts a million visitors each year because of its stunning natural beauty. The walk starts at the Dove Dale car park, near Thorpe. It's a large car park so there should be spaces available most of the time. You then head north along the River Dove to the famous Dovedale Stepping Stones. The stones were first set down in the 19th century for Victorian tourists to cross the river. It's a lovely place to stop for a while, with great views of Thorpe Cloud, a large limestone hill towering over the river. From the stones you continue north to Lovers' Leap. Legend says that a young woman who believed her lover had been killed in the Napoleonic Wars threw herself from the rock. She was saved when her skirt caught in the branches of a tree below. When she returned home, she heard her lover was still alive. You can use the steps provided to climb this rock formation for splendid views of the dale. The next section takes you to the fascinating Reynard's Cave, passing the huge Tissington Spires on the way. You can enter the huge natural arch of Reynard's Cave and enjoy wonderful views of the area. You continue to Pickering Tor and then onto the imposing Dove Holes caves, before the final stretch to the village of Milldale. Here you can enjoy refreshments at the tea shop before the return leg. If you would like to continue your walking in the area then you could head to the nearby Ilam Park. The park can be easily reached from the same start point for this walk by following a footpath west for about a mile. Youl can then visit Bunster Hill, Hinkley Wood and the beautiful Ilam Hall gardens. If you continue north along the riverside path you will come to Wolfscote Dale and Biggin Dale nature reserves. For a longer route try our Dovedale Circular Walk which starts from the delightful village of Tissington and makes use of two of the long distance trails which run through the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Dog in Thorpe village is a great place to go for some post walk refreshments. The charming old pub does good food and has a nice courtyard to sit out on warmer days. You can find the pub on Spend Lane with a postcode of DE6 2AT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and surrounding woods are excellent dog walking country so you're bound to see plenty of other owners on a fine day. The Old Dog pub mentioned above is also dog friendly (as the name suggests!)."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The nearby town of Ashbourne makes a great base for exploring the area. Our Ashbourne to Dovedale Circular Walk visits the stepping stones before a climb to Thorpe Cloud. For another circular walk through the dale see the Ilam Dovedale Circular Walk which starts from the car park at the National Trust's Ilam Park. This will take you up to up to Stanshope on country lanes before heading into Dovedale at the Dove Holes caves. It then visits the stepping stones and Lovers Leap before returning to the car park. To the north west there's the circular Wetton Walk which takes you to the splendid Thor's Cave and the historic Wetton Mill where there are some delightful riverside tea rooms. The circular Fenny Bentley Walk visits Thorpe Cloud and Dovedale from the pretty village to the south east. The village is worthy of exploration with the pretty Bentley Brook, a 14th century church and a fine inn with particularly lovely gardens to see. The route also visits the 17th-century Jacobean mansion house at Tissington Hall. The delightful village of Parwich lies just a few miles to the east of Dovedale. There's a pretty village green, old limestone cottages and a fine pub dating back to the 1600s. You can reach the village on the Limestone Way from Thorpe. For more walking ideas in the area see the White Peak Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UaaduHwnqRs",
  "postcode": "DE6 2BE",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "131, Thorpe Road, Thorpe CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE6 2BE, United Kingdom",
  "district": "Derbyshire Dales",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rock",
    "woodland"
  ],
  "points_of_interest": [
    "viewpoints",
    "natural arches",
    "hilltops",
    "gardens"
  ],
  "facilities": [
    "car park",
    "tea shop"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}