{
  "created_at": "2025-01-06T08:51:24.198033+00:00",
  "objectID": "50efa7d40ea6b262af76cea93cdd598f",
  "ref": "hartington-walking-route",
  "title": "Hartington Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Hartington_church_-_geograph.org.uk_-_307218.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/50efa7d40ea6b262af76cea93cdd598f.gpx",
  "_geoloc": {
    "lat": 53.1397521068,
    "lng": -1.8102207449
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Hartington_church_-_geograph.org.uk_-_307218.jpg",
      "title": "Philip Halling / Hartington church, via Wikimedia Commons",
      "caption": "Hartington church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Hartington_709136_f24ad2e7.jpg",
      "title": "Row17 [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Hartington is near but not on the River Dove, The Devonshire Arms"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Hartington_Village_and_pump_-_geograph.org.uk_-_1069328.jpg",
      "title": "Debbie J / Hartington Village and pump, via Wikimedia Commons",
      "caption": "Hartington Village and pump"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Dove_at_Hartington_340428_b17fdd30.jpg",
      "title": "Nikki Mahadevan [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dove at Hartington"
    }
  ],
  "distance_km": 9.5,
  "description": "This pretty village is a great base for exploring some of the highlights of the popular Dove Dale area of the Peak District. The village includes attractive houses and a pretty green and duck pond. There's also an interesting history with the 13th century parish church of Saint Giles and the 17th century Hartington Hall. Hartington is popular with tourists so there are good facilities with a car park, pubs, a youth hostel and a visitor centre at Hartington signal box, on the site of the former Hartington railway station. From the village you can directly explore the lovely Beresford Dale and Wolfscote Dale Nature Reserves, just to the south of the centre. This then leads you into Dovedale which is one of the highlights of the Peak District. Just to the east of the village you can pick up the Tissington Trail. This cycling and walking trail follows a disused railway line through some stunning scenery. Right next to that is the High Peak Trail which also follows an old railway line from Cromford to Dowlow. These two rail trails are a great way to explore the Peak District on foot or by bike. The fascinating Neolithic henge monument of Arbor Low is also within easy reach of the village. The limestone circle sits in an elevated position with super views over the White Peak area of the Peak District. The Midshires Way and Pennine Bridleway long distance trails can also be picked up just to the east of the village. The circular walk below takes you from the village through Wolfscore Dale before returning through the adjacent Biggin Dale. The walk gives great views of the River Dove and includes some nice woodland sections and lots of interesting flora and fauna. The walk is reasonably flat with some more challenging climbs towards the end of the route in Biggin Dale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Devonshire Arms pub in Hartington village after your exercise. The quaint old 17th century pub has a lovely large beer garden to relax in during the warmer months. You can find it at Market Place, postcode SK17 0AL. You could also stop off in the pretty little village of Biggin. Here you'll find the excellent Waterloo Inn which has a good outdoor area with country and village views. It's also dog friendly if you have your four legged friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north you can try the circular walk from Hurdlow which climbs to the viewpoint at High Wheeldon. The little hamlet has a good sized public car park and a charming country pub to relax in afterwards. The High Peak Trail can also be picked up here. The shared cycling and walking trail runs along an old railway line from Cromford to Dowlow. For more walking ideas in the area see the Peak District Walks and the White Peak Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/upm4kkiM1pA",
  "postcode": "SK17 0AN",
  "district": "Derbyshire Dales",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hartington Farm Shop & Cafe, Mill Lane, Hartington Town Quarter CP, Hartington, Derbyshire Dales, Derbyshire, East Midlands, England, SK17 0AN, United Kingdom",
  "state": "England"
}