{
  "created_at": "2025-01-06T04:04:04.434412+00:00",
  "objectID": "515ec0a640673f69f8be8fbdbeb5fd30",
  "ref": "wrington-walking-route",
  "title": "Wrington Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Cattle_grazing_beside_Alburys%2C_Wrington_-_geograph.org.uk_-_951093.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/515ec0a640673f69f8be8fbdbeb5fd30.gpx",
  "_geoloc": {
    "lat": 51.3643239058,
    "lng": -2.7642400477
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Cattle_grazing_beside_Alburys%2C_Wrington_-_geograph.org.uk_-_951093.jpg",
      "title": "John Lord / Cattle grazing beside Alburys, Wrington",
      "caption": "Cattle grazing beside Alburys, Wrington. The footpath down from West Hay Rd to Ladywell runs alongside the hedge on the left"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Cleeve%2C_bluebell_wood_-_geograph.org.uk_-_62547.jpg",
      "title": "Martin Bodman / Cleeve: bluebell wood",
      "caption": "Cleeve, bluebell wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Outbuildings_and_wire_pig_-_Walled_Garden%2C_Wrington_-_geograph.org.uk_-_1577349.jpg",
      "title": "Anthony O'Neil / Outbuildings and wire pig - Walled Garden, Wrington",
      "caption": "Outbuildings and wire pig - Walled Garden. The restaurant and garden on this site were once part of the large estate in Barley Wood, north of the adjacent road which leads west to Wrington Village. These outbuildings may now be used as artists' studios. The handsome wire sculpture of a pig (or boar?) is one of several art works in the grounds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Goblin_Combe_cliffs_-_geograph.org.uk_-_901736.jpg",
      "title": "George Evans / Goblin Combe cliffs",
      "caption": "Goblin Combe cliffs. Looking towards King's Wood over Goblin Combe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Mill_leat_from_the_weir%2C_Wrington_-_geograph.org.uk_-_1051967.jpg",
      "title": "John Lord / Mill leat from the weir, Wrington",
      "caption": "Mill leat from the weir, Wrington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/ST4464_Ancient_Hill_Fort%2C_Cadbury_Hill_-_geograph.org.uk_-_68763.jpg",
      "title": "FollowMeChaps / ST4464 Ancient Hill Fort, Cadbury Hill",
      "caption": "Ancient Hill Fort, Cadbury Hill. This Ancient fort, directly under the flight path from Bristol International Airport, is on top of Cadbury Hill and must have been an easily defendable position. Whilst wooded all around the top is kept clear by occasional grazing. Owned by Yatton Parish Council it provides open access and excellent walks for the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Weir_-_geograph.org.uk_-_338123.jpg",
      "title": "MDS / Weir",
      "caption": "Weir Congresbury Yeo. Cut back V broad weir causes the flow to be turbulent at the sides with a stilling pool in the central stream, an unusual feature of modern concrete arc supporting an older stone work bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/The_Congresbury_Yeo_flows_through_the_hamlet_of_Iwood_-_geograph.org.uk_-_99214.jpg",
      "title": "FollowMeChaps / The Congresbury Yeo flows through the hamlet of Iwood",
      "caption": "The Congresbury Yeo flows through the hamlet of Iwood"
    }
  ],
  "distance_km": 11.0,
  "description": "This Somerset based village is in a lovely spot for exploring the surrounding landscape of the Mendip Hills. There's some nice riverside trails, local expansive woodland and a nearby ancient hill fort to explore. This circular walk from the village visits some of the highlights of the area including Wrington Hill, Goblin Combe, Cadbury Hillfort, Cleeve, the River Yeo and the neighbouring village of Congresbury. The walk starts in the village and follows lanes north towards Cleeve Woods where there's pretty bluebells to see in the spring months. You continue past Wrington Hill to Goblin Combe where you can pick up footpaths heading west through the Combe. The peaceful wooded valley includes miles of trails with limestone meadows and lots of wildflowers during the warmer months. The trails then lead into the village of Cleeve where you turn south west to visit Cadbury Hillfort. Here you'll find a local nature reserve and an Iron Age hill fort, which is a Scheduled Ancient Monument. The area is great for flora and fauna with green woodpeckers, marsh tit and wood anemone to see. There are also fine views over the area from the 81 m (266 ft) summit. You then descend to Congresbury where you pick up the Two Rivers Way and follow the waymarked footpath east along the River Yeo back to Wrington.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the Plough Inn for some post walk refreshments. There's a charming old world interior with oak beams and well stocked bar. Outside there's extensive front and back gardens and a Boules Pitch. You can find them on the High Street at postcode BS40 5QA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine dog walk. The Plough Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east there's another major local highlight at Blagdon Lake. The expansive lake can be reached by following the Two Rivers Way east from the village. In Congresbury you could link up with the popular Strawberry Line. This shared walking and cycling path runs from Yatton to Cheddar along a disused railway line. You can see the remains of the old station in the village and pick up the trail here. At the end of the route you can visit Cheddar Reservoir and the famous Cheddar Gorge. For more walking ideas in the area see the Mendip Hills Walks page."
    }
  ],
  "district": "Wrington",
  "county": "North Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "High Street, Wrington, North Somerset, England, BS40 5QB, United Kingdom",
  "postcode": "BS40 5QB",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pasture",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "hill fort"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}