{
  "objectID": "51cfbe5ae70e6760db23921f7d1383fb",
  "created_at": "2024-12-18T16:19:04.152945+00:00",
  "ref": "south-cerney-walking-route",
  "title": "South Cerney Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/War_memorial_Broadway_Lane_South_Cerney_-_geograph.org.uk_-_128841.jpg/256px-War_memorial_Broadway_Lane_South_Cerney_-_geograph.org.uk_-_128841.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/4D588E81050AAA5B8625854E0030061C/$FILE/South Cerney.gpx",
  "_geoloc": {
    "lat": 51.6738614939,
    "lng": -1.9307182788
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/War_memorial_Broadway_Lane_South_Cerney_-_geograph.org.uk_-_128841.jpg/256px-War_memorial_Broadway_Lane_South_Cerney_-_geograph.org.uk_-_128841.jpg",
      "title": "Peter Watkins / War memorial Broadway Lane South Cerney",
      "caption": "War memorial Broadway Lane South Cerney"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/South_Cerney_Airfield_-_geograph.org.uk_-_288049.jpg",
      "title": "Peter Watkins / South Cerney Airfield",
      "caption": "South Cerney Airfield South Cerney Airfield is nowadays part of an army base. The field is used for parachuting using light aircraft, and a practice drop zone for Hercules transport aircraft from RAF Lyneham. The Army Parachute team the Silver Stars are based here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Bow_Wow_and_the_River_Churn%2C_South_Cerney_-_geograph.org.uk_-_1518004.jpg",
      "title": "Brian Robert Marshall / Bow Wow and the River Churn, South Cerney",
      "caption": "Bow Wow and the River Churn, South Cerney. This charming little thoroughfare is part of a conservation area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Bow_Wow%2C_a_gazebo_and_the_River_Churn%2C_South_Cerney_-_geograph.org.uk_-_1520382.jpg",
      "title": "Brian Robert Marshall / Bow Wow, a gazebo and the River Churn, South Cerney",
      "caption": "Bow Wow, a gazebo and the River Churn, South Cerney The curiously-named thoroughfare is highway at this point although it becomes a footpath and access-only to some isolated properties a few hundred metres to the east. The gazebo is in the grounds of the Old Vicarage. The small river is the Churn, strictly a tributary of the Thames although it could be argued that the Thames is a tributary of the Churn since the former is a lot shorter than the latter measured from the point where they meet in Cricklade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Gloucestershire_County_Outdoor_Training_Lake%2C_South_Cerney_-_geograph.org.uk_-_128814.jpg",
      "title": "Peter Watkins / Gloucestershire County Outdoor Training Lake, South Cerney",
      "caption": "Gloucestershire County Outdoor Training Lake, South Cerney. The lake is run by the Education Committee to train youngsters in watersports. New holiday homes can be seen in the background, beyond the River Churn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Cerney_Wick_Lock_and_roundhouse_-_geograph.org.uk_-_1048466.jpg",
      "title": "David Stowell / Cerney Wick Lock and roundhouse",
      "caption": "Cerney Wick Lock and roundhouse. Cerney Wick Lock chamber has been cleared and the basic structure was largely restored in 1980. Top paddles were fitted at the same time, as were the gates. These were \"recycled\", having come originally from Sunbury Lock on the Thames. They were at the end of their life and resized to fit Cerney Wick Lock, largely as a cosmetic feature pending final restoration of navigation. The Roundhouse, a unique characteristic of this canal, formerly housed the lock keeper."
    }
  ],
  "distance_km": 7.8,
  "description": "This Cotswolds based village is splendidly positioned next to a series of lakes and the River Churn. It's located just to the south of Cirencester and not far from Cricklade, near the Wiltshire border. It is twice winner of the Bledisloe Cup for best kept village. This circular walk takes you around the Cotswold Water Park from the village. The waterside walk runs for about 5 miles, taking you along the River Churn and around several pools and lakes. It uses a series of flat footpaths and country lanes, so suitable for most abilities. The area is great for wildlife spotting with water vole, otter, breeding and wintering birds to look out for on the way. The route starts in the village on the river and follows a riverside path east before heading south east towards the lakes. You'll follow Wildmoorway Lane past Horseshoe Lake before coming to Cerney Wick. The route then follows another track north back into the village.",
  "postcode": "GL7 5UA",
  "district": "South Cerney",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England"
}