{
  "objectID": "52255e0fb6c77df83dab267fa1219512",
  "created_at": "2024-12-18T01:45:34.232751+00:00",
  "ref": "priory-park-reigate-walking-route",
  "title": "Priory Park Reigate Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Reigate_Priory_-_geograph.org.uk_-_1199604.jpg",
  "nearby": [
    {
      "description": "Reigate Heath",
      "objectID": "f83d9593621fb4bd90df754cd5f4ff10",
      "ref": "reigate-heath-walking-route"
    },
    {
      "description": "Reigate and Banstead Millennium Trail",
      "objectID": "a43ef41680490a2489ea84e47e05c346",
      "ref": "reigate-and-banstead-millennium-trail-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Redhill and Earlswood Common",
      "objectID": "75a32500553f115f1ccc78d63f8bead7",
      "ref": "redhill-and-earlswood-common-walking-route"
    },
    {
      "description": "Colley Hill",
      "objectID": "330c2b129f9e085e7ea900828eba9f24",
      "ref": "colley-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/52255e0fb6c77df83dab267fa1219512.gpx",
  "_geoloc": {
    "lat": 51.2323279103,
    "lng": -0.2039979602
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Reigate_Priory_-_geograph.org.uk_-_1199604.jpg",
      "title": "Ian Capper / Reigate Priory",
      "caption": "Reigate Priory. This grade I listed building dates mainly from the 1770s, although some parts of the previous Tudor building remain, built by the first Lord Howard of Effingham, uncle of Catherine Howard, the fifth wife of Henry VIII, who had been given the Manor and Priory of Reigate in 1541 following the dissolution. Lord Howard of Effingham was the father of the second Lord Howard of Effingham, famous for his victory over the Spanish Armada, who also lived here. Prior to this, an earlier Augustinian monastery had stood here, dating from the 13th century, parts of which were incorporated into the Tudor mansion. The photo shows the parterre garden to the south of the building, built as part of the restoration of Priory Park completed in 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Priory_Park_-_geograph.org.uk_-_1307017.jpg",
      "title": "Ian Capper / Priory Park",
      "caption": "Priory Park. Looking towards Park Lane, with the lake on the left beyond the large Copper Beech, and with the North Downs in the background. There have been various owners of the priory, including Sir John Parsons, a London brewer and Lord Mayor of London, who bought it from the Howards in 1703, a Mr Richard Ireland who bought it in 1766 and was responsible for the major rebuild and Lord Somers, owner of much of Reigate, who bought it in 1808 and whose family owned it until bought by the local council in 1945. It now houses Reigate Priory Junior School - what must be one of the most impressive state school buildings in the country!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Sunken_garden%2C_Priory_Park_-_geograph.org.uk_-_1095546.jpg",
      "title": "Ian Capper / Sunken garden, Priory Park",
      "caption": "Sunken garden. As part of the multi-million pound restoration of Priory Park completed in 2008, the garden in front of Reigate Priory was redesigned, creating this sunken garden. In the background can be seen the new pavilion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Reigate_Priory_Cricket_Ground_-_geograph.org.uk_-_1091935.jpg",
      "title": "Ian Capper / Reigate Priory Cricket Ground",
      "caption": "Cricket Ground. Reigate Priory Cricket Club was founded in 1852, and plays on this ground of Park Lane, near the centre of Reigate. In the background can be seen the distinctive roofline of Browne's Lodge, with the line of the North Downs behind (Colley Hill on the left)."
    }
  ],
  "distance_km": 3.0,
  "description": "This large park in Reigate is great for walking with miles of woodland trails, lakes and formal gardens.  You can also climb the Priory Park Ridge for great views across the town and the North Downs. The park is good for flora and fauna with pretty bluebells in the spring, 207 plant species and champion trees which you can see on the tree trail. Look out for a variety of birdlife around the large lake. The Reigate and Banstead Millennium Trail passes the park so you can follow this trail to extend your walk. The Greensand Way long distance walk also runs through the park so you can pick this up to continue your walk. You could follow the trail a short distance to the west and visit Reigate Heath with its pretty heathland and old windmill. Just to the east you can enjoy lakes, ponds and woodland at Redhill and Earlswood Common. Reigate Castle is just a short stroll away so this is another good option.",
  "video_url": "https://www.youtube.com/embed/c2BKXsHz_bU",
  "postcode": "RH2 7LH",
  "district": "Reigate",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}