{
  "created_at": "2025-01-06T03:42:11.947786+00:00",
  "objectID": "526598b7d42afce0db5a9bcb98b66b43",
  "ref": "yealmpton-walking-route",
  "title": "Yealmpton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Yealmpton%2C_Yealmpton_Mills_-_geograph.org.uk_-_879429.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/526598b7d42afce0db5a9bcb98b66b43.gpx",
  "_geoloc": {
    "lat": 50.348504219,
    "lng": -4.0017841623
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Yealmpton%2C_Yealmpton_Mills_-_geograph.org.uk_-_879429.jpg",
      "title": "Martin Bodman / Yealmpton: Yealmpton Mills",
      "caption": "Yealmpton Mills. A conversion to residential accommodation, with a further conversion \u0096the old stable block \u0096 beyond. In 1866 the mill was offered to let: \u0091.. old established and valuable Flour Mills known as the Yealmpton Mills, situated close to the village in the parish of Yealmpton, comprising three pairs of stones, driven by two water-wheels and having all necessary machinery .. for carrying on an extensive flour trade .. one mile from Kitley Quay where corn can be brought by water ..\u0092 [Source: The Western Times 6 July 1866 p 1 col 1]. This was the lowest mill in the Yealm valley, powered by a leat from the river. A mill was known as \u0091Mills\u0092 when more than one waterwheel was employed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Yealmpton%2C_Market_Street_-_geograph.org.uk_-_1490378.jpg",
      "title": "Martin Bodman / Yealmpton: Market Street",
      "caption": "Yealmpton: Market Street. The thatched building at the end of the row is Christmas Cottage. Looking towards Brixton and Plymouth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Yealmpton%2C_at_Kitley_Quay_-_geograph.org.uk_-_546376.jpg",
      "title": "Martin Bodman / Yealmpton: at Kitley Quay",
      "caption": "Yealmpton: at Kitley Quay. The Yealm estuary. The remains of a second quay, not indicated on the Ordnance Survey map, perhaps serving Puslinch estate at one time, visible across the estuary, to the left. At Kitley small coal or culm would have been shipped in from south Wales to feed the nearby, now ruinous, limekilns in the 19th century"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Yealmpton%2C_near_Warren_Point_-_geograph.org.uk_-_459985.jpg",
      "title": "Martin Bodman / Yealmpton: near Warren Point",
      "caption": "Near Warren Point On the Yealm. Looking south west towards Steer Point with the tide in."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Looking_towards_the_Mouth_of_the_Yealm_-_geograph.org.uk_-_1071570.jpg",
      "title": "Sarah Charlesworth / Looking towards the Mouth of the Yealm",
      "caption": "Looking towards the Mouth of the Yealm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Wembury_Beach_-_geograph.org.uk_-_303233.jpg",
      "title": "Tony Atkin / Wembury Beach",
      "caption": "Wembury Beach. The church which stands above the beach is some distance from the village which is inland. It may have been built here to act as a daymark for shipping in the bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Old_Mother_Hubbards_Cottage%2C_Yealmpton.jpg/512px-Old_Mother_Hubbards_Cottage%2C_Yealmpton.jpg",
      "title": "Nilfanion, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Old Mother Hubbards Cottage, Yealmpton. A vernacular stone, cob and thatch; the building now serves as a Chinese restaurant and is about 400 years old. Sarah Martin lived here in 1804 and is said to have composed the rhyme \"Old Mother Hubbard\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Yealmpton%2C_Pimple_Rock_-_geograph.org.uk_-_429003.jpg",
      "title": "Martin Bodman / Yealmpton: Pimple Rock",
      "caption": "Pimple Rock. Just upstream from a footbridge over the river Yealm, looking east-north-east"
    }
  ],
  "distance_km": 21.0,
  "description": "This village in South Devon sits in a pleasnt riverside location just east of Plymouth. The pretty village includes some attractive cottages, an old church and the 400 year old Mother Hubbard's Cottage. The lady from the nursery rhyme lived in the cottage when working as the housekeeper at Kitley House. This walk from the village follows part of the Erme Plym Trail to the lovely Yealm Estuary. The walk starts in the village where you can pick up the Erme Plym Trail and follow the waymarked trail west to Brixton and Hollacombe Hill. The route then heads south, passing Wembury village before coming to Warren Point where the River Yealm and the coastal Wembury Bay meet. You can then follow the coastal path west along the Bay to Blackstone Rocks. Here you pick up the Erme Plym Trail again and head through the Churchwood Valley before retracing your steps to return to Yealmpton. You can extend the walk by heading west along the South West Coast Path to Wembury Point and the scenic Heybrook Bay.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy some post walk rest and refreshment at the Rose and Crown. There's a cosy interior with a roaring fire and a sun trap garden outside. They have a restaurant selling high quality food and also provide accommodation if you'd like to stay in the area. You can find them on Market Street at postcode PL8 2EB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and coastal trails make for a fine dog walk. The Rose and Crown mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south of the village there's Rough Torrs to explore. The secluded valley has some nice woodland trails along the river."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8UFQjyFuSUg",
  "postcode": "PL8 2JP",
  "district": "Yealmpton",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}