{
  "created_at": "2025-01-06T04:42:25.897729+00:00",
  "objectID": "52843e635448e1513f9ca8ec6fa4a0b2",
  "ref": "selborne-common-walking-route",
  "title": "Selborne Walks - Selborne Common",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Gracious_St%2C_Selborne_-_geograph.org.uk_-_1205745.jpg",
  "nearby": [
    {
      "description": "Noar Hill",
      "objectID": "745626c33490b8fa9cf2847befe90430",
      "ref": "noar-hill-walking-route"
    },
    {
      "description": "Hangers Way",
      "objectID": "112e1c088c98838db8d6b4ebd2670675",
      "ref": "hangers-way-walking-route"
    },
    {
      "description": "Alton",
      "objectID": "59f26632eb45f10b608f50829e2b6384",
      "ref": "alton-walking-route"
    },
    {
      "description": "Hogmoor Inclosure",
      "objectID": "32c047918209c1983968cd6553ba0878",
      "ref": "hogmoor-inclosure-bordon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/52843e635448e1513f9ca8ec6fa4a0b2.gpx",
  "_geoloc": {
    "lat": 51.0960975857,
    "lng": -0.9416243509
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Gracious_St%2C_Selborne_-_geograph.org.uk_-_1205745.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Gracious St, Selborne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Selborne_from_the_Hanger_-_geograph.org.uk_-_1536831.jpg",
      "title": "Paul Buckingham / Selborne from the Hanger, via Wikimedia Commons",
      "caption": "Selborne from the Hanger. The steepest slopes are clad in ancient beechwood: a \"hanger\", in East Hampshire, is just such a beechwood. The plateau is occupied by more beechwood, mixed with other broad-leaved species such as English oak, ash, and hawthorn, and in places is scrubby. A small part of the plateau comprises open grassland with scattered gorse and stands of bracken. Other, smaller areas of chalk grassland have recently been recreated elsewhere. The Common is noted for its wild flowers, with thriving communities of yellow archangel, wood spurge, and wood anemone. Spurge-laurel is sparsely but widely distributed. The Common is also home to such interesting species as stinking hellebore, green hellebore, bird's nest orchid, violet helleborine, the extreme rarity E. x schulzei, and green-flowered helleborine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Thatched_Cottage%2C_Selborne._-_geograph.org.uk_-_116930.jpg",
      "title": "Colin Smith / Thatched Cottage, Selborne., via Wikimedia Commons",
      "caption": "Thatched Cottage, Selborne. Just off the main street, a half-timbered cottage with brick infill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Entrance_to_Selborne_Common_-_geograph.org.uk_-_1436386.jpg",
      "title": "don cload / Entrance to Selborne Common, via Wikimedia Commons",
      "caption": "Entrance to the common. The National Trust sign shows this is Selborne Common, an area of mainly woodland but also open areas which used to be used for sheep grazing. Various rare molluscs and insects have also been documented in the area. Butterflies found on the Common include the Duke of Burgundy, silver-washed fritillary, and purple emperor. The avian population comprises many species typical of broad-leaved woodland in southern England. These include the sparrowhawk, stock dove, tawny owl, European green woodpecker, great spotted woodpecker, garden warbler, blackcap, chiffchaff, spotted flycatcher, marsh tit, nuthatch, treecreeper, and jay. Buzzards are frequently observed hunting over the tree canopy. Hobby, woodcock, common firecrest, and brambling are occasional visitors. Selborne Common is known as a reliable location for sighting the wood warbler. Resident mammals include roe deer and dormouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Selborne%2C_Hampshire%2C_The_Wakes_-_geograph.org.uk_-_546573.jpg",
      "title": "Dr Neil Clifton / Selborne, Hampshire: The Wakes",
      "caption": "The Wakes. 'The Wakes' was the home of the famous naturalist and gardener Gilbert White. White gained fame through his publication 'The Natural History and Antiquities of Selborne' in 1789. Compiled towards the end of his life, the book comprised a blend of White's correspondence with fellow naturalists such as Thomas Pennant and Daines Barrington, a 'Naturalist's Calendar' (included in the second edition) that compared phenology observations between White and William Markwick regarding the first appearances in the year of various animals and plants, and systematic observations of natural history categorised by species and group. A second volume, less frequently reprinted, explored the antiquities of Selborne. Some of White's letters were never sent but were instead written specifically for the book. White's Natural History was warmly received by both contemporary critics and the general public, and it continued to earn admiration from a diverse array of literary figures in the nineteenth and twentieth centuries. His work is recognised as an early contribution to ecology, particularly in the field of phenology. The book is cherished for its charm, apparent simplicity, and its ability to evoke a vision of pre-industrial England. The original manuscript of White's work has been carefully preserved and is now exhibited at the Gilbert White museum at The Wakes in Selborne."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Gilbert_White%27s_garden%2C_Selborne%2C_Hampshire_-_geograph.org.uk_-_546577.jpg",
      "title": "Dr Neil Clifton / Gilbert White's garden, Selborne, Hampshire",
      "caption": "Gilbert White's garden. Gilbert White was not a rich man and could not afford statues to decorate his garden. Instead he used wooden boards painted to resemble statues at the end of sight lines as here through the field gates. Since prehistoric or Romano-British times, there are traces of a field system on the Common, which might have been reused during the Middle Ages. Since then, the Common hasn't been ploughed. Earthworks found along the western boundary are tentatively dated back to the mid-thirteenth century, coinciding with the time when Newton Park was enclosed. An earth bank, stretching across the Common, is estimated to have been constructed around 1750, likely serving to safeguard coppice woodland from grazing animals. During the eighteenth century, the owner of the manor felled beech trees on the Common. Local residents exercised their customary rights to pasture cattle and sheep and to gather firewood, practices that persisted until the 1950s. In medieval times, Selborne Priory nearby held the lordship of the manor of Selborne; later, Magdalen College, Oxford, inherited the manor and donated it to the National Trust in 1932. Recently, cattle have been reintroduced in an effort to recreate the ancient, flower-rich, wood-pasture habitat that commoning once fostered, which has largely vanished from England. A dew pond named Wood Pond is located near the western boundary."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/The_Selborne_Yew_-_geograph.org.uk_-_1436404.jpg",
      "title": "don cload / The Selborne Yew",
      "caption": "The Selborne Yew is situated in the churchyard of St Mary's church. The small sign states that the tree was designated by The Tree Council to be one of 50 great British trees. Unfortunately, it was blown down in a storm and it is dead. Interestingly, there is a small yew sapling growing by the tree stump (not visible in the photo) which might possibly have come from a seed of the original tree."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/The_%27Selborne_Arms%27%2C_Selborne%2C_Hampshire_-_geograph.org.uk_-_546588.jpg",
      "title": "Dr Neil Clifton / The 'Selborne Arms', Selborne, Hampshire",
      "caption": "The 'Selborne Arms'. At the end of the nineteenth century, this building was still a farm. It then received a licence as a 'beer house', which meant it could sell beer and cider, but not spirits."
    }
  ],
  "distance_km": 3.5,
  "description": "This circular walk visits Selborne Common and Selborne Hill, one of the highest points in the county of Hampshire. The common is owned by the National Trust and has a number of nice woodland trails to try. In the woods you can see a variety of wildflowers including yellow archangel, wood spurge and wood anemone. Also look out for lots of butterflies such as Duke of Burgundy, silver-washed fritillary and purple emperor. Notable birds to see include buzzard, sparrowhawk, stock dove, tawny owl, green woodpecker and great spotted woodpecker. From the high points you can enjoy lovely views over the South Downs. The walk starts from the attractive village of Selborne. The village is notable for its links with the world-famous naturalist, Revd. Gilbert White, who was a pioneer of birdwatching. White is recognised as being the first ecologist or environmentalist. There's also a Grade I listed church that dates back to the late 12th century. From the village you head south west along the Zig-Zag path to the hill. Selborne Hill is one of the East Hampshire Hangers, a line of prominent hills on the eastern scarp slope of the Hampshire Downs. It stands at a height of 211 metres (692 ft) and is mostly covered with woodland. After reaching the hill summit the route bends round towards Coneycroft Hill before picking up a path along Selborne Hangar to return to the village. Here you can enjoy refreshments at the Selborne Arms pub which has a good selection of real ales and a decent menu too.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Selborne Arms for some post walk refreshment. The typical village pub is nicely located at the foot of the Zig Zag path carved by famous naturalist Gilbert White. The path gives its name to the annual Zig Zag Festival held in early October. There's a cosy interior with real fires and a lovely large garden area for warmer days. You can find the pub on the High Street at postcode GU34 3JR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The common is a fine place to take your dog for a walk so you'll probably see other owners on a nice day. Please keep them under control as there is quite a lot of wildlife about."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Hangers Way long distance trail passes through Selborne. You can pick up the trail and head south to visit the lovely Noar Hill Nature Reserve. If you head north it will take you through the South Downs to the town of Alton where you'll find the source of the River Wey. In nearby Bordon there's the Hogmoor Inclosure to explore. The area has lots of family activities with woodland walking and cycling paths plus a sculpture trail. To the east is the village of Liphook where you can enjoy a walk to the lakes on the pretty Foley Manor Estate before a climb to Weavers Down on the edge of the expansive Woolmer Forest.  For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/TY4D09vKS7o",
  "postcode": "GU34 3JX",
  "district": "East Hampshire",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Plum Fell Lane, Ketcher's Farm, Selborne, East Hampshire, Hampshire, England, GU34 3JX, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "natural landmarks"
  ],
  "facilities": [
    "pub/cafe",
    "church",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}