{
  "created_at": "2025-01-06T03:06:40.416331+00:00",
  "objectID": "5318c51af023726b0b079ed23eaa63a3",
  "ref": "middleton-lakes-walking-route",
  "title": "Middleton Lakes Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/28/Langley_Brook%2C_Middleton_Lakes_RSPB_Reserve_-_geograph.org.uk_-_1112231.jpg",
  "nearby": [
    {
      "description": "Kingsbury Water Park",
      "objectID": "6e4642b7ee83cd7c502f7229f8e106c1",
      "ref": "kingsbury-water-park-walking-and-cycle-route"
    },
    {
      "description": "Birmingham and Fazeley Canal",
      "objectID": "e7b7bf3a76db48ca4455b82ae9c01ba6",
      "ref": "birmingham-and-fazeley-canal-walking-and-cycle-route"
    },
    {
      "description": "Tamworth Canal Walk",
      "objectID": "f6fae35fd97f3ba03cb95ebb195c6795",
      "ref": "tamworth-canal-walk-walking-route"
    },
    {
      "description": "Hopwas Woods",
      "objectID": "0cb1f5b1b2c940656c99367e6abab393",
      "ref": "hopwas-woods-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5318c51af023726b0b079ed23eaa63a3.gpx",
  "_geoloc": {
    "lat": 52.582510547,
    "lng": -1.7138641413
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Langley_Brook%2C_Middleton_Lakes_RSPB_Reserve_-_geograph.org.uk_-_1112231.jpg",
      "title": "Graham Taylor / Langley Brook, Middleton Lakes RSPB Reserve, via Wikimedia Commons",
      "caption": "Langley Brook, Middleton Lakes RSPB Reserve. Looking west away from the reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Pool_at_Middleton_Lakes_Nature_Reserve_-_geograph.org.uk_-_1094570.jpg",
      "title": "Graham Taylor / Pool at Middleton Lakes Nature Reserve, via Wikimedia Commons",
      "caption": "Pool at Middleton Lakes Nature Reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Frozen_silt_lagoon%2C_Middleton_Lakes_RSPB_Reserve_-_geograph.org.uk_-_1112237.jpg",
      "title": "Graham Taylor / Frozen silt lagoon, Middleton Lakes RSPB Reserve, via Wikimedia Commons",
      "caption": "Frozen silt lagoon, Middleton Lakes RSPB Reserve. There are several of these lagoons in the area. The site was once gravel pits. Water from washing the gravel was fed into the lagoons for the silt to settle out of it before being returned to the nearby River Tame."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Culvert_on_Langley_Brook%2C_Middleton_Lakes_RSPB_Reserve_-_geograph.org.uk_-_1112254.jpg",
      "title": "Graham Taylor / Culvert on Langley Brook, Middleton Lakes RSPB Reserve, via Wikimedia Commons",
      "caption": "Culvert on Langley Brook"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Middleton_Hall_-_Walled_Garden_-_geograph.org.uk_-_836280.jpg",
      "title": "Graham Taylor / Middleton Hall - Walled Garden, via Wikimedia Commons",
      "caption": "Middleton Hall - Walled Garden. Looking north-east to small tower building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Middleton_Hall_01.jpg",
      "title": "Graham Taylor / Middleton Hall - West Front, via Wikimedia Commons",
      "caption": "Middleton Hall - West Front"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Middleton_Hall_-_Craft_Centre_-_geograph.org.uk_-_836349.jpg",
      "title": "Graham Taylor / Middleton Hall - Craft Centre, via Wikimedia Commons",
      "caption": "Middleton Hall - Craft Centre. The craft centre is located in the courtyard in the old stable buildings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Middleton_Hall_04.jpg",
      "title": "Graham Taylor / Middleton Hall - The Jettied Building, via Wikimedia Commons",
      "caption": "Middleton Hall - 16th-century jettied building, which was close to collapse before restoration commenced."
    }
  ],
  "distance_km": 4.0,
  "description": "This splendid RSPB nature reserve has several well laid out walking trails to try. It covers 400 acres with several lakes and pools, meadowland, a canal and the River Tame. There's lots of birdlife to look out for such as bittern, little egret, common pochard, tufted duck and smew. You may also see otters, butterflies, damselflies and dragonflies in whats is one of the best wildlife sites in the midlands. You start off at the car park at Middleton Hall. From here you can pick up the Woodland Trail which takes you past the heronry and the rookery to the Birmingham and Fazeley Canal. Here you link up with the reserve's other two trails. The Meadow Trail runs south along a high-level walkway running parallel to the canal. From the elevated position there are great views over the Southern Meadow towards the river. Look out for owls and Konik ponies along this trail. The other trail is the Wetland Trail which runs through the northern section of the reserve. This takes you past several lakes and reedbeds with lapwings and reed warblers to look out for. Along the Langley Brook you can also see Cuckoos and warblers in the spring months. To continue your walk you could head south along the Birmingham and Fazeley Canal and visit Kingsbury Water Park. Here you'll find 600 acres of country park with 15 lakes and miles of good cycling and walking trails to try. Middleton Lakes is located just south of Tamworth on the Staffordshire/Warwickshire border. You could try our Tamworth Canal Walk to explore the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "For some refreshments after your walk head to the Bake180 cafe. Set in a charming courtyard in the grounds of Middleton Hall the cafe does a good range of snacks and drinks with an outdoor seating area for warmer days. The historic old hall includes beautiful 18th century gardens and a pretty lake. There's also a Grade II* listed hall which dates back to medieval times."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome in the reserve but its probably best to keep them on leads for most of the walk due to the wildlife."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just east of Tamworth you'll find Pooley Country Park. The popular park includes canal trails, a series of pretty lakes, a hill top viewpoint and the historic ruins of a Benedictine priory. The cycling and walking trails around Hopwas Woods are also near the town. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/w7LKwivuZow",
  "county": "Warwickshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}