{
  "created_at": "2025-01-06T07:47:41.763696+00:00",
  "objectID": "5382e8aac3168bf32619fad7557341a5",
  "ref": "tattenhall-walking-route",
  "title": "Tattenhall Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Array_of_signs_in_Tattenhall_village_-_geograph.org.uk_-_2250486.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5382e8aac3168bf32619fad7557341a5.gpx",
  "_geoloc": {
    "lat": 53.1221993761,
    "lng": -2.7664053794
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Array_of_signs_in_Tattenhall_village_-_geograph.org.uk_-_2250486.jpg",
      "title": "Array of signs in Tattenhall village by Colin Pyle, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Array of signs in Tattenhall village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Tattenhall_Marina_-_geograph.org.uk_-_2352438.jpg/512px-Tattenhall_Marina_-_geograph.org.uk_-_2352438.jpg",
      "title": "Tattenhall Marina by Dave Dunford, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tattenhall Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Shropshire_Union_Canal_crossing_River_Gowy_-_geograph.org.uk_-_250957.jpg",
      "title": "Peter Styles, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Shropshire Union Canal crossing River Gowy. This is a small aqueduct where the Shropshire Union Canal crosses the River Gowy near Huxley in Cheshire. It can't be seen from the canal bank but is quite a fine example of a small but complex intersection of two different waterways."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/View_of_Beeston_Castle_from_Peckforton_Castle._-_geograph.org.uk_-_106233.jpg",
      "title": "Stephen Charles / View of Beeston Castle from Peckforton Castle., via Wikimedia Commons",
      "caption": "View of Beeston Castle from Peckforton Castle. Photo taken from the highest tower at Peckforton Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Beeston_Castle_-_geograph.org.uk_-_1566429.jpg",
      "title": "Eirian Evans / Beeston Castle, via Wikimedia Commons",
      "caption": "The medieval ruins of Beeston Castle stand on a rocky summit 500ft above the Cheshire plain, offering views from the Pennines in the east to the mountains of Wales in the west. It dates from 1225 when it was built by Ranulf, the sixth Earl of Chester, and contains one of the deepest castle wells in the country. It was seized by King Henry III in 1237 and used by him and later his son, King Edward I, as a base for their campaigns against the Welsh. The castle was finally destroyed at the end of the Civil War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Beeston_-_the_Sandstone_Trail_-_geograph.org.uk_-_804850.jpg",
      "title": "Mike Harris / Beeston - the Sandstone Trail",
      "caption": "Beeston - the Sandstone Trail. View along the Sandstone Trail (Beeston footpath 31) from its junction with bridleway 27 on Horsley Lane at the foot of the Peckforton Hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Tattenhall_-_orchard_beside_the_Eddisbury_Way_-_geograph.org.uk_-_804827.jpg",
      "title": "Mike Harris / Tattenhall - orchard beside the Eddisbury Way",
      "caption": "Tattenhall - orchard beside the Eddisbury Way. Orchard and wind break on the Eddisbury Way (Wood Lane) near Wood Farm. This type of scene is more typical of the hillsides near Kelsall further north. The conifer belts provide a wind break on the exposed Cheshire Plain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Statue_On_Millennium_Mile_-_geograph.org.uk_-_409909.jpg/256px-Statue_On_Millennium_Mile_-_geograph.org.uk_-_409909.jpg",
      "title": "Ian Bottomley / Statue On Millennium Mile",
      "caption": "Statue On Millennium Mile in the village."
    }
  ],
  "distance_km": 21.0,
  "description": "This Cheshire village is in a great location for exploring the Shropshire Union Canal and the woodland and countryside of the Cheshire Plain. The village is also home to the Ice Cream Farm, the largest ice cream shop in the world! This route uses sections of the Bishop Bennet Way, the Shropshire Union Canal, the Eddisbury Way, the Midshires Way and the Sandstone Trail to create a long walk around the village. On the way you'll visit some of the highlights of the area including Beeston Castle, Peckforton Castle and the Peckforton Hills. The walk starts in the village and head north along the Tattenhall Road to link with the Shropshire Union Canal near the Tattenhall Marina. Follow the towpath east from Crow's Next Bridge to Dutton's Bridge and the River Gowy Aqueduct. Here you can pick up the Eddisbury Way and follow the waymarked footpath south to Wood Lane. The route then heads east to visit Peckforton Castle where you'll find a 19th century manor house now used as a hotel. From here you then head north to climb to Beeston Castle. The 13th century castle is a popular spot with an interesting history and fine views from its elevated position. At Beeston you head south west to pick up the Sandstone Trail and follow it to Higher Budwarsley where you turn west to Budwarsley. The route then returns to the village, mainly on the same paths with a section along the Bishop Bennet Way near the end.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Letters Inn is a historic pub in the heart of the village. Inside there's a cosy roaring fire while outside there's a sun-trap terrace garden area. You can find them on the Hgh Street at postcode CH3 9PX."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails are ideal for dog walking. The Letters Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just north of the village you can visit the Ice Cream Farm. The popular tourist attraction includes the world's largest ice cream shop, expansive children's play areas, farm animals and quad bikes. You can find them at Drumlan Hall, Newton Ln, CH3 9NE. A few miles to the south there's another fine climb to Bickerton Hill and Maiden Castle. Just to the south east of Bickerton you'll find Cholmondeley where you can explore the 19th century Cholmondeley Castle. The castle is surrounded by 70 acres of beautiful parkland and gardens with an arboretum, herbaceous borders, lakes and a fine viewpoint to enjoy. Near here there's also the market town of Malpas with its timber framed properties and noteworthy 14th century church. To the west there's the interesting village of Farndon. The village includes a noteworthy medieval bridge which spans the River Dee, connecting England to Holt in Wales. The Bishop Bennet Way and the Marches Way run past the settlement. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/kEVRFn9yTjY",
  "postcode": "CH3 9QH",
  "district": "Tattenhall",
  "county": "Cheshire West and Chester",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lion House, Tattenhall Road, Tattenhall and District, Tattenhall, Cheshire West and Chester, England, CH3 9QH, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "canal",
    "pasture"
  ],
  "points_of_interest": [
    "historical sites",
    "castles",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}