{
  "created_at": "2025-01-06T04:03:55.325307+00:00",
  "objectID": "53957255d5fdc8c9682d20c40abd1889",
  "ref": "stonehenge-walking-route",
  "title": "Stonehenge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Stonehenge_back_wide.jpg/512px-Stonehenge_back_wide.jpg",
  "nearby": [
    {
      "description": "Amesbury to Stonehenge",
      "objectID": "ea6881bfd5309c13078d4bfbd1baff69",
      "ref": "amesbury-to-stonehenge-walking-route"
    },
    {
      "description": "Durrington Walls",
      "objectID": "1a5aa3ba3105f678863bfac2c5f439f3",
      "ref": "durrington-walls-walking-route"
    },
    {
      "description": "River Wylye Valley Walk",
      "objectID": "168515a9e440edc52d544a97324c3297",
      "ref": "wylye-way-walking-route"
    },
    {
      "description": "Grovely Wood",
      "objectID": "f6e6173ace676523d025d083c6b49e63",
      "ref": "grovely-wood-walking-and-cycle-route"
    },
    {
      "description": "Salisbury Country Way",
      "objectID": "370c75c971638497761c1433b15c84af",
      "ref": "salisbury-country-way-walking-route"
    },
    {
      "description": "Salisbury to Stonehenge Walk",
      "objectID": "bd3a841aa29394f090c2a31981c952be",
      "ref": "salisbury-to-stonehenge-walk-walking-route"
    },
    {
      "description": "Woodhenge to Stonehenge Walk",
      "objectID": "51b82aa3e53db7b2f0d6d5b690b99a28",
      "ref": "woodhenge-to-stonehenge-walk-walking-route"
    },
    {
      "description": "Amesbury River Walk",
      "objectID": "e34986ed528700723658f3734f63b337",
      "ref": "amesbury-river-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/53957255d5fdc8c9682d20c40abd1889.gpx",
  "_geoloc": {
    "lat": 51.1806967046,
    "lng": -1.8272747632
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Stonehenge_back_wide.jpg/512px-Stonehenge_back_wide.jpg",
      "title": "By Sara khan (Own work) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stonehenge back wide"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/The_Avenue%2C_Stonehenge.JPG/512px-The_Avenue%2C_Stonehenge.JPG",
      "title": "By Ashley Columbus (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The Avenue, Stonehenge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Stonehenge_-_geograph.org.uk_-_716795.jpg",
      "title": "Trevor Rickard / Stonehenge, via Wikimedia Commons",
      "caption": "This view was taken before they fenced the stones off in 1977. As can be seen, the erosion had a marked effect and compares poorly with the grassy surrounds of today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Sarsen_Stones_at_Stonehenge_-_geograph.org.uk_-_1627241.jpg/512px-Sarsen_Stones_at_Stonehenge_-_geograph.org.uk_-_1627241.jpg",
      "title": "Peter Trimming / Sarsen Stones at Stonehenge, via Wikimedia Commons",
      "caption": "Sarsen Stones at Stonehenge. A close view of these impressive standing stones, with the low winter sun bringing out the texture and colour."
    }
  ],
  "distance_km": 4.0,
  "description": "This circular walk visits the countryside and woodland around this famous historical site. It's an atmospheric and beautiful area with great views across the fields of Salisbury Plain. The route starts from the car park and visits the Avenue, a 1.5 mile long bank and ditch earthwork thought to be the ceremonial route and entrance to the stone circle. This leads to the Bronze Age burial mounds at King Barrow Ridge. This is a nice spot with ancient Beech trees and nice views across the area from the elevated position of the barrows. The walk also visits the fascinating Stonehenge Cursus. This large Neolithic cursus monument was constructed several hundred years before the earliest phase of Stonehenge in 3000 BC. To explore the Stonehenge site itself you will need to purchase a ticket from English Heritage. The area around the cursus is on open access land so can be visited for free. To extend your walking in the area you could pick up the Salisbury Country Way which passes the site. This long distance circular footpath explores the countryside around Salisbury, visiting several pretty villages and interesting historical sites. You could pick it up an head south east along the River Avon to Upper Woodford or south west across Normanton Down to Great Wishford where you can explore the River Wylye Valley and Grovely Wood. Around Normanton you can also explore the Woodford Valley which includes a visit to Great Durnford with its riverside mill and picture postcard thatched cottages. Also nearby is the Durrington Walls and Woodhenge walk. Durrington Walls is the largest complete henge in Great Britain while Woodhenge is a Neolithic Class II henge and timber circle. You could park at the public car park there and walk down to the site on an alternative route. See the Woodhenge to Stonehenge Walk for more details. If you are coming from nearby Amesbury then it's about a 2 mile walk from the town. See the Amesbury to Stonehenge Walk for full details. You can virtually explore the Stonehenge site using the google street view link below",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's some pretty villages with nice riverside pubs just to the south of Stonehenge where you could stop for refreshments after your walk. You could head to the Bridge Inn in Upper Woodford for example. The main attraction here is a lovely riverside garden where you can sit out and enjoy lunch with views of the River Avon. You can find it at postcode SP4 6NU.Also consider the 17th century Black Horse in nearby Great Durnford (postcode: SP4 6AY). There's another nice, large outdoor seating area for the summer months here. In Great Durnford you could also visit the interesting Norman Church and admire some delightful thatched cottages. The converted mill is also very picturesque with its riverside location and weeping willows."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can reach the site on foot by following public footpaths and country lanes from nearby Salisbury. See our Salisbury to Stonehenge Walk for full details. To visit another major ancient site pick up the Avebury to Stonehenge Walk which will take you north to vist the largest stone circle in Europe at Avebury. The walk mainly follows the Sarsen Way, a long distance trail running from Swindon to Salisbury Cathedral, visiting several historic sites along the way."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BTwuKCqFwJY",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Byway 12, Amesbury, Larkhill, Wiltshire, England, SP4 8NU, United Kingdom",
  "postcode": "SP4 8NU",
  "district": "Larkhill",
  "state": "England"
}