{
  "created_at": "2025-01-06T04:26:40.128620+00:00",
  "objectID": "53f88ca31024de9e5e7d956ab40354ec",
  "ref": "buckland-abbey-walking-route",
  "title": "Buckland Abbey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/45/Buckland_Abbey_-_geograph.org.uk_-_1057807.jpg",
  "nearby": [
    {
      "description": "Lopwell Dam",
      "objectID": "42b131dc6c3ceb2e411d3896080042c0",
      "ref": "lopwell-dam-walking-route"
    },
    {
      "description": "Tamar Valley Discovery Trail",
      "objectID": "ee55b9ee756d935ffaa037bca736c52b",
      "ref": "tamar-valley-discovery-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/53f88ca31024de9e5e7d956ab40354ec.gpx",
  "_geoloc": {
    "lat": 50.4821408862,
    "lng": -4.1341894481
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Buckland_Abbey_-_geograph.org.uk_-_1057807.jpg",
      "title": "Graham Taylor / Buckland Abbey",
      "caption": "The abbey on a beautiful spring day in 2007"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/River_Tavy%2C_Buckland_Abbey_Estate_-_geograph.org.uk_-_403002.jpg",
      "title": "Brian / River Tavy, Buckland Abbey Estate",
      "caption": "Buckland Abbey Estate. Looking down the River Tavy on a calm spring day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Buckland_Abbey%2C_The_Herb_Garden_-_geograph.org.uk_-_210993.jpg",
      "title": "Neil Kennedy / Buckland Abbey, The Herb Garden",
      "caption": "The Herb Garden. Taken from inside the barn. A cat can be seen through the arch on a lovely summer day in 2004"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Buckland_Abbey_%282%29_-_geograph.org.uk_-_1715877.jpg",
      "title": "Andrew Hackney / Buckland Abbey (2)",
      "caption": "A winter view of the grounds"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/The_Who%27d_Have_Thought_It_-_geograph.org.uk_-_513927.jpg",
      "title": "Tony Atkin / The Who'd Have Thought It",
      "caption": "The Who'd Have Thought It. This public house sits at the northern end of the village of Milton Combe, the building almost filling the narrow valley bottom. The pub sign proudly proclaims its 16th century origins. The road to the left of the building climbs very steeply out of the valley heading for Buckland Abbey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Sheep_Grazing_-_geograph.org.uk_-_89744.jpg",
      "title": "Tony Atkin / Sheep Grazing",
      "caption": "Sheep Grazing. This photograph was taken from nearby South Lodge of Buckland Abbey. It looks out eastwards over the valley which bisects this grid square from northeast to southwest."
    }
  ],
  "distance_km": 5.0,
  "description": "Explore the gardens and wider estate surrounding this 700 year old house in Dartmoor near Plymouth. There are a number of way-marked walking trails taking you through meadows, orchards and woodlands where you can enjoy far-reaching views of the Tavy Valley. This circular route starts at the abbey and takes you past the lovely gardens into Great North Wood and on to the River Tavy where you can follow the riverside path through more woodland. There's plenty of wildlife - look out for Badgers, bats, eels, hobbies, barn owls and deer as you make your way through the woods. The gardens include an Elizabethan Garden, Herb Garden, Cider House Garden and Kitchen Garden. They include hydrangeas, camellias, eucryphias, azaleas, rhododendrons and magnolia trees. In the spring months you can also see carpets of bluebells in the woods.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a good National Trust tea room on site, selling a good range of meals and snacks. If you ventured a short distance south there's also a waterside cafe at Lopwell Dam. Also to the south is the little village of Milton Combe where you'll find the wonderfully named Who'd Have Thought It pub. It's a charming 16th Century Inn with an excellent menu and a friendly welcome. Inside there's an attractive interior with real fires to warm yourself by in the winter months. Outside there's a pretty garden with a babbling brook for warmer days. You can find the inn at a postcode of PL20 6HP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The estate paths are great for a dog walk but please keep them on leads where there is livestock. The Who'd Have Thought It pub mentioned above is also very dog friendly. They even have a special menu for dogs!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head south and visit the splendid Lopwell Dam where there are some lovely waterside walks. The dam was a traditional river quay serving nearby mines and farmland, and used by the monks of Buckland Abbey centuries ago.The Tamar Valley Discovery Trail also passes through the area so you could pick up this waymarked trail too. The trail can be picked up just to the south of the estate and will take you along riverside footpaths on the Rivers Tavy and Tamar."
    }
  ],
  "video_url": "https://www.youtube.com/embed/oH6PQJUx9wE",
  "postcode": "PL20 6HF",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Cider House, Church Hill, Buckland Monachorum, Milton Combe, West Devon, Devon, England, PL20 6HF, United Kingdom",
  "district": "West Devon",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "meadows",
    "riverside"
  ],
  "points_of_interest": [
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}