{
  "created_at": "2025-01-06T02:55:06.773823+00:00",
  "objectID": "541407b70b694d90c2d45ed9b6dc76fb",
  "ref": "nantwich-walking-route",
  "title": "Nantwich Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Nantwich_Aqueduct%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_1324179.jpg",
  "nearby": [
    {
      "description": "Shropshire Union Canal",
      "objectID": "d286ea892666d94e0e1ac40b769ac8f3",
      "ref": "shropshire-union-canal-walking-route"
    },
    {
      "description": "South Cheshire Way",
      "objectID": "22d317eab6b759964c1bbf210b20a772",
      "ref": "south-cheshire-way-walking-route"
    },
    {
      "description": "Chester Canal Walk",
      "objectID": "dc9463ca2d01f9b300a0c5e99282961a",
      "ref": "chester-canal-walk-walking-route"
    },
    {
      "description": "Crewe and Nantwich Circular Walk",
      "objectID": "f03e9888b642c0e5120f44a24b72818a",
      "ref": "crewe-and-nantwich-circular-walk-walking-route"
    },
    {
      "description": "Beeston Castle",
      "objectID": "827ea03a10bca37ada8a981f94f7a5bd",
      "ref": "beeston-castle-walking-route"
    },
    {
      "description": "Hurleston Reservoir",
      "objectID": "3d95a7f96e064b8b40d20fc22579734f",
      "ref": "hurleston-reservoir-walking-route"
    },
    {
      "description": "Wrenbury",
      "objectID": "dd81bbe44f7a23e65a54efe7b01e7972",
      "ref": "wrenbury-walking-route"
    },
    {
      "description": "Nantwich Riverside Loop",
      "objectID": "4167c953c03db88d4eb9bf507fcea998",
      "ref": "nantwich-riverside-loop-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/541407b70b694d90c2d45ed9b6dc76fb.gpx",
  "_geoloc": {
    "lat": 53.0686493376,
    "lng": -2.5356937386
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Nantwich_Aqueduct%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_1324179.jpg",
      "title": "Roger Kidd / Nantwich Aqueduct, Shropshire Union Canal, Cheshire",
      "caption": "Nantwich Aqueduct, Shropshire Union Canal, Cheshire. This aqueduct owes its existence to the refusal of the owner of Dorfield Park in the 1820s to allow the canal from the south to cross his land to the existing Nantwich Basin. That meant the construction of a long high embankment round the park and this cast iron aqueduct over the main road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Nantwich_Junction_Bridge%2C_Shropshire_Union_Canal_-_geograph.org.uk_-_701898.jpg",
      "title": "Espresso Addict / Nantwich Junction Bridge, Shropshire Union Canal",
      "caption": "Nantwich Junction Bridge, Shropshire Union Canal. Footbridge over the Shropshire Union Canal at the point where Basin End (Nantwich Marina) diverges from the canal, built c.1826 with Thomas Telford as consultant. The bridge and associated milepost (left) and lockgate (right) are all listed at grade II. The 'Nantwich Horse' sculpture stands adjacent to the bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Sculpture_Plaque%2C_Shropshire_Union_Canal%2C_Nantwich_-_geograph.org.uk_-_578498.jpg",
      "title": "Roger Kidd / Sculpture Plaque, Shropshire Union Canal, Nantwich",
      "caption": "Sculpture Plaque, Shropshire Union Canal, Nantwich. Apart from the horse constructed from recovered material from old lock gates, there are several smaller wooden sculptures by local students, accompanied by children's poetry - all spaced along the Nantwich Embankment, which was restored in 2006. They are all detailed on this plaque by the canal side. Alas, the smaller pieces are not weathering too well."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Henhull_-_Canalside_Horse_Sculpture.jpg",
      "title": "Roger Kidd / Canalside Horse Sculpture, by Nantwich Basin, Cheshire",
      "caption": "Canalside Horse Sculpture, by Nantwich Basin, Cheshire The sculpture, in wood and iron is by John Merrill and Julian Taylor. It was made from material salvaged from old lock gates! It is one of several sculptures celebrating the restoration work carried out to the Nantwich Embankment. The others are smaller, and were made by Nantwich students. Unfortunately they are already looking a little worse for wear. Some attractive children's poetry accompanies each work of art. A plaque detailing the works can be seen fifty metres south-east of the horse sculpture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Shropshire_Union_Canal_near_Nantwich%2C_Cheshire_-_geograph.org.uk_-_1691993.jpg",
      "title": "Roger Kidd / Shropshire Union Canal near Nantwich, Cheshire",
      "caption": "South-west of Nantwich the canal approaches Baddington Bridge (No 88), which carries the A530 between Nantwich and Whitchurch"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Nantwich_Basin%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_578463.jpg",
      "title": "Roger Kidd / Nantwich Basin, Shropshire Union Canal, Cheshire",
      "caption": "Nantwich Basin, Shropshire Union Canal, Cheshire. The older and wider Chester Canal had its terminus here and was joined by Telford's Birmingham and Liverpool Junction Canal, eventually merging to form the Shropshire Union Canal. The arm is only two hundred metres long and is used by boat yards and a club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Canal_boats_by_Wrenbury_-_geograph.org.uk_-_186794.jpg",
      "title": "Espresso Addict / Canal boats by Wrenbury",
      "caption": "Canal boats by Wrenbury. Gaily painted ranks of canal boats park for the night just south of Wrenbury on the Shropshire Union Canal, during the summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Hurleston_Reservoir_-_geograph.org.uk_-_853528.jpg",
      "title": "Espresso Addict / Hurleston Reservoir",
      "caption": "Hurleston Reservoir. View from beside the inlet from the Llangollen branch of the Shropshire Union."
    }
  ],
  "distance_km": 24.0,
  "description": "Nantwich is located in Cheshire, next to two branches of the Shropshire Union Canal. It's an attractive market town with one of the county's largest collections of historic buildings. Before heading to the canal you can admire the fine Tudor and Georgian architecture. There is also the Grade I listed St Mary Church which dates from the 14th century. This circular walk takes you along the main branch of the Shropshire Union Canal and the Llangollen Branch, which runs a little further to the west of the town. It first heads towards Audlem on the main branch before cutting across the countryside to meet up with the Llangollen Branch. Start the walk about half a mile west of the town centre. This area includes the Nantwich Canal Centre where you'll find the historic marina and boatyard. There's also the lovely canal basin, some fine wooden sculptures and good facilities with a cafe, toilets and a shop. From here you can pick up the towpath and follow it south towards Baddington and Hankelow. At Austin's Bridge you leave the canal and pick up the South Cheshire Way. Follow the waymarked trail west through the countryside towards Broomhall Green, Aston and Wrenbury. Here you pick up the Llangollen Branch and follow it north to Hurleston where you pass a small reservoir. You also pick up the main branch again here and follow it south back into Nantwich, passing Acton and Burford on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Leopard is a nice place to go for some refreshments after your walk. The 19th century pub does very good food and has a lovely beer garden to relax in on warmer days. You can find it in the town centre on London Road at a postcode of CW5 6LJ for your sat navs. At the start of the route you'll pass the Nantwich Canal centre where you can visit the Waterside Cafe. The cafe is in a splendid location right next to the canal so you can enjoy your lunch outside and watch the boats go by. It's located on Chester Road at postcode CW5 8LB. On the route in Wrenbury there's the Dusty Miller to try. They have a lovely garden area next to the canal so you can sit outside and enjoy a fine meal with views over the water. The pub is located in a 19th century converted corn mill with many of the original features retained. You can find them on the Cholmondeley Road at a postcode of CW5 8HG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The towpath is a lovely place to take your dog for an easy walk. The Waterside Cafe mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your waterside walking try the Chester Canal Walk which runs for about 20 miles to Chester, passing Tiverton, Beeston Castle, Christleton and Waverton. You can also pick up the waymarked Crewe and Nantwich Circular Walk. The waymarked long distance trail explores the countryside and villages surrounding neighbouring Crewe. For a waterside circular walk in the town see the Nantwich Riverside Loop. This waymarked trail explores the western side of the town, visiting the River Weaver and the Shropshire Union Canal. Other highlights on the walk include the pretty Nantwich Lake, the 1803 Nantwich Bridge and the splendid 19th century Nantwich Aqueduct. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "district": "Nantwich",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Taylor Drive, Millfields, Nantwich, Cheshire East, England, CW5 5GH, United Kingdom",
  "postcode": "CW5 5GH",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "countryside"
  ],
  "points_of_interest": [
    "historic buildings",
    "church",
    "countryside trails"
  ],
  "facilities": [
    "cafe",
    "toilets",
    "shop",
    "boatyard"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}