{
  "objectID": "544a0e54f113cb0580e8c889e13c32e0",
  "created_at": "2024-12-18T01:47:29.420935+00:00",
  "ref": "burnham-beeches-walking-and-cycle-route",
  "title": "Burnham Beeches Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/89/Burnham_Beeches_-_geograph.org.uk_-_18931.jpg",
  "nearby": [
    {
      "description": "Cliveden House",
      "objectID": "985fb8ce79be69d07f91387902469052",
      "ref": "cliveden-house-walking-route"
    },
    {
      "description": "Cookham River Circular Walk",
      "objectID": "0e88074a434d981b3f92c221a22878d7",
      "ref": "cookham-river-circular-walk-walking-route"
    },
    {
      "description": "Langley Park Country Park",
      "objectID": "909efeb338e2d84e78685094cddc78d9",
      "ref": "langley-park-country-park-walking-and-cycle-route"
    },
    {
      "description": "Black Park Country Park",
      "objectID": "0150a626eeb575c2ab8898287be32000",
      "ref": "black-park-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/7EA1054708A82F708025804C0076098C/$FILE/Burnham Beeches.gpx",
  "_geoloc": {
    "lat": 51.5563019712,
    "lng": -0.6205589265
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Burnham_Beeches_-_geograph.org.uk_-_18931.jpg",
      "title": "David Hawgood / Burnham Beeches, via Wikimedia Commons",
      "caption": "Burnham Beeches Woodland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Burnham_Beeches%2C_Middle_Pond_-_geograph.org.uk_-_1046503.jpg",
      "title": "Nigel Cox / Burnham Beeches: Middle Pond, via Wikimedia Commons",
      "caption": "Middle Pond. This pond and the Upper Pond are both man-made having been created by damming across a small stream that flows south-westwards out of the woodland of Burnham Beeches."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Burnham_Beeches%2C_Druids_Oak_-_geograph.org.uk_-_1046492.jpg",
      "title": "Nigel Cox / Burnham Beeches: Druids Oak, via Wikimedia Commons",
      "caption": "The Druids Oak. This is considered to be the oldest living tree in Burnham Beeches, a pollarded oak that is probably at least 800 hundred years old. It was probably named during the penchant for naming things in Victorian times and old photographs from this era reveal that its overall shape has not changed greatly in the last hundred years or more. It can be found on the south-east side of the Lord Mayors Drive, so named because the City of London own and manage the woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Burnham_Beeches%2C_Victoria_Drive_-_geograph.org.uk_-_1046759.jpg",
      "title": "Nigel Cox / Burnham Beeches: Victoria Drive, via Wikimedia Commons",
      "caption": "Victoria Drive. The Corporation of London purchased Burnham Beeches in 1880, so this drive was probably named after Queen Victoria. Like most of the drives in the woodland there is an asphalted surface beneath the layer of fallen autumn leaves."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Burnham_Beeches_-_geograph.org.uk_-_1046462.jpg",
      "title": "Nigel Cox / Burnham Beeches, via Wikimedia Commons",
      "caption": "This massive old tree stump is about 12 feet high and must be the remains of an old tree that thrived here several hundreds of years ago. It can be found just to the east of Middle Pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Upper_Pond%2C_Burnham_Beeches_-_geograph.org.uk_-_591146.jpg",
      "title": "Ray Stanton / Upper Pond, Burnham Beeches, via Wikimedia Commons",
      "caption": "Upper Pond. In the autumn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Tea_Room_at_Burnham_Beeches_-_geograph.org.uk_-_1464268.jpg",
      "title": "Tim S Addison / Tea Room at Burnham Beeches, via Wikimedia Commons",
      "caption": "Tea room and visitor centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/British_White_cattle_for_conservation_grazing%2C_Burnham_Beeches_-_geograph.org.uk_-_825519.jpg",
      "title": "David Hawgood / British White cattle for conservation grazing, Burnham Beeches, via Wikimedia Commons",
      "caption": "British White cattle for conservation grazing. The area was historically grazed by a variety of commoners' livestock. With these removed areas became much more overgrown, changing the vegetation. To get it closer to its former condition, grazing animals have been introduced."
    }
  ],
  "distance_km": 2.5,
  "description": "This hugely popular National Nature Reserve and woods has miles of good walking trails to try. The area consists mostly of beech woodland with lots of peaceful footpaths to follow. There's also ponds, streams, grassland and heathland with over 500 acres to explore. The reserve is great for wildlife too. Look out for Exmoor Ponies, Berkshire Pigs, Jacob Sheep and grazing cattle. Facilities are very good with a car park off Lord Mayors Drive and a nice cafe. Burnham Beeches proximity to London and the beauty of the area attracts over half a million visitors per year. It has been used as a film location for Robin Hood, Prince of Thieves and Harry Potter and the Deathly Hallows - Part 1. Please note this circular route is devised for walkers but cyclists can enjoy a network of tarmac surfaced roads, the majority of which are closed to cars. Please note off road cycling is not permitted in the reserve. If you'd like to extend your outing then you can pick up the Beeches Way which runs through the reserve. If you head east you'll come to Farnham Common and Stoke Common where you'll find attractive Gorse and Heather heathland. If you follow the trail west it will take you to Cookham and the delightful Cliveden House . The Italianate mansion is surrounded by beautiful parkland and gardens with miles of walking trails and views of the River Thames.",
  "video_url": "https://www.youtube.com/embed/_qonXljbha0",
  "district": "Farnham Common",
  "county": "Buckinghamshire",
  "region": "South East",
  "country": "England"
}