{
  "created_at": "2025-01-05T23:41:16.049190+00:00",
  "objectID": "5482a31ed38fc6275f3c1d69e42b7f41",
  "ref": "snowshill-walking-route",
  "title": "Snowshill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Snowshill_Arms%2C_Snowshill%2C_Gloucestershire-geograph-3190628.jpg",
  "nearby": [
    {
      "description": "Broadway Tower Country Park",
      "objectID": "b9acdea928e2266362f5e6be812ee5e8",
      "ref": "broadway-tower-country-park-walking-and-cycle-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Stanton",
      "objectID": "f038622e453b6ded31662f971f73104f",
      "ref": "stanton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5482a31ed38fc6275f3c1d69e42b7f41.gpx",
  "_geoloc": {
    "lat": 52.0020353962,
    "lng": -1.8606219666
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Snowshill_Arms%2C_Snowshill%2C_Gloucestershire-geograph-3190628.jpg",
      "title": "Graham Horn / Snowshill Arms",
      "caption": "Snowshill Arms. The whole village seems to be a cohesive whole, with this fine stone pub lying opposite the church behind me."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/War_Memorial%2C_Snowshill_-_geograph.org.uk_-_155597.jpg",
      "title": "Philip Halling / War Memorial, Snowshill",
      "caption": "War Memorial, Snowshill. The war memorial in is situated in the churchyard with a series of quaint old stone cottages in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Snowshill_Manor_Gardens_-_geograph.org.uk_-_1567072.jpg/256px-Snowshill_Manor_Gardens_-_geograph.org.uk_-_1567072.jpg",
      "title": "Derek Harper / Snowshill Manor Gardens",
      "caption": "Snowshill Manor Gardens. A view from a terrace beside the Priest's House across the pool to one of the garden houses beside the Well Court.The photo was taken in October 2009 with lovely autumn leaves on the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Gateposts%2C_Snowshill_Manor_-_geograph.org.uk_-_1567307.jpg",
      "title": "Derek Harper / Gateposts, Snowshill Manor",
      "caption": "Gateposts, Snowshill Manor. Visitors enter the manor gardens through these gates, painted Wade blue; the house is to the left of the camera. The gateposts date from around 1720 and are listed. Behind the hedge and across the village street are the 17th century Manor Farm Cottages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Snowshill_Manor_-_geograph.org.uk_-_925247.jpg",
      "title": "David M Jones / Snowshill Manor",
      "caption": "Visitors entering Snowshill Manor. The manor was once owned by Catherine Parr. In the 20c was the home of Charles Paget Wade and houses his very extensive collection of \"good creaftsmanship\" from around the world."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Model_cottages_at_Snowshill_Manor_-_geograph.org.uk_-_1567031.jpg/256px-Model_cottages_at_Snowshill_Manor_-_geograph.org.uk_-_1567031.jpg",
      "title": "Derek Harper / Model cottages at Snowshill Manor",
      "caption": "Model cottages at the manor. Part of the model village created by Charles Paget Wade, now housed in one of the garden houses beside the Well Court."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Church_of_St_Barnabas_at_Snowshill_-_geograph.org.uk_-_846778.jpg",
      "title": "Roger Davies / Church of St Barnabas at Snowshill",
      "caption": "Church of St Barnabas. The church is entirely Victorian, the work of an unknown architect in 1864. It includes a bell, cast around 1350-1380 in Bristol. At the west end of the nave is a beautifully carved octagonal font, dated to the late 15th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Beeches_by_Littleworth_Wood_-_geograph.org.uk_-_1545905.jpg",
      "title": "Jonathan Billinger / Beeches by Littleworth Wood",
      "caption": "Beeches by Littleworth Wood, located just to the west of the village. The lane leads to Laverton Hill Barn."
    }
  ],
  "distance_km": 6.0,
  "description": "This circular walk around the village of Snowshill makes use of the Cotswold Way long distance footpath to explore the surrounding countryside. The village is delightful with typical Cotswold cottages surrounded by lovely rolling hills. It also contains the wonderful Snowshill Manor, owned by the National Trust. This 16th century manor house contains an extensive collection of various objects collated by the architect and poet Charles Paget Wade. These include 26 suits of Japanese samurai armour, bicycles, toys and musical instruments. You can also stroll around the delightful gardens with pretty terraces and ponds. This 3.5 mile walk takes you into the wider countryside around the village, visiting Littleworth Wood and Buckland Wood on the way. If you would like to extend your walk you could continue along the Cotswold Way to the nearby village of Broadway and visit the splendid Broadway Tower Country Park .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Snowshill Arms for some refreshments after your walk. The traditional village pub dates back to the 15th Century and includes a skittle alley to the rear. They serve good food and also have a decent selection of local ales. Outside there's a lovely large garden area to relax in on warmer days. You can find them at postcode WR12 7JU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make it a fine one to do with your dog. The Snowshill Arms mentioned above is also dog friendly. Dogs are not allowed inside the manor house though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around the village head west on the Cotswold Way to visit Shenberrow Hill and the neighbouring village of Stanton. From here you could continue south along the waymarked trail and visit Stanway House. The Jacobean manor house, was originally constructed in the late 16th and early 17th century for the Tracy family. It is designated as a Grade I listed building. Stanton is also well worth exploring too. It's generally considered to be one of the loveliest Cotswolds villages and includes a Norman church, a fine 17th century pub and several ancient houses built from the honey coloured limestone quarried from the nearby Shenberrow Hill. The Donnington Way - Cotswolds Pub Walk passes through the village. The long circular walk visits 15 fine old Donnington Brewery pubs in the Cotswolds. For more walking ideas in the area see the Cotswolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iVTaOO-A4uw",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Snowshill, Tewkesbury, Gloucestershire, England, WR12 7JX, United Kingdom",
  "postcode": "WR12 7JX",
  "district": "Tewkesbury",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "country park"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}