{
    "objectID": "54fbf6cc4354126b4c27b1e2463fa925",
    "created_at": "2024-12-21T16:54:48.039837+00:00",
    "ref": "ballycastle-fair-head-walk",
    "title": "Ballycastle Fair Head Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Fair_Head_-_Ballycastle%2C_Northern_Ireland%2C_UK_-_August_15%2C_2017_03.jpg/512px-Fair_Head_-_Ballycastle%2C_Northern_Ireland%2C_UK_-_August_15%2C_2017_03.jpg",
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/300AA2C1D53F826086258B030040F09D/$FILE/Ballycastle Fair Head Walk.gpx",
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Fair_Head_-_Ballycastle%2C_Northern_Ireland%2C_UK_-_August_15%2C_2017_03.jpg/512px-Fair_Head_-_Ballycastle%2C_Northern_Ireland%2C_UK_-_August_15%2C_2017_03.jpg",
            "title": "Giorgio Galeotti, CC BY 4.0 <https://creativecommons.org/licenses/by/4.0>, via Wikimedia Commons",
            "caption": "Fair Head boasts a sheer and vertical dolerite rock face towering 100 metres (330 ft) high, characterised by distinctive vertical columns resembling organ pipes. These formations were created approximately 60 million years ago when a sill of igneous rock was injected between horizontal Carboniferous sediments.\nRenowned as one of the premier traditional climbing and bouldering destinations in the British Isles and Ireland, Fair Head offers extensive opportunities for climbers. It ranks among the largest expanses of climbable rock in Northwest Europe and features a vast array of extreme-graded routes, making it a sought-after destination for climbers and adventurers alike."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Rathlin_Island_-_Fair_Head%2C_Ballycastle%2C_Northern_Ireland%2C_UK_-_August_15%2C_2017.jpg/512px-Rathlin_Island_-_Fair_Head%2C_Ballycastle%2C_Northern_Ireland%2C_UK_-_August_15%2C_2017.jpg",
            "title": "Giorgio Galeotti, CC BY 4.0 <https://creativecommons.org/licenses/by/4.0>, via Wikimedia Commons",
            "caption": "Rathlin Island from Fair Head."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Fair_Head_-_geograph.org.uk_-_465051.jpg",
            "title": "Anne Burgess / Fair Head",
            "caption": "There is a rough path through this wilderness of boulder scree to the bottom of the Grey Man's Path, a steep scramble to the top of Fair Head, and to Murlough Bay beyond. Fair Head's headland towers 200 metres (660 ft) above the sea, stretching for more than 5 kilometres (3.1 mi). The dolerite rock formations rise over 100 metres (330 ft) high at certain points along the coast. Below the cliff's edge, wild goats roam among the rocks, while The Grey Man's Path, a scenic walkway, winds its way along the rugged coastline."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Lough_na_Cranagh_-_geograph.org.uk_-_471158.jpg",
            "title": "Anne Burgess / Lough na Cranagh",
            "caption": "Lough na Cranagh. From the road atop the cliff, visitors can observe a human-made island dating back to the Iron Age, known as a crannóg, situated in the midst of Lough na Cranagh. These lakes are stocked with trout and offer fishing opportunities during the summer months."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Fair_Head_or_Benmore_from_near_Ballycastle_-_geograph.org.uk_-_3730747.jpg/512px-Fair_Head_or_Benmore_from_near_Ballycastle_-_geograph.org.uk_-_3730747.jpg",
            "title": "Fair Head or Benmore from near Ballycastle by Eric Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Fair Head or Benmore from near Ballycastle"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Cottages%2C_Coolnalough_%283%29_-_geograph.org.uk_-_1943486.jpg",
            "title": "Cottages, Coolnalough (3) by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Cottages, Coolnalough"
        }
    ],
    "distance_km": 5.0,
    "description": "This circular walk visits the wonderful cliff tops at Fair Head near Ballycastle in County Antrim. You can start the walk from the car park at the farm, just to the south of the headland. Head north and the footpaths will take you past Lough na Cranagh to the cliff tops where you can enjoy great views out to Rathlin Island. You can then loop round on the country lanes to return to the car park. If you head east along the coast you could also visit Torr Head . The scenic area is notable as the closest point in Northern Ireland to Scotland, with only 12 miles separating them across the Irish Sea. To continue your walking in the area head south east to visit Ballypatrick Forest . There's miles of peaceful woodland trails, a series of small ponds and nice views of the Glenmakeeran River here. To the west there's the Causeway Coast's Carrick-a-Rede where there's more cliff top paths and views to the Scottish Islands. Please scroll down for the full list of walks near and around Ballycastle. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
    "video_url": "https://www.youtube.com/embed/Gz6fcypkHX0?si=rV9hOrBw8m3Iww7w"
}
