{
    "objectID": "54fdfb4623ade52a13726244b840d239",
    "created_at": "2024-12-21T15:11:34.509594+00:00",
    "ref": "ceredigion-coast-path-walking-route",
    "title": "Ceredigion Coast Path Walking Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/A_precipitous_section_of_the_Ceredigion_Coastal_Path_-_geograph.org.uk_-_1168010.jpg",
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/A_precipitous_section_of_the_Ceredigion_Coastal_Path_-_geograph.org.uk_-_1168010.jpg",
            "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
            "caption": "A precipitous section of the Ceredigion Coastal Path. Approaching the highest point of the path between Clarach Bay and Wallog."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Coastal_path_north_from_Constitution_Hill_-_geograph.org.uk_-_924473.jpg",
            "title": "Andrew Hill / Coastal path north from Constitution Hill, via Wikimedia Commons",
            "caption": "Coastal path north from Constitution Hill. Overlooking Clarach Bay."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Cwmtydu_Beach_-_geograph.org.uk_-_181013.jpg",
            "title": "Cered / Cwmtydu Beach, via Wikimedia Commons",
            "caption": "Cwmtydu Beach. Cwmtydu Beach is a secluded little bay that was once renowned for smugglers and pirates with its many hidden little caves and coves. Sion Cwilt was one such smuggler who used this bay. On the sea front stands a limekiln that has been restored in recent years, a memory of time gone by. During WW1 a U-boat commander came ashore to gather fresh supplies for his crew. But now the only landings on the beach are that of Atlantic Grey Seals who come in shore to give birth to their pups during the autumn season."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Lagoon_by_the_Leri_-_geograph.org.uk_-_1144551.jpg",
            "title": "Chris Denny / Lagoon by the Leri, via Wikimedia Commons",
            "caption": "Lagoon by the Leri"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Path_to_Llangrannog_-_geograph.org.uk_-_1753613.jpg/512px-Path_to_Llangrannog_-_geograph.org.uk_-_1753613.jpg",
            "title": "Anthony Parkes / Path to Llangrannog, via Wikimedia Commons",
            "caption": "Clifftop path leading to Llangrannog from Ynys-Lochtyn. Just north of here you will pass the beautiful secluded cove at Cwmtydu. The beach is a great place to look out for seals during September and October."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Aberporth_Beach_-_geograph.org.uk_-_54194.jpg",
            "title": "Cered / Aberporth Beach",
            "caption": "Aberporth Beach and West side of Village on the Cardigan Bay coast."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Llanrhystud%2C_Ceredigion.jpg",
            "title": "John Fielding / Llanrhystud",
            "caption": "Llanrhystud, Ceredigion. Village and church from the bridleway to Castell-bach.  In the village the rivers Carrog, Wyre and Wyre Fach meet before flowing into the sea. There's also a fine windsurfing beach and a panoramic view of Cardigan Bay."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Dunes_at_Ynyslas_-_geograph.org.uk_-_7876.jpg",
            "title": "Noel Jenkins / Dunes at Ynyslas",
            "caption": "Dunes at Ynyslas. Near Borth and Aberdovey you will pass the Dyfi National Nature Reserve which is well worth a small detour to explore."
        }
    ],
    "distance_km": 100.0,
    "description": "This walk follows the beautiful coastline of Ceredigion from Cardigan to Borth. The walk is waymarked with a coast and sea logo. The route passes New Quay, Llangrannog, Aberporth , Mwnt , Aberaeron and Aberystwyth. The path includes the dune system at Ynys-las, high cliffs, storm beaches, sandy bays and sea caves. Four sections of the path are designated as Heritage Coast whilst two areas within Cardigan Bay are Marine Special Areas of Conservation. The route also includes the highest numbers of dolphin sightings in the UK  - see the video below for more details. Around Aberaeron there's the option of taking a detour inland along the River Aeron to visit the National Trust's Llanerchaeron . The Grade I listed mansion has some nice trails to follow through the attractive estate. This area also has strong connections with the authour Dylan Thomas who lived in nearby New Quay. Around here you can pick up the Dylan Thomas trail which visits a number of local places associated with the poet."
}
