{
  "created_at": "2025-01-06T05:00:29.264268+00:00",
  "objectID": "54fdfb4623ade52a13726244b840d239",
  "ref": "ceredigion-coast-path-walking-route",
  "title": "Ceredigion Coast Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/A_precipitous_section_of_the_Ceredigion_Coastal_Path_-_geograph.org.uk_-_1168010.jpg",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/A_precipitous_section_of_the_Ceredigion_Coastal_Path_-_geograph.org.uk_-_1168010.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A precipitous section of the Ceredigion Coastal Path. Approaching the highest point of the path between Clarach Bay and Wallog."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Coastal_path_north_from_Constitution_Hill_-_geograph.org.uk_-_924473.jpg",
      "title": "Andrew Hill / Coastal path north from Constitution Hill, via Wikimedia Commons",
      "caption": "Coastal path north from Constitution Hill. Overlooking Clarach Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Cwmtydu_Beach_-_geograph.org.uk_-_181013.jpg",
      "title": "Cered / Cwmtydu Beach, via Wikimedia Commons",
      "caption": "Cwmtydu Beach. Cwmtydu Beach is a secluded little bay that was once renowned for smugglers and pirates with its many hidden little caves and coves. Sion Cwilt was one such smuggler who used this bay. On the sea front stands a limekiln that has been restored in recent years, a memory of time gone by. During WW1 a U-boat commander came ashore to gather fresh supplies for his crew. But now the only landings on the beach are that of Atlantic Grey Seals who come in shore to give birth to their pups during the autumn season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Lagoon_by_the_Leri_-_geograph.org.uk_-_1144551.jpg",
      "title": "Chris Denny / Lagoon by the Leri, via Wikimedia Commons",
      "caption": "Lagoon by the Leri"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Path_to_Llangrannog_-_geograph.org.uk_-_1753613.jpg/512px-Path_to_Llangrannog_-_geograph.org.uk_-_1753613.jpg",
      "title": "Anthony Parkes / Path to Llangrannog, via Wikimedia Commons",
      "caption": "Clifftop path leading to Llangrannog from Ynys-Lochtyn. Just north of here you will pass the beautiful secluded cove at Cwmtydu. The beach is a great place to look out for seals during September and October."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Aberporth_Beach_-_geograph.org.uk_-_54194.jpg",
      "title": "Cered / Aberporth Beach",
      "caption": "Aberporth Beach and West side of Village on the Cardigan Bay coast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Llanrhystud%2C_Ceredigion.jpg",
      "title": "John Fielding / Llanrhystud",
      "caption": "Llanrhystud, Ceredigion. Village and church from the bridleway to Castell-bach. In the village the rivers Carrog, Wyre and Wyre Fach meet before flowing into the sea. There's also a fine windsurfing beach and a panoramic view of Cardigan Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Dunes_at_Ynyslas_-_geograph.org.uk_-_7876.jpg",
      "title": "Noel Jenkins / Dunes at Ynyslas",
      "caption": "Dunes at Ynyslas. Near Borth and Aberdovey you will pass the Dyfi National Nature Reserve which is well worth a small detour to explore."
    }
  ],
  "distance_km": 100.0,
  "description": "This walk follows the beautiful coastline of Ceredigion from Cardigan to Borth. The walk is waymarked with a coast and sea logo. The route passes New Quay, Llangrannog, Aberporth, Mwnt, Aberaeron and Aberystwyth. The path includes the dune system at Ynys-las, high cliffs, storm beaches, sandy bays and sea caves. Four sections of the path are designated as Heritage Coast whilst two areas within Cardigan Bay are Marine Special Areas of Conservation. The route also includes the highest numbers of dolphin sightings in the UK - see the video below for more details. Around Aberaeron there's the option of taking a detour inland along the River Aeron to visit the National Trust's Llanerchaeron. The Grade I listed mansion has some nice trails to follow through the attractive estate. This area also has strong connections with the authour Dylan Thomas who lived in nearby New Quay. Around here you can pick up the Dylan Thomas trail which visits a number of local places associated with the poet.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop at the The Glengower in Aberystwyth for some refreshments. The hotel is in a great location on the sea front with nice views and an outdoor seating area for the warmer months. You can find it at 3 Victoria Terrace, Aberystwyth SY23 2DH. In the pretty village of Aberporth you'll find the Ship Inn. The inn includes a traditional bar and dining rooms with views overlooking the sea. It's a great spot to enjoy some delicous sea food. You can find the inn at a postcode of SA43 2DB for your sat navs. It's also dog friendly if you have your canine friend with you. The Cliff Hotel is in a splendid cliff top location in the little village of Gwbert near St Dogmaels. It has some of the most breathtaking views in Wales, overlooking Cardigan Bay, a rugged coastline, the Teifi Estuary and the broad sweep of Poppit Sands. You can find them at postcode SA43 1PP."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can link up with the Borth to Ynyslas Coastal Path which will take you north along Borth Sands to visit Ynyslas and the Dyfi National Nature Reserve. There's some splendid high sand dunes to explore in the wildlife rich reserve. You can also enjoy lovely views over the Dyfi Estuary to Aberdovey on the opposite side. The reserve is located just off the trail, to the north of Borth."
    }
  ],
  "gazetteer_found": false,
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/54fdfb4623ade52a13726244b840d239.gpx",
  "_geoloc": {
    "lat": 52.0813034547,
    "lng": -4.6612990682
  },
  "nominatim_found": true,
  "display_address": "The Grosvenor, Heol y Bont / Bridge Street, Cardigan, Aberteifi / Cardigan, Ceredigion, Cymru / Wales, SA43 1HY, United Kingdom",
  "postcode": "SA43 1HY",
  "district": "Aberteifi / Cardigan",
  "county": "Ceredigion",
  "region": null,
  "state": "Cymru / Wales",
  "country": "United Kingdom",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "dune system",
    "cliff"
  ],
  "points_of_interest": [
    "historical sites",
    "nature trails",
    "local places"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}