{
  "created_at": "2025-01-06T04:22:31.902673+00:00",
  "objectID": "5508b705adfc0c3b2f8e074de67a8d2f",
  "ref": "river-deben-walking-route",
  "title": "River Deben Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/River_Deben_at_Woodbridge_-_geograph.org.uk_-_1177672.jpg",
  "nearby": [
    {
      "description": "Trimley Marshes",
      "objectID": "b35ad0aafeac64a546b87e3c65adf575",
      "ref": "trimley-marshes-walking-route"
    },
    {
      "description": "Orford Ness",
      "objectID": "d29ab9e294a7b037db4219c4c227d782",
      "ref": "orford-ness-walking-route"
    },
    {
      "description": "Suffolk Coast Path",
      "objectID": "0e29c3db92e53d17066c601df86904be",
      "ref": "suffolk-coast-path-walking-route"
    },
    {
      "description": "Fynn Valley Walk",
      "objectID": "2519af87ee7e6fc813aa6d009b604ca0",
      "ref": "fynn-valley-walk-walking-route"
    },
    {
      "description": "Felixstowe",
      "objectID": "6a669f457ae8421f2a1fc59b2bc217a1",
      "ref": "felixstowe-walking-route"
    },
    {
      "description": "Waldringfield",
      "objectID": "d4148d1dfcd1f0c9a0e0372fca2c967c",
      "ref": "waldringfield-walking-route"
    },
    {
      "description": "Bawdsey",
      "objectID": "6439e6e652178e286c6c3536088c3b89",
      "ref": "bawdsey-walking-route"
    },
    {
      "description": "Ramsholt",
      "objectID": "87f795387632769280d239b73c4737e8",
      "ref": "ramsholt-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5508b705adfc0c3b2f8e074de67a8d2f.gpx",
  "_geoloc": {
    "lat": 52.0895016604,
    "lng": 1.3181652429
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/River_Deben_at_Woodbridge_-_geograph.org.uk_-_1177672.jpg",
      "title": "Peter Beaven / River Deben at Woodbridge",
      "caption": "River Deben at Woodbridge. Looking upstream towards the Granary and the Tide Mill in the middle distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Sailing_dinghies_at_Kyson_Point_-_geograph.org.uk_-_1020958.jpg",
      "title": "Chris Holifield / Sailing dinghies at Kyson Point",
      "caption": "Sailing dinghies in a small boat park at Kyson Point where Martlesham Creek meets the River Deben"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/River_Deben_at_Waldringfield_-_geograph.org.uk_-_888708.jpg",
      "title": "Roger Gittins / River Deben at Waldringfield",
      "caption": "River Deben at Waldringfield"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Felixstowe_Ferry_Sailing_Club_and_Deben_River_-_geograph.org.uk_-_39074.jpg",
      "title": "Nigel Freeman / Felixstowe Ferry Sailing Club and Deben River",
      "caption": "Felixstowe Ferry Sailing Club and Deben River. Looking north towards the ferry crossing point which is behind the building on the left being the sailing club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Mudflats_at_Falkenham_Creek_-_geograph.org.uk_-_452511.jpg",
      "title": "Alan Stewart / Mudflats at Falkenham Creek",
      "caption": "Mudflats at Falkenham Creek"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Riverside_path_-_geograph.org.uk_-_1316785.jpg",
      "title": "Oxymoron / Riverside path",
      "caption": "Riverside path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/The_mouth_of_Kirton_Creek_-_geograph.org.uk_-_2746581.jpg/512px-The_mouth_of_Kirton_Creek_-_geograph.org.uk_-_2746581.jpg",
      "title": "The mouth of Kirton Creek by Simon Mortimer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The mouth of Kirton Creek"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Saltmarsh_-_geograph.org.uk_-_374000.jpg",
      "title": "Richard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View of the saltmarsh from the sea wall path"
    }
  ],
  "distance_km": 18.0,
  "description": "Enjoy a waterside walk along the River Deben from Woodbridge to Felixstowe Ferry. There's a nice footpath running for about 12 miles from the town to the Deben estuary on the North Sea. The walk starts on the quay in the Suffolk town of Woodbridge, close to the train station. You then follow a section of the Fynn Valley Walk towards the village of Martlesham. The next section follows public footpaths to Waldringfield where you will find a 14th century church and a pretty beach by the river. It's also a good spot to stop for refreshments at the quayside pub. You continue along the river to Hemley and then through Falkenham marshes before finishing at Felixstowe Ferry. Here you can catch the little ferry over the river to Bawdsey and follow the Suffolk Coast Path east towards Orford Ness. If you follow the path south it will take you into Felixstowe and then on to the splendid Trimley Marshes Nature Reserve, located close to the seaside town of Felixstowe. NB. As of August 2019 there are breaches of the sea wall in two places : 1. South of Martlesham Creek before Cross Farm 2. At Early Creek, south of Waldringfield This means it may nor be possible to walk the full length of this walk along the river. You will need to take a detour by following country lanes to the west of the river, south of Martlesham Creek .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the end of the route you can enjoy some well earned refreshments at the Ferry Boat Inn at Felixstowe Ferry. It's a historic pub of some note, dating all the way back to 1465. The interior is full of character and includes low beams and a huge wood burner to keep you warm on those winter days. They do very good food and also have a nice beer garden to sit out in on warmer days. You can find the pub at a postcode of IP11 9RZ for your sat navs. The pub is also dog friendly if you have your canine friend with you. On the route you could stop off at the excellent Maybush Inn in Waldringfield. It's in a lovely spot right next to the river so you can enjoy fine views with your meal. They have a very good menu and can be found on Cliff Road with a postcode of IP12 4QL for your sat navs. Near Woodbridge some consideration should be given to The Red Lion next to Martlesham Creek. It's a pub of some note, dating from the 16th century when it was a coaching inn on the old London to Yarmouth turnpike road. Now a Grade II listed country pub it has retained many of its 16th century features, including exposed wooden beams and open fireplace. It's well known for its distinctive Red Lion figurehead which sits on the exterior of the pub. The historic piece was captured in 1672 from a Dutch ship at the Battle of Sole Bay. They have a good menu and can be found at postcode IP12 4RN for your sat navs. The pub is also dog friendly if you have your canine friend with you on the walk."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Felixstowe Ferry you will pass the noteworthy Bawdsey Manor. Built in 1886, it was enlarged in 1895 as the principal residence of Sir William Cuthbert Quilter. The manor is now used for PGL holidays and courses, and has a small museum in the Radar Transmitter Block. This is where radar research took place early in World War II. The manor is located in a fine position at the mouth of the River Deben near Felixstowe Ferry. On the opposite side of the river you can pick up the Ramsholt Walk. This will take you along the eastern side of the river to Methersgate Quay. In Ramsholt there's a pretty quay, a beach and a splendid riverside pub in what is a delightful remote, unspoilt spot. Near the northern end of the walk there's also the National Trust's Sutton Hoo where you can explore a fascinating Anglo-Saxon burial site. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2H55DYDmNSs",
  "district": "East Suffolk",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Whisstocks Place, Woodbridge, East Suffolk, Suffolk, England, IP12 4BB, United Kingdom",
  "postcode": "IP12 4BB",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "marsh"
  ],
  "points_of_interest": [
    "church",
    "beach",
    "nature reserve"
  ],
  "facilities": [
    "pub/cafe",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}