{
  "objectID": "5512b3c66998993191fab92efb47885e",
  "created_at": "2024-12-21T06:46:39.944926+00:00",
  "ref": "lough-key-forest-park-walking-route",
  "title": "Lough Key Forest Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/73/Parkland_on_the_Rockingham_Demesne_-_geograph.org.uk_-_801267.jpg?20110220090828",
  "nearby": [
    {
      "description": "Carrowkeel",
      "objectID": "445a90e64c61028cb0612953ca5b2b13",
      "ref": "carrowkeel-walking-route"
    },
    {
      "description": "Lough Allen",
      "objectID": "57f2cc985ffbef96b0e0ace8d5871f9f",
      "ref": "lough-allen-walking-route"
    },
    {
      "description": "Carrick On Shannon",
      "objectID": "8da718cee891050c122234771ec652a6",
      "ref": "carrick-on-shannon-walking-route"
    },
    {
      "description": "Lough Key Forest Park",
      "objectID": "5512b3c66998993191fab92efb47885e",
      "ref": "lough-key-forest-park-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/79CE444AE6C06B4286258B9B003BBC76/$FILE/Lough Key Forest Park.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Parkland_on_the_Rockingham_Demesne_-_geograph.org.uk_-_801267.jpg?20110220090828",
      "title": "Oliver Dixon / Parkland on the Rockingham Demesne",
      "caption": "Parkland on the Rockingham Demesne.  Erris Bay on the south shore of Lough Key can be seen in the distance. Some of the park's attractions date back to when the park was part of the Rockingham Estate, such as the Ice House, Gazebo, Ruined Church, Stables, and Bog Gardens. Other more recent features include the Wishing Chair, Fairy Bridge, and several short canals lined with walkways. Drummans Island, now connected by a bridge, has mooring facilities for boats, making it a key stop for boaters on the Shannon Navigation system."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Lough_Key_Forest_Park_-_geograph.org.uk_-_801281.jpg?20110220085100",
      "title": "Oliver Dixon / Lough Key Forest Park",
      "caption": "The Rockingham Demesne was at one time the residence of the Lords Lieutenant of Ireland. The estate is now a very popular country park. The building is a new development housing a restaurant and other visitor developments, opened in 2007."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Church_on_the_Rockingham_Demesne_-_geograph.org.uk_-_801276.jpg?20110220075411",
      "title": "Oliver Dixon / Church on the Rockingham Demesne",
      "caption": "Church on the Rockingham Demesne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Lough_Key%2C_County_Roscommon_-_geograph.org.uk_-_1847314.jpg/512px-Lough_Key%2C_County_Roscommon_-_geograph.org.uk_-_1847314.jpg?20210331034126",
      "title": "Lough Key, County Roscommon by Sarah777, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lough Key, County Roscommon. In 2006–7, the park underwent significant redevelopment, including the construction of a new visitor centre and the addition of the Boda Borg adventure house and Zipit, a high-wire course through the forest canopy. The previously controversial Moylurg Tower was also refurbished and fitted with a lift during this period. Recent additions include Woodland Segway tours and Electric Bike Trails, which allow visitors to explore the park via guided tours or bike rentals. The park also features camping and caravan facilities, making it a versatile destination for families and outdoor enthusiasts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Lough_Key_Forest_Park_2010_052.jpg/512px-Lough_Key_Forest_Park_2010_052.jpg?20140317185941",
      "title": "jbraine, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Lough Key Forest Park. Lough Key and its surrounding area have a rich history that stretches back thousands of years. The lake itself is dotted with over thirty islands, many of which hold historical significance. Some of the notable islands include: 1.\tCastle Island: This island has been home to various structures over the centuries. The earliest reference dates back to 1184 in the Annals of Loch Cé, which mention a fire caused by lightning at \"The Rock of Loch-Cé,\" a significant residence. Currently, a 19th-century folly castle, built by the King family, stands on the island. 2.\tTrinity Island and Church Island: These islands feature ruins of medieval priories, adding to the area's rich ecclesiastical history. The area around Lough Key, including the nearby town of Boyle, has been continuously inhabited for millennia, making it an important site for both historical and archaeological exploration. The islands, with their ancient ruins and natural beauty, continue to attract visitors and offer insights into Ireland's past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/County_Roscommon_-_Lough_Key_Forest_Park_-_20230929150925.jpeg/512px-County_Roscommon_-_Lough_Key_Forest_Park_-_20230929150925.jpeg?20230929150952",
      "title": "Dieglop, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Lough Key. The name comes from Loch Cé, which refers to the druid Cé, servant of the god Nuada. According to legend, Cé was injured in the Second Battle of Mag Tuired and travelled south until he reached a place called Carn Corrslebe, where he saw a beautiful plain. As he tried to reach the plain, he died, and a lake formed where he was buried, flooding the area and being named after him. Geographically, the lake is part of the northern River Shannon drainage basin. It spans 843.7 hectares (2,085 acres), with an average depth of 5.1 metres (17 feet). The lake is fed by the Boyle River, which connects to Lough Gara before flowing through the town of Boyle and into Lough Key. It continues eastwards until it joins the River Shannon near Carrick-on-Shannon. A notable view of the lake can be seen from the N4 road as it ascends the Curlew Mountains, which is complemented by a modern steel sculpture of an Irish chieftain on horseback."
    }
  ],
  "distance_km": 6.32,
  "description": "This circular loop walk explores the Lough Key Forest Park on the southern shore of Lough Key in County Roscommon. The park features a visitor centre with a restaurant and numerous nature trails, including the Tree Canopy Walk, an elevated walkway through the trees that opened in 2007. The forest includes a mixture of native deciduous trees and non-native evergreens, with notable large cedar trees adding to the park’s scenic appeal. To continue your walking in the area you could head north east to visit Lough Allen where there's a nice circular walk. You can also pick up the long distance Leitrim Way here.",
  "video_url": "https://www.youtube.com/embed/CR-3Oh3fIG8?si=_iItGUrPMARmMx4V"
}