{
  "created_at": "2025-01-06T01:46:12.291247+00:00",
  "objectID": "551c91028d59c0739224c9211fb2229f",
  "ref": "crickley-hill-country-park-walking-route",
  "title": "Crickley Hill Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/Greenfield_Farm_from_Crickley_Hill_-_geograph.org.uk_-_135058.jpg",
  "nearby": [
    {
      "description": "Leckhampton Hill",
      "objectID": "72f7c9722b955044e84d31445a5e2647",
      "ref": "leckhampton-hill-walking-route"
    },
    {
      "description": "Birdlip",
      "objectID": "8f90be0767908c5828c1cc768e6c87fd",
      "ref": "birdlip-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/551c91028d59c0739224c9211fb2229f.gpx",
  "_geoloc": {
    "lat": 51.8441993848,
    "lng": -2.1054107372
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Greenfield_Farm_from_Crickley_Hill_-_geograph.org.uk_-_135058.jpg",
      "title": "Bob Embleton / Greenfield Farm from Crickley Hill",
      "caption": "Greenfield Farm from Crickley Hill. Looking slightly north of west from the quarried viewpoint of the Bronze and Iron Age hill fort of Crickley Hill perched on the scarp slope of the Cotswolds. Greenfield Farm is to the right of the picture whilst Oakland Farm (also within this square) is to the left. The light green field in the middle foreground shows the medieval ridge and furrow. The large hill in the middle distance is Churchdown some 5 km off. The hill on the left on the skyline is May Hill 23 km away. The southern end of the Malvern Hills is on the righthand skyline 25 km distant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Crickley_Hill_Viewpoint_-_geograph.org.uk_-_659937.jpg",
      "title": "andy dolman / Crickley Hill Viewpoint",
      "caption": "View from Crickley Hill Country Park, with Cheltenham just visible, and Shurdington in the middle/ The hills in the background are Malvern Hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/The_Devil%27s_Table%2C_Crickley_Hill_Quarry%2C_Gloucestershire_-_geograph.org.uk_-_192782.jpg",
      "title": "Dr Neil Clifton / The Devil's Table, Crickley Hill Quarry, Gloucestershire",
      "caption": "The Devil's Table, Crickley Hill Quarry, Gloucestershire. The long-disused Crickley Hill Quarry was the source for much of the stone used in the building of Gloucester Cathedral. The unusual rock formation in the photograph may have been used by quarrymen in initiation rites for apprentices/"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Crickley_Hill%2C_near_Birdlip_-_geograph.org.uk_-_1239156.jpg",
      "title": "Brian Robert Marshall / Crickley Hill, near Birdlip",
      "caption": "The properties under the hill have their addresses as Crickley Hill, Witcombe. In the far distance are the Malvern Hills about 30 kilometres away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Crickley_Hill%2C_near_Witcombe_-_geograph.org.uk_-_1239173.jpg",
      "title": "Brian Robert Marshall / Crickley Hill, near Witcombe",
      "caption": "High up on the left in amongst the trees is Crickley Hall. The hill in the background is Churchdown Hill over 6 kilometres away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Car_park%2C_Crickley_Hill_Country_Park_-_geograph.org.uk_-_1298968.jpg",
      "title": "Brian Robert Marshall / Car park, Crickley Hill Country Park",
      "caption": "A view of the car park at the country park. There are two car parks. The viewpoint is in the other one."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Crickley_Hill_Country_Park_%2813%29_-_geograph.org.uk_-_1299629.jpg",
      "title": "Brian Robert Marshall / Crickley Hill Country Park (13)",
      "caption": "View from the hill. The property at the lower left is named 'Clair-de-lune'. The settlement just beyond and to the left of the oilseed rape is Shurdington with beyond that the south-western outskirts of Cheltenham. The northern edge of the Malvern Hills is just visible at the extreme left of the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Crickley_Hill_Country_Park_%2814%29_-_geograph.org.uk_-_1300171.jpg",
      "title": "Brian Robert Marshall / Crickley Hill Country Park (14)",
      "caption": "The top of the Cotswold scarp can be see just above the evidence of the quarrying history of this part of the hills."
    }
  ],
  "distance_km": 5.3,
  "description": "A short circular walk around Crickley Hill country park near Birdlip in Gloucestershire. The park is set in 143 acres of countryside within the Cotswolds AONB and includes Limestone Grassland, Beech Woodlands and panoramic views of this beautiful area. The park also overlooks the Severn Vale, with fabulous views of the Cotswolds Hills, the Brecon Beacons and Black Mountains beyond. The walk begins at the Crickley Hill car park and follows footpaths to Shurdington Hill, passing the site of an ancient Roman Villa, before returning to the car park via Dryhill farm.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Air Balloon is located close to the hill in a convenient spot. It is housed in an attractive Cotswold stone building, dating from the 18th century. Outside there's a nice beer garden to relax in on warmer days. There's a good menu and a decent selection of ales too. You can find it at postcode GL4 8JY right next to the park. Also worth consideration is the Golden Heart Inn. This historic inn dates from the 16th century and includes an attractive interior with a cosy log fire. Outside there's a delightful patio area with views overlooking the valley. You can find it at Nettleton Bottom, Birdlip with a postcode of GL4 8LA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and surrounding woods are ideal for a dog walk. The Air Balloon and Golden Heart pubs mentioned above are also dog friendly. The latter will provide treats on the bar for your furry friend too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "About a mile north east of the park you'll find the noteworthy Leckhampton Hill. Here you can visit the Devil’s Chimney, an iconic Cotswold landmark. The unusual limestone rock formation stands above a disused quarry in Leckhampton. There's more great views and photo opportunities here making it a worthy addition to your outing. Just to the south of the park you can visit the little village of Birdlip and try the circular Birdlip Walk. This will take you to the nearby Witcombe Reservoirs, the interesting Great Witcombe Roman Villa and then up to the fine viewpoint at Barrow Wake. For more walks in the area see the Cotswolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/im9DzEssWBI",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Crickley Hill Camp, A417, Badgeworth, Birdlip, Tewkesbury, Gloucestershire, England, GL3 4UH, United Kingdom",
  "postcode": "GL3 4UH",
  "district": "Tewkesbury",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}