{
    "objectID": "558ef54a5ddbe6f7846f25ec42a77fd1",
    "created_at": "2024-12-19T09:30:47.607610+00:00",
    "ref": "holmsley-walking-route",
    "title": "Holmsley Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/New_Forest_Airfields_monument%2C_Holmsley%2C_New_Forest_-_geograph.org.uk_-_502696.jpg",
    "nearby": [
        {
            "description": "Burley New Forest",
            "objectID": "b3aae8b6e3a6f3539158891dd2e87810",
            "ref": "burley-new-forest-walking-route"
        },
        {
            "description": "Wilverley Plain",
            "objectID": "873ccc30c41d7a93728a43b79dec1af9",
            "ref": "wilverley-plain-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/830F03A8D673E1218625861C004DA4E7/$FILE/Holmsley.gpx",
    "_geoloc": {
        "lat": 50.8094959287,
        "lng": -1.6863217143
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/New_Forest_Airfields_monument%2C_Holmsley%2C_New_Forest_-_geograph.org.uk_-_502696.jpg",
            "title": "Jim Champion / New Forest Airfields monument, Holmsley, New Forest",
            "caption": "New Forest Airfields monument. This monument is on the edge of the old Second World War airfield at Holmsley."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/View_across_Holmsley_Bog_towards_Holmsley_Passage%2C_New_Forest_-_geograph.org.uk_-_624841.jpg",
            "title": "Jim Champion / View across Holmsley Bog towards Holmsley Passage, New Forest",
            "caption": "View across Holmsley Bog towards Holmsley Passage. This is a view west across Holmsley Bog towards Holmsley Passage. The area in the foreground is labelled on the Ordnance Survey map as \"Anthony's Bee Bottom\". The name might sound odd, but I'd guess \"Anthony\" was a local name or person, \"bee\" refers to a bee garden where hives were put out during the blooming of the heather and \"bottom\" is a valley. The small house in the distance is at Holmsley Passage."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Disused_road_bridge%2C_Holmsley%2C_New_Forest_-_geograph.org.uk_-_624927.jpg",
            "title": "Jim Champion / Disused road bridge, Holmsley, New Forest",
            "caption": "Disused road bridge. This is a former road bridge crossing the stream at the Holmsley end of the Clayhill Bottom mire complex. Beyond is the modern Station Road leading to Burley village across the heathland."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Derelict_hardstanding%2C_Holmsley_airfield%2C_New_Forest_-_geograph.org.uk_-_501453.jpg",
            "title": "Jim Champion / Derelict hardstanding, Holmsley airfield, New Forest",
            "caption": "Derelict hardstanding. This area of weedy concrete was once part of the hardstanding associated with RAF Holmsley, which was operational during the Second World War. The flat area beyond was the location for the three intersecting runway"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Pony_grazing_alongside_the_road_to_Holmsley_Passage%2C_New_Forest_-_geograph.org.uk_-_624623.jpg",
            "title": "Jim Champion / Pony grazing alongside the road to Holmsley Passage, New Forest",
            "caption": "Pony grazing alongside the road to Holmsley Passage, New Forest Looking northeast from the road to Holmsley Passage. On the far side of the dip (Cot Bottom) is part of the Burley Golf Club's nine-hole course."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Holmsley_Bog%2C_New_Forest_-_geograph.org.uk_-_32771.jpg",
            "title": "Jim Champion / Holmsley Bog, New Forest",
            "caption": "Holmsley Bog. Looking north-west at the bog from the bridge at the Passage. A bog habitat rich in bog wildlife - just don't try to cross it without using the bridge!"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Pathway_along_the_edge_of_the_Holmsley_Inclosure%2C_New_Forest_-_geograph.org.uk_-_32755.jpg",
            "title": "Jim Champion / Pathway along the edge of the Holmsley Inclosure, New Forest",
            "caption": "Pathway along the edge of the Holmsley Inclosure, New Forest. A variety of trees line this path which runs along the north-west edge of the Inclosure. The trees in the inclosure itself are an attractive mixture of conifers and broadleaved trees."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Disused_Brockenhurst_to_Ringwood_railway%2C_northeast_of_Holmsley_Inclosure_-_geograph.org.uk_-_183580.jpg/512px-Disused_Brockenhurst_to_Ringwood_railway%2C_northeast_of_Holmsley_Inclosure_-_geograph.org.uk_-_183580.jpg",
            "title": "Peter Facey / Disused Brockenhurst to Ringwood railway,  northeast of Holmsley Inclosure",
            "caption": "Disused Brockenhurst to Ringwood railway, northeast of the Inclosure. All of these trees will have grown up since the railway was closed in 1967. This view is looking in the direction of Holmsley Station (now a tea shop)."
        }
    ],
    "distance_km": 5.0,
    "description": "This walk takes you to the Holmsley Inclosure and Holmsley Bog in the New Forest. The area has a car park and a decent campsite which occupies part of what used to be Holmsley Airfield in WWII - one of 12 New Forest wartime airfields and Advanced Landing Grounds. The walk starts from the Holmsley car park just south of Burley. From here you can head north towards the Holmsley Passage and Bog. Here you can pick up a trail along the old Southampton and Dorchester Railway Line. Follow it south east before heading south west to enter the Inclosure. You then follow the woodland footpaths around the site, visiting Lodge Hill, Hanging Shoot and Cardinal Hat before returning to the car park.",
    "postcode": "BH24 4HX",
    "county": "Hampshire",
    "region": "South East",
    "country": "England"
}
