{
  "created_at": "2025-01-06T08:33:24.512709+00:00",
  "objectID": "559c4472c28b81a7e291de92d4226085",
  "ref": "devils-dyke-walking-route",
  "title": "Devil's Dyke Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Devils_Dyke_-_geograph.org.uk_-_1061666.jpg",
  "nearby": [
    {
      "description": "Truleigh Hill",
      "objectID": "00cd19e898f36442b4d53bfc369882fd",
      "ref": "truleigh-hill-walking-route"
    },
    {
      "description": "Ditchling Beacon",
      "objectID": "e7d5d940b5ebafa9b63be4b3a8b3092d",
      "ref": "ditchling-beacon-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Fulking",
      "objectID": "ab51140ef3d2c52b4e42f795aeed8f98",
      "ref": "fulking-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/559c4472c28b81a7e291de92d4226085.gpx",
  "_geoloc": {
    "lat": 50.8856128865,
    "lng": -0.2120334039
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Devils_Dyke_-_geograph.org.uk_-_1061666.jpg",
      "title": "Dave Spicer / Devils Dyke, via Wikimedia Commons",
      "caption": "This is the true Devils Dyke. A lot of people seem to park at the top and look across the Weald to the north rather then exploring the whole area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Bottom_view_of_the_Devils_Dyke_-_geograph.org.uk_-_1067309.jpg",
      "title": "Dave Spicer / Bottom view of the Devils Dyke, via Wikimedia Commons",
      "caption": "Bottom view of the Devils Dyke. The footpath climbed is to the right, while the other walkers seen below have taken the valley route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Devils_Dyke_walk_Jan_2012_%286700978705%29.jpg/512px-Devils_Dyke_walk_Jan_2012_%286700978705%29.jpg",
      "title": "Berit from Redhill/Surrey, UK [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Frosty tree stumps in the winter"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Devil%27s_Dyke_MMB_01.jpg/512px-Devil%27s_Dyke_MMB_01.jpg",
      "title": "mattbuck (category) [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A stone seat at the viewpoint near the car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/View_from_Devils_Dyke_-_geograph.org.uk_-_193332.jpg/256px-View_from_Devils_Dyke_-_geograph.org.uk_-_193332.jpg",
      "title": "Graham Pritchard / View from Devils Dyke, via Wikimedia Commons",
      "caption": "Looking north from the viewpoint across the beautiful countryside of the Weald of Sussex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Devil%27s_Dyke_MMB_05.jpg/512px-Devil%27s_Dyke_MMB_05.jpg",
      "title": "mattbuck (category) [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Hang-gliders soaring over the Dyke"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Devil%27s_Dyke_-_geograph.org.uk_-_30789.jpg",
      "title": "Val Vannet / Devil's Dyke, via Wikimedia Commons",
      "caption": "This view which is taken from the north west corner of the grid box looks down the dry valley on the north edge of the South Downs escarpment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Devils_Dyke_Trig_Point_-_geograph.org.uk_-_15637.jpg",
      "title": "Janine Forbes / Devils Dyke Trig Point, via Wikimedia Commons",
      "caption": "Looking SW over Adder Bottom"
    }
  ],
  "distance_km": 4.0,
  "description": "This circular walk explores this beautiful valley near Brighton. The valley stretches for about a mile through the South Downs. It is the longest, deepest and widest 'dry valley' in the UK. The area is criss crossed with footpaths and bridleways making it an ideal location for walking and mountain biking. As well as stunning views across the South Downs you will pass lovely meadows with a variety of flowers, an Iron Age Hill Fort and the remains of a Victorian funfair. In the summer months you can enjoy a sea of pink Orchids with a variety of butterflies including Adonis blue, chalkhill blue and silver spotted skipper. You can easily extend your walk by heading east onto Newtimber Hill where you will find one of the finest examples of chalk grassland in the country, ancient woodland and rare plants and flowers such as burnt orchid and juniper tree. Also on the route is the Devils Dyke Pub where you can have some lunch while enjoying some wonderful views. This route starts at the parking area at the western end of Devils Dyke and makes use of the South Downs Way and other footpaths to take you around the Dyke. The area is managed by the National Trust so there are good footpaths and an excellent cafe. This route is designed for walkers but there are many bridleways running across the area so mountain bikers can enjoy the Dyke too. If you'd like to extend your walk you could follow the South Downs Way east and visit Ditchling Beacon - the highest point in East Sussex. If you head west along the South Downs way you can visit Edbarton Hill and Truleigh Hill with its distinctive radio masts. The hill was originally the site of a radar station during the Second World War.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The area is a great for local pubs and people often combine a walk in the Dyke with a visit to one of these establishments. Head a short distance west from the hill and you can visit The Shepherd & Dog in the little village of Fulking. The charming pub traces it’s history back to the 14th Century and has a very good menu. There's an outdoor area where you can enjoy fabulous views of the South Downs. It's a great place to relax and enjoy refreshments on a warm summer day. You can find the pub about half a mile north west of the viewpoint at a postcode of BN5 9LU for your sat navs. In Poynings, just to the north, there's another fine option in the shape of the Royal Oak. There's a beautiful garden area here too, with a newly refurbished Barbecue Area to enjoy in the summer. You can find it in the village at a postcode of BN45 7AQ. Bob's Cafe is also in Poynings and a real treat. There's a splendid outdoor area right next to a large field so there are open and expansive views to enjoy here. The friendly cafe has an interesting history and includes a table tennis table, and a long rail to hitch your bicycle (or dog) to. Dogs are allowed in the adjacent room too. You can find it at a postcode of BN45 7AL."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The valley is a great place for a dog walk and you will probably see plenty of other owners on the walk. It's probably a good idea to keep them on the lead in the areas where animals are grazing. The Shepherd and Dog and the Royal Oak pubs mentioned above are also both dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could also start the walk from the nearby village of Fulking if you prefer. The Shepherd and Dog pub has a car park making it a good alternative start point. See the Fulking Circular Walk for more details. Just to the east of the site you'll find another National Trust site in the form of Saddlescombe Farm and Newtimber Hill. The delightful nature reserve is a great place to extend the walk if you have some time. There's ancient woodland, chalk grassland and long reaching views of the sea and across the Weald here. It's also great for flora and fauna with lots of butterflies fluttering around the orchids in the warmer months.  Pictured above is the pond in the hamlet of Saddlescombe near the Dyke. It's a worthy addition to your outing. On the right is a Crossdyke on Newtimber Hill where there are some nice paths to try. Head north east from the Dyke and you can visit Pyecombe and Wolstonbury Hill. This area of chalk grassland is covered in lovely wildflowers during the summer months. There also fine views over the Grade II listed Clayton Windmills from here. The circular Brighton and Hove Five Peaks Walk starts from Hove Park in Brighton and visits the dyke and 4 of the other prominent peaks in the area. To continue your walking in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QP2RHqPKR88",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Devils Dyke Hillfort, Devil's Dyke Road, Poynings, Mid Sussex, West Sussex, England, BN1 8YL, United Kingdom",
  "postcode": "BN1 8YL",
  "district": "Mid Sussex",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "meadows",
    "hill fort"
  ],
  "facilities": [
    "cafe",
    "pub/cafe",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}