{
  "objectID": "55a3c8caefe9b4ef4f5d017d3c4886f7",
  "created_at": "2024-12-19T22:32:58.583457+00:00",
  "ref": "cramond-to-south-queensferry-walk-walking-route",
  "title": "Cramond to South Queensferry Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/South_end_of_Cramond_Island_-_geograph.org.uk_-_1031367.jpg",
  "nearby": [
    {
      "description": "John Muir Way",
      "objectID": "003c712c8320e6d0880db2081ffe01bb",
      "ref": "john-muir-way-walking-route"
    },
    {
      "description": "Blackness to South Queensferry Walk",
      "objectID": "0b9c9b986d63e960f031ca8357410d7f",
      "ref": "blackness-to-south-queensferry-walk-walking-route"
    },
    {
      "description": "Cammo Estate",
      "objectID": "3a44b40574f54a2e074a9ba8c5816692",
      "ref": "cammo-estate-walking-route"
    },
    {
      "description": "Cramond Island",
      "objectID": "8d2ed1807fd406544932cbbe946d4a31",
      "ref": "cramond-island-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/485DA84EA244B7B2862586B500692C26/$FILE/Cramond to South Queensferry Walk.gpx",
  "_geoloc": {
    "lat": 55.966187329,
    "lng": -3.3180580046
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/South_end_of_Cramond_Island_-_geograph.org.uk_-_1031367.jpg",
      "title": "ronnie leask / South end of Cramond Island",
      "caption": "South end of Cramond Island. This tidal island of only 19 acres has a long history dating from Roman times. It was even the subject of a dispute settled by the Pope.There was a farm here until the 19th century and because of its strategic situation it was fortified during both WWI and WWII. Many derelict wartime buildings are still visible. The photo shows the causeway crossing Drum sands linking it to the village of Cramond at the mouth of the River Almond where there is a Roman Fort. The Pentland Hills can be seen in the far distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Whitehouse_Point_-_geograph.org.uk_-_1302081.jpg",
      "title": "G Laird / Whitehouse Point",
      "caption": "Whitehouse Point. The rocks at Whitehouse Point. A tanker moored at the tanker berths and Dalgety Bay on the opposite bank of the Firth of Forth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Beach%2C_Long_Craig._-_geograph.org.uk_-_34609.jpg",
      "title": "Richard Webb / Beach, Long Craig.",
      "caption": "Beach, Long Craig. Just inside the Dalmeny Gates, beach by Queensferry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Barnbougle_Castle_-_geograph.org.uk_-_1113472.jpg",
      "title": "ronnie leask / Barnbougle Castle",
      "caption": "Barnbougle Castle. In the 17th century Barnbougle was described as then being old. It was the seat of the Rosebery family until they moved to the newly built Dalmeny House nearby. In 1881 it was then rebuilt as a 3 storey tower house. At one time this was the home of Sir Roger Mowbray. As a knight of St. John he took part in the Crusades accompanied by his faithful hound. He was killed leaving his hound bereft. Legend states that now when storms rage on the Forth and through the trees his dog can be heard howling, searching for its master. This story gives its name to the nearby headland, Hound Point!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Dalmeny_House_-_geograph.org.uk_-_1113570.jpg",
      "title": "ronnie leask / Dalmeny House",
      "caption": "Dalmeny House. Sir Archibald Primrose acquired Dalmeny estate in 1662 and took up residence at Barnbougle Castle on the estate by the shores of the Forth. The family prospering his son was created Earl of Rosebery in 1703. In 1814 seeking a grander home the 3rd Earl employed the architect William Wilkins. This, Dalmeny House, Tudor Gothic in style, was completed in 1817 and remains the home of the Earls of Rosebery. Best known of the family was the 5th Earl, Prime Minister in the 1890's. He was also a keen racehorse breeder owning 3 Derby winners."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/South_Queensferry_Harbour_-_geograph.org.uk_-_1113445.jpg",
      "title": "ronnie leask / South Queensferry Harbour",
      "caption": "South Queensferry Harbour. There has been a harbour here since earliest times and traces from the 17th century remain. However, the present harbour, planned by the engineer Hugh Baird, dates from 1817. At one time it was busy with commercial and fishing vessels but it is now solely used by pleasure craft. The Forth Rail Bridge can be seen in the background and beneath it Inch Garvie."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Statue_of_%22Old_Tom%22_-_geograph.org.uk_-_1117483.jpg",
      "title": "ronnie leask, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Statue of \"King Tom\". This statue of one of the 5th Earl of Rosebery's favourite horses, \"King Tom\". It is the work of the noted Victorian sculptor Sir Joseph Boehm and stands near Dalmeny House, the mansion of the Earls of Rosebery. The 5th Earl was Prime Minister in the 1890s and also a keen horse breeder, owning 3 Derby winners: 1894, 1895 and 1905."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Whitehouse_Bay_-_geograph.org.uk_-_1302062.jpg",
      "title": "G Laird / Whitehouse Bay",
      "caption": "Whitehouse Bay"
    }
  ],
  "distance_km": 8.0,
  "description": "This popular coastal walk takes you from Cramond in Edinburgh to South Queensferry. It's a fine stretch of coast with excellent views over the Firth of Forth for the duration of the 5 mile walk. The walk starts at the Cramond Brig car park on the River Almond where you can pick up the John Muir Way. Follow the waymarked trail north and it will take you to the coast. Here you head west past Eagle Rock, Drum Sands and Snab Point to Dalmeny House which dates from 1817. You continue past the restored Barnbougle Castle to Hound Point at Peatdraught Bay. The route then turns south west passing Whitehouse Bay and the Forth Bridge before finishing in Queensferry. Here you can extend the walk on the Forth Road Bridge which spans the Firth of Forth. There is a walkway/cycleway running across the bridge to North Queensferry where you can link up with the popular Fife Coastal Path .",
  "video_url": "https://www.youtube.com/embed/X4MAiTaM5SE",
  "district": "Edinburgh",
  "county": "City of Edinburgh",
  "region": "Scotland",
  "country": "Scotland"
}