{
  "created_at": "2025-01-06T10:29:38.223132+00:00",
  "objectID": "563ada8fab7c78a4fbaae7b724b073ea",
  "ref": "pateley-bridge-circular-walk-walking-route",
  "title": "Pateley Bridge Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/79/Oldest_Sweet_Shop_in_England%2C_Pateley_Bridge_-_geograph.org.uk_-_179673.jpg",
  "nearby": [
    {
      "description": "Bewerley Industrial Heritage Trail",
      "objectID": "0ed6784a512804bf3001d71ea7028d3b",
      "ref": "bewerley-industrial-heritage-trail-walking-route"
    },
    {
      "description": "Six Dales Trail",
      "objectID": "a68096eca24288c1125a595e2c9774a8",
      "ref": "six-dales-trail-walking-route"
    },
    {
      "description": "Nidderdale Way",
      "objectID": "0dc8fa01c0ab155c1791cb829f1f1e1d",
      "ref": "nidderdale-way-walking-route"
    },
    {
      "description": "Gouthwaite Reservoir",
      "objectID": "f3763616972572b20bdc1dfb8884bb8b",
      "ref": "gouthwaite-reservoir-walking-route"
    },
    {
      "description": "Brimham Rocks",
      "objectID": "e425598a60cf00b0b016be4e158e9cd7",
      "ref": "brimham-rocks-walking-route"
    },
    {
      "description": "Way of the Roses",
      "objectID": "0ebbd693675bceae5ad40c293bb259eb",
      "ref": "way-of-the-roses-walking-and-cycle-route"
    },
    {
      "description": "Coldstones Cut",
      "objectID": "1dc4e263b73ba20b018201234e84fd71",
      "ref": "coldstones-cut-walking-route"
    },
    {
      "description": "Eavestone Lake",
      "objectID": "794b639df1deb631bc35dba0098f130b",
      "ref": "eavestone-lake-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/563ada8fab7c78a4fbaae7b724b073ea.gpx",
  "_geoloc": {
    "lat": 54.0862156631,
    "lng": -1.7618721106
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Oldest_Sweet_Shop_in_England%2C_Pateley_Bridge_-_geograph.org.uk_-_179673.jpg",
      "title": "Chris Heaton / Oldest Sweet Shop in England, Pateley Bridge",
      "caption": "Oldest Sweet Shop in England, Pateley Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Gouthwaite_Reservoir_-_geograph.org.uk_-_783351.jpg",
      "title": "Trevor Rickard / Gouthwaite Reservoir",
      "caption": "Gouthwaite Reservoir. View southwards to the dam with the bridged overflow to the left. One of a set of reservoirs providing the Bradford water supply. Gouthwaite was completed in 1901 as a compensation reservoir to ensure a steady flow of water down the river Nidd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/The_Crown%2C_Pateley_Bridge_-_geograph.org.uk_-_1506056.jpg",
      "title": "David Rogers / The Crown, Pateley Bridge",
      "caption": "The Crown, Pateley Bridge. Following a rebuild in 1767 The Crown on High Street was an early post inn and also housed the excise office."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Pateley_Bridge_-_geograph.org.uk_-_1232546.jpg",
      "title": "David Rogers / Pateley Bridge",
      "caption": "View of Pateley Bridge from Old Church Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/The_Playhouse%2C_Pateley_Bridge_-_geograph.org.uk_-_829761.jpg",
      "title": "Gordon Hatton / The Playhouse, Pateley Bridge",
      "caption": "The Playhouse. The playhouse stands next to Oddfellows Hall and was also built in 1859. It began life as the Primitive Methodist Church, then became the Salvation Army Citadel in 1936. It changed use again in 1968 when it became the Playhouse, and home for the local dramatic society."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/King%27s_Court%2C_Pateley_Bridge_-_geograph.org.uk_-_828612.jpg",
      "title": "Gordon Hatton / King's Court, Pateley Bridge",
      "caption": "King's Court. An archway leads from the High Street into King's Court, formerly the coach yard, stables etc. for the King's Head Hotel. These days the courtyard offers a range of gift shops."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/River_Nidd_-_geograph.org.uk_-_974655.jpg",
      "title": "Gordon Hatton / River Nidd",
      "caption": "River Nidd. View of the river about half a mile upstream from the centre of Pateley Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Memorial_at_Pateley_Bridge_-_geograph.org.uk_-_433163.jpg",
      "title": "Joe Regan / Memorial at Pateley Bridge",
      "caption": "Memorial and park in the town."
    }
  ],
  "distance_km": 18.0,
  "description": "This circular walk around the Yorkshire town of Pateley Bridge makes use of the Nidderdale Way to take you on a tour the countryside, reservoirs, rivers and woodland surrounding the town. It's just over 12 miles in length so it's one you can complete in a day. The town is an excellent base for walks in the Nidderdale area. It is also home to the oldest sweet shop in England and the fascinating Nidderdale Museum. The route starts in the centre of the town and follows the River Nidd north to Gouthwaite Reservoir, passing the village of Wath-in-Nidderdale on the way. The path then heads along the water to Ramsgill with great views across the reservoir. Gouthwaite is very popular with birdwatchers with goosanders, goldeney, mallard, tufted duck and pochard to look out for on the water. At Ramsgill you will find the Yorke Arms, a Michelin-starred restaurant on the village green. Here you turn south along the western side of the reservoir to Heathfield. The walk then heads along the pretty Ashfold Sidebeck towards Pinnacle Hill. On this section of the walk you reach a height of almost 1000ft so there are some really wonderful views over the Yorkshire Dales to enjoy. The final section descends past Pincher Hill with a short woodland section here also. Shortly after you return to the finish point back in Pateley. There are many other great walks around Pateley Bridge to try. You can pick up the Six Dales Trail and explore Wharfedale, Washburndale, Colsterdale, Coverdale, and Wensleydale. The Bewerley Industrial Heritage Trail also passes through Pateley. The fascinating trail explores nearly a thousand years of lead mining history. It will take you to the impressive Coldstones Cut, a huge artwork in the old Coldstone Quarry. The old Toft Gate Limekilns are also in this area and well worth a visit.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the southern end of Gouthwaite Reservoir you can visit the Sportsman's Arms where there is a bar/lounge, restaurant and hotel. They have a good bar menu and a nice cosy interior with a roaring log fire. In warmer months you can enjoy your drink and meal outside, surrounded by the sights and sounds of summer. The building also has an interesting history dating all the way back to the 1600s. You can find the inn at Wath with a postcode of HG3 5PP for your sat navs. At the other end of the water you'll find the Yorke Arms in Ramsgill. It's another historic building having once been an 18th century coaching house. The site was also a monastic cheesery as far back as the eleventh century before becoming a coaching inn when the Yorke family disposed of their lands and properties. They do excellent food and have a lovely garden area too. You can find the hotel by the Ramsgill Beck at a postcode of HG3 5RL."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you follow the Nidderdale Way east from a few miles you will come to one of the highlights of the area at Brimham Rocks. The National Trust owned site includes an extraordinary collection of large rock formations which are hundreds of millions of years old. It's a geoligically fascinating area with good walking trails across the surrounding Brimham Moor to explore. Just to the east of the rocks there's the more secluded Eavestone Lake to explore. Cyclists could follow National Cycle Route 688 and the epic Way of the Roses from the town to the site. A few miles to south east there's the neighbouring villages of Summerbridge and Dacre Banks. There's some nice river walks along the River Nidd and a fine 18th century pub to visit in this area. For more walking ideas in the area see the Nidderdale Walks and the Yorkshire Dales Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Cwnt6ZK9XBs",
  "postcode": "HG3 5AZ",
  "district": "Pateley Bridge",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}