{
    "objectID": "564c61ba625613481bfbfdf4b6748e0a",
    "created_at": "2024-12-20T11:26:58.676437+00:00",
    "ref": "dodd-wood-walking-route",
    "title": "Dodd Wood Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Osprey_Viewpoint%2C_Dodd_Wood_-_geograph.org.uk_-_608324.jpg",
    "nearby": [
        {
            "description": "Bassenthwaite Lake",
            "objectID": "cb45b765c0e0b6ad61a26671e13e3f9f",
            "ref": "bassenthwaite-lake-walking-route"
        },
        {
            "description": "Allerdale Ramble",
            "objectID": "641f71c34743ce206179b03c5da3b722",
            "ref": "allerdale-ramble-walking-route"
        },
        {
            "description": "Skiddaw",
            "objectID": "015e5ff7eb509951ba5af68c1b3baec6",
            "ref": "skiddaw-walking-route"
        },
        {
            "description": "Cockermouth",
            "objectID": "ff738e967da26fadb71b013b0d34a1d3",
            "ref": "cockermouth-walking-route"
        },
        {
            "description": "Ullock Pike",
            "objectID": "59fef9f60677dbe845b1d64776e4c8a6",
            "ref": "ullock-pike-walking-route"
        },
        {
            "description": "Sale Fell",
            "objectID": "ffe44ff61078d4819d39c4ce8d31e9f0",
            "ref": "sale-fell-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/5FC7CC3AA91CC67185258090004AB35D/$FILE/Dodd Wood.gpx",
    "_geoloc": {
        "lat": 54.642606121,
        "lng": -3.1857378106
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Osprey_Viewpoint%2C_Dodd_Wood_-_geograph.org.uk_-_608324.jpg",
            "title": "Oliver Dixon / Osprey Viewpoint, Dodd Wood, via Wikimedia Commons",
            "caption": "Osprey Viewpoint, Dodd Wood. From this commanding viewpoint, high up the side of Dodd, it is possible in season to view the ospreys which have been introduced to Bassenthwaite Lake under the Lake District Osprey Project, a joint initiative by the Forestry Commission, the Lake District National Park and the RSPB. In the middle distance can be seen the delta of the River Derwent where it enters the head of the lake."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Lower_viewing_area%2C_lower_osprey_viewpoint%2C_Dodd_Wood_%28geograph_3953600%29.jpg/512px-Lower_viewing_area%2C_lower_osprey_viewpoint%2C_Dodd_Wood_%28geograph_3953600%29.jpg",
            "title": "Christine Johnstone / Lower viewing area, lower osprey viewpoint, Dodd Wood, via Wikimedia Commons",
            "caption": "Lower viewing area, lower osprey viewpoint. The site is one of the only four pairs of nesting Ospreys in northern England, the other three being at Kielder Forest in Northumberland. The open-air viewing platform was opened in June 2001 giving a clear view of the nest from a safe distance."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/On_the_Trail_of_the_Lonesome_Pine%2C_Dodd_Woods_-_geograph.org.uk_-_327977.jpg",
            "title": "Bob Jenkins / On the Trail of the Lonesome Pine, Dodd Woods, via Wikimedia Commons",
            "caption": "On the Trail of the Lonesome Pine in the woods. Just why a single pine was left when the fell here was cleared a few years ago is a mystery. The view is of the River Derwent with High Stock Bridge just after the first bend. In the distance is Derwent Water, from which the river flows. A bright sunny day with early mist just being burned off."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Approaching_the_lower_osprey_viewpoint%2C_Dodd_Wood_%28geograph_3953590%29.jpg/512px-Approaching_the_lower_osprey_viewpoint%2C_Dodd_Wood_%28geograph_3953590%29.jpg",
            "title": "Christine Johnstone / Approaching the lower osprey viewpoint, Dodd Wood, via Wikimedia Commons",
            "caption": "Approaching the lower osprey viewpoint"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/View_of_Dodd_Wood_across_Bassenthwaite_Lake_-_geograph.org.uk_-_465595.jpg",
            "title": "Billy Wakefield / View of Dodd Wood across Bassenthwaite Lake",
            "caption": "View of Dodd Wood across Bassenthwaite Lake. Looking ESE from lake side at Beck Wythop across Bassenthwaite Lake towards the wood. The lake is the only body of water in the Lake District to use the word \"lake\" in its name, all the others being \"waters\", \"meres\" or \"tarns\". It is fed by, and drains into, the River Derwent. As well as the Ospreys Cormorants have been known to fish the lake and herons can also be seen; at the turn of the 19th century there was a report of 60 nests in a heronry in nearby Wythop Woods."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Beck_in_Dodd_Wood_-_geograph.org.uk_-_2311296.jpg/256px-Beck_in_Dodd_Wood_-_geograph.org.uk_-_2311296.jpg",
            "title": "Beck in Dodd Wood by Anthony Parkes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Skill Beck. This is a view of the Skill Beck on the western side of the woods near the car park."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Seat_on_Dodd_-_geograph.org.uk_-_1771105.jpg",
            "title": "Michael Graham / Seat on Dodd",
            "caption": "Seat on Dodd Seat with a classic view of Keswick, Derwent Water and Borrowdale. For many years the fell was extensively planted with conifers right up to the summit which obstructed the view. However, Forestry England started a programme of tree clearance from the top of the fell in 2001 and the summit of the fell is now clear; it is hoped that it will revert to heather moorland in years to come."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Descending_Dodd_-_geograph.org.uk_-_1772618.jpg",
            "title": "Michael Graham / Descending Dodd",
            "caption": "Descending Dodd. Looking down the north west flank. Dodd Fell forms part of the Skiddaw range in the northern part of the national park and the slopes are heavily wooded."
        }
    ],
    "distance_km": 6.0,
    "description": "This splendid wood next to Bassenthwaite Lake has several waymarked walking trails to try. This includes a hike to the summit of Dodd Fell where there are excellent views to enjoy. The woods have very good facilities with a car park, cafe, picnic areas, toilets and viewpoints. The area is very popular with bird watchers who come to see the Bassenthwaite Ospreys from the viewpoints on the slopes of Dodd. You can watch the birds fishing over the lake with the high powered telescopes and binoculars provided at the viewpoints. There's four waymarked walking trails to try with the Dodd Summit trail the most challenging. You'll climb through woodland and open hill to the 502 m (1,647 ft) summit where you can enjoy far reaching views towards Derwentwater, Bassenthwaite Lake, the Solway Coast and the mountains of Scotland. There's also three easier trails to try. These visit the magnificent Douglas Firs, the pretty Skill Beck and Sandbed Gill. After your walk you can refresh yourself at the excellent Old Sawmill Tearoom. Also nearby is the 17th century Mirehouse with its beatiful gardens and woodland. The woods are located a few miles north west of Keswick . You could reach them on foot by following the Allerdale Ramble from the town. The path goes via Applethwaite and Millbeck, before reaching the eastern side of the woods. Cyclists can follow regional cycle route 38 from Keswick which also passes through Applethwaite and Millbeck. Much of this walk follows the Allerdale Ramble footpath which runs right through the woods. You can continue along this path to extend your walking in the area. If you follow it north east you will climb to Carl Side and then on to the wonderful peak of Skiddaw .  Skiddaw is the 4th highest mountain in England and commands majestic views over the Cheviots, North Pennines, Yorkshire Dales, Forest of Bowland and the Isle of Arran . The path can be followed in the other direction along Bassenthwaite Lake. It will take you past Mirehouse & Gardens and several bays and woods. It eventually reaches the end of the lake and continues along the River Derwent to Cockermouth .",
    "video_url": "https://www.youtube.com/embed/BQZbr2lM5b0",
    "county": "Cumberland",
    "region": "North West",
    "country": "England"
}
