{
  "created_at": "2025-01-06T02:20:14.067527+00:00",
  "objectID": "565943fd29676dd871533ea773471c5a",
  "ref": "norton-st-philip-walking-route",
  "title": "Norton St Philip Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Norton_St_Philip_-_geograph.org.uk_-_2456567.jpg/512px-Norton_St_Philip_-_geograph.org.uk_-_2456567.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/565943fd29676dd871533ea773471c5a.gpx",
  "_geoloc": {
    "lat": 51.3005560301,
    "lng": -2.3295324667
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Norton_St_Philip_-_geograph.org.uk_-_2456567.jpg/512px-Norton_St_Philip_-_geograph.org.uk_-_2456567.jpg",
      "title": "Norton St Philip by James Ayres, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Norton St Philip"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/The_Church_of_St_Philip_and_St_James%2C_Norton_St_Philip_-_geograph.org.uk_-_1561469.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Church of St Philip & St James, Norton St Philip. The church dates from the 14th century and was restored in 1847 by St George Gilbert Scott. It is built of Doulting Stone and is Grade II listed. It is within the Diocese of Bath and Wells."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Dovecote_and_house%2C_Norton_St_Philip_%28geograph_4844541%29.jpg/512px-Dovecote_and_house%2C_Norton_St_Philip_%28geograph_4844541%29.jpg",
      "title": "Derek Harper / Dovecote and house, Norton St Philip",
      "caption": "Dovecote and house, Norton St Philip"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/The_George_Inn_at_Norton_St_Philip_-_geograph.org.uk_-_707130.jpg",
      "title": "Ronald Searle / The George Inn at Norton St Philip",
      "caption": "The George Inn at Norton St Philip Dating from the C14 or C15, this ancient hostelry has been associated with many historical figures, including the Duke of Monmouth, Cromwell, Judge Jeffreys, and Samuel Pepys to name but a few. The oversailing timber framed frontage was added after a fire in the C16, whilst the original ground floor is of stone. An important Grade I Listed building. The inn was later used as the headquarters of Monmouth's army, during the Monmouth Rebellion in 1685, after his retreat from Bath. In the aftermath of the failed rebellion Judge Jeffreys used the George Inn as a courtroom and conducted 12 executions on the village common, as part of the Bloody Assizes. The building has been used as a setting for films such as The Remains of the Day, Tom Jones, and The Canterbury Tales, as well as in the television adaptations of Persuasion by Jane Austen and Moll Flanders by Daniel Defoe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Stony_Littleton_Long_Barrow_%28geograph_1905253%29.jpg/512px-Stony_Littleton_Long_Barrow_%28geograph_1905253%29.jpg",
      "title": "Neil Owen / Stony Littleton Long Barrow",
      "caption": "Stony Littleton Long Barrow. It is one of the country's finest accessible examples of a Neolithic chambered tomb. Dating from about 3500 BC, it is 30 metres long and has multiple burial chambers open to view. There are fine views of the surrounding countryside from the elevated position of the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Cottage_near_Stony_Littleton_-_geograph.org.uk_-_728041.jpg",
      "title": "Maurice Pullin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cottage near Stony Littleton. A narrow byway drops from the western end of Wellow village down to Faulkland Lane. We can see the lane as it passes this delightful cottage near the junction. Stony Littleton is along Faulkland Lane to our left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Packhorse_bridge_at_Wellow_-_geograph.org.uk_-_273522.jpg",
      "title": "Rod / Packhorse bridge at Wellow",
      "caption": "Late Medieval packhorse bridge over Wellow Brook at Mill Hill, Wellow, Somerset"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Wellow%2C_ford_-_geograph.org.uk_-_283315.jpg",
      "title": "Martin Bodman / Wellow: ford",
      "caption": "Wellow: ford Looking north-north-west on the lane from Baggeridge Hill, at the foot of Wellow Village. The ford provides a crossing of the Wellow Brook by the old packhorse bridge"
    }
  ],
  "distance_km": 11.6,
  "description": "This charming Somerset village includes a historic church and a notable ancient pub which dates back to the 14th century. For walkers there's some fine country trails with views of the nearby Mendip Hills to enjoy. This circular walk from the village visits the neighbouring settlements of Stony Littleton and Wellow. On the way there's some nice country trails, and a waterside path along the Wellow Brook to enjoy. At Stony Littleton you have the option of following the brook to nearby Radstock. Around here you will also pass the noteworthy Stony Littleton long barrow as well. The walk starts in the village and follows footpaths west to Hassage, Ramsgate Wood and Stony Littleton. You then turn north following a trail along the Wellow Brook to Wellow, passing the ancient Long Barrow and medieval pack horse bridge on the way. The route then follows Norton Lane and Wellow Lane south east to return to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the historic George Inn for post walk refreshments. The fine looking timber framed pub dates back to 1397 and claims to be the oldest pub in the country. It is Grade I listed and includes a splendid garden area with great views over the village and the surrounding countryside. You can find them on the High Street at postcode BA2 7LH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk. The George Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you can pick up the Bradford on Avon Canal and River Walk and Bradford on Avon to Devizes Canal Walk along the Kennet and Avon Canal. For more walking ideas in the area see the Somerset Walks and the Mendip Hills Walks pages."
    }
  ],
  "district": "Norton St. Philip",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Corn House, Ringwell Lane, Norton St Philip, Norton St. Philip, Somerset, England, BA2 7NZ, United Kingdom",
  "postcode": "BA2 7NZ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "country"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "archaeological sites"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}