{
    "objectID": "56652f8a61235771b1c5a95d57616747",
    "created_at": "2024-12-18T04:16:54.494217+00:00",
    "ref": "kings-lynn-and-the-walks-walking-route",
    "title": "King's Lynn and The Walks",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Kings-lynn-walks-and-red-mount.JPG/512px-Kings-lynn-walks-and-red-mount.JPG",
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/49C9DEBE2C3B27298525815A0048065F/$FILE/King's Lynn and The Walks.gpx",
    "_geoloc": {
        "lat": 52.753096747,
        "lng": 0.4034998891
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Kings-lynn-walks-and-red-mount.JPG/512px-Kings-lynn-walks-and-red-mount.JPG",
            "title": "Alienturnedhuman at English Wikipedia / Public domain",
            "caption": "The Red Mount in the Walks"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Southgate%2C_King%27s_Lynn_-_geograph.org.uk_-_671469.jpg",
            "title": "Paul Shreeve / Southgate, King's Lynn",
            "caption": "Southgate. A relic of the mediaeval walls which surrounded King's Lynn."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/King%27s_Lynn_skyline_-_geograph.org.uk_-_483022.jpg",
            "title": "Martin Pearman / King's Lynn skyline",
            "caption": "A view of the King's Lynn skyline, photographed from the distant Free Bridge as it crosses the River Great Ouse. King's Lynn's grain silo (the town's tallest building) can be clearly seen as can St Margaret's Church, the Old Granaries, St Nicholas Chapel spire and the old grain loading tower on Boal Quay."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/King%27s_Staithe_Square%2C_King%27s_Lynn_-_geograph.org.uk_-_965706.jpg",
            "title": "Christine Church / King's Staithe Square, King's Lynn",
            "caption": "King's Staithe Square, King's Lynn. This view is southward at the northern limit of the gridsquare. The river Great Ouse is just to the west of this square. The architecture speaks of affluence in the Victorian / Edwardian period."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/East_Quay_and_Great_Ouse%2C_Kings_Lynn_-_geograph.org.uk_-_1447351.jpg",
            "title": "Richard Humphrey / East Quay and Great Ouse, Kings Lynn",
            "caption": "East Quay and Great Ouse. Looking north towards the Wash - on a northerly bearing the next stop is the Arctic Circle"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Saint_Edmund_Kings_Lynn_on_the_mud_of_the_River_Great_Ouse_%28geograph_5886542%29.jpg/512px-Saint_Edmund_Kings_Lynn_on_the_mud_of_the_River_Great_Ouse_%28geograph_5886542%29.jpg",
            "title": "Richard Humphrey / Saint Edmund King's Lynn on the mud of the River Great Ouse",
            "caption": "Saint Edmund on the mud of the River Great Ouse. This vessel is used to carry buoys to and from their positions in The Wash. It has been repainted since this photo was taken a few years ago."
        }
    ],
    "distance_km": 6.0,
    "description": "This nice circular walk takes you around 'The Walks' urban park before a riverside stroll along the Great Ouse. The Norfolk market town is a great place for a walk with wonderful architecture, a fascinating history and lovely riverside paths. The walk starts in the park next to the train station in the centre of town. The lovely 42 acre park has nice surfaced footpaths, a 15th century chapel, beautiful landscaping, a children’s play area, toilets and a cafe. After strolling through the park the route heads through the streets to the quay on the river. You then head towards South Lynn before crossing the bridge and following the paths along the western side of the river through West Lynn. Here you can catch the ferry which runs about every 20 mins from 7am to 6pm (excluding Sundays). You can then retrace your steps back to the park. On your way through the town look out for the fine Custom House tourist information centre which was originally built in 1683. The St Nicholas's Chapel, built between 1145 and 1420, and the Burkitt Court Almshouses are other notable architectural highlights. If you would like to extend your walking then there are several long distance trails running through the area. For example the Peter Scott Walk starts in King's Lynn. It will take you along the coastline of the Wash to Sir Peter Scott's lighthouse near Sutton Bridge. The Nar Valley Way also starts in the town and will take you along the River Nar to Gressenhall. A few miles to the north east of the town you can visit Roydon Common . Here you'll find nice trails taking you around a large area of heathland and woodland with Dartmoor Ponies to look out for. Just to the south of the common you can visit Bawsey Country Park .",
    "video_url": "https://www.youtube.com/embed/GnrFqYRGjXM",
    "postcode": "PE30 1NT",
    "district": "King's Lynn",
    "county": "Norfolk",
    "region": "Eastern",
    "country": "England"
}
