{
  "objectID": "5672bd2d7f202f00cf95101e9c81f533",
  "created_at": "2024-12-18T16:32:45.033399+00:00",
  "ref": "sapperton-circular-walk-walking-route",
  "title": "Sapperton Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/69/Footpath_through_woods%2C_near_Frampton_Mansell_-_geograph.org.uk_-_581638.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/9998BB6D075D4F9D8525818D00337244/$FILE/Sapperton Circular Walk.gpx",
  "_geoloc": {
    "lat": 51.728606155,
    "lng": -2.0780293156
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Footpath_through_woods%2C_near_Frampton_Mansell_-_geograph.org.uk_-_581638.jpg",
      "title": "Brian Robert Marshall [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Footpath through woods, near Frampton Mansell. This is a view to the south south east along the footpath near the edge of the woodland. At left out of shot is a large field from where the daylight is coming to highlight the path in the middle distance. In the far distance the path crosses over the top of the Sapperton Long railway tunnel. Autumn has arrived as confirmed by the start of the leaf fall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/St._Kenelm%27s_Church%2C_Sapperton%2C_Gloucestershire.jpg/512px-St._Kenelm%27s_Church%2C_Sapperton%2C_Gloucestershire.jpg",
      "title": "By Celuici (Own work) [CC BY-SA 4.0 (http://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "St. Kenelm's Church, Sapperton, Gloucestershire. This historic church dates back to the 12th century and is Grade I listed. The crossing tower and nave and chancel roofs are 14th century, and the church was largely rebuilt by Atkyns family at the beginning of the 18th century"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/St_Luke%27s_church_and_a_cottage%2C_Frampton_Mansell_-_geograph.org.uk_-_581144.jpg",
      "title": "Brian Robert Marshall [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "St Luke's church and a cottage, Frampton Mansell. Frampton Mansell is a small, pretty village in a deep valley. The church just to the right of centre dates from the first half of the 19th century. This is all I could find out about it: 'The church was built in 1843 by the then Lord Bathurst, in the Italian style. It has an unusual chancel with fine stone vaulting. All windows are of stained glass with five richly coloured windows depicting Christ flanked by Matthew, Mark, Luke & John.' Courtesy of the Gloucestershire County Council website."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Puck%27s_Mill_Upper_Lock_-_geograph.org.uk_-_1054681.jpg",
      "title": "David Stowell [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Puck's Mill Upper Lock. This lock on the Thames & Severn Canal is to the left of the unusual lock keeper's cottage and has an aqueduct underneath over the River Frome. The pound visible in the picture between the two Puck Mill Locks was completely relined with clay in the early 1900s but today it leaks like a sieve and only holds water after exceptionally wet periods. No prizes for guessing what the weather had been like in the days just before this picture was taken!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Sapperton_canal_tunnel%2C_interpreted_%28geograph_6211803%29.jpg/512px-Sapperton_canal_tunnel%2C_interpreted_%28geograph_6211803%29.jpg",
      "title": "Christine Johnstone / Sapperton canal tunnel, interpreted",
      "caption": "South or Coates portal of the Sapperton Canal Tunnel, Gloucestershire, with interpretation sign on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Tarleton_village_-_geograph.org.uk_-_466087.jpg",
      "title": "Graham Horn / Tarleton village",
      "caption": "Tarleton village at the southern end of the walk. Tarleton seems to have little focus and does not have a village feel. It seems to consist of many restored or converted buildings and exist as a commuter village in the middle of nowhere. This is from the road west, looking east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Sapperton_Ford_%28geograph_3422617%29.jpg/512px-Sapperton_Ford_%28geograph_3422617%29.jpg",
      "title": "John Walton / Sapperton Ford",
      "caption": "Sapperton Ford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/The_Bell_at_Sapperton_-_geograph.org.uk_-_464969.jpg",
      "title": "Graham Horn / The Bell at Sapperton",
      "caption": "The Bell at Sapperton"
    }
  ],
  "distance_km": 14.5,
  "description": "The Cotswolds village of Sapperton has some good trails to follow through the extensive local woodland and attractive Cotswolds countryside. This walk visits the Sapperton Canal Tunnel where there are footpaths along the well known local structure. There's also nice waterside walking along the canal and rivers which run through the area. The walk starts in the village and heads west to Sapperton Wood and Frampton Wood, before picking up waterside paths along the River Frome to the village of Frampton Mansell . It then turns south east, following the old Sapperton Tunnel and other tracks towards Tarlton. You then pick up the Macmillan Way to take you along the Sapperton Canal Tunnel. With a length of 3,817 yards it was the longest canal tunnel, and the longest tunnel of any kind, in England from 1789 to 181. This section runs through Hailey Wood, before following country lanes back into the village. At the southern point of this walk you are very close to the Source of the Thames near Kemble . If you have time it's worth a detour from the route to visit the site where you can pick up the Thames Path National Trail. To extend your walking in the Sapperton area you can pick up the Cotswold Canals long distance trail. You could follow it west along the Thames and Severn Canal to Chalford. You could also follow the Macmillan Way north east, and explore the Cotswolds Hills.",
  "video_url": "https://www.youtube.com/embed/dyoPCat6cy0",
  "district": "Sapperton",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England"
}