{
  "created_at": "2025-01-06T18:47:16.883162+00:00",
  "objectID": "5676d78273affdd89f94224abab51697",
  "ref": "haddington-to-east-linton-walk",
  "title": "Haddington to East Linton River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/16/Amisfield_House_grounds._-_geograph.org.uk_-_42102.jpg?20100130124312",
  "nearby": [
    {
      "description": "Haddington to Longniddry Railway Walk",
      "objectID": "23ebc7e92ec418ffefec44d2473444c3",
      "ref": "haddington-to-longniddry-railway-walk-walking-and-cycle-route"
    },
    {
      "description": "Traprain Law",
      "objectID": "bff9dfa1f1befaec61c03cdc70c3694c",
      "ref": "traprain-law-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5676d78273affdd89f94224abab51697.gpx",
  "_geoloc": {
    "lat": 55.95516,
    "lng": -2.76502
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Amisfield_House_grounds._-_geograph.org.uk_-_42102.jpg?20100130124312",
      "title": "Richard Webb / Amisfield House grounds.",
      "caption": "Amisfield House grounds. The parkland of Amisfield House stretch down to the River Tyne. Only the house was demolished in 1928. The grounds are now the home of Haddington Golf Club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Amisfield_Walled_Garden.jpg/512px-Amisfield_Walled_Garden.jpg?20180901122519",
      "title": "Tom Parnell, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Amisfield Walled Garden covers 8 acres and is one of Scotland's largest walled kitchen gardens. Built in the 18th century, it features 16-foot-high stone walls and decorative pavilions at each corner, designed both for aesthetic appeal and practical use, supplying the estate with fresh produce. As with many grand estates, the garden faced gradual neglect in the 20th century due to the high cost of upkeep. A community-led effort has been responsible for its restoration since 2007. Volunteers from the local area formed a charity, secured a long-term lease, and developed plans for the garden’s revival. Their vision has focused on creating a space that offers year-round beauty for visitors, while also providing opportunities for people of all ages to engage in horticultural activities, learning various gardening skills in the process. The project has become an inspiring example of community collaboration and historic preservation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Mill_lade_at_Abbey_Mill_-_geograph.org.uk_-_4399236.jpg/512px-Mill_lade_at_Abbey_Mill_-_geograph.org.uk_-_4399236.jpg?20230209194145",
      "title": "Mill lade at Abbey Mill by M J Richardson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mill lade at Abbey Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Path_beside_the_Tyne_-_geograph.org.uk_-_4582550.jpg?20230331120517",
      "title": "Path beside the Tyne by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path beside the Tyne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Path_beside_the_Tyne_-_geograph.org.uk_-_4582562.jpg?20230331121108",
      "title": "Path beside the Tyne by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path beside the Tyne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Sandy%27s_Mill.jpg?20081110174004",
      "title": "Alastair Seagroatt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sandy's Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/East_Lothian_Architecture_%2C_Hailes_Castle_-_geograph.org.uk_-_2341420.jpg/512px-East_Lothian_Architecture_%2C_Hailes_Castle_-_geograph.org.uk_-_2341420.jpg?20210716064718",
      "title": "East Lothian Architecture : Hailes Castle by Richard West, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "East Lothian Architecture : Hailes Castle. The castle is primarily a 14th-century structure, notable for its picturesque riverside location. It was owned by the Hepburn family for most of its history, who were influential during its peak. In 1926, the castle came under state protection as part of a guardianship agreement, which is now overseen by Historic Environment Scotland. The site is designated as a scheduled monument due to its historical importance. While the grounds around the castle remain open to the public, access to the interior has been restricted since 2020, when high-security fencing was installed due to safety concerns related to structural integrity. Visitors can still explore the exterior and enjoy the scenic surroundings without charge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/River_Tyne%2C_East_Linton_-_geograph.org.uk_-_5794494.jpg/512px-River_Tyne%2C_East_Linton_-_geograph.org.uk_-_5794494.jpg?20231123233029",
      "title": "River Tyne, East Linton by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Tyne, East Linton. East Linton is a charming agricultural town situated along the River Tyne, around 22 miles east of Edinburgh. Its growth was historically boosted by its 16th-century bridge over the Tyne gorge, which was crucial until the advent of the A1 road. The town's name is derived from The Linn, a waterfall located at the end of Mill Wynd, making it a popular scenic spot for both visitors and locals. In the town's square, you can find St Andrew's former church, a building with a neo-Romanesque façade, and its notable clock, fondly referred to as Jessie. Preston Kirk, on Preston Road, is another significant structure, featuring an intriguing graveyard with cast iron headstones. A short walk away is Preston Mill, a distinctive, old water mill now maintained by the National Trust for Scotland. East Linton is also home to Phantassie Doo'cot, a 16th-century beehive-shaped dovecot, and Smeaton Lake, which is encircled by specimen trees and frequented by geese and waterfowl. For aviation enthusiasts, the nearby Museum of Flight at East Fortune boasts a collection of over 50 vintage aircraft, including a Spitfire, a Vulcan, and even a Concorde."
    }
  ],
  "distance_km": 9.7,
  "description": "This lovely riverside walk follows the River Tyne from Haddington to East Linton in East Lothian. The walk starts in Haddington and heads east across Amisfield Park on a shared walking and cycling trail. This area includes Amisfield Walled Garden, one of the largest walled gardens in Scotland. The 18th century gardens include herbaceous borders, a wildflower meadow, an orchard and woodland. At Abbey Bridge you cross to the northern side of the river where you can pick up the trail along the water. This will take you east to the remains of Hailes Castle before coming to East Linton. You can continue your walking in the area by picking up the Haddington to Longniddry Railway Walk. The shared cycling and walking route will take you along a disused railway line to Longniddry. The walk also passes the hillfort at Traprain Law. You could take a detour south from the route to climb to this fine viewpoint.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/s0NcjMZLy5k?si=GRbk-Spv93Oa6Isg",
  "postcode": "EH41 4PT",
  "district": "Haddington",
  "county": "East Lothian",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Whittinghame Drive, Nungate, Haddington, East Lothian, Alba / Scotland, EH41 4PT, United Kingdom",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "gardens"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}