{
  "created_at": "2025-01-06T07:53:35.084503+00:00",
  "objectID": "5722d08e262efcdd07e21b8b0fb39dd6",
  "ref": "horley-walking-route",
  "title": "Horley Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/47/Horley_Station_-_geograph.org.uk_-_1753279.jpg",
  "nearby": [
    {
      "description": "Reigate and Banstead Millennium Trail",
      "objectID": "a43ef41680490a2489ea84e47e05c346",
      "ref": "reigate-and-banstead-millennium-trail-walking-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Brighton Way",
      "objectID": "dfc58fa4d62d37cfbfd86e4b437ec6a6",
      "ref": "brighton-way-walking-route"
    },
    {
      "description": "Earlswood Lakes",
      "objectID": "b7f68a5fd7b29e35da37594e3ead1e44",
      "ref": "earlswood-lakes-walking-route"
    },
    {
      "description": "Banstead Downs",
      "objectID": "34f0357596dabc825ef3241cd1c9f865",
      "ref": "banstead-downs-walking-route"
    },
    {
      "description": "Crawley",
      "objectID": "16cdf0fc2f3a8e9a62fc034b164818fd",
      "ref": "crawley-walking-route"
    },
    {
      "description": "Buchan Country Park",
      "objectID": "05f0df6c90bbc82792610cf9ecfbf565",
      "ref": "buchan-country-park-walking-route"
    },
    {
      "description": "Tilgate Country Park",
      "objectID": "932784aa773770c9eb2712300180605a",
      "ref": "tilgate-country-park-walking-and-cycle-route"
    },
    {
      "description": "Tanworth-in-Arden",
      "objectID": "fd4dc4a9665336e0ce2d8669cbabcdc0",
      "ref": "tanworth-in-arden-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5722d08e262efcdd07e21b8b0fb39dd6.gpx",
  "_geoloc": {
    "lat": 51.1686605071,
    "lng": -0.1606985011
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Horley_Station_-_geograph.org.uk_-_1753279.jpg",
      "title": "Ian Capper / Horley Station",
      "caption": "Horley Train Station. Built in 1905, following the quadrupling of the London Brighton and South Coast Railway main line through here, the previous 1841 station having been situated a few hundred yards further north. The building is locally listed. The station is on the Brighton Main Line, 25 miles (41.4 km) down the line from London Bridge via Redhill, with train services are provided by Thameslink and Southern."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Horley%2C_Riverside_Garden_Park_-_geograph.org.uk_-_1184033.jpg",
      "title": "Nigel Cox / Horley: Riverside Garden Park",
      "caption": "Horley: Riverside Garden Park As an antidote to all those other photographs of the airport and its infrastructure in this grid square, here's a photo of a wooded area of Riverside Garden Park, the river in question being Gatwick Stream. This area used to form part of Horley Common, and the park is managed by the local authority, Reigate and Banstead Borough Council. (Incidentally one has to question the wisdom of how these large borough councils are named. Just what affinity do the denizens of Horley (or Redhill or Tadworth for that matter) feel towards Reigate or Banstead?). The park is popular with dog walkers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/River_Mole_near_Horley_-_geograph.org.uk_-_221686.jpg",
      "title": "Nigel Cox / River Mole near Horley",
      "caption": "River Mole near Horley. Viewed looking downstream from the Mill Lane / Lee Street overbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Charlwood%2C_Church_of_St_Nicholas_-_geograph.org.uk_-_847279.jpg",
      "title": "Nigel Cox / Charlwood: Church of St Nicholas",
      "caption": "Charlwood, Church of St Nicholas. The church dates from the early Norman period, around 1080, and acquired its present shape around 1480. It's good to report that the clock was telling the correct time!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Old_stables%2C_Charlwood_-_geograph.org.uk_-_221142.jpg",
      "title": "Stephen Craven / Old stables, Charlwood",
      "caption": "Old stables, Charlwood. The former stables in the extensive grounds of the Rectory adjacent to St Nicholas' churchyard."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Lowfield_Heath_Windmill_-_geograph.org.uk_-_1752335.jpg/512px-Lowfield_Heath_Windmill_-_geograph.org.uk_-_1752335.jpg",
      "title": "Colin Smith / Lowfield Heath Windmill",
      "caption": "Lowfield Heath Windmill. South-west of Charlwood is this picturesque post-mill which was restored in 1990. It is open to visitors in the summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Pond_in_Glover%27s_Wood_-_geograph.org.uk_-_1756331.jpg",
      "title": "Robin Webster / Pond in Glover's Wood",
      "caption": "Pond in Glover's Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Path_in_Glover%27s_Wood_-_geograph.org.uk_-_1756541.jpg",
      "title": "Robin Webster / Path in Glover's Wood",
      "caption": "Path in Glover's Wood. A long clearing has been made along this stretch of the path, with regrowth of a coppiced area behind the fence on the right. The evergreen tree is holly."
    }
  ],
  "distance_km": 18.0,
  "description": "This Surrey based town is located just north of Gatwick Airport in the borough of Reigate and Banstead. There's some nice trails in the local riverside park, views of the River Mole and three noteworthy waymarked footpaths running through the countryside surrounding the town. This walk from the town visits the Riverside Park before heading to the neighbouring village of Charlwood. Here you can visit the restored Lowfield Heath Windmill and the Glover's Wood Nature Reserve. The walk starts from the train station and heads south through the town to visit the Riverside Park. It's a popular place for a walk in the town with a nice mix of woodland interspersed with grassy glades. There's also the pretty Gatwick Steam and a small man-made lake. On the eastern side of the park you can pick up the Sussex Border Path and follow the waymarked trail west along the River Mole with Gatwick Airport just to your south. It will take you out into the countryside before reaching the village of Charlwood with its interesting Norman church. After exploring the village you continue west past the Lowfield Heath Windmill to Glover's Wood. The old Mill was originally built at in 1737/8 and now stands on the edge of Charlwood village. It has a visitor centre and open days where you can learn all about the mill's history on a guided tour. There's some nice trails in the Glover's Wood nature reserve with streams, ponds and lots of flora and fauna to look out for on the way. After exploring the woods you can follow alternative paths back to Charlwood before returning to Horley on the Sussex Border Path.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Ye Olde Six Bells is a pub of some note in the town. It dates from the early 15th century and is located in a lovely spot next to the River Mole. Inside there's a cosy beamed interior with a large inglenook fireplace, stone flags and low beams. The pub rests on wooden piles, some of which date from the year 827. They serve country pub classics and also have a nice riverside garden area to relax in on warmer days. You can find them on Church Road with a postcode of RH6 8AD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland, parkland and riverside trails make for a pleasant walk with your dog. The Ye Olde Six Bells mentioned above is also dog friendly. They even have water and treats available in the bar area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Horley you could pick up the Reigate and Banstead Millennium Trail which starts in the Riverside Park in the town. If you follow it north it will take you to Salfords and Earlswood Lakes where there are some nice waterside trails to try. The trail then continues up onto the Banstead Downs in the North Downs. The Brighton Way also starts from the train station in the town. It will take you to Crawley and then through the South Downs to the coast at Brighton. Two pleasant country parks in the shape of Buchan Country Park and Tilgate Country Park are also located near the town. For more walking ideas in the area see the High Weald Walks and the Surrey Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BEk_gR-cbgU",
  "postcode": "RH6 9GY",
  "district": "Reigate and Banstead",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Victoria Road, Horley, Reigate and Banstead, Surrey, England, RH6 9GY, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "nature reserve",
    "historic mill",
    "village church"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}