{
  "created_at": "2025-01-06T01:30:33.987768+00:00",
  "objectID": "574c98690999e3f660459cb27b4f0609",
  "ref": "brora-to-golspie-walking-route",
  "title": "Brora to Golspie Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Brora_Harbour_-_geograph.org.uk_-_4412841.jpg",
  "nearby": [
    {
      "description": "Loch Fleet",
      "objectID": "8f2e9548e222fbf350bf7e3b1ad97d1d",
      "ref": "loch-fleet-walking-route"
    },
    {
      "description": "Ben Bhraggie",
      "objectID": "3c45bd08e36be6fbf93b03d8757d1c8d",
      "ref": "ben-bhraggie-walking-route"
    },
    {
      "description": "Falls of Shin",
      "objectID": "fe12f5092e7dbcbdf0e455ef84eb147d",
      "ref": "falls-of-shin-walking-route"
    },
    {
      "description": "Loch Brora",
      "objectID": "b21db038b9c5839992b18ff1f1480a2c",
      "ref": "loch-brora-walking-route"
    },
    {
      "description": "Golspie Big Burn Walk",
      "objectID": "276c730b23db01dc4a2f7c7096f2ae3f",
      "ref": "golspie-big-burn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/574c98690999e3f660459cb27b4f0609.gpx",
  "_geoloc": {
    "lat": 58.0115731,
    "lng": -3.8532457
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Brora_Harbour_-_geograph.org.uk_-_4412841.jpg",
      "title": "Brora Harbour by Mary and Angus Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Brora Harbour. Brora is a small industrial village, having at one time a coal pit, boat building, salt pans, fish curing, lemonade factory, the new Clynelish Distillery (as well as the old Clynelish distillery which is now called the Brora distillery), wool mill, bricks and a stone quarry. The white sandstone in the Clynelish quarry belongs to the Brora Formation, of the Callovian and Oxfordian stages (formerly Middle Oolite) of the Mid-Late Jurassic. Stone from the quarry was used in the construction of London Bridge, Liverpool Cathedral and Dunrobin Castle. When in operation, the coalmine was the most northerly coalmine in the UK. Brora was the first place in the north of Scotland to have electricity thanks to its wool industry. This distinction gave rise to the local nickname of \"Electric City\" at the time. Brora also houses a baronial style clock tower which is a war memorial."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Beach_View_Near_Brora_-_geograph.org.uk_-_4410929.jpg",
      "title": "Beach View Near Brora by Mary and Angus Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Beach View Near Brora"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Common_Seals_on_the_shore_near_Strathsteven_-_geograph.org.uk_-_315107.jpg",
      "title": "Gordon Hatton / Common Seals on the shore near Strathsteven",
      "caption": "Common Seals on the shore near Strathsteven"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Carn_Liath_Broch_-_geograph.org.uk_-_5919924.jpg/512px-Carn_Liath_Broch_-_geograph.org.uk_-_5919924.jpg",
      "title": "Carn Liath Broch by Richard Sutcliffe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Carn Liath Broch. The broch has an external diameter of around 19 metres and an internal diameter of around 10 metres. The broch wall is particularly thick. The entrance passage is on the east side and is over 4 metres long. The entrance has elaborate door checks and a bar-hole to control access to the interior. On the right-hand side of the entrance passage is a small guard cell. The surrounding enclosure contains the ruins of additional stone buildings. The broch was first excavated in the 19th century by the Duke of Sutherland, and was initially thought to be a burial cairn. Finds included pottery, flint chips, stone hammers, mortars and pestles, querns, whorls, shale rings, long-handled bone combs, a whale bone club, a silver fibula, steatite cups and an iron blade. In 1909 the entrance passage was still visible on the east side of the broch, but by 1960 no structural features were discernible. The site was excavated again in 1986. This showed that the site was occupied in the Bronze Age, before the broch was built. A Bronze Age cist burial with a food vessel was discovered. The foundations of many outbuildings were found in the enclosure surrounding the broch. Although many were clearly from a later period, some may have been contemporary with the broch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Shingle_beach_to_the_east_of_Dunrobin_Castle_-_geograph.org.uk_-_870818.jpg",
      "title": "Oliver Dixon / Shingle beach to the east of Dunrobin Castle",
      "caption": "Shingle beach to the east of Dunrobin Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Dunrobin_Castle_2000-1.jpg/512px-Dunrobin_Castle_2000-1.jpg",
      "title": "Libasstref, CC0, via Wikimedia Commons",
      "caption": "Dunrobin Castle is the most northerly of Scotland's great houses and the largest in the Northern Highlands with 189 rooms. The castle is also one of Britain's oldest continuously inhabited houses dating back to the early 1300s, home to the Earls and later, the Dukes of Sutherland. The structure, which resembles a French château with its towering conical spires, has seen the architectural influences of Sir Charles Barry, who designed London’s Houses of Parliament, and Scotland’s own Sir Robert Lorimer. The site was used as a naval hospital during the First World War and as a boys’ boarding school from 1965 to 1972. Dunrobin Castle is on the east coast of the Northern Highlands overlooking the Moray Firth, just north of the villages of Golspie and Dornoch (famous for its cathedral and Royal Dornoch Golf Club)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Dunrobin_Castle_Gardens.jpg/512px-Dunrobin_Castle_Gardens.jpg",
      "title": "Jooniur, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Dunrobin Castle Gardens. The gardens were laid out in 1850 by the architect Sir Charles Barry, who was responsible for the Victorian extension to the Castle and who designed the Houses of Parliament. Inspiration came from the Palace of Versailles in Paris, and they have changed little in the 150 years since they were planted, although new plants are constantly being introduced. Despite its northerly location, the sheltered gardens are able to support a surprising range of plants, including at the foot of the steps leading to the garden a huge clump of Gunnera manicata, a native rhubarb of South America that has eight-foot leaves!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Golspie_Harbour_-_geograph.org.uk_-_5784777.jpg",
      "title": "Golspie Harbour by valenta, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Golspie Harbour. Golspie is an attractive little seaside resort situated just 10 miles north of Dornoch. The village of Golspie boasts a lovely long sandy beach and there are a number of great scenic walks around the area including one at the Big Burn with its spectacular waterfalls. There are a number of historic buildings too, including St Andrews Church dating from the 16th century and the magical fairytale building which is Dunrobin Castle. This is one of the grandest houses in the north of Scotland and is situated just north of the village. The village has its own golf course and bowling club as well as tennis courts, and it also boasts its own swimming pool with fitness facilities. There are also many opportunities for loch and sea angling in the area. One unusual sporting venue is the local kart track which sees race meetings take place throughout the summer months. The latest addition to Golspie’s list of sporting attractions is the Highland Wildcat mountain bike trails. These have been designed for all levels of experience with different routes suitable for families and novices through to more difficult and technical trails for experienced mountain bikers. The most difficult trail features the longest free ride descent in Britain down from the summit of Ben Bhraggie. The village has a good range of local services including a number of shops and cafes. There is plenty of accommodation with several hotels in the village as well as B&Bs, guest houses and self-catering establishments."
    }
  ],
  "distance_km": 9.1,
  "description": "This walk follows a section of the John O' Groats trail from Brora to Golspie. The walk runs for about 6 miles along a fine part of the Sutherland coast, with splendid views over the Moray Firth. Along the way you will pass lovely beaches, cliff top viewpoints and lots of wildlife. Look out for common seals at Strathsteven and seabirds such as cormorants. You will also pass the ancient Carn Liath Broch. This sophisticated type of Iron Age settlement is accompanied by the rare survival of an associated village and earthworks. Also of note is the historic Dunrobin Castle. The 14th century castle has a fascinating history and some beautiful gardens to explore. To continue your walking in the area you can pick up the waterside trails along Loch Brora or try the climb to Ben Bhraggie. The John O' Groats trail continues to Dornoch and Embo .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north along the coast and you can visit the worthy village of Helmsdale. Here you can enjoy views of the pretty harbour and try the riverside walk along the River Helmsdale."
    }
  ],
  "video_url": "https://www.youtube.com/embed/30CYHP_YLPM?si=F_ElUOzBqNKHKCvy",
  "district": "Brora",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "South Brae, Lower Brora, Brora, Highland, Alba / Scotland, KW9 6NU, United Kingdom",
  "postcode": "KW9 6NU",
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "3-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}