{
  "objectID": "57936c3f6afc3a6cf113c8a7949b42fe",
  "created_at": "2024-12-18T01:10:40.321251+00:00",
  "ref": "stamford-bridge-walking-route",
  "title": "Stamford Bridge Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Centre_of_Stamford_Bridge_-_geograph.org.uk_-_723688.jpg/512px-Centre_of_Stamford_Bridge_-_geograph.org.uk_-_723688.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/2599E2316A93D2C486258710002B4AFC/$FILE/Stamford Bridge.gpx",
  "_geoloc": {
    "lat": 53.9911758421,
    "lng": -0.916254887
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Centre_of_Stamford_Bridge_-_geograph.org.uk_-_723688.jpg/512px-Centre_of_Stamford_Bridge_-_geograph.org.uk_-_723688.jpg",
      "title": "Keith Laverack / Centre of Stamford Bridge",
      "caption": "Village centre. The junction of the A166 and Church Road. The photo was taken looking west towards the Square. The village Post Office, HSBC Bank, and two of the four public houses, The Stamford and The Swordsman can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Battle_Flat_-_geograph.org.uk_-_285158.jpg",
      "title": "DS Pugh / Battle Flat",
      "caption": "Here on 25th September 1066, Harold Godwinson claimed victory for the English over Harald Hardrade and the viking invaders at the Battle of Stamford Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Stamford_Bridge%2C_The_Square_from_southwest_c.1913_%28archive_ref_PO-1-133-5%29_%2825160921101%29.jpg/512px-Stamford_Bridge%2C_The_Square_from_southwest_c.1913_%28archive_ref_PO-1-133-5%29_%2825160921101%29.jpg",
      "title": "East Riding Archives, No restrictions, via Wikimedia Commons",
      "caption": "Stamford Bridge at the turn of the 20th century. A familiar sight to anyone who knows this East Yorkshire village, but with the absence of the heavy traffic that now populates this street. The building now occupied by The Bay Horse pub is visible in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Derwent_in_Stamford_Bridge_-_geograph.org.uk_-_1323992.jpg",
      "title": "DS Pugh / Derwent in Stamford Bridge",
      "caption": "The river Derwent passing through Stamford Bridge. Taken from the viaduct of the old railway hosting a cycle track now rather than trains."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Stamford_Bridge_Viaduct_-_geograph.org.uk_-_910964.jpg",
      "title": "Paul Glazzard / Stamford Bridge Viaduct",
      "caption": "Stamford Bridge Viaduct. Viaduct where the York to Beverley railway line crosses the River Derwent, west of the village, looking north-northwest from the top of the field near Fox Glade off Huntsmans Lane. The high viaduct consists of 15 brick arches and an iron span above the river. The railway was proposed by George Hudson \"the Railway King\" who lived at Londesborough Hall just north of Market Weighton. The track between York and Market Weighton opened on 3rd October 1847 but the continuation of the line to Beverley was delayed until 1st May 1865. This was due largely to Hudson's downfall after the collapse of the over-inflated railway share price when he was accused of corruption, bribing MPs and selling land he did not own. Hudson left Londesborough in disgrace and was imprisoned in York Castle for debt in 1865. The line closed to passengers in November 1965 after Richard Beeching's 1962 report on the viability of the railways, but locals have always argued that this was a mistake and to this day there is an ongoing campaign to have the railway reopened."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Stamford_Bridge_-_geograph.org.uk_-_910969.jpg",
      "title": "Paul Glazzard / Stamford Bridge",
      "caption": "Arched stone road bridge over the River Derwent, completed in 1727 by the East Riding County Council to designs by William Etty of York. An earlier medieval bridge had crossed the river some 150 yards upstream, and before that there was an apparently narrow wooden bridge somewhere nearby which was mentioned in the Anglo-Saxon Chronicle, in the description of the famous battle of 1066 when King Harold defeated Earl Tostig and Harold Hardrada before getting one in the eye at Hastings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Millsike_Beck_-_geograph.org.uk_-_399243.jpg",
      "title": "DS Pugh / Millsike Beck",
      "caption": "Millsike Beck, south east of the village. Rather a lot lighter than my previous attempt taken as the sun was setting. Along the embankment the old Beverley railway used to run. Along the hedgerow is Millsike Beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Stamford_Bridge_Cricket_Club_-_geograph.org.uk_-_1824975.jpg",
      "title": "Stamford Bridge Cricket Club by DS Pugh, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Stamford Bridge Cricket Club"
    }
  ],
  "distance_km": 7.0,
  "description": "This historic village is located in the East Riding of Yorkshire. It includes an ancient Ford on the River Derwent, a noteworthy old railway viaduct, an 18th century mill and the site of a significant 11th century battle. This circular walk from the village visits the site of the Battle of Stamford Bridge before a riverside stroll along the River Derwent. You'll also pass the railway viaduct where there is a short cycling and walking trail running along the line. The walk starts in the village where you can pick up the Minster Way and follow the waymarked footpath south east towards Battle Flat the site of the Battle of Stamford Bridge in 1066. Although Harold Godwinson repelled these Norwegian invaders, his army was defeated by the Normans at Hastings less than three weeks later. Near Winchmore the route turns west to follow pleasant country lanes to High and Low Catton. Here you turn north to Smackdam Bridge and the viaduct before picking up a riverside path to take you back into the village.",
  "video_url": "https://www.youtube.com/embed/oojYwp7Zl7A",
  "postcode": "YO41 1AN",
  "district": "Stamford Bridge",
  "county": "East Riding of Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England"
}