{
  "created_at": "2025-01-05T23:36:27.067613+00:00",
  "objectID": "57f30f453de074b00280dbe88b128480",
  "ref": "streatley-walking-route",
  "title": "Streatley Hill Circular Ridgeway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Goring_and_Streatley_Bridge.JPG/256px-Goring_and_Streatley_Bridge.JPG",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/57f30f453de074b00280dbe88b128480.gpx",
  "_geoloc": {
    "lat": 51.5232222093,
    "lng": -1.1488272253
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Goring_and_Streatley_Bridge.JPG/256px-Goring_and_Streatley_Bridge.JPG",
      "title": "Nancy [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Goring and Streatley Bridge (downstream side) crossing the River Thames below Goring Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Thurle_Down_-_geograph.org.uk_-_456818.jpg",
      "title": "Andrew Smith / Thurle Down, via Wikimedia Commons",
      "caption": "Thurle Down. Looking up from the Ridgeway as it passes along the road to Warren Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Thurle_Down_-_geograph.org.uk_-_36189.jpg",
      "title": "Colin Bates / Thurle Down, via Wikimedia Commons",
      "caption": "Thurle Down taken from the Ridgeway Car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Warren_Farm_from_the_Ridgeway_-_geograph.org.uk_-_915144.jpg",
      "title": "Colin Smith / Warren Farm from the Ridgeway, via Wikimedia Commons",
      "caption": "Warren Farm from the Ridgeway. A collection of houses in the dry valley south of Thurle Down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Roman_temple_site%2C_Lowbury_Hill%2C_Oxfordshire_06.jpg/256px-Roman_temple_site%2C_Lowbury_Hill%2C_Oxfordshire_06.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Site of the former Roman temple on Lowbury Hill, Aston Upthorpe, Oxfordshire. The footprint of the temple is barely discernable as areas of shorter, discoloured grass, raised slightly above the surrounding field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/The_Fair_Mile_-_geograph.org.uk_-_80775.jpg",
      "title": "Colin Bates / The Fair Mile, via Wikimedia Commons",
      "caption": "The Fair Mile - once a Racehorse Gallops, it has become a wide rutted track onto the Downs, making it unsuitable for training valuable horses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Back_towards_Moulsford_-_geograph.org.uk_-_1313007.jpg",
      "title": "Bill Nicholls / Back towards Moulsford, via Wikimedia Commons",
      "caption": "Back towards Moulsford. Thames path towards Moulsford from near Sowberry Court."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Downland%2C_Moulsford_-_geograph.org.uk_-_884717.jpg",
      "title": "Andrew Smith / Downland, Moulsford, via Wikimedia Commons",
      "caption": "Downland, Moulsford Sheep graze on Kingstanding Hill above Starveall with arable fields below."
    }
  ],
  "distance_km": 16.0,
  "description": "A circular walk from Streatley, climbing onto the Ridgeway Hills to the west of the town before looping round across Cholsey Downs and returning via the River Thames. There's fine views over the Chiltern Hills, a visit to an ancient Roman Temple and a nice easy riverside stretch to finish. Much of the route takes place on country lanes or bridle paths so could be completed on a cycle as well. The route starts in the village where you can pick up The Ridgeway National Trail. Follow the waymarked footpath north west and it will take you up to Thurle Down. Head west along the path and it leads to Warren Farm where you can turn north to Dean's Bottom and Lowbury Hill. The hill is notable as the site of a former Roman temple. After passing the temple the route turns north east along the Fair Mile which is a former Racehorse Gallops. Follow the trail east across Cholsey Downs and you can then descend to the riverside village of Moulsford. The final section then picks up a nice footpath along the River Thames to take you back into Streatley. Back in the village you can enjoy refreshments at the riverside Swan Inn. It's a great place to sit outside and enjoy river views and refreshments in the summer months. To continue your walking in the area try our Goring Circular Walk which takes you along the Oxfordshire and Berkshire sides of the Thames using the Ridgeway and the Thames Path National Trails.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off at the noteworthy Beetle and Wedge pub In Moulsford. The 19th century pub is positioned in a lovely spot right next to the river with an outdoor seating area commanding fine views across the water. They serve good quality dishes and have a restaurant area with a classic and modern British menu. The stretch of the Thames around Moulsford has strong literary connections featuring in The Wind in the Willows and Jerome K Jerome's Three Men in a Boat. In 2005 the restaurant played host to Griff Rhys Jones, Dara Ó Briain and Rory McGrath, and a dog called Loli, during the filming of 'Three Men in a Boat' – a film broadcast and commissioned by the BBC as a modern-day reinterpretation of the travelogue by Jerome K Jerome."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west you'll find the neighbouring village of Aldworth where you can visit the historic 13th century church and the popular Bell Inn pub. The noteworthy pub is Grade II listed and dates back to the 15th century."
    }
  ],
  "postcode": "RG8 9JU",
  "district": "Streatley",
  "county": "West Berkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Streatley Telephone Box Book Exchange, Wallingford Road, Streatley, West Berkshire, England, RG8 9JU, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "country lanes",
    "bridle paths",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "river"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "wheelchair accessible",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}