{
  "created_at": "2025-01-06T02:24:22.144108+00:00",
  "objectID": "5868c4da6f06bf2b43280245155869dc",
  "ref": "poulter-country-park-walking-route",
  "title": "Poulter Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Poulter_Country_Park_-_Rock_Formation_in_Car_Park_-_geograph.org.uk_-_490031.jpg",
  "nearby": [
    {
      "description": "Creswell Crags",
      "objectID": "1093193b6d52aa28ac9b34b61bcb244d",
      "ref": "cresswell-crags-walking-route"
    },
    {
      "description": "Clumber Country Park",
      "objectID": "ab4c34c84ac5b84136555d8306a71c18",
      "ref": "clumber-country-park-walking-and-cycle-route"
    },
    {
      "description": "Sherwood Forest Country Park",
      "objectID": "d7972571afb8aab4ff1084a675e2938d",
      "ref": "sherwood-forest-country-park-walking-and-cycle-route"
    },
    {
      "description": "Thoresby Park",
      "objectID": "c1f6aad4c44b41e69f235808265bf04f",
      "ref": "thoresby-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5868c4da6f06bf2b43280245155869dc.gpx",
  "_geoloc": {
    "lat": 53.2298556725,
    "lng": -1.2142505297
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Poulter_Country_Park_-_Rock_Formation_in_Car_Park_-_geograph.org.uk_-_490031.jpg",
      "title": "Alan Heardman / Poulter Country Park - Rock Formation in Car Park",
      "caption": "Poulter Country Park - Rock Formation in Car Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Car_Park_-_geograph.org.uk_-_464347.jpg",
      "title": "Alan Walker / Car Park",
      "caption": "View of one of the good sized parking area at the parl. This north north-westerly facing photograph shows the new (at the time the photograph was taken) entrance to the Rowthorne Lane car park. Beyond the height restriction barrier ahead is Rowthorne Lane, which to the left (westerly) leads to its junction with Duke's Drive and to the right leads to its junction with Field Lane in Rowthorne village. The car park is divided into two sections. At the time this photograph was taken the more southerly section (behind the viewpoint) of the car park was closed off by a padlocked barrier. Off the left edge of the photograph a footpath leads through the trees joining Rowthorne Lane with the Rowthorne Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/The_northern_edge_of_Poulter_Country_Park_-_geograph.org.uk_-_240815.jpg",
      "title": "Sally Holmes / The northern edge of Poulter Country Park",
      "caption": "The northern edge of Poulter Country Park. The fields around what was once Langwith pit tip show little sign of their industrial recent past, and the village of Whaley enjoys rural views once more."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Sign_at_Poulter_Country_Park_-_geograph.org.uk_-_99311.jpg",
      "title": "Ann Ballinger, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sign at the entrance to Poulter Country Park showing distances to the viewpoint and the nature reserve. The park is on the site of the spoil tip of the former Langwith Colliery and is near the railway station at Langwith-Whaley Thorns."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Poulter_Country_Park_-_Viewpoint_-_geograph.org.uk_-_487892.jpg",
      "title": "Alan Heardman / Poulter Country Park - Viewpoint",
      "caption": "Viewpoint and benches to rest on at the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Poulter_Country_Park_-_geograph.org.uk_-_994709.jpg",
      "title": "Alan Heardman / Poulter Country Park",
      "caption": "Footpath heading back downhill towards the North Car Park."
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy a walk around this pleasant country park in Nether Langwith. There are two waymarked trails taking you to the park's viewpoint and the nature reserve. At the viewpoint there's a sculpture entitled 'Top of the World' which reflects the area's stone age past. There's far reaching views here across the countryside to Lincoln cathedral. The limestone paths are well surfaced and include a nice sculpture trail. It's great for flora and fauna with wildflower meadows attracting lots of butterflies in the summer months. Also look out for various dragonflies around the pretty ponds. Adjacent to Poulter Country Park is Scarcliffe Park where you will find a series of lovely woodland walking trails.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The parkland and woodland are ideal dog walking country so you will probably see plenty of other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north from the park and you could visit one of the highlights of the area at Creswell Crags. Here you can explore a wonderful limestone gorge on the Derbyshire and Nottinghamshire border. There's good walking trails, lots of interesting wildlife and a fascinating museum where you can see bones of lynx, beaver and wild pig dating from the last Ice Age 9,500 years ago. The waymarked Archaeological Way can be picked up in the park and followed north to Elmonton near Creswell village. The National Trust's Clumber Country Park, the expansive Thoresby Park and the splendid Sherwood Forest Country Park are also nearby. For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/W6MmDDU4OYs",
  "district": "Langwith",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}