{
  "created_at": "2025-01-06T04:26:57.650918+00:00",
  "objectID": "586ae1269f7d3f0f4b7881990dcd4a66",
  "ref": "lathkill-dale-walking-route",
  "title": "Lathkill Dale Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Lathkill_Dale_looking_downdale%2C_about_1_km_from_Monyash%2C_Derbyshire%2C_UK.JPG/512px-Lathkill_Dale_looking_downdale%2C_about_1_km_from_Monyash%2C_Derbyshire%2C_UK.JPG",
  "nearby": [
    {
      "description": "Arbor Low",
      "objectID": "2333e94a5e373ff76e46ed761173e6ae",
      "ref": "arbor-low-walking-route"
    },
    {
      "description": "Limestone Way",
      "objectID": "c8710cae72d7105dbf3f3fc8f79b4e53",
      "ref": "limestone-way-walking-route"
    },
    {
      "description": "Over Haddon",
      "objectID": "5daaadf5f0b1504c238d9fce62af843c",
      "ref": "over-haddon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/586ae1269f7d3f0f4b7881990dcd4a66.gpx",
  "_geoloc": {
    "lat": 53.1986150099,
    "lng": -1.7759814832
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Lathkill_Dale_looking_downdale%2C_about_1_km_from_Monyash%2C_Derbyshire%2C_UK.JPG/512px-Lathkill_Dale_looking_downdale%2C_about_1_km_from_Monyash%2C_Derbyshire%2C_UK.JPG",
      "title": "William M. Connolley at the English language Wikipedia [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Lathkill Dale looking downdale, about 1 km from Monyash, Derbyshire, UK"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Looking_down_Lathkill_Dale_-_geograph.org.uk_-_437813.jpg",
      "title": "Jerry Evans / Looking down Lathkill Dale, via Wikimedia Commons",
      "caption": "Looking down Lathkill Dale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Lathkill_Dale%2C_Peak_District_%287872894398%29.jpg/512px-Lathkill_Dale%2C_Peak_District_%287872894398%29.jpg",
      "title": "Paul Stephenson from London [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Lathkill Dale, Peak District"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Weirs_on_the_River_Lathkill_in_Lathkill_Dale_-_geograph.org.uk_-_436162.jpg",
      "title": "Jerry Evans / Weirs on the River Lathkill in Lathkill Dale, via Wikimedia Commons",
      "caption": "Weirs on the River Lathkill in Lathkill Dale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Approaching_Over_Haddon_and_the_Lathkil_Hotel_-_geograph.org.uk_-_2748576.jpg/512px-Approaching_Over_Haddon_and_the_Lathkil_Hotel_-_geograph.org.uk_-_2748576.jpg",
      "title": "Approaching Over Haddon and the Lathkil Hotel by Peter Barr, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Approaching Over Haddon and the Lathkil Hotel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Lathkill_Dale_-_geograph.org.uk_-_559127.jpg",
      "title": "Alan Heardman / Lathkill Dale",
      "caption": "Limestone outcrops. First view after leaving the woodland cover."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Bateman%27s_House%2C_Lathkill_Dale_-_geograph.org.uk_-_1310449.jpg",
      "title": "Trevor Harris / Bateman's House, Lathkill Dale",
      "caption": "Bateman's House ruins. Bateman's house (named for the mine owner who built it and lived here) was built directly over the 12m deep shaft used for draining the nearby lead mines."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Aqueduct_Pillars%2C_Lathkill_Dale_-_geograph.org.uk_-_1310452.jpg",
      "title": "Trevor Harris / Aqueduct Pillars, Lathkill Dale",
      "caption": "Aqueduct Pillars. These remains are the bases of pillars supporting an aqueduct which spanned Lathkill Dale in its industrial hey-day."
    }
  ],
  "distance_km": 13.0,
  "description": "Enjoy a splendid riverside walk in the beautiful Lathkill Dale in the Peak District. The dale is a peaceful, atmospheric area flanked with large limestone cliffs and woodland. Along the River Lathkill you'll pass pretty waterfalls and weirs and a wide variety of flora and fauna. Look out for birds such as ducks, herons, wagtails, dippers, waterhens and coots. The river is very clear and pure so it's easy to spot fish swimming alongside you on your walk. Along the river there are also interesting flora such as wildflowers and the rare wild plant Jacob's Ladder. This circular walk begins in the lovely village of Monyash at the excellent Bulls Head Pub, and follows footpaths through Bagshaw Dale to the river. You follow the river to Over Haddon where you can stop for refreshments at the splendidly positioned Lathkil Hotel. You then return on the same path for about half the way, before crossing the river and picking up the Limestone Way to take you back to Monyash. This is a super, varied walk with riverside, woodland and countryside sections to enjoy. Most of it is fairly flat so it's suitable for people of all abilities. If you'd like to extend your walking in the area you could head further along the river to Alport. You could also pick up the Limestone Way and head to nearby Yougreave where you can enjoy more waterside walking along the River Bradford in Bradford Dale. Our Youlgreave Circular Walk visits Lathkill Dale from the village if you would prefer to start from there. Just over a mile south of Lathkill Dale you'll find the fascinating Arbor Low. This well preserved Neolithic henge monument is well worth a visit. The atmospheric limestone circle sits in an elevated position with great views over the surrounding moors of the White Peak.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the Bull's Head in Monyash on Church Street, at postcode DE45 1JH. The historic country pub has a blazing log fire to warm you after a winter walk or a lovely beer garden to sit out and relax in during the summer.Also on Church Street you'll find the splendid Old Smithy tearooms at postcode DE45 1JH. The cafe is housed within the former village blacksmiths in a building full of character and over 250 years old. In Over Haddon you could enjoy a pit stop at the noteworthy Lathkil Hotel. The hotel sits in a wonderful elevated position so you can enjoy panoramic views with your meal. If the sun is shining the outdoor area is one of the best in the country with tremendous country views."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The dale is an ideal place to take your dog for a walk and you will likely see other dog walkers as you make your way along the river."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a couple of miles to the north you will find the village of Sheldon and the noteworthy Magpie Mine. Here you can explore a series of well preserved Lead Mines which date back to the 1600s. The historical site is a Scheduled Ancient Monument and another of the local area highlights."
    }
  ],
  "video_url": "https://www.youtube.com/embed/POhm7j6e9iE",
  "district": "Derbyshire Dales",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "1, Horse Lane, Monyash CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE45 1HN, United Kingdom",
  "postcode": "DE45 1HN",
  "state": "England"
}