{
  "created_at": "2025-01-06T03:51:35.093469+00:00",
  "objectID": "58bd76853a36b9a324b3b4952d4ee4a5",
  "ref": "peak-forest-canal-walking-route",
  "title": "Peak Forest Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Peak_Forest_Canal_-_geograph.org.uk_-_77865.jpg",
  "nearby": [
    {
      "description": "Marple Canal Locks",
      "objectID": "32c9655c3df13780c53192d965572722",
      "ref": "marple-canal-locks-walking-route"
    },
    {
      "description": "Torrs Riverside Park and Millennium Way",
      "objectID": "bdb7a463b25738c1876acef59805fa7d",
      "ref": "torrs-riverside-park-and-millennium-way-walking-route"
    },
    {
      "description": "Goyt Way",
      "objectID": "820a44c726978df6d1b3ca2f24db9814",
      "ref": "goyt-way-walking-route"
    },
    {
      "description": "Cheshire Ring Canal Walk",
      "objectID": "6d0d01f6477b5bcb587aea1c97814016",
      "ref": "cheshire-ring-canal-walk-walking-route"
    },
    {
      "description": "Ashton Canal",
      "objectID": "a77cd2e2cf3f910880690e05a9421609",
      "ref": "ashton-canal-walking-and-cycle-route"
    },
    {
      "description": "Tame Valley Way",
      "objectID": "a5afa4074e192c8a814b2d9baf1535b0",
      "ref": "tame-valley-way-walking-route"
    },
    {
      "description": "Lyme Park",
      "objectID": "f5f02b4b8e24938b1c37c524f487d0d0",
      "ref": "lyme-park-walking-route"
    },
    {
      "description": "Peak Forest Tramway Trail",
      "objectID": "f7f74bfba5e6d2ab8e18312c76685b9a",
      "ref": "peak-forest-tramway-trail-walking-route"
    },
    {
      "description": "Werneth Low Country Park",
      "objectID": "e13aa871cfe53b007b08c079face80a7",
      "ref": "werneth-low-country-park-walking-and-cycle-route"
    },
    {
      "description": "Disley",
      "objectID": "dd3dda60ee5bb53be795299fe3d2ac87",
      "ref": "disley-walking-route"
    },
    {
      "description": "Sett Valley Trail",
      "objectID": "07877d8c251baa412942ea0ba69ae2b8",
      "ref": "sett-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Chadkirk Country Estate",
      "objectID": "3b8e3e97c7f213c24b82807f2bb31756",
      "ref": "chadkirk-country-estate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/58bd76853a36b9a324b3b4952d4ee4a5.gpx",
  "_geoloc": {
    "lat": 53.3352905876,
    "lng": -1.9684594487
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Peak_Forest_Canal_-_geograph.org.uk_-_77865.jpg",
      "title": "Dave Dunford / Peak Forest Canal",
      "caption": "Looking northwards to the A5004 bridge over the canal. The branch to the right leads eastwards to Buxworth Basin (which has recently been reopened to boats after major leakage problems had scuppered an earlier restoration)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Peak_Forest_Canal_-_geograph.org.uk_-_1084390.jpg/512px-Peak_Forest_Canal_-_geograph.org.uk_-_1084390.jpg",
      "title": "Gerald England / Peak Forest Canal",
      "caption": "A stretch of the Peak Forest Canal on the South side of Hyde."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Whaley_Bridge_Canal_Basin%2C_Peak_Forest_Canal_-_geograph.org.uk_-_54067.jpg",
      "title": "Dave Dunford / Whaley Bridge Canal Basin, Peak Forest Canal",
      "caption": "Whaley Bridge Canal Basin. The terminus of the Peak Forest Canal - goods were transshipped at this point to and from the High Peak Railway, which ran between the Peak Forest and Cromford Canals and closed in 1967."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Bugsworth_arm%2C_Peak_Forest_Canal_-_geograph.org.uk_-_77877.jpg",
      "title": "Dave Dunford / Bugsworth arm, Peak Forest Canal",
      "caption": "Bugsworth arm. This arm of the Peak Forest Canal leads for about a mile to the former wharf at Bugsworth Basin, and formerly connected with the Peak Forest Tramway. The Basin has recently reopened after water leakage problems scuppered an earlier restoration. Taken from the footbridge at the junction with the main navigation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Peak_Forest_Canal%2C_Disley_-_geograph.org.uk_-_2748433.jpg/512px-Peak_Forest_Canal%2C_Disley_-_geograph.org.uk_-_2748433.jpg",
      "title": "Peak Forest Canal, Disley by Dave Dunford, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Disley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Aqueduct%2C_Furness_Vale.jpg/512px-Aqueduct%2C_Furness_Vale.jpg",
      "title": "Dave.Dunford, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Aqueduct, Furness Vale"
    }
  ],
  "distance_km": 24.0,
  "description": "Travel from Derbyshire into Greater Manchester on this waterside walk along the Peak Forest Canal. The route runs from Buxworth in Derbyshire to Ashton-under-Lyne in Greater Manchester. On the way you'll pass a series of pretty locks with nice views of the surrounding countryside. It's about a 15 mile walk from end to end. You start off in the village of Buxworth at the restored Bugsworth Basin which was used to to carry limestone to the canal in the 18th and 19th centuries using the Peak Forest Tramway Trail. You could also start from the nearby Whaley Bridge Basin if you prefer. The first section then heads north towards Bridgemont and New Mills with views of the River Goyt. Around New Mills you can visit the splendid Torrs Riverside Park and Millennium Way. Here you will find a beautiful river gorge with a fabulous 160 metre long walkway elevated over the water. Soon after New Mills you come to Disley where you can take a small detour and visit the wonderful Lyme Park. The expansive deer park has great views of the surrounding Peak District Hills. The canal continues north through Marple where you will come to the impressive Marple Aqueduct and a flight of sixteen locks. It's one of the highlights on the walk and a nice spot to stop for some refreshments. The next stage runs through Romiley and Hyde before finishing at Ashton-under-Lyne where it links with the Ashton Canal. The canal also links with other long distance trails. You can pick up the Goyt Way at New Mills and enjoy another waterside walk along the riverside path. At the Buxworth end the canal links with the Peak Forest Tramway Trail which was used to carry limestone to the Peak Forest Canal in the 18th and 19th centuries. There's also the Cheshire Ring Canal Walk which visits five other canals and the lovely Tame Valley Way .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At Portland Basin there's an excellent museum with an adjacent cafe. There's a good menu and outdoor seating where you can sit and watch the boats go by on finer days. You can even take a boat trip from here and experience the canal from a different perspective. The Portland Basin Museum is also well worth exploring if you have time. It's housed within the restored nineteenth century Ashton Canal Warehouse and combines a lively modern interior with a peaceful canal side setting. Inside you can see a series of interesting exhibitions detailing the history of Tameside's industrial heritage. In Disley the Rams Head Inn is worthy of investigation. This historic building was built by the Legh family in c.1640, though the current exterior was built around 1840. It was formerly a lodge belonging to the Lyme Park estate. They have a lovely garden area where you can sit outside on warmer days. The pub can be found at postcode SK12 2AE. In Marple Bridge The Midland is worthy of consideration. The pub is in a lovely spot overlooking the River Goyt in the heart of the village. You can sit outside on the balcony and enjoy a meal with a view over the water. They're located close to the train station at 26 Brabyns Brow, SK6 5DT."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Around Hyde you could take a detour from the route to visit Werneth Low Country Park. The park includes a splendid hill top viewpoint with excellent views over the canal, Greater Manchester and the Pennine Hills. There's also a fine parkside pub for refreshments. The long distance Tameside Trail can also be picked up in this area. The 30 mile circular walk explores several of the highlights of the River Tame Valley. The route starts just to the east of the park at Broadbottom railway station and crosses the canal near here. Near Marple you could leave the canal to explore the historic Chadkirk Country Estate. There's a noteworthy 16th century chapel, a little cafe and a walled garden to enjoy here. For more walking ideas in the area see the Greater Manchester Walks and the Derbyshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/txtiqQ5TBMc",
  "district": "High Peak",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brookside, Knowltop, Chinley, Buxworth and Brownside, Buxworth, High Peak, Derbyshire, East Midlands, England, SK23 7NH, United Kingdom",
  "postcode": "SK23 7NH",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "river",
    "park"
  ],
  "points_of_interest": [
    "historical sites",
    "river gorge",
    "park",
    "trails"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}