{
  "objectID": "58fc39beb8c8ba5a23b5f065de6f31ca",
  "created_at": "2024-12-18T12:45:40.837353+00:00",
  "ref": "firle-beacon-walking-route",
  "title": "Firle Beacon Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Firle_Beacon_-_geograph.org.uk_-_961577.jpg",
  "nearby": [
    {
      "description": "Mount Caburn",
      "objectID": "63aac236a831556e1b448a7537d4e803",
      "ref": "mount-caburn-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Lewes",
      "objectID": "75d6be509adaff16b2144c9239df3075",
      "ref": "lewes-walking-route"
    },
    {
      "description": "Iford",
      "objectID": "df42aca8ac31b75f6a88a750323123b6",
      "ref": "iford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/58fc39beb8c8ba5a23b5f065de6f31ca.gpx",
  "_geoloc": {
    "lat": 50.845755903,
    "lng": 0.0868563246
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Firle_Beacon_-_geograph.org.uk_-_961577.jpg",
      "title": "Simon Carey / Firle Beacon, via Wikimedia Commons",
      "caption": "The distinctive peak along this range of the Downs. Much of the north escarpment is open access land and a track can just be made out running around the lower part of the hill from its start point in front of the photographer. Firle Tower can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Trig_Pillar%2C_Firle_Beacon_-_geograph.org.uk_-_961539.jpg",
      "title": "Simon Carey / Trig Pillar, Firle Beacon, via Wikimedia Commons",
      "caption": "Photo of the Trig Pillar, Firle Beacon, on a mist shrouded morning. The pillar is set amongst a number of tumuli."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Looking_towards_Firle_Beacon_-_geograph.org.uk_-_29384.jpg",
      "title": "Alan Rolfe / Looking towards Firle Beacon, via Wikimedia Commons",
      "caption": "Looking towards Firle Beacon, with two cyclists ahead on the path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Trig_Point_on_Firle_Beacon_-_geograph.org.uk_-_24622.jpg",
      "title": "Terry Jones / Trig Point on Firle Beacon, via Wikimedia Commons",
      "caption": "Top of the beacon and site of Iron Age settlement. Looking North over the Sussex Weald"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Round_Hill%2C_rising_to_Firle_Beacon_seen_from_the_North_-_geograph.org.uk_-_137239.jpg",
      "title": "Simon Hookey / Round Hill, rising to Firle Beacon seen from the North",
      "caption": "Round Hill, rising to Firle Beacon seen from the North"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Charleston_Farmhouse_-_geograph.org.uk_-_2742143.jpg",
      "title": "Charleston Farmhouse by Simon Carey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Charleston Farmhouse. A short walk from the beacon this historic house makes a nice extension to the walk. The house has strong literary associations and features year round exhibitions and talks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Firle_Tower_from_the_Old_Coach_Road_-_geograph.org.uk_-_962535.jpg/256px-Firle_Tower_from_the_Old_Coach_Road_-_geograph.org.uk_-_962535.jpg",
      "title": "Simon Carey / Firle Tower from the Old Coach Road",
      "caption": "Firle Tower from the Old Coach Road. Built in 1822 by the Gage family, owners of the Firle Estate for their gamekeeper. In the field in the foreground are four goats munching their way through the choicest foliage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Firle_Stores_and_Post_Office_-_geograph.org.uk_-_2105075.jpg",
      "title": "Firle Stores and Post Office by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Firle Stores and Post Office. The village is located just north west of the beacon. It's name comes from the old Anglo-Saxon word 'fierol' meaning overgrown with oak."
    }
  ],
  "distance_km": 6.0,
  "description": "This circular walk takes you to the splendid Firle Beacon in the South Downs. The popular route makes use of the The South Downs Way and various bridleways and country lanes to take you to the beacon from the pretty village of Firle. The start point for the walk is the little village of Firle, located just a few miles from Lewes. You can enjoy a stroll through the village with its three pubs, old church, cricket green and little pond. You will also pass Firle Place and its surrounding grounds. The old manor house was first built in the late 15th century by Sir John Gage. The route follows a bridleway around the grounds of the house before ascending to Firle Beacon. From the 712 feet (217 m) summit there are wonderful views over the Weald towards the south coast. The Firle Escarpment is also a Site of Special Scientific Interest. The large area of chalkland is home to a variety of flora and fauna. Look out for the rare spider orchid Ophrys sphegodes and Exmoor Ponies as you make your way through this lovely area. From the beacon summit you descend on the South Downs Way before picking up Firle Bostal country lane to take you back to the village. This lane is shown on the google street view link below. It's easy to extend your walk by continuing west from the beacon along the South Downs Way to Beddingham Hill. Another option is to start the walk from the nearby village of Alfriston on the Cuckmere River. You can then follow the South Downs Way to the beacon via Bostal Hill. You could also visit the lovely Mount Caburn Nature Reserve with its interesting plants, flowers and wildlife.",
  "video_url": "https://www.youtube.com/embed/5Wqdll9L0ac",
  "county": "East Sussex",
  "region": "South East",
  "country": "England"
}