{
  "objectID": "596be146b90b160b7f7c53b7c72e3212",
  "created_at": "2024-12-21T01:02:03.322365+00:00",
  "ref": "ross-round-walking-route",
  "title": "Ross-on-Wye Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Grand_entrance_to_The_Prospect_-_geograph.org.uk_-_515016.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/BE29F7BE6067B75A802579E80038AB94/$FILE/Ross Round.gpx",
  "_geoloc": {
    "lat": 51.9160846155,
    "lng": -2.5877268319
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Grand_entrance_to_The_Prospect_-_geograph.org.uk_-_515016.jpg",
      "title": "Pauline Eccles / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Grand entrance to The Prospect. John Kyrle created The Prospect, offering magnificent vistas overlooking the Wye River, which lies a hundred feet below, extending all the way to the Welsh mountains. He rented this parcel of land from the Marquess of Bath in 1696 and transformed it into a garden and leisure area.\nAround 1870, disputes arose over land ownership. James Barrett constructed the Royal Hotel and appropriated part of The Prospect to establish gardens for the hotel. This action led to significant unrest among the residents of Ross, who believed that The Prospect belonged to the town and accused Barrett of unjustly claiming the land. Eventually, Thomas Blake intervened and resolved the conflict by arranging for the land to be permanently transferred to the townspeople. Subsequently, the garden was laid out in a manner similar to its present-day configuration."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Ross-on-Wye_war_memorial_-_geograph.org.uk_-_1128339.jpg",
      "title": "Jonathan Billinger / Ross-on-Wye war memorial",
      "caption": "Ross-on-Wye war memorial situated on The Prospect; it has been relocated to this spot partly to permit archaeological investigations to take place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Penyard_Park_-_geograph.org.uk_-_28418.jpg",
      "title": "Richard Webb / Penyard Park",
      "caption": "Penyard Park. A Forest of Dean outlier, and a surprisingly craggy hill. The summit is farmed, the rest, brambly forest and sandstone crags. Taken during the 2000 British Relay Championships in Orienteering. The ruins of Penyard Castle can be found in this area. Dating back to the 14th century, the castle was once owned by the Talbot family and is believed to have been demolished in the late 17th century. The surviving ruins consist of a single building, likely a portion of the original castle's residential quarters, displaying medieval features. Constructed partly with recycled masonry from the original castle, this small structure underwent extensive modifications and remained inhabited until the early 20th century. Oriented in a north-south direction, it features gable walls at both ends connected by walls on the east and west sides, with a dilapidated extension protruding from the east side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Countryside_near_Howle_Hill_-_geograph.org.uk_-_1128771.jpg",
      "title": "Stuart Wilding / Countryside near Howle Hill",
      "caption": "Countryside near Howle Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/River_bank%2C_Ross-on-Wye_-_geograph.org.uk_-_1300913.jpg",
      "title": "Pauline Eccles / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "River bank with summer wildflowers, Ross-on-Wye. The Wye Valley Walk passing through Long Acres on a sunny, windy day in May. On the right is one of Walenty Pytel's metal sculptures, Swans in Flight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/River_Wye_at_the_Riverside%2C_Ross-on-Wye._-_geograph.org.uk_-_1134368.jpg",
      "title": "Jonathan Billinger / River Wye at the Riverside, Ross-on-Wye.",
      "caption": "The Wye bank by the Hope and Anchor pub. In the distance is the rowing club."
    }
  ],
  "distance_km": 29.0,
  "description": "This delightful circular walk takes you through the Herefordshire countryside around Ross-on-Wye. You start on the River Wye, in the pretty market town of Ross-on-Wye, and follow the river north to the riverside settlement of Hole-in-the-Wall. The walk then leaves the river, visiting Crow Hill, Weston Under Penyard, Penyard Park, Warmhill Wood and Howle Hill as you head through the Herefordshire countryside. There's much to enjoy on this varied walk including rivers, woodland and a series of pretty villages. Situated in the beautiful Wye Valley Ross-on-Wye is ideally situated for walkers. To continue your walking in the area you could try the Herefordshire Trail which runs through the countryside from Ross on Wye to Bromyard via Ledbury . Just to the south of the town is the lovely walk to Goodrich Castle and Coppet Hill . There's fascinating history, woodland trails and great views from the high points to enjoy here.",
  "county": "County of Herefordshire",
  "region": "West Midlands",
  "country": "England"
}