{
  "created_at": "2025-01-06T02:02:54.048676+00:00",
  "objectID": "599d95f4b0c4cd930ea7cb634b9375e2",
  "ref": "yeovil-country-park-walking-and-cycle-route",
  "title": "Yeovil Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Waterfall%2C_Nine_Springs_Country_Park_-_geograph.org.uk_-_1768073.jpg",
  "nearby": [
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Sutton Bingham Reservoir",
      "objectID": "b2a681038f51a7f0d09d753456c7ef62",
      "ref": "sutton-bingham-reservoir-walking-route"
    },
    {
      "description": "Ham Hill Country Park",
      "objectID": "a2ec85079a74bd0da7408f6741e7443b",
      "ref": "ham-hill-country-park-walking-and-cycle-route"
    },
    {
      "description": "Corton Denham",
      "objectID": "ecd561a581c6a1ec71c4a72e88c5b0c9",
      "ref": "corton-denham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/599d95f4b0c4cd930ea7cb634b9375e2.gpx",
  "_geoloc": {
    "lat": 50.9374878276,
    "lng": -2.6289151499
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Waterfall%2C_Nine_Springs_Country_Park_-_geograph.org.uk_-_1768073.jpg",
      "title": "Derek Harper / Waterfall, Nine Springs Country Park, via Wikimedia Commons",
      "caption": "Waterfall, Nine Springs Country Park. A set of limestone steps climb beside a cascade at the restored pleasure garden which formerly belonged to Aldon House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Above_Nine_Springs_-_geograph.org.uk_-_1768076.jpg",
      "title": "Derek Harper / Above Nine Springs, via Wikimedia Commons",
      "caption": "Above Nine Springs Yeovil. Footpath 2/9 crosses this slight re-entrant on the east (Constitution Hill) side of the valley containing the country park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Nine_Springs_Yeovil_-_geograph.org.uk_-_452218.jpg",
      "title": "Pam Goodey / Nine Springs Yeovil, via Wikimedia Commons",
      "caption": "Nine Springs Lake and woodland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Looking_over_to_Nine_Springs_-_geograph.org.uk_-_190517.jpg",
      "title": "sanityl / Looking over to Nine Springs, via Wikimedia Commons",
      "caption": "Looking over to Nine Springs. This is the view from a garden looking over to Nine Springs country park. You can also see the Yeovil ski centre just to the side"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Nine_Springs_Yeovil_Somerset_-_geograph.org.uk_-_1026040.jpg",
      "title": "Pam Goodey / Nine Springs Yeovil Somerset, via Wikimedia Commons",
      "caption": "View of the surfaced footpath running along the lake in autumn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Nine_Spring_Yeovil_-_geograph.org.uk_-_452207.jpg",
      "title": "Pam Goodey / Nine Spring Yeovil, via Wikimedia Commons",
      "caption": "Stepping stones over the little stream"
    }
  ],
  "distance_km": 4.5,
  "description": "This park, also known as Ninesprings Country Park, is situated in Yeovil, near the town centre. You will see rivers, lakes, waterfalls, open grassland, woodland and a children's play area as you pass through the 127 acres of the park. There are splendid views of the Dorset Hills and an abundance of wildlife with water voles, kingfishers, green woodpeckers and otters visitors to the park. The route below is devised for walkers but there is also a flat linear cyclepath which follows the line of the old railway and links the different areas of the country park. The Monarch's Way passes the eastern edge of the park. You could pick up the waymarked trail to further extend your walking around the Yeovil area. One nice idea is to follow it south towards the lovely Sutton Bingham Reservoir where there's nice waterside trails to try. Ham Hill Country Park is also nearby and offers fine views of the Mendip Hills, Blackdown Hills, Quantock Hills and Dorset Downs from the elevated viewpoint.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The park includes the Ninesprings Cafe where there's also an information centre for the country park. Here you can read about the history and wildlife of the park, as well as picking up maps and leaflets to find your way around. The café provides high quality hot and cold drinks, cakes and light bites. There's also a nice large picnic area where you can sit outside on warmer days."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great place to take your dog for a walk. The on site cafe mentioned above is also dog friendly. Cattle can be seen grazing on Summerhouse Hill and Wyndham Hill so please keep your dog on the lead in these areas."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "We recommend continuing your walking in the Yeovil area in the historic village of East Coker. It's located just a short distance to the south east of the town and features the noteworthy Coker Court. The historic building includes a noble hall complete with minstrel gallery and magnificent Jacobean fireplace. Within the churchyard lie the remains of the poet T.S. Eliot who once wrote a poem about East Coker. There's also the interesting church of St Michael, which was believed to have been built by Hugh de Courteney in 1276. The church is in an interesting location, situated on a hill overlooking the village. There's also the excellent Heylar Arms to visit. It's a pub of some note, being a Grade II listed building and dating from the 15th Century. The pub still retains a wealth of character and charm, set in the picturesque village of East Coker with its mellow stone and thatch cottages, almshouses, Historic Coker Court and St Michael’s church. There's an excellent menu, real log fires, a large sunny garden to sit in during the summer months and a car park that can accommodate over 30 cars. The inn also provides accommodation if you need to stay over. You can find the pub in the village on Moor Street with a postcode of BA22 9JR for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/RySf_qKT2bY",
  "postcode": "BA20 1DP",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Yeovil, Somerset, England, BA20 1DP, United Kingdom",
  "district": "Yeovil",
  "state": "England"
}