{
    "objectID": "59aa9299821d51a269dacbe9010e2989",
    "created_at": "2024-12-21T16:53:45.035432+00:00",
    "ref": "cushendall-walking-route",
    "title": "Cushendall Cliff Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/74/Cushendall_Bay_-_geograph.org.uk_-_239335.jpg",
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/931D934A853A8CBB86258B03003CEE11/$FILE/Cushendall.gpx",
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Cushendall_Bay_-_geograph.org.uk_-_239335.jpg",
            "title": "Bob Embleton / Cushendall Bay",
            "caption": "Cushendall Bay. Taken from near Limerick Point with the pillar in the foreground built to celebrate the millennium."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Cushendall_Beach_-_geograph.org.uk_-_5844814.jpg/512px-Cushendall_Beach_-_geograph.org.uk_-_5844814.jpg",
            "title": "Cushendall Beach by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Cushendall Beach"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/View_of_the_Antrim_Coast_-_geograph.org.uk_-_4813944.jpg/512px-View_of_the_Antrim_Coast_-_geograph.org.uk_-_4813944.jpg",
            "title": "View of the Antrim Coast by Anthony O'Neil, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "View of the Antrim Coast"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Salmon_Rocks_-_geograph.org.uk_-_467698.jpg",
            "title": "Anne Burgess / Salmon Rocks",
            "caption": "Salmon Rocks. An interesting outcrop of conglomerate and volcaniclastic rocks at the north end of Cushendall Bay, with Lurigethan in the distance."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Layd_Church_2014_09_18.jpg/512px-Layd_Church_2014_09_18.jpg",
            "title": "Andreas F. Borchert, CC BY-SA 3.0 DE <https://creativecommons.org/licenses/by-sa/3.0/de/deed.en>, via Wikimedia Commons",
            "caption": "Layd Church. The ruins of Layd Church, a Franciscan foundation possibly partially from the 13th century, are about 1.5 km north of Cushendall. They are also accessible by road and a cliff path from Cushendall. There are old vaults in the churchyard and it was one of the main burial places of the MacDonnells. There is a stone cross memorial to Dr James MacDonnell, one of the organisers of the last Belfast Festival of Harpists in 1792 and pioneer of the use of chloroform in surgery. By the gate of the churchyard is a holestone and nearby two 'corp stones' on which coffins were rested. Layd Church saw service as a parish church from 1306 until about 1790."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Port_Obe_-_geograph.org.uk_-_466877.jpg",
            "title": "Anne Burgess / Port Obe",
            "caption": "Port Obe The cliff path from Layd Church offers a view down to the shore here."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/High_Street%2C_Cushendall_-_geograph.org.uk_-_1941422.jpg",
            "title": "High Street, Cushendall by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "High Street, Cushendall. Located on the A2 coast road between Glenariff and Cushendun, Cushendall is in the Antrim Coast and Glens an Area of Outstanding Natural Beauty. It lies in the shadow of the table topped Lurigethan Mountain and at the meeting point of three of the Glens of Antrim: Glenaan, Glenballyemon and Glencorp. This part of the Northern Irish coastline is separated from Scotland by the North Channel, with the Mull of Kintyre about 16 miles away. In the 2011 Census, Cushendall had a population of 1,280 people."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Cushendall_Bridge_-_geograph.org.uk_-_5844771.jpg/512px-Cushendall_Bridge_-_geograph.org.uk_-_5844771.jpg",
            "title": "Cushendall Bridge by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Cushendall Bridge. Much of the historic character of the 19th century settlement on the north bank of the River Dall remains, including the mostly-intact Irish Georgian buildings of the town's four original streets. In 1973, it was the second village in Northern Ireland to be designated as a Conservation Area. Since 1990, Cushendall has hosted the Heart Of The Glens festival every August. Thomas D'Arcy McGee, a father of Canadian Confederation, spent his childhood in Cushendall when his father, who worked for the Coast Guard Service, was posted there."
        }
    ],
    "distance_km": 2.9,
    "description": "This walk takes you along a lovely section of the Antrim coast in the delightful Georgian village of Cushendall. You can start the walk at the beach car park on the sea front and then follow a footpath north to the ruins of the ancient Layd Church. The path rises steadily offering some wonderful views over the Bay. On a clear day you can even see Scotland's Mull of Kintyre and Ailsa Craig. To continue your walking in the area head to the nearby Glenariff Forest Park where there's waterfalls, forest trails and riverside paths to enjoy. Please scroll down for the full list of walks near and around Cushendall. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
    "video_url": "https://www.youtube.com/embed/3E44WzAtDOw?si=kO2oWiIYzTTnRppv"
}
