{
  "created_at": "2025-01-06T03:56:46.257779+00:00",
  "objectID": "5b72e7516929a13798749e376afe3438",
  "ref": "danbury-country-park-walking-route",
  "title": "Danbury Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/21/Danbury_Country_Park_-_geograph.org.uk_-_732647.jpg",
  "nearby": [
    {
      "description": "Blake's Wood",
      "objectID": "875501b80003f131ef251004a208a9a0",
      "ref": "blakes-wood-walking-route"
    },
    {
      "description": "Chelmsford",
      "objectID": "94b758bb80a2d6de2d29eadb16929751",
      "ref": "chelmsford-walking-route"
    },
    {
      "description": "Danbury Common",
      "objectID": "baeb9966ddcd6c9b63c758197707785b",
      "ref": "danbury-common-walking-and-cycle-route"
    },
    {
      "description": "Hylands Park",
      "objectID": "6f09d65f177a6c630022db601c9a7ed4",
      "ref": "hylands-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5b72e7516929a13798749e376afe3438.gpx",
  "_geoloc": {
    "lat": 51.7136826808,
    "lng": 0.5623691649
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Danbury_Country_Park_-_geograph.org.uk_-_732647.jpg",
      "title": "Robert Edwards / Danbury Country Park",
      "caption": "Danbury Country Park. This is the main entrance to the park from the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Danbury_Lakes_-_Middle_Lake_-_geograph.org.uk_-_332407.jpg",
      "title": "Malcolm Reid / Danbury Lakes - Middle Lake",
      "caption": "Danbury Lakes - the lakes are man made. They were created in the 14th century by the then Lord of the Manor, to provide a supply of carp for his table. A stream feeds the upper lake and water then flows to the middle lake and then the lower lake, from where it exits into a continuation of the stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Danbury_Lakes_-_Lower_Lake_-_geograph.org.uk_-_332415.jpg",
      "title": "Malcolm Reid / Danbury Lakes - Lower Lake",
      "caption": "The Lower Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Pond_at_Danbury_Lakes_-_geograph.org.uk_-_320398.jpg",
      "title": "Malcolm Reid / Pond at Danbury Lakes",
      "caption": "Near the upper car park is a small pond. For years this was stagnant and covered in algae. It has recently cleaned up and is now an attractive feature, in addition to the main lakes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Danbury_Palace_-_geograph.org.uk_-_325890.jpg",
      "title": "Malcolm Reid / Danbury Palace",
      "caption": "Danbury Palace on the north western tip of the park. Mr John Round bought Danbury Park and \u0093The Place\u0094 as it was then called in 1826. The Architect Thomas Hopper built the new Danbury Place a couple of hundred feet from the old building. In 1845 John Round sold the house to the Ecclesiastical Commissioners as a home for the Bishop of Rochester when it became known as Danbury Palace. A few years later a Chapel was built to the rear. In 1892 the Palace was sold to Seth Taylor of Putney who sold it on in 1899 to Hugh Hoare. He cut down lots of Oak Trees and in 1903 sold it to the Hon Alwyn Greville. In 1919 it was bought by General Wigan. During the Second World War it was used as a Maternity Hospital and in 1945 the late Queen Mother visited to present a layette to the 2,000th baby to be born there."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/%22Danbury_Outdoors%22_Activity_Centre_-_geograph.org.uk_-_399760.jpg",
      "title": "Malcolm Reid / \"Danbury Outdoors\" Activity Centre",
      "caption": "\"Danbury Outdoors\" Activity Centre to the north east of the park. This is the lane leading to \u0093Danbury Outdoors\u0094. Its entrance is shared with that of Danbury Park School and is located in Well Lane, close to the A414. Danbury Outdoors is an outdoor education and activity centre located in seventy acres parkland. It offers a number of courses in activities such as mountain biking, climbing, kayaking and canoeing, from introductory level through to professional training for aspiring instructors. Danbury Outdoors also runs Duke of Edinburgh and Basic Expedition Leader Award (BELA) training schemes."
    }
  ],
  "distance_km": 1.5,
  "description": "This country park in Essex has a number of good walking trails to enjoy. There's a lakeside walk taking you around the two pretty lakes where you can look out for ducks, swans and carp. The Garden Walk takes you around the lovely ornamental gardens and through the wildflower meadow. Here you can see rhododendrons in the garden and various butterflies and insects in the meadows. Finally there is a woodlands trail through the park's ancient oaks, hornbeams and sweet chestnuts. The park is located just a few miles east of Chelmsford. Danbury is an excellent area for walking. You can easily extend your walk by heading north to Lingwood Common and Blake's Wood where you will find orchids and carpets of bluebells in the spring. You can also head a mile to the east to Danbury Common where there are miles of National Trust managed footpaths. The lovely Hylands Park is also nearby. It's a fantastic place for a walk with 574 acres of parkland with ancient woodland, grassland, ponds, lakes and formal gardens. In Chelmsford itself you can enjoy riverside walks along the River Can and River Chelmer.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The woods and lakeside trails are ideal for dog walking. You are likely to bump into other owners on your visit."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you could explore the pretty village of Little Baddow where you can visit the Chelmer and Blackwater Navigation Canal, the picturesque Paper Mill Lock and the National Trust's Blake's Wood. For more walking ideas in the area see the Essex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/E0jTsgqew3Y",
  "district": "Chelmsford",
  "county": "Essex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Woodhill Road, Danbury, Chelmsford, Essex, England, CM3 4AL, United Kingdom",
  "postcode": "CM3 4AL",
  "state": "England"
}