{
  "created_at": "2025-01-06T00:50:30.515211+00:00",
  "objectID": "5bb1624348c4d5386a26d814a6c2fa28",
  "ref": "stapleford-woods-walking-route",
  "title": "Stapleford Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/94/Stapleford_Woods_-_geograph.org.uk_-_77581.jpg",
  "nearby": [
    {
      "description": "Trent Valley Way",
      "objectID": "deaeed2d2c582aa7fdfd01f9dcce589a",
      "ref": "trent-valley-way-walking-route"
    },
    {
      "description": "Newark River Walk",
      "objectID": "19e1b075b6f6f4f1c426032a2356b004",
      "ref": "newark-river-walk-walking-route"
    },
    {
      "description": "Culverthorpe",
      "objectID": "65e6164f0145b60ffff2d668e1fa48be",
      "ref": "culverthorpe-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5bb1624348c4d5386a26d814a6c2fa28.gpx",
  "_geoloc": {
    "lat": 53.0995359108,
    "lng": -0.7153950044
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Stapleford_Woods_-_geograph.org.uk_-_77581.jpg",
      "title": "Bob Danylec / Stapleford Woods, via Wikimedia Commons",
      "caption": "The place for a peaceful walk which plays host to a large number of exotic trees. Stapleford is famous for its rhododendrons which are throughout the wood. These grow to impressive heights of up to 7 metres (23 ft)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Stapleford_Woods_-_geograph.org.uk_-_1391419.jpg",
      "title": "Richard Croft / Stapleford Woods, via Wikimedia Commons",
      "caption": "Bridleway on a sunny day. Samual Keetly was the pioneer of Stapleford Wood, planting the first trees on Stapleford Moor in 1785. The boundary of the ancient woods follows the county boundary between Lincolnshire and Nottinghamshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Stapleford_Woods_-_geograph.org.uk_-_439626.jpg",
      "title": "Kate Jewell / Stapleford Woods, via Wikimedia Commons",
      "caption": "A Forestry Commission mixed woodland, Stapleford Woods are famous for a large number of exotic trees and rhododendrons. There are many surfaced trails and woodland walks throughout and a large carpark off Coddington Lane, the road that goes right through the middle of the Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Norton_Road%2C_Stapleford_-_geograph.org.uk_-_2944556.jpg",
      "title": "Norton Road, Stapleford by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Norton Road, Stapleford. A view of the village which lies just to the north east of the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/All_Saints%27_church_-_geograph.org.uk_-_4903918.jpg/512px-All_Saints%27_church_-_geograph.org.uk_-_4903918.jpg",
      "title": "All Saints' church by Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "All Saints' church. This church in the village is well worth a visit. It dates to the 11th century and is Grade II listed. In the churchyard is a Grade II listed and scheduled churchyard cross which dates from the 14th century, and is believed to stand in its original position."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Moor_Lane_-_geograph.org.uk_-_1387378.jpg",
      "title": "Richard Croft / Moor Lane",
      "caption": "Moor Lane track to the woods."
    }
  ],
  "distance_km": 1.5,
  "description": "This area of ancient woodland near Newark on Trent has some nice footpaths taking you around the forest. In the woods you will find large Victorian era-planted Rhododendrons and other interesting flora and fauna. There is a car park off Coddington Lane where you can pick up the circular surfaced walking trail. It runs for just under a mile and is a nice way to spend half an hour. To extend your walking in the area you could head a couple of miles west and pick up the Trent Valley Way. The lovely riverside trail runs through Newark-on-Trent and Collingham. The woods are close to the villages of Coddington and Beckingham which are nice places to go for refreshments after your walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south west from the woods and you will soon come to the village of Coddington. Here you will find the Inn on the Green which is a great choice for some post walk refreshments. Now very much at the heart of Coddington village, The Inn on The Green was once part of a farm and maltings complex that fronted the Green. In 1948 it was put up for sale and was subsequently converted to a Country Club. The licence was changed in the 1970s and since then it has been a pub and restaurant, serving the local community and beyond. There's a very good menu and a nice outdoor seating area for warmer days. You can find the pub on Main Street with a postcode of NG24 2PS for your sat navs. Head south east from the woods to the village of Beckingham and you can visit the Black Swan. The pub is known for its excellent food a nice atmosphere. You can find it at postcode LN5 0RQ for your sat navs. You could also head into nearby Collingham where you'll find The Royal Oak. The friendly Community Pub has a good menu and drinks selection. There's also a large garden which has been extended and landscaped with trees, plants, patio areas and lawn. It's a lovely spot to relax in on warmer days. You can find them on Station Road with a postcode of NG23 7RA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are a great place for dog walking with miles of wide trails to explore."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north west you can pick up the Collingham and Cromwell Lock Walk. The noteworthy lock includes one of the largest weirs on the Trent which marks the tidal limit of the river. For more walking ideas in the area see the Nottinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lxjMDtuk5rA",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Coddington Lane, Moor Farm, Stapleford, North Kesteven, Lincolnshire, England, LN6 9LE, United Kingdom",
  "postcode": "LN6 9LE",
  "district": "North Kesteven",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half hour",
  "difficulty": "easy",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature"
  ],
  "facilities": [
    "car park",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}