{
  "created_at": "2025-01-06T01:04:22.199893+00:00",
  "objectID": "5bc4b009e5f55291cb1ecca1d63040a5",
  "ref": "coed-y-brenin-forest-park-walking-and-cycle-route",
  "title": "Coed Y Brenin Forest Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ea/The_path_linking_the_car_park_at_Y_Ganllwyd_with_the_Coed_y_Brenin_Forest_-_geograph.org.uk_-_489025.jpg",
  "nearby": [
    {
      "description": "Precipice Walk Dolgellau",
      "objectID": "9ec2f2c977032eee1270654ff68770df",
      "ref": "precipice-walk-dolgellau-walking-route"
    },
    {
      "description": "Mawddach Trail",
      "objectID": "e02916b5aa92bfacf3a1ccdc36a9baa0",
      "ref": "mawddach-trail-walking-and-cycle-route"
    },
    {
      "description": "Panorama Walk Barmouth",
      "objectID": "60177b109537918a13d4646a00a56e2b",
      "ref": "panorama-walk-barmouth-walking-route"
    },
    {
      "description": "New Precipice Walk",
      "objectID": "c0f5197b64291ab640c21e94409f357f",
      "ref": "new-precipice-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5bc4b009e5f55291cb1ecca1d63040a5.gpx",
  "_geoloc": {
    "lat": 52.8230202355,
    "lng": -3.8954967018
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/The_path_linking_the_car_park_at_Y_Ganllwyd_with_the_Coed_y_Brenin_Forest_-_geograph.org.uk_-_489025.jpg",
      "title": "Eric Jones / The path linking the car park at Y Ganllwyd with the Coed y Brenin Forest",
      "caption": "The path linking the car park at Y Ganllwyd with the Coed y Brenin Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Afon_Eden_-_geograph.org.uk_-_62698.jpg",
      "title": "Peter Shone / Afon Eden",
      "caption": "Afon Eden. This close up of the Afon Eden is taken at a spot adjacent to the Coed Y Brenin forest activity centre car park. Hard to believe that the huge boulders in the stream were hurled there by the power of this stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Coed_Y_Brenin._-_geograph.org.uk_-_240222.jpg",
      "title": "Hefin Richards / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Coed Y Brenin. On a clear day it's possible to see the towers of Trawsfynnydd Power Station from the Northern end of Precipice Walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Forest_Garden_-_Coed_y_Brenin_-_geograph.org.uk_-_1290148.jpg",
      "title": "Claire Willatt / Forest Garden - Coed y Brenin",
      "caption": "Forest Garden. Across the bridge is a network of formal and informal paths winding their way amongst the collection of trees from around the World."
    }
  ],
  "distance_km": 8.0,
  "description": "This large forest in Snowdonia is fantastic for both cycling and walking. For walkers there are 4 well devised, all ability trails taking place on wide well maintained paths. The trails take you along the Afon Eden on a sculpture lined riverside path and along a disused tramway to the old Copper processing mill. If you're looking for more strenuous walking then you can pick up one of the 3 difficult routes. The waterfall trail takes you to the confluence of the Afon Gain and Mawddach with their twin waterfalls. The mountain trail climbs to the Mynydd Penrhos ridge with spectacular views of the surrounding area. Cyclists can follow a National Cycle Network trail which runs through the park. There are also a number of graded mountain bike trails. Depending on your ability and experience you can follow the blue moderate trail for a good introduction to singletrack mountain biking. The red trails are more difficult while the black (severe) trails are for the experienced mountain biker. There are 7 trails in all plus an easy forest road trail that follows the Mawddach river valley. This one is good for families looking for a more relaxing ride! The circular route below starts near the visitor centre and takes you along the National Cycle Network trail and a riverside track. It's suitable for both walkers and cyclists.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's an on site cafe at the visitor centre selling a good range of meals and snacks."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The forest is a great place to bring your dog for a walk so you'll probably see plenty of other owners with their pets on a fine day. You can find water bowls outside the shop and cafe too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a short distance south of the forest and you can try the excellent Precipice Walk in Dolgellau. The elevated trail takes you around Llyn Cynwch with wonderful views over the forest from the high points. Near here there is also the New Precipice Walk which can be picked in the little village of Llanelltyd. In Dolgellau you can also pick up the Mawddach Trail to take you along the river to Barmouth. Here you can try the Panorama Walk and the climb to Dinas Oleu for more great views over the river estuary. Just to the east of Dolgellau there's the circular Torrent Walk which explores the Afon Clywedog gorge with its old mills, pretty waterfalls and rushing weirs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/JUR5lzcNP24",
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "First Steps, Ganllwyd, Gwynedd, Cymru / Wales, LL40 2HZ, United Kingdom",
  "postcode": "LL40 2HZ",
  "district": null,
  "state": "Cymru / Wales"
}