{
  "created_at": "2025-01-06T00:58:19.913064+00:00",
  "objectID": "5bd5ae06f1bcb85ffa57c02b856ea749",
  "ref": "bakewell-railway-walk-walking-route",
  "title": "Bakewell Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Bakewell_Station_Industrial_Estate_-_Monsal_Trail_View_-_geograph.org.uk_-_720738.jpg",
  "nearby": [
    {
      "description": "Monsal Trail",
      "objectID": "725064cd118a55da0f494227d083e732",
      "ref": "monsal-trail-walking-and-cycle-route"
    },
    {
      "description": "Monsal Head",
      "objectID": "3cc86a6a6c74fa8c4b917e7d16d82831",
      "ref": "monsal-head-walking-route"
    },
    {
      "description": "Ashford in the Water",
      "objectID": "5e81f768bd02d48460eb246cabd408ae",
      "ref": "ashford-in-the-water-walking-route"
    },
    {
      "description": "Bakewell to Chatsworth Walk",
      "objectID": "9381e228bfc49a85147871ec3d61562c",
      "ref": "bakewell-to-chatsworth-walk-walking-route"
    },
    {
      "description": "Bakewell",
      "objectID": "10cecdad4b682e8a0ca4ead897f79f8f",
      "ref": "bakewell-walking-route"
    },
    {
      "description": "Monsal Trail Circular Walk",
      "objectID": "4627ef63e6c2f99fe3c08313b53bb93b",
      "ref": "monsal-trail-circular-walk-walking-route"
    },
    {
      "description": "Miller's Dale",
      "objectID": "b1b5451a34708ce105fcf182f5d6a29b",
      "ref": "millers-dale-walking-route"
    },
    {
      "description": "Chee Dale",
      "objectID": "92895eb215d7202c7c0f2ee552a4b494",
      "ref": "chee-dale-walking-route"
    },
    {
      "description": "Buxton",
      "objectID": "8f661296a4e61112f48f62fcbf2dd9b6",
      "ref": "buxton-walking-route"
    },
    {
      "description": "Great Longstone",
      "objectID": "30d5cfe123b4dde0820638e2441aa837",
      "ref": "great-longstone-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5bd5ae06f1bcb85ffa57c02b856ea749.gpx",
  "_geoloc": {
    "lat": 53.2144591817,
    "lng": -1.6702530126
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Bakewell_Station_Industrial_Estate_-_Monsal_Trail_View_-_geograph.org.uk_-_720738.jpg",
      "title": "Alan Heardman / Bakewell Station Industrial Estate - Monsal Trail View",
      "caption": "Bakewell Station Industrial Estate. Monsal Trail View"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Monsal_Trail%2C_with_solitary_walker_%28black_cat%29_-_geograph.org.uk_-_1463200.jpg",
      "title": "Peter Barr / Monsal Trail, with solitary walker (black cat)",
      "caption": "View from Baslow Road bridge, at Pineapple House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Country_Bookshop_and_Caf%C3%A9_-_geograph.org.uk_-_1012141.jpg",
      "title": "Steve F / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Country Bookshop and Café In what I believe was Hassop's railway station. A pay and display car park for the Monsal Trail is behind the store."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Great_Longstone_Station_-_geograph.org.uk_-_244846.jpg",
      "title": "John M / Great Longstone Station",
      "caption": "Great Longstone Station. Former railway station on the Monsal Trail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Monsal_Dale_and_Monsal_Head_Viaduct_-_geograph.org.uk_-_1081570.jpg",
      "title": "David Stowell / Monsal Dale and Monsal Head Viaduct",
      "caption": "Monsal Dale and Monsal Head Viaduct. Looking down from the viewing point at Monsal Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Pennyunk_Lane_-_Pond_restoration_in_the_White_Peak_-_geograph.org.uk_-_755724.jpg",
      "title": "Alan Heardman / Pennyunk Lane - Pond restoration in the White Peak",
      "caption": "Pennyunk Lane. Pond restoration in the White Peak"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Sheepwash_Bridge._-_geograph.org.uk_-_448691.jpg",
      "title": "Graeme Walker / Sheepwash Bridge.",
      "caption": "Sheepwash Bridge in Ashford in the Water. A mediaeval packhorse bridge near the site of the original ford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Monsal_Trail%2C_Bakewell_-_geograph.org.uk_-_1552701.jpg",
      "title": "Peter Barr / Monsal Trail, Bakewell",
      "caption": "View of the tree lined trail near Bakwell"
    }
  ],
  "distance_km": 12.0,
  "description": "This circular railway walk from Bakewell uses part of the Monsal Trail to take you to the nearby Monsal Head. You'll then visit the neighbouring village of Ashford in the Water before returning to the town. The walk runs for just under 8 miles with some fine Peak District scenery to enjoy on the way. Start the walk on the eastern side of the river in Bakewell. Near here you can pick up the Monsal Trail and follow the old railway track north west to Monsal Head, passing Great Longstone on the way. Here you can visit the Headstone Viaduct and the Monsal Head Hotel. This is a nice place for some refreshments at what is roughly the half way point on the walk. There's also fabulous views down to the Wye Valley and the lovely Monsal Dale from the elevated position of the Head. The route then heads south and then east along Pennyunk Lane to take you into Ashford in the Water. This delightful village is well worth exploring with quaint stone cottages, fine old pubs and great views of the river and the old Sheep Wash Bridge. From the village you head east along the River Wye to Bakewell, passing the Lumford Mill on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off at the Hassop Station Cafe housed in the old Hassop Railway Station building. They have a sun terrace on the old platform, overlooking the trail, where you can watch the world cycle by over lunch. You can find it at postcode DE45 1NW just north of Bakewell. Just off the trail near Monsal Head you will pass the delightful village of Little Longstone. Here you can pay a visit to the excellent Packhorse Inn. This historic pub has a fine range of ales and a cosy real fire indoors. Outside there's a lovely garden area where you can relax on warmer days. You can find the pub in the pretty little village at postcode DE45 1NN. Back in Bakewell head to the Rutland Arms for some refreshments after your walk. The pub dates all the way back to 1804 and is reputed to be the origin of the famous Bakewell Pudding. The pudding is though to have originated through a mistake by the cook at the hotel in the 1860s. A Strawberry Tart was ordered for the guest and instead of stirring the egg mixture into the pastry, the cook poured it over the strawberry jam. The pudding was so well received by the guest that the recipe became recognised as the Bakewell Pudding. The hotel can also boast a unique connection with author, Jane Austen. Local legend has it that she stayed in one of the rooms whilst writing her most famous text, Pride and Prejudice. The hotel does fine food in both the bar and restaurant and also provide good quality accommodation if you need to stay over. You can find the hotel on The Square at a postcode of DE45 1BT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a great walk for fit dogs and the Rutland Arms pub mentioned above also welcomes dogs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walk along the trail you could try the Monsal Trail Circular Walk which visits the beautiful Miller's Dale. Continuing west along the trail will eventually take you to Chee Dale and Buxton. The trail also passes the worthy village of Great Longstone to the north west of Bakewell. The historic village includes a 13th century church and a fine 17th century pub. Our circular walk from the village climbs to the splendid limestone ridge at Longstone Edge, just to the north of the settlement. Just to the west you will find the village of Sheldon and the noteworthy Magpie Mine. Here you can explore a series of well preserved Lead Mines which date back to the 1600s. The historical site is a Scheduled Ancient Monument and another of the local area highlights. For more walking ideas in the area see the White Peak Walks page."
    }
  ],
  "postcode": "DE45 1AR",
  "district": "Derbyshire Dales",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Coombs Road, Bakewell CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE45 1AR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "railway",
    "rural"
  ],
  "points_of_interest": [
    "viewpoint",
    "village",
    "bridge"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}