{
    "created_at": "2025-01-06T09:27:34.502735+00:00",
    "objectID": "5c146ed119db23d76f563e92b937f10f",
    "ref": "high-peak-trail-walking-and-cycle-route",
    "title": "High Peak Trail Walking and Cycle Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/High_Peak_Trail%2C_High_Peak_Junction_-_geograph.org.uk_-_1731149.jpg/512px-High_Peak_Trail%2C_High_Peak_Junction_-_geograph.org.uk_-_1731149.jpg",
    "nearby": [
        {
            "description": "Arbor Low",
            "objectID": "2333e94a5e373ff76e46ed761173e6ae",
            "ref": "arbor-low-walking-route"
        },
        {
            "description": "Black Rocks Cromford",
            "objectID": "128f1d1dd677cfb67ad2e0ee691a5a2d",
            "ref": "black-rocks-cromford-walking-route"
        },
        {
            "description": "Wirksworth",
            "objectID": "e996562ac3866e19779d9419a43c3a5e",
            "ref": "wirksworth-walking-route"
        },
        {
            "description": "Tissington Trail",
            "objectID": "b6e428f335e074a550ea488db65c3cd6",
            "ref": "tissington-trail-walking-and-cycle-route"
        },
        {
            "description": "Middleton Top",
            "objectID": "373cee091e543a8b53591a7574cd4ed3",
            "ref": "middleton-top-walking-route"
        },
        {
            "description": "Carsington Water",
            "objectID": "34d871040a2913342df849c089af1e7e",
            "ref": "carsington-water-walking-and-cycle-route"
        },
        {
            "description": "Parwich",
            "objectID": "46119e1f2e44181301b63d04f17a3c50",
            "ref": "parwich-walking-route"
        },
        {
            "description": "High Peak Trail",
            "objectID": "5c146ed119db23d76f563e92b937f10f",
            "ref": "high-peak-trail-walking-and-cycle-route"
        },
        {
            "description": "National Cycle Route 54",
            "objectID": "4793381d6c8ec2c65169b2851c0ab418",
            "ref": "national-cycle-route-54"
        }
    ],
    "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5c146ed119db23d76f563e92b937f10f.gpx",
    "_geoloc": {
        "lat": 53.0993014421,
        "lng": -1.5322801642
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/High_Peak_Trail%2C_High_Peak_Junction_-_geograph.org.uk_-_1731149.jpg/512px-High_Peak_Trail%2C_High_Peak_Junction_-_geograph.org.uk_-_1731149.jpg",
            "title": "Paul Buckingham / High Peak Trail, High Peak Junction, via Wikimedia Commons",
            "caption": "High Peak Junction End of the High Peak Trail. The fenced of area with Rail Track is in fact the pit for one of the cable pulleys which once served the inclined plane leading uphill from the junction."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/High_Peak_Trail_-_geograph.org.uk_-_804883.jpg",
            "title": "Tony Bacon / High Peak Trail, via Wikimedia Commons",
            "caption": "High Peak Trail Tunnel taking the High Peak Trail under the A6 trunk road."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/High_Peak_Trail_-_geograph.org.uk_-_1221154.jpg",
            "title": "Stephen G Taylor / High Peak Trail, via Wikimedia Commons",
            "caption": "The disused railway line, heading through the trees towards Gotham curve."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/High_Peak_Trail_-_geograph.org.uk_-_1625731.jpg",
            "title": "Peter Barr / High Peak Trail, via Wikimedia Commons",
            "caption": "Several paths and a farm track meet here, by a redundant quarry, and not far from Middleton Top"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/High_Peak_Trail_-_geograph.org.uk_-_106306.jpg",
            "title": "John Darch / High Peak Trail, via Wikimedia Commons",
            "caption": "A section of the High Peak Trail (now forming the most southerly section of the Pennine Bridleway) just north of the old Hurdlow Station which closed in 1967."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/High_Peak_Trail_-_geograph.org.uk_-_567713.jpg",
            "title": "Alan Heardman / High Peak Trail, via Wikimedia Commons",
            "caption": "The trail passes through a former railway cutting at this point at Pikehall. Autumn colours are starting to show."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/High_Peak_Trail_View_-_geograph.org.uk_-_825813.jpg",
            "title": "Alan Heardman / High Peak Trail View, via Wikimedia Commons",
            "caption": "This view looks over Cromford towards Matlock Bath, with Abrahams Heights and High Tor clearly visible."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/High_Peak_Trail_-_geograph.org.uk_-_139411.jpg",
            "title": "Mike Fowkes / High Peak Trail, via Wikimedia Commons",
            "caption": "Cyclists on the trail near Parsley Hay."
        }
    ],
    "distance_km": 28.0,
    "description": "This splendid, shared walking and cycle trail follows a disused railway line from Cromford to Dowlow through the beautiful Peak District. The trail starts near Cromford railway station and climbs through the stunning High Peak area of Derbyshire giving fabulous views of the area. The trail links with the popular Tissington Trail at High Peak Junction. It's a similar trail trail running from Parsley Hay in the north to Ashbourne in the south. Highlights on the route include the fascinating Neolithic henge monument of Arbor Low at Parsley Hay. Near Cromford you will also pass the noteworthy Middleton Top. Here you'll find an excellent visitor centre with good facilities and a wealth of information on the area. There's also the historic Middleton Top Engine House, built in 1829 and fabulous views down to the nearby Carsington Water. For more information on this trail, including picnic areas and cycle hire please click here",
    "details": [
        {
            "subtitle": "Pubs/Cafes",
            "content": "Head to Wheatcroft’s Wharf at Cromford Mills for some lovely canalside refreshments. There's several tables right next to the water making it the ideal spot to relax on a fine day. They have a good menu with fresh ‘made to order’ food from oven baked potatoes to homemade soup, Paninis, Pizza, summer salads or a simple sandwich. The site is also worth spending some time at with a wealth of information on this area. Cromford Mill is the home of Sir Richard Arkwright’s first mill complex, birthplace of the modern factory system and internationally recognised as a UNESCO World Heritage Site. Inside the centre there's interactive displays, games and puzzles that tell the story of how the valley changed the world in the 18th Century with the growth of the British cotton industry and its global impact. You can find the site at a postcode of DE4 3RQ for your sat navs.  Pictured above the Arkwirght Mill and the cafe at Cromford Mills. You could also stop off in Wirksworth at The Blacks Head. They have a good menu and a lovely sun trap garden area for warmer days. It's cosy indoors with log burners during the chilly months. You can find them on the Market Place at postcode DE4 4ET for your sat navs. Slightly off the trail there's the worthy village of Brassington where you'll find the Olde Gate Inn. The historic inn dates back to the 17th century and is Grade II listed. Bonnie Prince Charlie’s soldiers were billeted at the inn on their march to London, and some of the oak beams came from ships of the Spanish Armada. It's been named Britain’s cosiest pub by The Times with its charming interior and roaring fires. Outside there's a lovely large garden area with fine views. They serve high quality gastro food and have a good selection of ales. You can find them on Well Street with a postcode of DE4 4HJ​ for your sat navs. The attractive village is a pleasant place for a stroll too, with several centuries old limestone cottages, a church dating from the Norman period and a notable Tudor house built in 1615. In the historic village of Parwich there's the noteworthy Sycamore Inn to try. The limestone inn dates all the way back to the 1600s and is in a lovely spot close to the pretty village green. They serve good quality home cooked food and a fine ranges of ales. You can find them at postcode DE6 1QL for your sat navs. The inn also serves as the village shop so you can pick up various bits and bobs here too. In Hurdlow there's The Royal Oak located next to the Hurdlow car park which is another good access point for the trail. The charming country pub sells high quality food and has a fine interior with timber beams and cosy fires. Outside there's also an attractive garden and a campsite if you'd like to stay in the area. You can find them at postcode SK17 9QJ."
        },
        {
            "subtitle": "Further Information and Other Local Ideas",
            "content": "The trail uses a section of National Cycle Route 54. The long distance Sustrans cycle route runs from Stourport to Parsley Hay via Derby, Burton, Dudley and Kidderminster."
        }
    ],
    "video_url": "https://www.youtube.com/embed/xn_45jJVGdU",
    "postcode": "DE4 5HS",
    "district": "Derbyshire Dales",
    "county": "Derbyshire",
    "region": "East Midlands",
    "country": "United Kingdom",
    "gazetteer_found": true,
    "nominatim_found": true,
    "display_address": "Derby Road, Cromford CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE4 5HS, United Kingdom",
    "state": "England",
    "llama_cpp": true,
    "estimated_duration": "2-3 hours",
    "difficulty": "moderate",
    "terrain": ["woodland", "rural"],
    "points_of_interest": ["henge monument", "engine house", "visitor center"],
    "facilities": ["visitor center", "car park", "picnic area", "cycle hire"],
    "route_type": "circular",
    "activities": ["walking", "cycling"]
}
