{
  "created_at": "2025-01-06T01:03:53.164405+00:00",
  "objectID": "5c830aa6ab6f1afe01e3d1229274bc2a",
  "ref": "longdendale-trail-walking-and-cycle-route",
  "title": "Longdendale Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/52/Information_sign_on_Longdendale_Trail_-_geograph.org.uk_-_619898.jpg",
  "nearby": [
    {
      "description": "Bottoms Reservoir",
      "objectID": "70b8f7f6fdf12c499ec98608e380bcd9",
      "ref": "bottoms-reservoir-walking-route"
    },
    {
      "description": "Crowden",
      "objectID": "76a2565dbdf2e1b22e8f9ba54337966c",
      "ref": "crowden-walking-route"
    },
    {
      "description": "Pennine Cycleway",
      "objectID": "e0c353fccc4ac5dbe93a976156f9c8e2",
      "ref": "pennine-cycleway-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5c830aa6ab6f1afe01e3d1229274bc2a.gpx",
  "_geoloc": {
    "lat": 53.4613557064,
    "lng": -1.96482999
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Information_sign_on_Longdendale_Trail_-_geograph.org.uk_-_619898.jpg",
      "title": "David Lally / Information sign on Longdendale Trail",
      "caption": "Information sign on Longdendale Trail Behind is Bottoms reservoir and the village of Tintwistle. Longdendale is the name given to the upper valley of the River Etherow. The trail follows the line of the old Manchester - Sheffield line originally opened in 1845 by the Sheffield, Ashton-Under-Lyne and Manchester Railway. Closed to passengers in 1970 and freight in 1981."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Longdendale_Trail_at_Woodhead_Reservoir_-_geograph.org.uk_-_949949.jpg",
      "title": "Chris Wimbush / Longdendale Trail at Woodhead Reservoir",
      "caption": "Longdendale Trail at Woodhead Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Road_Bridge_over_the_Longdendale_Trail_-_geograph.org.uk_-_1277571.jpg",
      "title": "SMJ / Road Bridge over the Longdendale Trail",
      "caption": "Road Bridge over the Longdendale Trail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Longdendale_Trail_with_bridge_-_geograph.org.uk_-_245516.jpg",
      "title": "Stephen Craven / Longdendale Trail with bridge",
      "caption": "Trail and bridge. The bridge is the Hadfield to Padfield road. The trail is part of the Trans-Pennine Route (National Cycle Route 62) and follows the route of the old Great Central Railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Longdendale_Trail_near_Deepclough_-_geograph.org.uk_-_949910.jpg",
      "title": "Chris Wimbush / Longdendale Trail near Deepclough",
      "caption": "Near Deepclough"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Path_to_Longdendale_Trail_from_Padfield_-_geograph.org.uk_-_949892.jpg",
      "title": "Chris Wimbush / Path to Longdendale Trail from Padfield",
      "caption": "From Padfield"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Woodhead_Reservoir_Overflow_Channel_-_geograph.org.uk_-_436853.jpg",
      "title": "Manchester Warrior / Woodhead Reservoir Overflow Channel",
      "caption": "Woodhead Reservoir Overflow Channel. This picture shows a brimfull Woodhead Reservoir overflowing into the overflow channel located at the Western end of the reservoir. The dam wall and the concrete overflow channel just downstream of here was substantally strengthened in the late 1980's. In the background is the B6105 road which joins the A628 trunk road at the top of the rise."
    }
  ],
  "distance_km": 13.0,
  "description": "This splendid cycling and walking trail follows a disused railway line through the Longdendale in the Peak District National Park. The path starts in Hadfield and runs alongside a series of beautiful reservoirs including Bottoms Reservoir, Torside Reservoir, Woodhead Reservoir and Rhodeswood Reservoir before finishing at Salter's Brook. It runs for just over 8 miles on a gradually ascending path which is ideal for both cyclists and walkers. There's also fine views of the lovely rolling hills and countryside for the duration of the route. It's easy to access with a train station and public car park right next to the start point at the western end in Hadfield. The route is part of National Cycle Route 62 which runs for 208 miles from the Lancashire coast at Fleetwood to Selby in North Yorkshire. You could extend your exercise by contuing along the signed route into the Peak District and beyond.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Dog and Partridge is located near the eastern end of the route. It's an ancient Inn with an interesting history that can be traced back to the Elizabethan period. It was originally a farmhouse and alehouse, supplying shelter and refreshment for travelers crossing the hostile moors of the Pennines. First known as Border Hill House, the Inn became known as the Dog and Partridge on receipt of its first license all the way back in 1740. The inn has an attractive interior with traditional oak beams, nostalgic photographs and roaring fires to warm yourself by. They do very good food and also have a fine selections of drinks. You can find the pub just to the east of the route at postcode S36 4HH for your sat navs. Just above Bottoms Reservoir in the little village of Tintwistle you'll find the excellent Bull's Head. The 16th century pub does very good food and has a nice cosy fire for winter days. You can easily find the pub in the village at a postcode of SK13 1JY for your sat navs. It's also very dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Many people walk their dogs along the trail so you will probably see plenty of other owners on your outing."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The trail starts conveniently close to Hadfield train station at its western end. The station is one of the twin termini at the Derbyshire end of the Manchester-Glossop Line, the other being Glossop. You can catch trains to Hadfield from Manchester Piccadilly via Glossop. They generally run about every half hour. There is also a public car park near here at a postcode of SK13 1DW. On the northern side of the reservoirs you will find the hamlet of Crowden which is a popular start point for many walks. For example you could try the Crowden Black Hill Walk which climbs to the highest point in the historic county of Cheshire. At the eastern end of Woodhead Reservoir there's a car park where you can start the Middle Black Clough Waterfall Walk. The area is a bit of a hidden gem with walks along the River Etherow to some beautiful waterfalls and wonderful rock formations. It's located just south of the trail and well worth a visit if you have time. The route passes along part of the epic Pennine Cycleway which can be used to further extend your ride. For more walking ideas in the area see the Peak District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/H_joemOgbhY",
  "district": "High Peak",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "2, Platt Street, Hadfield, High Peak, Derbyshire, East Midlands, England, SK13 1QT, United Kingdom",
  "postcode": "SK13 1QT",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "rural",
    "reservoir"
  ],
  "points_of_interest": [
    "views"
  ],
  "facilities": [
    "car park",
    "public transport"
  ],
  "route_type": "circular",
  "activity_type": [
    "cycling",
    "walking"
  ]
}