{
  "created_at": "2025-01-06T02:29:17.088008+00:00",
  "objectID": "5ca3b508e6a3512b04c71780d3fd92a9",
  "ref": "hitchin-walking-route",
  "title": "Hitchin Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Footpath_on_Oughtonhead_Common_-_geograph.org.uk_-_245102.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5ca3b508e6a3512b04c71780d3fd92a9.gpx",
  "_geoloc": {
    "lat": 51.9484331968,
    "lng": -0.2825901349
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Footpath_on_Oughtonhead_Common_-_geograph.org.uk_-_245102.jpg",
      "title": "OLU [CC BY-SA 2.0  (https://creativecommons.org/licenses/by-sa/2.0 )], via Wikimedia Commons",
      "caption": "Footpath on Oughtonhead Common running beside the river Oughton. The peaceful nature reserve is one of the walking highlights of the area with lots of wildlife and easy trails."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Bancroft%2C_Hitchin_-_geograph.org.uk_-_561828.jpg",
      "title": "OLU [CC BY-SA 2.0  (https://creativecommons.org/licenses/by-sa/2.0 )], via Wikimedia Commons",
      "caption": "Bancroft, Hitchin. Viewed from the old market square, this was the main road through Hitchin, leading from London to Bedford. Bancroft contains many fine examples of Georgian buildings, many of them based on much earlier buildings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Pirton_Footpath_Waymarker_-_geograph.org.uk_-_245098.jpg",
      "title": "OLU [CC BY-SA 2.0  (https://creativecommons.org/licenses/by-sa/2.0 )], via Wikimedia Commons",
      "caption": "Pirton Footpath Waymarker, near to Ickleford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Ivy_Cottage%2C_Pirton_-_geograph.org.uk_-_89388.jpg",
      "title": "Humphrey Bolton / Ivy Cottage, Pirton",
      "caption": "Ivy Cottage, Pirton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Icknield_Way_near_Tingley_Wood_-_geograph.org.uk_-_315056.jpg",
      "title": "Alan Kent / Icknield Way near Tingley Wood",
      "caption": "Icknield Way near Tingley Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Time_for_a_break_-_geograph.org.uk_-_1215329.jpg",
      "title": "Dennis simpson / Time for a break",
      "caption": "Time for a break"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Rifle_Range_-_Disused_-_geograph.org.uk_-_1235129.jpg",
      "title": "Dennis simpson / Rifle Range - Disused",
      "caption": "Disused Rifle Range in the Pegsdon Hills. Apparently the earthworks cut across the bottom of the valley are the butts of a disused rifle range, which was used during the 17th and 18th century. There is a information board at the point where the \"earthworks\" visible in the map square meets the Icknield Way Path, that explains a bit more."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Tree_Lined_Path_-_geograph.org.uk_-_1215306.jpg",
      "title": "Dennis simpson / Tree Lined Path",
      "caption": "Tree Lined Path on The Icknield Way. Seen from Deacon Hill in the Pegsdon Hills."
    }
  ],
  "distance_km": 20.0,
  "description": "The Hertfordshire town of Hitchin makes a great base for exploring the lovely north eastern corner of the Chiltern Hills. This walk visits the nearby Pegsdon Hills using a number of the waymarked long distance trails which pass through the area surrounding the town. The walk starts in the town centre and picks up the Hitchin Outer Orbital Path to take you to Oughtonhead Common. It's a very pretty area with the views of the River Oughton and the Oughtonhead Nature Reserve. You can look out for wildlife including kingfishers, water rails and woodcock in this area. Shortly after passing the common you pick up the Icknield Way Path and follow it west to the village of Pirton. The route continues to the Pegsdon Hills on the border between Bedfordshire and Hertfordshire. The attractive area includes chalk hills and wildflower meadows with orchids and moschatels. In the summer months the flowers attract butterflies such as dingy and grizzled skippers. There are fine views of the surrounding Chiltern Hills from the high points which reach nearly 600ft (180m). After rounding the hills you pass Tingley Wood and pick up the same trails to return you to Hitchin. Just to the west of the Pegsdon Hills are two of the real highlights of the area at Barton Hills and Sharpenhoe Clappers. Barton Hills is a lovely nature reserve with downland, chalk grassland and beech woodland to explore. The popular chalk escarpment at Sharpenhoe Clappers includes and Iron Age Hillfort and views of the Smithcombe Hills. Near here you can also visit Sundon Hills Country Park where there are more good walking trails and great views from the high points. The long distance John Bunyan Trail also passes through the area. The epic waymarked trail will take you through some beautiful Chilterns countryside.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Half Moon Hitchin is a good choice for some post walk refreshments. The pub dates all the way back to 1748 and is an excellent place for real ale lovers. They also do excellent food and have a nice garden area for warmer days. You can find the pub at 57 Queen Street with a postcode of SG4 9TZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine walk with your dog. In the Oughtonhead Common area you are asked to please keep them under control as there is cattle and nesting birds to be mindful of. The Half Moon pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The town is located very close to Letchworth where you can try the circular Letchworth Walk. This uses a section of the epic Icknield Way Path to visit the town's Norton Common and the nearby villages of Ickleford and Pirton. There's a fine 15th century pub in Ickleford which is well worthy of some investigation. For more walking ideas in the area see the Chilterns Walks and Hertfordshire Walks pages."
    }
  ],
  "postcode": "SG5 2JT",
  "district": "North Hertfordshire",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Old Park Dental Surgery, 72, Old Park Road, West Hitchin, Hitchin, North Hertfordshire, Hertfordshire, England, SG5 2JT, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "chalk grassland",
    "downland"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}