{
  "created_at": "2025-01-06T07:55:15.560992+00:00",
  "objectID": "5d2a3c30516868431c53efd0fe0f161a",
  "ref": "moel-siabod-walking-route",
  "title": "Moel Siabod Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/df/Moel_Siabod_trig_point_-_geograph.org.uk_-_1529956.jpg",
  "nearby": [
    {
      "description": "Llyn Cowlyd",
      "objectID": "3ada0d11612d4e95f445832d5156357a",
      "ref": "llyn-cowlyd-walking-route"
    },
    {
      "description": "Dolwyddelan Castle",
      "objectID": "f6ae630d431a265195908d352a5eae48",
      "ref": "dolwyddelan-castle-walking-route"
    },
    {
      "description": "Llyn Eigiau",
      "objectID": "b2513e2bcebb36c5da78b61ed6cfee38",
      "ref": "llyn-eigiau-walking-route"
    },
    {
      "description": "Dolgarrog Pipeline Walk",
      "objectID": "51a4a895f93c97e8944ab9ada2f8b04c",
      "ref": "dolgarrog-pipeline-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5d2a3c30516868431c53efd0fe0f161a.gpx",
  "_geoloc": {
    "lat": 53.0967215746,
    "lng": -3.8917964142
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Moel_Siabod_trig_point_-_geograph.org.uk_-_1529956.jpg",
      "title": "Ian Greig / Moel Siabod trig point, via Wikimedia Commons",
      "caption": "Moel Siabod trig point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Northern_slope_of_Moel_Siabod_-_geograph.org.uk_-_218420.jpg",
      "title": "Eric Jones / Northern slope of Moel Siabod, via Wikimedia Commons",
      "caption": "Northern slope of Moel Siabod. This view of the middle northern slopes of Moel Siabod shows heather-clad rocky volcanic outcrops. Bracken infestation is apparent in the foreground. Beyond is Dyffryn Mymbyr traversed by the A4086 Capel Curig to Caernarfon road.The main mountain in the background is Crib Goch.The small hamlet of Penygwryd lies at the foot of Moel Berfedd."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Forestland_east_of_Moel_Siabod_-_geograph.org.uk_-_218501.jpg",
      "title": "Eric Jones / Forestland east of Moel Siabod, via Wikimedia Commons",
      "caption": "Forestland east of Moel Siabod. The plateau-like moorland east of Moel Siabod is extensively forested. Areas of rocky outcrops and boglands are also apparent in this view taken from the summit of the mountain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/The_Craggy_Eastern_Front_of_Moel_Siabod_-_geograph.org.uk_-_218593.jpg",
      "title": "Eric Jones / The Craggy Eastern Front of Moel Siabod, via Wikimedia Commons",
      "caption": "The Craggy Eastern Front of Moel Siabod. The sheer verticality of the eastern face of the mountain comes as a surprise to anyone who has ambled up its smooth rounded western slopes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/The_Western_Ridge_of_Moel_Siabod_-_geograph.org.uk_-_218784.jpg",
      "title": "Eric Jones / The Western Ridge of Moel Siabod, via Wikimedia Commons",
      "caption": "The Western Ridge of Moel Siabod. This gentle, grassy ridge provides an easy, if somewhat longish, route back to Penygwryd with the added bonus of a panoramic view of Snowdon and its acolyte peaks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/The_lower_bluffs_of_Moel_Siabod_-_geograph.org.uk_-_410671.jpg",
      "title": "Eric Jones / The lower bluffs of Moel Siabod, via Wikimedia Commons",
      "caption": "The lower bluffs"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Trig_Pillar_on_Moel_Siabod_-_geograph.org.uk_-_218603.jpg",
      "title": "Eric Jones / Trig Pillar on Moel Siabod, via Wikimedia Commons",
      "caption": "Trig Pillar"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/The_Summit_of_Moel_Siabod_-_geograph.org.uk_-_218518.jpg",
      "title": "Eric Jones / The Summit of Moel Siabod, via Wikimedia Commons",
      "caption": "The Summit of the mountain. The view incorporates rocky summit ridge (left), trig. pillar (centre) and stone shelter (right)."
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to the summit of Moel Siabod on this challenging walk in Snowdonia. The mountain reaches a peak of 872m making it the highest peak in the Moelwynion mountain range. The views from the summit are particularly special. On a clear day the you can see Snowdonia, Glyderrau and the Carneddau ranges. The start point at the village of Pont Cyfyng is delightful, with views of the Afon (river) Llugwy and the Llugwy waterfalls. You then ascend to the summit passing a small lake, a quarry and the lovely Llyn-y-Foel on the way. There's also the spectacular Deaer Ddu south east ridge which requires some scrambling before you reach the summit. This is a challenging walk with some scrambling required. You are rewarded with wonderful views throughout. If you would like to continue your walking in the area then the walk to Llyn Cowlyd starts from the nearby Capel Curig car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the eastern end of Llynnau Mymbyr you will find Plas Y Brenin, a National Outdoor Centre for Rock Climbing, Mountaineering, Hiking & Hillwalking, Canoeing, Kayaking and Mountain Biking. Within the centre there's the Yr Wyddfa Bar and Restaurant which is a great place for some post walk refreshments. The bar boasts the best view in Britain as it looks down to the lake and the Snowdon Horseshoe. There's a good menu with locally sourced food and drink."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south of the mountain you can visit one of the significant historical sites in the area at Dolwyddelan Castle. There are excellent views back to the mountain from the ruins of the 13th century fortress. The circular walk also visits the village of Dolwyddelan and the lovely Afon Lledr Valley. For some interesting local history try the Dolgarrog Pipeline Walk. This explores the area around the little village, visiting the impressive pipeline structure and the Coedty reservoir. Near here there's also the beautiful Llyn Eigiau where the reservoir dam was breached leading to the Dolgarrog Dam disaster of 1925."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rR7w9S0Y9t8",
  "postcode": "LL24 0SR",
  "district": "Pont-Cyfyng",
  "county": "Conwy - Conwy",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}