{
  "created_at": "2025-01-06T04:38:32.227923+00:00",
  "objectID": "5daf2488bb0abf0309563fd5cee39f83",
  "ref": "pocklington-canal-walking-route",
  "title": "Pocklington Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/99/Canal_Head%2C_Pocklington_-_geograph.org.uk_-_871841.jpg",
  "nearby": [
    {
      "description": "Wilberforce Way",
      "objectID": "23165689460031ee9d4fdfaef8039481",
      "ref": "wilberforce-way-walking-route"
    },
    {
      "description": "Allerthorpe Woods",
      "objectID": "36280acd1dd539a45239ab493f4012f9",
      "ref": "allerthorpe-woods-walking-route"
    },
    {
      "description": "Millington Woods",
      "objectID": "d2ecadc83a2be47aca2864734ae24bd2",
      "ref": "millington-woods-walking-route"
    },
    {
      "description": "Bishop Wilton",
      "objectID": "6902a986cb9a6dbbfe62f47fe9a5863c",
      "ref": "bishop-wilton-walking-route"
    },
    {
      "description": "Minster Way",
      "objectID": "27c22b8c3ab40d27b053a9bb80337b34",
      "ref": "minster-way-walking-route"
    },
    {
      "description": "Kilnwick Percy",
      "objectID": "bfa4cb754079541f6b9dc4b6bed4d896",
      "ref": "kilnwick-percy-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5daf2488bb0abf0309563fd5cee39f83.gpx",
  "_geoloc": {
    "lat": 53.9162054884,
    "lng": -0.7840196713
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Canal_Head%2C_Pocklington_-_geograph.org.uk_-_871841.jpg",
      "title": "Peter Church / Canal Head, Pocklington, via Wikimedia Commons",
      "caption": "Canal Head, Pocklington. The canal is kept full by inflow from Pocklington Beck, which in turn will be fed by springs on the foothills of the Wolds. The canal has unusable sections, so no boats this high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/At_the_head_of_the_Pocklington_Canal_-_geograph.org.uk_-_8808.jpg",
      "title": "Andy Beecroft / At the head of the Pocklington Canal, via Wikimedia Commons",
      "caption": "Lovely scene at the canal head with an old warehouse, willow tree and a bench to rest your legs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/The_Top_Lock_on_the_Pocklington_Canal_-_geograph.org.uk_-_548095.jpg",
      "title": "bernard bradley / The Top Lock on the Pocklington Canal, via Wikimedia Commons",
      "caption": "Top Lock (adjacent to the lock keepers house) - the first lock encountered when walking from Canal Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Coates_Lock_on_the_Pocklingon_Canal_-_geograph.org.uk_-_1414988.jpg",
      "title": "DS Pugh [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Coates Lock. Looking across one of the cosmetically restored locks on the canal. On the other side a bridleway runs along the towpath to the canal head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/The_towpath%2C_Pocklington_Canal_-_geograph.org.uk_-_871861.jpg",
      "title": "Peter Church / The towpath, Pocklington Canal, via Wikimedia Commons",
      "caption": "This short section is just tucked into the northwest corner of the gridsquare, looking southwest, the canal is hidden behind the verbiage on the left of the photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Last_Lock_on_the_Pocklington_Canal_-_geograph.org.uk_-_279084.jpg",
      "title": "Andy Beecroft / Last Lock on the Pocklington Canal, via Wikimedia Commons",
      "caption": "Last Lock on the canal."
    }
  ],
  "distance_km": 15.0,
  "description": "Enjoy an easy waterside stroll along this lovely canal in East Riding of Yorkshire. The canal runs for about 9 miles from the town of Pocklington to East Cotting with where it joins the River Derwent. It's an easy flat walk along the towpath with some delightful scenery to take in. Along the way you'll pass a number of locks and bridges with nice views of the surrounding countryside. The area is great for wildlife with part of the canal falling within the Lower Derwent Valley National Nature Reserve. Look out for swans, ducks, kingfishers and dragonflies. The route starts just south of Pocklington town centre where Canal Lane meets York Road at Pocklington Canal Head (postcode YO42 1NW). It then passes Bielby, Melbourne and Storwood before finishing at Cottingwith Lock at East Cottingwith. The Wilberforce Way runs along the canal so it's possible to extend your walk along this long distance footpath. It can be followed from the centre of Pocklington to start your walk. Just to the west of Pocklington you can enjoy miles of wide woodland trails in Allerthorpe Woods or pay a visit to the delightful Millington Woods .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Melbourne Arms is in a good spot roughly half way along the canal. It's a nice place to stop for refreshments with cosy open fires indoors and a garden area to relax in on finer days. You can access the pub just to the south of the historic Grade II listed Church Bridge in the village of Melbourne. Postcode is YO42 4QJ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Pocklington we recommend a visit to the very pretty Burnby Hall Gardens. It's a lovely place for an afternoon stroll with landscaped gardens and two lakes. The park is notable for over 100 types of water lilies displayed in the lakes where you can also feed the fish. There's also an ornamental bridge, a Victorian Garden, an Aviary Garden, a newly restored Edwardian Rock Garden, a Stumpery, and a Birch Walk, the latter being the most recent horticultural addition. You can find out about the history of the area in the Stewart Museum. It houses a fascinating collection of artefacts collected by Major Stewart on eight world tours that were undertaken between 1906 and 1926, several of which have been deemed by UNESCO as being of national and international importance. Afterwards visit the cafe where you can enjoy refreshments with a view. You can find the park in the town centre with a postcode of YO42 2QF for your sat navs.  Burnby Hall - Victorian Gardens and Dragonfly Pond At the end of the route you can create a little circular walk by heading south through East Cottingwith and then following Postern Lane up to Storwood and Hagg Bridge. To the north there's Bishop Wilton where you can pick up the Minster Way and follow it to Millington Woods. The pretty village is also worth exploring with a Grade I listed medieval church and the highest point in the Wolds at the nearby Garrowby Hill. Just to the east is Kilnwick Percy where you can visit the noteworthy Kilnwick Percy Hall. The Grade II listed hall is now a meditation centre with woodland walks, a lake, a cafe and tours of the historic house."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mJRLFoXZj0M",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "York Road, Barmby Moor, Pocklington, East Riding of Yorkshire, England, YO42 2NL, United Kingdom",
  "postcode": "YO42 2NL",
  "district": "Pocklington",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal towpath",
    "woodland"
  ],
  "points_of_interest": [
    "nature reserve",
    "countryside views",
    "historic footpath"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "linear",
  "activities": [
    "walking"
  ]
}