{
  "created_at": "2025-01-06T00:07:12.014878+00:00",
  "objectID": "5e692e216286c9ef7423044102462363",
  "ref": "welwyn-garden-city-walking-route",
  "title": "Welwyn Garden City Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Southern_lake_at_Stanborough_-_geograph.org.uk_-_80594.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5e692e216286c9ef7423044102462363.gpx",
  "_geoloc": {
    "lat": 51.7879704563,
    "lng": -0.223373119
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Southern_lake_at_Stanborough_-_geograph.org.uk_-_80594.jpg",
      "title": "Robin Hall / Southern lake at Stanborough, via Wikimedia Commons",
      "caption": "Southern lake at Stanborough. Even though it was cold today some hardy souls were out fishing and sailing today. These lakes are very busy in the summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Lemsford_Springs_6.JPG/512px-Lemsford_Springs_6.JPG",
      "title": "Dudley Miles [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Lemsford Springs, a nature reserve in Lemsford, Hertfordshire, managed by the Herts and Middlesex Wildlife Trust"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Palladian_bridge_at_Brocket_Hall_-_geograph.org.uk_-_389511.jpg",
      "title": "Harold Toze / Palladian bridge at Brocket Hall, via Wikimedia Commons",
      "caption": "Palladian bridge at Brocket Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Part_of_the_Ayot_Greenway_Path_-_geograph.org.uk_-_1264640.jpg",
      "title": "Robert Edwards / Part of the Ayot Greenway Path, via Wikimedia Commons",
      "caption": "Part of the Ayot Greenway Path. This public pathway follows part of the disused Luton & Welwyn railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Sherrardspark_Wood_6.JPG/512px-Sherrardspark_Wood_6.JPG",
      "title": "Dudley Miles [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Sherrardspark Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Waterend_-_geograph.org.uk_-_1471.jpg",
      "title": "Rob Hinkley / Waterend, via Wikimedia Commons",
      "caption": "Waterend. Looking North to the ford at Waterend on the River Lea, West of Welwyn Garden City. It's dry, but the water only has to rise a foot or so to flood the road - hence the little footbridge so people can cross without getting their feet wet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Part_of_Stonehills_in_Welwyn_Garden_City_-_geograph.org.uk_-_4022626.jpg",
      "title": "Part of Stonehills in Welwyn Garden City by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Part of Stonehills"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Welwyn_Garden_City%2C_The_Coronation_Fountain_%282%29_-_geograph.org.uk_-_4247176.jpg",
      "title": "Welwyn Garden City: The Coronation Fountain (2) by Nigel Cox, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Coronation Fountain in the town centre."
    }
  ],
  "distance_km": 18.0,
  "description": "This circular walk around Welwyn Garden City uses some of the town's waymarked trails to take you to some of the highlights of the area. You'll visit the River Lea, Sherrardspark Wood, the Ayot Greenway and Stanborough Park on this varied route. The walk starts from Stanborough Park just to the south of the town centre. The 126 acre park has two lovely large lakes with wildlife such as herons and egrets to look out for. You can also pick up the Lea Valley Walk here and follow it north west through the park and the adjacent Lemsford Springs Nature Reserve. The reserve includes lagoons, meadow, hedgerows, marsh and willow woodland. You can also use the bird hides to look out for water rails, snipe and green sandpipers. The route continues past the Grade I listed Brocket Hall which dates from the 18th century. The estate includes pleasure grounds, a Palladian bridge with a weir and the Broadwater, a landscaped section of the River Lea which forms the central valley of the park. After passing the hall the route continues west along the river toward Wheathampstead. Near here you pick up the Ayot Greenway, a shared cycling and walking trail which runs along a disused railway line from Wheathampstead to Welwyn Garden City. On the way you'll pass through Sherrardspark Woods. The woods are also a nature reserve with lots of birdlife, butterflies and Muntjac Deer to look out for. The route then passes through the centre of Welwyn Garden City before returning to the park. For a longer, alternative circular walk around the town see the Welwyn Garden City Centenary Walk. This one starts north of the town at the Digswell Viaduct where there is also a pretty lake and nature reserve.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east of Sherrardspark Wood you can enjoy refreshments in the Red Lion pub. It's an attractive looking gastropub with beams, wood and stone floors, a large fireplace and Mediterranean-accented food. There's a good varied great menu and a nice courtyard and garden where you can sit outside on warmer days. You can find it at Digswell Hill with a postcode of AL6 9AJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north west of the town you will find the noteworthy village of Ayot St Lawrence. The village is notable for its connections with the playwright George Bernard Shaw and is the site of Shaw's Corner, his old residence. There's also a ruined 12th century church and a lovely pub which dates from the 14th century to see here. Near here there's Codicote where you can visit the nearby Hoo Park and enjoy some pretty bluebell woods and a rather fine old bridge over the River Mimram. The village is also very attractive with several timber framed buildings and a historic 16th century pub to admire. To the north east there's the pretty village of Tewin where you can pick up the Hertfordshire Chain Walk and explore the local woodland and countryside. The trail could be followed to Watton at Stone where there's a historic 15th century pub and the splendid Woodhall Estate to visit.For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GiZ0qzX3L8Y",
  "postcode": "AL8 6DF",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stanborough Road, Hatfield Garden Village, Stanborough, Welwyn Hatfield, Hertfordshire, England, AL8 6DF, United Kingdom",
  "district": "Welwyn Hatfield",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "park"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical sites",
    "lake"
  ],
  "facilities": [
    "car park",
    "bird hides",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}