{
  "created_at": "2025-01-06T10:39:41.595959+00:00",
  "objectID": "5ed604b1ef2fa7625073cd2fcaab676d",
  "ref": "morton-lochs-walking-route",
  "title": "Morton Lochs Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/78/Morton_Lochs_-_geograph.org.uk_-_152824.jpg?20100131094327",
  "nearby": [
    {
      "description": "Tentsmuir Forest",
      "objectID": "860acf3b9c663f5db3ec7bd19564d2e9",
      "ref": "tentsmuir-forest-walking-and-cycle-route"
    },
    {
      "description": "Fife Coastal Path",
      "objectID": "636c198ff6841e6415f206ca7cfb9ab8",
      "ref": "fife-coastal-path-walking-route"
    },
    {
      "description": "St Andrews to Anstruther Coastal Walk",
      "objectID": "083f21339f1bf063ec003c09eb2f2c27",
      "ref": "st-andrews-to-anstruther-coastal-walk-walking-route"
    },
    {
      "description": "Craigtoun Country Park",
      "objectID": "347d4f63656dc2d279baf9b82032a259",
      "ref": "craigtoun-country-park-walking-route"
    },
    {
      "description": "Tayport To Tentsmuir",
      "objectID": "5f27dc4b84dd0f13b1174ee7bcdc1e59",
      "ref": "tayport-to-tentsmuir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5ed604b1ef2fa7625073cd2fcaab676d.gpx",
  "_geoloc": {
    "lat": 56.4263139485,
    "lng": -2.8678766521
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Morton_Lochs_-_geograph.org.uk_-_152824.jpg?20100131094327",
      "title": "James Allan / Morton Lochs",
      "caption": "Morton Lochs. These lochs just west of Tentsmuir Forest look natural but are in fact man made. They were created as private fishing ponds in 1906 by diverting Ninewells Burn into hollows among the sand dunes. Planting of the surrounding trees followed many years later and a habitat for a wide variety of insect, bird, plant and animal life has developed and is now being maintained by Scottish Natural Heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Morton%27s_Loch_-_geograph.org.uk_-_377125.jpg?20110104210346",
      "title": "John Brailsford / Morton's Loch",
      "caption": "Looking over loch towards farmland and forestry west of Tayport. The lochs host a diverse range of waterfowl throughout the year. Common visitors include water rail, goldeneye, little grebe, teal, mallard, moorhen, greylag goose, and mute swan. The area is also a hotspot for more rare and exciting sightings. Visitors might catch a glimpse of kingfishers skimming across the water or even spot a marsh harrier or osprey hunting over the lochs. Additionally, otters are known to inhabit the area, adding to the rich biodiversity of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/A_modern_sculpture_at_Morton_Lochs_National_Nature_Reserve_-_geograph.org.uk_-_3573334.jpg?20220605144049",
      "title": "A modern sculpture at Morton Lochs National Nature Reserve by Walter Baxter, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A modern sculpture at Morton Lochs National Nature Reserve. The area is well-known for its thriving red squirrel population, which can often be spotted in the surrounding woodlands. These elusive creatures are particularly visible around the John Berry hide, a popular spot for wildlife observation. Bird feeders installed in the woodland and outside the hide attract a variety of bird species, such as great tits, blue tits, chaffinches, and great spotted woodpeckers, providing excellent opportunities for birdwatching."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Edinburgh_and_Northern_Railway_-_geograph.org.uk_-_4317230.jpg?20230123030313",
      "title": "Edinburgh and Northern Railway by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Edinburgh and Northern Railway trail in the reserve. Access to Morton Lochs Nature Reserve is convenient, with several routes available for visitors. One option is via the public footpath that crosses Scotscraig Golf Course in Tayport. Alternatively, multiple footpaths through Tentsmuir Forest lead to the reserve. For those travelling by road, the turn-off to Morton on the B945 between Tayport and Leuchars provides easy access. A small car park adjacent to the reserve offers parking, and is close to the two main footpaths leading into the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Footbridge_to_the_Christie_Hide_-_geograph.org.uk_-_6298148.jpg/256px-Footbridge_to_the_Christie_Hide_-_geograph.org.uk_-_6298148.jpg?20240506141024",
      "title": "Footbridge to the Christie Hide by Oliver Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footbridge to the Christie Hide. The reserve is equipped with three publicly accessible bird hides located around the largest of the three lochs, with a fourth hide situated on the South Loch. An additional hide, which requires a key obtainable from NatureScot, allows for more exclusive wildlife observation. Among the many bird species frequenting the reserve, the teal stands out due to its numbers, often arriving in the hundreds. The teal has also been adopted as the emblem for the reserve, featuring on the signs at its entrance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Morton_North_Loch_-_geograph.org.uk_-_6298144.jpg?20240506140939",
      "title": "Morton North Loch by Oliver Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Morton North Loch. Established as a National Nature Reserve (NNR) in 1952, Morton Lochs was the second site in the UK to receive this designation, highlighting its ecological importance. This long-standing protection has helped maintain the reserve's rich biodiversity, making it a significant site for both wildlife enthusiasts and conservation efforts."
    }
  ],
  "distance_km": 1.53,
  "description": "This walk visits the pretty Morton Lochs Nature Reserve in the Tentsmuir Forest on the Fife Coast. The nature reserve includes three small lochs with pleasant footpaths and a variety of wildfowl to look out for on the water. Along the way you can enjoy lovely views over the lochs to the surrounding hills and countryside. There is a parking area on the western side of the forest where you can pick up the trails around the lakes. There is also a nature trail along a dismantled railway line on the eastern side of the site. The walk can be extended by heading east into the forest where you'll find miles of fine walking and cycling trails. The Fife Coastal Path also runs past the forest.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/M1qtIzsWkFU?si=qeqcklAmjGUgOIH_",
  "postcode": "DD6 9EF",
  "county": "Fife",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lundin Crescent, Tayport, Fife, Alba / Scotland, DD6 9EF, United Kingdom",
  "district": "Tayport",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "coastal"
  ],
  "points_of_interest": [
    "views",
    "wildfowl"
  ],
  "facilities": [
    "car park",
    "nature trail"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}