{
  "created_at": "2025-01-06T05:12:46.277882+00:00",
  "objectID": "5f65d99ab01701b1233bdf975bf4a7d4",
  "ref": "dozmary-pool-walking-route",
  "title": "Dozmary Pool Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/18/Highland_cattle_near_Colliford_Lake_-_geograph.org.uk_-_708169.jpg",
  "nearby": [
    {
      "description": "Colliford Lake",
      "objectID": "3a8792071d140959a2a2cd83a2c8bd62",
      "ref": "colliford-lake-walking-route"
    },
    {
      "description": "Camelford Way",
      "objectID": "31218d6bcd5d74ce108298072583dc67",
      "ref": "camelford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5f65d99ab01701b1233bdf975bf4a7d4.gpx",
  "_geoloc": {
    "lat": 50.5093857068,
    "lng": -4.5736181491
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Highland_cattle_near_Colliford_Lake_-_geograph.org.uk_-_708169.jpg",
      "title": "Derek Harper / Highland cattle near Colliford Lake",
      "caption": "Highland cattle grazing near Colliford Lake. These fine beasts are grazing an area of rough access land on Colliford Downs just southeast of the lake. Beyond the gorse-covered field boundary, a hill of improved grass hides the southern end of the lake from view. Seen from the road up the eastern side of the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Gillhouse_Downs_-_geograph.org.uk_-_708240.jpg",
      "title": "Derek Harper / Gillhouse Downs",
      "caption": "Gillhouse Downs. The road running along the eastern side of Colliford Lake drops to a shallow valley where a stream links to the reservoir. It then climbs Pinnockshill, crossing into SX1974 as it does so. On the left, there has been some recent burning of the heather."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Dozmary_Pool_-_geograph.org.uk_-_840.jpg",
      "title": "Paul Allison / Dozmary Pool",
      "caption": "Dozmary Pool. Allegedly the home of the Lady in the Lake of Arthurian Legend and also reputed to be bottomless."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Dozmary_Pool_on_Bodmin_Moor_-_geograph.org.uk_-_919097.jpg",
      "title": "roger geach / Dozmary Pool on Bodmin Moor",
      "caption": "Dozmary Pool on Bodmin Moor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Cairn_on_Brown_Gelly_-_geograph.org.uk_-_1274.jpg",
      "title": "Beccy / Cairn on Brown Gelly",
      "caption": "Bronze age Cairn on top of Brown Gelly, a hill located south of the site. Dozmary Pool can just be seen from here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Dozmary_Pool_-_geograph.org.uk_-_1570107.jpg",
      "title": "Steve G / Dozmary Pool",
      "caption": "Evening sun at the pool in 1989"
    }
  ],
  "distance_km": 10.0,
  "description": "Visit the mysterious waters of the Dozmary Pool on this easy walk on Bodmin Moor. You can park at the car park at the southern end of Colliford Lake to start your walk. Then follow quiet country lanes north to the small lake. There's lovely views over to Colliford Lake on your left before coming to Dozmary Pool. Here you can look out for wildlife including curlew, dunlin and stonechat. According to legend, the lake is where King Arthur rowed out to the Lady of the Lake and received the sword Excalibur. To extend your walk head to Colliford Lake the largest lake in Cornwall. Here you can look out for more water loving birdlife and the Bodmin Ponies.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the northern end of Colliford Lake there's the Colliford Tavern for refreshments. They do a nice cream tea which you can enjoy with fine views over the lake from the outdoor seating area. They also provide accommodation in the shape of a hotel and adjacent campsite. You can find it at a postcode of PL14 6PZ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west and you could visit Blisland where you can pick up the Camelford Way, the Copper Trail and the popular Camel Trail which runs along a shared cycling and walking path. Here you'll also find the Blisland Inn, an award winning pub of some note, having been voted three times Cornwall CAMRA Pub of the Year and in 2001 becoming the campaign's national Pub of the Year. It's a fine place to visit if you are looking for a refreshing beverage after your walk."
    }
  ],
  "county": "Cornwall",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}