{
  "created_at": "2025-01-06T00:29:07.485139+00:00",
  "objectID": "5fa1afb99acc8d8303f92d352baba55e",
  "ref": "nairn-walking-route",
  "title": "Nairn Culbin Sands Beach Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Culbin_Sands_-_geograph.org.uk_-_5519286.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5fa1afb99acc8d8303f92d352baba55e.gpx",
  "_geoloc": {
    "lat": 57.5913871923,
    "lng": -3.8622817012
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Culbin_Sands_-_geograph.org.uk_-_5519286.jpg",
      "title": "Culbin Sands by valenta, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Culbin Sands presents a striking expanse of saltmarsh and sand dunes, offering breathtaking views of the mountains. During low tide, the shoreline becomes a feeding ground for Bar-tailed Godwits, Oystercatchers, and Knots, while high tide brings sea ducks near the sand dunes. This area is an integral part of the Moray and Nairn Coast Special Protection Area (SPA), contributing to the preservation of its remote and windswept landscape as a precious wildlife habitat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Saltmarsh_of_the_Culbin_Sands_-_geograph.org.uk_-_6010125.jpg/512px-Saltmarsh_of_the_Culbin_Sands_-_geograph.org.uk_-_6010125.jpg",
      "title": "Saltmarsh of the Culbin Sands by Julian Paren, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Saltmarsh of the Culbin Sands. During winter, the mussel beds at Culbin Sands attract a variety of sea ducks, such as Common Scoter, Long-tailed Duck, and a smaller population of Velvet Scoter. For optimal viewing of these sea ducks, high tide is recommended, as it brings the birds closer to the shore, facilitating easier observation. Conversely, low tide is an opportune time to observe waders, as they come to the saltmarsh to forage for food in the mud. This creates a dynamic environment for birdwatching throughout different tidal phases."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Tidal_channel%2C_Culbin_Sands_-_geograph.org.uk_-_5097627.jpg/512px-Tidal_channel%2C_Culbin_Sands_-_geograph.org.uk_-_5097627.jpg",
      "title": "Tidal channel, Culbin Sands by Craig Wallace, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tidal channel. The reserve is a dynamic and ever-changing landscape, influenced by the winds and tides. These dunes were once part of one of the largest sand dune systems in Britain. Combined with the adjacent saltmarsh, mudflats, and shingle areas, the reserve offers a diverse range of habitats that support a rich variety of wildlife. The dynamic nature of the environment, shaped by natural forces, contributes to the uniqueness and ecological significance of Culbin Sands."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Footpath_at_Culbin_Sands_Nature_Reserve_-_geograph.org.uk_-_1344642.jpg",
      "title": "Dr Richard Murray / Footpath at Culbin Sands Nature Reserve",
      "caption": "Footpath at Culbin Sands Nature Reserve. Looking towards Culbin Forest. The signpost indicates the branch path leading to the car park at Kingsteps"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/The_view_to_the_forest_-_geograph.org.uk_-_1077050.jpg",
      "title": "Alastair Young / The view to the forest",
      "caption": "A view looking across the lagoon area at high tide from the sand bar. In the context of World War II, concerns arose that the extensive coastline of Culbin Sands could potentially be exploited as a landing strip for enemy glider planes. To counteract this threat, these anti-glider poles were strategically installed along the coastline. Spanning a length of 9 kilometers, these poles are a rare surviving example of anti-landing obstacles in the United Kingdom. Remarkably, they represent the largest Scheduled Monument situated within an RSPB reserve, underscoring the historical significance of the area. The forest in the background is Culbin forest, planted on the Culbin sand dunes in the 1930's."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Saltmarsh_at_Culbin_Sands_-_geograph.org.uk_-_6010170.jpg/512px-Saltmarsh_at_Culbin_Sands_-_geograph.org.uk_-_6010170.jpg",
      "title": "Saltmarsh at Culbin Sands by Julian Paren, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Saltmarsh. Culbin Sands' dynamic landscape, shaped by shifting sand dunes and sunlit spots within the saltmarsh, serves as crucial open habitats for rare species. Among these are the Dingy Skipper, Small Blue butterfly, and a variety of dune plants and fungi. Conservation efforts involve the removal of trees, gorse, and broom from the dunes and shingle bars, contributing to the restoration of the natural dynamic dune system. This process not only prevents shading but also allows sunlight to reach the ground, benefiting specialist plants like the Kidney Vetch flower and the Small Blue butterfly, which relies on it as a food source."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Entrance_to_Culbin_Sands_-_geograph.org.uk_-_5344012.jpg/512px-Entrance_to_Culbin_Sands_-_geograph.org.uk_-_5344012.jpg",
      "title": "Entrance to Culbin Sands by Dave Thompson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Entrance to Culbin Sands"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Nairn_Harbour_-_geograph.org.uk_-_5346200.jpg",
      "title": "Nairn Harbour by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Nairn Harbour. An ancient fishing port transformed into a popular leisure vessel facility and holiday destination. Nairn harbour provides a limited number of visitor berths to mariners who are keen to explore the Highlands and enjoy the hospitality the town of Nairn has to offer. There is a car park near here where you can start your walk."
    }
  ],
  "distance_km": 9.0,
  "description": "This walk explores the lovely Culbin Sands Nature Reserve on the Moray Firth in Nairn. You can start the walk from the public car park at Nairn Harbour and then pick up trails heading east to East Beach and Culbin Sands. It's a fine place for a walk with wonderful views to the surrounding mountains, sand dunes and a wide variety of wildlife to look out for. You can continue your walking in the area in Culbin Forest where there are miles of peaceful woodland trails to try. Please scroll down for the full list of walks near and around Nairn. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "RSPB Scotland encourages responsible access in accordance with the Scottish Outdoor Access Code. From April 1 to August 15, during the ground-nesting bird breeding season, it is requested that dogs are kept close to their owners, preferably on a short lead. Additionally, dog owners are urged to clean up after their pets, and a designated dog waste bin can be found in the Highland Council Car Park at East Beach."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gjO6CPz0kEo?si=-Tyf453Ho6gxZkWm",
  "postcode": "IV12 4HR",
  "district": "Nairn",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Nairn Harbour, Harbour Street, Fishertown, Nairn, Highland, Alba / Scotland, IV12 4HR, United Kingdom",
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "beach",
    "sand dunes"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "views"
  ],
  "facilities": [
    "car park",
    "footpaths",
    "cycle paths"
  ],
  "route_type": "loop",
  "activities": [
    "walking",
    "cycling"
  ]
}