{
  "created_at": "2025-01-06T08:27:59.448607+00:00",
  "objectID": "5fa6be28cae962cb5d46d96eef1bb31f",
  "ref": "ulverston-canal-walking-route",
  "title": "Ulverston Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/87/Ulverston_Canal_-_geograph.org.uk_-_99715.jpg",
  "nearby": [
    {
      "description": "Cistercian Way",
      "objectID": "6065c32d64905642fc209103eec90348",
      "ref": "cistercian-way-walking-route"
    },
    {
      "description": "Birkrigg Common",
      "objectID": "37f742c173b9571082e7b42c5fbc3635",
      "ref": "birkrigg-common-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Cumbria Coastal Way",
      "objectID": "2fcd19e1d9c4bc3c8a117c9c237af3f5",
      "ref": "cumbria-coastal-way-walking-route"
    },
    {
      "description": "Ulverston Lighthouse",
      "objectID": "fef29769633a7e49e2e536fe3ccde5ea",
      "ref": "ulverston-lighthouse-walking-route"
    },
    {
      "description": "Greenodd",
      "objectID": "ca1a14311921924e3bba8292fa42f3e8",
      "ref": "greenodd-walking-route"
    },
    {
      "description": "Piel Island",
      "objectID": "e83230ca89fc311d543bcbea8cb4d7f6",
      "ref": "piel-island-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5fa6be28cae962cb5d46d96eef1bb31f.gpx",
  "_geoloc": {
    "lat": 54.1981588913,
    "lng": -3.0844144927
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Ulverston_Canal_-_geograph.org.uk_-_99715.jpg",
      "title": "Ben Stafford / Ulverston Canal",
      "caption": "Ulverston's disused Ship Canal from the Sea end at Canal Foot (the other end about a mile and a quarter away is Canal Head). The waterway, constructed in the late 18th century, is entirely straight and at a single level, making it separate from the wider UK canal network. Its purpose was to facilitate maritime trade through the town's port. Ulverston Canal played a significant role in the industrial development of Ulverston, with wharves constructed in the town to handle cargo from seagoing vessels. Despite losing economic significance with the establishment of the Furness Railway in the mid-19th century, the canal remained operational for commercial use until the 1940s when it was eventually abandoned. Today, a property management company oversees its preservation, supported by funding from GlaxoSmithKline, which operates a nearby plant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Canal_basin_at_Ulverston_-_geograph.org.uk_-_496605.jpg",
      "title": "Adie Jackson / Canal basin at Ulverston",
      "caption": "Canal basin at Ulverston. Stretching between its former sea entrance, Canal Foot at Hammerside Point on Morecambe Bay, and its basin and wharves in Ulverston, the canal features a 112-foot-long (34 m) sea lock, the only lock on its route. However, the lock has been sealed with a concrete dam and footbridge. Alongside the canal, there's a sheep and cattle auction, and some waterside buildings have undergone renovation. At the mouth of the canal stands the Bay Horse Hotel, once an 18th-century coaching inn; the Cumbria Coastal Way intersects the canal at this location."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Entrance_to_Ulverston_Canal.jpg",
      "title": "Alexander P Kapp / Entrance to Ulverston Canal, seaward side",
      "caption": "Entrance to the canal at the eastern (coastal) end"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Market_Street%2C_Ulverston_-_geograph.org.uk_-_1731488.jpg",
      "title": "Alexander P Kapp / Market Street, Ulverston",
      "caption": "Market Street in the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Laurel_and_Hardy_outside_the_Coronation_Hall%2C_Ulverston_-_geograph.org.uk_-_1731554.jpg/256px-Laurel_and_Hardy_outside_the_Coronation_Hall%2C_Ulverston_-_geograph.org.uk_-_1731554.jpg",
      "title": "Alexander P Kapp / Laurel and Hardy outside the Coronation Hall, Ulverston",
      "caption": "Laurel and Hardy statue outside the Coronation Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Ulverston%27s_most_famous_son_-_geograph.org.uk_-_151570.jpg",
      "title": "John Berry / Ulverston's most famous son",
      "caption": "Birthplace of Ulverston's most famous son. No.3 Argyle Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Swans_on_the_Ulverston_Canal_-_panoramio.jpg/512px-Swans_on_the_Ulverston_Canal_-_panoramio.jpg?20161118150748",
      "title": "jolmartyn, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Swans on the Ulverston Canal. Before the construction of the Furness Railway, the Furness region was largely isolated by the mountainous Lake District on its landward side. Access to the area was primarily through the hazardous sands of Morecambe Bay. In 1835, a passenger ferry service from Ulverston Canal to Liverpool began, later complemented by a service from Barrow-in-Furness to Fleetwood. The canal also connected with the Lancaster Canal, facilitating the transport of coal, culm, and cinders without incurring sea duty. Goods were transported as far as Glasgow and Cardiff using the canal. The increased use of the canal led to the development of various industries in the area. Timber-related activities such as charcoal burning and hoop-making thrived, alongside shipbuilding, gas and chemical works, rail engineering, and paper manufacturing. Ulverston boasted a significant shipbuilding industry in the 1800s, constructing robust wooden sailing ships tailored for transporting local ore rock cargoes. One notable example is the barquentine Gaerwen, a 249-ton vessel built in 1878, which later operated out of Salcombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Dilapidated_Lock_Gates_-_geograph.org.uk_-_1873851.jpg/512px-Dilapidated_Lock_Gates_-_geograph.org.uk_-_1873851.jpg?20210410150755",
      "title": "Dilapidated Lock Gates by Stephen Middlemiss, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dilapidated Lock Gates. The establishment of the Furness Railway in 1846 significantly impacted the profitability of the canal, prompting its eventual purchase by the railway company. Additionally, the development of Barrow-in-Furness as a deep-water port further contributed to a decline in trade. Shipbuilding in Ulverston ceased after 1878, and commercial use of the canal continued until the First World War, officially ceasing at the end of the Second World War. Ulverston Town Council has since taken responsibility for maintaining the canal, overseeing a walkway on its eastern side. The western side remains industrialised, hosting a large GlaxoSmithKline factory built on the former ironworks and paper mills site. Glaxo purchased the canal from the town council in 1974, using it as an emergency water reserve. In 2009, GlaxoSmithKline reevaluated its operations in Ulverston and subsequently sold the canal to Ulverston Canal Company, a subsidiary of NPL Estates Ltd, which specialises in land management. A Trust, established by GlaxoSmithKline, ensures funds are available for the canal's ongoing management, maintenance, and preservation."
    }
  ],
  "distance_km": 2.0,
  "description": "This short canal runs from the centre of the Cumbrian town of Ulverston to the coast at Morcambe Bay. At just over a mile long it makes for a nice easy stroll with lovely coastal views to enjoy at the end. There's also nice views of the Lake District fells and water loving wildlife to look out for on the water. The canal links with the Cumbria Coastal Way where you can extend your walk. Heading south will take you to Bardsea with nice views over Cartmel Sands and Ulverston Sands. Heading north takes you to Greenodd with views over the River Leven. At the town end of the canal you can pick up the Cumbria Way and head deeper into the Lake District. Also near Ulverston is the fascinating Birkrigg Common. You can follow the Cistercian Way to Urswick Tarn and then explore the network of paths on the elevated common. Here you will find Carboniferous limestone, an ancient stone circle and wonderful views over the Furness Peninsuala.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Stan Laurel Inn in the town is a nice place for post walk refreshment in the town. The pub is named after comedian Stan Laurel who came from the town. The friendly pub serves good home cooked food at reasonable prices. There's also a garden area for the summer. You can find them at 31 The Ellers with a postcode of LA12 0AB. At the end of the canal there's The Bay Horse Hotel & Restaurant. The former coaching inn dates back to the 17th century. You can find them at the seaward end of the canal at postcode LA12 9EL."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canal is a nice place for a stroll with your dog. The Bay Horse and the Stan Laurel Inn mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "From the canal basin it's a short climb up to the impressive Ulverston Lighthouse or Hoad Monument. There's great views from the top of the hill and the 19th century monument. The distinctive structure commemorates the life and work of Sir John Barrow who was born in Ulverston in 1764. It's located less than half a mile north from the basin so makes for a nice extension to the walk. Head south west and you can pick up the circular Barrow in Furness Walk which uses part of the Cumbria Coastal Way to visit the historic ruins at Furness Abbey and the sand dunes at the Sandscale Haws National Nature Reserve. You can also visit Walney Island in the town. The scenic island includes two more nature reserves and the only grey seal colony in Cumbria. From here there are also fine views over to Piel Island. The island includes a ruined 14th century castle and a historic pub dating back hundreds of years. You can catch a ferry to Piel island from nearby Roa Island. For more walking ideas in the area see the Lake District Walks and the Cumbria Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/XCBlQ8t4D0Q",
  "district": "Ulverston",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}