{
  "created_at": "2025-01-06T02:09:53.227914+00:00",
  "objectID": "5fbbd2ea20c06272af13c3251120f74a",
  "ref": "daisy-nook-country-park-walking-and-cycle-route",
  "title": "Daisy Nook Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/df/Daisy_Nook_Country_Park_-_geograph.org.uk_-_867464.jpg",
  "nearby": [
    {
      "description": "Rochdale Canal",
      "objectID": "9e315fd68b82273b696b35909c3a558e",
      "ref": "rochdale-canal-walking-and-cycle-route"
    },
    {
      "description": "Clayton Vale",
      "objectID": "132cddbc4ddd800881f25ff971207108",
      "ref": "clayton-vale-walking-and-cycle-route"
    },
    {
      "description": "Medlock Valley Way",
      "objectID": "117beb206e1a5c1969c12e03fc4ab417",
      "ref": "medlock-valley-way-walking-and-cycle-route"
    },
    {
      "description": "Oldham Way",
      "objectID": "5aeb40c8128d72cea5b1bb1992a0b91d",
      "ref": "oldham-way-walking-route"
    },
    {
      "description": "Strinesdale Country Park",
      "objectID": "ec92b6765fee620609bafe92e80ea7b7",
      "ref": "strinesdale-reservoir-and-country-park-walking-route"
    },
    {
      "description": "Boggart Hole Clough",
      "objectID": "371f71697a291bdea2d22c6f3cb6ea65",
      "ref": "boggart-hole-clough-walking-and-cycle-route"
    },
    {
      "description": "Tameside Trail",
      "objectID": "2b31b0ed991f37cdcbd7ee6f064ba384",
      "ref": "tameside-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/5/5fbbd2ea20c06272af13c3251120f74a.gpx",
  "_geoloc": {
    "lat": 53.5069956855,
    "lng": -2.1073152533
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Daisy_Nook_Country_Park_-_geograph.org.uk_-_867464.jpg",
      "title": "michael ely / Daisy Nook Country Park, via Wikimedia Commons",
      "caption": "Looking towards the visitor centre and main car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Crime_Lake_on_the_Hollinwood_Branch_Canal_in_Daisy_Nook_Country_Park_-_geograph.org.uk_-_1979.jpg",
      "title": "Martin Clark / Crime Lake on the Hollinwood Branch Canal in Daisy Nook Country Park, via Wikimedia Commons",
      "caption": "Crime Lake on the Hollinwood Branch Canal in Daisy Nook Country Park. Crime Lake was formed by the embankment that carried the Hollinwood Branch Canal across a small valley. It was a popular place of leisure in Victorian and Edwardian times. Today it forms part of Daisy Nook Country Park, between Ashton under Lyne and Oldham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/The_former_Waterhouses_Tunnel_at_Daisy_Nook_Country_Park_-_geograph.org.uk_-_1983.jpg",
      "title": "Martin Clark / The former Waterhouses Tunnel at Daisy Nook Country Park, via Wikimedia Commons",
      "caption": "The former Waterhouses Tunnel at Daisy Nook Country Park. Waterhouses Tunnel (or Dark Tunnel or Boodle Tunnel) on the Hollinwood Branch Canal was opened out in the 1920s. It now forms part of Daisy Nook Country Park and carries a footpath and bridle way through the cutting."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Waterhouses_Aqueduct%2C_Daisy_Nook_Country_Park_-_geograph.org.uk_-_1954.jpg",
      "title": "Martin Clark / Waterhouses Aqueduct, Daisy Nook Country Park, via Wikimedia Commons",
      "caption": "Waterhouses Aqueduct, Daisy Nook Country Park. The 80 feet high Waterhouses Aqueduct carried the Hollinwood Branch Canal across the River Medlock at Waterhouses"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Lock_staircase_on_the_Hollinwood_Branch_Canal_in_Daisy_Nook_Country_Park_-_geograph.org.uk_-_1949.jpg",
      "title": "Martin Clark / Lock staircase on the Hollinwood Branch Canal in Daisy Nook Country Park, via Wikimedia Commons",
      "caption": "Lock staircase on the Hollinwood Branch Canal in the park. The remains of the disused Hollinwood Branch Canal pass through Daisy Nook Country Park between Ashton under Lyne and Oldham. There were four locks here (Waterhouses Locks) including this unusual lock staircase. More about the canal can be found at http:/www.hollinwoodcanal.co.uk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Looking_west_along_the_Fairbottom_Branch_Canal_in_Daisy_Nook_Country_Park_-_geograph.org.uk_-_1961.jpg",
      "title": "Martin Clark / Looking west along the Fairbottom Branch Canal in Daisy Nook Country Park, via Wikimedia Commons",
      "caption": "Looking west along the Fairbottom Branch Canal in the park. The Fairbottom Branch Canal ran eastwards from the Hollinwood Branch Canal to Fenny Fields Bridge, where it met a tramway that carried coal from the mines at Fairbottom and Rocher Vale, Park Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Valley_Aqueduct_on_the_Fairbottom_Branch_Canal_-_geograph.org.uk_-_1966.jpg",
      "title": "Martin Clark / Valley Aqueduct on the Fairbottom Branch Canal, via Wikimedia Commons",
      "caption": "Valley Aqueduct on the Fairbottom Branch Canal. Valley Aqueduct, in Daisy Nook Country Park, carries the disused Fairbottom Branch Canal across the former coach road between Ashton under Lyne and Oldham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Looking_eastwards_across_Crime_Lake_towards_the_Pennines_-_geograph.org.uk_-_1981.jpg",
      "title": "Martin Clark / Looking eastwards across Crime Lake towards the Pennines, via Wikimedia Commons",
      "caption": "Hollinwood Branch Canal. Looking eastwards across Crime Lake towards the Pennines."
    }
  ],
  "distance_km": 2.0,
  "description": "Enjoy waterways, a lake, a canal, woodlands and wildflower meadows in this lovely country park in the Medlock Valley. The park is great for wildlife with great-spotted woodpeckers, owls, foxes and squirrels to look out for. The main highlights in the park are Crime Lake and the Hollinwood Branch Canal which was opened in the 1920s. There's also good facilities with a nice cafe and car park The park is very popular during the summer, with up to 30,000 visitors a month visiting the park, which stretches 18 miles from Bishops Park in Oldham to Paradise Wharf in Manchester. The Medlock Valley Way long distance path runs through the park so it's easy to extend your outing. If you head west along the path you will soon come to Clayton Vale. Here you can enjoy a walk along the River Medlock or try one of the great mountain bike trails devised by the National Cycling Centre. Following the path north will take you to Strinesdale Country Park where there's a nice circular trail around two pretty reservoirs.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Café Riverside, as the name implies, is situated right alongside the river and includes a lovely sunny open terrace. Here you can to sit outside and enjoy the relaxing sounds of the water passing by (you might even see a kingfisher or heron if you keep your eyes open) as you take morning coffee and cakes. There's also a nice Garden Centre which include one of the largest, most varied selection of plants available in the Manchester area."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is one of the best places in the area for a dog walk and you will probably see many other dog walkers on your outing."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a couple of miles west of the park and you can pick up the Rochdale Canal in Failsworth. Following it north will take you to Foxdenton Hall and Chadderton. The long distance Tameside Trail passes through the park. The 30 mile circular walk explores several of the highlights of the River Tame Valley. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/b0wpIQXCUe0",
  "postcode": "OL7 9PF",
  "district": "Ashton-under-Lyne",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}