{
  "objectID": "a00a67802530c124168c22fa33f8daae",
  "created_at": "2024-12-18T16:22:09.914740+00:00",
  "ref": "golden-valley-herefordshire-walking-route",
  "title": "Golden Valley Herefordshire Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Ewyas_Harold_Castle_%28Geograph_2291636_by_Philip_Halling%29.jpg/512px-Ewyas_Harold_Castle_%28Geograph_2291636_by_Philip_Halling%29.jpg",
  "nearby": [
    {
      "description": "Ewyas Harold Common",
      "objectID": "17cb7d4169feade71f0c7d8d74f1cfd0",
      "ref": "ewyas-harold-common-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a00a67802530c124168c22fa33f8daae.gpx",
  "_geoloc": {
    "lat": 51.9518515776,
    "lng": -2.8878373226
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Ewyas_Harold_Castle_%28Geograph_2291636_by_Philip_Halling%29.jpg/512px-Ewyas_Harold_Castle_%28Geograph_2291636_by_Philip_Halling%29.jpg",
      "title": "Philip Halling [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ewyas Harold Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Ewyas_Harold_Common_-_geograph.org.uk_-_71637.jpg",
      "title": "Hugh Venables / Ewyas Harold Common, via Wikimedia Commons",
      "caption": "Ewyas Harold Common. An open common area but grazing has only been sporadic since the 1960s and so there has a succession of vegetation through scrub (some in right of shot) to young woodland (at back). There has been some management to control bracken (hence bales) and re-instate grazing, encouraged by new Countryside Stewardship rules."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Dore_Abbey%2C_Abbey_Dore_-_geograph.org.uk_-_625166.jpg",
      "title": "Philip Pankhurst / Dore Abbey, Abbey Dore, via Wikimedia Commons",
      "caption": "Dore Abbey, Abbey Dore. The Eastern parts of a Cistercian abbey of 1175-80, restored in 1633. One of Herefordshire's jewels, no church lover should miss this wonderful place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Abbey_Dore_Court_Gardens.jpg",
      "title": "Trevor Rickard / Abbey Dore Court Gardens, via Wikimedia Commons",
      "caption": "Abbey Dore Court Gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/River_Dore%2C_Peterchurch_-_geograph.org.uk_-_1555240.jpg",
      "title": "Alan Spencer / River Dore, Peterchurch, via Wikimedia Commons",
      "caption": "River Dore, Peterchurch. View of the River Dore from the bridge by the church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Arthur%27s_Stone_%285%29_-_geograph.org.uk_-_1759658.jpg",
      "title": "ceridwen / Arthur's Stone (5), via Wikimedia Commons",
      "caption": "Arthur's Stone.  In this view from the west it can be seen that a large section of the capstone has flaked away and fallen into the chamber below. At other times it seems that the site was robbed of stones for building purposes (and one possibly taken for an altarstone at Peterchurch) so that the original structure may have been larger: Francis Kilvert's informant in the 1878 spoke of it as being of a size to shelter a hundred sheep in its shadow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Sundial_in_the_village_of_Dorstone_-_geograph.org.uk_-_45991.jpg/256px-Sundial_in_the_village_of_Dorstone_-_geograph.org.uk_-_45991.jpg",
      "title": "Philip Halling / Sundial in the village of Dorstone, via Wikimedia Commons",
      "caption": "Sundial in the village of Dorstone"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Dorstone_-_geograph.org.uk_-_45993.jpg",
      "title": "Philip Halling / Dorstone, via Wikimedia Commons",
      "caption": "Dorstone. The green in the centre of Dorstone, the disk on top of the pillar is a sundial"
    }
  ],
  "distance_km": 18.0,
  "description": "This walk takes you through the beautiful Golden Valley in western Herefordshire. It's a very scenic area with the rolling countryside of the valley of the River Dore and a number of pretty villages to enjoy. The valley stretches from Ewyas Harold in the south to Dorstone in the north. There are several interesting historical sites to visit on the way including a former mediaeval Cistercian monastery and a chamber tomb from the Neolithic Period. This walk starts from the village of Ewyas Harold which lies on the site of Ewyas Harold Castle, of which only the motte remains. From here you can pick up the Herefordshire Trail and follow it north through Ewyas Harold Common. The common contains an ancient greenway, meadow saffron (left over from cultivation by the monks at Dore Abbey), and lots of interesting wildlife. Soon after leaving the common you will come to Abbey Dore and the remains of Dore Abbey. This former mediaeval Cistercian monastery was built between 1175 and 1220 and restored in the 1630s. After exploring the atmospheric ruins the route continues past Abbey Dore Court which includes lovely gardens which are open to the public on certain days. At this point you pick up a nice footpath running along the River Dore to Blackbush Farm. Here you cross the river on Moorhampton Bridge and follow another path toward Turnastone, Vowchurch and Peterchurch. The final section of the walk follows a quiet country lane north west to the finish point at Dorstone. You can extend the walk slightly by continuing through the village north east to Arthur's Stone. The Neolithic chambered tomb, or Dolmen, dates from 3,700 BC – 2,700 BC. It is situated on the ridge line of a hill overlooking both the Golden Valley and the Wye Valley.",
  "postcode": "HR2 0HU",
  "district": "Ewyas Harold",
  "county": "County of Herefordshire",
  "region": "West Midlands",
  "country": "England"
}