{
  "created_at": "2025-01-05T22:29:56.547836+00:00",
  "objectID": "a0460cecc8bf600edc52a881f0da5169",
  "ref": "dover-white-cliffs-walk-walking-route",
  "title": "Dover White Cliffs Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/42/National_Trust_caf%C3%A9%2C_White_Cliffs%2C_Dover_-_geograph.org.uk_-_1189423.jpg",
  "nearby": [
    {
      "description": "White Cliffs Country Trails",
      "objectID": "4f7edc6243fdb2339d614977a84224ec",
      "ref": "white-cliffs-country-trails-walking-route"
    },
    {
      "description": "South Foreland Lighthouse",
      "objectID": "9142535527136441788f2efd48613b37",
      "ref": "south-foreland-lighthouse-walking-route"
    },
    {
      "description": "Alkham Valley",
      "objectID": "b79cd060083d8599ac095196ae4eb585",
      "ref": "alkham-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a0460cecc8bf600edc52a881f0da5169.gpx",
  "_geoloc": {
    "lat": 51.1316232134,
    "lng": 1.3374537963
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/National_Trust_caf%C3%A9%2C_White_Cliffs%2C_Dover_-_geograph.org.uk_-_1189423.jpg",
      "title": "Steve F [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "National Trust café, White Cliffs, Dover. The National Trust hails the cliffs as \"an icon of Britain\", noting that \"the white chalk face is a symbol of home and wartime defence.\" Before air travel became widespread, crossing at Dover was the primary route to the continent, making the white cliffs the first or last sight of Britain for travellers. During the Second World War, thousands of allied troops participating in the Dunkirk evacuation saw the reassuring sight of the cliffs from the little ships. In the summer of 1940, reporters gathered at Shakespeare Cliff to witness aerial dogfights between German and British aircraft during the Battle of Britain. Vera Lynn, famously known as \"The Forces' Sweetheart\" for her 1942 wartime classic \"(There'll Be Bluebirds Over) The White Cliffs of Dover,\" celebrated her 100th birthday in 2017. In that year, she spearheaded a campaign for donations to purchase 170 acres (0.7 km2) of land atop Dover's cliffs amidst concerns of potential development. The campaign successfully reached its target within three weeks. The National Trust, which already owns the surrounding areas, intends to restore the land to its natural state of chalk grassland and preserve existing military structures from the Second World War. In June 2021, a wildflower meadow on the White Cliffs of Dover was dedicated in honour of Dame Vera Lynn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Langdon_Bay_-_geograph.org.uk_-_1409815.jpg",
      "title": "Philip Halling / Langdon Bay, via Wikimedia Commons",
      "caption": "View over Langdon Bay and the White Cliffs of Dover. Just visible in the foreground on the left are the remains of wartime defences. The cliff face, which reaches a height of 350 feet (110 m), owes its striking appearance to its composition of chalk accented by streaks of black flint, deposited during the Late Cretaceous. The cliffs, on both sides of the town of Dover in Kent, stretch for eight miles (13 km). The White Cliffs of Dover form part of the North Downs. A section of coastline encompassing the cliffs was purchased by the National Trust in 2016. The cliffs are part of the Dover to Kingsdown Cliffs Site of Special Scientific Interest and Special Area of Conservation. The point where Great Britain is closest to continental Europe, on a clear day the cliffs are visible from France (approximately 20 miles (32 km) away). A celebrated UK landmark, the cliffs have featured on commemorative postage stamps issued by the Royal Mail, including in their British coastline series in 2002 and UK A-Z series in 2012."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/View_to_St_Margaret%27s_at_Cliffe_-_geograph.org.uk_-_1409474.jpg",
      "title": "Philip Halling / View to St Margaret's at Cliffe, via Wikimedia Commons",
      "caption": "View up the coast towards St Margaret's at Cliffe from on top of South Foreland Lighthouse. A windmill can be seen in the middle distance. Channel swimmers and submarine telephone cables start from St Margaret's Bay. At the north end of the bay is Leathercote Point (sometimes spelt Leathercoat Point or Lethercote Point), where there is the Dover Patrol Monument war memorial commemorating the Dover Patrol."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Dover_South_Foreland_0348.JPG/512px-Dover_South_Foreland_0348.JPG",
      "title": "Clem Rutter, Rochester, Kent [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "From Langdon Cliffs, east of Dover to South Foreland the cliffs rise 120 m. The chalk grassland on tops give views over the lighthouse and the English Channel. The environment above the cliffs provides an excellent habitat for many species of wildflowers, butterflies, and birds, and has been designated a Special Area of Conservation and a Site of Special Scientific Interest. Rangers and volunteers work to clear invasive plants that threaten the native flora. A grazing programme involving Exmoor ponies has been established to help clear faster-growing invasive plants, allowing smaller, less robust native plants to thrive. The ponies are managed by the National Trust, Natural England, and County Wildlife Trusts to maintain vegetation on nature reserves. The cliffs serve as the first landing point for many migratory birds flying inland from across the English Channel. After a 120-year absence, in 2009 it was reported that ravens had returned to the cliffs. Similar in appearance but smaller, the jackdaw is abundant. The rarest of the birds that inhabit the cliffs is the peregrine falcon. In recent decline, the skylark also finds its home on the cliffs. The cliffs are also home to fulmars and colonies of black-legged kittiwake, a species of gull. Since bluebirds are not indigenous to the UK, some believe that the bluebirds mentioned in the classic World War II song \"(There'll Be Bluebirds Over) The White Cliffs of Dover\", composed by American artists, may actually refer to swallows and/or house martins, which make an annual migration to continental Europe, many of them crossing the English Channel at least twice a year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/South_Foreland_Lighthouse_back.jpg/256px-South_Foreland_Lighthouse_back.jpg",
      "title": "User:Ethan Doyle White [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The back of South Foreland Lighthouse atop the White Cliffs of Dover. The South Foreland Lighthouse is a Victorian-era structure situated on the South Foreland in St. Margaret's Bay. It was originally erected to caution ships approaching the nearby Goodwin Sands. Goodwin Sands is a 10-mile-long (16 km) sandbank positioned at the southern end of the North Sea, approximately six miles (10 km) off the coast of Deal. This area comprises a layer of fine sand, around 82 ft (25 m) deep, resting on a chalk platform that is part of the same geological formation as the White Cliffs of Dover. It is estimated that over 2,000 ships have been wrecked on the Goodwin Sands due to their proximity to the major shipping lanes through the Straits of Dover. The lighthouse ceased operation in 1988 and is currently under the ownership of the National Trust for Places of Historic Interest or Natural Beauty."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Dover_South_Foreland_0365.JPG/512px-Dover_South_Foreland_0365.JPG",
      "title": "Clem Rutter, Rochester, Kent [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "From Langdon Cliffs. Among the wildflowers found in the area are several varieties of orchids, including the rare early spider orchid, which has yellow-green to brownish-green petals resembling the body of a large spider. Rock samphire, an edible, salt-tolerant succulent plant, grows on the cliff's slopes. The oxtongue broomrape is an unusual plant that lives on the roots of a host plant. It features yellow, white, or blue snapdragon-like flowers, with about 90 percent of the UK's population found on the cliffs. Viper's-bugloss, a showy plant with vivid shades of blue and purple and red stamens, also thrives along the cliffs. The abundance of wildflowers provides habitats for approximately thirty species of butterfly. The rare Adonis blue can be observed in spring and autumn. Males have vibrant blue wings lined with a white margin, while females are a rich chocolate brown. This species' sole larval food plant is the horseshoe vetch, and it has a symbiotic relationship with red or black ants. The eggs are laid singly on very small food plants growing in short turf, providing a warm microclimate suitable for larval development, favored by ants. The caterpillar has green and yellow stripes for camouflage while feeding on vetch. The ants extract sugary secretions from the larval \"honey glands\" and protect the larvae from predators and parasitoids, even burying them at night. The larvae pupate in the upper soil, continuing to be protected by the ants, often in their nests, until the adults emerge in spring or autumn. Similar in appearance but more abundant is the chalkhill blue, a specialist of chalk grassland visible in July and August. Threatened species include the silver-spotted skipper and straw belle. The well-known red admiral can be spotted from February to November, while the marbled white, black and white with a white wing border, can be seen from June to August."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/1_dover_castle_aerial_panorama_2017.jpg/512px-1_dover_castle_aerial_panorama_2017.jpg",
      "title": "Chensiyuan, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Dover Castle aerial panorama. Dover Castle, hailed as the largest castle in England, traces its origins back to the 11th century. Its strategic significance throughout history has earned it the moniker \"Key to England.\" Founded by William the Conqueror in 1066, the castle underwent subsequent rebuilding efforts under the reigns of Henry II, King John, and Henry III. These expansions brought the castle to its current size, with its curtain walls extending to the edge of the cliffs. During the First Barons' War, King John's soldiers held the castle while enduring a siege by the French from May 1216 to May 1217. It faced another siege in 1265 during the Second Barons' War. In the 16th century, cannons were installed, though its military significance waned as Henry VIII constructed artillery forts along the coast. Dover Castle saw capture in 1642 during the Civil War when townspeople scaled the cliffs and surprised the royalist garrison, marking a symbolic victory against royal control. While many castles were destroyed towards the end of the war, Dover was spared. Renewed importance came to the castle in the 1740s with the rise of heavy artillery, making port capture a pivotal aspect of warfare. During the Napoleonic Wars, the defences underwent remodelling, and a network of tunnels was carved into the cliffside to serve as barracks, accommodating an additional 2,000 soldiers. These tunnels lay mostly dormant until the Second World War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Cliffs_Dover.jpg/256px-Cliffs_Dover.jpg",
      "title": "Sandra Troia [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Dramatic cliffs near St Margaret's. Thousands of years ago, the cliffs were eroding at 20–60 mm (0.75–2.3 in) a year. Research shows that the erosion rate over the last 150 years has increased to 220–320 mm (8.7–12.6 in) a year, and that the erosion is caused by the loss of beach underneath the cliffs exacerbated by stronger storms and human activity such as gravel extraction. Despite this, the cliffs are expected to survive for tens of thousands of years more. In 2001, a large chunk of the cliff edge, as large as a football pitch, fell into the Channel. Another large section collapsed on 15 March 2012, another on 4 February 2020, and another on 3 February"
    }
  ],
  "distance_km": 6.6,
  "description": "Enjoy a circular walk along the iconic White Cliffs of Dover on this route along the Kent Coast. There's attractive chalk grassland, pretty wildlflowers in the summer, a visit to a significant lighthouse and fantastic views over the English Channel to France. Start the walk from the National Trust Car Park on Langdon Cliffs. There's a great visitor centre here with a wealth of information on the area. From here you can then pick up footpaths to join with the White Cliffs Country Trails which runs east along the cliffs to Langdon Bay, Crab Bay, Fan Bay and the South Foreland Lighthouse. The lighthouse was the first to display an electric light anywhere in the world. You can climb to the top of the structure and enjoy great views over to France. Also in this area you will pass the Grade II listed St Margaret's Windmill and the lovely Pines gardens. The gardens are well worth exploring with a waterfall and adjoining lake, a grass labyrinth and an organic kitchen garden with around 40 different species of fruit and vegetables. After exploring South Foreland the route returns to the visitor centre where you can enjoy refreshments at the National Trust cafe. To extend the walk head a short distance west to visit the dramatic Dover Castle. The castle has a fascinating history and includes the Secret Wartime Tunnels which are well worth a visit.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north west there's the Alkham Valley where you'll find an Area of Outstanding Natural Beauty. The valley includes some fine footpaths and two significant historical sites including the ruins of St Radigund's Abbey and the 11th century St Peter's Church. There's also a fine local pub in the pretty village of Alkham here. At the eastern end of the valley you could visit the noteworthy Kearsney Abbey. There's some beautiful gardens here with ornamental lakes and views of the River Dour the highlights."
    }
  ],
  "video_url": "https://www.youtube.com/embed/J_-aX282Ps4",
  "postcode": "CT16 1HJ",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "National Trust White Cliffs of Dover, North Camber Way, Port of Dover - Eastern Docks, Dover, Kent, England, CT16 1HJ, United Kingdom",
  "district": "Dover",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "chalk grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "lighthouse",
    "gardens"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "cafe",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}