{
  "created_at": "2025-01-06T02:44:48.908240+00:00",
  "objectID": "a06c6a52bf5e4e33af0e6f0232bd3297",
  "ref": "finsbury-park-walking-route",
  "title": "Finsbury Park Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/52/Finsbury_Park_-_geograph.org.uk_-_680285.jpg",
  "nearby": [
    {
      "description": "Parkland Walk",
      "objectID": "99ebadd998417cdb5b1c69f10edd9382",
      "ref": "parkland-walk-walking-route"
    },
    {
      "description": "Dollis Valley Green Walk",
      "objectID": "cb6a7287ea281d933efef82ab4608634",
      "ref": "dollis-valley-green-walk-walking-route"
    },
    {
      "description": "Capital Ring",
      "objectID": "ec2dd412bf73a76208eeb393c1b23372",
      "ref": "capital-ring-walking-route"
    },
    {
      "description": "Hampstead Heath",
      "objectID": "7454be7653cb8e4ef0870c2419e7356a",
      "ref": "hampstead-heath-walking-and-cycle-route"
    },
    {
      "description": "Alexandra Park",
      "objectID": "fc3c4c5526e9667f0d822f67e0c6db2e",
      "ref": "alexandra-park-walking-and-cycle-route"
    },
    {
      "description": "Walthamstow Reservoirs",
      "objectID": "cc1d4fafac5ce4856d116ea165833604",
      "ref": "walthamstow-reservoirs-walking-and-cycle-route"
    },
    {
      "description": "Hackney Marshes",
      "objectID": "18db167e8533540ccf4aeb244674dff6",
      "ref": "hackney-marshes-walking-route"
    },
    {
      "description": "New River Path",
      "objectID": "6588b9959201d98e256c3f9b7ba0c66a",
      "ref": "new-river-path-walking-route"
    },
    {
      "description": "Green London Way",
      "objectID": "e259e12d0abfa57ca9b45deaa30ec1f5",
      "ref": "green-london-way-walking-route"
    },
    {
      "description": "Tottenham Marshes",
      "objectID": "b1e4489565bc6610f6557a797ec785f5",
      "ref": "tottenham-marshes-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a06c6a52bf5e4e33af0e6f0232bd3297.gpx",
  "_geoloc": {
    "lat": 51.5653246077,
    "lng": -0.1054560078
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Finsbury_Park_-_geograph.org.uk_-_680285.jpg",
      "title": "Stephen McKay / Finsbury Park",
      "caption": "The southern end of the park looking towards Seven Sisters Road. This large park was opened in its present form in 1869, although the area had been used as pleasure gardens before that. In the second world war the park housed anti-aircraft guns and a barrage balloon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Finsbury_Park_-_geograph.org.uk_-_681145.jpg",
      "title": "Stephen McKay / Finsbury Park",
      "caption": "Finsbury Park seen here near to the Oxford Road gate. Finsbury Park was opened by the Metropolitan Board of Works in August 1869, replacing Finsbury Fields as a facility for the people of Finsbury (hence the name). It is now run by Haringey Council."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Finsbury_Park_Boating_Lake_-_geograph.org.uk_-_680287.jpg/256px-Finsbury_Park_Boating_Lake_-_geograph.org.uk_-_680287.jpg",
      "title": "Stephen McKay / Finsbury Park Boating Lake",
      "caption": "Two pigeons and a crow perch on temporary fencing beside the lake in the centre of the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Station_Place%2C_Finsbury_Park_-_geograph.org.uk_-_681218.jpg/256px-Station_Place%2C_Finsbury_Park_-_geograph.org.uk_-_681218.jpg",
      "title": "Stephen McKay / Station Place, Finsbury Park",
      "caption": "Station Place, Finsbury Park station, where National Rail meets the Victoria and Piccadilly lines, is one of the busiest in London outside the central area - especially when Arsenal are playing at the Emirates Stadium. Outside in Station Place there are a number of bus stops - together this forms the Finsbury Park Transport Interchange. The impressive new canopy protects passengers from the rain. The interchange was opened by the Mayor of London, Ken Livingstone, in December 2006."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Parkland_Walk_-_geograph.org.uk_-_1593101.jpg",
      "title": "Oxyman / Parkland Walk",
      "caption": "View of the parkland walk near Finsbury Park. The 4.5-mile (7.2 km) linear green walkway runs along the trackbed of a former Great Northern Railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Highgate_Wood_-_geograph.org.uk_-_1282073.jpg",
      "title": "Shaun Ferguson / Highgate Wood",
      "caption": "Highgate Wood. View near Keeper's Cottages by Archway Gate"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Mixed_Bathing_Pond%2C_Hampstead_Heath_-_geograph.org.uk_-_1029150.jpg",
      "title": "Stephen McKay / Mixed Bathing Pond, Hampstead Heath, via Wikimedia Commons",
      "caption": "The Mixed Bathing Pond on Hampstead Heath. This pond is the uppermost of the three Hampstead Ponds at the southern end of Hampstead Heath, created in the 18th century by damming Hampstead Brook, a tributary of the River Fleet,to supply London with water. Mixed bathing is allowed here during the summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Walking_over_Hampstead_Heath_-_geograph.org.uk_-_1029173.jpg",
      "title": "Stephen McKay / Walking over Hampstead Heath, via Wikimedia Commons",
      "caption": "Walking over Hampstead Heath. The heath has long been a popular place for Londoners to get out into the fresh air, as this couple are, strolling up from Hampstead Ponds at the southern end of the Heath."
    }
  ],
  "distance_km": 13.0,
  "description": "Finsbury Park is one of the significant London Parks and a lovely place for a stroll. The historic park was one of the first city parks to be created during the Victorian era. In the park you'll find a boating lake, lovely gardens and fine views towards some of London's landmarks. It's also the start point for the Parkland Walk, a popular trail running along an old railway line to Alexandra Park. This walk follows part of the Parkland Walk before heading to Highgate Wood and Hampstead Heath. It's a nice way of seeing some of the local walking highlights and is easily accessible with train and tube stations at either end of the route. The walk starts at Finsbury Park tube station where it's a short walk to the pretty park. Here you can start off by exploring the park on a number of good surfaced footpaths. At the western side of the park you can pick up the Parkland Walk and follow the rail trail north west to Crouch End and Highgate Wood. This walk leaves the railway walk here though you could continue on to Alexandra Palace if you wish. The route picks up the Capital Ring and follows it north west through the woodland trails in Highgate Wood. You continue west through Fortis Green, East Finchley and Hampstead Garden Suburb where you pick up the Dollis Valley Green Walk. This waymarked trail will take you south along the pretty Dollis Brook to Mill Hill or Hampstead Heath. Here you can enjoy a climb to Parliament Hill for fine views over the city. The route then heads past the Hampstead Ponds to Hampstead train station. Here you can catch the train back towards Finsbury Park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Finsbury Park there's a nice family run cafe for refreshments. It's located in a good spot, close to the lake and has a fine range of meals and snacks. At the other end of the route there's the Parliament Hill Cafe at Hampstead Heath. There's a good range of snack and an outdoor seating area to relax in warmer days here. You can find it at postcode NW5 1QR for your sat navs. There's an abundance of fine cafes and pubs around the heath as well. One noteworthy place worth consideration is The Spaniards Inn. The pub dates from 1585 and has some interesting literary connections. John Keats apparently penned Ode to a Nightingale in the garden and the pub is also mentioned in Charles Dickens’ Pickwick Papers. There's an attractive interior with oak-panelled walls, chandeliers, beams and log fires. Outside there's a nice garden with a BBQ on warmer days. You can find the inn on Spaniards Road at the north western end of the heath. Postcode for your sat nav is NW3 7JJ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near to the park you'll find Hackney Marshes, Tottenham Marshes and the Walthamstow Reservoirs where there are some nice waterside trails to try. You can also pick up the long distance New River Path in the park and enjoy a riverside stroll along the New River. The epic Green London Way also passes through the area. For more walking ideas in the area see the Greater London Walks page."
    }
  ],
  "postcode": "N4 2DF",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Finsbury Park Cycle Park, 12, Stroud Green Road, Stroud Green, London Borough of Haringey, London, Greater London, England, N4 2DF, United Kingdom",
  "state": "England"
}