{
  "objectID": "a0d01587cc8e5c905449faa690fbaf09",
  "created_at": "2024-12-18T09:54:23.479888+00:00",
  "ref": "nutbrook-trail-walking-and-cycle-route",
  "title": "Nutbrook Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Shipley_Country_Park_-_Nutbrook_Trail_View_-_geograph.org.uk_-_681828.jpg",
  "nearby": [
    {
      "description": "Erewash Canal",
      "objectID": "e5e398a58bcf54dce4342ad1064fb6a8",
      "ref": "erewash-canal-walking-and-cycle-route"
    },
    {
      "description": "Erewash Valley Trail",
      "objectID": "0a9afadb35d1090581c1ae9fe3e5d241",
      "ref": "erewash-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Shipley Country Park",
      "objectID": "8a96136240f8ad9e25727e82a7c3b59e",
      "ref": "shipley-country-park-walking-and-cycle-route"
    },
    {
      "description": "Ilkeston",
      "objectID": "978bac121e2b7b957e9a68da51e8ef7f",
      "ref": "ilkeston-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/CA41129937CD845A80258034005731DA/$FILE/Nutbrook Trail.gpx",
  "_geoloc": {
    "lat": 52.8970335304,
    "lng": -1.2755761358
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Shipley_Country_Park_-_Nutbrook_Trail_View_-_geograph.org.uk_-_681828.jpg",
      "title": "Alan Heardman / Shipley Country Park - Nutbrook Trail View, via Wikimedia Commons",
      "caption": "The trail running through Shipley Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Statue_at_the_start_of_the_Nutbrook_Trail_-_geograph.org.uk_-_754867.jpg/256px-Statue_at_the_start_of_the_Nutbrook_Trail_-_geograph.org.uk_-_754867.jpg",
      "title": "David Lally / Statue at the start of the Nutbrook Trail, via Wikimedia Commons",
      "caption": "Statue at the start of the trail. It is called Wild Weeds Birch and is by Hilary Cartwell and Michael Johnson, dated 2001."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Two_bridges_-_geograph.org.uk_-_775269.jpg",
      "title": "Kate Jewell / Two bridges, via Wikimedia Commons",
      "caption": "Two bridges. In the foreground the trail goes over its namesake, the Nut Brook. QuarryHill Road is carried over the trail on the bridge beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Nutbrook_Trail%2C_Marlpool_-_geograph.org.uk_-_1266321.jpg/256px-Nutbrook_Trail%2C_Marlpool_-_geograph.org.uk_-_1266321.jpg",
      "title": "Stephen McKay / Nutbrook Trail, Marlpool, via Wikimedia Commons",
      "caption": "Marlpool. The former Heanor branch of the Great Northern Railway is now used as a footpath and cycleway. Passenger services were withdrawn as early as 1928 - incidentally, making Heanor one of the first towns in the country to be deprived of a train service, the LMS station having been closed two years earlier. Frequent tram and bus services in the area at that time no doubt led to the railway's demise. Freight services continued until 1963, however."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Nutbrook_Trail%2C_Marlpool_-_geograph.org.uk_-_1265436.jpg",
      "title": "Stephen McKay / Nutbrook Trail, Marlpool, via Wikimedia Commons",
      "caption": "Woodland section in Marlpool. This footpath and cycleway uses the trackbed of the Great Northern Railway's Heanor branch which lost its passenger service as long ago as 1928, although freight trains ran until 1963. A group of dog walkers heads off towards Heanor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/The_Nutbrook_Trail_-_geograph.org.uk_-_774927.jpg",
      "title": "Kate Jewell / The Nutbrook Trail, via Wikimedia Commons",
      "caption": "Cyclist on the trail at Stanton.  This section, at Stanton, traverses the edge of the old Stanton Ironworks site following the line of the Stanton branch railway, and is open to horse riders as well as cyclists and walkers. It takes its name from the Nut Brook, (behind the trees on the right), and the disused Nutbrook Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Old_railway_bridge_over_the_Nutbrook_Trail_-_geograph.org.uk_-_775126.jpg",
      "title": "Kate Jewell / Old railway bridge over the Nutbrook Trail, via Wikimedia Commons",
      "caption": "Old railway bridge over the trail. The trail follows the route of the dismantled Stanton railway branch line. The track that this bridge carried over the branch line used to link one side of the old Stanton Ironworks to the other. The namesake of the trail, the Nut Brook, is culverted under the footpath at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Erewash_Canal_looking_north_from_Sandiacre_bridge_-_geograph.org.uk_-_953123.jpg",
      "title": "David Pinney / Erewash Canal looking north from Sandiacre bridge, via Wikimedia Commons",
      "caption": "Erewash Canal looking north from Sandiacre bridge. The canal was built in 1777-1779 to carry coal from mines on either side of the Erewash valley to Leicestershire. Padmore Moorings are on the left adjacent to Town Street. Springfield Mill with its noticeable chimney was built in 1888 as a lace factory. The towpath is part of an off-road cycle route named the Nutbrook Trail."
    }
  ],
  "distance_km": 16.0,
  "description": "This easy cycling and walking trail runs from Long Eaton to Heanor along the Erewash Canal and a dismantled railway line. It runs for about 10 miles and is part of National Cycle Route 67. It's a great one for families or anyone looking for a safe, flat ride or walk. The route starts in Long Eaton next to West Park and follows the Erewash Canal north through Sandiacre and Stapleford. It's a pleasant section along the canal towpath with pretty locks and old stone bridges. Just after Stapleford you leave the canal and bear west toward Ilkeston along a dismantled railway line. You'll pass through the pretty Manor Floods Nature Reserve where there is a nice lake and lots of wildlife to look out for. The final section takes you through the lovely Shipley Country Park to the finish point at Heanor. It's a great park with 700 acres of woodland, lakes and parkland. To extend your outing you could pick up the circular Erewash Valley Trail and further explore the Derbyshire and Nottinghamshire countryside on your bike or on foot.",
  "district": "Long Eaton",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}