{
  "created_at": "2025-01-06T04:20:27.301297+00:00",
  "objectID": "a0d7ddc5c07758cf0e870e6b074aabf6",
  "ref": "stourhead-walking-route",
  "title": "Stourhead Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5e/The_bridge_at_Stourhead_-_geograph.org.uk_-_374803.jpg",
  "nearby": [
    {
      "description": "White Sheet Hill",
      "objectID": "2d6744f4c44b20247cac01fde202dca6",
      "ref": "white-sheet-hill-walking-route"
    },
    {
      "description": "Leland Trail",
      "objectID": "69f155d0de56fd039f2b3816d30fa952",
      "ref": "leland-trail-walking-route"
    },
    {
      "description": "Wylye Way",
      "objectID": "168515a9e440edc52d544a97324c3297",
      "ref": "wylye-way-walking-route"
    },
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "Bruton",
      "objectID": "1f4d7426017b6c8eaed4cc094affbc8f",
      "ref": "bruton-walking-route"
    },
    {
      "description": "Mere",
      "objectID": "7e6d86cb423113f297cab4b494a24287",
      "ref": "mere-walking-route"
    },
    {
      "description": "Penselwood",
      "objectID": "1ad40fdce879b29ef1a5b92d95f88ac1",
      "ref": "penselwood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a0d7ddc5c07758cf0e870e6b074aabf6.gpx",
  "_geoloc": {
    "lat": 51.1041271756,
    "lng": -2.3225269632
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/The_bridge_at_Stourhead_-_geograph.org.uk_-_374803.jpg",
      "title": "Graham Horn / The bridge at Stourhead, via Wikimedia Commons",
      "caption": "The bridge at Stourhead. The bridge that everyone photographs, but surprisingly not a similar picture here. Part of the Stourhead Estate, this bridge crosses a stream entering the Garden Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Northern_edge_of_Stourhead_Estate_-_geograph.org.uk_-_417389.jpg",
      "title": "Doug Lee / Northern edge of Stourhead Estate, via Wikimedia Commons",
      "caption": "Northern edge of Stourhead Estate. The line of trees to the left marks the northern boundary of the Stourhead estate. Whilst most of the estate to the west is forest, this section is open and appears to have been planted with a cereal crop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/The_Garden_Lake_at_Stourhead_-_geograph.org.uk_-_32673.jpg",
      "title": "Nigel Freeman / The Garden Lake at Stourhead, via Wikimedia Commons",
      "caption": "The Garden Lake at Stourhead. Looking from the iron bridge in the south western corner of the Garden Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Stourhead_House_-_geograph.org.uk_-_31721.jpg",
      "title": "Jon Wornham / Stourhead House, via Wikimedia Commons",
      "caption": "Stourhead House. Owned by the National Trust, Stourhead House is close by the famous gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Autumn_Colours_-_Stourhead_-_geograph.org.uk_-_1044919.jpg",
      "title": "Mike Searle / Autumn Colours - Stourhead, via Wikimedia Commons",
      "caption": "Autumn Colours"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/The_Palladian_Bridge%2C_Stourhead_-_geograph.org.uk_-_1303875.jpg",
      "title": "JThomas / The Palladian Bridge, Stourhead, via Wikimedia Commons",
      "caption": "The 17th century Palladian bridge at Stourhead. The classic view of Capability Brown's handiwork, looking across the lake to the Pantheon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/The_Pantheon_at_Stourhead_-_geograph.org.uk_-_206655.jpg",
      "title": "Neil Kennedy / The Pantheon at Stourhead, via Wikimedia Commons",
      "caption": "The Pantheon at Stourhead"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Temple_of_Apollo%2C_Stourhead_-_geograph.org.uk_-_371744.jpg",
      "title": "Brian / Temple of Apollo, Stourhead, via Wikimedia Commons",
      "caption": "Temple of Apollo, Stourhead"
    }
  ],
  "distance_km": 2.5,
  "description": "The 1,072 hectare (2,650 acre) Stourhead estate has miles of lovely walking trails to try. You can follow the well surfaced footpaths around the stunning lake and into the surrounding woodlands, parkland and gardens. There is a collection of exotic trees which look wonderful in the autumn months. You'll also pass some classical architecture including temples, mystical grottoes and the beautiful arched bridge over the lake. If you would like to extend your walking in the area then you could follow the Stour Valley Way south towards Bourton. The waymarked, long distance trail can also be used to create a circular walk around the estate. The Leland Trail also starts at Stourhead so you could pick this up and visit King Alfred's Tower. To extend your walk you could climb White Sheet Hill for wonderful views over the Cranborne Chase AONB. You can virtually explore Stourhead using the google street view link below!",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the lovely on site restaurant where there's a good menu with an outdoor seating area. There's also the Spread Eagle Inn which is within the estate in the village of Stourton. The 18th century inn also has a good selection of meals and drinks."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The parkland and woodland on the estate make for a fine dog walk. You are asked to please keep them on leads."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Bruton Walk starts from the nearby Somerset Town, located to the west of the estate. It follows the Leland Trail through the countryside to the estate, passing the town's 15th century packhorse bridge over the River Brue and the interesting 16th century Bruton Dovecote on the way. It also visits King Alfred's Tower, located to the north west of the house. The Tower is named after King Alfred who raised his standard here in 870. The structure commemorates the accession of George III in 1760 and the end of the Severn Years War. You can climb the tower's 205 steps and admire the spectacular view of the three surrounding counties. It also marks the start point of the long distance Leland Trail. The circular Gillingham Walk visits the estate from the nearby Dorset town. It follows the Stour Valley Way through Bourton and Zeals to the south of the estate.  To the east you can pick up the Mere Walk which starts from the attractive town and climbs to White Sheet Hill. The hill is part of the Stourhead Estate and includes an Iron Age Hillfort, an aerial transmitter and a small reservoir. There's also some lovely downland and excellent views over the area. The town itself is also worth visiting with a photogenic market square, the excellent viewpoint at Long Hill and a fine 16th century coaching inn for refreshment afterwards. For more walking ideas in the area see the Wiltshire Walks and the Cranborne Chase Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/vw2Ea7rplis",
  "postcode": "BA12 6QD",
  "district": "Stourton",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stourton with Gasper, Stourton, Wiltshire, England, BA12 6QD, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "garden",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}