{
  "created_at": "2025-01-06T05:12:58.115573+00:00",
  "objectID": "a0e6a6a3e50a1f3d8f11fae63d5bbc3a",
  "ref": "combe-gibbet-walking-route",
  "title": "Combe Gibbet Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Combe_Gibbet_-_geograph.org.uk_-_1907.jpg",
  "nearby": [
    {
      "description": "Walbury Hill",
      "objectID": "00a3a023c99baeef1c7d31e297f3ce14",
      "ref": "walbury-hill-walking-route"
    },
    {
      "description": "Test Way",
      "objectID": "f7f671cf68a772945c580a3901d631a6",
      "ref": "test-way-walking-route"
    },
    {
      "description": "Inkpen",
      "objectID": "8e0242a41276b78e4d059bee461837cc",
      "ref": "inkpen-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a0e6a6a3e50a1f3d8f11fae63d5bbc3a.gpx",
  "_geoloc": {
    "lat": 51.356405694,
    "lng": -1.470490403
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Combe_Gibbet_-_geograph.org.uk_-_1907.jpg",
      "title": "Subarite [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Combe Gibbet stands on the top of Combe down, and was erected on top of a Neolithic burial mound. It was only ever put to its grisly use once in 1676. George Broomham of Combe, and Dorothy Newman of Inkpen brutally killed Martha and Robert Broomham. For that crime they were both tried and then hanged at the Winchester Assizes. Their dead bodies were hung on either side of the Combe Gibbet to act as a grim deterrent to other would be wrong doers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Gallows_Down_-_view_to_the_east_from_Combe_Gibbet_-_geograph.org.uk_-_1179068.jpg",
      "title": "Ian Cunliffe / Gallows Down - view to the east from Combe Gibbet, via Wikimedia Commons",
      "caption": "Gallows Down to the east of the gibbet"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Road_and_byway_to_Combe_Gibbet_-_geograph.org.uk_-_1014643.jpg",
      "title": "Andrew Smith / Road and byway to Combe Gibbet, via Wikimedia Commons",
      "caption": "Road and byway to Combe Gibbet This is the Test Way recreational route climbing away from the car park on the western side of Walbury Hill. The surface deteriorates beyond the gibbet and is dreadful in places."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/The_top_of_Combe_Gibbet%2C_Inkpen_Hill_-_geograph.org.uk_-_580073.jpg",
      "title": "Brian Robert Marshall / The top of Combe Gibbet, Inkpen Hill, via Wikimedia Commons",
      "caption": "The top of Combe Gibbet, Inkpen Hill. I understand that the gibbet seen here is the latest in a long line of replacements of the first 17th century one. If this is the case - and it seems reasonable to accept that it is - the attention to detail here is remarkable. Note the rope burns in the cross-piece which would have been worn in the original by the weight of corpses swinging and turning in the wind..."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/View_from_Inkpen_Hill_-_geograph.org.uk_-_2456386.jpg",
      "title": "View from Inkpen Hill by Sarah Charlesworth, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from Inkpen Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Longbarrow_on_Gallows_Down_-_geograph.org.uk_-_62318.jpg",
      "title": "Pam Brophy / Longbarrow on Gallows Down",
      "caption": "Longbarrow on Gallows Down. This long barrow and gibbet on \"Test Way\" at Gallows Down. The square is mainly farmland utilised for agriculture and pasture."
    }
  ],
  "distance_km": 3.0,
  "description": "This walk climbs to the interesting structure of Combe Gibbet and continues on to Inkpen Hill. The gibbet was erected in 1676 for the purpose of gibbeting the bodies of George Broomham and Dorothy Newman. The gibbet was placed high on Gallows Down as a detterent to other criminals. It's now a popular tourist destination with great views and a number of footpaths to follow through the surrounding countryside. The hill is also a popular climb for cyclists with a number of bridleways to follow across Inkpen and Walbury Hill. This walk starts at the Inkpen Beacon car park and climbs to the gibbet along the Test Way long distance footpath. It's a good path which leads to the Inkpen long barrow and then up onto Inkpen Hill. From here there are wonderful views over the surrounding Berkshire countryside. The walk can be extended to visit the nearby Walbury Hill. At 297 m (974 ft) Walbury Hill is the highest point in Berkshire and South East England. At the summit you can enjoy more great views over the county and explore the Iron Age Hill fort of Walbury Camp. If you continue along the Test Way you can visit Combe Wood. You could also pick up the Wayfarer's Walk and head south east along a wonderful ridge top path to the nearby Pilot Hill, the highest hill in Hampshire.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "For a longer circular walk you could try the Inkpen Walk. This starts from the 17th century Crown and Garter Pub in the little village which lies just north of the hill. The dog friendly pub has a decent sized car park and serves good quality pub food. You can find them at postcode RG17 9QR. In the village you could also pay a vist to the noteworthy 13th century church and a rare Mediterranean crocus field, one of only two in the United Kingdom."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8kSjpC5DhOc",
  "county": "West Berkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Inkpen, West Woodhay, West Berkshire, England, RG17 9EH, United Kingdom",
  "postcode": "RG17 9EH",
  "district": "West Woodhay",
  "state": "England"
}