{
  "objectID": "a118e13def0e80a0123289d25511f18f",
  "created_at": "2024-12-18T22:53:43.216754+00:00",
  "ref": "swyre-head-walking-route",
  "title": "Swyre Head Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/62/Footpath_to_Swyre_Head_-_geograph.org.uk_-_160988.jpg",
  "nearby": [
    {
      "description": "Kimmeridge Bay to Chapmans Pool",
      "objectID": "8bf494265d0239bbd58479ec4d6f762c",
      "ref": "kimmeridge-bay-to-chapmans-pool-walking-route"
    },
    {
      "description": "The Hardy Way - Wareham-Corfe Castle-Kimmeridge",
      "objectID": "9d9eaedb227c3b03971547f8e0d2aff1",
      "ref": "the-hardy-way---wareham-corfe-castle-kimmeridge-walking-route"
    },
    {
      "description": "Corfe Castle",
      "objectID": "a41a4f07c0e3e0ab6661161546ce00bf",
      "ref": "corfe-castle-walking-route"
    },
    {
      "description": "Winfrith Newburgh",
      "objectID": "6c814cd6b82dba041eeb0bfb7a346691",
      "ref": "winfrith-newburgh-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a118e13def0e80a0123289d25511f18f.gpx",
  "_geoloc": {
    "lat": 50.6126362886,
    "lng": -2.0813146215
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Footpath_to_Swyre_Head_-_geograph.org.uk_-_160988.jpg",
      "title": "John Lamper / Bridleway to Swyre Head, via Wikimedia Commons",
      "caption": "Footpath to Swyre Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/View_west_from_Swyre_Head_-_geograph.org.uk_-_31348.jpg",
      "title": "Bob Ford / View west from Swyre Head, via Wikimedia Commons",
      "caption": "View west from Swyre Head. Swalland farm on the left, Smedmore House on the right and Kimmeridge Bay in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/View_west_from_Swyre_Head_-_geograph.org.uk_-_222323.jpg",
      "title": "Jim Champion / View west from Swyre Head",
      "caption": "View west from the Head. The chalk headland is called Bat's Head, and the small natural arch below it is called Bat's Hole. The stack in the bottom left is Butter Rock. On the horizon to the left is the northern end of the Isle of Portland, across Weymouth Bay. For some reason there are two Swyre Heads on this part of the Dorset coastline, the other is in gridsquare SY9378. [Note: much of the east Dorset coastline has been rebranded as the \"Jurassic Coast\" even though much of it, like this portion, is Cretaceous rather than Jurassic.]"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Rope_Lake_Head_path_reaching_Swyre_Head_-_geograph.org.uk_-_769178.jpg",
      "title": "Jim Champion / Rope Lake Head path reaching Swyre Head",
      "caption": "Rope Lake Head path reaching the Head. The stile in the foreground marks the end of the permissive path across the Smedmore Estate from the coast path at Rope Lake Head. Beyond is the modified bowl barrow on the highest part of the Head - originally a bronze age bowl barrow, it is thought to have been modified to act as a windmill mound. The top of the mound, at 208 metres above sea level, is the highest point in the Isle of Purbeck and has magnificent all-round views. It's prominence qualifies it as a \"Marilyn\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/View_west_from_Swyre_Head_-_geograph.org.uk_-_769184.jpg",
      "title": "Jim Champion / View west from Swyre Head",
      "caption": "View west from the Head. In the foreground is the top of the large bowl barrow on the Head, whose top was probably flattened off when it was modified to create a windmill mound. In the valley below is the Smedmore Estate. From this viewpoint Kimmeridge Bay looks like a bite out of the coastline. Gad Cliff and Bindon Hill are almost lost in the haze."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Modified_bowl_barrow_at_Swyre_Head_-_geograph.org.uk_-_769191.jpg",
      "title": "Jim Champion / Modified bowl barrow at Swyre Head",
      "caption": "Modified bowl barrow. The gorse-covered mound was originally a bronze-age bowl barrow, its surrounding ditch now buried. It is about 25 metres in diameter, up to 2.5 metres high, with steep sides and a flat top. This shape, including the north and south causeways leading up to the mound, indicate that it was probably modified to be used as a windmill mound."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Fences_and_gates_below_Swyre_Head_-_geograph.org.uk_-_1634079.jpg",
      "title": "Phil Champion / Fences and gates below Swyre Head",
      "caption": "Fences and gates below the hill. It seems common practice in this area to make fences from multiple strands of barbed wire, even where there fields are sown with arable crops rather than grazed by animals."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Paragliding_off_Swyre_Head_-_geograph.org.uk_-_899794.jpg/512px-Paragliding_off_Swyre_Head_-_geograph.org.uk_-_899794.jpg",
      "title": "Jim Champion / Paragliding off Swyre Head",
      "caption": "Paragliding off Swyre Head. This paraglider had launched from Smedmore Hill (off to the right) and was moving back and forth along the western side of the Head. I presume this is a good spot for such an activity - the long ridge drops steeply on its south-west side and is exposed to the prevailing south-westerly winds."
    }
  ],
  "distance_km": 2.5,
  "description": "Visit the highest point of the Purbeck Hills on this coastal walk in Dorset. On a clear day the views are simply breathtaking in all directions. There is a car park at the end of West Street about a mile south west of the village of Kingston. This short route to the summit starts from here but you could also start from the village if you prefer. If you're coming by public transport then starting from Corfe Castle is a good option. All these start points make use of a section of the The Hardy Way to take you to the hill summit. It's a great spot standing at an elevation of 208 m (682 ft) and commanding views as far as Dartmoor and the Isle of Portland near Weymouth. The Isle of Wight, Lulworth Cove, Poole Harbour and much of the Purbeck Hills are also visible on a clear day. If you feel like extending your walk you can continue along the Hardy Way to Kimmeridge Bay where there are rock pools with a variety of marine wildlife. Here there is also a nice circular walk to Chapmans Pool to try. The little village of Kingston is also worth visiting with its Victorian Grade I listed church and 18th century village pub. Beyond that the trail heads to Corfe Common and Corfe Castle.",
  "video_url": "https://www.youtube.com/embed/GCKHtN0WCd8",
  "county": "Dorset",
  "region": "South West",
  "country": "England"
}