{
  "created_at": "2025-01-06T04:02:46.032489+00:00",
  "objectID": "a12a6aacdb82837f703a8ec2f43f3c28",
  "ref": "woodhouse-eaves-walking-route",
  "title": "Woodhouse Eaves Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Woodhouse_Eaves%2C_Leicestershire_-_geograph.org.uk_-_410017.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a12a6aacdb82837f703a8ec2f43f3c28.gpx",
  "_geoloc": {
    "lat": 52.7230374659,
    "lng": -1.2150942975
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Woodhouse_Eaves%2C_Leicestershire_-_geograph.org.uk_-_410017.jpg",
      "title": "Mat Fascione / Woodhouse Eaves, Leicestershire",
      "caption": "Woodhouse Eaves, Leicestershire. Looking along Main Street towards St. Paul's Church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/St._Paul%27s_Church%2C_Woodhouse_Eaves_-_geograph.org.uk_-_410023.jpg",
      "title": "Mat Fascione / St. Paul's Church, Woodhouse Eaves",
      "caption": "St. Paul's Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Swithland_Reservoir_-_geograph.org.uk_-_2151189.jpg",
      "title": "Swithland Reservoir by Ashley Dace, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Swithland Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Stream_in_Swithland_Wood_-_geograph.org.uk_-_1471647.jpg",
      "title": "Trevor Rickard / Stream in Swithland Wood",
      "caption": "Stream in Swithland Wood. View west along the stream, which at this point is walled-in, possibly part of the extensive slate quarrying work which once took place here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Cropston_Reservoir_dam_-_geograph.org.uk_-_1476251.jpg",
      "title": "Trevor Rickard / Cropston Reservoir dam",
      "caption": "Cropston Reservoir dam. The reservoir dam also carries Reservoir Road. Looking along the wall and dam face to the spillway from the small lay-by at the entrance to the water tower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Bradgate_Park_-_geograph.org.uk_-_1472586.jpg",
      "title": "Trevor Rickard / Bradgate Park",
      "caption": "Bradgate Park. Extensive view south-west from the war memorial across the 850-acre park with the city of Leicester in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/The_Old_Man_of_Beacon_Hill_-_geograph.org.uk_-_2086579.jpg/512px-The_Old_Man_of_Beacon_Hill_-_geograph.org.uk_-_2086579.jpg",
      "title": "The Old Man of Beacon Hill by Roy William Shakespeare, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Old Man of Beacon Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Woodland_in_Beacon_Hill_Country_Park_-_geograph.org.uk_-_409996.jpg",
      "title": "Mat Fascione / Woodland in Beacon Hill Country Park",
      "caption": "Woodland in Beacon Hill Country Park. This is the footpath that links the Upper and Lower car parks of Beacon Hill, just north west of the village."
    }
  ],
  "distance_km": 13.7,
  "description": "This attractive Leicestershire village has several local country parks and two nearby reservoirs for walkers to explore. This circular walk from the village visits some of the walking highlights of the area including Swithland Reservoir, Swithland Woods, Cropston Reservoir and Bradgate Country Park. The walk starts in the village where you can pick up the Leicestershire Round and follow the waymarked footpath east to visit Swithland Reservoir. The expansive reservoir is a pleasant place for a stroll with lots of birdlife to look out for on the water. The route then heads south to visit Swithland Wood. There's a network of woodland trails here with pretty streams and mountain bike paths as well. Just south of the woods you'll come to Cropston Reservoir where you can enjoy a waterside stroll along the northern end of the water. Here you'll also find the lovely Bradgate Park where there's 830 acres of deer park to explore. You can follow the Leicestershire Round north through the park to the viewpoint at Old John Tower before continuing past Maplewell Farm to return to the village. You can extend the walk by heading a short distance north east of the village to visit Beacon Hill Country Park .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village The Wheatsheaf is a good choice for some post walk refreshment. The 18th century inn serves fine food which you can enjoy in the cosy interior or outside in the extensive courtyard garden. You can find them at Brand Hill with postcode LE12 8SS."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk. The Wheatsheaf mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the western side of the village there's Broombriggs Farm & Windmill Hill Country Park to visit. There's some more nice trails here with dry stone walls, hedgerows, fences and woodlands to explore. Just to the south of Bradgate Park you'll find the secluded Groby Pool. The small lake is a good place for wildlife watching and also includes some adjacent bluebell woods. The woodland trust's Martinshaw Wood is located about half a mile south west from here too. It's another peaceful local place for bird watching and easy trails. Just to the east is Mountsorrel where there's some interesting old quarries and a lovely riverside pub next to Mountsorrel Lock on the Soar. You can also visit Rothley in this area. The attractive village is one of the most affluent areas of the county. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2Uf0_BTdtGQ",
  "district": "Charnwood",
  "county": "Leicestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Meadow Road, Woodhouse, Woodhouse Eaves, Charnwood, Leicestershire, England, LE12 8SZ, United Kingdom",
  "postcode": "LE12 8SZ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "reservoir",
    "park"
  ],
  "points_of_interest": [
    "viewpoint",
    "country park",
    "deer park"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}