{
  "objectID": "a261e8dafe1e92910b2b4681e7a878ed",
  "created_at": "2024-12-18T07:47:19.335416+00:00",
  "ref": "circular-walk-around-ludlow-walking-route",
  "title": "Circular Walk around Ludlow Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/83/Ludlow_town_centre_-_geograph.org.uk_-_970390.jpg",
  "nearby": [
    {
      "description": "Mortimer Forest",
      "objectID": "ef25519c120b48f0ae568419101be6d8",
      "ref": "mortimer-forest-walking-route"
    },
    {
      "description": "Shropshire Way",
      "objectID": "1b9df3ce4782005d5d9dee4e5a37b1f7",
      "ref": "shropshire-way-walking-route"
    },
    {
      "description": "Mortimer Trail",
      "objectID": "a8d33ee7bcc070e783c5bb74104305b5",
      "ref": "mortimer-trail-walking-route"
    },
    {
      "description": "High Vinnalls",
      "objectID": "6761ab0dbcad94b52124bf405b5eee70",
      "ref": "high-vinnalls-walking-route"
    },
    {
      "description": "Croft Ambrey",
      "objectID": "10a4143c55eb216d2abfe79474c9c728",
      "ref": "croft-ambrey-walking-route"
    },
    {
      "description": "Shobdon",
      "objectID": "eddff1b347c80f43c31cead701ce70ae",
      "ref": "shobdon-walking-route"
    },
    {
      "description": "Leintwardine",
      "objectID": "2208a4be663d9848200764e3bfbd3d5b",
      "ref": "leintwardine-walking-route"
    },
    {
      "description": "Croft Castle",
      "objectID": "9efb50d665fb329d8cda2eaa78a09d74",
      "ref": "croft-castle-walking-route"
    },
    {
      "description": "Downton Gorge",
      "objectID": "5538b20a9d8b8e4e1287e824d0efd3bb",
      "ref": "downton-gorge-walking-route"
    },
    {
      "description": "Presteigne",
      "objectID": "aa13f0c7b3ef10a59cf7a16f00921b1e",
      "ref": "presteigne-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a261e8dafe1e92910b2b4681e7a878ed.gpx",
  "_geoloc": {
    "lat": 52.3678250233,
    "lng": -2.7236498331
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Ludlow_town_centre_-_geograph.org.uk_-_970390.jpg",
      "title": "Rob Purvis [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ludlow Town Centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/House_On_The_Horseshoe_-_geograph.org.uk_-_984858.jpg",
      "title": "Mr M Evison [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Weirs on the river"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/View_from_The_North_range_Ludlow_Castle_-_geograph.org.uk_-_1248400.jpg",
      "title": "PAUL FARMER [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View from The North range Ludlow Castle. The castle was probably founded by Walter de Lacy after the Norman conquest and was one of the first stone castles to be built in England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Enjoying_the_view_on_Whitcliffe_Common_-_geograph.org.uk_-_992184.jpg",
      "title": "Row17 [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View over the town from Whitcliffe Common. The common is owned by the Shropshire wildlife trust and located close to the castle. There's a network of footpaths with plenty of seats to rest your legs on. The riverside promenade, the Bread Walk, was created in 1850, opening up the romantic scenery of rocky cliffs, lush ferns and a waterfall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Broadgate_and_The_Wheatsheaf_Inn_Ludlow_-_geograph.org.uk_-_922935.jpg",
      "title": "Sarah Smith / Broadgate and The Wheatsheaf Inn Ludlow",
      "caption": "Broadgate and The Wheatsheaf Inn. The Wheatsheaf is a traditional inn situated next to Broadgate, the only surviving gate of twelve in the town walls built between 1233 and 1304. The town walls are largely still in existence, although a section alongside the churchyard of St Lawrence's is, as of 2015, in need of repairs.  The 7 wall gates are (clockwise from the castle; postern gates in italics) Linney, Corve, Galdeford, Old, Broad, Mill and Dinham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Ludlow_-_The_Feathers_Hotel_-_geograph.org.uk_-_1998530.jpg/512px-Ludlow_-_The_Feathers_Hotel_-_geograph.org.uk_-_1998530.jpg",
      "title": "Ludlow - The Feathers Hotel by Peter Whatley, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Feathers Hotel. This striking timber framed building is one of the most photographed sites in the town. Its imposing half-timbered frontage was constructed in 1619, over an earlier core, for a local lawyer, Rees Jones. It has been described as a \"prodigy\" of Tudor architecture and  is noted for its Jacobean furnishings. It is a Grade I listed building, listed on 15 April 1954, and is one of approximately 500 listed buildings in Ludlow, but one of its best known."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/St_Laurence%27s_Church%2C_Ludlow_-_geograph.org.uk_-_3136485.jpg",
      "title": "St Laurence's Church, Ludlow by Ian Capper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A view of the town with St Laurence's Church prominent and the Shropshire Hills in the background. The noteworthy church is a member of the Greater Churches Group and is the largest parish church in Shropshire. It was one of only 18 churches given a five-star rating in England's Thousand Greatest Churches by Simon Jenkins (1999) and is described as the \"cathedral of the Marches\". It is the 13th most popular free visitor attraction in the West Midlands, with 70,000 visitors per year. The church is another Grade I listed building in the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Ludford_Bridge_%28geograph_6565508%29.jpg/512px-Ludford_Bridge_%28geograph_6565508%29.jpg",
      "title": "Ian Capper / Ludford Bridge",
      "caption": "Ludford Bridge. Another landmark of the town this 3-arch grade I listed masonry bridge crosses the Teme immediately north of the village of Ludford. Built in the 15th century, replacing an earlier bridge, it was restored in 1886 (following a serious flood) and has 20th-century modifications on the north (Ludlow) end. Several weirs have been built on the Teme, including the Horseshoe Weir immediately downstream (east) of Ludford Bridge. The disused Ludford Mill (for milling corn) used the water gradient of this weir. The bridge continues to be an important crossing point over the river, linking the centre of Ludlow with Ludford and places to the south and southwest of the town, including the town's livestock market."
    }
  ],
  "distance_km": 2.5,
  "description": "Visit Ludlow Castle, Whitcliffe Common and the River Teme on this walk around one of England's most attractive towns. The walk starts at the imposing Ludlow Castle, just a short distance from the train station. The ruined medieval fortification was one of the first stone castles to be built in England, dating from the 11th century. You can follow public footpaths around the castle or pay for admission to the inner grounds. The paths will take you to Dinham Bridge where you can cross the River Teme and turn left into Whitcliffe Common. The common is a lovely place for a stroll with a number of waymarked trails to try. The footpaths will take you through woodland, along the river and up to a splendid viewpoint where a toposcope shows the Shropshire Hills you can see. It's a great spot and well worth the short climb. After exploring the common cross the bridge at the eastern end and follow Broad Street North through the town. There's some wonderful medieval and Tudor-style half-timbered architecture to admire including Castle Lodge. The 13th century period house is famous for being the residence of Catherine of Aragon whilst she was married to Prince Arthur. There's also the parish church, St Laurence's, the largest in the county of Shropshire. It's another popular visitor attraction with more fine architecture and a fascinating history. Two very fine long distance trails pass through the town so it's easy to extend your walking in the area. You could follow the Shropshire Way north and head through the countryside to Stanton Lacy with views of the River Corve on the way. The Mortimer Trail will take you south west through Mortimer Forest where you can climb to High Vinnalls and enjoy panoramic views over the Herefordshire countryside. From the car park here there's also Bringewood to explore. Here you can access a number of decent red and black mountain bike trails which have been used for the National Championships.",
  "video_url": "https://www.youtube.com/embed/hIrDkrl_u5I",
  "district": "Ludlow",
  "county": "Shropshire",
  "region": "West Midlands",
  "country": "England"
}