{
  "created_at": "2025-01-06T02:36:13.036734+00:00",
  "objectID": "a263b557257bb536f72281dfb41f9c64",
  "ref": "gorple-reservoir-walking-route",
  "title": "Gorple Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/96/Gorple_Lower_Reservoir_-_geograph.org.uk_-_271082.jpg",
  "nearby": [
    {
      "description": "Walshaw Dean Reservoir",
      "objectID": "2fea365ef857d0a1cffe31d46741d491",
      "ref": "walshaw-dean-reservoir-walking-route"
    },
    {
      "description": "Widdop Reservoir",
      "objectID": "cd1d1b31eda8ca3729e67a21e39b593d",
      "ref": "widdop-reservoir-walking-route"
    },
    {
      "description": "Burnley Way",
      "objectID": "4d326545601af6124f118d3ce464c3ad",
      "ref": "burnley-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a263b557257bb536f72281dfb41f9c64.gpx",
  "_geoloc": {
    "lat": 53.787333828,
    "lng": -2.0822675302
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Gorple_Lower_Reservoir_-_geograph.org.uk_-_271082.jpg",
      "title": "Phil Champion / Gorple Lower Reservoir",
      "caption": "Gorple Lower Reservoir. Photo taken from the south end of the dam following a hot dry spell during 2005"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Gorple_Upper_Reservoir_-_geograph.org.uk_-_1156656.jpg",
      "title": "Kevin Rushton / Gorple Upper Reservoir",
      "caption": "Gorple Upper Reservoir. View towards Wicken Clough Gorple Upper Reservoir was completed in 1934 and has a capacity of 1731 tcm / 380.8 million gallons. The dam is 26m / 85.3ft high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Gorple_Lower_Reservoir_-_geograph.org.uk_-_27017.jpg",
      "title": "John Illingworth / Gorple Lower Reservoir",
      "caption": "Lower Reservoir. The Pennine Bridleway goes along the dam"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Reaps_Water_below_Gorple_Upper_Reservoir_-_geograph.org.uk_-_437815.jpg",
      "title": "Phil Champion / Reaps Water below Gorple Upper Reservoir",
      "caption": "Reaps Water below Gorple Upper Reservoir. This clough lies between the Upper and Lower reservoirs. The dam of Gorple Upper Reservoir can be seen to the top right.The reservoirs were constructed between 1927 and 1934. The piles of stone in the centre seem to be the bases of piers which would have carried a bridge over the clough during construction. The remains of several other piers are found just out of sight to bottom left. I presume this would have been a trestle bridge to carry a tramway, perhaps something similar to that at Blake Dean 270422, used in the constructed of the Walshaw Dean reservoirs a few years previously, albeit on a much smaller scale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Gorple_Cottages_-_geograph.org.uk_-_99803.jpg",
      "title": "Phil Champion / Gorple Cottages",
      "caption": "Gorple Cottages. These 1930s houses stand isolated below Gorple Lower Reservoir. On a Monday morning in November 1965 Mr Robert Akrigg, the 55-year-old reservoir keeper, left his home at Gorple Cottages to check water gauges on the reservoir gathering grounds in treacherous weather, and failed to return. After 69 days the snows receded to reveal the body of Mr Akrigg who had lost his life to the sudden and ferocious elements of the wild moors. This tragedy led to the foundation of the Calder Valley Search and Rescue team."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Gorple_Lower_Reservoir_dam_-_geograph.org.uk_-_99780.jpg",
      "title": "Phil Champion / Gorple Lower Reservoir dam",
      "caption": "Gorple Lower Reservoir dam. The side channel spillway in the foreground is used when the reservoir is full to safely divert floodwater around the dam. Gorple Lower Reservoir was completed in 1934 and has a capacity of 1261 tcm / 227.42 million gallons. The Pennine Bridleway passes over the dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Confluence_of_Graining_Water_and_Reaps_Water_-_geograph.org.uk_-_99838.jpg",
      "title": "Phil Champion / Confluence of Graining Water & Reaps Water",
      "caption": "Confluence of Graining Water & Reaps Water. View looking west. The Pennine way descends from Gorple Cottages 99803 via a causey and continues north along Graining Water, exiting bottom right. Graining Water runs left to right. The dam of Gorple Lower Reservoir can be seen towards the top right of the photo"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Clough_below_Gorple_Upper_Reservoir_dam_-_geograph.org.uk_-_99747.jpg",
      "title": "Phil Champion / Clough below Gorple Upper Reservoir dam",
      "caption": "Clough below Upper Reservoir dam. Reaps Water joins Lower Reservoir about 1km below the dam"
    }
  ],
  "distance_km": 8.0,
  "description": "Visit the Gorple Reservoirs on this walk in Calderdale. There's some splendid moorland scenery, waterside sections along the reservoirs and a short climb with far ranging views to enjoy. You start the walk from the Clough Foot car park and follow the Pennine Bridleway to Gorple Lower Reservoir. Footpaths then take you along the reservoir to Gorple Upper Reservoir. You can then climb to Gorple Gate across Shuttleworth Moor for great views over the reservoirs. From Gorple Gate you can descend to Widdop Reservoir but this route descends across Black Moor to Gorple Upper Reservoir before returning to the car park on the same tracks. If you would like to continue your walk you could head to the nearby Hardcastle Crags where you will find a beautiful woodland valley with streams and waterfalls. The Walshaw Dean Reservoir walk also starts from the same location.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Pack Horse Inn is located a very short distance east of the reservoir. This interesting historic pub is located in a very remote position and dates from the 17th century. Inside there's a cosy bar with fires, window seats cut into the partly panelled stripped-stone walls (from where you can take in the beautiful views), sturdy furnishings and some horse related mementoes. There are also seats outside in the cobblestoned beer garden which has attractive hanging baskets. They have a good selection of ales, a decent menu and are also dog friendly. You can find the pub on the Widdop Road just a stone's throw from the eastern end of the water. Postcode for sat navs is HX7 7AT."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you follow the Burnley Way or Pennine Bridleway west you could visit Cant Clough Reservoir and Hurstwood Reservoir near Burnley. There's some more nice waterside footpaths to try here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KT8FPaG4LTM",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Slack Road, Wadsworth, Calderdale, West Yorkshire, England, HX7 7AU, United Kingdom",
  "postcode": "HX7 7AU",
  "district": "Calderdale",
  "county": null,
  "state": "England"
}