{
  "objectID": "a28ca810a460cb6016f12728d27469e7",
  "created_at": "2024-12-18T09:58:38.148686+00:00",
  "ref": "egham-walking-route",
  "title": "Walks in Egham - Egham to Runnymede Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/High_Street%2C_Egham_-_geograph.org.uk_-_1499881.jpg/256px-High_Street%2C_Egham_-_geograph.org.uk_-_1499881.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a28ca810a460cb6016f12728d27469e7.gpx",
  "_geoloc": {
    "lat": 51.4291461709,
    "lng": -0.5472892562
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/High_Street%2C_Egham_-_geograph.org.uk_-_1499881.jpg/256px-High_Street%2C_Egham_-_geograph.org.uk_-_1499881.jpg",
      "title": "Colin Smith / High Street, Egham",
      "caption": "Curving High Street in the historic town of Egham. The main through road now by-passes the High Street, leaving it a quieter place for shoppers and visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Strode%27s_College%2C_Egham_-_geograph.org.uk_-_1501614.jpg",
      "title": "Colin Smith / Strode's College, Egham",
      "caption": "Strode's College, the publicly funded college for the region was founded and endowed 300 years ago at the west end of Egham High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Egham_Parish_Church_Tower_-_geograph.org.uk_-_1501629.jpg/256px-Egham_Parish_Church_Tower_-_geograph.org.uk_-_1501629.jpg",
      "title": "Colin Smith / Egham Parish Church Tower",
      "caption": "Egham Parish Church Tower. St John's Church is a landmark at the east end of the High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Memorial_Pillars%2C_Runnymede-geograph-4083020.jpg",
      "title": "David Dixon / Memorial Pillars, Runnymede",
      "caption": "Memorial Pillars, Runnymede. The two pillars and the lodges either side of Windsor Road were designed by Sir Edwin Lutyens after the death of Urban Broughton in 1929. The lodge on the left is used as a National Trust visitor centre and café."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Kingjohn-Egham-DavidParfitt.JPG",
      "title": "File, photograph and sculpture: created by David Parfitt - the copyright holder in all three cases., CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Sculpture portraying King John and Baron Fitzwalter in the act of sealing the Magna Carta. Located in Egham town centre, Surrey, UK. Height approx 4 metres. constructed from Bath stone, brick, and Norwegian granite. The other side of the statue features the work of other people listed on a plaque on the statue. These people were members of a community group that undertook a group project of carved blocks with designs depicting scenes and items that the community associated with the History of the area since King John's era. The project was supervised by the sculptor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Magna_Carta_Memorial%2C_Runnymede_-_geograph.org.uk_-_2662046.jpg",
      "title": "Eirian Evans / Magna Carta Memorial at Runnymede",
      "caption": "Magna Carta Memorial, Runnymede. The memorial was erected in 1957 by the American Bar Association. It was designed by Sir Edward Maufe, reflecting the role that the Magna Carta has had on the American Bill of Rights and Constitution."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/River_Thames_past_Magna_Carta_Island_-_geograph.org.uk_-_948634.jpg",
      "title": "Graham Horn / River Thames past Magna Carta Island",
      "caption": "River Thames past Magna Carta Island"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Park_at_Runnymede_-_geograph.org.uk_-_948668.jpg",
      "title": "Graham Horn / Park at Runnymede",
      "caption": "Park at Runnymede. Between the road and the river is this park, which is always popular with visitors."
    }
  ],
  "distance_km": 5.5,
  "description": "This pleasant university town in Surrey is a nice place to explore on foot. The Thames River is nearby as is one of the most significant historic places in the country. This circular walk takes you from the town to one of the highlights of the area at Runnymede before heading to the  Thames for a waterside stroll. The walk starts from Egham train station and heads north through the town to Runnymede Park. Here you can learn about the history of the Magna Carte which was agreed by King John at Runnymede on the 15th June 1215. It promised the protection of church rights, protection for the barons from illegal imprisonment, access to swift justice, and limitations on feudal payments to the Crown. You can then pick up a section of the Thames Path National Trail and visit the Runnymede riverside park near the town. There's a cafe, picnic area and bandstand in this area.",
  "video_url": "https://www.youtube.com/embed/Qrsw3uoiOHM",
  "postcode": "TW20 9FA",
  "district": "Egham",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}