{
  "created_at": "2025-01-06T07:51:46.566926+00:00",
  "objectID": "a2c284ee7d0c7df005693dd6c4c3851d",
  "ref": "thirsk-walking-route",
  "title": "Thirsk Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/83/Thirsk_Marketplace_-_geograph.org.uk_-_496319.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a2c284ee7d0c7df005693dd6c4c3851d.gpx",
  "_geoloc": {
    "lat": 54.2339629296,
    "lng": -1.3423928604
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Thirsk_Marketplace_-_geograph.org.uk_-_496319.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Thirsk Marketplace. The A170 road runs through here. The town is built around the medieval market square, which still hosts an open-air market each Monday and Saturday. The market was established in 1145 and is the focal point for local farmers, traders and visitors"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/2013_Thirsk_Kirkgate_South.jpg/512px-2013_Thirsk_Kirkgate_South.jpg",
      "title": "By Kreuzschnabel (Own work) [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0), GFDL (http://www.gnu.org/copyleft/fdl.html) or FAL], via Wikimedia Commons",
      "caption": "South end of Kirkgate, (as seen from \"The World of James Herriot\")"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Poppies_at_Kilvington_-_geograph.org.uk_-_54144.jpg",
      "title": "Heather Holdridge [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Poppies at Kilvington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Underwood_Plantation_-_geograph.org.uk_-_396371.jpg",
      "title": "Gordon Hatton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Underwood Plantation. A bridleway along the side of mature woodland near South Kilvington."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Small_park_by_the_river_in_Thirsk_-_geograph.org.uk_-_1985618.jpg/512px-Small_park_by_the_river_in_Thirsk_-_geograph.org.uk_-_1985618.jpg",
      "title": "Small park by the river in Thirsk by Andrew Hill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Small park by the river in Thirsk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Cod_Beck_Weir%2C_Thirsk_-_geograph.org.uk_-_1718027.jpg/512px-Cod_Beck_Weir%2C_Thirsk_-_geograph.org.uk_-_1718027.jpg",
      "title": "David Rogers / Cod Beck Weir, Thirsk",
      "caption": "Cod Beck Weir to the north of the village. Known locally as the waterfall, this weir and the nearby sluice gate are all that remain of the original extensive workings for Thirsk Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Ye_Olde_Three_Tuns%2C_Finkle_Street_-_geograph.org.uk_-_2590850.jpg",
      "title": "Ye Olde Three Tuns, Finkle Street by Stephen Armstrong, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ye Olde Three Tuns, Finkle Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Thirsk_Parish_Church_-_geograph.org.uk_-_1586603.jpg",
      "title": "Alan Murray-Rust / Thirsk Parish Church",
      "caption": "Thirsk Parish Church. A broadside view of this impressive parish church, from Kirkgate. It is relatively unusual in that it is in a single architectural style, having been built between 1420 and 1480. The church is Grade I listed."
    }
  ],
  "distance_km": 7.0,
  "description": "Enjoy a pleasant riverside stroll through this small market town, on this circular walk. Thirsk is an attractive town with a large medieval market square and some interesting Georgian architecture. The rushing waters of the Cod Beck River and fine views towards the Hambleton Hills and Yorkshire Dales make it a very popular place for a walk. The walk starts in the centre of town and picks up footpaths along the Cod Beck river. You follow the river north to the village of South Kilvington before turning west towards the woodland of the Underwood Plantation. You then turn south to head through the countryside to New Thirsk, before returning to the town centre. You can then head south towards Sowerby Flats and explore the delightful Georgian village street of Sowerby. The town was the home of the authour James Herriot. You can explore the villages and countryside associated with his work on the Herriot Way long distance trail. There's also a musuem at Skeldale House in the Kirkgate of Thirsk. It was the surgery of local vet James Wight, better known by his pen name, James Herriot. The museum tells the history of veterinary science and is one of the most popular attractions in the town. Thirsk is only a few miles east of the North York Moors National Park. Here you can enjoy a waterside walk around the nearby Gormire Lake or visit the fascinating 12th century ruins of Byland Abbey. You could also visit Sutton Bank and the Kilburn White Horse which are also close by. Sutton Bank is a high point in the Hambleton Hills and commands splendid views over the North York Moors, the Vale of York and the Vale of Mowbray. The Cleveland Way long distance trail also runs through the eastern section of the park and is another good option for extending your walking in the Thirsk area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": ""
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and country trails make for a fine dog walk. The Little 3 pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For enthusiasts of the Herriot books pay a visit The World of James Herriot. This award winning attraction is housed in a 1940s period house with veterinary science exhibits. It was the original practice of James Herriot, at 23 Kirkgate, known as \"Skeldale House\" in the books. The museum includes a recreation of the original living quarters and sets from the All Creatures Great and Small television series. This ran on the BBC during the 1970s and starred Christopher Timothy as the famous vet.  Pictured above, The World of James Herriot. Probably the most famous property in Thirsk, number 23 Kirkgate was the former veterinary practice of D.V Sinclair and J.A Wight, otherwise known as 'Farnon and Herriot'. This was the very centre of 'Herriot Country' until the death of Alf Wight in 1995. The house reopened as a museum in 1999 and is owned by Hambleton District Council. The veterinary practice continues in modern buildings on the industrial estate on York Road. On the right is one of the TV show's sets."
    }
  ],
  "video_url": "https://www.youtube.com/embed/vJNr4Uadc3Q",
  "postcode": "YO7 1UN",
  "district": "Thirsk",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ash Park Child Care, Marage Road, New Thirsk, Norby, Thirsk, North Yorkshire, York and North Yorkshire, England, YO7 1UN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland",
    "countryside"
  ],
  "points_of_interest": [
    "historical site",
    "village",
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "museum",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}