{
  "created_at": "2025-01-06T00:25:23.824685+00:00",
  "objectID": "a2d58bd9826e0215d56b2b4976926319",
  "ref": "bedgebury-forest-walking-and-cycle-route",
  "title": "Bedgebury Forest Walks and Mtb",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/88/Bedgebury_Pinetum_-_geograph.org.uk_-_796135.jpg",
  "nearby": [
    {
      "description": "Bewl Water",
      "objectID": "e016f27e7e61d59b93cae067b96b5347",
      "ref": "bewl-water-walking-and-cycle-route"
    },
    {
      "description": "Tunbridge Wells to Ashford",
      "objectID": "0d8559fdfefb4ef73e06473ec2f16906",
      "ref": "tunbridge-wells-to-ashford-cycle-route"
    },
    {
      "description": "Sissinghurst Castle",
      "objectID": "658f8790c646d28d413c2f654f1d6050",
      "ref": "sissinghurt-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a2d58bd9826e0215d56b2b4976926319.gpx",
  "_geoloc": {
    "lat": 51.0817195083,
    "lng": 0.447414041
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Bedgebury_Pinetum_-_geograph.org.uk_-_796135.jpg",
      "title": "Colin Smith / Bedgebury Pinetum",
      "caption": "Bedgebury Pinetum. Bluebells blooming beside the \"Spring Walk\" path through the world's largest pinetum."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/The_Great_Lake%2C_Bedgebury_Park_-_geograph.org.uk_-_1766654.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Great Lake, Bedgebury Park. The Bell Bedgebury International School is to the right of the photo. This is part of the Bedgebury Estate, which dates back to the 9th century. The lake is a good spot for seeing waterfowl."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Bedgebury_Pinetum_-_geograph.org.uk_-_796940.jpg/256px-Bedgebury_Pinetum_-_geograph.org.uk_-_796940.jpg",
      "title": "Colin Smith / Bedgebury Pinetum",
      "caption": "Bedgebury Pinetum. Specimen conifers on the hillside south-east of Marshal's Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Track_in_Bedgebury_forest_-_geograph.org.uk_-_1595996.jpg",
      "title": "David Anstiss / Track in Bedgebury forest",
      "caption": "Track in Bedgebury forest. This track heads northwards. It is part of a red route mountain bike trail around the forest. Seen from the bridleway near Three Chimneys Bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Rhododendron_at_Bedgebury_-_geograph.org.uk_-_796928.jpg",
      "title": "Colin Smith / Rhododendron at Bedgebury",
      "caption": "Red flowering rhododendron beside a pond in the Pinetum. In the distance, left, is the edge of the Leyland Cypress hedge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Forest_Trail%2C_Bedgebury_-_geograph.org.uk_-_796994.jpg",
      "title": "Colin Smith / Forest Trail, Bedgebury",
      "caption": "Waymarker post for the family cycle trail. A dense network of signposted trails exists in the Forest with many open to cyclists. Some, like the one pictured, are on nice easy surfaced paths suitable for families or anyone looking for an easy ride."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/View_towards_Bedgebury_Park_-_geograph.org.uk_-_1157693.jpg",
      "title": "Oast House Archive / View towards Bedgebury Park",
      "caption": "View towards Bedgebury Park over the fields. Formerly used as a school this impressive building is Grade II* listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Hillside_in_Bedgebury_Pinetum_-_geograph.org.uk_-_796954.jpg",
      "title": "Colin Smith / Hillside in Bedgebury Pinetum",
      "caption": "Hillside in the Pinetum. Flowering broom in the foreground, bluebells on the grassy slope in middleground, specimen conifers can be seen in the background."
    }
  ],
  "distance_km": 10.0,
  "description": "Bedgebury is a great place for cyclists with miles of family cycle tracks and a more challenging mountain bike trail. The gentle 10km trail is perfect for exploring the 2000 acre forest at a leisurely pace on generally flat surfaced paths. Adrenalin junkies can enjoy 13km of single-track mountain biking. It's generally graded as a red trail and has fast sweeping gradual descents and some challenging climbs. There's also cycle shop where you can hire a bike. The forest is also great for walkers with miles of peaceful woodland trails to follow. You can enjoy a stroll around the beautiful Bedgebury Pinetum. This recreational and conservational arboretum has 10,000 trees growing across 320 acres including the most complete collection of conifers on one site in the world. If you would like to extend your exercise then you can head to the nearby Bewl Water and enjoy a splendid 12.5 mile cycling and walking trail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just a couple of miles west of the forest you will The Boat House Bistro at the northern end of Bewl Water. It's a great place to relax after your exercise and enjoy some freshly caught trout from the reservoir. You can enjoy wonderful views over the lake from the restaurant or the outdoor Terrace too. You will find the Boat House near the car park at the northern end of the reservoir at postcode TN3 8JH.In the nearby village of Wadhurst you could try The Old Vine Inn on Cousley Wood Rd (Postcode:TN5 6ER). The 16th century pub now includes a fine South American restaurant. If you head into nearby Cranbrook then Larkin's Alehouse is well worthy of some consideration. This excellent micropub has a fine range of ales and ciders to sample. It's a friendly, award winning place with a lovely garden to sit out in. You can find them on the High Street at postcode TN17 3EB."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As you'd expect the wide forest trails are ideal for dog walking. You're bound to bump into plenty of other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The forest is located just a few miles south west of the worthy town of Cranbrook. The town is well worth exploring with a number of fine medieval buildings, a noteworthy church known as the 'Cathedral of the Weald' and a very photogenic working windmill to see. There's also an excellent, award winning micropub on the High Street to try. The Cranbrook Walk explores the town before heading to the nearby Sissinghurst Castle. The National Trust run castle is another major highlight of the area with its parkland, gardens and interesting history. To the south west you can visit the worthy village of Burwash. Our circular walk from the village visits on of the area's highlights at the National Trust's Bateman's. The fine 17th century Jacobean house was the home of author Rudyard Kipling during the early part of the 20th century. You can explore the house and the surrounding gardens with some great views of the surrounding High Weald countryside. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PnXL5Cpi7lk?si=f_TPhqQLrzVw0DBB",
  "postcode": "TN17 2SL",
  "district": "Tunbridge Wells",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Park Lane, Priors Heath, Goudhurst, Kilndown, Tunbridge Wells, Kent, England, TN17 2SL, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "cycle shop",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}