{
  "objectID": "a2ec85079a74bd0da7408f6741e7443b",
  "created_at": "2024-12-18T11:37:30.597535+00:00",
  "ref": "ham-hill-country-park-walking-and-cycle-route",
  "title": "Ham Hill Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/93/Ham_Hill_-_geograph.org.uk_-_762458.jpg",
  "nearby": [
    {
      "description": "Leland Trail",
      "objectID": "69f155d0de56fd039f2b3816d30fa952",
      "ref": "leland-trail-walking-route"
    },
    {
      "description": "Montacute House",
      "objectID": "5d68e3049a5f02b64677a91237e66d22",
      "ref": "montacute-house-walking-route"
    },
    {
      "description": "Yeovil Country Park",
      "objectID": "599d95f4b0c4cd930ea7cb634b9375e2",
      "ref": "yeovil-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/049E3D83E10B549B80257BFA00450829/$FILE/Ham Hill Country Park.gpx",
  "_geoloc": {
    "lat": 50.9498419483,
    "lng": -2.745246888
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Ham_Hill_-_geograph.org.uk_-_762458.jpg",
      "title": "Andrew Smith / Ham Hill, via Wikimedia Commons",
      "caption": "On Ham Hill. Part of the scarp that run across the Wiltshire/Berkshire/Hampshire border district. Here we are just inside Wiltshire with the copse located on the boundary with Berkshire. The snow didn't offer much of a match to the April sunshine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Ham_Hill_-_geograph.org.uk_-_1014717.jpg",
      "title": "Andrew Smith / Ham Hill, via Wikimedia Commons",
      "caption": "Countryside view from a high point on the hill. The line slanting down the hillside from centre left is the public bridleway. This would appear to be an old trackway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Ham_Hill_-_geograph.org.uk_-_1014692.jpg",
      "title": "Andrew Smith / Ham Hill, via Wikimedia Commons",
      "caption": "The small terraces here are a feature of may areas of steep downland and caused by grazing animals. A man-made feature can also be seen slanting down the hillside and away from the camera in mid-distance. This has the appearance of an old trackway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/War_memorial%2C_Ham_Hill_-_geograph.org.uk_-_1086527.jpg",
      "title": "Ken Grainger / War memorial, Ham Hill, via Wikimedia Commons",
      "caption": "War memorial, Ham Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/View_from_Ham_Hill_-_geograph.org.uk_-_1014712.jpg",
      "title": "Andrew Smith / View from Ham Hill, via Wikimedia Commons",
      "caption": "Wiltshire and Berkshire stretch out across the Kennet valley. The buildings are Ham Spray."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/West_from_Ham_Hill_South_-_geograph.org.uk_-_43879.jpg",
      "title": "Terry Jacombs / West from Ham Hill South, via Wikimedia Commons",
      "caption": "West from Ham Hill South. This square is nearly all south western slopes of Ham Hill and surrounding slopes. This view looks west across Cheltenham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Ham_Hill_-_geograph.org.uk_-_243602.jpg",
      "title": "Andrew Smith / Ham Hill, via Wikimedia Commons",
      "caption": "Cattle are free to graze here, but prefer the lusher grass on top of the hill, which seems to have been improved. The western end of Rivar Copse is on the skyline. The hill was formerly the site of a white horse - somewhere about here as it was just inside Wiltshire on the slope above Ham Spray House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Carvers_Hill_Farm_looking_across_to_Ham_Hill_escarpment_-_geograph.org.uk_-_1062104.jpg",
      "title": "D Gore / Carvers Hill Farm looking across to Ham Hill escarpment, via Wikimedia Commons",
      "caption": "Carvers Hill Farm looking across to Ham Hill escarpment"
    }
  ],
  "distance_km": 8.0,
  "description": "Explore the 390 acres of parkland located at this delightful country par near Yeovil in Somerset.  The Mendip Hills, Blackdown Hills, River Kennet Valley, Quantock Hills and Dorset Downs can alll be viewed from Ham Hill on a clear day. The park is centred on an Iron Age hill fort while there is also war memorial to the dead of the nearby village of Stoke-sub-Hamdon killed during the two World Wars. This circular walk starts from the car park at the western side of the park. It's located a short distance to the south east of the little village of Stoke Sub Hamdon which makes and alternative start point. The park is very popular with walkers and cyclists with many routes passing through the park. Mountain bikes are advised for the cycle routes because of the challenging nature of some of the trail sections. The Leland Trail runs past the park while the 16th century Montacute House is less than a mile east of Ham Hill. There's also Yeovil Country Park which has some nice woodland trails, lakes and waterfalls to see. These are all good options if you would like to continue your walking around the hill.",
  "video_url": "https://www.youtube.com/embed/m_rO-43aE18",
  "postcode": "TA14 6RW",
  "district": "Stoke sub Hamdon",
  "county": "Somerset",
  "region": "South West",
  "country": "England"
}