{
  "created_at": "2025-01-06T01:57:45.243833+00:00",
  "objectID": "a30c2856cce983c6c9f40becdbdf4292",
  "ref": "baslow-edge-walking-route",
  "title": "Baslow Edge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Eagle_Stone%2C_near_Baslow_Edge_-_geograph.org.uk_-_236382.jpg/256px-Eagle_Stone%2C_near_Baslow_Edge_-_geograph.org.uk_-_236382.jpg",
  "nearby": [
    {
      "description": "Chatsworth Park",
      "objectID": "1ed31211a3d8992fa0de9f13f05e12a5",
      "ref": "chatsworth-park-walking-route"
    },
    {
      "description": "Birchen Edge",
      "objectID": "9ed906d8f5bb7f38957f9d962e7d5457",
      "ref": "birchen-edge-walking-route"
    },
    {
      "description": "Curbar Edge",
      "objectID": "c5f95a020322049813219fc6bc915567",
      "ref": "curbar-edge-walking-route"
    },
    {
      "description": "Baslow",
      "objectID": "047af676015cbfb08d7d625412b4d21a",
      "ref": "baslow-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a30c2856cce983c6c9f40becdbdf4292.gpx",
  "_geoloc": {
    "lat": 53.2686577866,
    "lng": -1.6098246058
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Eagle_Stone%2C_near_Baslow_Edge_-_geograph.org.uk_-_236382.jpg/256px-Eagle_Stone%2C_near_Baslow_Edge_-_geograph.org.uk_-_236382.jpg",
      "title": "Nikki Mahadevan / Eagle Stone, near Baslow Edge",
      "caption": "Eagle Stone, near Baslow Edge. Eagle Stone is a large weathered block of gritstone standing about 8m high. It was once a test of manhood for young men (girlhood in this case!), living in nearby villages. They had to climb the rock before they could marry. Be warned, it is not as easy as the photograph suggests, as each layer overhangs the next and the young lady in the photograph had some help getting to the point shown!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_start_of_Baslow_Edge_-_geograph.org.uk_-_551074.jpg",
      "title": "Roger Temple / The start of Baslow Edge",
      "caption": "The start of Baslow Edge From Curbar Gap the land rises to form Baslow Edge which continues in a southerly direction overlooking Curbar and Calver in the Derwent valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Rock_feature_on_Baslow_Edge_-_geograph.org.uk_-_579100.jpg",
      "title": "Roger Temple / Rock feature on Baslow Edge",
      "caption": "Rock feature on Baslow Edge This rock has a striking similarity to a woman's face when viewed from the right angle. The village of Curbar can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Wall_and_moors_below_Baslow_Edge_-_geograph.org.uk_-_579006.jpg",
      "title": "Roger Temple / Wall and moors below Baslow Edge",
      "caption": "Wall and moors below Baslow Edge Bracken and birch woods cover the lower slopes of Baslow Edge and this somewhat irregular wall separates the open moor from fields of grassland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Wellington%27s_Monument_-_geograph.org.uk_-_1058881.jpg",
      "title": "Dave Pickersgill / Wellington's Monument",
      "caption": "Wellington's Monument"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/View_from_Wellington%27s_Monument_-_geograph.org.uk_-_181988.jpg",
      "title": "Brian Abbott / View from Wellington's Monument",
      "caption": "View from Wellington's Monument. From Wellington's monument there's a fine view South towards Chatsworth House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Jack_Flat_below_Wellington%27s_Monument_-_geograph.org.uk_-_255748.jpg",
      "title": "Nikki Mahadevan / Jack Flat below Wellington's Monument",
      "caption": "Jack Flat below Wellington's Monument. The heavily wooded area, known as Jack Flat, is on a steep hillside below Wellington's Monument. Gardom's Edge, popular with climbers, can be seen rising above the opposite side of the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Wellington%27s_Monument_-_geograph.org.uk_-_67948.jpg/256px-Wellington%27s_Monument_-_geograph.org.uk_-_67948.jpg",
      "title": "Dave Kirk / Wellington's Monument",
      "caption": "Wellington's monument can be found on Baslow edge, standing high above the village of Baslow. It is dedicated to the Duke of Wellington and is a celebration of his victory at the battle of Waterloo in 1815. It was erected by a local army man called Dr Wrench, who felt the need to counterbalance the memorial dedicated to Admiral Nelson on nearby Birchen Edge"
    }
  ],
  "distance_km": 3.0,
  "description": "A circular walk up to Baslow Edge in the Peak District National Park. The route runs for about 2 miles with a moderate climb on the way. From the elevated position of the Edge there are fine views over the countryside to Chatsworth Park. You'll also pass some interesting gritstone rock formations and a monument to a famous figure from British history. You can start the walk from the public car park just to the east of Curbar and just north of Baslow Edge. From here you can pick up trails heading south up to the Edge. Here you'll pass the noteworthy Eagle Stone which people like to climb up for better views and a wee challenge. Also near here is Wellington's Monument. The stone cross is dedicated to the Duke of Wellington and a celebration of his victory at the battle of Waterloo. After rounding the stone and monument the route follows alternative trails back to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Baslow you could head to The Prince of Wales for some refreshments after your exercise. The friendly pub does very good food and includes a roaring fire for winter days. In warmer weather you can relax on the Terrace garden and enjoy fine views of the surrounding hills. You can find the pub on Church Lane at a postcode of DE45 1RY for your sat navs. The inn is also dog friendly if you have your pet with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of Baslow Edge you will find another great spot at Curbar Edge. It's only about half a mile north west of the car park so is a great way to extend the walk.Birchen Edge lies just over a mile to the south east and is another good option. Here you will find Nelson's Monument so it's possible to visit two sites dedicated to historical war heroes in this area. For a longer walk around the village try our Baslow Walk which visits Curbar Edge, Froggatt Edge and the River Derwent."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YrfxftryC50",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}