{
  "created_at": "2025-01-06T03:30:49.469914+00:00",
  "objectID": "a35618af4c557385eeeca7a482ca745d",
  "ref": "nether-wasdale-walking-route",
  "title": "Nether Wasdale Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/79/Nether_Wasdale_-_geograph.org.uk_-_156716.jpg",
  "nearby": [
    {
      "description": "Wast Water",
      "objectID": "8785cb66bba1e9fcda7df79ab4cad4a8",
      "ref": "wast-water-walking-and-cycle-route"
    },
    {
      "description": "Pillar from Wasdale Head",
      "objectID": "a290eb5e61fa89c9719eff9f1e3659d3",
      "ref": "pillar-from-wasdale-head-walking-route"
    },
    {
      "description": "Scafell Pike",
      "objectID": "b17cfc6012e8c4c855b5f6d62ac368bc",
      "ref": "scafell-pike-walking-route"
    },
    {
      "description": "Gosforth",
      "objectID": "8f8eae5582f081aefbce2e1248cdb6de",
      "ref": "gosforth-walking-route"
    },
    {
      "description": "Whin Rigg and Illgill Head",
      "objectID": "f17e77684f5c5b06977cf4a870e56715",
      "ref": "illgill-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a35618af4c557385eeeca7a482ca745d.gpx",
  "_geoloc": {
    "lat": 54.4242813768,
    "lng": -3.3503207862
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Nether_Wasdale_-_geograph.org.uk_-_156716.jpg",
      "title": "Peter Eckersley / Nether Wasdale",
      "caption": "Nether Wasdale. Dana the Labrador contemplates which of the two excellent pubs, The Strands on the right,or the Screes on the left is likely to have the best Sunday lunch menu"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Nether_Wasdale_-_geograph.org.uk_-_49879.jpg",
      "title": "Nigel Monckton / Nether Wasdale",
      "caption": "Taken from outside the Low Wood Hotelon the western approach to the village of Nether Wasdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Nether_Wasdale_church_%28geograph_4701027%29.jpg/512px-Nether_Wasdale_church_%28geograph_4701027%29.jpg",
      "title": "David Purchase / Nether Wasdale church",
      "caption": "Nether Wasdale church. St Michaels and All Angels Church, was built in the 16th century. The church has a maypole in front of it: now a listed structure, it was built originally to celebrate Queen Victoria's diamond jubilee"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/The_Screes%2C_seen_from_Nether_Wasdale_-_geograph.org.uk_-_359460.jpg",
      "title": "Ian Russell / The Screes, seen from Nether Wasdale",
      "caption": "The Screes, seen from Nether Wasdale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Parkland_at_Nether_Wasdale_-_geograph.org.uk_-_290408.jpg",
      "title": "Andrew Woodhall / Parkland at Nether Wasdale",
      "caption": "Parkland at Nether Wasdale. Irton Fell rising in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/The_River_Irt_-_geograph.org.uk_-_556450.jpg",
      "title": "Ian Greig / The River Irt",
      "caption": "The River Irt"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Path%2C_Wasdale_Hall_-_geograph.org.uk_-_767762.jpg",
      "title": "Callum Black / Path, Wasdale Hall",
      "caption": "Path, Wasdale Hall. A path leads past the front of Wasdale Hall Youth Hostel in the direction of Low Wood. The lake is Wast Water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Park-like_landscape_near_Nether_Wasdale%2C_looking_to_the_screes_-_geograph.org.uk_-_540498.jpg",
      "title": "Andrew Hill / Park-like landscape near Nether Wasdale, looking to the screes",
      "caption": "Park-like landscape near Nether Wasdale, looking to the screes Lovely pine trees in farm / parkland area called Flass, with the screes of Whin Rigg and Illgill Head in the background."
    }
  ],
  "distance_km": 8.0,
  "description": "This delightful Lake District village is located close to Wast Water Lake in the Wasdale Valley. There's a lovely village green, two fine old pubs and a 16th century church to see here. This circular walk from the village takes you down to Wast Water where there's some nice woodland trails along the lake. There's also fine views of the River Irt and the surrounding fells to enjoy on the way. Start the walk in the village centre and then pick up country lanes heading east towards Woodhow Tarn. Follow the paths south east from here and you'll soon come to a trail along the River Irt. Continue down to Low Wood where there's a pocket of woodland next to the southern tip of Wast Water. The route then heads along the lakeside path before turning around to pass High Birkhow and Wasdale Hall. Here you'll find a large Youth Hostel with well priced accommodation. It's set in an impressive half-timbered National Trust-owned house dating from 1829 and still retains many original features. The walk then passes along the Irt again before heading up towards Easthwaite and Kilnhow Crag. From here you head west to Cinderdale Bridge where you cross the river and return to Nether Wasdale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Strands and The Screes sit next to each other in the village. They are set in buildings with two distinct characters with a different selection of craft ales and food in each. There's also a fine garden area where you can enjoy wonderful views of the fells with your lunch. You can find them in the village at postcode CA20 1ET for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails around the village are ideal for dog walking. The village pubs mentioned above are also dog friendly and will provide treats for your four legged friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The complete circular trail around Wast Water starts from the Wasdale Head car park at the other end of the lake. The car park is also a popular start point for the climb to Scafell Pike, the highest mountain in England. The circular climb to Pillar also starts from Wasdale Head. It's a splendid walk taking you to the eighth highest point in the Lake District. On the eastern side of the water you can enjoy a climb to Whin Rigg and Illgill Head on a more challenging circular walk around Wast Water. There's some excellent views over the lake from these prominent peaks. The pretty Burnmoor Tarn can also be visited in this area. Just to the west you'll find the neighbouring village of Gosforth. It's well worth a visit with a 17th century pub, a 12th century church and an ancient Viking cross to see. The circular walk from the village explores Blengdale and the River Bleng with some pleasant riverside paths and woodland trails through Blengale Forest. For more walking ideas in the National Park see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/64ufi1SwHZo",
  "postcode": "CA20 1ET",
  "district": "Nether Wasdale",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cinderdale Bridge, Mill Place, Wasdale, Nether Wasdale, Cumberland, England, CA20 1ET, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake"
  ],
  "points_of_interest": [
    "church",
    "views"
  ],
  "facilities": [
    "pub/cafe",
    "youth hostel",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}