{
  "created_at": "2025-01-06T04:34:33.169493+00:00",
  "objectID": "a3a8935aef0f56bbed05039936fdcad4",
  "ref": "louth-canal-walking-route",
  "title": "Louth Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Louth_Canal_-_geograph.org.uk_-_1202076.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a3a8935aef0f56bbed05039936fdcad4.gpx",
  "_geoloc": {
    "lat": 53.3731631015,
    "lng": 0.0128378727
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Louth_Canal_-_geograph.org.uk_-_1202076.jpg",
      "title": "Richard Croft / Louth Canal",
      "caption": "Looking north west from Marshchapel Ings"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Footpath_by_the_Louth_Canal_-_geograph.org.uk_-_680116.jpg",
      "title": "Richard Croft / Footpath by the Louth Canal",
      "caption": "Footpath by the sluice gate on the west side of the Louth Canal from Thoresby Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Tetney_Lock_-_geograph.org.uk_-_71095.jpg",
      "title": "Richard Croft / Tetney Lock",
      "caption": "Tetney Lock near Cleethorpes. Where the Louth canal empties into Tetney Haven, a popular haunt for anglers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/The_Louth_Canal_-_geograph.org.uk_-_856046.jpg",
      "title": "Peter Church / The Louth Canal",
      "caption": "The canal as seen from the bridge at Fire Beacon Farm near Covenham Reservoir. This view looks northwest. There is a swan in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Market_Square%2C_Louth_-_geograph.org.uk_-_386017.jpg",
      "title": "John Beal / Market Square, Louth",
      "caption": "Market Square, Louth. Very much a country-style market and a very popular one seen on a busy Saturday afternoon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Westgate%2C_Louth_-_geograph.org.uk_-_386058.jpg",
      "title": "John Beal / Westgate, Louth",
      "caption": "Westgate. The commencement of Westgate and what used to be part of the A157 (now B1200) into the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Hubbards_Hills%2C_Louth_%285%29_-_geograph.org.uk_-_417216.jpg",
      "title": "John Beal / Hubbards Hills, Louth (5)",
      "caption": "Hubbards Hills. The valley has a gorge-like appearance. There is also a distinct similarity to Ravendale valley located some 10 miles NW, so both may have been formed as a result of glacial movement."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Distinctive_spire%2C_Louth_-_geograph.org.uk_-_417235.jpg",
      "title": "John Beal / Distinctive spire, Louth",
      "caption": "A more distant view of the town with the distinctive spire visible. A footpath climbs away from Hubbards Hills taking the walker westwards ultimately to Hallington, and this is the view just before the path crosses the Louth by-pass looking north east. The spire of St. James church is prominent, and in the fields cattle roam freely, although they were not grazing on the day this photograph was taken."
    }
  ],
  "distance_km": 18.0,
  "description": "Enjoy a waterside walk along the Louth Canal from Louth to Tetney Marshes. Along the way there's the lovely scenery of the Lincolnshire Wolds countryside and nice views of the River Lud. You can walk the length of the canal along the towpath which runs for about 12 miles. The walk starts from the interesting market town of Louth in the Lincolnshire Wolds. It's a very pretty town with Georgian streets including several fine buildings such as Louth Manor House and many others dating from 17th century onwards. Other highlights include St. James church where you can climb the tower for nice views over the town. You should also visit the interesting Louth Museum, the Greenwich meridian line plaque and the delightful Hubbard's Hills park. You can pick up the canal towpath on the eastern side of the town and follow it north east towards Keddington and Alvingham. On your right hand side around Keddington you can take a short detour to visit the remains of Louth Abbey which dates from 1139. At High Bridge the canal turns towards the North West, passing Conisholme Fen and Covenham Reservoir. The final sections takes you over Thoresby Bridge before passing Tetney Lock and finishing at Tetney Marshes Nature Reserve on the Humber Estuary. The RSPB reserve makes a lovely end to the walk. It's situated on the north Lincolnshire coast and includes coastal mudflats, salt marsh, dunes and saline lagoons. The reserve is a fantastic place for bird watching with brent geese, knots, golden plovers, redshanks and sanderlings to look out for. The Silver Lincs Way long distance trail also starts in Louth and runs all the way to Grimsby. You could pick this up and follow it to the delightful Hubbard's Hills with its lovely woodland trails along the River Ludd.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Wheatsheaf Inn has a nice cosy interior with roaring fires and a fine garden area for warmer days. You can find them at 62 Westgate, LN11 9YD."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The footpath makes for a fine dog walk and the Wheatsheaf mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking in the area you could try the circular Cleethorpes to Tetney Lock Walk. The walk takes you along the Tetney Marshes RSPB nature reserve to the canal lock with lots of coastal wildlife to look out for on the way. If you head a few miles north you could pick up the Wanderlust Way around the little village of Barnoldby le Beck. The 20 mile circular walk explores the Lincolnshire Wolds and includes views of the Humber Estuary. Just to the east of Covenham you could pay a visit to the Donna Nook Nature Reserve on the coast. The reserve is a great place for wildlife with the grey seal colony a particular highlight. Just head east from the canal around Covenham and you can pick up our circular walk around the wonderful reserve. Near here there's also Saltfleet and the Saltfleetby - Theddlethorpe Dunes National Nature Reserve. On the south eastern side of the town you can pick up the Louth Railway Walk at Stewton Lane. This walk follows the trackbed of the old railway line east to Grimoldby with some pleasant countryside views on the way. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BhnIBnZt_14",
  "postcode": "LN11 7AP",
  "district": "Louth",
  "county": "Lincolnshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}