{
  "created_at": "2025-01-06T00:57:31.165251+00:00",
  "objectID": "a3b5c90a2a8f538b9ddf8a5f84b81cd9",
  "ref": "st-asaph-walking-route",
  "title": "St Asaph River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Bank_of_River_Elwy_in_St_Asaph_-_geograph.org.uk_-_605340.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a3b5c90a2a8f538b9ddf8a5f84b81cd9.gpx",
  "_geoloc": {
    "lat": 53.2566013659,
    "lng": -3.4471208466
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Bank_of_River_Elwy_in_St_Asaph_-_geograph.org.uk_-_605340.jpg",
      "title": "George Tod / Bank of River Elwy in St Asaph, via Wikimedia Commons",
      "caption": "Nice footpaths along the bank of River Elwy in St Asaph. View from the road bridge looking northwards."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Pont_Begard_-_foot_and_bicycle_bridge_over_the_Elwy%2C_St_Asaph_-_geograph.org.uk_-_608398.jpg",
      "title": "Eirian Evans / Pont Begard - foot and bicycle bridge over the Elwy, St Asaph, via Wikimedia Commons",
      "caption": "Pont Begard - foot and bicycle bridge over the Elwy, St Asaph. The bridge, named Pont Begard after St. Asaph's twin town, is designed to connect east and west St. Asaph. It's certainly built to last which is wise given that, in the recent past, floodwaters have risen as high as the bicycle path that is shown on the photo. It's strong enough and wide enough to take a vehicle in an emergency."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/St_Asaph%2C_Cathedral.jpg",
      "title": "Kenneth Allen / St Asaph's Cathedral, via Wikimedia Commons",
      "caption": "St. Asaph Cathedral. Partly built using local purple sandstone, with details in yellow sandstone from Flint. It was built in the 13th Century and houses William Morgan's first Welsh translation of the bible. It is sometimes claimed to be the smallest Anglican cathedral in Great Britain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/River_Clwyd_St._Asaph_-_geograph.org.uk_-_24628_%28cropped%29.jpg",
      "title": "Dot Potter [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The River Clwyd viewed from the footbridge towards the North"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/St_Asaph_Recreation_Ground_-_geograph.org.uk_-_609105.jpg",
      "title": "Eirian Evans / St Asaph Recreation Ground, via Wikimedia Commons",
      "caption": "St Asaph Recreation Ground. Running parallel with the river Elwy, the land for the recreation ground was donated by Mr Charles Hughes, Grove House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Fountain_at_St._Asaph_Business_Park_-_geograph.org.uk_-_24983.jpg",
      "title": "Dot Potter / Fountain at St. Asaph Business Park, via Wikimedia Commons",
      "caption": "Fountain at St. Asaph Business Park. Landscaping at St.Asaph Business Park including a lake and fountain"
    }
  ],
  "distance_km": 6.0,
  "description": "Enjoy a nice waterside walk along the River Elwy on this walk in the historic North Wales city of St Asaph. The settlement is notable as the second-smallest city in Britain in terms of population and urban area. This circular walk takes you around along the river paths in the city centre, visiting St Asaph Common on the way. The walk starts on the bridge over the river, just to the east of the cathedral. The noteworthy cathedral dates back 1,400 years, while the current building dates from the 13th century. From the bridge you can pick up the riverside footpaths on both sides of the Elwy. Two long distance, waymarked walking trails run past the city. You pick up the epic Clwydian Way and follow it to the nearby town of Rhuddlan where you can visit the 13th century castle and enjoy a walk along the River Clwyd. You can also pick up the North Wales Path here and head to Rhyl or Prestatyn .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the The Talardy Hotel for some post walk refreshments. The Georgian hotel has a nice landscaped garden to sit out and relax in during the warmer months. It's located just to the north east of the city centre at postcode LL17 0HY. The Farmers Arms is another good option. It's located a little way out of town but is set in extensive grounds with ample car parking and landscaped gardens. You can find it just to the east of the city centre at postcode LL17 0DY."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GdP-_5k2FxU",
  "district": "St Asaph",
  "county": "Denbighshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "St.Asaph Crown Green Bowls Club, Stryd Fawr, Pen Rhewl, St. Asaph, St Asaph, Denbighshire, Cymru / Wales, LL17 0RG, United Kingdom",
  "postcode": "LL17 0RG",
  "state": "Cymru / Wales"
}