{
  "created_at": "2025-01-06T07:49:01.995120+00:00",
  "objectID": "a3b74c80d825006c751f31a4576fe866",
  "ref": "roseland-peninsula-walking-route",
  "title": "Roseland Peninsula Circular Walk - Porscatho - St Anthony Head Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Portscatho_-_geograph.org.uk_-_561816.jpg",
  "nearby": [
    {
      "description": "St Mawes to St Just",
      "objectID": "e4761bb898ab5171028c78c7aa70b0a9",
      "ref": "st-mawes-to-st-just-walking-route"
    },
    {
      "description": "Falmouth",
      "objectID": "e86f0c92eb400470fc995e8c7ebd394c",
      "ref": "falmouth-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Portloe",
      "objectID": "5fecdb64b070e7b9ce154eec6ee7bad5",
      "ref": "portloe-walking-route"
    },
    {
      "description": "Argal Reservoir",
      "objectID": "16a4c68d32c8dc3aa5be47db3a7bbdf8",
      "ref": "argal-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a3b74c80d825006c751f31a4576fe866.gpx",
  "_geoloc": {
    "lat": 50.1830112276,
    "lng": -4.9751098198
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Portscatho_-_geograph.org.uk_-_561816.jpg",
      "title": "Trevor Rickard / Portscatho",
      "caption": "Portscatho. Unlike most fishing villages in Cornwall, this one is spread out in a curve along the gently shelving shore. Busy in August, but still quiet out of season. The pretty little village faces east on the Roseland peninsula overlooking Gerrans Bay. There's a picturesque harbour and a nice little beach to be found here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Carricknath_Point_-_geograph.org.uk_-_565044.jpg",
      "title": "Trevor Rickard / Carricknath Point",
      "caption": "Carricknath Point. View north from the coast path across Scots Pine trees. Taken in the autumn of 2007. Carricknath Point to Porthbean Beach is a coastal Site of Special Scientific Interest (SSSI). The habitat of the first, southernmost, section consists of cliffs overhanging damp rock ledges. The area is known for its rare coastal plants."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Drake%27s_Downs_-_geograph.org.uk_-_565029.jpg",
      "title": "Trevor Rickard / Drake's Downs",
      "caption": "Drake's Downs near Zone Point. View along the coast with Falmouth Bay on the other side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/St_Anthony_Head_-_geograph.org.uk_-_29086.jpg",
      "title": "Chris J Dixon / St Anthony Head",
      "caption": "St Anthony Head. Looking west, with Falmouth & Pendennis Point in the background. This National Trust run area overlooks the entrance to one of the world's largest natural harbours: Carrick Roads and the estuary of River Fal. Here you'll also find the former St Anthony Battery, built in 1895-97 to defend the estuary of the River Fal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/St_Anthony_Lighthouse_-_geograph.org.uk_-_325633.jpg/256px-St_Anthony_Lighthouse_-_geograph.org.uk_-_325633.jpg",
      "title": "Tony Atkin / St Anthony Lighthouse",
      "caption": "St Anthony Lighthouse. This view from behind the light shows the waters across the entrance to Falmouth Harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/St_Mawes_Harbour_-_geograph.org.uk_-_565053.jpg",
      "title": "Trevor Rickard / St Mawes Harbour",
      "caption": "St Mawes Harbour. From the coast path on the south side near St Anthony. The village lies on the east bank of the Carrick Roads. It was once a busy fishing port, but the trade declined during the 20th century and it now serves as a popular tourist location, with many properties in the village functioning as holiday accommodation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Towan_Beach_-_geograph.org.uk_-_325696.jpg",
      "title": "Tony Atkin / Towan Beach",
      "caption": "Towan Beach. This is a gentle agricultural landscape makes a big contrast to the high cliffs and heaths of St Anthony's Head just to the west. Near here there's the lovely Thirstea Cafe to visit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Rocks_near_Killigerran_Head_-_geograph.org.uk_-_29319.jpg",
      "title": "Chris J Dixon / Rocks near Killigerran Head",
      "caption": "Rocks near Killigerran Head"
    }
  ],
  "distance_km": 16.0,
  "description": "Explore the beautiful Roseland Peninsula on this 10 mile walk on the Cornish coast. The walk starts from the village of Porscatho where there is a good sized car park by the coast. You could also start from nearby Gerrans where there is an interesting 13th century church. From the Porscatho car park you head south along the South West Coast Path, passing a series of pretty coves and beaches including the Carricknath Point and Porthbean Beach SSSI. Here you will find sand covered beaches, natural rock platforms with fragments of saltmarsh, cliff top grassland, low rocky headlands and a variety of rare plants. You continue south to Zone Point, at the southernmost extremity of the peninsula extending into Falmouth Bay. Near here you will find the National Trust owned St Anthony Head Lighthouse. The headland is one of the highlights of the peninsula overlooking the entrance to one of the world's largest natural harbours, Carrick Roads and the estuary of River Fal. The site also includes an old military fort with big guns, batteries and fortifications. Look out for wildlife including cormorants, shags and seals in this area. The route continues past the pretty Little Molunan beach before turning north along St Mawes Harbour with nice views across to St Mawes Quay. This section includes some nice woodland trails with bluebells, primroses and celandines to see. Also look out for a wide variety of butterflies fluttering around the wildflowers. The path then takes you along the Porth Creek with views down to the Percuil River and a stretch through farmland. The final section takes you back along the coast to Porscatho. To continue your walking in the area you could head to the nearby town of Falmouth and visit the fascinating Pendennis Castle and the lovely Swanpool Nature Reserve. You can also enjoy a walk from St Mawes to St Just with a visit to the fascinating St Mawes Castle and the St Just in Roseland 13th-century church with beautiful riverside gardens. The ferry from St Mawes will take you across the Fal Estuary to Falmouth where you can continue along the South West Coast Path.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Stop off at the delightful Thirstea Co tea rooms for some refreshments on the route. They're located at a lovely spot next to Towan Beach and sell a good range of meals and snacks. You can find them at Porth Farm House with a postcode of TR2 5EX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The beaches and coastal paths make for a bracing walk with your dog. The tea rooms mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east along the coast path and you could pay a visit to the worthy village of Portloe. The village has a lovely harbour and a fine 17th century seaside inn to investigate. Just west of Falmouth there's a good circular trail to follow around Argal Reservoir near Penryn. There's also the ancient Mabe church and a boardwalk on the adjacent College Reservoir to see here. The St Mawes Walk starts from the village and visits Portscatho and Porthcurnick Beach where you will find the splendid Hidden Hut. This hidden gem serves a delicious and wide range of meals from an outdoor beach kitchen. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/B0tKAuwIp_4",
  "postcode": "TR2 5DU",
  "district": "Portscatho",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Parc-An-Dillon Road, Rosevine, Portscatho, Gerrans, Cornwall, England, TR2 5DU, United Kingdom",
  "state": "England"
}