{
  "created_at": "2025-01-05T23:47:22.012826+00:00",
  "objectID": "a3bccb5f1be9f937c7c52279caa98f4d",
  "ref": "haywards-heath-walking-route",
  "title": "Haywards Heath Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Commercial_Square_-_geograph.org.uk_-_541973.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a3bccb5f1be9f937c7c52279caa98f4d.gpx",
  "_geoloc": {
    "lat": 51.0062588795,
    "lng": -0.1035219156
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Commercial_Square_-_geograph.org.uk_-_541973.jpg",
      "title": "Simon Carey / Commercial Square",
      "caption": "Commercial Square"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/River_Ouse_-_geograph.org.uk_-_856191.jpg",
      "title": "Simon Carey / River Ouse",
      "caption": "River Ouse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Ardingly_Reservoir_-_geograph.org.uk_-_856110.jpg",
      "title": "Simon Carey / Ardingly Reservoir",
      "caption": "Ardingly Reservoir 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Ardingly_Reservoir_-_geograph.org.uk_-_367388.jpg",
      "title": "Dave Spicer / Ardingly Reservoir",
      "caption": "Ardingly Reservoir 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Wakehurst_Place.jpg/512px-Wakehurst_Place.jpg",
      "title": "Paste [Public domain], from Wikimedia Commons",
      "caption": "Wakehurst Place Gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Wakehurst_Place_seen_from_the_lower_lawn_-_geograph.org.uk_-_502397.jpg",
      "title": "Andy Potter / Wakehurst Place seen from the lower lawn",
      "caption": "Wakehurst Place seen from the lower lawn"
    }
  ],
  "distance_km": 15.0,
  "description": "This walk from Haywards Heath visits two of the highlights of the area at Ardingly Reservoir and Wakehurst Place. The walk uses a section of the High Weald Landscape Trail to take you to the lovely lake and the wonderful Botanic Gardens. The walk starts in the town centre, near to the train station. From here you head north, passing the golf course before coming to Copyhold Lane. Here you pick up the High Weald Landscape Trail which continues north through River's Wood to Ardingly Reservoir. The 198 acre reservoir is also a nature reserve with a variety of habitats including wetland, reedbed, deciduous woodland, hazel coppice and haymeadow. You can look out for wildlife such as Great crested grebe and kingfishers in this area. There's a nice footpath running along the eastern side of the water which will lead you up to Wakehurst Place which is the country estate of the Royal Botanic Gardens, Kew. There are 465 acres to explore on a series of delightful footpaths. Features include beautiful botanic gardens, woodland, lakes, formal gardens and an Elizabethan house. After exploring the park, the walk returns to Haywards Heath on the same paths. To continue your walking in the area you could pick up the Sussex Border Path, just to the east of the reservoir at the village of Horsted Keynes. This will lead you north to the attractive Weir Wood Reservoir which has a nice trail running around the perimeter. Other walking highlights near the town include the delightful gardens at Sheffield Park and Nymans Gardens. There's also the long distance Diamond Way and Brighton Way running through the town too. The latter will take you onto the beautiful South Downs which is not far from the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In nearby Danehill there's the Coach and Horses (Postcode:RH17 7JF). The family run, traditional pub is located in the heart of the Sussex countryside and has a great menu and lovely beer garden to relax in."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In nearby Bolney you could pay a visit to the impressive Bolney Wine Estate. Here you can enjoy guided tours of the vineyard and learn all about the history of the wine making process. The pretty village also includes a noteworthy 12th century church, several listed buildings and the well known Bolney Stage pub which is hundreds of years old. Just to the south there's the Bedelands Nature Reserve to explore. The wildlife rich reserve includes bluebell woodland, wildflower meadows, grazed meadows, a lake and a waterfall. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "postcode": "RH16 1XL",
  "district": "Mid Sussex",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "LGM House, Mill Green Road, Lucastes, Haywards Heath, Mid Sussex, West Sussex, England, RH16 1XL, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "waterfront",
    "pasture"
  ],
  "points_of_interest": [
    "gardens",
    "nature reserve",
    "estate"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}