{
  "objectID": "a3bd12607db202beea65c61ea5530cfc",
  "created_at": "2024-12-18T13:54:04.590301+00:00",
  "ref": "river-ayr-walk-walking-route",
  "title": "River Ayr Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/64/Glenbuck_Loch_-_geograph.org.uk_-_982168.jpg",
  "nearby": [
    {
      "description": "Ayrshire Coastal Path",
      "objectID": "b0d91ef3de8063faa322d7cbb16c0a6e",
      "ref": "ayrshire-coastal-path-walking-route"
    },
    {
      "description": "Culzean Castle Country Park",
      "objectID": "af1fadd6f2751cf60c600b5838549c53",
      "ref": "culzean-castle-country-park-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/3FEF7828ABF3D1758025840B00317E2C/$FILE/River Ayr Walk.gpx",
  "_geoloc": {
    "lat": 55.53669392,
    "lng": -3.97700786
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Glenbuck_Loch_-_geograph.org.uk_-_982168.jpg",
      "title": "Walter Baxter / Glenbuck Loch, via Wikimedia Commons",
      "caption": "Glenbuck Loch. The loch was formed in 1802 with the construction of two earthen dams at either end of the narrow glen, and it is the watershed for the River Ayr to the west and the Douglas Water to the east. This is the southeast part of the loch to the north of the former Caledonian Railway Line. Glenbuck Loch is a Site of Special Scientific Interest (SSSI) and Muirkirk Angling Association has the use of the loch for trout fishing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/The_River_Ayr_Way_-_geograph.org.uk_-_851084.jpg",
      "title": "david johnston / The River Ayr Way, via Wikimedia Commons",
      "caption": "The River Ayr Way heading towards Haugh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/The_River_Ayr_Way_-_geograph.org.uk_-_569739.jpg",
      "title": "Mary and Angus Hogg / The River Ayr Way, via Wikimedia Commons",
      "caption": "Looking across the moorland, towards Tincorn Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/The_River_Ayr_Way_-_geograph.org.uk_-_464580.jpg",
      "title": "Mary and Angus Hogg / The River Ayr Way, via Wikimedia Commons",
      "caption": "Near Kames, looking north-east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Take_to_the_Air_on_the_Ayr_Way_-_geograph.org.uk_-_1537310.jpg",
      "title": "A-M-Jervis / Take to the Air on the Ayr Way, via Wikimedia Commons",
      "caption": "Take to the Air on the Ayr Way In August 2005 the River Ayr Way was being extended eastwards from Muirkirk towards Glenbuck along the line of the old Caledonian Railway line from Lanark. This part of the line had closed completely in October 1964. East of Crossflat farm there was a gap in the path where a railway bridge had been demolished, leaving only the abutments. It is believed a wooden footbridge is now in place and walkers no longer need to be Olympic long jump specialists."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Sorn_Castle_from_the_River_Ayr_Way_-_geograph.org.uk_-_519591.jpg",
      "title": "Gordon Brown / Sorn Castle from the River Ayr Way, via Wikimedia Commons",
      "caption": "Sorn Castle from the River Ayr Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/River_Ayr_Gorge_woodlands_-_Ballochmyle.JPG/512px-River_Ayr_Gorge_woodlands_-_Ballochmyle.JPG",
      "title": "Rosser1954 [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The River Ayr woodlands, Ballochmyle Viaduct, Mauchline, East Ayrshire, Scotland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/River_Ayr_Way_at_Ayr_-_geograph.org.uk_-_347304.jpg",
      "title": "Chris Wimbush / River Ayr Way at Ayr, via Wikimedia Commons",
      "caption": "River Ayr Way at Ayr"
    }
  ],
  "distance_km": 65.0,
  "description": "This fantastic riverside walk follows the whole length of the River Ayr from its source at Glenbuck Loch to the town of Ayr, on the southwest coast of Scotland. The waymarked trail runs for about 40 miles on good footpaths, visiting several interesting villages, historic sites, riverside villages and wooded gorges. The long distance footpath was officially opened in 2006 by broadcaster Fred Macaulay, and is now designated as one of Scotland's Great Trails by Scottish Natural Heritage. As of 2018 about 137,000 people were using the path each year, of whom about 41,000 walked the entire route. The walk starts at Glenbuck Loch in east Ayrshire. The \"Loch\" is in fact a dam created in 1802 by James Finlay for his Catrine cotton works. From here you can pick up the trail and follow it west towards the town of Muirkirk. The trail continues west to the village of Sorn where you will pass Sorn Castle. The castle comprises a medieval tower house, which was extended over the years, and remodelled in the Scots Baronial style by David Bryce in the 1860s. It is protected as a category A listed building. The next stage passes Catrine and Mauchline before coming to the noteworthy Failford Gorge. This area includes a woodland nature reserve located in a steep ravine of sandstone cliffs. These ancient woods contain a wide variety of flora and fauna and some nice river footpaths. After exploring the gorge the route continues to Stair and Annbank before coming to the coast at Ayr. In Ayr the route links with the wonderful Ayrshire Coastal Path. You can continue your walking by picking up the waymarked trail and exploring the coast. Heading north will take you to Prestwick and Troon. Heading south will take you to the Heads of Ayr and the dramatic Culzean Castle Country Park .",
  "county": "East Ayrshire",
  "region": "Scotland",
  "country": "Scotland"
}