{
  "created_at": "2025-01-06T03:38:33.940109+00:00",
  "objectID": "a3bef22716b4314c225d24d23a12bc9b",
  "ref": "coleridge-way-walking-route",
  "title": "Coleridge Way Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Lime_Street%2C_Nether_Stowey_%28geograph_2882519%29.jpg/512px-Lime_Street%2C_Nether_Stowey_%28geograph_2882519%29.jpg",
  "nearby": [
    {
      "description": "Holford",
      "objectID": "77ecacef19bc0be47813884c33f367fe",
      "ref": "holford-walking-and-cycle-route"
    },
    {
      "description": "Combe Sydenham Country Park",
      "objectID": "82eb2702b46d0547a09ab05cd9a6e157",
      "ref": "combe-sydenham-country-park-walking-route"
    },
    {
      "description": "Brendon Hills",
      "objectID": "0942c3e98bece5c7a65d5e72ea2270f3",
      "ref": "brendon-hills-walking-route"
    },
    {
      "description": "Porlock and Porlock Weir",
      "objectID": "defc8c471a57e39f20156339f70c69a5",
      "ref": "porlock-and-porlock-weir-walking-route"
    },
    {
      "description": "Nether Stowey",
      "objectID": "b5ed885b5136c64e741869c0183a1d00",
      "ref": "nether-stowey-walking-route"
    },
    {
      "description": "Watersmeet",
      "objectID": "12cad550315c66989c05685a3e0c629c",
      "ref": "watersmeet-walking-route"
    },
    {
      "description": "Lynton and Lynmouth",
      "objectID": "faaec612f0f4f63c506af664291fa868",
      "ref": "lynton-and-lynmouth-walking-route"
    },
    {
      "description": "Dunkery Beacon",
      "objectID": "e1885fa5d920ae27461f10ac9ee52c6d",
      "ref": "dunkery-beacon-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Lime_Street%2C_Nether_Stowey_%28geograph_2882519%29.jpg/512px-Lime_Street%2C_Nether_Stowey_%28geograph_2882519%29.jpg",
      "title": "Stephen McKay / Lime Street, Nether Stowey",
      "caption": "Lime Street, in Nether Stowey at the start of the walk. With Coleridge cottage on the left and the Ancient Mariner on the right. The historic cottage was Coleridge's home during the late 18th century. The site is now run by the National Trust so you can enjoy a tour of the house and learn all about the life of the famous writer. It was during his three years here that he wrote his finest works, including 'The Rime of the Ancient Mariner', 'Kubla Khan', 'Frost at Midnight', 'Christabel' and 'This Lime Tree Bower my Prison'. The Ancient Mariner pub is named after his famous poem and a nice place to enjoy a drink before you set off."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/The_Coleridge_Way%2C_Bicknoller_Hill_-_geograph.org.uk_-_1655756.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bicknoller Hill. In 2008 the Way was selected by The Times as one of Britain's best autumn walks. Coleridge was a key figure in the Romantic Movement in England and a member of the Lake Poets, alongside his close friend William Wordsworth. Coleridge’s poetry and prose had a profound impact on English literature. Among his most celebrated works are the poems \"The Rime of the Ancient Mariner\" and \"Kubla Khan\", both of which exemplify his innovative use of language and imagination. He also authored the major prose work \"Biographia Literaria\", where he offered his critical insights, especially on Shakespeare, and engaged deeply with German philosophy, introducing ideas from German idealism to English-speaking audiences. Coleridge coined enduring phrases like \"suspension of disbelief\", a term that describes the reader’s willingness to set aside scepticism in order to immerse in a story. His critical contributions were influential on writers and thinkers such as Ralph Waldo Emerson and the Transcendentalist movement in the United States."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Coleridge_Way_-_geograph.org.uk_-_1946800.jpg",
      "title": "Coleridge Way by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Monksilver countryside. Despite his literary genius, Coleridge suffered from severe anxiety and depression throughout his life, conditions that were potentially linked to bipolar disorder (though not identified as such during his time). His health issues, exacerbated by opium addiction (fostered by the use of laudanum for pain relief), deeply affected his personal and professional life. Although Coleridge faced a turbulent career and life, his influence continued to grow posthumously, and today he is considered one of the most significant figures in English Romanticism. His legacy is celebrated in events like Coleridge Day by institutions such as the Church of England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Bridleway_at_White_Moor%2C_near_Lype_Hill_-_geograph.org.uk_-_182306.jpg",
      "title": "Barbara Cook / Bridleway at White Moor, near Lype Hill",
      "caption": "Bridleway at White Moor, near Lype Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Porlock_Weir_harbour_at_low_tide_-_geograph.org.uk_-_1710789.jpg",
      "title": "Phil Champion / Porlock Weir harbour at low tide",
      "caption": "Porlock Weir. harbour at low tide There has been a harbour at Porlock weir for over a thousand years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Watersmeet_-_geograph.org.uk_-_446636.jpg",
      "title": "Roger Gittins / Watersmeet",
      "caption": "Watersmeet. Confluence of East Lyn River (left) and Hoaroak Water. I believe that the bridges are designed to lift and be swept away in the event of a flood such as occurred in 1952."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/CombeSydenham_Stogumber_Somerset_geographorguk.jpg/512px-CombeSydenham_Stogumber_Somerset_geographorguk.jpg",
      "title": "Roger Cornfoot / Combe Sydenham",
      "caption": "Combe Sydenham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Lynmouth_Harbour_-_geograph.org.uk_-_1691329.jpg/512px-Lynmouth_Harbour_-_geograph.org.uk_-_1691329.jpg",
      "title": "Eugene Birchall / Lynmouth Harbour",
      "caption": "Lynmouth Harbour at the end of the route."
    }
  ],
  "distance_km": 82.0,
  "description": "Travel through the Exmoor National Park and the stunning Quantocks Hills as you walk in the footsteps of poet Samuel Taylor Coleridge. You start off in the pretty village of Nether Stowey, at the foot of the Quantock Hills and head west towards Holford, passing the iron age fort of Dowsborough on the way. You continue through a wooded section at Alfroxton Woods and onto Stowborrow Hill with its resident deer before passing through Bicknoller and Monksilver where you enter Combe Sydenham Country Park. Here you will find a 15th century stately home set in a 500 acres estate which includes a Deer Park and a variety of walks. The route continues through the Brendon Hills climbing to the high point of Lype Hill (1,388 ft) with wonderful views over the Exmoor National Park. You'll pass the villages of Luxborough and Cutcombe before climbing Horner Hill and passing the delightful Dunkery and Horner Woods Nature Reserve where you can enjoy a climb to Dunkery Beacon. The path then descends to the pretty coastal settlements of Porlock and Porlock Weir where there's a delightful harbour and beach. The route continues west past Culbone Wood, Leeford and Alderford before coming to another route highlight at Watersmeet with its fine house, woodland trails and waterfalls along the East Lyn River. The final section then takes you through Wester Wood before finishing in Lynton and Lynmouth .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the start of the walk there's the Ancient Mariner in Nether Stowey. The 16th century pub has a good menu and a nice garden area to relax in on warmer days. They also provide accommodation if you'd like to stay over in the village before you start the walk. You can find them at postcode TA5 1NG for your sat navs. The pub is located opposite the National Trust's Coleridge Cottage where you can learn all about the life and works of the famous poet. In the little village of Monksilver you could visit the Notley Arms for some refreshments on your walk. The pub has a lovely, large garden area with a pretty stream. It's perfect for relaxing in on warm summer days. They serve Somerset's finest Ales, Beers and Ciders as well as the best local produce for the meals, which are freshly prepared daily by the award winning team of chefs. They also provide excellent accommodation if you need to stay over. You can find the pub in the village at postcode TA4 4JB for your sat navs. Near West Quantoxhead you could take a detour from the route to visit Kilve Beach and East Quantoxhead. The beach is a great place for fossil hunting and walks along the cliff top path. There's also a lovely cafe for cream teas and a 17th century coaching inn in Kilve village."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Here are some famous Coleridge quotes: \"In Xanadu did Kubla Khan A stately pleasure-dome decree: Where Alph, the sacred river, ran Through caverns measureless to man Down to a sunless sea.\" -Kubla Khan “Water, water, everywhere, And all the boards did shrink; Water, water, everywhere, Nor any drop to drink.” -The Rime of the Ancient Mariner  For more walking ideas in the area see the Exmoor Walks and the Quantocks Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/v9Ti-PoGGCU",
  "gazetteer_found": false,
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a3bef22716b4314c225d24d23a12bc9b.gpx",
  "_geoloc": {
    "lat": 51.1523408926,
    "lng": -3.1578596343
  },
  "nominatim_found": true,
  "display_address": "Coleridge Cottage, 35, Lime Street, Bridgwater, Somerset, England, TA5 1NQ, United Kingdom",
  "postcode": "TA5 1NQ",
  "district": "Bridgwater",
  "county": "Somerset",
  "region": null,
  "state": "England",
  "country": "United Kingdom",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill",
    "coastal"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve",
    "deer park"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "woodland trails"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}