{
  "objectID": "a47cb9e29a5afa6abe3379af6101951b",
  "created_at": "2024-12-18T20:54:06.178928+00:00",
  "ref": "otterburn-ranges-walking-route",
  "title": "Otterburn Ranges Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Byrness_-_geograph.org.uk_-_3606974.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/27D7BB2C3EF420FA86258964005078A6/$FILE/Otterburn Ranges.gpx",
  "_geoloc": {
    "lat": 55.3189533465,
    "lng": -2.3718443675
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Byrness_-_geograph.org.uk_-_3606974.jpg",
      "title": "Byrness by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Byrness"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Houx_Hill_on_the_Pennine_Way_-_geograph.org.uk_-_652650.jpg",
      "title": "Oliver Dixon / Houx Hill on the Pennine Way",
      "caption": "Houx Hill on the Pennine Way. Near the start of the last and longest (44km) stage of the Pennine Way from Byrness to Kirk Yetholm. The Pennine Way established in 1965 is the oldest and best-known of the English National Trails. The northernmost end of the Kielder group of forests can be seen in the distance on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Coquet_Head_-_geograph.org.uk_-_932673.jpg",
      "title": "Stephen McKay / Coquet Head",
      "caption": "Coquet Head. Seen here within a mile or so of its source in the Cheviot Hills, The River Coquet is one of Northumberland's principal rivers eventually reaching the coast at Amble. This stretch forms the border between England and Scotland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Chew_Green%2C_Roman_Fort_sign%2C_Upper_Coquet_-_geograph.org.uk_-_888563.jpg/256px-Chew_Green%2C_Roman_Fort_sign%2C_Upper_Coquet_-_geograph.org.uk_-_888563.jpg",
      "title": "Charlie Bell / Chew Green, Roman Fort sign, Upper Coquet",
      "caption": "Chew Green, Roman Fort sign, Upper Coquet"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/View_west_from_Camel%27s_Path_-_geograph.org.uk_-_1090104.jpg",
      "title": "Joan Sykes / View west from Camel's Path",
      "caption": "View west from Camel's Path. Dramatic sky over the Cheviots with Raven's Knowe in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Kemyls_Peth%2C_descent_into_Coquetdale_-_geograph.org.uk_-_1088620.jpg",
      "title": "Oliver Dixon / Kemyls Peth; descent into Coquetdale",
      "caption": "Kemyls Peth; descent into Coquetdale. Part of the Otterburn Ranges only open to the public for a limited period each year although this road between Cottonhopesburnfoot in Redesdale and Coquetdale is rarely closed. This section of road is the so-called Camel's Path (no doubt a corruption of Kemyls Peth), an ancient road which coincides approximately with the Roman Dere Street. The Pennine Way skirts Brownhart Law NT7809 on the skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/River_Coquet%2C_Chew_Green_-_geograph.org.uk_-_932733.jpg",
      "title": "Stephen McKay / River Coquet, Chew Green",
      "caption": "River Coquet, Chew Green.  A very young River Coquet heads down through Upper Coquetdale, eventually to the coast at Amble, passing under the military road to Redesdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Road_Bridge_over_the_River_Rede_-_geograph.org.uk_-_3008961.jpg",
      "title": "Road Bridge over the River Rede by Les Hull, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Road Bridge over the River Rede"
    }
  ],
  "distance_km": 19.0,
  "description": "This walk explores the Otterburn Ranges, an expansive Ministry of Defence owned area of the Northumberland National Park. The wide area of Moorland is a haven for wildlife due to its remote, sparsley populated nature. This circular walk explores the ranges around the village of Byrness. There is some roadside parking along the A road and the Forest View Walkers Inn where parking is available to guests. From near here you can pick up the Pennine Way and follow it north past Byrness Hill, Houx Hill and Ogre Hill on the edge of the Border Forest Park. Turn east here and you will soon come to the source of the River Coquet at Coquet Head, on the border with Scotland. You'll pass along the Border County Ride, heading east to the site of the medieval village of Kemylpethe and the old Roman Fort at Chew Green. There's an information board here detailing the history of the ancient site. Here you pick up the old Roman Road known as Camel's Path or Dere Street and follow it south east to Middle Golden Pot with great views of the Cheviots. Here you turn south west, passing the Cottonshope Quarry before a woodland section through the Byrness Plantation.  You can then pick up the Pennine Way again and follow it west along the edge of Redesdale Forest and the River Rede. To continue your walking in the area head towards Alwinton and try the Usway Burn - River Coquet - Upper Coquetdale Walk .",
  "video_url": "https://www.youtube.com/embed/GDcE-iB-P6s",
  "district": "Byrness",
  "county": "Northumberland",
  "region": "North East",
  "country": "England"
}