{
  "created_at": "2025-01-06T00:34:59.557333+00:00",
  "objectID": "a487ca18954784289c7322aae08ed7a0",
  "ref": "lamberhurst-walking-route",
  "title": "Lamberhurst Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Southern_end_of_The_Broadway%2C_Lamberhurst_-_geograph.org.uk_-_2021384.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a487ca18954784289c7322aae08ed7a0.gpx",
  "_geoloc": {
    "lat": 51.1024276378,
    "lng": 0.3931532181
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Southern_end_of_The_Broadway%2C_Lamberhurst_-_geograph.org.uk_-_2021384.jpg",
      "title": "Southern end of The Broadway, Lamberhurst by shirokazan, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Southern end of The Broadway, Lamberhurst"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Down_Farm_Oasts%2C_Furnace_Lane%2C_Lamberhurst%2C_Kent_-_geograph.org.uk_-_2139970.jpg",
      "title": "Down Farm Oasts, Furnace Lane, Lamberhurst, Kent by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Down Farm Oasts, Furnace Lane, Lamberhurst, Kent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Furnace_Mill_across_the_River_Teise_-_geograph.org.uk_-_1757490.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Furnace Mill across the River Teise"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/River_Teise_near_Furnace_Mill_-_geograph.org.uk_-_1757492.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Teise near Furnace Mill. The river is one of the main tributaries of the River Medway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Bayham_Old_Abbey%2C_East_Sussex_-_geograph.org.uk_-_2125813.jpg/512px-Bayham_Old_Abbey%2C_East_Sussex_-_geograph.org.uk_-_2125813.jpg",
      "title": "Bayham Old Abbey, East Sussex by nick macneill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bayham Old Abbey, East Sussex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Bayham_Old_Abbey_-_geograph.org.uk_-_1337092.jpg",
      "title": "Trevor Harris / Bayham Old Abbey",
      "caption": "Bayham Old Abbey. The ruins of the 13th Century abbey. The beech tree on the right is growing on the remains of the east wall of the abbey church.The abbey ruins straddle this square and that to the west."
    }
  ],
  "distance_km": 6.2,
  "description": "This Kent based village has some nice walking trails through the valley of the River Teise and two noteworthy historic ruins to visit nearby. There's also a fine 15th century pub to relax in after your exercise. This walk takes you west from the village to visit Furnace Mill and the ruined Bayham Abbey. The walk starts in the village and follows footpaths west along the River Teise to Furnace Mill. The picturesque mill sits next to the river in a lovely spot. It was once a working watermill but is now a private residence. The route continues west past Floshet Wood before turning south towards Hook Green. You can then follow an access road north to reach Bayham Old Abbey. The site is run by English Heritage and includes substantial ruins. There's a 13th to 15th-century church, the chapter house, and a picturesque 14th-century gatehouse to see in this historic area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Chequers is a good choice for some post walk refreshments in the village. The pub dates back to the 15th century and includes a charming interior with log fires and interesting wall art. Outside there's a lovely garden area for summer days. They do excellent food and can be found on The Broadway at postcode TN3 8DB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Chequers mentioned above is also dog friendly. Please keep them on leads around the Bayham Abbey site."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south east of the village you can continue your walking around the grounds of Scotney Castle. The National Trust property includes 770 acres of woodland and parkland surrounding the 14th century moated castle. Due south there's one of the highlights of the area at Bewl Water. The expansive reservoir includes some fine waterside cycling and walking trails. To the east of the settlement you'll find the worthy village of Goudhurst. The picturesque little village is located in a lovely elevated spot with excellent views over the Weald. There's also a delightful village pond, rows of ancient cottages and a noteworthy 14th century church to see here. Another good idea is to head to the town of Cranbrook. The ancient settlement is well worth exploring with a number of fine medieval buildings, a noteworthy church known as the 'Cathedral of the Weald' and a photogenic working windmill to see. There's also an excellent, award winning micropub on the High Street to try. The Cranbrook Walk explores the town before heading to the nearby Sissinghurst Castle. It's another National Trust run attraction in a similar vein to Scotney. For more walking ideas in the area see the Kent Walks and High Weald Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/URsEkC4OHvk",
  "postcode": "TN3 8DE",
  "district": "Lamberhurst",
  "county": "Kent",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}