{
  "objectID": "a4d1beb87a12b51611452ba7024245a8",
  "created_at": "2024-12-18T09:35:37.893752+00:00",
  "ref": "dow-crag-and-seathwaite-tarn-walking-route",
  "title": "Dow Crag and Seathwaite Tarn Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/26/Holy_Trinity_Church%2C_Seathwaite_-_geograph.org.uk_-_2388374.jpg",
  "nearby": [
    {
      "description": "Old Man of Coniston",
      "objectID": "60f6fa5981e83bc94a2232e3996a0f8c",
      "ref": "old-man-of-coniston-walking-route"
    },
    {
      "description": "Harter Fell",
      "objectID": "e602e83618eadaf14724dcc81b7251de",
      "ref": "harter-fell-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/F761D03B7B9DFA5680258294003831EA/$FILE/Dow Crag and Seathwaite Tarn.gpx",
  "_geoloc": {
    "lat": 54.3539414383,
    "lng": -3.1887964792
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Holy_Trinity_Church%2C_Seathwaite_-_geograph.org.uk_-_2388374.jpg",
      "title": "Alexander P Kapp [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Holy Trinity Church, Seathwaite. The church is recorded in the National Heritage List for England as a designated Grade II listed building. The 19th century church was built on the site of an earlier church. For 67 years the curate of that church had been Robert Walker, who was made famous by the poet William Wordsworth. Wordsworth called him \"Wonderful Walker\", and made reference to him in his Duddon Sonnets and in the poem The Excursion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Waterfall_on_Tarn_Beck_-_geograph.org.uk_-_1578837.jpg",
      "title": "Dreamer [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Waterfall on Tarn Beck"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Stone_shelter_and_Walna_Scar_Track_-_geograph.org.uk_-_1015740.jpg",
      "title": "Tom Richardson / Stone shelter and Walna Scar Track",
      "caption": "Stone shelter and Walna Scar Track. Walna Scar is the highest of Wainwright's The Outlying Fells of Lakeland. Geologically, Walna Scar contains a rich seam of distinctively striped slate which was quarried until the early 20th century. The quarry can still be seen today on the slopes overlooking the Duddon Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Blind_Tarn_-_geograph.org.uk_-_1405923.jpg",
      "title": "Michael Graham / Blind Tarn",
      "caption": "Blind Tarn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Cairn_on_Brown_Pike_-_geograph.org.uk_-_1015728.jpg",
      "title": "Tom Richardson / Cairn on Brown Pike",
      "caption": "Cairn on Brown Pike"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Bottom_end_of_Coniston_Water_from_Dow_Crag_-_geograph.org.uk_-_326456.jpg",
      "title": "blumik / Bottom end of Coniston Water from Dow Crag",
      "caption": "Bottom end of Coniston Water from Dow Crag. The name Dow Crag originally applied specifically to the eastern face which looks down upon the tarn of Goat's Water. From the summit the view south and west to the coast is excellent, but much of Lakeland is blotted out by the flanks of the Coniston range. The Scafells are far enough west to put in an appearance and Skiddaw and the Helvellyn range can be seen through Fairfield and Levers Hawse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Seathwaite-Tarn-by-Paul-Lockett.jpg",
      "title": "Paul Lockett [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Seathwaite Tarn. The dam is almost 400 yards (366 m) long and is concrete cored with slate buttresses, the resulting depth of the tarn being around 80 feet (24 m). The lake is located to the south of Grey Friar Fell and to the west of Brim Fell (on the ridge between The Old Man of Coniston and Swirl How) and north east of the village of Seathwaite on the east of the Duddon Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Island%2C_Seathwaite_Tarn_-_geograph.org.uk_-_394447.jpg",
      "title": "Michael Graham / Island, Seathwaite Tarn",
      "caption": "Island, Seathwaite Tarn. Located on the slopes of Brim Fell, above the head of the reservoir, are the remains of Seathwaite Tarn Mine. This was worked for copper in the mid 19th century, and also appears as a location in the novel The Plague Dogs by Richard Adams."
    }
  ],
  "distance_km": 13.0,
  "description": "A challenging circular walk in the Western Lakes which visits the pretty Seathwaite Tarn and the fine viewpoint at Dow Crag. The walk starts from the little village of Seathwaite in the Duddon Valley area of the South Lakeland District. Park at the car park in the village and start by heading north east up to the Walna Scar Road. The path then climbs to Walna Scar, Brown Pike, Blind Tarn and Buck Pike before coming to Dow Crag. The summit stands at a height of 778 m (2,552 ft) with great views of the Scafells, Skiddaw and the Helvellyn range. You are also just above the lovely Goat's Tarn and Blind Tarn which are very photogenic. After taking in the views you then descend to Seathwaite Tarn where there's a nice path along the western side of the water. The path then continues the descent to pretty Tarn Beck, which you follow back into Seathwaite. This walk is located very close to the Old Man of Coniston where you can extend your exercise. It lies just to the east of the Dow Crag summit and can be reached by following paths past Goat's Water from Goat's Hawse. See our Circular Walk around Coniston for more details. The 7 mile hike visits the Old Man summit before heading to Dow Crag, Buck Pike, Brown Pike and Walna Scar. Just to the west is the lovely climb to Harter Fell where there are more great views over the Duddon Valley and woodland trails through the adjacent Dunnerdale Forest.",
  "video_url": "https://www.youtube.com/embed/afdVGHRNePU",
  "district": "Seathwaite",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England"
}