{
  "created_at": "2025-01-06T03:56:31.482405+00:00",
  "objectID": "a5575adf79cf173931ae942ede3a2bac",
  "ref": "breydon-water-walking-route",
  "title": "Breydon Water Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/70/Breydon_Water_shoreline_-_geograph.org.uk_-_1484321.jpg",
  "nearby": [
    {
      "description": "Angles Way",
      "objectID": "f6cef38e2b6ed5f59b36ea4b6875c872",
      "ref": "angles-way-walking-route"
    },
    {
      "description": "Wherryman's Way",
      "objectID": "b81d253a737b17ad07a0749a92ba69fa",
      "ref": "wherrymans-way-walking-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Burgh Castle",
      "objectID": "6faebafad246183ae6c6650c2457daef",
      "ref": "burgh-castle-walking-route"
    },
    {
      "description": "Reedham",
      "objectID": "5a36129b8eab18365f972d5d5f3ba8ff",
      "ref": "reedham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a5575adf79cf173931ae942ede3a2bac.gpx",
  "_geoloc": {
    "lat": 52.6115567405,
    "lng": 1.7223700389
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Breydon_Water_shoreline_-_geograph.org.uk_-_1484321.jpg",
      "title": "Evelyn Simak / Breydon Water shoreline",
      "caption": "Breydon Water. The wind turbines seen in the distance are situated in the North Sea off Great Yarmouth. Breydon Water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Approaching_Breydon_Water_-_geograph.org.uk_-_1484273.jpg",
      "title": "Evelyn Simak / Approaching Breydon Water",
      "caption": "View downstream the River Waveney as it approaches Breydon Water. Breydon Water is a wide tidal estuary with origins more associated with the sea than peat extraction. The 5km expanse is a designated Nature Reserve of international importance to migratory birds, managed by the Royal Society for the Protection of Birds (RSPB). The Angles Way long distance footpath leads past it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/River_Waveney_joins_Breydon_Water_-_geograph.org.uk_-_693553.jpg",
      "title": "Evelyn Simak / River Waveney joins Breydon Water",
      "caption": "View as the River Waveney joins Breydon Water. The site of the Roman fort of Gariannonum offers magnificent views across the marshes extending westwards; the view was taken from the northwestern corner of the north wall. Berney Arms pub can be seen in the distance at left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Ashtree_Farm_and_Berney_Arms_Mill_-_geograph.org.uk_-_808685.jpg",
      "title": "Pierre Terre / Ashtree Farm and Berney Arms Mill",
      "caption": "Ashtree Farm and Berney Arms Mill. View down the River Yare to Berney Arms Drainage Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/A_kink_in_the_drain_-_geograph.org.uk_-_631194.jpg",
      "title": "Evelyn Simak / A kink in the drain",
      "caption": "A kink in the drain. Not all drains are cut straight. This one, running parallel to the Weavers Way, leisurely meanders eastwards. Berney Arms Station and drainage pump can be seen in mid-distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/A_sunny_December_day_-_geograph.org.uk_-_631255.jpg",
      "title": "Evelyn Simak / A sunny December day",
      "caption": "A sunny December day. Cattle is still grazing the marshes on this sunny but windy December day in the marshes near Berney Arms. Manor Farm House and Mutton's drainage mill can be seen in the far distance, across pools of water in a marsh pasture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Fleet_Dike_-_geograph.org.uk_-_626289.jpg",
      "title": "Evelyn Simak / Fleet Dike",
      "caption": "Fleet Dike. Looking east towards Fleet Dike and Mutton's drainage mill. Mutton's Mill, located on Fleet Dike, has been in the process of being restored since the mid 1970s. Only very recently a fantail was added, completing yet another step towards its full restoration, and it may not be too long before this attractive tower mill will once again be fully functional."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/View_across_Breydon_Water_-_geograph.org.uk_-_1484305.jpg",
      "title": "Evelyn Simak / View across Breydon Water",
      "caption": "This view was taken from the Angles Way long distance footpath."
    }
  ],
  "distance_km": 22.5,
  "description": "Visit the UK's largest protected wetland on this wonderful waterside walk in Great Yarmouth. The expansive estuary is also a nature reserve with a huge number of wading birds to look out for. Keep your eyes peeled for golden plovers, wigeons, lapwings and tens of thousands of Bewick's swans. There is also a bird observation hide at the east end of the water. You can explore the area from Great Yarmouth by following the Weavers' Way west towards Berney Marshes. There's some beautiful Norfolk Broads scenery with mills, marshland and views of the River Yare and River Waveney. If you follow the Angles Way along the southern side of the water you can visit the fine Roman Fort at Burgh Castle .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the village of Burgh Castle at the western end of the water and you can pay a visit to The Fishermans Inn. The noteworthy pub is in a great location right next to the River Yare and the Roman Fort. They have a lovely garden area with views over the lake. It's a splendid spot if the weather is fine. They do good food and can be found at the marina at a postcode of NR31 9PZ for your sat navs. They are also dog friendly if your four legged friend is with you. In the village you'll also find the Queens Head which is another good option. They also have a good outdoor area and welcome walkers. You can find them on the High Road at a postcode of NR31 9QQ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north along the coast and you could visit the worthy village of Winterton on Sea. There's much to enjoy here with village features including a lighthouse, pretty cottages, unusual roundhouses and a fine 17th century pub. The area also includes the noteworthy Winterton Dunes. The dunes are part of a National Nature Reserve where you can look out for a variety of coastal birds and the natterjack toad. The Winterton on Sea Walk starts at the lighthouse and takes you through the dunes to Horsey Mere and Martham Broad. For more walking ideas in the area see the Norfolk Broads Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/N4wZ3xUJhzI",
  "postcode": "NR30 1JT",
  "district": "Great Yarmouth",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Kwik Fit, North Quay, Runham Vauxhall, Great Yarmouth, Norfolk, England, NR30 1JT, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "marshland",
    "waterfront"
  ],
  "points_of_interest": [
    "nature reserve",
    "bird watching",
    "historical sites"
  ],
  "facilities": [
    "visitor center",
    "bird observation hide"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "bird watching"
  ]
}