{
  "created_at": "2025-01-06T00:21:54.767609+00:00",
  "objectID": "a57330331a68f84a3402a443b227dd80",
  "ref": "woodhall-spa-walking-route",
  "title": "Woodhall Spa Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/38/Pine_Woods_Woodhall_Spa_-_geograph.org.uk_-_102320.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a57330331a68f84a3402a443b227dd80.gpx",
  "_geoloc": {
    "lat": 53.1523182884,
    "lng": -0.2173975606
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Pine_Woods_Woodhall_Spa_-_geograph.org.uk_-_102320.jpg",
      "title": "Dave Hitchborne / Pine Woods Woodhall Spa",
      "caption": "Pine Woods Woodhall Spa. In the search for coal during the nineteenth century, pine trees were grown here for pit-props. During the digging spa water was found and formed the basis of the spa resort at Woodhall Spa."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Aconites_in_the_woods_at_Woodhall_Spa_-_geograph.org.uk_-_469490.jpg",
      "title": "Dave Hitchborne / Aconites in the woods at Woodhall Spa",
      "caption": "Aconites in the woods at Woodhall Spa. Aconites are a cheerful display during the days of winter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/The_Cottage_Museum%2C_Woodhall_Spa_-_geograph.org.uk_-_949455.jpg",
      "title": "E Gammie / The Cottage Museum, Woodhall Spa",
      "caption": "The Cottage Museum. This Boulton and Paul corrugated iron bungalow was built in 1884 and was occupied by the Weild family until the 1960's. Thomas Weild was a bath chair proprietor and transported people from the station to the spa baths to 'take the waters' (the railway ran alongside the left end of the bungalow). The bungalow now contains a local information centre and various local history displays."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Kinema_in_the_Woods.jpg",
      "title": "Rodney Burton / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Kinema in the Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Sheep_May_Safely_Graze_-_geograph.org.uk_-_771637.jpg",
      "title": "Ian Paterson / Sheep May Safely Graze",
      "caption": "Sheep May Safely Graze alongside the River Witham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Road_Junction%2C_Woodhall_Spa_-_geograph.org.uk_-_549467.jpg",
      "title": "David Wright / Road Junction, Woodhall Spa",
      "caption": "Road Junction, Woodhall Spa Photo taken looking along Tattershall Road towards the junction with The Broadway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/The_Dam_Busters_Memorial._-_geograph.org.uk_-_1552470.jpg",
      "title": "gary radford / The Dam Busters Memorial.",
      "caption": "The Dam Busters Memorial. A Memorial to Number 617 Squadron \"The Dam Busters\" At Woodhall Spa, Lincolnshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/River_Bain%2C_Horncastle_-_geograph.org.uk_-_562950.jpg",
      "title": "Dave Hitchborne / River Bain, Horncastle",
      "caption": "River Bain, Horncastle. The river alongside Watermill Road"
    }
  ],
  "distance_km": 10.0,
  "description": "Woodhall Spa is a very attractive former spa town on the edge of the Lincolnshire Wolds. There are good walking opportunites with several peaceful woods, two rivers and lots of attractive countryside to explore. This walk explores the lovely Pinewoods in the village before following the Viking Way to nearby Horncastle. On the way there's woodland trails, countryside views and riverside paths along the River Bain. The walk starts off in the centre of village at The Pinewoods, where there some easy trails and lots of interesting flora and fauna to see. These delightful woods are also notable for the unique Kinema in the Woods. It dates from 1922, and it is the only fully functioning cinema in the UK to employ back projection. In the woods you can also look out for wildlife including great spotted woodpecker and muntjac deer. After exploring Pinewoods you then pick up the waymarked Viking Way and follow it east through Bracken Wood, Highall Wood and Whithall Wood. Shortly after you pick up the River Bain where a riverside footpath will take you all the way into the Roman town of Horncastle. The route follows part of the Spa Trail, a shared cycling and walking trail running along a dismantled railway line.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Abbey Lodge Inn is a fine choice for refreshments after your walk. The olde worlde style pub has a cosy interior with roaring fires. It's a friendly place with a good menu and selection of ales. You can find it just to the south of the village on Tattershall Road at a postcode of LN10 6UQ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and river paths are ideal for dog walking so you'll probably see plenty of other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around the village head north on the Viking Way to visit Stixwould, Southrey Wood and the village of Bardney where you can see the remains of Bardney Abbey. If you head west of the village you can pick up more riverside paths along the River Witham. You could follow the river south and visit Tattershall Lakes where there is a leisure park with several lakes and more riverside paths along the River Bain. You'll also find the 15th century Tattershall Castle which is run by the National Trust. There's also some attractive heathland at Moor Farm Nature Reserve on Wellsyke Lane. Here you can see plants including tormentil, bell heather and climbing corydalis. The Water Rail Way starts/finishes in Woodhall Spa. This shared cycling and walking rail trail runs along the River Witham into Lincoln. The Viking Way Circular Walk starts in the town and uses part of the trail and the Viking Way to create a circular walk around the town.  To find out about the history of the area head to the excellent Woodhall Spa Cottage Museum. The Museum building itself is a rare surviving example of a bungalow constructed of corrugated iron on a wooden frame that was erected in the late nineteenth century. Inside there's interesting exhibits, intriguing stories and several displays about the local area and the Wield family, who lived in the building from 1887 until the 1960’s. You can find it at Iddesleigh Road, with a postcode of LN10 6SH for your sat navs. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1bHd7Apf1ZQ?start=53",
  "district": "East Lindsey",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Golden Phoenix, 10, Station Road, Oaklands, Woodhall Spa, East Lindsey, Lincolnshire, England, LN10 6QL, United Kingdom",
  "postcode": "LN10 6QL",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "countryside",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "shared cycling and walking trail"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}