{
  "created_at": "2025-01-06T01:12:14.659565+00:00",
  "objectID": "a593d691cedb661ce3eefc3bbc3798c0",
  "ref": "blickling-hall-walking-and-cycle-route",
  "title": "Blickling Hall Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Blickling_Hall_viewed_from_the_southeast_-_geograph.org.uk_-_774912.jpg",
  "nearby": [
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Aylsham",
      "objectID": "d43b9066b7a4736af0549e6f9dc99be5",
      "ref": "aylsham-walking-route"
    },
    {
      "description": "Marsham Heath",
      "objectID": "ab8aabc75d8893283f4ef0ceb344ae5c",
      "ref": "marsham-heath-walking-route"
    },
    {
      "description": "Heydon Hall",
      "objectID": "4177464e1cf9a8926d3800526af18249",
      "ref": "heydon-walking-route"
    },
    {
      "description": "Mannington Hall",
      "objectID": "c475597070c259e4d835fb9704d8828f",
      "ref": "mannington-hall-walking-route"
    },
    {
      "description": "Wolterton Hall",
      "objectID": "239aa81aa7b9660227b92fab7770cc1e",
      "ref": "wolterton-hall-walking-route"
    },
    {
      "description": "Rebellion Way",
      "objectID": "ce673553ec15d7a7286596120f836ac9",
      "ref": "rebellion-way-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a593d691cedb661ce3eefc3bbc3798c0.gpx",
  "_geoloc": {
    "lat": 52.8194891404,
    "lng": 1.2334535872
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Blickling_Hall_viewed_from_the_southeast_-_geograph.org.uk_-_774912.jpg",
      "title": "Evelyn Simak / Blickling Hall viewed from the southeast",
      "caption": "Blickling Hall viewed from the southeast. Originally built as a manor house. In the 11th century the house was owned by Harold Godwinson, who later became the King of England. William I passed the property on to his chaplain and by 1091 it had become a country palace of the bishops. During the late 14th century it was owned by Sir Nicholas Dagworth, who built a rectangular house surrounded by a moat. At the end of the 15th century, Blickling Hall was owned by the Boleyn family and, according to tradition, Anne Boleyn was born here. Sir Henry Hobart purchased the estate in 1616. His descendants lived at Blickling Hall until 1940."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Mausoleum_in_Blickling_Park_-_geograph.org.uk_-_554090.jpg",
      "title": "Evelyn Simak / Mausoleum in Blickling Park",
      "caption": "Mausoleum in Blickling Park. About a mile away from the hall, at the south end of the Great Wood, there is a stone mausoleum, which is built in the form of a pyramid. It contains three sarcophagi holding the remains of John Hobart, the second Earl of Buckinghamshire (died 1793), and his two wives. The mausoleum was designed by Joseph Bonomi - the design is based on the Roman tomb of Cestius, not on anything Egyptian."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/The_former_Blickling_Watermill_-_geograph.org.uk_-_653425.jpg",
      "title": "Evelyn Simak / The former Blickling Watermill",
      "caption": "The former Blickling Watermill. The mill once belonged to the Estate. The mill house was extended during the 1820s, and again in 1860; the mill was three storeys high. Production ceased around 1914 and in 1979 the Anglian Water Authority proposed plans for the erection of a water gauging station, a project that appears to have been abandoned again."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Seeing_the_sights_-_geograph.org.uk_-_774958.jpg",
      "title": "Evelyn Simak / Seeing the sights",
      "caption": "Seeing the sights. Whilst visitors to Blickling Park are busily exploring the various sights, this cat appears to have spotted something of feline interest in the shrubs that line Temple Walk. The Doric temple seen in mid-distance, and the terrace it stands on, were built by Sir John Hobart, later 1st Earl of Buckinghamshire, around 1730 in order to provide a focal point for the main east-west axis of the woodland garden, which comprises radiating walks, each one lined with a different tree species."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Temple_Walk_-_geograph.org.uk_-_774938.jpg",
      "title": "Evelyn Simak / Temple Walk",
      "caption": "Temple Walk. So called because a Doric temple stands at its end. This temple, and the terrace it stands on, were built by Sir John Hobart, later 1st Earl of Buckinghamshire, around 1730 in order to provide a focal point for the main east-west axis of the woodland garden, which comprises radiating walks, each one lined with a different tree species. The estate is now in the care of the National Trust. The garden at Blickling Hall was started in the 17th century by Sir Henry Hobart, who began building the house, as it presently stands, in 1619. His successors built on Sir Henry's design by creating new extensions, and by redesigning existing sections; nothing remains of the original formal garden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/The_Tower_-_geograph.org.uk_-_512442.jpg",
      "title": "Evelyn Simak / The Tower",
      "caption": "The Tower. A different view of The Tower, seen from Great Wood. The 2nd Earl of Buckinghamshire had the Gothic Tower built in the 1770s as a grandstand from which to watch horse-racing in the Park. It is now a private residence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/The_Sitooterie_-_geograph.org.uk_-_775062.jpg",
      "title": "Evelyn Simak / The Sitooterie",
      "caption": "The Sitooterie. The name is derived from the Scottish term to 'sit oot in\". The Sitooterie is intended as a space for relaxation, reflection and contemplation. It was built on a site where seven yew trees grow - an emblem of everlasting life. The yew trees have been trained over a steel frame to form a green summerhouse; the mandala floor design is made from recycled copper; the stained glass roundels, created by Teri Lockton, represent spring, summer and autumn. Partners in this project were The National Trust, John Grooms Court in Norwich (a national charity which works with disabled people, enabling them to gain greater independence, choice and freedom), and Norfolk-based artists."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Wintry_sunshine_-_geograph.org.uk_-_618458.jpg",
      "title": "Evelyn Simak / Wintry sunshine",
      "caption": "Wintry sunshine. These oaks still have most of their foliage, which forms a nice contrast to the green sugar beet field."
    }
  ],
  "distance_km": 5.0,
  "description": "The Blickling Hall estate in Aylsham has five thousand acres of parkland, farmland and woodland to explore on foot or by bike. There are three colour coded, way-marked walks to follow and a lovely family cycle route around the 1 mile long lake. The Blue Route will take you west up towards Bunker's Hill and Great Wood. Here you'll find some nice shady paths and the mausoleum. The Green Route will take you around the large lake with fine views back towards the hall. Bike hire is available on site. You can also take a stroll around the beautiful 55 acre garden. It contains a Parterre, Secret Garden, Orangery and an 18th century Temple. The Weavers' Way walking route runs through the estate so you could continue your walk along this footpath. Heading north will take you to the River Bure where there's some nice waterside paths and countryside views.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On site you'll find The Farmyard Café and The Stables Cafe. They both serve a good range of meals and snacks. If you prefer a pub lunch then head to the nearby Bucks Arms. The 17th century former coaching inn can be found near the main car park at postcode NR11 6NF. They serve good food and have lovely gardens for summer days."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland on the estate are ideal for dog walking so you'll probably meet plenty of other owners on your visit. You are asked to keep them under close control because of the livestock present on the grounds. On the lakeside walk please keep them on leads. The Farmyard cafe mentioned above is also dog friendly with doggy treats and even their own ice cream to purchase. Just south of Aylsham there's some nice dog walking trails to be found on Marsham Heath."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west you'll find the village of Heydon and the 16th century Heydon Hall. There's pleasant trails around the old estate, a 14th century church and a noteworthy 16th century pub to see in this interesting area. To the north west there's Mannington Hall and Gardens near Itteringham. The historic house is surrounded by lovely parkland with delightful gardens, woodland and a lake to see. The 18th century Wolterton Hall can also be visited in this area. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FWt8-4bBUI0",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Fisherman’s Car Park, Carr Lane, Blickling, Broadland, Norfolk, England, NR11 6PU, United Kingdom",
  "postcode": "NR11 6PU",
  "district": "Broadland",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "garden",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "bike hire",
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}