{
  "created_at": "2025-01-05T23:45:02.549176+00:00",
  "objectID": "a5fa51a5d9be3c7e306283b0dc015590",
  "ref": "toys-hill-walking-route",
  "title": "Toys Hill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Tanhouse_Wood_and_Fields_-_Toys_Hill_-_geograph.org.uk_-_151773.jpg",
  "nearby": [
    {
      "description": "Chartwell House",
      "objectID": "a789d4d8166e093437e9b254ea59063d",
      "ref": "chartwell-house-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Emmetts Garden",
      "objectID": "53cd14a886cb0d1b51a97b36c3740137",
      "ref": "emmetts-garden-walking-route"
    },
    {
      "description": "Sevenoaks",
      "objectID": "02f0bd75ca5973591691858c9766256c",
      "ref": "sevenoaks-walking-route"
    },
    {
      "description": "Octavia Hill Centenary Walk",
      "objectID": "69ca964ee94eeeb9abef52e1e7dcb5dd",
      "ref": "octavia-hill-centenary-walk"
    },
    {
      "description": "Weardale Walk",
      "objectID": "14207eb591443fc4731cfb171e301ac0",
      "ref": "weardale-walk-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a5fa51a5d9be3c7e306283b0dc015590.gpx",
  "_geoloc": {
    "lat": 51.2453543393,
    "lng": 0.1043905904
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Tanhouse_Wood_and_Fields_-_Toys_Hill_-_geograph.org.uk_-_151773.jpg",
      "title": "Nikki Mahadevan / Tanhouse Wood and Fields - Toys Hill, via Wikimedia Commons",
      "caption": "Tanhouse Wood and Fields - Toys Hill. This area consists of woodlands interdispersed with farmland. Tanhouse Wood can be seen along the left boundary of this photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Toys_Hill_-_site_of_Weardale_Manor_-_geograph.org.uk_-_34587.jpg",
      "title": "Nigel Freeman / Toys Hill - site of Weardale Manor, via Wikimedia Commons",
      "caption": "Site of Weardale Manor. At the top of Toys Hill was sited a very grand house built in 1906 for Lord and Lady Weardale and used by them as their summer home. It had commanding views but sadly fell into neglect and was bequeathed to the National Trust and the land flattened. There are a number of footpaths around this spot. Unfortunately the beautiful views are mainly hidden due to the trees and vegetation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Oast_House_at_Toys_Hill_Farmhouse%2C_Brasted%2C_Kent_-_geograph.org.uk_-_1296819.jpg",
      "title": "Oast House Archive / Oast House at Toys Hill Farmhouse, Brasted, Kent, via Wikimedia Commons",
      "caption": "Oast House at Toys Hill Farmhouse, Brasted, Kent Single round kiln oast house. Grade II listed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Looking_towards_Ide_Hill_-_geograph.org.uk_-_34582.jpg",
      "title": "Nigel Freeman / Looking towards Ide Hill, via Wikimedia Commons",
      "caption": "Looking towards Ide Hill. From Toys Hill you can get some views to the East towards Ide Hill. The spire of Ide Hill church is just visible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Toy%27s_Hill_Troposcope_-_geograph.org.uk_-_1757281.jpg/512px-Toy%27s_Hill_Troposcope_-_geograph.org.uk_-_1757281.jpg",
      "title": "David Anstiss / Toy's Hill Troposcope, via Wikimedia Commons",
      "caption": "Toy's Hill Troposcope This direction pointer is in the National Trust land of Toy's Hill. On the top is a steel round plate with distances to local and national features around. On the side is a plaque which reads 'These 19 acres were give to the National Trust in 1935 in Memory of John and Mary Standsfields Williams of Boones Park, Edenbridge, Kent. By their daughter Theresa Standsfield, wife of Whastie Kennedy of Dunure Leamington'. Note this object is shown on the map as a Trig point, it has obviously replaced the triangulation pillar."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Toy%27s_Hill_Information_Panel_-_geograph.org.uk_-_1757255.jpg/512px-Toy%27s_Hill_Information_Panel_-_geograph.org.uk_-_1757255.jpg",
      "title": "David Anstiss / Toy's Hill Information Panel, via Wikimedia Commons",
      "caption": "Toy's Hill Information Panel There are two of these panels on the edge of the car park on Toy's Hill road. One on the north end, and this one at the south end. This one is also beside the Greensand Way (long distance path) heading through the National Trust land towards French Street. The panel shows many routes around the ancient common land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Toy%27s_Hill_Car_Park_-_geograph.org.uk_-_1499399.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Toy's Hill Car Park Large car park for visiting Toy's Hill woods. Managed by the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Greensand_Way_in_Toy%27s_Hill_-_geograph.org.uk_-_1757287.jpg/512px-Greensand_Way_in_Toy%27s_Hill_-_geograph.org.uk_-_1757287.jpg",
      "title": "David Anstiss / Greensand Way in Toy's Hill, via Wikimedia Commons",
      "caption": "Greensand Way in Toy's Hill. The long distance path heads through the National Trust land via a bridleway towards French Street."
    }
  ],
  "distance_km": 6.0,
  "description": "Visit the highest point on the Kent Downs on this circular walk in Sevenoaks. There's hundreds of acres of woodland to explore with wonderful views over the Weald of Kent. This circular walk starts at the National Trust car park and follows footpaths to the Toys Hill viewpoint where you can stop and soak in the views over the Kent countryside. The route then heads along Scords Lane and Scords Wood where you pick up the Greensand Way to take you to the village of Ide Hill. On this section you will pass the memorial bench to Octavia Hill, founder of the National Trust. The area is one of the National Trust's first properties with the estate now occupying more than 200 acres. The pretty village of Ide Hill marks the half way point on the walk so it's a nice place to stop for refreshments. Ide hill has a nice village green and the 19th century St Mary's church, the highest church in Kent. After leaving Ide Hill you head to the beautiful Emmetts Garden. The 19th century garden contains many exotic trees and shrubs from around the world. From here you head back to the car park via Scord Wood. This route is designed for walking but you can also bring your bike to Toys Hill and pick up one of the bridleways through the woods. If you head along Scords Lane you can pick up a bridleway taking you through Scords Wood to Emmetts Garden. If you would like to continue your walking in the area then you could head along the Greensand Way to the nearby Chartwell House. Our 8 mile Westerham Circular Walk visits the hill and Chartwell from the town centre.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Weardale Walk also passes the hill. The waymarked trail visits the historic Weardale Manor Ruins where you can enjoy more splendid views over the area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4labpqnCyWw",
  "postcode": "TN16 1QG",
  "district": "Sevenoaks",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "National Trust Toys Hill, Chart Lane, Toy's Hill, Brasted, French Street, Sevenoaks, Kent, England, TN16 1QG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites",
    "gardens"
  ],
  "facilities": [
    "car park",
    "village green",
    "church"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}