{
  "created_at": "2025-01-06T03:01:13.690808+00:00",
  "objectID": "a5fdc9bdb08c374755affb174850db71",
  "ref": "abergavenny-sugarloaf-walk-walking-route",
  "title": "Abergavenny Sugarloaf Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/86/Abergavenny_bridge-geograph.org.uk-2157811.jpg",
  "nearby": [
    {
      "description": "Pontypool",
      "objectID": "68c1df86926be190277ab87a25a73a93",
      "ref": "pontypool-walking-route"
    },
    {
      "description": "Raglan",
      "objectID": "617e062e1a985b20bdc8d3491ec0dc1f",
      "ref": "raglan-walking-route"
    },
    {
      "description": "Blaenavon",
      "objectID": "2981631a331c3b16ae6d75f34ec67491",
      "ref": "blaenavon-walking-route"
    },
    {
      "description": "Goytre Wharf",
      "objectID": "a3ca2d49b4d68dc3a957c610ebdad343",
      "ref": "goytre-wharf-walking-route"
    },
    {
      "description": "Gilwern",
      "objectID": "7b00d52f1b2a6ddf63cddedd422c2c9a",
      "ref": "gilwern-walking-route"
    },
    {
      "description": "Llanfoist Canal Walk",
      "objectID": "308f970855a9b8d1765bf97edd14f31e",
      "ref": "llanfoist-canal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a5fdc9bdb08c374755affb174850db71.gpx",
  "_geoloc": {
    "lat": 51.8205292603,
    "lng": -3.0165888456
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Abergavenny_bridge-geograph.org.uk-2157811.jpg",
      "title": "Jaggery / Stone bridge across the Usk, Abergavenny, via Wikimedia Commons",
      "caption": "Abergavenny Bridge over the River Usk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Sugarloaf_Mountain_above_Abergavenny_%2830251942556%29.jpg/512px-Sugarloaf_Mountain_above_Abergavenny_%2830251942556%29.jpg",
      "title": "Paul Stephenson from London [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Sugarloaf Mountain above Abergavenny"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/The_Summit_of_the_Abergavenny_Sugar_Loaf_-_geograph.org.uk_-_555189.jpg",
      "title": "Roy Parkhouse / The Summit of the Abergavenny Sugar Loaf, via Wikimedia Commons",
      "caption": "The Summit of the Abergavenny Sugar Loaf. Looking east. The Skirrid can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/The_Sugar_Loaf%2C_near_Abergavenny_-_geograph.org.uk_-_129254.jpg",
      "title": "John Thorn / The Sugar Loaf, near Abergavenny, via Wikimedia Commons",
      "caption": "The Sugar Loaf, near Abergavenny. Photographed from the Skirrid, about four miles away to the east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Mynydd_Llanwenarth_-_geograph.org.uk_-_447480.jpg",
      "title": "Stuart Wilding / Mynydd Llanwenarth, via Wikimedia Commons",
      "caption": "Taken from the ridge of Mynydd Llanwenarth which leads up to the Sugar Loaf. In the distance can be seen Mynydd Llangatwg."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Sugar_Loaf_-_geograph.org.uk_-_447466.jpg",
      "title": "Stuart Wilding / Sugar Loaf, via Wikimedia Commons",
      "caption": "Sugar Loaf. As seen from the ridge of Mynydd Llanwenarth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/South_East_slope_of_Sugar_Loaf_-_geograph.org.uk_-_447525.jpg",
      "title": "Stuart Wilding / South East slope of Sugar Loaf, via Wikimedia Commons",
      "caption": "South East slope of Sugar Loaf In the distance you can just make out Abergavenny, whilst the conical hill is Ysgyryd Fach. The pole in the foreground denotes a gas pipeline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Sugar_Loaf_Mountain_-_geograph.org.uk_-_1538717.jpg",
      "title": "RAY JONES / Sugar Loaf Mountain, via Wikimedia Commons",
      "caption": "Sugar Loaf Mountain A very frosty Winter morning. The mountain in the back ground is the Sugar Loaf Mountain.It stands 2 miles North West of Abergavenny. It's a very prominent landmark from all directions, it is 1961 feet high, so based on that I estimate this Radiation fog is 1600 feet thick."
    }
  ],
  "distance_km": 11.5,
  "description": "This epic circular walk takes you to the summit of Sugarloaf Mountain from the town of Abergavenny. The distinctive hill is a prominent landmark in all directions and a very worthy climb. It's a challenging 7 mile hike with tremendous views for most of the way. Start the walk in the centre of Abergavenny, near to the bus station and priory. You can then follow roads north through the town to Cantref and Llywyndu. Country lanes here will lead you to the footpaths which will take you up to the Sugarloaf summit which stands at a height of 1,955 feet (596 metres). The far ranging views encompass the Usk Valley, Severn Estuary, the Cotswolds to the east, the Brecon Beacons including Pen y Fan and Corn Du to the west and the Bristol Channel to the south. After taking in the views you descend to the west and then south to the lovely Mynydd Llanwenarth ridge. After descending the ridge you then pick up the same country lanes and roads to take you back into the centre of Abergavenny. To continue your walking around the town you could try the climb to Skirrid Fawr which starts in Abergavenny. You could also pick up the long distance Brecon Beacons Way which runs through the area. For an alternative circular route try our Sugarloaf Mountain Walk which starts from the car park at the base of the hill.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The neighbouring town of Bleanavon is located just a few miles south west of the town. You can explore the worthy town on the circular Blaenavon Walk. The area is a UNESCO World Heritage Site which includes a fascinating industrial museum and a wonderful heritage steam railway. You could catch the railway south and visit Pontypool where there's the extensive Pontypool Park to explore. You can also pick up the Monmouthshire and Brecon Canal here and follow it south to the popular Goytre Wharf. Heading west along the towpath will take you to the pretty Gilwern Wharf where there's some lovely scenery and a fine canalside pub. Head south east of the town and you could visit the ruins of Raglan Castle. The 15th century fortress is considered one of the grandest castles in the country.  To the west you'll find the splendid Clydach Gorge. The scenic steep-sided valley is where the River Clydach flows to the River Usk. The epic Cambrian Way passes over the mountain. The long distance waymarked route starts from the city of Cardiff and runs for nearly 300 miles through the Brecon Beacons, the Cambrian Mountains and Snowdonia before finishing on the North Wales coast at Conwy. For more walking ideas in the area see the Brecon Beacons Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/yzJI4oJaxjQ",
  "postcode": "NP7 5EW",
  "district": "Abergavenny / Y Fenni",
  "county": "Sir Fynwy - Monmouthshire",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}