{
  "created_at": "2025-01-06T10:53:07.799199+00:00",
  "objectID": "a6cd65f420ceeb43ed78b2bab0083498",
  "ref": "hale-lighthouse-walking-route",
  "title": "Hale Lighthouse Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/05/Saltmarsh_and_mudbanks_at_Hale_point_-_geograph.org.uk_-_40613.jpg",
  "nearby": [
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "St Helens",
      "objectID": "aa8dab5e80773f6d00e0f3fd95895710",
      "ref": "st-helens-walking-route"
    },
    {
      "description": "Speke Hall",
      "objectID": "e3dfa01fd178f1c058f4bedcc2f053ac",
      "ref": "speke-hall-walking-route"
    },
    {
      "description": "Mersey Way",
      "objectID": "479b428bfe6e07a11348304217ee7a32",
      "ref": "mersey-way-walking-route"
    },
    {
      "description": "Warrington",
      "objectID": "ccf37fb2245bb902887a8a00746a2abb",
      "ref": "warrington-walking-route"
    },
    {
      "description": "Helsby Hill",
      "objectID": "2e2e4a364df39bea8f3daf74eb7acf80",
      "ref": "helsby-hill-walking-route"
    },
    {
      "description": "Sutton Manor",
      "objectID": "5e249ba842e7d1896b2007adc2c5ea55",
      "ref": "sutton-manor-walking-route"
    },
    {
      "description": "Clock Face Country Park",
      "objectID": "445bb94100735160cfe3df828c8d7a91",
      "ref": "clock-face-country-park-walking-route"
    },
    {
      "description": "Colliers Moss Common",
      "objectID": "f8b3ffd293c9fb5c85906aa91e4ccc5b",
      "ref": "colliers-moss-common-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a6cd65f420ceeb43ed78b2bab0083498.gpx",
  "_geoloc": {
    "lat": 53.3349707466,
    "lng": -2.7989926784
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Saltmarsh_and_mudbanks_at_Hale_point_-_geograph.org.uk_-_40613.jpg",
      "title": "Sue Adair / Saltmarsh and mudbanks at Hale point",
      "caption": "Saltmarsh and mudbanks at Hale point. Taken near the lighthouse at Hale, a peaceful spot. The Mersey, here at its widest point, sweeps round in a deep channel leaving mudbanks at low tide which are popular with wading birds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Backless_bench_beside_the_Mersey_Way%2C_Hale_-_geograph.org.uk_-_496184.jpg",
      "title": "Mike Harris / Backless bench beside the Mersey Way, Hale",
      "caption": "Backless bench beside the Mersey Way, Hale. View across the Mersey to the Stanlow oil refineries. The top of Hale lighthouse is just visible behind the big tree."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Lighthouse_at_Hale_point_-_geograph.org.uk_-_40618.jpg",
      "title": "Sue Adair / Lighthouse at Hale point",
      "caption": "Hale Head Light, Merseyside (Liverpool Area). Lighthouse at Hale point. Standing on a sandstone cliff, the present Hale Lighthouse dates from 1906. It replaced a shorter tower built seventy years earlier. The 45 ft tower put the lamp chamber 70ft above mean sea level, which is not much as lighthouses go. Yet the lamp's beam could be seen from as far away as forty miles. Unfortunately, it's now many years since the lighthouse was operational. Its 250 candlepower oil lamp last shone out in 1958, when it was tentatively decommissioned on a trial basis. The trial became permanent and the lighting equipment was removed. It is now a private residence. Note Helsby Hill in the distance and the stacks and towers of Stanlow Oil Refinery on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Hale_-_view_from_Hale_Head_-_geograph.org.uk_-_226569.jpg",
      "title": "Mike Harris / Hale - view from Hale Head",
      "caption": "The view from Hale Head. View across River Mersey from the Mersey Way east of Hale Head. Salt marsh in the foreground, below the low sandy cliffs. Ineos Chlor (former ICI) Castner-Kellner chloralkali works at Runcorn with Runcorn Hill beyond. The lighthouse is some 250m behind the photographer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Hale_Lighthouse_and_Mersey_vista_-_geograph.org.uk_-_40621.jpg",
      "title": "Sue Adair / Hale Lighthouse and Mersey vista",
      "caption": "Hale Lighthouse and Mersey vista. Looking back to Hale lighthouse and the widest part of the Mersey from the footpath at the edge of Hale Cliff. Bales of hay in the right foreground and saltmarsh to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Incoming_High_Tide_from_Clifftop_Walk_-_geograph.org.uk_-_683718.jpg",
      "title": "Sue Adair / Incoming High Tide from Clifftop Walk",
      "caption": "Incoming High Tide from Clifftop Walk. High Tide from the clifftop Mersey Way above Dungeon Marsh, just west of the lighthouse. The saltmarsh is almost covered by the tide and shelduck paddle round while the curlews and redshanks sit in the fields nearby waiting for the water to recede."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Hale_Manor_House.jpg",
      "title": "Sue Adair / Hale House, Hale Village",
      "caption": "Hale House in the village. Also known as the Manor House, this large house was originally a parsonage. It has a facade of local sandstone, added in the 18th century, which hides two brick built houses, the gable of one dates back to the 17th century. It is situated near St Mary's church and was the first house in Lancashire to have sash windows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Thatched_cottage%2C_Hale_Village_-_geograph.org.uk_-_40459.jpg",
      "title": "Sue Adair / Thatched cottage, Hale Village",
      "caption": "Thatched cottage in the village. This cottage is near the junction of Hale Road with Ramsbrook Lane, it is one of many thatched cottages in the village only a mile from Liverpool John Lennon airport."
    }
  ],
  "distance_km": 4.0,
  "description": "This circular walk visits the Hale Lighthouse on the River Mersey in Cheshire. The lighthouse is a popular place for a walk with some splendid coastal scenery to enjoy. The walk starts in the village of Hale where you can follow footpaths down to the River Mersey. Here you'll find the lighthouse which sits on a sandstone cliff overlooking the beaches and saltmarsh of the river. Historically the structure used to mark the southernmost point in Lancashire. It was established in 1838 and then modified to its current state in 1906. You can then enjoy a walk along the cliff top path where you can look out for a variety of wading birds along the river. There are fine views here over Dungeon Banks and Eastham Sands to Ellesmere Port on the opposite side.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the excellent Childe of Hale for some post walk refreshment. The pub is named after John Middleton, a local giant, born in the village in the 16th century. He is thought to have been one of the tallest people in history at over 9 feet tall. Today the associated pub serves quality food and has a good sized garden area for warmer days. You can find them opposite the war memorial at 6 Church End with a postcode of L24 4AX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal paths make for a fine bracing dog walk and the Child of Hale pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Trans Pennine Trail and the Mersey Way run through the area, providing an opportunity to extend your walking on waymarked trails. If you follow them east they will take you into Widnes while heading west will take you towards John Lennon Airport and the splendid Speke Hall. Heading east will take you along the river to Widnes and Warrington. Head few miles north and you could visit the popular Stadt Moers Park where there's lakes, meadows, woodland and cycle trails to enjoy. For more walking ideas in the area see the Merseyside Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8HnxdX-TNEw",
  "county": "Halton",
  "region": "Liverpool City Region",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Town Lane, Hale, Halton, Liverpool City Region, England, L24 4AE, United Kingdom",
  "postcode": "L24 4AE",
  "district": "Hale",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "cliff"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}