{
  "created_at": "2025-01-06T05:01:16.639615+00:00",
  "objectID": "a6db0d8bebbb05d03c70de5e5312ac3d",
  "ref": "chiddingfold-walking-route",
  "title": "Chiddingfold Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Chiddingfold_Pond_and_Church_-_geograph.org.uk_-_291836.jpg",
  "nearby": [
    {
      "description": "Hydon's Ball and Hydon Heath",
      "objectID": "6b5b6398c98a8bde045d5164611cc2ff",
      "ref": "hydons-ball-and-hydon-heath-walking-route"
    },
    {
      "description": "Winkworth Arboretum",
      "objectID": "65a86da0feea713f7e6f7f78b33214a5",
      "ref": "winkworth-arboretum-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Hambledon",
      "objectID": "72a000e2019e982b0a45b58820730cd2",
      "ref": "hambledon-walking-route"
    },
    {
      "description": "Witley and Milford Common",
      "objectID": "12d0a928192e177956627e4407761818",
      "ref": "witley-and-milford-common-walking-route"
    },
    {
      "description": "Thursley National Nature Reserve",
      "objectID": "0f7544fe60a0eaa219447abaa62f9af3",
      "ref": "thursley-national-nature-reserve-walking-route"
    },
    {
      "description": "Godalming",
      "objectID": "cd1a41646f70692d1facadb6daac12e1",
      "ref": "godalming-walking-route"
    },
    {
      "description": "Hascombe Hill",
      "objectID": "7e2458c23b3e5d4e380a11d094e339dd",
      "ref": "hascombe-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a6db0d8bebbb05d03c70de5e5312ac3d.gpx",
  "_geoloc": {
    "lat": 51.1163641436,
    "lng": -0.6367006765
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Chiddingfold_Pond_and_Church_-_geograph.org.uk_-_291836.jpg",
      "title": "Colin Smith / Chiddingfold Pond and Church",
      "caption": "Chiddingfold Pond and Church. Twilight reflections in the village pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Ramster_gardens%2C_Chiddingfold_%28geograph_2382424%29.jpg/512px-Ramster_gardens%2C_Chiddingfold_%28geograph_2382424%29.jpg",
      "title": "Colin Smith / Ramster gardens, Chiddingfold",
      "caption": "Ramster gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Swan_Inn%2C_Chiddingfold_-_geograph.org.uk_-_291744.jpg",
      "title": "Colin Smith / Swan Inn, Chiddingfold",
      "caption": "Swan Inn.The inn is in a terrace of traditional Surrey tile-hung buildings. The other buildings are occupied by the village butcher's shop and cottages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Chiddingfold%2C_Crown_Inn_-_geograph.org.uk_-_255189.jpg",
      "title": "Colin Smith / Chiddingfold, Crown Inn",
      "caption": "Chiddingfold, Crown Inn. This half-timbered inn is reputed by some to be Surrey's oldest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/The_Square%2C_Wormley_-_geograph.org.uk_-_761440.jpg",
      "title": "Talisman / The Square, Wormley",
      "caption": "The Square, Wormley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/High_Street%2C_Hambledon_%28geograph_3907969%29.jpg",
      "title": "David Martin / High Street, Hambledon",
      "caption": "High Street, Hambledon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Footpath_crossing_field_to_Hydon_Heath_-_geograph.org.uk_-_1036839.jpg",
      "title": "Shazz / Footpath crossing field to Hydon Heath",
      "caption": "Footpath crossing field to Hydon Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Bluebells_at_Winkworth_Arboretum._-_geograph.org.uk_-_136566.jpg",
      "title": "Colin Smith / Bluebells at Winkworth Arboretum.",
      "caption": "Bluebells at Winkworth Arboretum."
    }
  ],
  "distance_km": 18.0,
  "description": "This pretty Surrey based village is located in the Waverley area of the county. There's a nice village green, a beautiful landscaped open garden and one of the oldest pubs in England to see here. For walkers there's miles of good trails in the surrounding countryside and woodland. This circular walk from the village visits the neighbouring village of Wormley before heading to two of the highlights of the area at Hydon's Ball and Winkworth Arboretum. It uses a mixture of public footpaths, bridleways and sections of the epic Greensand Way. The walk starts in the village and follows country paths north to Wormley. Here you pick up the Greensand Way and follow it north east to Hambledon. Here you could stop off at the 16th century Merry Harriers pub which includes a Llama paddock out the back. The route then continues to the National Trust's Hydon's Ball and Hydon Heath. The hill top stands at a height of 179 m (587 ft) and includes a stone seat memorial to Octavia Hill, one of the founders of the National Trust. You can stop here and enjoy the wonderful views towards the South Downs. From the heath you head north east to Busbridge Woods before coming to Winkworth Arboretum. The stunning arboretum includes a series of surfaced footpaths, landscaped lakes, bluebell woods and over 1,000 different shrubs and trees. Head south from the Arboretum and you will pass Hascombe before picking up the Greensand Way again. Follow it west and it will take you past Vann Hill to Hambledon. Here you head south past Beech Hill before following woodland trails to Hambledon Hurst and the Nutbourne Cottages. You can then follow footpaths west past Nutbridge House to return to Chiddingfold. To continue your walking around the village head to the delightful Ramster Garden. The 20 acre landscaped garden includes flower collections, a woodland walk, and water features.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Crown Inn for some refreshment after your walk. The 14th-century Wealden building includes huge oak beams, reclaimed from old sailing ships, sloping floors, warm oak panels, vintage-style chairs, a 1614-stone fireplace and stunning stained-glass windows. For warmer days there's a pleasant courtyard garden to sit out in. They serve high quality food with an extensive menu including Thai Takeaways. You can find them next to the Green at postcode GU8 4TX for your sat navs. Also of interest is the White Horse in Hascombe. The old coaching inn dates to the 16th century and serves high quality dishes. There is also a lovely garden area for warmer days. You can find them at postcode GU8 4JA for your sat navs. The village is also worth exploring with the historic St Peter's Church, the village green, a fountai and a pretty pond."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland, countryside and heathland on the route are ideal for dog walking. You are asked to keep them on leads at Winkworth though. The Crown Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles north west of the village there's Witley and Milford Common and Thursley National Nature Reserve to explore. The reserve has a network of footpaths and is considered one of the finest areas in the country for wildlife. The circular Godalming Walk can also be picked up near Winkworth to explore some of the other local highlights. Near Hascombe you can enjoy a climb to Hascombe Hill. Here you will find an ancient Iron Age Hillfort and a photogenic stone circle built by the Megalithic Order of Druids in 1995/97. For an alternative walk from the village see the informative video below. For more walking ideas in the area see the Surrey Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/VH6_sWvrPMo",
  "district": "Chiddingfold",
  "county": "Surrey",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}