{
  "created_at": "2025-01-05T23:35:33.290198+00:00",
  "objectID": "a702e920b0e3bab67144bf63dc2241de",
  "ref": "pwllheli-walking-route",
  "title": "Circular Walk around Pwllheli Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Pwllheli_Harbour_-_geograph.org.uk_-_27121.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a702e920b0e3bab67144bf63dc2241de.gpx",
  "_geoloc": {
    "lat": 52.88788112,
    "lng": -4.41734075
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Pwllheli_Harbour_-_geograph.org.uk_-_27121.jpg",
      "title": "David Medcalf / Pwllheli Harbour, via Wikimedia Commons",
      "caption": "Pwllheli Harbour. The Cambrian Coast Railway crosses the bridge in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Harbwr_Pwllheli_Harbour_-_geograph.org.uk_-_373364.jpg",
      "title": "Alan Fryer / Harbwr Pwllheli Harbour, via Wikimedia Commons",
      "caption": "Pwllheli Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/L%C3%B4n_Cob_Bach_Pwllheli_-_geograph.org.uk_-_373366.jpg",
      "title": "Alan Fryer / Lôn Cob Bach Pwllheli, via Wikimedia Commons",
      "caption": "Lôn Cob Bach Pwllheli. Lôn Cob Bach separates Harbwr Bach (the little harbour) from the reclaimed land between here and the sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Walkway_across_the_Lon_Cob_Bach_Nature_Reserve_-_geograph.org.uk_-_664181.jpg",
      "title": "Eric Jones / Walkway across the Lon Cob Bach Nature Reserve, via Wikimedia Commons",
      "caption": "Walkway across the Lon Cob Bach Nature Reserve. The Lon Cob Bach Nature Reserve is located in the wetlands of Afon Rhydhir. The walkway also acts as an improved path between the town centre and Marian-y-mor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Afon_Rhydhir_a_Bwrdd_Gwybodaeth_Pwllheli_Afon_Rhydhir_and_Information_Board_-_geograph.org.uk_-_543054.jpg",
      "title": "Alan Fryer / Afon Rhydhir a Bwrdd Gwybodaeth Pwllheli Afon Rhydhir and Information Board, via Wikimedia Commons",
      "caption": "Afon Rhydhir and Information Board. The Afon Rhydhir flows into Pwllheli harbour from the west. The area has recently been developed as a town-centre nature reserve around Lôn Cob Bach"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Traeth_Glandon_Pwllheli_Glandon_Beach_-_geograph.org.uk_-_812970.jpg",
      "title": "Alan Fryer / Traeth Glandon Pwllheli Glandon Beach, via Wikimedia Commons",
      "caption": "Traeth Glandon Pwllheli Glandon Beach. Access to Glandon - Abererch beach at Pwllheli"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Kayak_on_Pwllheli_beach._-_geograph.org.uk_-_1477009.jpg",
      "title": "Nick R / Kayak on Pwllheli beach., via Wikimedia Commons",
      "caption": "Kayak on Pwllheli beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Pwllheli_Stryd_Penlan.jpg/256px-Pwllheli_Stryd_Penlan.jpg",
      "title": "Alison Pryce [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stryd Penlan, Pwllheli. The red brick building on the left is the theatre and cinema. On the opposite side of the road, the white building is the oldest pub, the Penlan Fawr, dating from the early seventeenth century."
    }
  ],
  "distance_km": 5.5,
  "description": "This circular walk takes you around the town of Pwllheli on the Llyn Peninsula. On the walk you'll visit the harbour, beach, the River Rhydir and the Lon Cob Bach Nature Reserve. Pwllheli is considered the the main town of the peninsula, with a train station and a range of shops and other services. The walk starts from the train station and heads south to the front where there are two blue flag beaches. You then head west along the beach before following a footpath north to the River Rhydir and the Lon Cob Bach Nature Reserve. There's some nice walkways here with interesting flora and fauna to look out for. You continue east through the town to the Inner Harbour where there's a nice path to follow to South Beach. You then retrace your steps to return to the train station and the finish point of the walk. To continue your walking in the area pick up the Llyn Coastal Path which runs through the town. Heading east will take you to Criccieth with its historic castle and the grave of former Prime Minister David Lloyd George in neighbouring Llanystumdwy. Heading west will take you to the beautiful National Trust beach at Llanbedrog before coming to Abersoch where you can visit the southernmost point of the peninsula at Cilan Head.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head west along the Wales Coast path you could visit the National Trust's Plas yn Rhiw. The picturesque 17th century manor house is surrounded by some beautiful ornamental gardens with great views over Cardigan Bay and Hell's Mouth from the elevated position of the house. Head a few miles north and you can explore the northern side of the peninsula and visit Nefyn,Porthdinllaen, Yr Eifl and Trer Ceiri. The unusual landscape at the Trefor Quarry can also be visited near here. The Garn Boduan Walk starts from nearby Nefyn. It will take you up to the viewpoint and Iron Age Hill fort located just south of the settlement. Head inland and there's climb to the remote Garn Fadryn. There's an Iron Age Hillfort and some incredible views from the top of this peaceful hill."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1vXpzEeYHO8",
  "district": "Pwllheli",
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Maes yr Orsaf, Pwllheli, Gwynedd, Cymru / Wales, LL53 5HG, United Kingdom",
  "postcode": "LL53 5HG",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "urban"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "beach"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "pub/cafe",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}