{
  "created_at": "2025-01-05T22:31:08.674278+00:00",
  "objectID": "a818937986884063f252277c9055026b",
  "ref": "nostell-priory-walking-route",
  "title": "Nostell Priory Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Nostell_Priory.jpg",
  "nearby": [
    {
      "description": "Anglers Country Park",
      "objectID": "f6a4a22fca0f8b1525f2c75cbaa9d681",
      "ref": "anglers-country-park-walking-and-cycle-route"
    },
    {
      "description": "Barnsley Canal",
      "objectID": "bb0aed1edc31fff703289a79911dd6ec",
      "ref": "barnsley-canal-walking-and-cycle-route"
    },
    {
      "description": "Wintersett Reservoir",
      "objectID": "e7401baaf8b91e9ee164c4a31f913d15",
      "ref": "wintersett-reservoir-walking-route"
    },
    {
      "description": "Haw Park Wood",
      "objectID": "0c371f50b85dc8c12eafa0820a569c15",
      "ref": "haw-park-wood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a818937986884063f252277c9055026b.gpx",
  "_geoloc": {
    "lat": 53.6530278741,
    "lng": -1.3889853007
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Nostell_Priory.jpg",
      "title": "John Davidson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Nostell Priory, 18th-century architectural masterpiece with Adam interiors. The construction of the new house at Nostell Priory was initiated by Sir Rowland Winn, 4th baronet (1706-1765). His family had been in possession of Nostell since the mid-17th century. The original design was conceived by gentleman-architect Col. James Mosyer, with later modifications made by James Paine. Paine continued to work at Nostell for an impressive three decades. Concurrently, the estate underwent extensive landscaping efforts, including the creation of lakes and plantations. Upon Sir Rowland's passing in 1765, he was succeeded by his son, also named Rowland (1739-1785), the fifth baronet. It was this Rowland who invited the renowned architect Robert Adam to contribute to the development of Nostell. Adam's involvement included the remodeling of the stables, the creation of stunning interiors, initiation of ambitious, though largely unrealized, additions to the house, and the design of new lodges on the estate. The collaboration with Adam significantly impacted the architectural and aesthetic character of Nostell Priory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Obelisk_Gatehouse%2C_Nostell_Priory_%28geograph_4227067%29.jpg/512px-Obelisk_Gatehouse%2C_Nostell_Priory_%28geograph_4227067%29.jpg",
      "title": "Rich Tea / Obelisk Gatehouse, Nostell Priory",
      "caption": "Obelisk Lodge. This structure was built in the 17th century, and was still inhabited up to the late 1950s. The gatehouse was previously used as the main entrance to the parkland until 1866 when the building of Nostell train station prompted the use of the entrance by Wragby Lodge via the A638. In the 18th century, the terms \"obelisk\" and \"pyramid\" were often used interchangeably. Hence, although today we might perceive the structure as pyramidal, it was referred to as the Obelisk Lodge. In 1776, Robert Adam created plans for the 'Gateway for the Park,' and construction commenced promptly. Original drawings by Adam indicate that a pair of sphinx were intended to adorn the terminating points of the flanking walls, but if they were ever installed, their current whereabouts are unknown. The driveway passing through the lodge was traversed by traffic coming from the significant Pontefract to York road. Passing through this monumental lodge in carriages must have been an exhilarating experience for visitors. The route led them to sweep down over the end of the lake before ascending again, offering a splendid view of the mansion.The Lodge originally provided accommodation for the gatekeeper, featuring two small rooms flanking the pyramid. As the 19th century ushered in the era of railways, the lodge's role diminished, and the services of a gatekeeper were no longer essential. Records indicate that, in subsequent years, various occupants, including a colliery laborer, a stonemason's laborer, and gamekeepers (given its strategic position for spotting poachers entering the park), resided there. Locally, the lodge became known as the Needle's Eye, possibly due to its resemblance to the arch-pierced pyramid at Wentworth Woodhouse, approximately 15 miles away. Despite serving as a family home until the 1950s, the lodge fell into disrepair once vacant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Nostell_Priory_Lower_Lake_-_geograph.org.uk_-_1640438.jpg",
      "title": "John Fielding / Nostell Priory Lower Lake",
      "caption": "Lower Lake. Photo taken from footbridge between Upper and Lower Lakes. Nostell Priory encompasses 121 hectares (300 acres) of parkland, featuring lakeside walks, woodlands, and expansive lawns. The house's main facade is oriented eastward, offering a picturesque view across a grass vista. On the west side, the house opens up to the west lawn, leading down to the lake. The parkland provides various trails, including lakeside and woodland walks, views of the druid's bridge, and paths leading to the restored Obelisk Lodge—a gatehouse situated in the parklands. Additionally, there are walks through wildflower meadows. The National Trust acquired the park from Lord St Oswald with support from the Heritage Lottery Fund, facilitating the purchase of artworks, books, and furniture from the family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Autumn_at_Nostell_Priory_Middle_Lake_-_geograph.org.uk_-_1527312.jpg",
      "title": "John Fielding / Autumn at Nostell Priory Middle Lake",
      "caption": "Autumn at Nostell Priory Middle Lake. The stone bank of the NE corner can be seen bottom left hand, the pic was taken from track above the Lower Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Wild_flower_meadow%2C_Nostell_-_geograph.org.uk_-_1353904.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wild flower meadow. Looking towards Obelisk Lodge. The parkland is covered in lovely wildflowers during the summer months. The main lawn and the lower fields to the east of Nostell Priory have served as venues for various events, with notable significance in the year 2000. Central Yorkshire Scout County selected Nostell Priory as the location for its \"Millennium Camp,\" attracting around 2500 participants from the Yorkshire Scouting movement. In preparation for this event, lasting 12 months, Yorkshire Water employee Jon Potter successfully advocated for the donation and installation of subterranean high-pressure water mains and stand-pipe points across the eastern grounds. This corporate donation was unprecedented, providing essential infrastructure improvements for the Priory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/St_Michael_and_Our_Lady_Wragby_-_geograph.org.uk_-_827139.jpg",
      "title": "John Fielding / St Michael & Our Lady Wragby",
      "caption": "The Parish church of St Michael and Our Lady Wragby. The church stands at the entrance to the priory grounds. Constructed with coursed squared sandstone, the building features distinct architectural elements, including an aisled chancel, aisled nave, a south porch, a west tower, and a vestry. The church's construction primarily occurred during the 1520s-1530s, with the possibility that the west end of the nave and the tower might be slightly older. A vestry was added in 1825, contributing to the evolution of the structure. Noteworthy elements within the church include Romanesque sculptures found on a font and a reset slab. Despite their Romanesque style, these artifacts are not believed to be remnants of any earlier medieval church on the same site, emphasizing the historical development and changes the church has undergone over the centuries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Interior_of_Nostell_Priory_3.jpg/512px-Interior_of_Nostell_Priory_3.jpg",
      "title": "The wub, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Interior of Nostell Priory. The Priory, with its roots in the 12th-century Augustinian priory dedicated to St Oswald, transitioned through various historical phases. The priory thrived for over four centuries until Henry VIII's Dissolution of the Monasteries in 1540. After passing through different hands, it was acquired by the Winn family in 1654, marking the beginning of a long association that endured until Nostell Priory was eventually entrusted to the National Trust. The Winns, deriving wealth from the Tudor-era London textile trade, strategically invested in property and land in the subsequent century. The Nostell estate in Yorkshire became a significant part of their holdings, offering a stable source of income and elevating their social standing in a society that highly esteemed land ownership. In the early 18th century, the family, now firmly established in the gentry class and bearing knighthood, aspired to replace their existing residence with a fashionable house that would not only serve as a home but also convey a powerful message about their status. The result was Nostell Priory, a spectacular manifestation of their wealth and social standing, albeit at a considerable cost."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Nostell_Priory_-_geograph.org.uk_-_5495991.jpg",
      "title": "Nostell Priory by Tom Curtis, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The initial construction of the house was undertaken for Sir Rowland Winn, the 4th baronet, as a replacement for an existing house on the estate. This ambitious project, reflecting the architectural style known as Palladianism, was supervised by architect James Paine from the mid-1730s. Palladianism was in vogue during the early 18th century, valued for its perceived expression of order and stability. The decision to build such a grand house in the latest architectural style went beyond aesthetic considerations. It was also a strategic move to support Sir Rowland Winn's political aspirations in the region, providing a venue for entertainment and impressing guests. However, Sir Rowland's political ambitions did not materialize, and the scale and cost of the construction meant that the house was far from complete when he passed away in 1765. The 5th baronet, Sir Rowland Winn, and his wife Sabine d'Hervart, a Swiss heiress, took up the project with renewed energy. They engaged prominent figures like architect Robert Adam and craftsmen such as Thomas Chippendale and Joseph Rose. Designs were revised and expanded, especially after the birth of their son and heir in 1775. Despite financial constraints slowing progress, the 5th baronet's tragic death in a carriage accident in 1785 marked the end of construction work on Nostell Priory."
    }
  ],
  "distance_km": 3.0,
  "description": "Explore 300 acres of parkland and gardens surrounding this 18th-century treasure house near Wakefield. There are several beautifully laid out gardens including a formal rose garden, a recently planted orchard, a vegetable garden, the pleasure gardens and the menagerie gardens. In the parkland you can enjoy a waterside stroll along the two pretty lakes and a woodland stretch through Joiner's Wood. There's also the Obelisk Lodge, boathouse and the ha-ha. The house has grand rooms with furniture by Chippendale, a collection of paintings and a very special library. If you'd like to continue your day out then you could visit the nearby Anglers Country Park with its large lake and birdwatching opportunities. Adjacent to the park are also Wintersett Reservoir and Cold Hiendley Reservoir.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site Courtyard Cafe is a nice place to relax with refreshments after your exercise. They serve a good range of meals with many ingredients coming from their own kitchen garden. If you fancy a pub lunch then the Spread Eagle is conveniently located just to the east of the car park. They have a good menu and a lovely large garden area for warmer days. You can find them at Doncaster Road, Wragby with a postcode of WF4 1QX."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and parkland are ideal for dog walking so you'll probably see plenty of other dogs on your visit. There is also a dog enclosure where you can let your dog of the lead. The Spread Eagle pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles west of the site and you can pick up the Barnsley Canal. There's nice waterside paths here heading south through the peaceful woodland of Haw Park Wood to Royston."
    }
  ],
  "video_url": "https://www.youtube.com/embed/5Ne5awsNqXo",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Courtyard Café, Doncaster Road, Huntwick with Foulby and Nostell, Nostell, Wakefield, West Yorkshire, England, WF4 1QE, United Kingdom",
  "postcode": "WF4 1QE",
  "district": "Wakefield",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "waterfront",
    "garden"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "lake views"
  ],
  "facilities": [
    "car park",
    "boathouse"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "bird watching"
  ]
}