{
  "objectID": "a88281314cf19250c36f8c0c74ef5418",
  "created_at": "2024-12-19T14:46:40.102447+00:00",
  "ref": "solihull-walking-route",
  "title": "Solihull Walks - Canal and Country",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_Square%2C_Solihull_-_geograph.org.uk_-_63043.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/646AFAA025968D57862586710029931C/$FILE/Solihull.gpx",
  "_geoloc": {
    "lat": 52.4102219629,
    "lng": -1.7780510737
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_Square%2C_Solihull_-_geograph.org.uk_-_63043.jpg",
      "title": "David Stowell / The Square, Solihull",
      "caption": "The Square, Solihull. In the heart of the older part of the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Brueton_Park_-_geograph.org.uk_-_559259.jpg",
      "title": "David Stowell / Brueton Park",
      "caption": "Brueton Park Lake. An attractive park located in the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Elmdon_Park%2C_Solihull_-_geograph.org.uk_-_207690.jpg",
      "title": "John Evans / Elmdon Park, Solihull",
      "caption": "Elmdon Park, Solihull. The western side of Elmdon Park, Solihull. (Birmingham City Centre can be seen on the horizon)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Knowle_Locks_-_geograph.org.uk_-_1432517.jpg",
      "title": "Graham Butcher / Knowle Locks",
      "caption": "Knowle Locks. There is a flight of five locks to see at this photogenic site. You can also see the Grade I listed Grimshaw Hall in this area. The Tudor manor house was built around 1560 and is most visible during the winter months when the trees have thinned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Stratford-upon-Avon_Canal_at_Kingswood_Junction_-_geograph.org.uk_-_155807.jpg",
      "title": "David Stowell / Stratford-upon-Avon Canal at Kingswood Junction",
      "caption": "Stratford-upon-Avon Canal at Kingswood Junction. Looking along the canal towards Stratford-upon-Avon. Just below the lock, and to the left is a link across to the Grand Union canal. This was only recently re-instated to save water. Since the early days of the canal boats travelling from the GU had to go up one lock, do a U turn around Kingswood Junction and then drop back down this lock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Earlswood_Lakes_-_Engine_House_-_geograph.org.uk_-_81358.jpg",
      "title": "David Stowell / Earlswood Lakes - Engine House",
      "caption": "Earlswood Lakes - Engine House. The lakes are located a few miles south west of Solihull and are a popular place for walkers. Earlswood Lakes were built to provide water for the Stratford-upon-Avon Canal. This view is looking NW along to the dam towards the old engine house at the point at which the canal feeder leaves the lakes. The lakes are divided into three pools and the one seen here is known as Engine Pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Stratford_Canal%2C_Dickens_Heath%2C_near_Solihull_-_geograph.org.uk_-_965276.jpg",
      "title": "Roger  Kidd / Stratford Canal, Dickens Heath, near Solihull",
      "caption": "Stratford Canal, Dickens Heath nature reserve, near Solihull. Approaching some very \"ambitious\" apartment developments by the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Hillfield_Park_and_Widney_Woods_-_geograph.org.uk_-_717589.jpg",
      "title": "Robin Jones / Hillfield Park and Widney Woods",
      "caption": "Hillfield Park and Widney Woods Hillfield Park, with the woodland correctly named Parish Poles, and known locally as Widney Woods, in the background. Now public open space, it was until the 1970s used as a landfill site for Solihull's domestic waste. A tributary of the Cran Brook lies buried several feet below. It's located on the southern outskirts of the town."
    }
  ],
  "distance_km": 42.0,
  "description": "This large town is located in the West Midlands, near Birmingham. It is notable as the most affluent town in the West Midlands region and in 2013 was named the \"best place to live\" in the United Kingdom by a uSwitch Quality of Life survey. For walkers there's a wide range of options with two canals, local country parks, wildlife filled nature reserves, peaceful local woods, historic National Trust properties and several waymarked walks taking you into the surrounding Warwickshire countryside. This long circular walk explores the countryside, canals, villages and parks to the south of the town. You'll use sections of the waymarked Solihull Way , the Heart of England Way , the Grand Union Canal Walk and the Stratford Upon Avon Canal as you make your way through the area. Highlights on the route include the pretty village of Knowle , the National Trust's Baddesley Clinton , the bluebells in Hay Wood and the lovely Earlswood Lakes . The walk starts in the town centre where you can pick up the Solihull Way and follow the waymarked footpath north east to the Grand Union Canal, passing the pretty Malvern and Brueton Park on the way. Follow the towpath east and it will take you to Catherine-de-Barnes, Henwood Mill, Copt Heath, the Grade I listed Grimshaw Hall and Knowle. Here you'll pass a series of pretty locks on a particularly picturesque section of the canal. From Knowle you continue south past Netherwood Heath before coming to Kingswood. Here you can take slight detour east to visit Baddesley Clinton where you will find an historic moated manor house surrounded by lovely grounds which include a walled garden and a lake. Also near Kingswood there's another National Trust Property in the shape of Packwood House to visit. At Kingswood you pick up a section of the Stratford Upon Avon Canal and follow the towpath south to Lowsonford. Here you pick up the Heart of England Way and follow the waymarked trail west to Henley in Arden . This charming Warwickshire town includes a magnificent one mile high street with a collection of medieval buildings. In the town you can pick up the Arden Way and follow this trail north west to Ullenhall. You then head north west along Forde Hall Lane to Aspley Heath. Country Lane will then take you to Gilbert's Green and Wood end where you turn north to visit Earlswood Lakes. There's some nice footpaths around the large lakes and into the adjacent Clowes Wood . At the lakes you can pick up the Solihull Way again and follow it north east back into the town.",
  "video_url": "https://www.youtube.com/embed/GOQ0YnnNy-0",
  "postcode": "B91 3QZ",
  "district": "Solihull",
  "region": "West Midlands",
  "country": "England"
}