{
  "created_at": "2025-01-06T02:27:16.279792+00:00",
  "objectID": "a8acf85eb57fa3dafcfca812411dce05",
  "ref": "sheffield-canal-walking-route",
  "title": "Sheffield Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Sheffield_Canal_Basin_-_geograph.org.uk_-_3055.jpg",
  "nearby": [
    {
      "description": "Five Weirs Walk",
      "objectID": "d1591e432fcacbda3d5610552e563e79",
      "ref": "five-weirs-walk-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a8acf85eb57fa3dafcfca812411dce05.gpx",
  "_geoloc": {
    "lat": 53.3845677901,
    "lng": -1.4597021
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Sheffield_Canal_Basin_-_geograph.org.uk_-_3055.jpg",
      "title": "Martin Clark / Sheffield Canal Basin, via Wikimedia Commons",
      "caption": "Sheffield Canal Basin or Victoria Quays, looking west, showing the Straddle Warehouse built on stilts across the basin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Aqueduct_on_Sheffield_Canal_-_geograph.org.uk_-_57507.jpg",
      "title": "David Morris / Aqueduct on Sheffield Canal, via Wikimedia Commons",
      "caption": "Aqueduct on Sheffield Canal. Just over a couple of kilometres away from the terminus in Sheffield, the canal turns to head NE in its route towards Meadowhall. It also needs to cross over Darnall Road / Worksop Road (via an 'acadock' - local pronunciation!). The road dips down sharply to accommodate the canal and railway, giving rise to an area under the bridges often flooded in periods of sudden heavy rain. In the distance, the floodlight towers for the Don Valley Stadium can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Disused_staith%2C_Sheffield_canal_basin_-_geograph.org.uk_-_1760462.jpg",
      "title": "Christine Johnstone / Disused staith, Sheffield canal basin, via Wikimedia Commons",
      "caption": "Disused staith, Sheffield canal basin. This was used to tip mineral [probably coal?] into boats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Sheffield_and_Tinsley_Canal_lock_gates_%5E2_-_geograph.org.uk_-_610225.jpg",
      "title": "Steve F [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Sheffield and Tinsley Canal lock gates. Very near the Meadowhall shopping mall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Sheffield_and_Tinsley_Canal%2C_Sheffield_-_geograph.org.uk_-_726364.jpg",
      "title": "Stephen McKay / Sheffield & Tinsley Canal, Sheffield, via Wikimedia Commons",
      "caption": "The canal was opened in 1814 to allow boats to reach the centre of Sheffield from the highest navigable point on the River Don at Tinsley. This boatyard, where new narrowboats appeared to be under construction, is close to the end of the canal at Sheffield Basin. The gas works behind are on the opposite side of Sussex Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Sheffield%2C_Victoria_Quays_-_geograph.org.uk_-_495358.jpg",
      "title": "Chris Downer / Sheffield: Victoria Quays, via Wikimedia Commons",
      "caption": "Victoria Quays. This warehouse was ingeniously built across the canal in the late 19th century, to overcome the problem of lack of space."
    }
  ],
  "distance_km": 6.0,
  "description": "Follow the towpath of the Sheffield Canal on this waterside walk in Yorkshire. The canal runs from the Sheffield Canal Basin in the city centre to Tinsley, next to the Meadowhall centre. Along the way there are a number of locks and stone bridges. It's quite a narrow towpath so it's probably best suited for walkers. The canal featured in the opening scene of the 1997 film The Full Monty. The route starts at the attractive Victoria Quays in Sheffield. You then head north east through Attercliffe, passing the Don Valley Stadium on the way. You then pass Tinsley Locks before finishing at Meadowhall. The huge indoor shopping centre has plenty of restaurants for refreshments at the end of your walk. The River Don also runs to Meadowhall from the city centre so you could return along the Five Weirs Walk. This follows a waterside path along the river and is suitable for cyclists and walkers.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Dorothy Pax at Victoria Quays is an interesting place to stop at. The pub's name comes from a 1914 Sheffield Keel known as The Dorothy Pax. The bar itself is made from the famous boat. There's a nice, large outdoor seating area where you can relax and enjoy fine views over the quays on warmer days."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more waterside walking in the city you could pick up the River Sheaf Walk at Granville Square, near the train station. The trail will take you to the attractive Millhouses Park and Beauchief, where you will find a medieval monastic house with parkland and ancient ruins."
    }
  ],
  "video_url": "https://www.youtube.com/embed/IzdG74KOK38",
  "postcode": "S2 5SY",
  "district": "Sheffield",
  "region": "South Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Straddle, Victoria Quays (North Quay), Castlegate, Park Hill, Sheffield, South Yorkshire, England, S2 5SY, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "riverside"
  ],
  "points_of_interest": [
    "historical sites",
    "shopping centre"
  ],
  "facilities": [
    "restaurant",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}