{
  "created_at": "2025-01-05T23:39:29.525124+00:00",
  "objectID": "a8f48a380a1ff370b6221ee715e58ea3",
  "ref": "welbeck-estate-walking-route",
  "title": "Welbeck Abbey Estate Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e4/The_%27new%27_riding_school%2C_Welbeck_Estate_-_geograph.org.uk_-_1176172.jpg",
  "nearby": [
    {
      "description": "Robin Hood Way",
      "objectID": "e72ffb12ff717d64aebbc0af8854daaa",
      "ref": "robin-hood-way-walking-route"
    },
    {
      "description": "Clumber Park",
      "objectID": "ab4c34c84ac5b84136555d8306a71c18",
      "ref": "clumber-country-park-walking-and-cycle-route"
    },
    {
      "description": "Cresswell Crags",
      "objectID": "1093193b6d52aa28ac9b34b61bcb244d",
      "ref": "cresswell-crags-walking-route"
    },
    {
      "description": "Worksop",
      "objectID": "e2914d069ca6ceceb3bbf7d8eea6069b",
      "ref": "worksop-walking-route"
    },
    {
      "description": "Chesterfield Canal",
      "objectID": "82d4977c39ae50e61f209ab628ffe8ae",
      "ref": "chesterfield-canal-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a8f48a380a1ff370b6221ee715e58ea3.gpx",
  "_geoloc": {
    "lat": 53.2616678299,
    "lng": -1.1795233602
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/The_%27new%27_riding_school%2C_Welbeck_Estate_-_geograph.org.uk_-_1176172.jpg",
      "title": "Tim Heaton / The 'new' riding school, Welbeck Estate",
      "caption": "The 'new' riding school, Welbeck Estate. Built by the 5th Duke of Portland in the 1860s, and said to be second only in size to the Spanish Riding School in Vienna."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Lion_Gates_Welbeck_-_geograph.org.uk_-_112748.jpg",
      "title": "Michael Patterson / Lion Gates Welbeck",
      "caption": "The Lion Gates lead to Welbeck Abbey, the one time home of the Fifth Duke of Portland. It was this fifth Duke that built a series of tunnels through the estate. During the Second World War when all the houses of Worksop were having their modest railings cut away from the fronts of their homes, to help with the war effort, the Lion Gates were unusually overlooked in this respect."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Part_of_the_Welbeck_Estate_buildings_-_geograph.org.uk_-_1176113.jpg",
      "title": "Tim Heaton / Part of the Welbeck Estate buildings",
      "caption": "Part of the Welbeck Estate buildings. A bronze plaque in the middle of the long wall commemorates the St John's Ambulance Brigade's (Welbeck Division) service in the Boer War. I presume the archway on the right is an entrance to one of the famous Welbeck tunnels."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Welbeck_Great_Lake_-_geograph.org.uk_-_454110.jpg",
      "title": "David Croucher / Welbeck Great Lake",
      "caption": "Welbeck Great Lake. This part of Welbeck is PRIVATE and you will need permission to walk there. A view NW from the dam holding back the Great Lake, to Welbeck Abbey - the Great House - about two miles away. The view is not accidental, and is as pretty from the other direction. This is one of the key vistas planned to entrance visitors to the Abbey when taking carriage tours of the estate.."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Deer_Park%2C_Welbeck_Estate_-_geograph.org.uk_-_476613.jpg",
      "title": "James Hill / Deer Park, Welbeck Estate",
      "caption": "This is a photograph taken of the distant deer in the deer park on the Estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/St._Winifred%27s_Church%2C_Holbeck_-_geograph.org.uk_-_63411.jpg",
      "title": "Christine Hasman / St. Winifred's Church, Holbeck",
      "caption": "St. Winifred's Church, Holbeck. Designed by Louis Ambler in 1913, this small private church was erected entirely by the Welbeck estate workers at the instruction of the Duke & Duchess of Portland. In the graveyard there are some impressive tombs of the Portland family, some of which were exhumed from the burial ground near Welbeck Abbey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Welbeck_Estate%2C_the_Dukeries_-_geograph.org.uk_-_454074.jpg",
      "title": "David Croucher / Welbeck Estate, the Dukeries",
      "caption": "The Dukeries. This part of Welbeck is PRIVATE and you will need permission to walk there. The Estate was almost all intended to be both working farm and forest, and beautiful landscape. So the planning of the new farmland and tree plantings over several centuries had both utility for crops and aesthetics for leisure walks and drives in mind. This tradition is still maintained, as this view and the next show: farmland and woodland planned together for pleasing vista. The whole of the landscape in view is within the Estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Bunkers_Hill_Lodge_-_geograph.org.uk_-_763171.jpg",
      "title": "John Poyser / Bunkers Hill Lodge",
      "caption": "Lodge at Bunker's Hill & entrance to Welbeck Park. One of the 'Dukeries', home to the Dukes of Portland"
    }
  ],
  "distance_km": 6.0,
  "description": "Follow the waymarked trails through the Welbeck Estate on this easy walk on the Nottinghamshire and Derbyshire border. The Welbeck Abbey estate is located just to the south west of Worksop. You can begin your walk from the Harley Gallery car park just of the A60 in Welbeck. Just to the north of the car park you can pick up a section of the Robin Hood Way long distance footpath. If you follow it east it will take you through the estate to the lovely Shrubbery and Gouldsmeadow Lakes. The path passes between the two lakes with splendid views across the woodland and parkland of the estate. This walk finishes at South Lodge just past the lakes but you can keep heading east through the woodland to Clumber Park. It's only a few miles away and a great way to extend your walk. Also nearby is the lovely Cresswell Crags. Here you will find a fascinating limestone gorge set on the Derbyshire and Nottinghamshire border. The crags are just to the west of the start point for this walk so are easy to visit at the same time. If you head up to Cresswell Crags you could then follow the Robin Hood Way south east through the Welbeck Deer Park. Here you can look out for the beautiful white deer.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The parkland and woodland on the estate makes for a fine dog walk. Please stay on the public paths and keep your dog on a lead or under close control because of the wildlife."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the south east there's another grand estate in the shape of Thoresby Park. There's 1000 acres on the estate which includes woodland, a lake and views of the River Meden which runs through the park. There's also an interesting museum, a Victorian Courtyard and a gallery to see. Just a few miles south west there's Poulter Country Park in Nether Langwith. There's nice waymarked trails, a nature reserve and a fine viewpoint to enjoy here. You could pick up the Archaeological Way to the west of the site at Elmton and then follow it south to reach the park. The estate is located just south west of Worksop where you can enjoy an easy waterside stroll along the Chesterfield Canal. For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "postcode": "S80 3NB",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mansfield Road, Norton, Cuckney, Holbeck and Welbeck, Holbeck, Bassetlaw, Nottinghamshire, East Midlands, England, S80 3NB, United Kingdom",
  "district": "Bassetlaw",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}