{
  "created_at": "2025-01-06T03:33:45.999118+00:00",
  "objectID": "a9044d56a43553e068f31b694080550f",
  "ref": "whisby-nature-park-walking-route",
  "title": "Whisby Nature Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Orchid_Glade_-_Whisby_Nature_Park_-_geograph.org.uk_-_1548422.jpg",
  "nearby": [
    {
      "description": "Hartsholme Country Park",
      "objectID": "ae9bc2e353ea069e5e3b9f2eb5628db4",
      "ref": "hartsholme-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a9044d56a43553e068f31b694080550f.gpx",
  "_geoloc": {
    "lat": 53.185230131,
    "lng": -0.6386833717
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Orchid_Glade_-_Whisby_Nature_Park_-_geograph.org.uk_-_1548422.jpg",
      "title": "Mick Lobb / Orchid Glade - Whisby Nature Park, via Wikimedia Commons",
      "caption": "Orchid Glade in the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Whisby_Nature_Park_-_geograph.org.uk_-_628094.jpg",
      "title": "John Bennett / Whisby Nature Park, via Wikimedia Commons",
      "caption": "The Natural World Centre and Wind Turbine from near the car park entrance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Way_in_to_Whisby_Nature_Park_-_geograph.org.uk_-_684262.jpg/256px-Way_in_to_Whisby_Nature_Park_-_geograph.org.uk_-_684262.jpg",
      "title": "Ian Paterson / Way in to Whisby Nature Park, via Wikimedia Commons",
      "caption": "Way in to Whisby Nature Park. This is the footbridge that takes the footpath from the Eagle Moor road into the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Sign_on_Public_Footpath_to_Whisby_Nature_Park_-_geograph.org.uk_-_684253.jpg",
      "title": "Ian Paterson / Sign on Public Footpath to Whisby Nature Park, via Wikimedia Commons",
      "caption": "Sign on Public Footpath to the park. View eastwards at the first 'corner' on the footpath. The map above does not show the route, but the Get-a-Map version is more up to date. You can just make out the lake beyond the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Sand_Martin_Colony%2C_Whisby_Nature_Park_-_geograph.org.uk_-_684285.jpg",
      "title": "Ian Paterson / Sand Martin Colony, Whisby Nature Park, via Wikimedia Commons",
      "caption": "Sand Martin Colony. This sandbank has been occupied by sand martins since before the nature park was established. Their nest holes are easily visible in this shot. Today was slightly early in the season to spot any as they are on vacation in Africa at this time of year. Before the birds return, the nature reserve staff scrape away a new face of sand for the birds to burrow in as the winter weather erodes the previous season's nest holes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Footbridge_over_the_Railway_Line_at_Whisby_Nature_Park_-_geograph.org.uk_-_684348.jpg",
      "title": "Ian Paterson / Footbridge over the Railway Line at Whisby Nature Park, via Wikimedia Commons",
      "caption": "Footbridge over the Railway Line. This footbridge seems to have been designed to take visitors who can't use the adjacent level crossing (to the right, but out of shot) over the railway. The ramps however are stepped, the headroom is not much over 6 feet and the boards spring quite unnervingly as you cross."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Grebe_Lake%2C_Whisby_Nature_Park%2C_Nr._Lincoln_-_geograph.org.uk_-_22733.jpg",
      "title": "julian beckton / Grebe Lake, Whisby Nature Park, Nr. Lincoln, via Wikimedia Commons",
      "caption": "Grebe Lake. A former gravel quarry, now a spectacular nature reserve with a series of lakes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Nature_Park_-_geograph.org.uk_-_1005892.jpg",
      "title": "Gordon Griffiths / Nature Park, via Wikimedia Commons",
      "caption": "Visitor centre and lake view"
    }
  ],
  "distance_km": 5.5,
  "description": "This large nature reserve near Lincoln has miles of lovely walking trails to follow around a series of lakes. The reserve also consists of grassland, marsh, scrub and a small area of woodland. It's great for wildlife with birds such as Great crested grebe, Coot and Nightingale to look out for. There are six waymarked walks taking you around Thorpe Lake, Coot Lake, Grebe Lake and the Dragonfly Lakes. There's also a number of smaller ponds and a large area of grazing marsh. Look out for interesting flora such as the pretty purple marsh orchid and various wildlflowers. Facilities are very good with car parking, an informative visitor centre and a nice cafe. There's also a number of bird hides from which to observe the wide variety of wildlife. To continue your walking in the area you could head to the nearby Hartsholme Country Park. The park is only a couple of miles to the north east and has more good footpaths taking you around 200 acres of landscaped gardens, lakes, woodland and grassland. Right next to it you will find Swanholme Lakes Nature reserve where you can look out for more birdlife on the water. A couple of miles to the east there are nice footpaths to follow along the River Witham into Lincoln. If you'd like to visit the reserve by bike then you can follow National Cycle Network Route 64 and Regional Route 93 from the centre of Lincoln. This runs to Skellingthorpe, Swinethorpe and Eagle Moor to the north of the reserve. You can also follow Regional Route 93 along the River Witham and Newark Road to the south of the reserve.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Natural World Centre in the park is a great place to go for some post walk refreshments. There's several options within the centre including the Boardwalk Bistro. Here you can enjoy hot food and snacks with stunning views over Thorpe Lake and the Nature Park beyond. There's also another cafe and a kiosk as well.The centre also organises health walks for visitors wanting to improve their fitness levels. These are led by a walk leader and incorporate the different marked trails the Nature Park has to offer."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reserve is a lovely place to take your dog for a walk but please keep them on short leads as there is a lot of wildlife in the park. In the area around Thorpe Lake dogs can be taken off the lead though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into the city and you can try the circular Lincoln Walk which visits the cathedral, arboretum, castle and the River Witham. Here you can also pick up the interesting Spires and Steeples walk which runs through the countryside to Sleaford, visiting several pretty villages with historic churches along the way. The historic village of Skellingthorpe is not far from the park. There's some interesting buildings and the splendid ancient woodland of Old Wood to see here. Near the village you'll also find the Elizabethan manor house of Doddington Hall. The hall has some beautiful gardens, retail outlets, a bike shop and a mountain bike trail. For more walking ideas in the county see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SvJ1ouxxKIg",
  "district": "North Kesteven",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Little Thorpe Lane, The Stud Farm, Thorpe on the Hill, North Kesteven, Lincolnshire, England, LN6 9BL, United Kingdom",
  "postcode": "LN6 9BL",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "marsh",
    "lake"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "flora viewing",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "cafe",
    "bird hides"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling",
    "bird watching"
  ]
}