{
  "created_at": "2025-01-06T18:50:12.516683+00:00",
  "objectID": "a928a9492d367fa0812ddcde3609ea01",
  "ref": "ballysaggartmore-towers-walking-route",
  "title": "Ballysaggartmore Towers Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/County_Waterford_-_Ballysaggartmore_House_Bridge_-_20180919191350.jpeg/512px-County_Waterford_-_Ballysaggartmore_House_Bridge_-_20180919191350.jpeg?20180920091614",
  "nearby": [
    {
      "description": "The Vee",
      "objectID": "ff39dfa1837205c0ed86b2981e1d95d8",
      "ref": "the-vee-walking-route"
    },
    {
      "description": "Dungarvan",
      "objectID": "dc702fe1ea4d3a10a64e4481ff51b19a",
      "ref": "dungarvan-walking-route"
    },
    {
      "description": "Knockadoon Cliff Walk",
      "objectID": "8b8ba01936deea2dc664dd72de12c7c9",
      "ref": "knockadoon-cliff-walk"
    },
    {
      "description": "Youghal Beach Boardwalk",
      "objectID": "858b8e23bf7660408c48bb455c0d0849",
      "ref": "youghal-beach-walk"
    },
    {
      "description": "Midleton To Youghal Greenway",
      "objectID": "338154e93b560249cf42b9fe5dfaa354",
      "ref": "midleton-to-youghal-greenway-walking-route"
    },
    {
      "description": "Lismore Lady Louisa's Walk",
      "objectID": "e37d024d38cea425a85a8a62e8b1fac0",
      "ref": "lismore-lady-louisas-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a928a9492d367fa0812ddcde3609ea01.gpx",
  "_geoloc": {
    "lat": 52.14696,
    "lng": -7.96731
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/County_Waterford_-_Ballysaggartmore_House_Bridge_-_20180919191350.jpeg/512px-County_Waterford_-_Ballysaggartmore_House_Bridge_-_20180919191350.jpeg?20180920091614",
      "title": "Tz5y0d, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Ballysaggartmore Towers. Arthur Keily-Ussher, an Anglo-Irish landlord, constructed the estate no later than 1834. His extensive estate spanned approximately 8000 acres, with the majority leased to tenant farmers. However, he retained around 1000 acres for his personal demesne. In 1850, Keily-Ussher built The Towers, extravagant gates intended for his wife. These gates were meant to be part of a grand castle, but financial constraints halted further construction, leaving the gates as the sole completed structure. Consequently, the Kiely-Ussher family resided in a modest house on the grounds, which has since been demolished. The small castle that was initially planned was never finished and is not open to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Ballysaggartmore_Towers_Gatehouse_-_geograph.org.uk_-_2868574.jpg?20211211221816",
      "title": "Ballysaggartmore Towers Gatehouse by Hywel Williams, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ballysaggartmore Towers Gatehouse. Local lore suggests that the grand entrance lodges were built as a prelude to an extravagant mansion that Arthur Keily-Ussher intended to construct. However, he never completed the mansion as he ultimately ran out of funds. The lore also claims that his building pursuits were motivated by his jealous wife, who envied her sister-in-law residing at the stately Strancally Castle. Nevertheless, no contemporary accounts from the period verify this story."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/County_Waterford_-_Ballysaggartmore_Towers_-_20180904101152.jpg/512px-County_Waterford_-_Ballysaggartmore_Towers_-_20180904101152.jpg?20180904101246",
      "title": "Photo-raven, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Controversy surrounds Arthur Keily-Ussher, who has been accused of being a harsh landlord and evicting tenants unable to pay their rents during the Great Famine (1845-1849). An attempt was even made on his life during this period. Keily-Ussher died around 1862, and the estate was sold by a liquidator. The house, gardens, and some of the lands were purchased by the Woodroofe family, and these were later owned by a family named Anson. The house was destroyed by an arson attack during the Civil War period, and the ruined stone fabric was removed in the mid-20th century. One of the lodges was still in use as a private residence in the 1970s. The lodges, although un-roofed, are still standing and surrounded by forested land. A walking trail encompassing them has been developed, along with a picnic and parking area nearby."
    }
  ],
  "distance_km": 2.0,
  "description": "This walk visits two photogenic gothic towers near Lismore in County Waterford. You can start the walk from the roadside parking area just to the west of Lismore. From here you can pick up a circular loop walk to take you north to the towers. You'll pass along some pleasant woodland trails on the historic Ballysaggartmore Demesne before coming to the fairy tale structures. The towers have a fascinating history with more details next to the photos below. You can continue your walking in the area by heading north to The Vee. You'll visit the stunning Vee Gap where you can enoy some splendid views over the Galty Mountains.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into Lismore and you can pick up Lady Louisa's Walk. The circular loop walk includes a pleasant riverside stretch along the River Blackwater and views of the historic castle and cathedral. To the south east is the historic town of Dungarvan where you can enjoy a walk along the town's lovely harbour and see the ancient castle."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tBspEHvXkvk?si=PIj8kUMLD8ghFQAy",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Ballysaggartmore Towers, Ballysaggart More, The Municipal District of Dungarvan — Lismore, County Waterford, Munster, P51 VW44, Éire / Ireland",
  "postcode": "P51 VW44",
  "district": null,
  "county": "County Waterford",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}