{
  "created_at": "2025-01-06T01:25:58.573001+00:00",
  "objectID": "a975d0d72ff8446ed6b930bf97791b55",
  "ref": "richmond-to-hampton-court-walk-walking-route",
  "title": "Richmond to Hampton Court Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/27/River_Thames%2C_Richmond_Bridge_-_geograph.org.uk_-_163761.jpg",
  "nearby": [
    {
      "description": "Marble Hill Park",
      "objectID": "6e1854ebdb72a15978cf13897452d917",
      "ref": "marble-hill-park-walking-route"
    },
    {
      "description": "Ham House Richmond",
      "objectID": "267b3c34ca0951989aa9511c3185eec1",
      "ref": "ham-house-richmond-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Hampton Court Park",
      "objectID": "e45c4f48d8643b4f22001f566cb9880a",
      "ref": "hampton-court-park-walking-and-cycle-route"
    },
    {
      "description": "Bushy Park",
      "objectID": "304370478e1b5783aa5169c0ecb9cd5e",
      "ref": "bushy-park-walking-route"
    },
    {
      "description": "Crane Park",
      "objectID": "85912f23d80d3889bd46ea6e2eddeec4",
      "ref": "crane-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a975d0d72ff8446ed6b930bf97791b55.gpx",
  "_geoloc": {
    "lat": 51.4586399785,
    "lng": -0.3075152245
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/River_Thames%2C_Richmond_Bridge_-_geograph.org.uk_-_163761.jpg",
      "title": "Nigel Cox / River Thames: Richmond Bridge",
      "caption": "River Thames: Richmond Bridge. Built in 1777 to replace a ferry crossing, and now carrying the A305 road, with the Surrey bank and Richmond on the right, and the Middlesex bank and St Margarets on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Marble_Hill_House_-_geograph.org.uk_-_974186.jpg",
      "title": "Alan Swain / Marble Hill House",
      "caption": "Photograph of Marble Hill House taken from the towpath on the opposite bank of the River Thames. The house and gardens are open to the public and well worth crossing the river to see."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Ham_House_-_geograph.org.uk_-_587473.jpg",
      "title": "Mark Percy / Ham House",
      "caption": "Ham House Ham House, near Richmond, was built in 1610 for Sir Thomas Vavasour, Knight Marshal to James I and is now owned by the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Eel_Pie_Island_-_geograph.org.uk_-_27822.jpg",
      "title": "steve / Eel Pie Island",
      "caption": "Eel Pie Island. Bertha the Barge is in front of small boats and boat houses which are on Eel Pie Island, a small island in the Thames at Twickenham, South West London"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Teddington_Lock_-_geograph.org.uk_-_974172.jpg",
      "title": "Alan Swain / Teddington Lock",
      "caption": "Several walkers on the towpath at Teddington Lock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Lock_Keeper%27s_office_at_Teddington_Lock_-_geograph.org.uk_-_1021447.jpg",
      "title": "Roger Davies / Lock Keeper's office at Teddington Lock",
      "caption": "Lock Keeper's office at Teddington Lock A lock made of timber was originally built on the River Thames at Teddington in 1810. Following dilapidation it was replaced by the current structure in 1857-58 including what was then the Lock Keeper's cottage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Canbury_Gardens_Kingston_Upon_Thames_-_geograph.org.uk_-_358309.jpg",
      "title": "Ron Belcher / Canbury Gardens Kingston Upon Thames",
      "caption": "Canbury Gardens next to the river in Kingston Upon Thames"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Hampton_Court_-_geograph.org.uk_-_47223.jpg",
      "title": "Ron Strutt / Hampton Court",
      "caption": "Hampton Court. The front elevation of the Tudor Palace."
    }
  ],
  "distance_km": 13.0,
  "description": "This is a popular riverside walk from Richmond to Hampton Court along a section of the epic Thames Path National Trail. It runs for just under 8 miles along a flat path with lovely scenery along the way. The walk starts on the 18th century Richmond Bridge and heads south, passing Marble Hill Park on the opposite side of the river. You can catch a ferry outside Ham House to the other side and visit the 18th century Marble Hill House. It includes 66 acres of lovely riverside parkland and makes a nice detour from the route if you have time. The route continues to the 17th century Ham House which is owned by the National Trust and set a little way back from the river. The grounds are worth exploring and include a kitchen garden, the maze-like 'Wilderness', an orangery and a number of summerhouses. The route continues past Eel Pie Island, with views to Twickenham on the opposite side of the river. The island is home to Twickenham Rowing Club and also includes about 50 homes and the lovely Crane Park. The peaceful park includes an informative visitor centre, cafe, woodland trails along the River Crane, lots of wildlife and the interesting 18th century Shot Tower. The next stage takes you Teddington where you will pass the picturesque Teddington Lock. This lovely spot includes a weir, 19th century footbridges and the lock keepers cottage. There's usually an ice cream van here in the summer months too. You continue south to Kingston where you'll pass the lovely riverside park at Canbury Gardens. There's a decent cafe here where you could stop for refreshments. The gardens are a nice place for a stroll and a popular spot for relaxing in on warmer days. In Kingston you cross to the other side of the river on the Grade II listed Kingston Bridge. There's an opportunity here to head into the adjacent Bushy Park where there are lots of resident deer to see. The final section runs from Kingston to Hampton Court, passing Thames Ditton Island on the way. You can take a detour to visit the splendid Hampton Court Park where you can stroll along the Long Water canal to the wonderful Golden Jubilee Fountain. Entry to Hampton Court Palace requires and entrance fee. The 16th century palace was one of the favourite residences of King Henry VIII. The grounds include beautiful gardens, the royal tennis court and the famous maze.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the end of the route head to the Mute Swan in Hampton Court for some post walk refreshments. It's located right opposite the gates to Hampton Court Palace, with a terrace for al fresco drinking and dining, which is a draw on sunny days. The pub is also hundreds of years old and has a fine interior which is full of character. You can find it right at the end of the walk at a postcode of KT8 9BN for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the other side of the river to the palace you'll find Hampton Court railway station. You can catch the train back to Richmond via Surbiton at the end of the walk."
    }
  ],
  "postcode": "TW9 1EH",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Scott's, 4, Whittaker Avenue, East Twickenham, St Margarets, London Borough of Richmond upon Thames, London, Greater London, England, TW9 1EH, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "woodland",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "parks",
    "river views",
    "canal"
  ],
  "facilities": [
    "visitor center",
    "cafe",
    "car park",
    "ice cream van",
    "playground"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "sightseeing"
  ]
}