{
  "created_at": "2025-01-06T02:18:15.501828+00:00",
  "objectID": "a98f98bc44f0680cc44353a6c0dcbbf6",
  "ref": "two-tunnels-greenway-walking-and-cycle-route",
  "title": "Bath Two Tunnels Greenway Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Devonshire_Tunnel_portal_on_opening_day.jpg/512px-Devonshire_Tunnel_portal_on_opening_day.jpg",
  "nearby": [
    {
      "description": "Dundas Aqueduct",
      "objectID": "6557fb85a13f002fe45c491896dfc462",
      "ref": "dundas-aqueduct-walking-route"
    },
    {
      "description": "Kennet and Avon Canal Walk",
      "objectID": "0c879db862142efde19b17abd060ac05",
      "ref": "kennet-and-avon-canal-walk-walking-route"
    },
    {
      "description": "National Cycle Route 24",
      "objectID": "fa5d1f8a663358026d7ea7f4f3675270",
      "ref": "national-cycle-route-24"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a98f98bc44f0680cc44353a6c0dcbbf6.gpx",
  "_geoloc": {
    "lat": 51.3830351154,
    "lng": -2.3581085223
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Devonshire_Tunnel_portal_on_opening_day.jpg/512px-Devonshire_Tunnel_portal_on_opening_day.jpg",
      "title": "DBailey635 / CC BY-SA (https://creativecommons.org/licenses/by-sa/3.0)",
      "caption": "View of the Devonshire Tunnel portal in Bear Flat, Bath, on the opening day of the Two Tunnels Greenway. Photo taken back in 2013"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Disused_railway_crosses_railway_-_geograph.org.uk_-_47837.jpg",
      "title": "Ron Strutt / Disused railway crosses railway",
      "caption": "Disused railway crosses railway. This bridge once carried the Bath to Bournemouth line of the Somerset and Dorset Joint Railway over the Bath to Bristol main line. The latter now has 125mph trains while the other closed in 1966."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Who%27s_pinched_my_tunnel%5E%5E_-_geograph.org.uk_-_47843.jpg",
      "title": "Ron Strutt / Who's pinched my tunnel?!",
      "caption": "This grassy glade in the southern suburbs of Bath marks the spot where the northern portal of the Somerset & Dorset Railway's Devonshire Tunnel once stood. It has now been buried by infilling the approach cutting. In the middle of the picture is a manhole which gives access to it so that occasional inspections can be carried out."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Bath_To_Midford_1903.png/256px-Bath_To_Midford_1903.png",
      "title": "United Kingdom Ordnance Survey / Public domain",
      "caption": "Map of area between Bath and Midford, Somerset, showing route of Somerset And Dorset Joint Railway in 1903/04"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Tucking_Mill_Viaduct_-_geograph.org.uk_-_47849.jpg",
      "title": "Ron Strutt / Tucking Mill Viaduct",
      "caption": "Tucking Mill Viaduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Dundas_Aqueduct_-_geograph.org.uk_-_94012.jpg",
      "title": "Jeff Clarke / Dundas Aqueduct",
      "caption": "Dundas Aqueduct"
    }
  ],
  "distance_km": 18.5,
  "description": "This is a super, shared cycling and walking path making use of a disused railway path through Bath and the surrounding countryside. The path takes you through Bath and then on into some splendid Somerset countryside before following the Kennet and Avon Canal Towpath and the River Avon back into Bath. The circular route runs for about 12 miles following the disused railway trackbed of the Somerset and Dorset Joint Railway from East Twerton through the Bath suburb of Oldfield Park to the Devonshire Tunnel. It then goes through Lyncombe Vale before entering the Combe Down Tunnel, and crossing Tucking Mill Viaduct near Midford. The path is fairly flat making it suitable for families or anyone looking for a fairly easy cycle or walk. The trail makes up the first section of National Cycle Route 24. You can extend your ride by continuing along the signed route to Radstock, Frome, Warminster, Salisbury and Eastleigh in Hampshire, where the route finishes. The route also links with the Colliers Way another easy rail trail in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Midford we recommend stopping off at the noteworthy Cross Keys. The pub has an interesting history, dating all the way back to the early 1700s when it began as a coaching house. There's an attractive interior with log fires in the winter and a large beer garden outside in the summer. They have a great menu and are also very dog friendly with water and treats provided for your canine friend. It's also a great place for walkers with many local walking groups that start and end their walks at the inn. You can find the inn just west of the Coombe Down Tunnel at a postcode of BA2 5RZ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The path passes the Kennet and Avon Canal where you can continue your exercise along the canal towpath. For example you could follow it east and visit Bradford on Avon while enjoying views of the River Avon. The Limestone Link also passes along the southern and eastern sections of the route. On the route look out for the impressive Dundas Aqueduct, a scheduled ancient monument with fine views from the top."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8qEkjHyrIfg",
  "postcode": "BA2 4AX",
  "district": "Bath",
  "county": "Bath and North East Somerset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}