{
  "created_at": "2025-01-06T07:52:45.774443+00:00",
  "objectID": "a9ce0f0d02c7dba8bc166d35b76ce6d2",
  "ref": "south-cave-walking-route",
  "title": "Walk around South Cave Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Great_Wold%2C_South_Cave_-_geograph.org.uk_-_570913.jpg/256px-Great_Wold%2C_South_Cave_-_geograph.org.uk_-_570913.jpg",
  "nearby": [
    {
      "description": "Brantingham",
      "objectID": "fcd2a0e655d666a96eb7800808316133",
      "ref": "brantingham-walking-route"
    },
    {
      "description": "Welton Dale",
      "objectID": "34ce3ba7b3b454d0caff720ea6fd8186",
      "ref": "welton-dale-walking-route"
    },
    {
      "description": "Yorkshire Wolds Way",
      "objectID": "3857d94bed0386c563af9fd8be850748",
      "ref": "yorkshire-wolds-way-walking-route"
    },
    {
      "description": "High Hunsley Circuit",
      "objectID": "1626f045c39875a4f5ce1923dbce475f",
      "ref": "high-hunsley-circuit-walking-route"
    },
    {
      "description": "Beverley Twenty",
      "objectID": "e99aca0d27b8670b2206b288b4e1982a",
      "ref": "beverley-twenty-walking-route"
    },
    {
      "description": "North Cave Wetlands",
      "objectID": "3397ffcb71f802b8675e0a63c9b901f7",
      "ref": "north-cave-wetlands-walking-route"
    },
    {
      "description": "Hotham",
      "objectID": "a8bf7f49cbcd8fec43adaac22c02f5b5",
      "ref": "hotham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/a9ce0f0d02c7dba8bc166d35b76ce6d2.gpx",
  "_geoloc": {
    "lat": 53.7705253781,
    "lng": -0.594929927
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Great_Wold%2C_South_Cave_-_geograph.org.uk_-_570913.jpg/256px-Great_Wold%2C_South_Cave_-_geograph.org.uk_-_570913.jpg",
      "title": "Paul Glazzard / Great Wold, South Cave",
      "caption": "View of Great Wold to the east of South Cave. The public footpath from Great Wold to Beverley Road in South Cave, looking west from the Yorkshire Wolds Way below Great Wold Plantation. Just about visible on the horizon are the cooling towers at Drax Power Station some 20 miles away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Cave_Wold_-_geograph.org.uk_-_719004.jpg/256px-Cave_Wold_-_geograph.org.uk_-_719004.jpg",
      "title": "Paul Harrop / Cave Wold",
      "caption": "Cave Wold. Looking down towards the woodland of the Great Wold Plantation. The photograph was taken in the spring of 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Great_Wold_Trig_point_-_geograph.org.uk_-_1451944.jpg",
      "title": "David Brown / Great Wold Trig point",
      "caption": "The Yorkshire Wolds Way leaving the road to ascend Ellerker North Wold through the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Yorkshire_Wolds_Way_-_geograph.org.uk_-_757443.jpg/512px-Yorkshire_Wolds_Way_-_geograph.org.uk_-_757443.jpg",
      "title": "David Wright / Yorkshire Wolds Way",
      "caption": "Yorkshire Wolds Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Brantingham_Village_Green_-_geograph.org.uk_-_10964.jpg",
      "title": "Andy Beecroft / Brantingham Village Green",
      "caption": "Brantingham Village Green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/The_Lake_-_geograph.org.uk_-_578794.jpg/256px-The_Lake_-_geograph.org.uk_-_578794.jpg",
      "title": "Peter Church / The Lake",
      "caption": "The Lake, Welton, East Riding of Yorkshire, England. The watercourse was created by springs which rise from the chalk rocks of the Yorkshire Wolds. Further downstream is the old watermill. The conifers on the opposite hillside are a recent (post WWII) introduction. This standing water here is generated by sluices about 500 metres south. The platform was being used by the local ducks for sunbathing!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Wauldby_Dam_-_geograph.org.uk_-_624324.jpg",
      "title": "Paul Glazzard / Wauldby Dam",
      "caption": "Wauldby Dam. Looking west across the small lake called Wauldby Dam towards the chapel and farmhouse at Wauldby Manor Farm. Wauldby was a chapelry and township until 1866 and a civil parish until 1st April 1935 when it became part of Welton. Some of the 19th century farm buildings have recently been turned into luxury accommodation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Riplingham_Common_-_geograph.org.uk_-_829509.jpg/256px-Riplingham_Common_-_geograph.org.uk_-_829509.jpg",
      "title": "Paul Glazzard / Riplingham Common",
      "caption": "Riplingham Common, east of Low Hunsley, East Riding of Yorkshire, England. Looking northwest along the road from Hind House to Rasp Clump at Riplingham Common, near the western end of Rowley parish in the Yorkshire Wolds."
    }
  ],
  "distance_km": 19.0,
  "description": "The village of South Cave is located in the East Riding of Yorkshire and the Yorkshire Wolds. This circular walk from the village visits some of the lovely wolds and dales in the surrounding area. You'll visit Brantingham Wold, Welton Dale, Cave Wold and Great Wold with some lovely rolling countryside to enjoy on the way. The route runs for just over 12 miles using sections of the Yorkshire Wolds Way, the Beverley Twenty and other public footpaths. The walk starts on the eastern side of the village where you can pick up the Yorkshire Wolds Way. Follow the waymarked path south east to Woo Dale, Ellerker North Wood and Brantingham. You continue south east through Elloughton Wold to Welton. Here you turn north east to pass through the lovely Welton Dale. The path comes to Wauldby Dam and Turtle Hill where you turn west along the Beverley Twenty. Back at Ellerker Wood you follow a country lane north east to visit Riplingham before following a footpath west past Great Wold, Sweatty Hill and Cave Wold. Shortly after you return to South Cave where the route finishes. Just to the north there's the sister village of North Cave where you can enjoy an abundance of wildlife at the North Cave Wetlands Nature Reserve. The historic Hotham Hall Estate can also be explored in this area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Fox and Coney Inn for some refreshments after your walk. It's a historic pub dating from 1731 and Grade II listed. There's log fires burning at each end of the pub on cool days and a fabulous outside patio when the sun shines. They have a good menu so you can relax outside with your meal on warmer days. You can find the pub at 52 Market Place with a postcode of HU15 2AT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "There's lots of pockets of woodland on the route making it ideal for dog walking. The Fox and Coney Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you can try the Market Weighton Circular Walk, the Market Weighton Canal and the Goodmanham Walk. To the south there's the River Humber and the Trans Pennine Trail which you can follow to Humber Bridge Country Park near Hull. Here you can enjoy the parkland before climbing up to the Humber Bridge and walking across the river to Barton Upon Humber on the iconic structure. Just a few miles to the east you'll find the worthy villages of Cottingham and Skidby. The main attraction here is the Grade II listed Skidby Mill which dates back to 1821. The working mill includes an interesting museum and a fine restaurant with a landscaped garden. Head a few miles north west and you'll find North Cliffe Woods. The bluebell woods are a pleasant place for a peaceful stroll with lots of interesting flora and fauna to see. For more walking ideas in the area see the Yorkshire Wolds Walks page."
    }
  ],
  "district": "South Cave",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beverley Road, South Cave, East Riding of Yorkshire, England, HU15 2BA, United Kingdom",
  "postcode": "HU15 2BA",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "nature reserve",
    "historic estate"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}