{
  "created_at": "2025-01-06T01:27:31.073987+00:00",
  "objectID": "aa105c0287b49e8ddb1b88c19738a81f",
  "ref": "trollers-gill-walking-route",
  "title": "Troller's Gill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/35/Mine_entrances_as_one_descends_towards_Troller%27s_Gill_-_geograph.org.uk_-_835853.jpg",
  "nearby": [
    {
      "description": "Grassington",
      "objectID": "9b0ebc708d7f6edf19dcccfd0a0f336d",
      "ref": "grassington-walking-route"
    },
    {
      "description": "Dales Way",
      "objectID": "605d1dad48e02d248ecb985988bc777c",
      "ref": "dales-way-walking-route"
    },
    {
      "description": "Linton Falls",
      "objectID": "11a08617617af634fd7557116e1bd62c",
      "ref": "linton-falls-walking-route"
    },
    {
      "description": "Grimwith Reservoir",
      "objectID": "304350b79fb90da37b07bf8a91f5a46b",
      "ref": "grimwith-reservoir-walking-route"
    },
    {
      "description": "Appletreewick",
      "objectID": "fb1a2d0b841de3ccd65ee7333fd2dcee",
      "ref": "appletreewick-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aa105c0287b49e8ddb1b88c19738a81f.gpx",
  "_geoloc": {
    "lat": 54.0462921902,
    "lng": -1.9512080201
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Mine_entrances_as_one_descends_towards_Troller%27s_Gill_-_geograph.org.uk_-_835853.jpg",
      "title": "Allan Friswell / Mine entrances as one descends towards Troller's Gill",
      "caption": "Mine entrances as one descends towards Troller's Gill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Trollers_Gill.jpg/512px-Trollers_Gill.jpg",
      "title": "James F. Carter [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.5)]",
      "caption": "A dog walks along the gill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Stream_above_Trollers_Gill_-_geograph.org.uk_-_653501.jpg",
      "title": "Chris Heaton / Stream above Trollers Gill",
      "caption": "Stream above Trollers Gill. Watercourse approaching the limestone gorge of Trollers Gill, in full spate. It dries up during long periods without rain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Trollers_Gill_-_geograph.org.uk_-_653511.jpg",
      "title": "Chris Heaton / Trollers Gill",
      "caption": "Limestone Gorge that is normally dry - but had the semblance of a stream running through on this visit after prolonged heavy rain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Trollers_Gill_%28with_surface_drainage%29_-_geograph.org.uk_-_662066.jpg",
      "title": "Roger Nunn / Trollers Gill (with surface drainage)",
      "caption": "Under normal conditions Trollers Gill is a dry limestone gorge (the stream flows underground). On this occasion, after several days of heavy rainfall, the stream was in full spate making progress through the Gill, on foot, virtually impossible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/South_entrance_to_Trollers_Gill_-_geograph.org.uk_-_467714.jpg",
      "title": "Joe Regan / South entrance to Trollers Gill",
      "caption": "South entrance to Trollers Gill"
    }
  ],
  "distance_km": 11.5,
  "description": "This walk takes you to the wonderful limestone gorge of Troller's Gill in Wharfedale in the Yorkshire Dales. The walk starts in Burnsall and heads along the River Wharfe and the Dales Way to Haugh. Here you turn north and head to Skyreholme along the Fir Beck. Soon after you come to the splendid Parceval Hall Gardens. This Grade II listed manor house has 24 acres of formal and woodland gardens to explore and is an added bonus on the walk. From Parceval Hall you follow the Skyreholme Beck to Troller's Gill. It's a magnificent sight and well worth the climb! The route then descends through Appletreewick Pasture and Hartlington, returning to Burnsall. To continue your walking in the area you could visit the nearby Linton Falls or Grimwith Reservoir. The gorge is located near to the popular town of Grassington. You could reach it from the town by following the Dales Way along the River Wharfe to Burnsall and then continuing along the rest of this route. The village of Appletreewick is also very close by. You could also easily reach the site from there.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head a couple of miles north west of the site to the pretty village of Hebden and you can visit the delightful Old School Tea Room. It's an idyllic spot with the tea room housed in the wonderful old school which dates from 1874. The charming building includes the old school clock which was restored in the millennium and continues to chime every hour. From inside, there is a picturesque view down to the beck and across the fields and there is also a large garden area for warmer days. In the outdoor section there's the additional attraction of a variety of farm animals including pygmy goats, hens and guinea pigs. Free parking is available in the adjacent car park. You can find the tea rooms in on the Main Street in Hebden with a postcode of BD23 5DX for your sat navs.  Pictured above left the Old School in Hebden where you can enjoy delicious home made dishes and tasty cakes using locally sourced ingredients. On the right is the Gold Post Box at Hebden Post Office. To mark Andrew Triggs Hodge's gold medal winning performance, Royal Mail has painted a post box at Hebden Post Office, Yorkshire, gold. The Craven Arms in Appletreewick is another special pub and well worth some investigation. It dates back all the way to the 16th century when it was originally a farm house. The interior has bags of character and old world charm with pictures of heros, pioneers and inspiring historical figures adorning the walls. There's also oak beams, a thatched roof and an adjacent Cruck Barn, the first of its kind to be built since the times Of Henry the VIII. You can find it at a postcode of BD23 6DA for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of Grassington you'll find the worthy village of Threshfield. The pretty settlement includes an historic 16th century inn and the nearby Threshfield Quarry. The quarry is an unusual and atmospheric place for a walk with its limestone rocky cliffs and distinctive turquoise lakes."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FaRibNNXfS4",
  "postcode": "BD23 6BU",
  "district": "Burnsall",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Burnsall Bridge, Hartlington, Burnsall, North Yorkshire, York and North Yorkshire, England, BD23 6BU, United Kingdom",
  "state": "England"
}