{
  "created_at": "2025-01-06T18:47:31.499882+00:00",
  "objectID": "aa18368a765158cab9af16acf1d44a3e",
  "ref": "mizen-head-walking-route",
  "title": "Mizen Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/67/Mizen_Head%2C_Co._Cork_-_geograph.org.uk_-_1479629.jpg",
  "nearby": [
    {
      "description": "Lough Hyne",
      "objectID": "3f08982fdd9e1c3167539db835c33309",
      "ref": "lough-hyne-walking-route"
    },
    {
      "description": "Sheeps Head Way",
      "objectID": "7f7a405a995cd43426ebdf5140763099",
      "ref": "sheeps-head-way-walking-route"
    },
    {
      "description": "Cape Clear",
      "objectID": "eaf4128e0dc17613dd779c21f168a274",
      "ref": "cape-clear-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aa18368a765158cab9af16acf1d44a3e.gpx",
  "_geoloc": {
    "lat": 51.47029,
    "lng": -9.7803
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Mizen_Head%2C_Co._Cork_-_geograph.org.uk_-_1479629.jpg",
      "title": "nick macneill / Mizen Head, Co. Cork",
      "caption": "Mizen Head, Co. Cork. Mizen Head is situated at one of the furthest points of the island of Ireland and is renowned as a popular tourist destination, celebrated for its breathtaking cliff landscapes. It holds particular significance for sailors, as it marks the beginning or end of their journey across the Atlantic Ocean, serving as their initial or final glimpse of Europe. The peninsula's tip is almost isolated, separated by a deep chasm that is now bridged, granting access to an ancient signal station, a meteorological station, and a lighthouse. The signal station, once continuously manned, has been transformed into a museum showcasing exhibits related to the area's strategic importance for transatlantic shipping and communications, including the pioneering work of Guglielmo Marconi. The historic \"99 steps\" that originally led to the station have been complemented by a network of paths and observation platforms, with comprehensive visitor amenities available at the site's entrance. Nearby villages such as Ballydehob, Crookhaven, Goleen, and Schull lie to the east of the peninsula."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Barley_Cove_dunes_-_geograph.org.uk_-_4756771.jpg",
      "title": "Barley Cove dunes by Jonathan Billinger, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barley Cove dunes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Cloghane%2C_Cliffs_north_of_Mizen_Head_-_geograph.org.uk_-_1429693.jpg",
      "title": "Nigel Cox / Cloghane: Cliffs north of Mizen Head",
      "caption": "Cloghane, Cliffs north of Mizen Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Cannawee%2C_Co._Cork%2C_Ireland_-_panoramio_%284%29.jpg/512px-Cannawee%2C_Co._Cork%2C_Ireland_-_panoramio_%284%29.jpg",
      "title": "Paul Scally, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Cannawee, Co. Cork, Ireland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Cloghane%2C_Co._Cork%2C_Ireland_-_panoramio.jpg/512px-Cloghane%2C_Co._Cork%2C_Ireland_-_panoramio.jpg",
      "title": "Paul Scally, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Cloghane, Co. Cork, Ireland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Brow_Head_-_geograph.org.uk_-_258536.jpg",
      "title": "Richard Webb / Brow Head",
      "caption": "Brow Head. Brow Head, located on the Mizen Peninsula just a short distance to the east, lies several metres farther south than Mizen Head. Despite this, geographical references have traditionally measured Ireland's length diagonally from northeast to southwest as \"from Fair Head to Mizen Head\" or from north to south as \"from Malin Head to Mizen Head.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Mizen_Head_Bridge_-_geograph.org.uk_-_12656.jpg",
      "title": "Charles W Glynn / Mizen Head Bridge",
      "caption": "Mizen Head Bridge. Bridge leading to Mizen Head Lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Boat_at_Mizen_Head_exhibition_centre_-_geograph.org.uk_-_1167057.jpg",
      "title": "Ulrich Hartmann / Boat at Mizen Head exhibition centre",
      "caption": "Boat at Mizen Head exhibition centre. Mizen's natural splendour is just one aspect of the unique experience awaiting you at this iconic headland. Here, you'll also discover a wealth of history and a fascinating human narrative. Mizen's strategic location made it a crucial site for transatlantic shipping and communication, providing many Irish emigrants with their last view of home as they set sail for a new life on the other side of the world. This narrative is beautifully conveyed through the numerous top-quality exhibits and displays at Mizen Head Visitor Centre and Mizen Head Signal Station."
    }
  ],
  "distance_km": 9.0,
  "description": "This walk visits the beautiful Mizen Head in County Cork. The headland is traditionally regarded as the most southerly point of mainland Ireland although Brow Head is the actual southernmost point. The walk starts from the car park at Barley Cove in Cannawee. Here you'll find a lovely beach with sand dunes and lots of wildlife. From here you can follow a pleasant country lane south west to the lighthouse at Mizen Head. The trail is suitable for cyclists as well. At the headland you'll find the Mizen Head Signal Station & Visitor Centre where you can learn all about this special area. There's some amazing views and a nice cafe for refreshments here. You can also look out for lots of wildlife with seabirds nesting on the cliffs and seals in the waters below.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east towards Skibbereen and you could visit Lough Hyne. Here you will find a significant Marine Nature Reserve with cliffs, salt marsh, beach and a popular circular walking trail. To the north east there's the Sheeps Head Way. The circular loop walk explores the stunning Sheep's Head peninsula from the attractive town of Bantry. To the south east lies Cape Clear, Ireland’s southernmost inhabited Irish-speaking island. It's another wonderful, peaceful place for a walk with lots of wildlife and great views back to Mizen Head."
    }
  ],
  "video_url": "https://www.youtube.com/embed/C6Em_aaK-p4?si=pOxDRZqbQFEKJ0Z9",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Crookhaven ED, West Cork, County Cork, Munster, P81 R928, Éire / Ireland",
  "postcode": "P81 R928",
  "district": null,
  "county": "County Cork",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "beach"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "cafe"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}