{
  "created_at": "2025-01-06T11:06:55.677216+00:00",
  "objectID": "aa534d6d30246470d2d8f67bc216943a",
  "ref": "blasket-island-walking-route",
  "title": "Blasket Island Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/View_from_the_fort%2C_Great_Blasket_-_geograph.org.uk_-_1986262.jpg/512px-View_from_the_fort%2C_Great_Blasket_-_geograph.org.uk_-_1986262.jpg?20210511171840",
  "nearby": [
    {
      "description": "Slea Head",
      "objectID": "35c9466a6bdd57ced9ffc6a0db278666",
      "ref": "slea-head-walking-route"
    },
    {
      "description": "Dingle Way",
      "objectID": "6fffbd347c9117478d29580ce3d17c1d",
      "ref": "dingle-way-walking-route"
    },
    {
      "description": "Ballydavid Cliff Walk",
      "objectID": "917f5aef47f58c313c07e306148e4014",
      "ref": "ballydavid-cliff-walk-walking-route"
    },
    {
      "description": "Dunmore Head",
      "objectID": "4490ab29c21182cc1bd8567b5c2f032d",
      "ref": "dunmore-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aa534d6d30246470d2d8f67bc216943a.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/View_from_the_fort%2C_Great_Blasket_-_geograph.org.uk_-_1986262.jpg/512px-View_from_the_fort%2C_Great_Blasket_-_geograph.org.uk_-_1986262.jpg?20210511171840",
      "title": "View from the fort, Great Blasket by Eileen Henderson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from the fort, Great Blasket. The Great Blasket Island, located off the Dingle Peninsula in County Kerry, Ireland, spans over 1,100 acres of wild, mountainous terrain. Measuring about 4 miles long and 0.5 miles wide, it is known for its natural beauty and as a Special Area of Conservation, home to diverse wildlife. The island is uninhabited today but remains an important part of Ireland’s Gaeltacht, the Irish-speaking regions of the country. Though it was abandoned in 1953, the island's rich literary heritage is renowned, with many of its former residents writing books that detail their traditional way of life. Their works are key in preserving the culture and language of the island. Notable authors like Tomás Ó Criomhthain, Peig Sayers, and Muiris Ó Súilleabháin provide an intimate glimpse into the islanders' existence through their writings. Visitors can take boat tours to explore this remote and serene location or opt for an overnight stay in the island's unique self-catering accommodation, providing a true escape into Ireland's past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Great_Blasket_Island_%2851371094192%29.jpg/512px-Great_Blasket_Island_%2851371094192%29.jpg?20211217172853",
      "title": "Maciej Brencz, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Great Blasket Island"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Remaining_homes_on_Great_Blasket_-_geograph.org.uk_-_635109.jpg?20110207101007",
      "title": "Bob Shires / Remaining homes on Great Blasket",
      "caption": "The remaining few habited homes of the abandoned village. The island has a long history of human habitation dating back to the early 1700s. By the 1840s, around 150 people lived there, subsisting primarily on fishing, hunting, and farming potatoes and oats. The island's harsh weather and isolation, especially during the 20th century, made life incredibly challenging. The Congested Districts Board built improved homes around 1910 to alleviate these conditions, and a guesthouse was added later. Despite these efforts, emigration and shortages during WWII led to a decline in the population. The island was finally abandoned in 1954 after a tragic incident where a resident, Seánín Ó Cearnaigh, became ill, and due to the weather, no help could reach the island. This event was the turning point that led the remaining islanders to seek relocation. In 2009, the Irish government purchased most of the property, including the deserted village. Restoration efforts have been underway, with homes of notable islanders like Peig Sayers and Tomás Ó Criomhthain being preserved. The Great Blasket Island now offers a unique experience for visitors, where caretakers live without modern conveniences, echoing the simple, hard life of the former residents. The island's remote allure and literary history continue to attract attention, particularly for its connection to the rich storytelling of the Irish-speaking community."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/The_slipway_on_Great_Blasket_Island_-_geograph.org.uk_-_923760.jpg?20110222043636",
      "title": "Peter Church / The slipway on Great Blasket Island",
      "caption": "The slipway on Great Blasket Island"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Slievedonagh_-_geograph.org.uk_-_923807.jpg?20110222040325",
      "title": "Peter Church / Slievedonagh",
      "caption": "Slievedonagh. Slievedonagh is classically shaped for a mountain, steeply sloping on all sides, and a pointy summit to give great views all round. The island's literary legacy is indeed remarkable, considering its tiny population. The island produced a number of notable writers who vividly depicted the harsh life on the island and preserved its rich oral tradition. The three most famous works are: 1.\t\"An tOileánach\" (The Islandman, 1929) by Tomás Ó Criomhthain: A first-person account of life on the Great Blasket Island, capturing the simplicity and struggle of island existence. 2.\t\"Fiche Bliain ag Fás\" (Twenty Years A-Growing, 1933) by Muiris Ó Súilleabháin: Another memoir, it offers insight into island life, particularly from the perspective of a younger generation. 3.\t\"Machnamh Seanamhná\" (An Old Woman's Reflections, 1939) by Peig Sayers: A collection of reflections by Peig, one of the most prominent storytellers of the island, capturing folk tales and daily struggles. These works are seen as invaluable cultural and historical records, preserving the Irish language and folklore for future generations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/An_Cr%C3%B3_M%C3%B3r%2C_Great_Blasket_Island_-_geograph.org.uk_-_71596.jpg/256px-An_Cr%C3%B3_M%C3%B3r%2C_Great_Blasket_Island_-_geograph.org.uk_-_71596.jpg?20100130130647",
      "title": "Alex Cameron / An Cró Mór, Great Blasket Island",
      "caption": "An Cró Mór, Great Blasket Island. The highest point of the island and, on this occasion, the only part of it not in cloud! The island also became embroiled in a dispute between the Irish State and Blascaoid Mór Teoranta (BMT) over ownership. A settlement in 2007 resolved the conflict, allowing over 95% of the land, including the old village, to be sold to the state, with plans to create a national park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Inishtooskert_Standing_Stones_and_Field_System%2C_Blasket_Islands.jpg/512px-Inishtooskert_Standing_Stones_and_Field_System%2C_Blasket_Islands.jpg?20140830141040",
      "title": "Billy Horan, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Inishtooskert Standing Stones and Field System. On the western side of the island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/The_path_towards_Slievedonagh_-_geograph.org.uk_-_923804.jpg?20110222043538",
      "title": "Peter Church / The path towards Slievedonagh",
      "caption": "The path towards Slievedonagh. The view is southwest, and the highest point of Great Blasket Island beckons. Skellig Michael is on the skyline."
    }
  ],
  "distance_km": 13.25,
  "description": "This walk visits Great Blasket Island off the Dingle Peninsula. The island group the marks the most westerly point in Ireland. You can catch the ferry from Dunquin to the island and then pick up walking trails around the Old Town before heading west to climb to Slievedonagh and An Cró Mór (Croaghmore). From the 346 metre high summit there are glorious views over the surrounding coastline, Dingle Bay and the other islands.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/v5gj22xwmMc?si=3AcfnRZPsrmgFy9O",
  "gazetteer_found": false
}