{
  "created_at": "2025-01-06T18:53:09.862375+00:00",
  "objectID": "aa678fa59283447e978c3d75db5a6b24",
  "ref": "rock-of-dunamase-walking-route",
  "title": "Rock Of Dunamase Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Entrance_to_the_Rock_of_Dunamase_site_-_geograph.org.uk_-_3627187.jpg/512px-Entrance_to_the_Rock_of_Dunamase_site_-_geograph.org.uk_-_3627187.jpg",
  "nearby": [
    {
      "description": "Slieve Bloom Way",
      "objectID": "e216fec10e2343612f00faf2a3f72c86",
      "ref": "slieve-bloom-way-walking-route"
    },
    {
      "description": "Emo Court",
      "objectID": "ca1c9b97d9a1130629fb1bc838dc7c20",
      "ref": "emo-court-walking-route"
    },
    {
      "description": "Derryounce Lakes and Walkways",
      "objectID": "918220d5512af02d9bf281f57168d715",
      "ref": "derryounce-lakes-and-walkways-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aa678fa59283447e978c3d75db5a6b24.gpx",
  "_geoloc": {
    "lat": 53.03105,
    "lng": -7.20825
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Entrance_to_the_Rock_of_Dunamase_site_-_geograph.org.uk_-_3627187.jpg/512px-Entrance_to_the_Rock_of_Dunamase_site_-_geograph.org.uk_-_3627187.jpg",
      "title": "Entrance to the Rock of Dunamase site by Darrin Antrobus, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Entrance to the Rock of Dunamase site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/County_Laois_-_Dunamase_Castle_-_20170314181229.jpg/512px-County_Laois_-_Dunamase_Castle_-_20170314181229.jpg",
      "title": "Avramescu Marius, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Looking down to the old church from the Rock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Dunamase_Castle_%26_Holy_Trinity_The_Rock%2C_Co._Laois_%28506940%29_%2829415774540%29.jpg/512px-Dunamase_Castle_%26_Holy_Trinity_The_Rock%2C_Co._Laois_%28506940%29_%2829415774540%29.jpg",
      "title": "Robert Linsdell from St. Andrews, Canada, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Dunamase Castle & Holy Trinity, The Rock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/View_from_Dunamase_Castle%2C_Co._Laois_%28506931%29_%2829016458114%29.jpg/512px-View_from_Dunamase_Castle%2C_Co._Laois_%28506931%29_%2829016458114%29.jpg",
      "title": "Robert Linsdell from St. Andrews, Canada, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "View from the castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Sunset_at_The_Rock_of_Dunamase.jpg/512px-Sunset_at_The_Rock_of_Dunamase.jpg",
      "title": "Mellickman71, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Beautiful Sunset in the atmospheric photo of the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Farm_track_near_the_Rock_of_Dunamase%2C_Co._Laois_-_geograph.org.uk_-_1390787.jpg",
      "title": "Dylan Moore / Farm track near the Rock of Dunamase, Co. Laois",
      "caption": "Farm track near the site"
    }
  ],
  "distance_km": 1.0,
  "description": "This walk visits the Rock of Dunamase, an ancient Celtic fortification near Portlaoise, County Laois. From the elevated location of the castle there are wonderful views across the surrounding countryside to the Slieve Bloom Mountains. The site of an early Christian settlement pillaged by the Vikings in 842, Dunamase became one of the most important Anglo-Norman strongholds in Laois. It was part of the dowry of Aoife, the daughter of Diarmuid Mac Murrough, King of Leinster, when she was given in marriage to the Norman conqueror Strongbow in 1170. When Isabel, the daughter of Strongbow and Aoife, wed William Marshal, Earl of Pembroke, Dunamase was given as part of her marriage's wedding gift. From 1325 until 1609, the castle belonged to the O’Moore family of Laois, before ownership passed to the Earl of Thomond. It was finally destroyed during the Cromwellian invasion in 1650. To continue your walking in the area you could head north west to pick up the epic Slieve Bloom Way. The long distance waymarked trail runs for 70km, taking you through some of the highlights of the Slieve Bloom Mountains. The Barrow Way can also be picked up just to the east.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Historical Detail: Excavations in the 1990s showed that the Rock was first settled in the 9th century with the construction of a hill fort or dún. The first known settlement was Dun Masc, or Masc’s Fort, an early Christian site pillaged by Vikings in 842. In 845, Vikings from Dublin attacked, resulting in the death of Aed son of Dub dá Chrích, the abbot of Terryglass. There is no clear evidence of occupation from the 10th to 11th centuries. The castle was constructed in the latter half of the 12th century. With the Norman arrival in Ireland in the late 12th century, Dunamase became a key Hiberno-Norman fortification in Laois. Dermot Mac Morrough, King of Leinster, took O'Rourke's wife to Dunamase after kidnapping her. His subsequent expulsion by the O'Rourkes and O'Connors led to his flight from Ireland. In 1170, MacMorrough offered Dunamase and his daughter Aoife to Strongbow, the Norman conqueror, leading to the Norman invasion of Ireland. Later, upon the marriage of Strongbow and Aoife’s daughter, Isabel, Dunamase passed to the Marshal family. William Marshal's five sons inherited in succession but died without heirs, so in 1247, the lands were divided among his daughters. Dunamase went to Eva Marshal and then to her daughter Maud, married to Roger Mortimer. After 1330, when Roger Mortimer was executed for treason, the castle fell out of Norman control and became a ruin by 1350. From the 1400s until the 16th century, Dunamase was part of the O'More family's lands. Rory O'More's resistance to the English led to Laois being known as \"The O'Moore County\". The O'Mores, later the Moores, moved to Kildare in 1574, granted by Elizabeth I. An O'More joined the O'Ferrall family in 1751, becoming More O'Ferrall. The castle was slighted in 1650 during the Cromwellian wars. In the late 18th century, Sir John Parnell began constructing a banqueting hall within the ruins, incorporating medieval architectural elements from other local sites. For more local history head north to visit Emo Court. The splendid neo-classical mansion is surrounded by lovely woodland, parkland, gardens and a lake. Near here there's also the Derryounce Lakes and Walkways at Portarlington. The wildlife rich site includes raised walkways, bog, peaceful woodland and pretty lakes. To the south east there's the town of Carlow where you can pick up the Carlow Oak Park Forest Loop. The trail takes you along boardwalks surrounding a shallow man-made lake with a number of islands."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SmFgHfTerVg?si=NQZqK8PkElDrpoJA",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Rock of Dunamase Information, L6831, Ballycarroll ED, The Municipal District of Graiguecullen — Portarlington, County Laois, Leinster, R32 Y273, Éire / Ireland",
  "postcode": "R32 Y273",
  "district": null,
  "county": "County Laois",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "historical",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}