{
  "objectID": "aa6e40e604cdf93f1a9e019529346547",
  "created_at": "2024-12-18T20:45:12.119917+00:00",
  "ref": "winnats-pass-walking-route",
  "title": "Winnats Pass and Cave Dale Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Winnats_Pass_from_Speedwell_Cavern_car_park_-_geograph.org.uk_-_229319.jpg",
  "nearby": [
    {
      "description": "Peveril Castle",
      "objectID": "c1acc855377b98f8bd9002a5049da813",
      "ref": "peveril-castle-walking-route"
    },
    {
      "description": "Mam Tor",
      "objectID": "c606a40d7c98261f367a913ca269ff48",
      "ref": "mam-tor-walking-route"
    },
    {
      "description": "Limestone Way",
      "objectID": "c8710cae72d7105dbf3f3fc8f79b4e53",
      "ref": "limestone-way-walking-route"
    },
    {
      "description": "Cave Dale",
      "objectID": "ae98223848792a04804c73ecc3104ed1",
      "ref": "cave-dale-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/70CF2A82F3A9C13980257ED2006DA5C8/$FILE/Winnats Pass.gpx",
  "_geoloc": {
    "lat": 53.342928443,
    "lng": -1.7752623389
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Winnats_Pass_from_Speedwell_Cavern_car_park_-_geograph.org.uk_-_229319.jpg",
      "title": "Katy Walters / Winnats Pass from Speedwell Cavern car park",
      "caption": "Winnats Pass from Speedwell Cavern car park. The name is a corruption of 'wind gates' due to the swirling winds through the pass. Speedwell is a tourist attraction with an underground boat trip to the cavern."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Winnats_Pass_-_geograph.org.uk_-_924061.jpg",
      "title": "Stephen Burton / Winnats Pass",
      "caption": "Photographed from rocks high above, Winnats Pass is the only westerly road out of Castleton since the closure of the A625 in the seventies due to subsidence. The pass cuts steeply down through Lower Carboniferous limestone rocks formed about 340 million years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Above_Winnats_Pass_-_geograph.org.uk_-_924079.jpg",
      "title": "Stephen Burton / Above Winnats Pass",
      "caption": "Above Winnats Pass. Weather eroded limestone rock formation. This is the northern edge of the white peak as you travel further north you arrive at the millstone grit of the dark peak."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Winnats_Pass_from_Mam_Tor_-_geograph.org.uk_-_217515.jpg",
      "title": "Matthew Barker / Winnats Pass from Mam Tor",
      "caption": "Winnats Pass from Mam Tor. The formation of Winnats Pass was previously attributed to a massive collapsed cavern, but this theory has been replaced by newer understanding. Instead, Winnats Pass is recognised as a steep gorge carved through Lower Carboniferous limestone rocks. These limestone formations date back around 340 million years ago when they were part of a reef bordering a shallow lagoon, surrounded by deeper waters. Evidence of fossil-rich rock layers, known as 'beach beds,' at the foot of Winnats Pass near Speedwell Cavern suggests the presence of an ancient underwater cleft or canyon within the active reef. This underwater feature likely accumulated shell and crinoid remains over time. Subsequently, these sediments were buried under Namurian sandstones and shales during the Upper Carboniferous period. Geological uplift later exposed these formations, with periglacial erosion during the late Pleistocene epoch revealing the gorge we see today. As melting water followed natural weaknesses in the limestone, such as those created by the original underwater cleft, it gradually carved out Winnats Pass."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Top_rocks_of_Winnats_Pass_-_geograph.org.uk_-_3049902.jpg/512px-Top_rocks_of_Winnats_Pass_-_geograph.org.uk_-_3049902.jpg",
      "title": "Top rocks of Winnats Pass by Peter Barr, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Top rocks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Fields_below_Winnat%27s_Pass_-_geograph.org.uk_-_2153350.jpg/512px-Fields_below_Winnat%27s_Pass_-_geograph.org.uk_-_2153350.jpg",
      "title": "Fields below Winnat's Pass by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Fields below the Pass"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Cave_Dale_at_Castleton_-_geograph.org.uk_-_1960009.jpg/512px-Cave_Dale_at_Castleton_-_geograph.org.uk_-_1960009.jpg",
      "title": "Cave Dale at Castleton by Martin Speck, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cave Dale at Castleton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Peveril_Castle_Keep_-_geograph.org.uk_-_1343464.jpg",
      "title": "Martin / Peveril Castle Keep",
      "caption": "Peveril Castle Keep. The castle was the principal settlement of the feudal barony known as the Honour of Peverel, founded by William Peverel after the Norman Conquest of 1066. Peverel, a tenant-in-chief to the king, held extensive lands across Nottinghamshire and Derbyshire. The castle is first mentioned in the Domesday Survey of 1086 and was a significant economic and administrative hub for the barony. The castle offers stunning views across the Hope Valley and Cave Dale and is renowned for its strategic location. Today, the site is maintained by English Heritage and is protected both as a Scheduled Monument and a Grade I listed building, emphasising its historical and architectural significance. Described as the finest medieval landmark of the Peak District, the castle is recognized internationally for its importance. Noted architectural historian Nikolaus Pevsner regarded it as \"by far the most important castle in the county.\" The surrounding landscape has been part of the Peak District National Park since 1951, further preserving its natural and historic beauty."
    }
  ],
  "distance_km": 7.5,
  "description": "This challenging circular walk in the Peak District takes you through this spectacular hill pass. The walk starts at the village of Castleton and climbs through Winnats Pass with its towering limestone pinnacles. It's a wonderful geological feature and worth the steep climb. On the way you'll pass Speedwell Cavern where you can take an amazing underground boat trip 450m under the Hills of Castleton. The walk makes use of the Limestone Way to return to Castleton, passing Cave Dale, Mam Tor and the fascinating Peveril Castle. This ruined medieval castle has an amazing history stretching back to the Norman Conquest of 1066. The walk can be extended to visit the nearby Mam Tor. The steep pass is also popular with cyclists with the challenging climb featuring in the Tour of the Peak cycle race each autumn.",
  "video_url": "https://www.youtube.com/embed/on1XUKWjzj8",
  "district": "Castleton",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}