{
  "created_at": "2025-01-05T23:48:38.330288+00:00",
  "objectID": "aa79a6d3c64691f4767e729e725a5944",
  "ref": "goldsborough-walking-route",
  "title": "Goldsborough Hall Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Goldsborough_Hall_-_geograph.org.uk_-_1976194.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aa79a6d3c64691f4767e729e725a5944.gpx",
  "_geoloc": {
    "lat": 53.999391956,
    "lng": -1.4135220633
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Goldsborough_Hall_-_geograph.org.uk_-_1976194.jpg",
      "title": "DAVID M GOODWIN, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Goldsborough Hall. A country house built in the 1620s for Sir Richard Hutton, at a time when brick was both fashionable and expensive [local magnesian limestone would probably have been cheaper]. The interior was much altered [possibly by Adam] in the 18th century, whilst the building has had a variety of uses in the 20th century including a school and a retirement home. Now used for corporate events, weddings etc., more information about the house can be found on the Goldsborough Hall website."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Village_street%2C_Goldsborough_-_geograph.org.uk_-_640526.jpg",
      "title": "Gordon Hatton / Village street, Goldsborough",
      "caption": "Village street. Goldsborough is very much an 'estate' village with many buildings of the 18th century. This block appears to be late 18th or early 19th century, and forms an effective screen in front of the hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/St_Mary%27s%2C_Goldsborough_-_geograph.org.uk_-_640522.jpg",
      "title": "Gordon Hatton / St Mary's, Goldsborough",
      "caption": "St Mary's, Goldsborough. Village church dating mostly from the late 13th and early 14th centuries. The tower is slightly later."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/The_Bay_Horse_Inn_-_geograph.org.uk_-_1988522.jpg",
      "title": "The Bay Horse Inn by DAVID M GOODWIN, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Bay Horse Inn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Ribston_Hall_and_chapel_%28geograph_4426554%29.jpg/512px-Ribston_Hall_and_chapel_%28geograph_4426554%29.jpg",
      "title": "Derek Harper / Ribston Hall and chapel",
      "caption": "Ribston Hall and chapel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Goldsborough_Lodge_-_geograph.org.uk_-_294582.jpg",
      "title": "manonabike / Goldsborough Lodge",
      "caption": "Goldsborough Lodge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Ribston_Park_-_geograph.org.uk_-_325456.jpg",
      "title": "manonabike / Ribston Park",
      "caption": "Ribston Park. Privately owned bridge over River Nidd, built 1865."
    }
  ],
  "distance_km": 6.0,
  "description": "This village in North Yorkshire is located close to both Harrogate and Knaresborough. There's some interesting history here with a fine old Jacobean Hall and a 16th century pub to investigate. This walk from the village visits Goldsborough Hall and the nearby Ribston Hall. The walk starts at the 16th century Goldsborough Hall where you can enjoy pleasant walks through the parkland, landscaped gardens and woodland on the estate. The gardens at Goldsborough Hall are open to the public until 30th September 2021 on selected dates with more details on the link below. It's a lovely place for a stroll with a Lime Tree avenue and herbaceous borders to admire. You then head west through the village to pick up the Knaresborough Round. You can then follow this waymarked footpath south to see the neighbouring Ribston Hall which lies a couple of miles to the south. The privately owned 17th-century country mansion is situated in a lovely spot on the banks of the River Nidd.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bay Horse Inn dates back to the 16th century. They serve good quality food and have a nice garden area for warmer days. The inn has recently been refurbished and is very walker and dog friendly. You can find them on Main Street at postcode HG5 8NW."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The historic Beningbrough Hall lies a few miles east. The grounds of this Georgian mansion are a fine place for a stroll with views of the River Ouse and beautiful gardens to enjoy. On the opposite side of the river you can also see the village of Nun Monkton which sits at the confluence of the River Nidd and Ouse. The village has some interesting features including a village green, duck pond, pretty cottages, riverside trails and the impressive 17th century Nun Monkton Priory. For more walking ideas in the area see the Nidderdale Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PxlKKsAsB60",
  "postcode": "HG5 8AP",
  "district": "Goldsborough",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}