{
  "created_at": "2025-01-06T05:00:05.163610+00:00",
  "objectID": "aa8dab5e80773f6d00e0f3fd95895710",
  "ref": "st-helens-walking-route",
  "title": "St Helens Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sankey_St.Helens_Canal_-_geograph.org.uk_-_40430.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aa8dab5e80773f6d00e0f3fd95895710.gpx",
  "_geoloc": {
    "lat": 53.4609092649,
    "lng": -2.7298408737
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sankey_St.Helens_Canal_-_geograph.org.uk_-_40430.jpg",
      "title": "andy / Sankey St.Helens Canal",
      "caption": "Sankey St.Helens Canal. This is a view looking WSW down the Sankey St.Helens Canal. This canal used to be busy with fishermen throughout the year but are no longer allowed to fish here due to an unstable canal wall. The canal is now becoming over run with weed and algae. The Trans Pennine Trail runs along here and Fiddlers Ferry Power Station can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/St_Helens_Canal_-_geograph.org.uk_-_319142.jpg",
      "title": "Alan Murray-Rust / St Helens Canal",
      "caption": "The Sankey Canal was officially known for many years as the St Helens Canal, but has reverted to its earlier title in recent years. The Canal in St Helens itself was formally closed in 1931, although there had been virtually no traffic since the turn of the century. the local glass industry is prominent in this view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Sankey_St.Helens_Canal_-_geograph.org.uk_-_40229.jpg",
      "title": "andy / Sankey St.Helens Canal",
      "caption": "This is a view looking NNW along what used to be part of the now disused Sankey St.Helens Canal. If you look at the historical map of this area you can see two distinctive spurs that clearly were not part of the main canal. One of those spurs can just be seen heading off to the right of the picture and now form part of a large fishing lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Fiddlers_Ferry_Lock%2C_St_Helens_Canal_-_geograph.org.uk_-_950610.jpg",
      "title": "A-M-Jervis / Fiddlers Ferry Lock, St Helens Canal",
      "caption": "Fiddlers Ferry Lock, St Helens Canal. A short section of the canal, earlier called the Sankey Navigation, is still used for moorings near Fiddlers Ferry, halfway between Widnes and Warrington. To access this from the tidal River Mersey this lock is used, seen here looking towards the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Sankey_St.Helens_Canal_%28disused%29_-_geograph.org.uk_-_40221.jpg",
      "title": "andy / Sankey St.Helens Canal (disused)",
      "caption": "Sankey St.Helens Canal (disused) This is a small section of the Sankey St.Helens Canal and forms part of Sankey Valley Park. This particular section of water is only around 150 metres long and just clips the bottom left hand corner of this grid square. It is well stocked with coarse fish and Newton Anglers have rights."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_view_of_the_Sankey_Valley_from_Stephenson%27s_Viaduct%2C_as_seen_from_the_12.01_from_Newton-le-Willows_-_geograph.org.uk_-_1526571.jpg",
      "title": "David Long / The view of the Sankey Valley from Stephenson's Viaduct, as seen from the 12.01 from Newton-le-Willows",
      "caption": "The view of the Sankey Valley from Stephenson's Viaduct, as seen from the 12.01 from Newton-le-Willows. The Sankey Brook runs leftwards from the centre. Parallel to it, and conveniently marked by a cyclist, runs the line of the infilled Sankey/ St Helens Canal. Stephenson had to build the massive viaduct, a 'first' in railway engineering, to accommodate the masts of the Mersey flats, the sailing vessels for which England's first industrial canal was built."
    }
  ],
  "distance_km": 11.5,
  "description": "This large town in Merseyside has some nice waterside footpaths along the St Helens Canal and the nearby Carr Mill Dam to try. Part of the expansive Sankey Valley Park also runs through the area providing a scenic environment for walkers. This walk takes you along the old St Helens Canal from the town to nearby Newton-le-Willows. You'll enjoy views of the Sankey Brook as you pass through a section of the Sankey Valley Park. There's lots of nice waterside sections with good views to the surrounding countryside as well. Start the walk at the eastern side of the town where you can pick up a public footpath along the canal and brook. The path runs east, passing Ashton's Green and Newton Common before coming into Newton-le-Willows. You can extend the walk by continuing along the canal to the Mucky Mountain Nature Reserve. At the other end of the canal there's another section of the Sankey Park in Warrington .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the town centre head to the Cricketers Arms for some post walk refreshments. The friendly pub is well known for its extensive selection of ales. You can find the pub at 64 Peter Street with a postcode of WA10 2EB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park and canal make for a very pleasant dog walk. The Cricketers Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For great views over the town head north and enjoy a climb to Billinge Hill. The hill summit stands at a height of 179 m (587 ft) commanding fine views towards Great Orme in Wales, Blackpool tower, Greater Manchester, Winter Hill and the Derbyshire Peak District. On the southern edge of the town there's Sutton Manor Park to explore. The popular park includes the iconic Dream Sculpture which is a local highlight and well worth seeing. There's also a great viewpoint and the adjacent Clock Face Country Park to visit here."
    }
  ],
  "postcode": "WA10 1ND",
  "district": "St Helens",
  "region": "Liverpool City Region",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Haresfinch Road, Gerard's Bridge, St Helens, Liverpool City Region, England, WA10 1ND, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "park",
    "waterfront"
  ],
  "points_of_interest": [
    "nature reserve",
    "park"
  ],
  "facilities": [
    "public footpath",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}