{
  "created_at": "2025-01-06T02:22:12.202215+00:00",
  "objectID": "aaaf80ca71251ad7962a3c80e3e8af45",
  "ref": "botallack-mine-walking-route",
  "title": "Botallack Mine Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_Arsenic_Labyrinth_at_Botallack_Mine_-_geograph.org.uk_-_490315.jpg",
  "nearby": [
    {
      "description": "Cape Cornwall",
      "objectID": "9fe1680b259771101a78466a25d4edd5",
      "ref": "cape-cornwall-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Sennen to Lands End Walk",
      "objectID": "045b5d7d9d11a7802a65a9ccee7b1709",
      "ref": "sennen-to-lands-end-walk-walking-route"
    },
    {
      "description": "Kenidjack Valley",
      "objectID": "f7d8f456a64679faa9e6107c0e280fbe",
      "ref": "kenidjack-valley-walking-route"
    },
    {
      "description": "St Just",
      "objectID": "1dbe83eacaf4d3039df75c260d62ce2f",
      "ref": "st-just-walking-route"
    },
    {
      "description": "Cot Valley",
      "objectID": "bb35fe65d8452d8d7f6e4d0c4223cf4b",
      "ref": "cot-valley-walking-route"
    },
    {
      "description": "Levant Mine",
      "objectID": "871b140b7e8c88de7cf506ee5fa8d4b0",
      "ref": "levant-mine-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aaaf80ca71251ad7962a3c80e3e8af45.gpx",
  "_geoloc": {
    "lat": 50.1398189253,
    "lng": -5.688874596
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_Arsenic_Labyrinth_at_Botallack_Mine_-_geograph.org.uk_-_490315.jpg",
      "title": "Tony Atkin / The Arsenic Labyrinth at Botallack Mine",
      "caption": "The Arsenic Labyrinth at Botallack Mine Arsenic compounds were an unwanted pollutant in tin ore which ruined the smelting process. The solution was to heat the ore to drive off the arsenic as a vapour. In the early days of mining this badly polluted the surrounding countryside. However arsenic itself proved to be a saleable by-product so the arsenic fumes were sent through a labyrinth of tunnels where it would condense on the tunnel walls. This photo shows part of the arsenic labyrinth at Botallack mine. The maze of tunnels has partially collapsed. Half way through the labyrinth, the tunnel passes over the top of an arch to cross one of the entrances to the mine. At the end of the labyrinth the remaining fumes passed up the tall chimney shown in the photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Modern_Remains_at_Botallack_Mine_-_geograph.org.uk_-_490425.jpg",
      "title": "Tony Atkin / Modern Remains at Botallack Mine",
      "caption": "Modern Remains at Botallack Mine. While the history of Botallack mine spans the 19th century and into the early years of 20th it does not quite end there. This skeleton, the remains of modern headgear, was the result of an attempt to reopen workings at the mine in the 1980's, however a collapse in the price of tin ended this venture before it had got very far."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/The_Botallack_Mine_Count_House_-_geograph.org.uk_-_964482.jpg",
      "title": "Tony Atkin / The Botallack Mine Count House",
      "caption": "The Botallack Mine Count House. The two storey building was originally built as the mine count house. The count house was the mine office where all the financial work was done overseen by the mine purser. Outside of this building, once a month, the miners would bid in a Dutch auction to work pitches in the mine, the lowest bidder for each pitch got to work it for the next month. The count house was also the venue for meetings of the mine adventurers, people we would call investors nowadays."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Pub_and_Houses_in_Botallack_Village_-_geograph.org.uk_-_489977.jpg",
      "title": "Tony Atkin / Pub and Houses in Botallack Village",
      "caption": "Queens Arms Pub and Houses in Botallack Village. The village is set on quiet back lanes as the main road passes the village to the south east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Industrial_Remains_at_Botallack_Mine_-_geograph.org.uk_-_490406.jpg",
      "title": "Tony Atkin / Industrial Remains at Botallack Mine",
      "caption": "Industrial Remains at Botallack Mine. The circular structures look like the remains of \"buddles\" which were devices used to concentrate tin ore after it had been crushed and mixed with water. A lot like gold panning but on an industrial scale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/The_Coast_Path_near_Botallack_-_geograph.org.uk_-_964503.jpg",
      "title": "Tony Atkin / The Coast Path near Botallack",
      "caption": "The Coast Path near Botallack"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Engine_Houses%2C_Crowns_Mine%2C_Botallack_-_geograph.org.uk_-_1880948.jpg/512px-Engine_Houses%2C_Crowns_Mine%2C_Botallack_-_geograph.org.uk_-_1880948.jpg",
      "title": "Engine Houses, Crowns Mine, Botallack by Paul Buckingham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Engine Houses, Crowns Mine"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Crowns_Mine%2C_Botallack_-_geograph.org.uk_-_4050.jpg",
      "title": "Michael Parry / Crowns Mine, Botallack",
      "caption": "Crowns Mine. The lower building is the pumping house for the Crowns engine shaft. The other contained the winder for the \u0091Diagonal shaft\u0092 which ran for 797 m at an angle of 32.5 degrees to a point 414 m below sea level and 786 m beyond the cliffs."
    }
  ],
  "distance_km": 2.0,
  "description": "This circular walk visits the historic Botallack Mine from the west Cornish village of Botallack. The mine is part of a UNESCO World Heritage Site known as the Cornwall and West Devon Mining Landscape. The walk exposes you to the industrial heritage of the area while also providing some wonderful coastal views at the western end. The mine is located just north of St Just, the most westerly town in mainland Britain. You can start the walk from the National Trust car park at the Counting House. From here it is a short stroll to the old mines. The photogenic mines were worked for tin and copper for over 500 years and include the Wheal Edward engine house and the Crowns engine houses. For a longer route through the area see the Cape Cornwall Walk. This visits a wonderful coastal headland with views of the Isles of Scilly and Land's End. You can reach the headland by following the epic South West Coast Path south past Kenidjack Castle, an ancient Iron Age Castle. The Zennor Churchway and Tinners Way also passes the site. This long distance trail visits more historic Cornish sites including other mines, hill forts and stone circles.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village you can enjoy refreshments at The Queen's Arms at postcode TR19 7QG. They have a restaurant serving quality food and a nice garden area to sit out in."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Kenidjack Valley Walk starts from the same car park. It explores the valley to the south of Botallack with more old mining buildings and the Tregeseal River to see. Just to the north is the Geevor Mine and Levant Mine near Pendeen. Levant mine is notable as the only Cornish beam engine that is still in steam on its original mine site. The Levant engine sits in a small engine house in a dramatic location on the edge of the cliffs. Just to the south is the lovely Cot Valley at Porth Naven. The secluded valley is a fine place for a stroll with a picturesque stream and lots of wildlife to see. A few miles to the east you can pick up the Penwith Moors and Men-An-Tol Walk. This fascinating walk visits several ancient sites including Men-An-Tol standing stones and the Lanyon Quoit dolmen. You'll also pass the remains of the old Ding Dong Mines and climb to the fine viewpoint at Carn Galver."
    }
  ],
  "video_url": "https://www.youtube.com/embed/OW52ousgBs0",
  "postcode": "TR19 7QQ",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Botallack Mine Count House, Botallack, Trewellard, St Just, Cornwall, England, TR19 7QQ, United Kingdom",
  "district": "St Just",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "historical"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "Iron Age Castle"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}