{
  "created_at": "2025-01-06T03:42:41.636310+00:00",
  "objectID": "aadebc94edfe684ca26bdce38fc57121",
  "ref": "chippenham-to-calne-railway-path-walking-and-cycle-route",
  "title": "Chippenham to Calne Railway Cycle Path Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Old_Bridge_on_the_Chippenham_to_Calne_railway_-_geograph.org.uk_-_46631.jpg",
  "nearby": [
    {
      "description": "National Cycle Route 4",
      "objectID": "7a3167231541e999ce8a9680f2820926",
      "ref": "national-cycle-route-4-cycle-route"
    },
    {
      "description": "Colerne",
      "objectID": "e70f61e0249cd82221e5e74abeeee674",
      "ref": "colerne-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aadebc94edfe684ca26bdce38fc57121.gpx",
  "_geoloc": {
    "lat": 51.4556724258,
    "lng": -2.1079662416
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Old_Bridge_on_the_Chippenham_to_Calne_railway_-_geograph.org.uk_-_46631.jpg",
      "title": "Ron Strutt / Old Bridge on the Chippenham to Calne railway, via Wikimedia Commons",
      "caption": "Old Bridge on the Chippenham to Calne railway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Black_Dog_Halt%2C_near_Calne%2C_Wilts_-_geograph.org.uk_-_40305.jpg",
      "title": "Ron Strutt / Black Dog Halt, near Calne, Wilts, via Wikimedia Commons",
      "caption": "Black Dog Halt, near Calne, Wilts. Black Dog Halt was on the railway branch line between Chippenham and Calne in Wiltshire. The halt was built in 1873 to serve nearby Bowood House; it only became a public station in 1952 and closed with the rest of the line in 1965. The line is now a cycle path, part of the National Cycle Network route 4 from London to the West. The railings are by artist Laura Lian."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Bridge_over_the_River_Avon%2C_Chippenham_-_geograph.org.uk_-_44056.jpg",
      "title": "Ron Strutt / Bridge over the River Avon, Chippenham, via Wikimedia Commons",
      "caption": "Bridge over the River Avon, Chippenham. When the Chippenham to Calne branch railway was closed, the bridge which carried the line over the River Avon was demolished for scrap. Most of the line has now been converted into a cycle path, so this fine new bridge has been provided to replace the lost bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Chippenham_to_Calne_Cycle_Path_-_geograph.org.uk_-_225610.jpg",
      "title": "Tim Giles / Chippenham to Calne Cycle Path",
      "caption": "Chippenham to Calne Cycle Path. Part of National Cycle Route 4 at the site of Stanley Abbey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Bridge_near_Pound_Farm_-_geograph.org.uk_-_1545321.jpg",
      "title": "Trevor Rickard / Bridge near Pound Farm",
      "caption": "Bridge near Pound Farm. Carrying Stanley Lane over the cycleway, which follows the disused Chippenham-to-Calne branch line. Just beyond the bridge was once Stanley Bridge Halt, and here the cycleway follows the lane for a short distance before rejoining the track bed most of the way to Calne. The Calne branch line was opened in October 1863 and had always been busy despite its short length. Large numbers of passengers plus freight services for Calne businesses (including Harris pork pies), local farms, and the military establishments at Yatesbury and Compton Basset, did not save it from the Beeching axe. Freight working ended in November 1964 and passenger trains ended in September 1965."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Cycleway_near_New_Leaze_Farm_-_geograph.org.uk_-_1545222.jpg",
      "title": "Trevor Rickard / Cycleway near New Leaze Farm",
      "caption": "Cycleway near New Leaze Farm. Bencroft Hill on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Cycleway_indicator_at_Stanley_Bridge_Halt_-_geograph.org.uk_-_1545358.jpg",
      "title": "Trevor Rickard / Cycleway indicator at Stanley Bridge Halt",
      "caption": "Cycleway indicator at Stanley Bridge Halt. Looking east from near Pound Farm with Riverside Farm on the left. The scrub land below was once Stanley Bridge Halt on the Chippenham-Calne branch line. The old track bed, for most of its length, has been converted into a cycleway, which has many of these unusual curved and carved waymarkers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Chaveywell_Bridge%2C_Calne_-_geograph.org.uk_-_746146.jpg",
      "title": "John Sparshatt / Chaveywell Bridge, Calne",
      "caption": "Chaveywell Bridge. Part of the disused Wilts & Berks Canal, near Calne. This is located in the pretty Castlefields Park at the end of the route in Calne. The park is a nice place to relax and enjoy a picnic."
    }
  ],
  "distance_km": 10.0,
  "description": "This is a nice easy cycle or walk along the disused railway path from Chippenham to Calne. It follows National Cycle route 403 and includes lovely riverside runs along the River Avon and the River Marden. The route is almost entirely traffic free so is an ideal option for a family cycle ride or easy walk. At the end of the trail near Calne, where recommend taking a small detour south of the route to visit the splendid Bowood House. The fine Georgian House is surrounded by beautiful parkland and gardens. The trail forms part of National Cycle Route 4 so you can continue your ride along this Sustrans signed route.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of Chippenham you could visit the neighbouring village of Biddestone. The settlement is very quaint with a village pond, attractive cottages and views of the Bybrook River which meanders through the area. Near here is the worthy village of Box. The village includes more nice trails along the brook and the famous Box railway tunnel created by Isambard Kingdom Brunel in the early 19th century. Near here there's also Colerne where there's nearly 90 historic listed buildings including a 13th century church and a noteworthy 17th century stone pub. For more walking ideas in the area see the Wiltshire Walks and North Wessex Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/k3E3cQBtfZQ",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}