{
  "created_at": "2025-01-05T23:31:41.683725+00:00",
  "objectID": "ab4c34c84ac5b84136555d8306a71c18",
  "ref": "clumber-country-park-walking-and-cycle-route",
  "title": "Clumber Park Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Gateway_into_the_gardens%2C_Clumber_-_geograph.org.uk_-_653955.jpg",
  "nearby": [
    {
      "description": "Robin Hood Way",
      "objectID": "e72ffb12ff717d64aebbc0af8854daaa",
      "ref": "robin-hood-way-walking-route"
    },
    {
      "description": "Sherwood Forest Country Park",
      "objectID": "d7972571afb8aab4ff1084a675e2938d",
      "ref": "sherwood-forest-country-park-walking-and-cycle-route"
    },
    {
      "description": "Nottingham to Worksop",
      "objectID": "ceb29321991950cb3f4c90f9f7136108",
      "ref": "nottingham-to-worksop-cycle-route"
    },
    {
      "description": "National Cycle Route 6 Mansfield",
      "objectID": "69d0043d5505f95795ab86ddfd75e6b2",
      "ref": "national-cycle-route-6-mansfield-cycle-route"
    },
    {
      "description": "Vicar Water Country Park",
      "objectID": "e7d23568d227f3930c263bd1c2fceafc",
      "ref": "vicar-water-country-park-walking-and-cycle-route"
    },
    {
      "description": "Worksop",
      "objectID": "e2914d069ca6ceceb3bbf7d8eea6069b",
      "ref": "worksop-walking-route"
    },
    {
      "description": "Cresswell Crags",
      "objectID": "1093193b6d52aa28ac9b34b61bcb244d",
      "ref": "cresswell-crags-walking-route"
    },
    {
      "description": "Rufford Abbey Country Park",
      "objectID": "fce79a9fa7cc74d4957c983267d30ec4",
      "ref": "rufford-country-park-walking-route"
    },
    {
      "description": "Edwinstowe",
      "objectID": "0cbbe051aa2e2d752d244854fa89149a",
      "ref": "edwinstowe-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ab4c34c84ac5b84136555d8306a71c18.gpx",
  "_geoloc": {
    "lat": 53.2742920955,
    "lng": -1.0498248853
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Gateway_into_the_gardens%2C_Clumber_-_geograph.org.uk_-_653955.jpg",
      "title": "Derek Harper / Gateway into the gardens, Clumber",
      "caption": "Gateway into the gardens. Vermiculate stonework decorates this little archway at the northeastern end of the gardens at Clumber. The sign to the right directs cyclists around the outside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Weir%2C_Clumber_Park_-_geograph.org.uk_-_653654.jpg",
      "title": "Derek Harper / Weir, Clumber Park",
      "caption": "Weir, Clumber Park. The small weir, of limestone blocks, divides the lake. At the far end is the Grotto, and the weir forms part of the water management system. On the left is Clumber Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Bluebells_in_Clumber_Park_-_geograph.org.uk_-_794483.jpg",
      "title": "roger geach / Bluebells in Clumber Park",
      "caption": "Bluebells in the woodland area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Lime_Avenue%2C_Clumber_Park_-_geograph.org.uk_-_53357.jpg",
      "title": "Richard Croft / Lime Avenue, Clumber Park",
      "caption": "Lime Avenue. 3 miles long and 4 rows wide, the magnificent avenue of Lime trees stretches from Apleyhead gate through Clumber Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/%22Temple%22_at_Clumber_Park%2C_looking_South_East_across_the_lake_-_geograph.org.uk_-_285507.jpg",
      "title": "Robert Neilson / \"Temple\" at Clumber Park, looking South East across the lake",
      "caption": "\"Temple\", looking South East across the lake. This \"temple\" is one of many focal points, built in a classical style, that are found in Clumber Park. It affords a sheltered resting place for those who venture on a walk around the lake. This view is from the North West shore of the lake and also features Canada geese swimming line astern in the North Easterly direction of flow. This temple can also be seen from a smaller temple which is set back from the North West shore of the lake, near Clumber Chapel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Grotto%2C_Clumber_Park_-_geograph.org.uk_-_652970.jpg/256px-Grotto%2C_Clumber_Park_-_geograph.org.uk_-_652970.jpg",
      "title": "Derek Harper / Grotto, Clumber Park",
      "caption": "Grotto by the lake. With the nearby Pump House, this garden feature, at the head of an inlet from the lake, helped control the water supply for Clumber. A notice explains that a treble ram vertical pump was installed here in 1931, powered by an existing turbine, and turned by the metre difference in the lake level created by an artificial weir close by. The machinery can still be used in times of power failure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Small_Temple_near_Clumber_Chapel_-_geograph.org.uk_-_285513.jpg",
      "title": "Robert Neilson / Small Temple near Clumber Chapel",
      "caption": "Small Temple near Clumber Chapel. Set well back from the North Western side of Clumber Lake, this small \"temple\" is often used as a resting place for visitors to Clumber Park who make an anti-clockwise circuit of the grounds on the North Western side of the lake. At the end of the lakeside path, a well worn path goes through open woodland where grey squirrels and a variety of birds can be seen. This small \"temple\" can also be seen from the larger equivalent near the South Eastern shore of the lake (see other picture) and vice versa."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Cycle_hire%2C_Clumber_park_-_geograph.org.uk_-_652134.jpg/512px-Cycle_hire%2C_Clumber_park_-_geograph.org.uk_-_652134.jpg",
      "title": "Derek Harper / Cycle hire, Clumber park",
      "caption": "Cycle hire, Clumber park. A well-used facility, given the miles of gently-sloping terrain within the estate. The building is dated 1903. Showing above the roof is the spire of Clumber Chapel."
    }
  ],
  "distance_km": 8.0,
  "description": "Enjoy a peaceful walk or cycle around the fabulous Clumber Park in Worksop. Clumber Park contains over 3,800 acres of woodland, open heath and rolling farmland. There is also a beautiful serpentine lake and a picturesque avenue of lime trees that runs for 2 miles. Also of interest is the picture postcard Hardwick Village, the Gothic Clumber Chapel and the Walled Kitchen Garden. The route below is devised for walkers but the park is excellent for cycling, particularly around the lake area. You can hire bikes and pick up route guides from within the park - please click here for more information. The routes are nice and safe so ideal for families. National Cycle Route 6 also passes through the park linking it to Sherwood Forest - see the Nottingham to Worksop cycle route for more information. You can also visit the park from nearby Mansfield using the signed route. Our Mansfield Cycle Route starts just east of the town at the lovely Vicar Water Country Park. It's a nice way to visit both parks on your bike in a day. To extend your walking in the area you could follow the Robin Hood Way north west from the park and visit the nearby Welbeck Estate. Here you'll find two pretty lakes and a large deer park with resident white deer.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site cafe is very impressive being housed in what used to be the Duke of Newcastle’s study. They serve fine local food including hand made pizzas from their pizza oven and fruit and vegetables from their kitchen garden. It's in a great spot too with excellent views over the lake."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is an excellent place for dog walking with miles of woodland and parkland trails to explore. There's even a dedicated indoor area near the cafe where dog beds and blankets are provided. The 'Central Bark' cafe is located near the Walled Kitchen Garden and is geared up for dog walkers. They are kitted out with dog products, treats and toys."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head just a couple of miles south of the park and you could visit the splendid Thoresby Park. There's 1000 acres on the estate which includes woodland, a lake and views of the River Meden which runs through the park. There's also an interesting museum, a Victorian Courtyard and a gallery to see. Just south of Thoresby there's the splendid Sherwood Forest Country Park. There's more great cycling and walking routes here with a visitor centre and the 800 year old Major Oak to see. The ancient tree is a highlight of the area and rumoured to be the base of Robin Hood. Around here there's Rufford Abbey Country Park near Edwinstowe. The historic abbey ruins are well worth a visit with a surrounding country park which includes a picturesque lake and beautiful gardens. A few miles west of the park there's Cresswell Crags where you'll find a wonderful limestone gorge on the Derbyshire and Nottinghamshire border. There's good walking trails, lots of interesting wildlife and a fascinating museum where you can see bones of lynx, beaver and wild pig dating from the last Ice Age 9,500 years ago. Cyclists can pick up National Cycle Route 647 to the south of the park. This largely off road route can be used to visit the Fledborough Viaduct which lies just to the east. There's some fine views over the River Trent valley countryside from the top of the viaduct. For more walking ideas in the area see the Nottinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/TQjS9t3mkpE",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hardwick Top Road, Hardwick, Clumber and Hardwick, Bassetlaw, Nottinghamshire, East Midlands, England, S80 3PD, United Kingdom",
  "postcode": "S80 3PD",
  "district": "Bassetlaw",
  "state": "England"
}