{
  "created_at": "2025-01-06T03:44:51.454200+00:00",
  "objectID": "ac67b521462a354e31726a78bd96d2bc",
  "ref": "marriots-way-walking-and-cycle-route",
  "title": "Marriot's Way Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Marriot%27s_Way_-_geograph.org.uk_-_1168711.jpg",
  "nearby": [
    {
      "description": "Foxley Wood",
      "objectID": "43613f82844b42b84e584f5774dbcbd4",
      "ref": "foxley-wood-walking-route"
    },
    {
      "description": "Hellesdon Circular Walk",
      "objectID": "2c4042b4806ce4f6b61d451a856c21aa",
      "ref": "hellesdon-circular-walk-walking-route"
    },
    {
      "description": "Norwich Riverside Walk",
      "objectID": "384fcd894f6a38346574000e43d48f68",
      "ref": "norwich-riverside-walk-walking-route"
    },
    {
      "description": "Reepham",
      "objectID": "1d6560825cb37c1ff41ff63d928e9b80",
      "ref": "reepham-walking-route"
    },
    {
      "description": "Blickling Hall",
      "objectID": "a593d691cedb661ce3eefc3bbc3798c0",
      "ref": "blickling-hall-walking-and-cycle-route"
    },
    {
      "description": "Marsham Heath",
      "objectID": "ab8aabc75d8893283f4ef0ceb344ae5c",
      "ref": "marsham-heath-walking-route"
    },
    {
      "description": "Wensum Way",
      "objectID": "7a61e58c3e16c3b4151217e5f173b3bf",
      "ref": "wensum-way-walking-route"
    },
    {
      "description": "Rebellion Way",
      "objectID": "ce673553ec15d7a7286596120f836ac9",
      "ref": "rebellion-way-cycle-route"
    },
    {
      "description": "Norwich To Cromer",
      "objectID": "e558f6b02437c828f3b918636c53b39b",
      "ref": "norwich-to-cromer-cycle-route"
    },
    {
      "description": "Taverham Mill",
      "objectID": "fa7a8224780929ec4837602559642b9f",
      "ref": "taverham-mill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ac67b521462a354e31726a78bd96d2bc.gpx",
  "_geoloc": {
    "lat": 52.7909416472,
    "lng": 1.2546224662
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Marriot%27s_Way_-_geograph.org.uk_-_1168711.jpg",
      "title": "Ashley Dace / Marriot's Way",
      "caption": "Marriot's Way. A slight cutting from the railway that ran here. The line (from Melon Constable to Norwich) opened in 1882 and closed by BR in 1959 (passenger) and 1969 to freight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Marriot%27s_Way%2C_Thorpe_Marriott_-_geograph.org.uk_-_347155.jpg",
      "title": "Ian Robertson / Marriot's Way, Thorpe Marriott",
      "caption": "Thorpe Marriott Gateway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/This_way_to_Aylsham_-_geograph.org.uk_-_1293374.jpg",
      "title": "Evelyn Simak / This way to Aylsham",
      "caption": "This section of the Marriotts Way long distance footpath once carried the East Norfolk Railway and was consequently run by the Great Eastern Railway and later forming part of the London and North Eastern Railway in 1923."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Open_Land_and_Woodland_by_Marriott%27s_Way_-_geograph.org.uk_-_454701.jpg",
      "title": "Ian Robertson / Open Land and Woodland by Marriott's Way",
      "caption": "Open Land and Woodland by the Marriott's Way between Reepham and Cawston."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Old_Reepham_Station_-_geograph.org.uk_-_517028.jpg",
      "title": "Tom Offord / Old Reepham Station",
      "caption": "The Old Reepham Railway Station next to the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Bridge_over_the_river_Wensum_-_geograph.org.uk_-_1121197.jpg",
      "title": "gary faux / Bridge over the river Wensum",
      "caption": "Bridge over the river Wensum at Lenwade. This old railway bridge, just across the road from Lenwade Station, used to carry the Themelthorpe to Norwich railway line - originally built in 1882 by the Lynn & Fakenham Railway Co. It was finally closed and lifted in 1985. The route now forms the Marriotts Way path, part of the Sustrans national cycle route. It was named after William Marriott, who was chief engineer and manager of the M&GN Railway for over 40 years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Whitwell_Station_re-opened_-_geograph.org.uk_-_1334465.jpg",
      "title": "gary faux / Whitwell Station re-opened",
      "caption": "Whitwell Station re-opened. A view of the passenger entrance of the now re-opened Whitwell Station, on the former M & GNJR. Welcome refreshments are to found here at weekends whilst walking or cycling along the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Whitwell_Station%2C_Norfolk_-_geograph.org.uk_-_1334371.jpg",
      "title": "gary faux / Whitwell Station, Norfolk",
      "caption": "Whitwell Station. A 'drivers eye' view of the approach to Whitwell Station, on the old M & GNJR Railway from Norwich. Closed to passengers in March 1959, Whitwell station was re-opened on 29th February 2009 by the Whitwell & Reepham Railway - a charitable trust. Their plans are to turn the site into a working museum and already great strides have been made with track laid in the goods yard and head-shunt. A small steam engine (Annie) has been purchased from Chatham Dock-yard, and is used to give rides on the 1st Sunday of each month. Volunteers help restore the buildings to their former glory."
    }
  ],
  "distance_km": 36.0,
  "description": "This wonderful cycle and walking path runs from Aylsham to Norwich along the trackbeds of two former railway lines. The route passes Cawston, Reepham, Lenwade, the wildlife rich Taverham Mill and Drayton, taking you through the Wensum Valley with regular views of the River Wensum to enjoy. Along the way look out for a series of rail sculptures and lots of interesting flora and fauna. Wildlife includes butterflies, jays, magpies, green woodpeckers and wrens. Cycle hire is available at Reepham station where there's also a nice cafe for refreshments. Near Reepham you will pass close to the Foxley Wood Nature Reserve. There's a number of nice walking trails to try here, with lots more wildlife and plantlife to see. At Lenwade the trail links up with the Wensum Way. The trail will take you west to Swanton Morley and Gressenhall on a pleasant flat path.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Chestnut Tree in Hellesdon on the outskirts of Norwich is a nice place to stop for refreshments. They have a decent restaurant with a good menu and range of ales. There's also a pub garden for warmer days. You can find the pub on the Reepham Road with a postcode of NR6 5QA for your sat navs. In the small market town of Reepham you could stop off at the excellent Kings Arms. The noteworthy pub dates all the way back to 1667 and maintains most of its original features. They have a good menu and a nice garden area to sit out in on warmer days. You can find the pub in the Market Place at postcode NR10 4JJ. The pub is also very dog friendly if you have your canine friend with you on the walk. Another nice place for a pit stop is the restored Whitwell and Reepham Railway. Starting in 2009 volunteers relayed track and sidings, acquired rolling stock and brought the old station and signal box back to life. There's an interesting railway museum and a nice cafe where you can enjoy a bite to eat in the sunny garden area. You can also enjoy a ride on the full-size heritage steamed railway."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around the Norwich area you could try the Hellesdon Circular Walk which uses a section of the trail around Hellesdon Bridge and the Wensum Valley. In Aylsham you will find one of the highlights of the county at the wonderful Blickling Hall. The expansive estate includes lakes, woodland, gardens, an 18th century Temple and some fascinating history. Just outside Norwich the route links up with the Walsingham Way. This long distance trail runs from the mediaeval abbey at Great Walsingham to the city of Norwich, passing several fascinating historic sites on the way. The long distance Rebellion Way Cycle Route passes through Norwich. The epic 232 mile circular ride visits some of the other major highlights of Norfolk, using a series of quiet country lanes and traffic free paths. The Norwich To Cromer Cycle Route uses part of the trail on its way to the coast at Cromer. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jB5YrSBr5_o",
  "district": "Broadland",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Buxton Road, Aylsham, Broadland, Norfolk, England, NR11 6JD, United Kingdom",
  "postcode": "NR11 6JD",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "rail sculptures",
    "wildlife"
  ],
  "facilities": [
    "cafe",
    "cycle hire",
    "nature reserve",
    "walking trails"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}