{
  "created_at": "2025-01-06T01:39:10.626016+00:00",
  "objectID": "acab05e3ece102f526b88f3d27b699f4",
  "ref": "morden-hall-park-walking-and-cycle-route",
  "title": "Morden Hall Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Restored_waterwheel_in_Morden_Hall_Park_%28geograph_2589526%29.jpg/512px-Restored_waterwheel_in_Morden_Hall_Park_%28geograph_2589526%29.jpg",
  "nearby": [
    {
      "description": "Mitcham Common",
      "objectID": "cfcc17a737087adeb1a4d86aab11f6c3",
      "ref": "mitcham-common-walking-route"
    },
    {
      "description": "Wandle Trail",
      "objectID": "ffa9fe05e721330d69aa2d83d74a8096",
      "ref": "wandle-trail-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/acab05e3ece102f526b88f3d27b699f4.gpx",
  "_geoloc": {
    "lat": 51.4027172759,
    "lng": -0.1908613261
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Restored_waterwheel_in_Morden_Hall_Park_%28geograph_2589526%29.jpg/512px-Restored_waterwheel_in_Morden_Hall_Park_%28geograph_2589526%29.jpg",
      "title": "Stephen Craven / Restored waterwheel in Morden Hall Park, via Wikimedia Commons",
      "caption": "Restored waterwheel in Morden Hall Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Buildings_in_Morden_Hall_Park_-_geograph.org.uk_-_1160698.jpg",
      "title": "Peter Trimming / Buildings in Morden Hall Park, via Wikimedia Commons",
      "caption": "Buildings in Morden Hall Park One of several Victorian buildings on the Morden Hall estate, run by the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Rose_garden_at_Morden_Hall_Park_-_geograph.org.uk_-_1298648.jpg",
      "title": "I M Chengappa / Rose garden at Morden Hall Park, via Wikimedia Commons",
      "caption": "Rose garden at Morden Hall Park. The section of rose garden further from the house, with a ginkgo tree as centrepiece."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Morden_Hall_Park_-_wetlands_-_geograph.org.uk_-_1629335.jpg",
      "title": "Peter Trimming / Morden Hall Park - wetlands, via Wikimedia Commons",
      "caption": "Morden Hall Park Wetlands"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/View_of_a_milling_machine_outside_the_National_Trust_mills_in_Morden_Hall_Park_%28geograph_5864470%29.jpg/512px-View_of_a_milling_machine_outside_the_National_Trust_mills_in_Morden_Hall_Park_%28geograph_5864470%29.jpg",
      "title": "Robert Lamb / View of a milling machine outside the National Trust mills in Morden Hall Park, via Wikimedia Commons",
      "caption": "View of a milling machine, originally used for milling snuff, outside the National Trust snuff mills"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/River_Wandle_in_Morden_Hall_Park%2C_Surrey_-_geograph.org.uk_-_1442262.jpg",
      "title": "Peter Trimming / River Wandle in Morden Hall Park, Surrey, via Wikimedia Commons",
      "caption": "River Wandle in Morden Hall Park, Surrey On the Morden Hall estate, run by the National Trust, work was done on the banks of this little offshoot of the River Wandle, to avoid bank erosion, and flooding. A little over a year later, we are rewarded with this colourful scene."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Morden_Hall_-_geograph.org.uk_-_1298676.jpg",
      "title": "I M Chengappa / Morden Hall, via Wikimedia Commons",
      "caption": "The east side of the old house, seen from the bridge leading into Morden Hall Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Bridge_at_Morden_Hall_-_geograph.org.uk_-_1230196.jpg",
      "title": "Peter Trimming / Bridge at Morden Hall, via Wikimedia Commons",
      "caption": "Pretty bridge over the river at Morden Hall"
    }
  ],
  "distance_km": 1.5,
  "description": "This lovely park in south London is a great place to go for a walk or cycle in the city. The Wandle Trail runs through the park along the River Wandle with pretty bridges across the water and lots of wildlife to look out for. There's also a rushing weir and a restored waterwheel which gives an insight into the industrial history of the park. Water loving birds you might see include herons, egrets and kingfishers. Other features in the park include a delightful rose garden with over 2000 roses, wide lawns ideal for picnics and an excellent learning centre housed in the western mill. There are also many interesting buildings on the site including Morden Hall itself, Morden Cottage, an old Snuff Mill and several old farm buildings which are now used as a garden centre and a city farm. There's a car park at the site but you can also easily visit the park by public transport. The Phipps Bridge, Belgrave Walk and Morden Road Tramlink stops and Morden Tube Station are very close to the park. You can extend your outing by heading to the nearby Ravensbury Park and Mitcham Common where you will find a number of good footpaths taking you to woodland, grassland, scrub and the pretty Seven Islands pond. You can also follow the course of the River Wandle on the excellent Wandle Trail. If you head north from the park you will soon come to the lovely Merton Abbey Mills where you will find a pretty water mill and an arts and craft market.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The park has a couple of nice on site cafes where you can enjoy refreshments after your walk. Breakfast and hot food can be purchased at the Potting Shed Café. There's also the Stableyard Café with coffees and ice creams. There's an outdoor seating area so you can enjoy your snack outside on summer days.There's also some nice pubs located on the fringes of the park. The Surrey Arms is located at the southern for example. There's a friendly atmosphere, nice outdoor area and a good menu here. You can find it on Morden Road with a postcode of CR4 4DD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great place to walk your dog and the Stableyard Café mentioned above is also dog friendly. Please keep them on leads around buildings like the Snuff Mill, Garden Centre and café, and in the Rose Garden, in the play area or on the wetland boardwalk. In the wider park they can be let off the lead as long as they are under close control."
    }
  ],
  "video_url": "https://www.youtube.com/embed/A42BJSqbQ38",
  "postcode": "SM4 5JF",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Morden Hall Road, Morden, London Borough of Merton, London, Greater London, England, SM4 5JF, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "wildlife",
    "gardens",
    "water features"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "learning center",
    "city farm",
    "public transport"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}