{
  "created_at": "2025-01-06T05:15:55.582538+00:00",
  "objectID": "ad909d9241747b3ea3bcfc2f4557054d",
  "ref": "balcombe-circular-walk-walking-route",
  "title": "Balcombe Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/79/Outfall_cascade_from_Balcombe_Lake_-_geograph.org.uk_-_1621103.jpg",
  "nearby": [
    {
      "description": "Ardingly Reservoir",
      "objectID": "ddc1247dbb53d0bf77a93005b5a7ed58",
      "ref": "ardingly-reservoir-walking-route"
    },
    {
      "description": "Wakehurst Place",
      "objectID": "0edceeb510652720fe9a279375556adc",
      "ref": "wakehurst-place-walking-route"
    },
    {
      "description": "Lindfield",
      "objectID": "c3cbbcf0bff982ce91aa8ca94631dfcd",
      "ref": "lindfield-walking-route"
    },
    {
      "description": "Cuckfield",
      "objectID": "be23f3d86f2a0bc60573706cd7f1c9d1",
      "ref": "cuckfield-walking-route"
    },
    {
      "description": "Bolney",
      "objectID": "0216fb014b8e9c9dec51e0c82aacec7c",
      "ref": "bolney-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ad909d9241747b3ea3bcfc2f4557054d.gpx",
  "_geoloc": {
    "lat": 51.058649459,
    "lng": -0.1278846117
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Outfall_cascade_from_Balcombe_Lake_-_geograph.org.uk_-_1621103.jpg",
      "title": "Dave Spicer / Outfall cascade from Balcombe Lake, via Wikimedia Commons",
      "caption": "Outfall cascade from Balcombe Lake on its way to Ardingly Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Balcombe_Lake_from_the_outfall_bridge_-_geograph.org.uk_-_1621087.jpg",
      "title": "Dave Spicer / Balcombe Lake from the outfall bridge, via Wikimedia Commons",
      "caption": "Balcombe Lake from the outfall bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Ardingly_Reservoir_-_geograph.org.uk_-_5463.jpg",
      "title": "Ben Gamble / Ardingly Reservoir, via Wikimedia Commons",
      "caption": "Ardingly Reservoir. Sailing club at the southern end of the reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Wakehurst_Place_-_geograph.org.uk_-_35019.jpg",
      "title": "john spivey / Wakehurst Place, via Wikimedia Commons",
      "caption": "Wakehurst Place. The arboretum run by Kew Gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/St_Mary%27s_Church%2C_Balcombe_-_geograph.org.uk_-_1016524.jpg",
      "title": "Kevin Gordon / St Mary's Church, Balcombe, via Wikimedia Commons",
      "caption": "St Mary's Church, Balcombe village. The 15th century tower is built from sandstone and has a wood shingled spire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Chalybeate_Spring%2C_Balcombe_-_geograph.org.uk_-_193773.jpg/256px-Chalybeate_Spring%2C_Balcombe_-_geograph.org.uk_-_193773.jpg",
      "title": "Graham Pritchard / Chalybeate Spring, Balcombe, via Wikimedia Commons",
      "caption": "Chalybeate Spring, Balcombe. The wonderful chalybeate (mineral) spring in the woods near Balcombe village. No matter the time of year, or how wet or dry, the spring always flows constantly. The water tastes strongly of iron. Two ancient yew trees standing astride the path on the way down to the spring makes one wonder whether the locals long ago attributed some spiritual significance to this site?"
    }
  ],
  "distance_km": 9.5,
  "description": "This circular walk explores the lakes and woods to the east of the West Sussex village of Balcombe. On the route you'll visit the lovely Ardingly Reservoir and the beautiful gardens at the historic Wakehurst Place. There's also a waterside stretch along the pretty Balcombe Lake to enjoy. The walk starts in the village and heads east to Balcombe Mill and the Ardingly Reservoir. You then follow a waterside path along the eastern side of the expansive reservoir. Here you will see a mixture of habitats including wetland, reedbed, deciduous woodland, hazel coppice and haymeadow. Look out for Great crested grebe and kingfishers as you make your way round the reservoir. The path then turns north through Bushy Wood toward Wakehurst Place, the country estate of the Royal Botanic Gardens, Kew. There are 465 acres of wonderful gardens to explore on a number of well laid out footpaths here. After exploring Wakehurst the route then heads west through Tilgate Wood to Balcombe Lake. Here you pass along the pretty lake with views of the Chalybeate Spring which is flanked by two ancient yew trees. Shortly after you return to the village where the walk finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Balcombe you could head to The Balcombe Tea Rooms for some refreshments on the walk. The popular tea rooms do great food and have a nice little outdoor seating area. The Sunday Roast and cream tea are highly reccommended! You can find the tea rooms at Hope Cottage, Bramble Hill, with a postcode of RH17 6HR for your sat navs. Just east of the reservoir there's the little village of Ardingly where there's the noteworthy Gardeners Arms. Dating back to the 17th Century, the pub is cosy in the winter, with roaring log fires and traditional oak beams. In the summer months you can sit outside in the beautiful garden. Here you can see their grape vines and may also spot a deer if you are lucky. You can find the pub on Selsfield Road with a postcode of RH17 6TJ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Balcombe has a main line train station so is accessible by public transport. The station is situated on the Brighton Main Line 33 miles down the line from London Bridge via Redhill. It's also between Three Bridges and Haywards Heath stations on the line so easy to reach from these settlements or from the city of London. The Lindfield Walk starts from the worthy village, located just a few miles to the south. The settlement is well worth a visit with a lovely large village pond, a 13th century church and a fascinating High Street. The historic street is lined with lime trees, and includes over forty medieval and post medieval timber-framed houses. Also to the south is the Cuckfield Walk which visits the beautiful Nymans Gardens. Just to the south west of Cuckfield there's Bolney where you could pay a visit to the impressive Bolney Wine Estate. Here you can enjoy guided tours of the vineyard and learn all about the history of the wine making process. The pretty village also includes a noteworthy 12th century church, several listed buildings and the well known Bolney Stage pub which is hundreds of years old. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "postcode": "RH17 6NS",
  "district": "Mid Sussex",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Coach House, Mill Lane, Balcombe, Mid Sussex, West Sussex, England, RH17 6NS, United Kingdom",
  "state": "England"
}