{
  "objectID": "ada093761dc0c2666f9efbe4b26c8d6d",
  "created_at": "2024-12-18T15:14:21.447707+00:00",
  "ref": "porthgain-walking-route",
  "title": "Porthgain Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/29/Porthgain_and_Harbour_-_geograph.org.uk_-_946178.jpg",
  "nearby": [
    {
      "description": "Ramsey Island",
      "objectID": "b8bf0eeae6912f3b40195efae1e1e844",
      "ref": "ramsey-island-walking-route"
    },
    {
      "description": "Pembrokeshire Coast Path",
      "objectID": "ad6d6081a04362874fc894b50c9a12b7",
      "ref": "pembrokeshire-coast-path-walking-route"
    },
    {
      "description": "Solva to St David's Coastal Walk",
      "objectID": "1b0c98c52cdc19e5e9bde20da3531ac2",
      "ref": "solva-to-st-davids-coastal-walk-walking-route"
    },
    {
      "description": "St David's Head",
      "objectID": "511d570bd7e7a33dad8b63bd6ce0b85d",
      "ref": "st-davids-head-walking-route"
    },
    {
      "description": "Strumble Head",
      "objectID": "17ca340a814d9e51445adb0e6c4b0100",
      "ref": "strumble-head-walking-route"
    },
    {
      "description": "Garn Fawr",
      "objectID": "c31749c39f5a0f4e8c5e53e17a153bbc",
      "ref": "garn-fawr-walking-route"
    },
    {
      "description": "Trefin",
      "objectID": "547deb293d2d7f5f3e2eb71a6faa0c84",
      "ref": "trefin-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/764A44341B989156862586DC0058C7E4/$FILE/Porthgain.gpx",
  "_geoloc": {
    "lat": 51.9477901951,
    "lng": -5.1802089676
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Porthgain_and_Harbour_-_geograph.org.uk_-_946178.jpg",
      "title": "David Stephens, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Porthgain and Harbour. Despite its popularity with holiday-makers the village retains a strong sense of community and the abiding ambiance of a working agricultural/fishing village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Ty_Mawr%2C_Porthgain_-_geograph.org.uk_-_1268004.jpg",
      "title": "ceridwen / Ty Mawr, Porthgain",
      "caption": "Ty Mawr, Porthgain Ty Mawr (big house), now a restaurant, was the main workshop for the brickmaking industry and is the only structure remaining from that enterprise. Where the boats are was the kiln, the drying sheds were to the right. Within the stonework of Ty Mawr can be found examples of the granite setts that were exported for use in making tramways in major cities."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Caersalem_quarry%2C_Porthgain_-_geograph.org.uk_-_1267151.jpg",
      "title": "ceridwen / Caersalem quarry, Porthgain",
      "caption": "Caersalem quarry. This quarry lies to the seaward of Jerusalem quarry: the stone had to be blasted with gelignite out of the cliffs above the churning water below. The resulting loose stone would then have been loaded in drams to be hauled out first with winding gear and them by steam locomotive over to the crushing plant above the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Y_Stryd%2C_Porthgain_-_geograph.org.uk_-_1474564.jpg",
      "title": "ceridwen / Y Stryd, Porthgain",
      "caption": "Y Stryd. These five terraced cottages were built in the mid-C18 for the quarrymen, mostly from North Wales, who were employed in the slate industry. Another row of cottages, now gone, was built a little higher up. The gallery seen here belongs to a artist, Alun Davies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Jerusalem_quarry_near_Porthgain_-_geograph.org.uk_-_929128.jpg",
      "title": "ceridwen / Jerusalem quarry near Porthgain",
      "caption": "Jerusalem quarry. The coastal stretch west of Porthgain is mixture of soft sedimentary and hard igneous rock, the former providing slate for quarrying and the latter, granite for extraction, often with explosives. This vast crater on the Penclegyr headland drops down to a platform on the seaward side, and supplied roadstone that was taken out via a tramway that ran below the buildings seen in the distance. It was sorted into the hoppers that can still be seen on the quayside, whence it was shipped out by sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Brick_ruins_across_the_quarry%2C_Porthgain_-_geograph.org.uk_-_929163.jpg",
      "title": "ceridwen / Brick ruins across the quarry, Porthgain",
      "caption": "Brick ruins across the quarry. Remains of old storehouses and engine sheds seen in a zoomed shot across the one of the cavernous quarries they served. The deep ditch in the foreground was the route of the tramway used to haul up the granite from the stone-workings in the sea cliffs below."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Looking_down_into_the_Blue_Lagoon_-_geograph.org.uk_-_939460.jpg",
      "title": "ceridwen / Looking down into the Blue Lagoon",
      "caption": "Looking down into the Blue Lagoon, Abereiddy. This flooded slate quarry has become a popular venue for recreational activities among the ruins and remains of the industrial past. It is also a protected marine environment where many organisms thrive in the shelter of the enclosing walls. The turret on the end of Trwyncastell (Nosecastle) is an old lookout point or watchtower (Y Twr Gwylio) possibly used to guide ships or maybe for recreational use by the quarry managers!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Abereiddi_cottages_-_geograph.org.uk_-_470364.jpg",
      "title": "ceridwen / Abereiddi cottages",
      "caption": "Abereiddi cottages. Picturesque holiday venue - but with an industrial past: from the 1840's to the end of that century Abereiddi was one of the main slate quarries in Pembrokeshire. These and other (ruined) cottages behind the beach housed the workers. The circular powder store and remains of a tramway and other machinery are still visible. The Blue Lagoon was a quarry before it was blasted open to admit the sea."
    }
  ],
  "distance_km": 5.6,
  "description": "This pretty village sits in a lovely location on the Pembrokershire coast. There's a picturesque harbour, galleries, old quarries and fine pubs to visit in the village. This circular walk from the village takes you along the Pembrokeshire Coast Path to the beach at Traeth Llyfn and the Blue Lagoon at Abereiddy. It's a stunning area with cliff tops paths, coves, bays, beaches, old quarries and some lovely countryside as well. The walk starts from the public car parking area in Porthgain, next to the harbour. You can then pick up the coast path and follow it west towards Traeth Llyfn beach. The sandy and rocky beach is backed by towering cliffs and is reached by very steep metal stairs. A short walk from here you'll find another lovely beach at Abereiddy. There's also the Blue Lagoon, a flooded slate quarry, with greenish coloured water, owing to the mineral content within the quarry. The route then heads east through the countryside to the Ynys Barry Cottages before turning north along a country lane to return to Porthgain.",
  "video_url": "https://www.youtube.com/embed/uw1px66aw8s",
  "postcode": "SA62 5BN",
  "district": "Porthgain",
  "county": "Sir Benfro - Pembrokeshire",
  "region": "Wales",
  "country": "Wales"
}