{
  "created_at": "2025-01-05T23:46:10.555137+00:00",
  "objectID": "ada7df515b04aaba1bd691eabe995139",
  "ref": "stour-valley-walk-walking-route",
  "title": "Stour Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1a/The_Stour_Valley_Walk_and_the_Great_Stour_-_geograph.org.uk_-_794850.jpg",
  "nearby": [
    {
      "description": "Stodmarsh National Nature Reserve",
      "objectID": "cfabc8aed5ee114895a622f05d026d77",
      "ref": "stodmarsh-national-nature-reserve-walking-route"
    },
    {
      "description": "Chilham",
      "objectID": "159a0252df387101fe4b050c706e0ccf",
      "ref": "chilham-walking-route"
    },
    {
      "description": "Canterbury to Chartham Walk",
      "objectID": "ecb458f342dc03fa9ebfb95730e7e464",
      "ref": "canterbury-to-chartham-walk-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Hothfield Common",
      "objectID": "bbb6c868f40cd1183d56988b16fdead5",
      "ref": "hothfield-common-walking-route"
    },
    {
      "description": "Pegwell Bay Country Park",
      "objectID": "9b50fb9e8449be230e5aaec205ae7b1f",
      "ref": "pegwell-bay-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ada7df515b04aaba1bd691eabe995139.gpx",
  "_geoloc": {
    "lat": 51.236995329,
    "lng": 0.7186894935
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/The_Stour_Valley_Walk_and_the_Great_Stour_-_geograph.org.uk_-_794850.jpg",
      "title": "Nick Smith / The Stour Valley Walk and the Great Stour, via Wikimedia Commons",
      "caption": "The Stour Valley Walk and the Great Stour near Wye"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Stour_Valley_Walk_-_geograph.org.uk_-_535131.jpg",
      "title": "Simon Carey / Stour Valley Walk, via Wikimedia Commons",
      "caption": "Approaching Chartham. The Great Stour is to the right concealed by the foliage on the raised bank. I'm not sure what the structure ahead is but looks like something used to convey gravel or other such materials."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Stile_on_the_Stour_Valley_Walk_-_geograph.org.uk_-_1602178.jpg",
      "title": "David Anstiss / Stile on the Stour Valley Walk, via Wikimedia Commons",
      "caption": "Stile on the Stour Valley Walk. The long distance path heads through the Godinton Estate towards Worten Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Looking_East_along_the_Stour_Valley_Walk_and_River_Stour_-_geograph.org.uk_-_460929.jpg",
      "title": "Nick Smith [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Near Upstreet"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Tonford_Manor_from_the_Stour_Valley_Walk_-_geograph.org.uk_-_780798.jpg",
      "title": "Nick Smith / Tonford Manor from the Stour Valley Walk, via Wikimedia Commons",
      "caption": "Tonford Manor, on the route between Canterbury and Chartham. King Henry VIII stayed here with Catherine of Aragon for 3 days. The present house is built into the old walls of the former 15th century house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Part_of_Fordwich_lakes_from_the_Stour_Valley_Walk_-_geograph.org.uk_-_465140.jpg",
      "title": "Nick Smith / Part of Fordwich lakes from the Stour Valley Walk, via Wikimedia Commons",
      "caption": "Part of Fordwich lakes from the Stour Valley Walk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/The_Greensand_Way_and_Stour_Valley_Path_meet_near_Hothfield_Common_-_geograph.org.uk_-_1601828.jpg",
      "title": "David Anstiss / The Greensand Way and Stour Valley Path meet near Hothfield Common",
      "caption": "The Greensand Way and Stour Valley Walk meet near Hothfield Common. Here the trail meets with the Greensand Way (long distance path from Hothfield, along the hedge). Both paths head through a horse's paddock beside Cobb Cottage, towards the heathland nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Barbican_Gate%2C_Sandwich_-_geograph.org.uk_-_2650725.jpg/512px-Barbican_Gate%2C_Sandwich_-_geograph.org.uk_-_2650725.jpg",
      "title": "Barbican Gate, Sandwich by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barbican Gate, Sandwich. The Barbican dates from the 14th century and stands at the end of the bridge over the River Stour where it was used as a toll house. The nearby Fisher Gate on the quay dates from 1384, and has been scheduled as an Ancient Monument."
    }
  ],
  "distance_km": 82.0,
  "description": "Follow the River Stour from its source near Lenham to the estuary at Pegwell Bay on the Kent coast. You will pass through a varied landscape of downland, woodland, orchards, farmland, lakes, dykes and marshland. The route also passes through many of Kent's finest unspoilt villages, hamlets and historic towns. The walk beings at the village of Lenham and heads towards Ashford via Little Chart, Great Chart and Pluckley. From Ashford you turn north towards historic Canterbury with its magnificent cathedral. This section takes you through the delightful village of Chilham which includes a pretty lake with a beautiful 5-storey watermill and an inhabited Norman Keep thought to be one of the oldest dwellings in the UK. The next section then leads to Sandwich passing the attractive Westbere Lakes and Stodmarsh National Nature Reserve as you go. The final section then takes you from Sandwich to the delightful Pegwell Bay on the Stour Estuary.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the start/end of the walk in Lenham there's The Dog and Bull for a pre or post walk drink. It was originally built in 1602 and visited by Queen Anne in 1704 - her coat of arms is still displayed above the door today. They serve fine food and have a pleasant courtyard garden for the summer months. You can find them on the Square at postcode ME17 2PG for your sat navs.. The worthy settlement is also worth exploring with a pretty square and a historic high street with a number of listed buildings. There's also a Grade I listed Tithe Barn and a notable 14th century church to investigate. The King's Arms in Sandwich is another historic pub of some note, dating back to the 1580s. Elizabeth I visited Sandwich in 1573 and stayed opposite the inn at Kings Lodgings, built for her father, Henry VIII. The depiction of Pan on the corner of the building was carved during Elizabeth's reign and is dated 1592. The ancient building has a charming interior with a splendid fireplace. Outside there's a lovely garden area for warmer days. You can find them on Strand Street at postcode CT13 9HN for your sat navs. The town is also worth exploring with a number of medieval buildings to admire. Just outside Canterbury you'll pass Grove Ferry at the eastern end of the Stodmarsh Nature Reserve. You'll find a car park, picnic area, boat trips and the Grove Ferry Inn here. The main draw here is a beautiful garden where you can enjoy river views with your meal. There is something of a historical interest too, with the building dating back to the Georgian period. They are located near the picnic site at postcode CT3 4BP for your sat navs. At the western end of the reserve you'll also find the Westbere Marshes and the noteworthy town of Fordwich. Fordwich is notable as Britain's smallest town and also has a great pub with a dining terrace overlooking the Stour."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tlZtLUjR1Sk",
  "district": "Maidstone",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Old Ashford Road, Lenham, Maidstone, Kent, England, ME17 2PH, United Kingdom",
  "postcode": "ME17 2PH",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "downland",
    "woodland",
    "marshland"
  ],
  "points_of_interest": [
    "historic towns",
    "villages",
    "lake",
    "watermill",
    "Norman Keep"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}