{
  "created_at": "2025-01-06T00:24:44.602361+00:00",
  "objectID": "adb40844122375a99719427844ecfcc4",
  "ref": "slad-valley-walking-route",
  "title": "Slad Valley Laurie Lee Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/48/The_Woolpack%2C_Slad%2C_Gloucestershire_-_geograph.org.uk_-_487493.jpg",
  "nearby": [
    {
      "description": "Painswick Beacon",
      "objectID": "4e7e375754e563d0d364746461b5fa5d",
      "ref": "painswick-beacon-walking-route"
    },
    {
      "description": "Wysis Way",
      "objectID": "88d2ea0a9be0af38b106727175695138",
      "ref": "wysis-way-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Stroud",
      "objectID": "c31e845a6332436c2fb0c0ed71482064",
      "ref": "stroud-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/adb40844122375a99719427844ecfcc4.gpx",
  "_geoloc": {
    "lat": 51.7692373831,
    "lng": -2.1854116834
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/The_Woolpack%2C_Slad%2C_Gloucestershire_-_geograph.org.uk_-_487493.jpg",
      "title": "Anthony Eden / The Woolpack, Slad, Gloucestershire",
      "caption": "The Woolpack, Slad. A fine place to visit after your walk. Lee was a regular visitor to his local pub and referred to it with great affection. The Woolpack is the proud custodian of the Laurie Lee beer bottle collection and a cabinet dedicated to his written works, as part of a tiny book shop. Across the road from the Woolpack is the school house where Laurie Lee was once a schoolboy. The Museum in the Park in nearby Stroud is worth a visit to find out more about the life of Laurie Lee. It even contains his school report. The village also includes the Laurie Lee Wildlife Way. This beautiful 5-mile walking route, is punctuated with ten poetry posts featuring the works of Lee, whose poems bring the surrounding landscape to life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Steanbridge_Mill_Pond_in_Slad_-_geograph.org.uk_-_759425.jpg",
      "title": "Ian Hunter / Steanbridge Mill Pond in Slad",
      "caption": "Steanbridge Mill Pond. This is the millpond mentioned in 'Cider with Rosie'. Laurie Lee, born on June 26, 1914, in Stroud, Gloucestershire, was the son of Reginald Joseph Lee and Annie Emily Lee (née Light). The family moved to the village of Slad in 1917, and this village is the setting for Lee's famous novel \"Cider with Rosie.\" Following his service in the First World War with the Royal West Kent Regiment, Lee's father did not return to the family. After the war, Laurie Lee and his brothers grew up in close association with their mother's family, developing a strong dislike for their Lee relatives. Unfortunately, Laurie Lee experienced the loss of his sister Frances in 1915 when he was just a toddler. He had two full brothers, Jack and Tony, and five older half-siblings from his father's previous marriage. Jack Lee, Laurie's brother, went on to become a film director. Despite their closeness in youth, they had a falling out in later life and remained on non-speaking terms for a considerable period."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Cider_with_Rosie_-_geograph.org.uk_-_24766.jpg",
      "title": "Bob Tinley / Cider with Rosie",
      "caption": "This rather overgrown cider press is just off the B4070, where the path leads up to Wickridge Hill. It's only a quarter of a mile from Slad. \"Cider with Rosie\" is a poignant and evocative memoir that recounts Lee's childhood in the village of Slad. The narrative is set in the aftermath of the First World War, providing a glimpse into the traditional village life that underwent significant transformations with the arrival of modern developments, including the widespread use of motor cars. The book offers a nostalgic and reflective perspective as Lee looks back on his experiences of childhood many years later. It captures the essence of a bygone era, depicting the charm and simplicity of rural life as well as the inevitable changes brought about by progress. An interesting note is that the identity of Rosie, a central character in the narrative, was revealed to be Lee's distant cousin, Rosalind Buckland, in later years. This revelation adds a personal touch to the memoir, emphasizing the autobiographical nature of the work."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Quarry_near_Worgan%27s_Wood_-_geograph.org.uk_-_962366.jpg",
      "title": "Mike White / Quarry near Worgan's Wood",
      "caption": "Quarry near Worgan's Wood. These tumbled stones are what remains of one of the many disused quarries that dot the Cotswolds. All that honey-coloured masonry has to come from somewhere. The Laurie Lee Wood, recently opened by his widow and daughter, is an ancient woodland of over three hectares. It looks particularly beautiful in bluebell season and is next door to Gloucestershire Wildlife Trusts' Swift’s Hill nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Slad_valley_viewed_from_the_B4070_-_geograph.org.uk_-_2788990.jpg",
      "title": "Slad valley viewed from the B4070 by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Slad valley viewed from the B4070. The Slad Brook runs along the bottom of the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Slad_Village_-_geograph.org.uk_-_759427.jpg",
      "title": "Ian Hunter / Slad Village",
      "caption": "The village in mid summer. \"Winter and Summer,\" as described in \"Cider with Rosie\", encapsulates the contrasting experiences and activities associated with the two seasons in the village. In winter, the village boys engage in foraging with makeshift hand warmers, while the Christmas carol-singing of the church choir becomes a festive event. On the other hand, summer is marked by outdoor activities in the fields and nighttime games like \"Whistle-or-'Oller-Or-We-shall-not-foller,\" providing a lively and communal atmosphere. The narrative captures the ebb and flow of life in a rural village, with each season contributing its unique characteristics to the collective experience."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/View_of_Slad_Valley_from_Slad_Road_-_geograph.org.uk_-_2811721.jpg",
      "title": "View of Slad Valley from Slad Road by Ruth Sharville, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View of Slad Valley from Slad Road. \"Outings and Festivals\" in \"Cider with Rosie\" vividly recounts the yearly village excursions and celebrations. The Peace Day in 1919 is marked by a vibrant procession culminating in speeches at the squire's residence. Family hikes, like the one to Sheepscombe, foster connections with relatives. An exhilarating charabanc trip to Weston-super-Mare brings moments of leisure for different age groups—sunbathing for women, pub visits for men, and arcade amusements for children. The Parochial Church Tea and Annual Entertainment offer a lively community event, with Laurie and his brother participating in arrangements and Laurie showcasing his musical talents on the fiddle accompanied by Eileen on the piano, earning enthusiastic applause. The narrative captures the spirit of communal joy and shared experiences during these village outings and festivities."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Cider_with_Rosie_-_geograph.org.uk_-_24766.jpg",
      "title": "Bob Tinley / Cider with Rosie",
      "caption": "Cider with Rosie. This rather overgrown cider press is just off the B4070, where the path leads up to Wickridge Hill."
    }
  ],
  "distance_km": 6.0,
  "description": "This circular walk explores the area surrounding the Gloucestershire village of Slad near Stroud. The Slad Valley is famous for its associations with the author Laurie Lee, who based his book 'Cider with Rosie' on his own life in the village. It's a beautiful area of the Cotswolds and well worth exploring with a copy of the book under your arm! The walk starts in the centre of the village and follows various footpaths and country lanes around the village. You'll pass woodland areas and attractive farmland with pretty streams and brooks to look out for. Also on the route is the lovely Steanbridge Mill and its pond with ducks. It is mentioned in the book as the place where a young Lee used to ice skate in the winter. In the village you can also visit Lee's grave in the peaceful churchyard and visit the Woolpack Inn for refreshments. It's a lovely walk and of particular appeal to fans of the book who will recognise many of the locations. Part of the walk uses the Wysis Way long distance footpath. This section is at the northern tip of the route. You can follow the path east towards Piedmont and visit the Snows Farm Nature Reserve on the way. It consists of limestone grassland with a huge variety of wildlflowers including early purple orchid, fragrant orchid and pyramidal orchids. It's located just to the north east of the village and worth a visit. You can further extend your walk by continuing along the Wysis Way south to Bisley or north towards Painswick Beacon. Here you will find an Iron Age Hill Fort and fabulous views over the Severn Vale, the Forest of Dean and the Welsh Mountains. The Cotswold Way National Trail runs to the west of the village through the Painswick Valley and is another good option for continuing your walking in this lovely area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Woolpack Inn is a noteworthy pub well worth investigating. It's over 300 years old and retains much of that old world charm. Indoors there's a cosy interior with lots of interesting old pictures and photos on the wall. The pub was the old haunt of Laurie Lee and after you have finished your meal you can head across the road to the church where he is buried. They do excellent food and also have an outdoor area for warmer days. You can find the historic inn on the Slad Road at a postcode of GL6 7QA for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3JHWgsEyQWY",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Slad Road, Bulls Cross, Painswick, Slad, Stroud, Gloucestershire, England, GL6 7QD, United Kingdom",
  "postcode": "GL6 7QD",
  "district": "Painswick",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "farmland",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "viewpoints",
    "archaeological sites"
  ],
  "facilities": [
    "pub/cafe",
    "churchyard",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}