{
  "objectID": "ae0ee8219247581696aadea2196a0f1d",
  "created_at": "2024-12-21T20:02:11.313008+00:00",
  "ref": "river-hamble-country-park-walking-route",
  "title": "River Hamble Country Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/43/River_Hamble_-_geograph.org.uk_-_1375204.jpg",
  "nearby": [
    {
      "description": "Manor Farm and Country Park",
      "objectID": "c69d6cf0c35252f81e46eeca1786cf3b",
      "ref": "manor-farm-and-country-park-walking-and-cycle-route"
    },
    {
      "description": "Strawberry Trail",
      "objectID": "ec21cdf0491a969cbb6f238d871fc645",
      "ref": "strawberry-trail-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/0C0734E6D9893BFF86258A1C00374562/$FILE/River Hamble Country Park.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/River_Hamble_-_geograph.org.uk_-_1375204.jpg",
      "title": "Peter Facey / River Hamble",
      "caption": "River Hamble. The River rises near Bishop's Waltham and flows for approximately 10.1 km (6.3 miles) through the villages of Botley, Bursledon, and Lower Swanwick before reaching Southampton Water between Hamble Common and Warsash. The river is tidal for about half of its length and remains navigable below Botley. It has a long history of shipbuilding, dating back to the medieval period, and has continued to serve as a prominent area for boat construction. Leisure craft are still built there today. Among the renowned builders was Luke & Co, later known as Luke Bros, which operated from around 1890 until 1945. The lower reaches of the River Hamble are especially popular for yachting due to easy access to the sheltered waters of Southampton Water and the Solent. This area remains a significant hub for sailing and marine activities."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/GraceDieuWreckSite.jpg/512px-GraceDieuWreckSite.jpg?20110424155018",
      "title": "Hethurs at en.wikipedia, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Grace Dieu Wreck Site. The river's west bank is accessible from Manor Farm Country Park, offering scenic walks through Dock Copse and Fosters Copse. At extremely low tide, remnants of the Grace Dieu, a 15th-century warship built for Henry V, can be spotted in the river. The Grace Dieu was the largest ship of its time, though it was destroyed by lightning while anchored in the Hamble. Additionally, this part of the river has historical significance from World War II, as it was home to HMS Cricket, a training base for Royal Marine landing craft crews. After the war ended, in 1946, the site was decommissioned, but the remaining buildings were repurposed to house Southampton residents who had been displaced by the bombings. This temporary settlement became known as \"The Cricket Camp\" until it was no longer needed in 1952. Today, most of the original structures are gone, except for the former guardhouse, which is still standing and now serves as the rangers' depot at the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Barnfield_picnic_meadow_-_geograph.org.uk_-_2033281.jpg/512px-Barnfield_picnic_meadow_-_geograph.org.uk_-_2033281.jpg",
      "title": "Barnfield picnic meadow by Richard Dorrell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barnfield picnic meadow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Manor_Farm_Country_Park_-_geograph.org.uk_-_1376000.jpg",
      "title": "Peter Facey / Manor Farm Country Park",
      "caption": "Manor Farm Country Park. Near one of the car parks with a children's play area beyond the trees near left of picture. The park originally opened in 1979 as Upper Hamble Country Park, and in 1984, the Manor Farm museum was established, focusing on local wartime history. The museum sits on what was once the heart of Botley village. In 2019, Hampshire County Council announced a substantial investment of £800,000 into the park. This funding was allocated for the construction of a new visitor centre, the replacement of play equipment, and enhancements to wayfinding and walking routes across the site, improving visitor experiences and accessibility."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Manor_Farm_Country_Park_%28486495766%29.jpg/512px-Manor_Farm_Country_Park_%28486495766%29.jpg",
      "title": "Rob Young from United Kingdom, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Manor Farm Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/AncientDuckpondManorFarm.jpg/512px-AncientDuckpondManorFarm.jpg?20160818122339",
      "title": "User:Hethurs, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Ancient Duckpond, Manor Farm. The ancient duck pond at Manor Farm and the nearby St Bartholomew's Church are both notable historical features mentioned in the Domesday Book. Additionally, there is evidence of a Roman road running through the site, which would have connected two important Roman settlements: Clausentum (modern-day Bitterne Manor) and Portus Adurni (modern-day Portchester). This suggests that the area had strategic importance during the Roman era, serving as a vital transportation route between these two settlements."
    }
  ],
  "distance_km": 1.6,
  "description": "This country park and nature reserve is located in a lovely spot on the River Hamble in Hampshire. It's a fine place for a walk with bluebell woodland, pretty wildflowers, riverside trails and lots of wildlife including roe deer, curlews and skylarks. Within the park you'll also find Manor Farm and Country Park. The historic site includes 600 year old farm buildings and the 13th century St Bartholomew's church. You can also pick up the Strawberry Trail in the park.",
  "video_url": "https://www.youtube.com/embed/1meAac98F3Y?si=atF1kL7oHLuDW5kX"
}