{
  "created_at": "2025-01-05T22:30:25.441185+00:00",
  "objectID": "ae354b490745cbe1e89e5d3c2a763b0f",
  "ref": "knoydart-and-inverie-walking-route",
  "title": "Knoydart Inverie Old Forge Pub Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/The_Old_Forge_at_Inverie_-_geograph.org.uk_-_3403381.jpg/512px-The_Old_Forge_at_Inverie_-_geograph.org.uk_-_3403381.jpg?20220421061049",
  "nearby": [
    {
      "description": "Mallaig Circular Walk",
      "objectID": "6f3df6e179cc7fab3759fe1f14ad6017",
      "ref": "mallaig-circular-walk"
    },
    {
      "description": "Arisaig",
      "objectID": "0ae6d1bbd3f8630b275368f99bb3eb15",
      "ref": "arisaig-walking-route"
    },
    {
      "description": "Glenfinnan Viaduct",
      "objectID": "60fb0ae0a14f1628b52f415698d668d3",
      "ref": "glenfinnan-viaduct-walking-route"
    },
    {
      "description": "Silver Sands Of Morar",
      "objectID": "ac85604e05e9033c1bc3ca1f900601d7",
      "ref": "silver-sands-of-morar-walking-route"
    },
    {
      "description": "Loch Morar",
      "objectID": "e5343381411f9ec19baf90cb47c3abab",
      "ref": "loch-morar-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ae354b490745cbe1e89e5d3c2a763b0f.gpx",
  "_geoloc": {
    "lat": 57.10453,
    "lng": -5.38681
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/The_Old_Forge_at_Inverie_-_geograph.org.uk_-_3403381.jpg/512px-The_Old_Forge_at_Inverie_-_geograph.org.uk_-_3403381.jpg?20220421061049",
      "title": "The Old Forge at Inverie by Trevor Littlewood, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Old Forge at Inverie. The pub holds the Guinness World Record for being the remotest pub in mainland Great Britain, due to its location farthest from roads connected to the national network in terms of both time and journey distance. This unique pub became community property in March 2022, when it was purchased by the residents of the Knoydart peninsula through The Old Forge Community Benefit Society, after being owned for 10 years by Belgian Jean-Pierre Robinet. The pub underwent renovations starting in January 2023 and reopened in early August 2023 as a community-operated establishment. Inverie also offers various accommodation options for tourists, including bed and breakfasts, rental lodges, cottages, and a campsite. Knoydart Lodge and the Hide provide luxury accommodation, adding to the area's appeal for visitors. Additionally, the village has a shop and a meal caterer to serve the needs of tourists throughout the year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Inverie_viewed_from_the_Pier_-_geograph.org.uk_-_3241770.jpg?20220228170530",
      "title": "Inverie viewed from the Pier by Doug Lee, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Inverie viewed from the Pier. The small village is located on the north side of Loch Nevis. Despite being on the mainland of Britain, it is notably remote due to its lack of connection to the UK's road network. The only ways to reach Inverie are by undertaking a challenging 17-mile (27-kilometre) hike over mountainous terrain or by taking a regular ferry service from Mallaig, which covers a distance of about 7 miles (11 kilometres). This isolation has earned Inverie the Guinness World Record for being the most remote village on the British mainland. The village’s remoteness and scenic beauty make it a unique and appealing destination for those seeking solitude and a connection with nature."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Rival_ferries_at_Inverie_-_geograph.org.uk_-_4554682.jpg?20230325051111",
      "title": "Rival ferries at Inverie by Oliver Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rival ferries at Inverie. The seas to the west of Knoydart are designated as a Special Area of Conservation due their importance for harbour porpoises. There is a wildlife hide on the beach near Inverie."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Loch_an_Dubh-Lochain%2C_Knoydart_-_geograph.org.uk_-_229408.jpg?20100131231305",
      "title": "Bob Jones / Loch an Dubh-Lochain, Knoydart",
      "caption": "Loch an Dubh-Lochain, Knoydart. Knoydart, nestled between Lochs Nevis and Hourn, is often romantically referred to as being between \"Loch Heaven\" and \"Loch Hell\" due to the Gaelic names Loch Néimh and Loch Iutharn, respectively. However, these poetic translations are somewhat disputed. The area, known as na Garbh-Chrìochan or \"the Rough Bounds,\" is renowned for its rugged terrain and remoteness, earning it the moniker \"Britain's last wilderness.\" Access to Knoydart is particularly challenging, with no direct road connections to the UK network. The area can only be reached by boat or a demanding 16-mile (26 km) walk through rough country. Once there, visitors will find only 11 km (7 miles) of tarred road. Knoydart's stunning landscapes have led to its designation as one of Scotland's forty national scenic areas, which are regions identified for their exceptional beauty and protected from unsuitable development. This designation covers a vast 50,696 hectares (125,270 acres), of which 40,201 hectares (99,340 acres) are land, and the remaining 10,495 hectares (25,930 acres) are marine, lying below the low tide level. This combination of natural beauty and seclusion makes Knoydart a truly unique and protected area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Rainbow_over_Loch_Hourn_-_geograph.org.uk_-_5955668.jpg/512px-Rainbow_over_Loch_Hourn_-_geograph.org.uk_-_5955668.jpg?20231218223337",
      "title": "Rainbow over Loch Hourn by Bill Kasman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rainbow over Loch Hourn. Loch Hourn, known in Scottish Gaelic as Loch Shubhairne, is a stunning sea loch located on the west coast of Scotland, separating the Glenelg Peninsula to the north from the Knoydart Peninsula to the south. The loch extends inland for about 22 km (14 miles) from the Sound of Sleat, which lies opposite the Isle of Skye. At its widest point near the entrance, where it meets the Sound of Sleat, Loch Hourn is about 5 km (3 miles) wide. However, for much of its length, it narrows significantly, with the upper reaches becoming less than 2 km wide, and at its head, near Kinloch Hourn, it tapers to just 300 metres across. Often described as one of the most fjord-like sea lochs in northwest Scotland due to its steep sides and dramatic scenery, Loch Hourn is bordered by the towering peaks of Beinn Sgritheall to the north and Ladhar Bheinn to the south. The sea floor of the loch has been shaped by glaciation into five progressively deeper basins, separated by relatively shallow sills. This geological formation, combined with the loch's narrow and sheltered nature and the high local rainfall, creates a wide range of salinity levels and diverse sea habitats. The loch is navigable by ships up to Barisdale Bay, while small boats can reach Kinloch Hourn, although the upper reaches are heavily dependent on the tide and are subject to strong currents. The loch is also known for its fierce and unpredictable winds, making navigation challenging. Most of the shoreline is inaccessible by road, with the exception of a few isolated cottages and the small community of Arnisdale, which has a population of around 30 people. Kinloch Hourn itself is connected by a 36 km (22-mile) single-track road to the A87 near Invergarry. The local economy around Loch Hourn is modest, with activities including a fish farm near the loch's mouth, a few shell fishing boats, and employment related to the surrounding shooting estates. Tourism also provides some income to the area. However, a small passenger ferry that once operated from Arnisdale and provided access to the north shores of Knoydart ceased operations in 2011, reflecting the remote and tranquil nature of the region."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Kinloch_Hourn_Boathouse_-_geograph.org.uk_-_2419272.jpg/512px-Kinloch_Hourn_Boathouse_-_geograph.org.uk_-_2419272.jpg?20210731160038",
      "title": "Kinloch Hourn Boathouse by Glen Breaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Kinloch Hourn Boathouse. The small, remote settlement is located at the head of Loch Hourn in the West Highlands. The name is derived from the Gaelic \"Ceann Loch Shubhairne,\" meaning \"the head of Loch Hourn.\" The settlement is accessible via a 35 km (22-mile) single-track road that branches off from the A87 near Loch Garry. This road winds through the rugged Highland landscape, offering stunning views as it approaches Kinloch Hourn. From Kinloch Hourn, a path continues along the southern shore of Loch Hourn towards Barrisdale, before climbing over Màm Barrisdale and descending into Inverie on the Knoydart Peninsula. This route is historically significant, having once been dotted with townships and possibly serving as a coffin road. Today, it is popular among walkers heading into the remote mountains of Knoydart, including peaks like Ladhar Bheinn and Luinne Bheinn. To the north of Loch Hourn lies the route of an old drove road that connected Kinloch Hourn to Glenelg. This path was historically used for driving cattle from Skye across the Kyle Rhea to Glenelg, then along the route to Kinloch Hourn, and onward down Glen Garry. The area is rich in natural beauty and offers a glimpse into Scotland's historic pastoral landscape."
    }
  ],
  "distance_km": 24.6,
  "description": "This walk visits Britain's remotest pub in Inverie on the Knoydart peninsula, Scottish Highlands. The route takes you to the pretty village of Inverie following the Old Road from Kinloch Hourn and Loch Beag. In Inverie you can enjoy views over Loch Nevis and a visit to the Old Forge, Britain's remotest pub. Inverie is an isolated village only accessible by foot or by taking the ferry from Mallaig. The route starts from the village of Kinloch Hourn which you can reach at the end of a 35 km of single-track road, which runs west from a junction with the A87 beside Loch Garry. The walk then takes you west along the Old Road to Loch Hourn where you can enjoy a lochside stretch before continuing through the mountains to Inverie. On the way you will also pass Loch an Dubh-Lochain and the Inverie River with some glorious views throughout. Also look out for Knoydart's wildlife which includes badgers, pine marten, otters, red deer, buzzards, golden eagles and sea eagles; there are also two small herds of feral goats. You can continue your walking in the area by catching the Knoydart Ferry to Mallaig. In this area you can also visit the Silver Sands Of Morar, Loch Morar and Arisaig. The fantastic viewpoint at the historic Glenfinnan Viaduct is also not too far away.",
  "video_url": "https://www.youtube.com/embed/jl3a7pcrOzI?si=1NHFmJr6spXI3xBy",
  "postcode": "PH35 4HD",
  "district": "Kinloch Hourn",
  "county": "Highland",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}