{
  "created_at": "2025-01-06T11:19:01.225151+00:00",
  "objectID": "ae3a88e79cb50f65f093719265e8310e",
  "ref": "hoxne-heritage-walk",
  "title": "Hoxne Heritage Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Hoxne_heritage_walk_guide_-_geograph.org.uk_-_6073685.jpg/512px-Hoxne_heritage_walk_guide_-_geograph.org.uk_-_6073685.jpg?20240105225405",
  "nearby": [
    {
      "description": "Mid Suffolk Footpath",
      "objectID": "169f11c12fb1cfa5b5a1400a1d629831",
      "ref": "mid-suffolk-footpath-walking-route"
    },
    {
      "description": "Wortham Ling",
      "objectID": "d8c0e45dc7cdfbaf109f23aeee99a7e1",
      "ref": "wortham-ling-walking-route"
    },
    {
      "description": "Laxfield",
      "objectID": "40f74385f2a8952f38e677ec09c4695a",
      "ref": "laxfield-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ae3a88e79cb50f65f093719265e8310e.gpx",
  "_geoloc": {
    "lat": 52.3505426067,
    "lng": 1.200444142
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Hoxne_heritage_walk_guide_-_geograph.org.uk_-_6073685.jpg/512px-Hoxne_heritage_walk_guide_-_geograph.org.uk_-_6073685.jpg?20240105225405",
      "title": "Hoxne heritage walk guide by Adrian S Pye, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hoxne heritage walk guide. An example of one of the information boards on the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/St_Peter_and_St_Paul_church%2C_Hoxne-geograph.org.uk-1916427.jpg?20140226145829",
      "title": "Adrian S Pye / Hoxne St Peter and St Paul's church",
      "caption": "St Peter and St Paul church, Hoxne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Low_Street%2C_Hoxne-geograph-3277093.jpg/512px-Low_Street%2C_Hoxne-geograph-3277093.jpg?20140814192447",
      "title": "Chris Holifield / Low Street Hoxne",
      "caption": "Low Street, Hoxne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Track_alongside_Brakey_Wood_-_geograph.org.uk_-_3277112.jpg/512px-Track_alongside_Brakey_Wood_-_geograph.org.uk_-_3277112.jpg?20220306151153",
      "title": "Track alongside Brakey Wood by Chris Holifield, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Track alongside Brakey Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Water_Mill_Lane%2C_Hoxne_-_geograph.org.uk_-_4382601.jpg/512px-Water_Mill_Lane%2C_Hoxne_-_geograph.org.uk_-_4382601.jpg?20230206021603",
      "title": "Water Mill Lane, Hoxne by Geographer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Water Mill Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Brakey_Wood_Hoxne_Suffolk_-_geograph.org.uk_-_5465814.jpg/256px-Brakey_Wood_Hoxne_Suffolk_-_geograph.org.uk_-_5465814.jpg?20230923075456",
      "title": "Brakey Wood Hoxne Suffolk by Bob Pearce, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Brakey Wood"
    }
  ],
  "distance_km": 3.8,
  "description": "This waymarked circular walk explores the area around the historic Mid Suffolk village of Hoxne. In the village you will pass a number of information boards with more details on the features and history of the settlement (see below for more details). On the walk you can enjoy some fine views of the surrounding countryside. The route also links up with the Mid Suffolk Footpath which you could follow north to enjoy views of the River Waveney.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Here is a route description with some of the information board detail: Starting at the village hall, veer left and cross Goldbrook Bridge. This spot is famed as the site where Edmund was captured after a wedding party reported glimpsing the glimmer of his golden spurs reflected in the water under the bridge. Legend holds that the King placed a curse on newlyweds crossing the bridge, and it remains a village tradition for newlywed couples to avoid crossing it on their wedding day. At the junction, turn right towards Low Street, crossing a second bridge known as Swan Bridge. The Swan offers local beers and homely cooked meals. The gardens are delightful, featuring tables overlooking the river. Various architectural styles can be observed at the rear of this historic building. Opposite The Swan is the former butcher's shop, adorned with painted glass panels depicting a bull and ram. Close by stands the old bakery and Village Post Office, which stocks local produce, refreshments, local guides, books, and village postcards. Overlooking the village green, one can find a covered seat. The village green, once a site for a weekly market, forms an inverted triangle with its base stretching in front of the uphill church. Diverse in dates and styles, the houses, cottages, and shops dotting the landscape reflect the village's rich history. Ascend Church Hill, passing the old infant school building, erected circa 1760 as an endowed School. As you reach Green Street at the summit, near the church, you'll catch sight of the Victorian almshouses. Situated in the Lych Gate of the church, Information Board 4 tells the story of The Church. St. Peter and St. Paul's church, dating back to the 14th century, boasts a lofty tower offering sweeping views across the River Waveney valley. Inside, memorials to various families adorn the interior, along with tributes to soldiers fallen in the two World Wars and to Captain Burgoyne V.C. of H.M.S. Captain. Within the Lady Chapel, a carved screen depicts the martyrdom of St. Edmund, while a bench end illustrates the discovery of the King's severed head guarded by a wolf. Noteworthy features include painted murals above the nave arcade and a marble memorial to Thomas Maynard by Charles Stanley. Visitors can purchase church guides, leaflets, and postcards by the font. In the churchyard, a diverse array of plants and wildlife can be observed, including a Cedar of Lebanon tree and muntjac deer. Nearby stands the timber-framed Vicarage, ensconced within private grounds adorned with specimen trees such as Mulberry and Sequoia. Information Board 5, located within the church, focuses on The Hoxne Hoard, now on display at the British Museum in London. Departing the churchyard, take a left and stroll along the road until you reach Mill Lane on your left. Follow this path downhill for two minutes, then veer right at the fork. Continue towards the watermill, privately owned, and then turn right before the watermill, passing Low Farm. Proceed along the footpath to the junction of Green Street, near Dairy Farm. Take caution when crossing the road here and head to Wittons Lane. Follow Wittons Lane, turning right into the Brakey Wood car park. Alternatively, you can traverse Wittons Lane to Tudor Close and Information Board 7. Information Board 6 showcases Brakey Wood, a 15-acre millennium wood planted with a variety of trees. Wander along the left-hand path, passing the Hoxne Man sculpture, and then veer left as you approach the stream-side path. Continue to the gate by the water treatment works, then uphill and right to cross a ditch. Follow the footpath to Downbridge Farm, being mindful of rabbit-holes along the way. At Downbridge Farm, take the left track uphill to join Oak Hill road. At the junction, Information Board 8 awaits your discovery. Information Board 7, found at Heckfield Green, delves into the village's history, including the discovery of Tudor coins and the area's association with flax processing. Information Board 8 marks the site of St. Edmund's Cross, where the ancient oak tree, to which King Edmund was purportedly tied and shot with arrows in 869 AD, once stood. Descend the road to return to your starting point at the Village Hall car park. For further details, visit the parish church, where you'll find a history display showcasing the village and St. Edmund. Additional information pertains to Hugh Burgoyne VC of HMS Captain and the Wake-Walker family of The Depperhaugh. Locally, various books about the village, St. Edmund, and the Hoxne Hoard are available for purchase. Nearby libraries can be found at Stradbroke, Eye, and Diss, the latter of which boasts a tourist information centre."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UKZTS7ew0k0?si=flPh4UBCCjFBr8kO",
  "district": "Hoxne",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}