{
  "created_at": "2025-01-06T01:29:39.441397+00:00",
  "objectID": "ae543d4f53b299797801e223ee46e066",
  "ref": "surlingham-walking-route",
  "title": "Surlingham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c0/The_village_pond_in_Surlingham_-_geograph.org.uk_-_1605731.jpg",
  "nearby": [
    {
      "description": "Wherryman's Way",
      "objectID": "b81d253a737b17ad07a0749a92ba69fa",
      "ref": "wherrymans-way-walking-route"
    },
    {
      "description": "Whitlingham Country Park",
      "objectID": "82311af9906ae486b8267d53df74030c",
      "ref": "whitlingham-country-park-walking-and-cycle-route"
    },
    {
      "description": "Norwich Riverside Walk",
      "objectID": "384fcd894f6a38346574000e43d48f68",
      "ref": "norwich-riverside-walk-walking-route"
    },
    {
      "description": "Mousehold Heath",
      "objectID": "3ed62df91774732af2e2e39e8abf5523",
      "ref": "mousehold-heath-walking-route"
    },
    {
      "description": "Caistor St Edmund",
      "objectID": "e52753381b6aae47ee83a5918b69e50b",
      "ref": "caistor-st-edmund-walking-route"
    },
    {
      "description": "Loddon",
      "objectID": "72a7c7484c779a8fa355702c3ff85dbf",
      "ref": "loddon-walking-route"
    },
    {
      "description": "Brundall",
      "objectID": "c6bad2a03005020a7933ec14f12dafec",
      "ref": "brundall-walking-route"
    },
    {
      "description": "Reedham",
      "objectID": "5a36129b8eab18365f972d5d5f3ba8ff",
      "ref": "reedham-walking-route"
    },
    {
      "description": "Shotesham",
      "objectID": "eb236b5b6bd450ef8dc43fdda97dc724",
      "ref": "shotesham-walking-route"
    },
    {
      "description": "Burlingham Woods",
      "objectID": "684beff1a2e69fe8758c8f9f7cfdcf8f",
      "ref": "burlingham-woods-walking-route"
    },
    {
      "description": "Bramerton Riverside Walk",
      "objectID": "ed7b6c563e9cf7c6e3352000c1f480cf",
      "ref": "bramerton-riverside-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ae543d4f53b299797801e223ee46e066.gpx",
  "_geoloc": {
    "lat": 52.607320515,
    "lng": 1.4031393226
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/The_village_pond_in_Surlingham_-_geograph.org.uk_-_1605731.jpg",
      "title": "Evelyn Simak / The village pond in Surlingham",
      "caption": "The village pond in Surlingham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Surlingham_Church_Marsh_Nature_Reserve_-_geograph.org.uk_-_1285247.jpg",
      "title": "Evelyn Simak / Surlingham Church Marsh Nature Reserve",
      "caption": "Church Marsh Nature Reserve. In spring and summer, marsh harriers, kingfishers, water rails, and reed and sedge warblers can be seen in this small nature reserve which can be accessed via a circular walk which starts and ends by St Mary's church. Dogs are only allowed on public footpaths and bridleways. A great variety of wild flowers and plants, some of these rare such as marsh orchids and mild parsley, can be seen and in order to maintain and improve diversity, Highland Cattle is grazed here during the summer months. The site floods in winter, attracting bitterns, gadwalls and shovelers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/View_north_along_the_River_Yare_-_geograph.org.uk_-_1285236.jpg",
      "title": "Evelyn Simak / View north along the River Yare",
      "caption": "View north along the River Yare. This view was taken from the Wherryman's Way, a 35-mile long distance footpath following the route of the Broads trading wherries between Norwich and Great Yarmouth. The route takes its name from the wherry \u0096 a large cargo-carrying barge whose black sails used to be a common sight on these waters. Ten circular village walks branch off this path along the way. This section of the long distance footpath follows the course of the River Yare. The River Yare rises south of Dereham. It flows eastwards, skirting the southern edge of the city of Norwich. At Whitlingham it is joined by the River Wensum and just before reaching Reedham it is joined by the River Chet. Once past Reedham the river passes long stretches of marshland before it enters the tidal lake of Breydon Water where it is joined by the Rivers Bure and Waveney, and finally flows into the North Sea at Gorleston just south of Great Yarmouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/The_Ferry_House_Inn_-_geograph.org.uk_-_1420053.jpg",
      "title": "Evelyn Simak / The Ferry House Inn",
      "caption": "The Ferry House Inn. The Ferry House was first recorded in 1725. It is described as having had ice storage facilities in the 1700s used to supply coastal fish merchants. During the 1800s the building was used as a coal depot and as a court house for the collection of tithes, and from the early 1900s onwards it has been an inn. The ferry operation ceased at around 1939 after a collision with a coaster."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Surlingham_Staithe_-_geograph.org.uk_-_119019.jpg",
      "title": "Graham Hardy / Surlingham Staithe",
      "caption": "Surlingham Staithe. The Staithe is owned and maintained by the local Parish Council."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Shelter_by_Surlingham_Church_Marsh_-_geograph.org.uk_-_1285241.jpg",
      "title": "Evelyn Simak / Shelter by Surlingham Church Marsh",
      "caption": "Shelter by Church Marsh"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Church_Marsh_Nature_Reserve_-_geograph.org.uk_-_1280738.jpg",
      "title": "Evelyn Simak / Church Marsh Nature Reserve",
      "caption": "Church Marsh Nature Reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Surlingham_Manor_-_geograph.org.uk_-_1605660.jpg",
      "title": "Evelyn Simak / Surlingham Manor",
      "caption": "Surlingham Manor dates from the 16th century. The property is surrounded by 13 acres of lawns, a fishing lake, sheep pastures and woodland. Surlingham Manor was once owned by John Villiers Farrow, the award-winning film director, producer and screen writer, husband of Maureen O'Sullivan and father to another Hollywood icon, Mia Farrow."
    }
  ],
  "distance_km": 5.0,
  "description": "This Norfolk Broads village is a super place for a walk with river trails, broads and a fine local nature reserve to explore. This circular walk from the village explores the RSPB Church Marsh Nature Reserve and Surlingham Staithe on the edge of Surlingham Broad. The walk starts from the car park at the nature reserve, just to the north west of the village. From here you can pick up footpaths heading along the River Yare through the reserve. The site is great for flora and fauna with a wide variety of wildflowers and bird species to look out for. Keep your eyes peeled for Hobby, Marsh Harrier, Sedge Warbler and Kingfisher as you make your way through the area. At the Ferry House you leave the river and head closer to the adjacent Surlingham Staithe. The route then heads into the village before returning to the car park, passing the ruined old church on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route stop off at the splendidly located Ferry House Inn. You can sit outside in the lovely large garden area and watch the boats go as you enjoy lunch. You'll pass the inn at the eastern side of the reserve on Ferry Road at postcode NR14 7AR."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reserve is a lovely place for a dog walk though you are asked to please keep them on leads. The Ferry House Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west you can pick up the Bramerton Riverside Walk. This visits Bramerton Pits Site of Special Scientific Interest and the Water's Edge Pub. There's a small public car park here and at the pub which makes an alternative start point for a walk in the area. The Gastropub dates back to the 17th century and has a fine outdoor decking area right next to the river. Just to the south of the village there's the Wheatfen Nature Reserve. There's open fens, swaying reeds and wild woodland in this beautiful area. The Wherryman's Way runs through area and can be used to extend the walk. Head west and you could visit the nearby Whitlingham Country Park and pick up the Norwich Riverside Walk. To the south there's the worthy village of Loddon where you'll find an 18th century mill, a 15th century church and some lovely trails along the River Chet to Hardley Marshes. On the other side of the river there's the neighbouring village of Brundall, which is famous for its boat building industry. Near here you'll also find the RSPB's Strumpshaw Fen. There's some lovely trails here with River Yare views, marshland, lakes, orchid-rich meadows and lots of birdlife to see. A few miles to the north east of Brundall there's Burlingham where you can explore the peaceful trails around Burlingham Woods. It's a lovely place for a stroll with carpets of snowdrops in Ferbruary and lots of bluebells in the spring months. There's also the interesting ancient ruins of the 14th century St Peter church to see here. For more walking ideas in the area see the Norfolk Broads Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/-MtlGYciSPM",
  "postcode": "NR14 7DF",
  "district": "South Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "1 Church Cottages, Church Lane, Surlingham, South Norfolk, Norfolk, England, NR14 7DF, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "nature reserve"
  ],
  "points_of_interest": [
    "nature reserve",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}