{
  "created_at": "2025-01-06T09:20:29.322274+00:00",
  "objectID": "ae64fb1d26f9c9c619496e1ca01d055c",
  "ref": "aldermaston-walking-route",
  "title": "Aldermaston Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Aldermaston_Village_-_geograph.org.uk_-_599145.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/ae64fb1d26f9c9c619496e1ca01d055c.gpx",
  "_geoloc": {
    "lat": 51.3837836875,
    "lng": -1.1524583536
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Aldermaston_Village_-_geograph.org.uk_-_599145.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Aldermaston Village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Aldermaston_Wharf_lock_-_geograph.org.uk_-_1822772.jpg",
      "title": "Aldermaston Wharf lock by Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Aldermaston Wharf lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Aldermaston_Wharf_-_geograph.org.uk_-_1189190.jpg",
      "title": "Graham Horn / Aldermaston Wharf",
      "caption": "Aldermaston Wharf. This is the original wharf (off to the right) on the Kennet navigation, now the Kennet and Avon canal, that served the village of Aldermaston, two miles to the south. Thus a small community grew up here in its own right. The lock was originally a turf-sided lock, like all of them on the Kennet navigation between Reading and Newbury. It was rebuilt in 1984 during the restoration of the canal. The flats have been built during the last few years on the site of the former Sterling Cables works. Various canoeists are seen practising for the Devizes to Westminster canoe race, that takes place over the Easter weekend. The swans ignore all the activity and go about their business."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Kennet_and_Avon_Canal_west_of_Aldermaston_-_geograph.org.uk_-_332969.jpg",
      "title": "Graham Horn / Kennet and Avon Canal west of Aldermaston",
      "caption": "Kennet and Avon Canal west of Aldermaston. Beyond Aldermaston Wharf the canal soon becomes rural again. The railway, although just behind the trees on the left, hardly intrudes here. The area behind the left bank used to be the Sterling Cables factory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Padworth_Mill_-_geograph.org.uk_-_2391813.jpg/512px-Padworth_Mill_-_geograph.org.uk_-_2391813.jpg",
      "title": "Padworth Mill by Bill Nicholls, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Padworth Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Cottages_by_the_canal_-_geograph.org.uk_-_2375525.jpg/512px-Cottages_by_the_canal_-_geograph.org.uk_-_2375525.jpg",
      "title": "Cottages by the canal by Bill Nicholls, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cottages by the canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Frouds_Lane_Bridge_-_geograph.org.uk_-_332978.jpg",
      "title": "Graham Horn / Frouds Lane Bridge",
      "caption": "Frouds Lane Bridge. This used to be a swing bridge across the canal (like many in the area). However, when the canal was restored the lie of the land (a rise to the north over the railway line) allowed a high level road bridge to be built. Constructed 1989."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Woolhampton_swing_bridge_-_geograph.org.uk_-_333009.jpg",
      "title": "Graham Horn / Woolhampton swing bridge",
      "caption": "Woolhampton swing bridge. Frequently used swing bridge on a busy minor road. The river Kennet is very fast flowing and inexperienced boats are often caught out here. Bridge rebuilt 1990. This location was probably the last physical barrier to through navigation on the Kennet and Avon Canal. The old bridge was removed during July 1990 and boats first allowed through on 17th July 1990, the first for over 40 years."
    }
  ],
  "distance_km": 6.0,
  "description": "This Berkshire based village has some nice river and canalside trails to try. This walk from the village takes you up to Aldermaston Wharf on the Kennet and Avon Canal. You then follow the towpath west to visit the neighbouring village of Woolhampton. The walk starts in the village and then follows the Fisherman's Lane track north east to Padworth Mill where you cross the River Kennet. You head north here, passing the flooded gravel pits before arriving at Aldermaston Wharf. The wharf is a significant spot on the canal with a British Waterways visitor centre to explore. It includes a tea room and is located at the canal east of the lift bridge. Here you can pick up the canal towpath and follow it west to Woolhampton where there's a pretty lock, bridge and train station.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route stop off at the Aldermaston Tea Rooms for refreshments. The tea rooms are located in a lovely spot by the canal at the Wharf. You can sit outside in the garden area and enjoy a cream tea with views of the water. The cafe can be found at Wharfside, RG7 4JS."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The waterside trails make for a pleasant dog walk. The tea room mentioned above is also dog friendly with water bowls available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south to the nearby town of Tadley and you could enjoy woodland trails around the expansive Pamber Forest before heading to the ancient Roman Fort at Silchester. Head east and you can enjoy canal walks, river trails and a visit to the wildlife rich Hosehill Lake Nature Reserve on the Theale Walk. For more walking ideas in the area see the Berkshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/9wCv2AA8UOg",
  "postcode": "RG7 4LL",
  "district": "Aldermaston",
  "county": "West Berkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Fisherman's Lane, Aldermaston, West Berkshire, England, RG7 4LL, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "waterways"
  ],
  "facilities": [
    "visitor center",
    "tea room",
    "car park",
    "lock",
    "bridge",
    "train station"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}