{
  "created_at": "2025-01-06T02:48:33.572449+00:00",
  "objectID": "aeb59b23526cfd8bd5521bd004d22599",
  "ref": "wainwrights-coast-to-coast-walking-route",
  "title": "Wainwright's Coast to Coast Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/74/Nesting_Kittiwakes_on_North_Head_-_geograph.org.uk_-_1192633.jpg",
  "nearby": [
    {
      "description": "Haweswater",
      "objectID": "bd2a915f127ef832aa904b96d7db0e1e",
      "ref": "haweswater-walking-route"
    },
    {
      "description": "St Bees Head",
      "objectID": "098788cc3b27ce19bfc65813244796f1",
      "ref": "st-bees-head-walking-route"
    },
    {
      "description": "Nine Standards Rigg",
      "objectID": "2e00e6d8e1c6eac055418c551448ca58",
      "ref": "nine-standards-rigg-walking-route"
    },
    {
      "description": "Grasmere",
      "objectID": "cd0db4fd42fbe1c17c798db9dd095e9c",
      "ref": "grasmere-walking-route"
    },
    {
      "description": "Seat Sandal",
      "objectID": "1de332e4cd291b9cc5b50dae20d3bc1e",
      "ref": "seat-sandal-walking-route"
    },
    {
      "description": "Richmond North Yorkshire",
      "objectID": "584771c1f524eb28f4a023e15f503234",
      "ref": "richmond-north-yorkshire-walking-route"
    },
    {
      "description": "Shap Abbey",
      "objectID": "0a15e05be3ae7eb0835326dd0ada7850",
      "ref": "shap-abbey-walking-route"
    },
    {
      "description": "Ennerdale Water",
      "objectID": "e80e86107013e92fb3a9b4fb58254edd",
      "ref": "ennerdale-water-walking-route"
    },
    {
      "description": "Falling Foss",
      "objectID": "60476999833dc06556ef598f1bc23b49",
      "ref": "falling-foss-walking-route"
    },
    {
      "description": "Crosby Ravensworth",
      "objectID": "3cdc5799781a84d3425f5fc3be06a623",
      "ref": "crosby-ravensworth-walking-route"
    },
    {
      "description": "Orton Scar",
      "objectID": "d0dfc7a08211920e9152c6afd930ef1e",
      "ref": "orton-scar-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aeb59b23526cfd8bd5521bd004d22599.gpx",
  "_geoloc": {
    "lat": 54.4911289458,
    "lng": -3.6065657817
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Nesting_Kittiwakes_on_North_Head_-_geograph.org.uk_-_1192633.jpg",
      "title": "Andy Waddington / Nesting Kittiwakes on North Head, via Wikimedia Commons",
      "caption": "Nesting Kittiwakes on North Head, St Bees. The cliffs of North Head, from Fleswick Bay northwards, have ledges eroded in the sandstone, which provide ideal nesting sites for Kittiwakes, visible only from the sea. In April or May, a sea kayak trip from St. Bees to Whitehaven gives an opportunity to see the cliff nests at very close quarters."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/StBeesLighthouse.jpg",
      "title": "Humphrey Bolton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "St Bees Lighthouse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/RobinHood%27sBay.jpg",
      "title": "By AEK at no.wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], from Wikimedia Commons",
      "caption": "Robin Hood's Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Coast_to_Coast_footpath_across_Crosby_Ravensworth_Fell_-_geograph.org.uk_-_179651.jpg",
      "title": "mauldy / Coast to Coast footpath across Crosby Ravensworth Fell",
      "caption": "Coast to Coast footpath across Crosby Ravensworth Fell. The trail crosses this fell just south of the village of Crosby Ravensworth in the Eden District of Cumbria. There are excellent views and a wide expanse of limestone pavement on the fell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Orton_village_-_geograph.org.uk_-_1362252.jpg",
      "title": "roger geach / Orton village",
      "caption": "Orton village in Cumbria. The village includes a small handmade-chocolate factory, a pretty Tearoom and several B&Bs. There's also a number of 17th century cottages and a church dating back to the 13th century. The village is near to Orton Scar where you can see some interesting geological features and enjoy some excellent views of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Shap_Abbey_tower_and_nave_ruins%2C_Cumbria_-_view_from_the_west.jpg/512px-Shap_Abbey_tower_and_nave_ruins%2C_Cumbria_-_view_from_the_west.jpg",
      "title": "Rosser1954, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Shap Abbey tower and nave ruins, Cumbria."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Statue_to_commemorate_Wainwright%27s_Coast_to_Coast_Walk_-_geograph.org.uk_-_1924781.jpg/512px-Statue_to_commemorate_Wainwright%27s_Coast_to_Coast_Walk_-_geograph.org.uk_-_1924781.jpg",
      "title": "Statue to commemorate Wainwright's Coast to Coast Walk by Phil Catterall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Statue to commemorate Wainwright's Coast to Coast Walk at Egremont"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Coast_to_Coast_path_-_geograph.org.uk_-_1290117.jpg",
      "title": "Gordon Hatton / Coast to Coast path",
      "caption": "This Gunnerside estate track and public footpath is also part of Wainwright's Coast to Coast path. Looking west from near the highest part of the moor at 580m, towards the long flattish top of High Seat and High Pike Hill. Nine Standards is to the right with a glimpse of Lakeland hills through the gap."
    }
  ],
  "distance_km": 294.0,
  "description": "Travel from the west coast of England to the east along this breathtaking route devised by Alfred Wainwright. The walk passes through three of England's most beautiful National Parks taking you on a tour of some of the most incredible scenery in the country. Starting at St Bees Head the route leads you into the wonderful Lake District National Park with its series of beautiful lakes and mountains. The path continues east into the Yorkshire Dales National Park with more delightful countryside to enjoy. The final stretch takes you through the splendid moorland scenery of the North York Moors National Park and then along the North Yorkshire coast to the finish point at the fishing village of Robin Hood's Bay.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village of St Bees you could head to the 17th century Queens Hotel which has a cosy country pub atmosphere with oak beams and log fires in winter. They do good food which can be taken in the nice conservatory or the terraced garden bar on warmer days. They also provide accommodation if you need to stay over. You can find the hotel near the train station on 130 Main St, with a postcode of CA27 0DE for your sat navs. In the Lake District you could stop at The Haweswater Hotel which is perched right on the eastern side of the lake. There's a lovely outdoor terrace with wonderful views over the lake, towards Kidsty Pike. It's the perfect place to relax on a warm day. As an additional attraction the hotel has some pretty gardens to explore. There's mature trees and shrubs, including rhododendrons, maples and azaleas, interspersed with rock gardens, heather and alpine plantings. You may also see some of the tame red squirrels.The Crown and Mitre is a historic pub of some note. On the route in Bampton Grange, you will find this free house nestled in a wonderful location on the edge of the North Eastern Fells. It's a popular stopping point on the c2c walk and also provides accommodation. You can find it a couple of miles north of Haweswater at postcode CA10 2QR. There's also some nice riverside footpaths in the village if you fancy stretching your legs further. In Shap there's the Greyhound Hotel. The pub is another popular stopping point for people doing the walk. It's set in a 17 century stone house and does very good food. It also has a series of picnic tables outside for warmer days. You can find the pub on Main St with a postcode of CA10 3PW for your sat navs. Also pay a visit to the atmospheric ruins of the 12th century Shap Abbey if you have time. Head west of Ennerdale Water to the Shepherd's Arms for some post walk refreshments. An old village-centre farm, the pub is a comfortable and friendly destination in the Lakeland tradition, offering visitors good food and good ales in the company of convivial locals. It's a popular stop off point for walkers doing the Wainwright's Coast to Coast as the route passes right through the area. Indoors there's a cosy interior with two real fires to warm yourself by during the winter months. Outside there's seating overlooking the waters of the pretty beck. The pub is dog friendly and also does good quality accommodation if you need to stay over. You can find it on Kirkland Road at Ennerdale Bridge with a postcode of CA23 3AR for your sat navs. Falling Foss waterfall in the North York Moors is one of the highlights on the route. Here you can stop off at The Falling Foss Tea Rooms. The little tea rooms are located at Midge Hall, a tiny cottage which nestles at the top of the falls. They have a good range of meals and snacks with an outdoor seating area overlooking the waterfall. You can find them at a postcode of YO22 5JD. At the end of the walk there's The Bay Hotel. The inn dates back to 1828 and is located in a lovely spot in The Dock at Robin Hood's Bay. The bottom bar of the hotel has been renamed Wainwright's Bar in his memory. They serve good home cooked food and have an outdoor seating area for warmer days. You can find them at postcode YO22 4SJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Highlights on the route include: The High Bridestones on Sleights Moor near Grosmont. There's several fallen megaliths and lovely heather moorland to see here. The moor is located on the Coast to Coast Walk about 2 miles east of Grosmont. The stones date from the Bronze Age with some still standing today. Richmond - This interesting North Yorkshire town has some lovely riverside trails along the River Swale and two fine long distance trails to try."
    }
  ],
  "video_url": "https://www.youtube.com/embed/vP6x6Wr8Oxo",
  "district": "Rottington",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "St Bees Lifeboat Station, St Bees Promenade, St. Bees, Rottington, Cumberland, England, CA27 0EU, United Kingdom",
  "postcode": "CA27 0EU",
  "state": "England"
}