{
  "created_at": "2025-01-06T03:39:19.828079+00:00",
  "objectID": "aeeddfb62aebf5aa3d2140fa2fd90fd2",
  "ref": "alwinton-walking-route",
  "title": "Alwinton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/18/Alwinton_village_green_and_Hosedon_Burn_-_geograph.org.uk_-_1222147.jpg",
  "nearby": [
    {
      "description": "Kidland Forest",
      "objectID": "2af0fe2d9b2df40a2a9b08ce43aca243",
      "ref": "kidland-forest-cycle-route"
    },
    {
      "description": "Harwood Forest",
      "objectID": "82f81ec20a2ddc3f5d6493e2d699447e",
      "ref": "harwood-forest-cycle-route"
    },
    {
      "description": "Simonside Hills",
      "objectID": "b57d4d3432f4e77e22779ef7fc49285d",
      "ref": "simonside-hills-walking-route"
    },
    {
      "description": "Fontburn Reservoir",
      "objectID": "82d96ac2c28e80e32fdeea9d6a3ccc43",
      "ref": "fontburn-reservoir-walking-route"
    },
    {
      "description": "Usway Burn - River Coquet - Upper Coquetdale Walk",
      "objectID": "0daf7061dfa18ed1978337a51067433a",
      "ref": "usway-burn-walking-route"
    },
    {
      "description": "Elsdon",
      "objectID": "348354fbcab5b2b5803a01346230e1d3",
      "ref": "elsdon-walking-route"
    },
    {
      "description": "Otterburn",
      "objectID": "5d9a9089bb104f93c1f765eb0418a084",
      "ref": "otterburn-walking-route"
    },
    {
      "description": "Harbottle",
      "objectID": "78044d2725cc73985214462786f169ea",
      "ref": "harbottle-walking-route"
    },
    {
      "description": "Border County Ride",
      "objectID": "7c73099d69edec6248153d73b1c0279c",
      "ref": "border-county-ride-walking-and-cycle-route"
    },
    {
      "description": "Shepherds Cairn",
      "objectID": "ff339b8c6c991b0f90d72123354b8676",
      "ref": "shepherds-cairn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aeeddfb62aebf5aa3d2140fa2fd90fd2.gpx",
  "_geoloc": {
    "lat": 55.3508394794,
    "lng": -2.1258151475
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Alwinton_village_green_and_Hosedon_Burn_-_geograph.org.uk_-_1222147.jpg",
      "title": "Oliver Dixon / Alwinton village green and Hosedon Burn",
      "caption": "Alwinton village green and Hosedon Burn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Limekilns%2C_Low_Alwinton_-_geograph.org.uk_-_455119.jpg/256px-Limekilns%2C_Low_Alwinton_-_geograph.org.uk_-_455119.jpg",
      "title": "Andy Gryce / Limekilns, Low Alwinton",
      "caption": "Limekilns, Low Alwinton. In Northumberland the practice of liming farmland dates back to the 17th century. Burnt lime was used to 'sweeten' acid soil to produce better crops and improve rough pasture. Agricultural burning of limestone was a small scale enterprise; landowners built the kilns to provide lime mainly for their own estates. These lime kilns on the side of the bridleway that runs south-east from Low Alwinton, were built about 1827 by the Selby family to supply lime to the Biddlestone estate but ceased working in 1866 because of high operating costs and competition from big commercial kilns. The kilns were restored by the Northumberland National Park Authority."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Bridleway_near_Low_Alwinton_-_geograph.org.uk_-_455139.jpg",
      "title": "Andy Gryce / Bridleway near Low Alwinton",
      "caption": "Bridleway near Low Alwinton. This view looking south-east is of the bridleway from Low Alwinton to Harbottle with Ashy Bank to the right, which goes down to the River Coquet, and Hob's Knowe (Knowe - Scottish or North England for a knoll or small rounded hill) on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Harbottle_Castle_-_geograph.org.uk_-_950747.jpg",
      "title": "Antonia / Harbottle Castle",
      "caption": "Harbottle Castle. In the 12th century King Henry II ordered a stone castle to be built on this site to defend the area against the Scots. Margaret Tudor, wife of King James IV of Scotland, moved into the castle in 1515. Her baby daughter, born at Harbottle, was to become the grandmother of James I and VI of Scotland. In 1685, the stone from the castle was plundered by Roger Widdrington to build a new house in the village. Others followed his lead and the castle was reduced to ruin. Further damage was caused by quarrying between 1685 and the 1800s, however the site is now protected."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Harbottle_Lake_-_geograph.org.uk_-_120601.jpg",
      "title": "Matt Offer / Harbottle Lake",
      "caption": "Harbottle Lake. This pretty small lake sits on the edge of West Wood in the Harbottle Hills. The smoke in the background is from a live firing exercise in the Otterburn Training Area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/The_Drake_Stone_-_geograph.org.uk_-_1495277.jpg",
      "title": "Andrew Curtis / The Drake Stone",
      "caption": "The Drake Stone. This huge sandstone boulder has been polished and scratched by movements of the ice sheet during the last glaciation. Supposedly, the largest boulder in Northumberland, it is 9 metres high and weighs in excess of 2000 tons. It is said to possess magical healing powers. Link to photographs, description and folklore of the Drake Stone on The Modern Antiquarian."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Coquetdale_near_Low_Alwinton_-_geograph.org.uk_-_456112.jpg",
      "title": "Andy Gryce / Coquetdale near Low Alwinton",
      "caption": "Coquetdale near Low Alwinton. This view looking south from the bridleway between Low Alwinton and Harbottle is of the valley of the River Coquet, Coquetdale, with the almost hidden river flowing right to left on the edge of the woods in the middle distance. Beyond the river is Harbottle Woods, and to the left, the Harbottle Hills, both of which are within the Otterburn army training area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/River_Coquet%2C_Harbottle_-_geograph.org.uk_-_456200.jpg",
      "title": "Andy Gryce / River Coquet, Harbottle",
      "caption": "River Coquet, Harbottle. This view looking north-west taken from the footbridge in Harbottle shows the River Coquet, pronounced Coe-kit, flowing towards the camera. The source of the river is in the Cheviot Hills exactly on the border between England and Scotland near the Roman Camps of Chew Green. From Harbottle the river flows east through Rothbury, the 'capital of Coquetdale', and enters the North Sea at Amble, a total length of 40 miles. The river is a Site of Special Scientific Interest (SSSI) for its entire length."
    }
  ],
  "distance_km": 8.0,
  "description": "This Northumberland based village has some lovely heather moorland, riverside trails, interesting geology, hill climbs and a historic old castle to explore. It's located in a splendid spot in Upper Coquetdale at the point where the River Alwin meets with the River Coquet. The village also has an interesting history with a 12th century Norman church and a fine old pub to visit. This circular walk from the village visits some of the highlights of the area including the River Alwin, River Coquet, Harbottle Castle, West Wood and the Drake Stone. The walk starts from the public car park in the village centre and heads south past the ford and over the River Alwin. Continue south on the country lanes and they will take you to Low Alwinton. Here you can pick up the Border Country Ride and follow the bridle path south east along the River Coquet to Harbottle. Here you cross the river and head through Harbottle village to the remains of the castle. The medieval castle is a Scheduled Ancient Monument and a Grade I listed building. It's a photogenic spot with atmospheric old ruins overlooking the ruins below. There's an information board at the site where you can find out all about the castle's history. The structure was originally built about 1160 by the Umfraville family at the request of King Henry II on land awarded to them following the Norman Conquest. After exploring the castle the route then heads south west passing the Old Manse before climbing to the Drake Stone in the Harbottle Hills. The huge sandstone boulder is a feature of the local landscape. It's also any excellent viewpoint with fine views towards the surrounding hills and countryside of the Cheviots and the Northumberland National Park. You continue south west to Harbottle Lake where you turn north to enter West Wood where there are some nice peaceful woodland trails. Follow footpaths around the woods and they will lead you back towards Alwinton. The area is great for wildlife with red squirrels and roe deer to look out for in the woodlands. In the skies keep your eyes peeled for buzzards, barn owls, wren, stonechat and wheatears.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Alwinton you could head to the Rose and Thistle for some post walk refreshment. The old coaching inn is located at the intersection of several ancient Drovers roads linking England to Scotland. They have a good menu and a nice garden area with views of the surrounding countryside. You can find them at NE65 7BQ for your sat navs. In Harbottle there's the Star Inn to consider. The 200 year old coaching inn has an open fire and a wood fired pizzeria serving delicious pizza, pasta and fish. There is also a well stocked shop at the rear of the pub, which serves as an official Information Point for the Northumberland National Park. You can find them in the village at postcode NE65 7DG."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and riverside trails on the route are ideal for a dog walk. The Star Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Harbottle Crags Walk visits some interesting rock formations and the peaceful trails in Harbottle Woods. It starts from the neighbouring village which lies just to the south. Just a couple of miles north of the village you'll find the expansive Kidland Forest where there are miles of good cycling and walking trails to try. Head south and you could explore the splendid Harwood Forest near Elsdon in the Simonside Hills. The waterside track along Fontburn Reservoir is also located near this area. The Usway Burn - River Coquet - Upper Coquetdale Walk starts in the village car park. It explores the waterside paths in the lovely Upper Coquetdale to the north west of the settlement. To the north east there's the circular Shepherds Cairn Walk which visits a memorial to two shepherds who lost their lives in the exceptionally cold winter of 1962. The walk starts from Alnham where there's a noteworthy Grade I listed 12th century church. For more walking ideas in the area see the Cheviots Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ew4gYB7bSjg",
  "county": "Northumberland",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}