{
  "created_at": "2025-01-06T00:10:32.391884+00:00",
  "objectID": "aef271cd17d3396197255c8e2b5e90f5",
  "ref": "totnes-river-walk-walking-route",
  "title": "Totnes River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Rivers_Hems_and_Dart_-_geograph.org.uk_-_585703.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/aef271cd17d3396197255c8e2b5e90f5.gpx",
  "_geoloc": {
    "lat": 50.4312077349,
    "lng": -3.6820801359
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Rivers_Hems_and_Dart_-_geograph.org.uk_-_585703.jpg",
      "title": "Barry Deakin [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Rivers Hems and Dart. The confluence of the river Dart and its small tributary, the Hems, at low tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/River_Dart_%2828878370535%29.jpg/512px-River_Dart_%2828878370535%29.jpg",
      "title": "By Tim Green from Bradford (River Dart) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "River Dart view in the summer of 2016."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/St_Marys_Church_Totnes.jpg/512px-St_Marys_Church_Totnes.jpg",
      "title": "By User:Wigulf (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html), CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/) or CC BY 2.5 (http://creativecommons.org/licenses/by/2.5)], via Wikimedia Commons",
      "caption": "St Marys Church Totnes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/The_River_Dart_at_Totnes.jpg/512px-The_River_Dart_at_Totnes.jpg",
      "title": "By own Herby talk thyme (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html), CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/) or CC BY 2.5 (http://creativecommons.org/licenses/by/2.5)], via Wikimedia Commons",
      "caption": "Shows the River Dart at Totnes looking upstream to the bridges"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Dart_valley_below_Totnes_-_geograph.org.uk_-_454280.jpg",
      "title": "Derek Harper [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dart valley below Totnes. A view from Sharpham Drive of the fields and valleys on the left bank of the river. The green area beside the treelined riverside path is Longmarsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/The_Dart_at_Totnes_-_geograph.org.uk_-_703768.jpg",
      "title": "Gordon Brown [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Dart at Totnes. Looking downstream in Ferbuary 2008. Boats laid up for the winter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Disused_Riflerange_-_geograph.org.uk_-_947838.jpg",
      "title": "jeff collins [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Disused Riflerange. Used in the second world war as a rifle and machine gun firing range,looking down towards where the targets would have been,now a popular walk by the river Dart."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/The_riverside_at_Totnes_-_geograph.org.uk_-_125675.jpg",
      "title": "Richard Knights [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The riverside at Totnes. Totnes now supports a lot of water based small industrial units beside the river Dart. It was near here that the ill fated catamaran of Team Phillips was built and launched in 2000. The picture is looking up river towards Totnes."
    }
  ],
  "distance_km": 11.5,
  "description": "A circular walk taking you along the River Dart before heading into the countryside surrounding the town of Totnes in Devon. The walk follows the Franklin Totnes Trail and the Dart Valley Trail footpaths before heading along Riverside Walk to visit the Longmarsh Nature Area on the eastern side of the water. The walk starts on the river in Totnes, near to the tourist information centre. Follow the riverside trail north before heading west into the countryside on Copland Lane. The path takes you towards Follaton House where there is an arboretum with a series of trails to try. After exploring Follaton Arboretum the walk heads along Jackman's Lane to Tristford Cross. This section climbs to nearly 500 feet with nice views across the attractive countryside. You then turn north east along Harper's Hill before heading south and east to rejoin the river. The trail returns to the start point before crossing the bridge for a delightful stroll along Riverside Walk. The path leads you to Longmarsh Nature Area where there's lots of wildlife to look out for on the water. It's easy to continue your waterside exercise in the Totnes area. You can pick up the Dart Valley Trail and follow it south all the way to Dartmouth. Just to the north you will find the wonderful Dartington Estate. Here you'll find miles of trails taking you along the river and through attractive woodland.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The delighful village of Stoke Gabriel is located just a few miles south east of the town. You can follow country lanes to the village where you'll find a pretty mill pond, a noteworthy old church and a splendid quay. It's a popular spot for tourists and well worth seeing if you are visiting the area. Just a few miles to the east there's Berry Pomeroy Castle to visit. Here you'll find the ruins of a 15th century castle surrounded by pleasant woodland trails. The site is run by English Heritage so there's good facilities with a car park, gift shop and cafe. The John Musgrave Heritage Trail can be picked up in this area too. The waymarked trail runs from Maidencombe to Brixham, visiting several of South Devon's interesting historical sites on the way. Continue south along the Dart Valley Trail and you will soon come to the delightful little hamlet of Tuckenhay. The settlement is very pretty with a picturesque old mill and waterside trails along the Bow Creek, one of the River Dart tributaries. There's also a splendid 18th century waterside pub which featured in The Times ‘Best 50 Places to Eat Al Fresco’. On the way you will pass the Sharpham Estate, a Grade I listed Palladian villa with parkland, gardens and woodland. The estate is now run as a mindfulness retreat but is open to the public on certain days. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/DNuJDlKt7Ec",
  "postcode": "TQ9 5DE",
  "district": "South Hams",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Coronation Road, The Mount, Totnes, South Hams, Devon, England, TQ9 5DE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "countryside",
    "woodland"
  ],
  "points_of_interest": [
    "nature area",
    "arboretum",
    "views"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}