{
  "created_at": "2025-01-06T02:18:12.629568+00:00",
  "objectID": "af58e373850c70eac32a3a62a4053ed3",
  "ref": "hardraw-force-walk-walking-route",
  "title": "Hardraw Force Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Hardraw_Force_%286246%29.jpg/512px-Hardraw_Force_%286246%29.jpg",
  "nearby": [
    {
      "description": "Cotter Force",
      "objectID": "a3e7cd87d0987eb86631377f96a8da6b",
      "ref": "cotter-force-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Great Shunner Fell",
      "objectID": "66312ea1778e74ee242c2b39ff222088",
      "ref": "great-shunner-fell-walking-route"
    },
    {
      "description": "Herriot Way",
      "objectID": "dce3bdc01a32dac13c530394bb91eeec",
      "ref": "herriot-way-walking-route"
    },
    {
      "description": "Uldale Force",
      "objectID": "801ff138eac4c1fdb04cb2ed32d254ca",
      "ref": "uldale-force-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/af58e373850c70eac32a3a62a4053ed3.gpx",
  "_geoloc": {
    "lat": 54.3167331999,
    "lng": -2.2051125144
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Hardraw_Force_%286246%29.jpg/512px-Hardraw_Force_%286246%29.jpg",
      "title": "Nilfanion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Hardraw Force view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Hardraw_Force_-_geograph.org.uk_-_1082550.jpg",
      "title": "John Darch / Hardraw Force, via Wikimedia Commons",
      "caption": "Hardraw Force. Looking down from the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/The_bridge_at_Hardraw_-_geograph.org.uk_-_857175.jpg",
      "title": "Row17 / The bridge at Hardraw",
      "caption": "The bridge at Hardraw"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Hardraw_Beck_-_geograph.org.uk_-_1606189.jpg",
      "title": "Alexander P Kapp / Hardraw Beck",
      "caption": "Hardraw Beck. Looking downstream from the bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Hardraw_Beck_-_geograph.org.uk_-_1357893.jpg",
      "title": "Ian Greig / Hardraw Beck",
      "caption": "Lovely summer view of the Beck in the hamlet"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/The_Church_of_St_Mary_and_St_John%2C_Hardraw_-_geograph.org.uk_-_1606185.jpg",
      "title": "Alexander P Kapp / The Church of St Mary and St John, Hardraw",
      "caption": "The Grade II listed Church of St Mary and St John, Hardraw"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Hardraw_telephone_box_%28opposite_Green_Dragon_pub%29_-_geograph.org.uk_-_831958.jpg",
      "title": "Nicholas Mutton / Hardraw telephone box (opposite Green Dragon pub)",
      "caption": "Hardraw telephone box (opposite Green Dragon pub)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Shaw_Gill_Woods_-_geograph.org.uk_-_198005.jpg",
      "title": "Stephen Craven / Shaw Gill Woods",
      "caption": "Shaw Gill Woods. If you walk on a little further past the falls you come into Shaw Gill which is a peaceful woodland with this old bridge over the water."
    }
  ],
  "distance_km": 1.0,
  "description": "This walk takes you to the beautiful Hardraw Force waterfall in the Yorkshire Dales. Access to the waterfall is through the 13th century Green Dragon Inn for a small fee. It's worth the fee as the waterfall is England's highest single drop waterfall, falling some 100ft. A footpath takes you through ancient woodland and along the Hardraw Beck to the falls. The falls are in a lovely spot set in the spectacular narrow gorge of Hardraw Scaur. The area includes a new Heritage Centre with information about the falls and facilities such as toilets, showers and a cafe. There's plenty of good options for continuing your walking in the area. You could head to the nearby Cotter Force waterfall where you'll find another good footpath leading to these pretty falls. The Pennine Way also runs past Hardraw so you could pick this up too. The 10 mile Hawes Circular Walk takes you on a tour of the rivers, becks, waterfalls and hills surrounding the town. It visits Hadraw Force so you could pick up the trail to continue your walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Green Dragon Inn is the gateway to the falls. The pub has an interesting history dating right back to the 13th century. Hardraw is old English for Shepherds dwelling, and the land once formed part of land owned by the Cistercian Monks, who settled here before moving to Jervaulx Abbey in lower Wensleydale. They kept a Grange at Hardraw and possibly a small chantry chapel. Parts of the bar are thought to date back to the 14th century.The pub has a good selection of beers and a good menu if you wish to dine.  Pictured above, the exterior and interior of the Green Dragon. The lovely old unspoilt and unaltered interior has a wealth of period features including a cosy real fire. There's also a few tables outside if the weather is decent."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs under control are welcome at the falls and in the Green Dragon Inn. You'll probably see quite a few other owners in the pub and on the path."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "After visiting the falls enjoy a stroll around the little hamlet of Hardraw. Here you can see the Grade II listed Hardraw Church. Dedicated in honour of St Mary and St John, it was rebuilt by the Earl of Wharncliffe between 1879 and 1881. It doubles as Darrowby Church in the British television series All Creatures Great and Small. The Herriot Way long distance trail actually passes through the hamlet so you could pick this up to continue your exercise. The circular route takes you through areas of the Yorkshire Dales associated with the vet and author James Herriot, on which the aforementioned series was based. The circular Garsdale Walk starts from the nearby Garsdale train station on the Settle and Carlisle Line. It's a beautiful place with trails along the Grisedale Beck and more pretty waterfalls to see. The area lies just a few miles to the north west of Hawes. Near here there's also the noteworthy Uldale Force. This impressive waterfall is located in a striking limestone gorge on the River Rawthey. There's also a series of smaller waterfalls so the area is well worth a visit especially after rainfall."
    }
  ],
  "video_url": "https://www.youtube.com/embed/um5PBYrc1Pc",
  "postcode": "DL8 3LZ",
  "district": "Hardraw",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}