{
  "created_at": "2025-01-06T03:17:10.066534+00:00",
  "objectID": "af64d718570408a65dd464a55952054a",
  "ref": "linton-park-walking-route",
  "title": "Linton Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Trucks_on_Linton_Hill_-_geograph.org.uk_-_2049397.jpg",
  "nearby": [
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Marden",
      "objectID": "ac9f0802b6dc81c42ea2b0d2ca6c97f8",
      "ref": "marden-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/af64d718570408a65dd464a55952054a.gpx",
  "_geoloc": {
    "lat": 51.2236682971,
    "lng": 0.5118889945
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Trucks_on_Linton_Hill_-_geograph.org.uk_-_2049397.jpg",
      "title": "Trucks on Linton Hill by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Trucks on Linton Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/The_Bull_Inn%2C_Linton_-_geograph.org.uk_-_1157672.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Bull Inn, Linton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Looking_South_to_Linton_Hall_-_geograph.org.uk_-_1157664.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking South to Linton Hall. This 18th century mansion was built on the site of the old Linton Place occupied by the Mayney family of Linton and Biddenden since the 16th century. It commands a magnificent view across the Weald to the south and was described as being \"like the Citadel of Kent - the whole County its garden\". The Mayneys, whose effigies and memorials are in St Nicholas' church, were generous benefactors - they endowed the five neat almshouses near the church and the John Mayne School now in Biddenden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Linton_Place_and_its_history_-_geograph.org.uk_-_893507.jpg",
      "title": "D Gore / Linton Place and its history",
      "caption": "The Mayney family fortunes were severely depleted by the Civil War when Sir John Mayney (1620-76) of Linton Place staked the family wealth and his life in support of King Charles I. He soon found his estate and home at Linton Place plundered by the Roundheads. An experienced soldier, he led a brigade at the battle of Marston Moor and fought in the campaigns in Wales and the West Country 1642-46. In 1648 he commanded the Royalists in their gallant defence of Maidstone when heavily outnumbered. He was shot in the thigh near Pontefract 948789, cut from mouth to ear at Daventry, and left for dead at Maidstone: yet he survived. But, after the restoration of the monarchy, his loyalty was left unrewarded and he died in poverty, his family dispossessed of their properties."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Boughton_Monchelsea_Place%2C_Main_Frontage.jpg/512px-Boughton_Monchelsea_Place%2C_Main_Frontage.jpg",
      "title": "Jo Turner / Boughton Monchelsea Place",
      "caption": "Boughton Monchelsea Place, Main Frontage"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Orchard_at_Loddington_Farm_-_geograph.org.uk_-_772725.jpg",
      "title": "Elliott Simpson / Orchard at Loddington Farm",
      "caption": "Orchard at Loddington Farm. The white on the trees is both blossom and snow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/View_from_the_Linton_Park_escarpment_south_across_the_Weald_-_geograph.org.uk_-_893635.jpg",
      "title": "D Gore / View from the Linton Park escarpment south across the Weald",
      "caption": "View from the Linton Park escarpment south across the Weald"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/A_family%27s_effigies_in_Linton_church_and_their_history_-_geograph.org.uk_-_901389.jpg/256px-A_family%27s_effigies_in_Linton_church_and_their_history_-_geograph.org.uk_-_901389.jpg",
      "title": "D Gore / A family’s effigies in Linton church and their history",
      "caption": "A family's effigies in Linton church and their history. This couple have been kneeling here in prayer for nearly four centuries. They are the grandparents of Sir John Mayney of Linton Place. His loyal and generous support for his King during the Civil War led to the descent of his once famous Kentish family into poverty and obscurity. As a result, no memorial to Sir John exists, but only to those of earlier generations of his family, here at Linton, and in the parish churches of Biddenden and Staplehurst. This fine alabaster monument suffered some damage during the Civil War when Roundhead swords cut off the fingers and hands of the effigies - this was in the course of Parliament's desecration of St Nicholas' church and their plundering of Sir John's home at Linton Place. Fortunately this ancient monument has recently been saved from complete disintegration, the effect of the passage of the centuries, by major conservation work subscribed to by the people of Linton. Thus this devout couple are set to kneel out another century or two."
    }
  ],
  "distance_km": 5.0,
  "description": "Explore the stunning 19th-century landscape park surrounding this 18th-century country house in Linton, Kent. The house sits in 330 acres of parkland, woodland and farmland on a south facing greensand slope overlooking the valley of the River Beult. The estate is private property and is not open to the public, but the Greensand Way long distance walk crosses the parkland east-west to the north of the house and a public footpath crosses the southern parkland close to the lake on a similar alignment. The walk route below takes you along these paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village you can enjoy some post walk refreshment at the Bull. The historic pub dates back to 1674 and includes a splendid decking area with views over the countryside. They serve good quality food and can be found at Linton Hill, ME17 4AW."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Bull mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east along the Greensand Way and it will take you to the delightful village of Sutton Valence. Here you can also visit the ruins of the 12th century Sutton Valence Castle for some more local history. You can then climb up to the castle and enjoy wonderful views over East Sussex and the Weald of Kent."
    }
  ],
  "postcode": "ME17 4AW",
  "district": "Maidstone",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Linton Hill, Linton, Maidstone, Kent, England, ME17 4AW, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "farmland",
    "greensand"
  ],
  "points_of_interest": [
    "pathway",
    "valley"
  ],
  "facilities": [
    "public footpath"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}