{
  "created_at": "2025-01-06T00:34:27.946610+00:00",
  "objectID": "af6db7140df05d5e84b785fb63202b0d",
  "ref": "lea-valley-walk-walking-route",
  "title": "Lea Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/18/Stanstead_Lock.JPG",
  "nearby": [
    {
      "description": "Walthamstow Reservoirs",
      "objectID": "cc1d4fafac5ce4856d116ea165833604",
      "ref": "walthamstow-reservoirs-walking-and-cycle-route"
    },
    {
      "description": "Pymmes Brook Trail",
      "objectID": "8aaaa3816e9e2b329c3b5a53049d1e2a",
      "ref": "pymmes-brook-trail-walking-route"
    },
    {
      "description": "Ayot Greenway",
      "objectID": "b05e7929081172fec8631826db426d91",
      "ref": "ayot-greenway-walking-and-cycle-route"
    },
    {
      "description": "Olympic Park",
      "objectID": "0488cfea1ac5b26d3a4a829c6ad5adc9",
      "ref": "olympic-park-walking-and-cycle-route"
    },
    {
      "description": "Bishop's Stortford Canal and River Walk",
      "objectID": "20d1483a5e0e0dfeec08430dbe9ccab7",
      "ref": "bishops-stortford-canal-and-river-walk-walking-route"
    },
    {
      "description": "Hertford to Ware River and Canal Walk",
      "objectID": "eefdb4886215605bffc8f1d7b966a26a",
      "ref": "hertford-to-ware-river-and-canal-walk-walking-route"
    },
    {
      "description": "New River Path",
      "objectID": "6588b9959201d98e256c3f9b7ba0c66a",
      "ref": "new-river-path-walking-route"
    },
    {
      "description": "Regent's Canal",
      "objectID": "665ac8f0633d7dc72cfc564303ad322b",
      "ref": "regents-canal-walking-and-cycle-route"
    },
    {
      "description": "Regent's Park",
      "objectID": "9cce20d45cd68785674da3aa419c117b",
      "ref": "regents-park-walking-route"
    },
    {
      "description": "Stort Valley Way",
      "objectID": "7c463aaabbb555a51b71ce119468360f",
      "ref": "stort-valley-way-walking-route"
    },
    {
      "description": "Harlow",
      "objectID": "dee89ae4d56d7d95d3f3a689d0fe6a36",
      "ref": "harlow-walking-route"
    },
    {
      "description": "Amwell Nature Reserve",
      "objectID": "275d467145b196b8613ea566ebb8aab9",
      "ref": "amwell-nature-reserve-walking-route"
    },
    {
      "description": "Green Link Walk",
      "objectID": "0307081f862569a84e2737a278adc771",
      "ref": "green-link-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/af6db7140df05d5e84b785fb63202b0d.gpx",
  "_geoloc": {
    "lat": 51.9071791039,
    "lng": -0.4584443446
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Stanstead_Lock.JPG",
      "title": "Nigel Cox [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stanstead Lock - near Hertford and Ware. Viewed looking northwards from the footbridge, there is an unusual swing bridge over the lock which merits its own mention on the OS 1:25,000 scale mapping."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/New_Gauge_House%2C_River_Lea%2C_between_Hertford_and_Ware_-_geograph.org.uk_-_346174.jpg",
      "title": "Julian Osley / New Gauge House, River Lea, between Hertford and Ware, via Wikimedia Commons",
      "caption": "New Gauge House, River Lea, between Hertford and Ware. Built by William Chadwell Mylne in 1856. The New Gauge House was intended to restrict the amount of water flowing from the River Lea into the New River."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/River_Lea_Navigation_-_geograph.org.uk_-_161097.jpg",
      "title": "Chris Hunt / River Lea Navigation, via Wikimedia Commons",
      "caption": "River Lea Navigation. Part of the Lea Valley Park. The River has been straightened in this section to allow barge traffic"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Lea_Valley_Navigation%2C_South_of_White_Post_Lane_bridge_-_geograph.org.uk_-_1128493.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Lea Valley Navigation, South of White Post Lane bridge Note the Olympic park construction to the left of the photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Lea_Valley_Footpath_-_geograph.org.uk_-_1380017.jpg",
      "title": "Gary Fellows / Lea Valley Footpath",
      "caption": "The footpath near Harpenden in Hertfordshire. Looking westwards along the Upper Lea Valley part of the public footpath, which carries on through the town towards Luton (from Thames in London)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Flats_by_the_River_Lea%2C_Tottenham_Hale_-_geograph.org.uk_-_138309.jpg",
      "title": "David Hawgood / Flats by the River Lea, Tottenham Hale",
      "caption": "Flats by the River Lea, Tottenham Hale. The flats are on an island between branches of the River Lea, south of Ferry Lane. View south with Lea Valley walk on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/River_Lee_valley_near_Wheathampstead_-_geograph.org.uk_-_75846.jpg",
      "title": "Nigel Cox / River Lee valley near Wheathampstead",
      "caption": "River Lee valley near Wheathampstead. Viewed looking eastwards and downstream — the fence line marks the very distinctive change between the flat valley bottom and the sloping valley sides. The River Lea runs in the trees to the right, and the trail keeps just on the left of the wire fence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Lee_Valley_Country_Park_-_geograph.org.uk_-_1324663.jpg",
      "title": "Claire Stretch / Lee Valley Country Park",
      "caption": "Lee Valley Country Park Raised walk way over marsh land in Lee Valley Country Park, by Cheshunt Lock on the River Lea."
    }
  ],
  "distance_km": 85.0,
  "description": "A super walk with a series of delightful waterside sections along the River Lea. The walk runs from Leagrave, the source of the River Lea near Luton, to the Thames at Limehouse Basin, east London. You follow a riverside path for much of the way through, Luton, Hatfield, Hertford, Ware and Cheshunt with a swan emblem clearly waymarking the walk. The walk passes Nature Reserves, pretty riverside villages and includes a section through the fantastic Lee Valley Park - London's largest open space. You'll also pass the Olympic Park in Stratford which is well worth exploring. The final section of the walk runs along the Limehouse Cut Canal which is also suitable for cyclists. In the Lee Valley park you can also pick up the Stort Navigation and follow the towpath to Bishop's Stortford. The river also runs parallel to the New River Path around Hertford and Ware so it's possible to create a circular walk using both the footpaths in this area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's plenty of nice waterside pubs on the route where you can stop off for refreshments. The Anchor & Hope is located right on the banks of the River Lea in Clapton. There's some nice outdoor seating here with views of the river to enjoy. You can find the pub at 15 High Hill Ferry, Clapton with a postcode of E5 9HG for your sat navs. The Fish and Eels is a popular riverside inn in Hoddesdon. The pub dates back to the 1800s and includes picturesque gardens with views of the weir. You can find the pub on Dobbs Weir Road with a postcode of EN11 0AY. Near here there's also the Rye Meads RSPB Nature Reserve to explore. At the wildlife rich Tottenham Marshes there's the Stonebridge Lock Waterside Cafe. It's located in a lovely spot next to the canal and serves a good range of drinks, cakes and sandwiches. You can sit outside and enjoy a nice view of the water with your meal. Built in 1538 the historic Red Lion pub is one of the oldest buildings in the area and the second oldest in Stanstead Abbotts. It started life as a monastery, then a coaching inn and was renovated in 2005 to help reinstate the character of the pub. They serve good quality food and gave a garden area. You can find them on the High Street at postcode SG12 8AA. The pub is dog friendly."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river paths make for a nice dog walk and the Anchor & Hope and The Fish and Eels mentioned above are also dog friendly. In the Lee Country Park area there's a 500m agility course of jumps, hoops, high walks and an A-frame."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the end of the walk at Limehouse Basin you can pick up the Regent's Canal and follow it to north west through London to the splendid Regent's Park. At Roydon, just west of Harlow the trail links with the Stort Valley Way. Another waymarked riverside walk, this one follows the River Stort through the Essex and Hertfordshire countryside. Near Ware and Stanstead Abbotts you'll pass pass the Amwell Nature Reserve. The reserve is a great place for wildlife with lots of wintering wildfowl to look out for on the two pretty lakes. It can be found at postcode SG12 8ED and is well worth taking a small detour to explore, particularly if you are keen on wildlife. The Green Link Walk links with the route near Walthamstow. This waymarked trail takes you from the edge of Epping Forest to Peckham, passing a number of London's pleasant Green spaces on the way."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7x2wOrQU3wc",
  "postcode": "LU3 2AN",
  "district": null,
  "county": "Luton",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bramingham Road, Marsh Farm, Luton, England, LU3 2AN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "canal",
    "park"
  ],
  "points_of_interest": [
    "nature reserves",
    "villages",
    "open space",
    "Olympic Park"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}