{
  "created_at": "2025-01-06T03:34:20.030422+00:00",
  "objectID": "af8455745f601d7222be0667bbd051b1",
  "ref": "cromer-to-mundesley-walk-walking-route",
  "title": "Cromer to Mundesley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/69/Cromer_Pier_-_geograph.org.uk_-_1491977.jpg",
  "nearby": [
    {
      "description": "Paston Way",
      "objectID": "82ae62dc23f6c8a73bda9a588d8812da",
      "ref": "paston-way-walking-route"
    },
    {
      "description": "Mundesley",
      "objectID": "cb9c3854b947a1d494fb4105ff8ce0ca",
      "ref": "mundesley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/af8455745f601d7222be0667bbd051b1.gpx",
  "_geoloc": {
    "lat": 52.9322311816,
    "lng": 1.3006796318
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Cromer_Pier_-_geograph.org.uk_-_1491977.jpg",
      "title": "Martin Thirkettle / Cromer Pier, via Wikimedia Commons",
      "caption": "Cromer Pier"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Groynes_on_the_beach_at_Overstrand_-_geograph.org.uk_-_1018340.jpg",
      "title": "Jay Haywood / Groynes on the beach at Overstrand, via Wikimedia Commons",
      "caption": "Groynes on the beach at Overstrand"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/The_sea_front%2C_Overstrand_-_geograph.org.uk_-_1061340.jpg",
      "title": "Humphrey Bolton / The sea front, Overstrand, via Wikimedia Commons",
      "caption": "The sea front, Overstrand. What was once a road looping round above the coastal slope is now a footpath, thus removing disruptive through traffic. The car park is in the distance, with an icecream van in attendance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Trimingham_Beach_-_geograph.org.uk_-_890271.jpg",
      "title": "Kathryn Speight / Trimingham Beach, via Wikimedia Commons",
      "caption": "Trimingham Beach. Taken from the top of the steep road down to the beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Chalk_rafts_in_cliffs_at_Sidestrand_-_geograph.org.uk_-_80097.jpg",
      "title": "Keith Duff / Chalk rafts in cliffs at Sidestrand, via Wikimedia Commons",
      "caption": "Chalk rafts in cliffs at Sidestrand"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Eroding_cliffs_and_sea_defences%2C_Sidestrand_-_geograph.org.uk_-_410672.jpg",
      "title": "Helen Hanley / Eroding cliffs and sea defences, Sidestrand, via Wikimedia Commons",
      "caption": "Eroding cliffs and sea defences, Sidestrand. It will not be many years before the remaining tiny bit of land in this square will be gone altogether. The sea defences shown are less than 25 years old, but a change in management strategy will mean that they are not repaired or replaced. In the 1970s this area was still part of Sidestrand Hall School's football pitch, although even then the fence needed to be moved back on a regular basis. Soft glacial till and many springs on the cliff face make for a very unstable, dynamic yet somehow beautiful and exciting environment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Beach_below_Mundesley_-_geograph.org.uk_-_968155.jpg",
      "title": "Evelyn Simak / Beach below Mundesley, via Wikimedia Commons",
      "caption": "Beach below Mundesley. The building seen beyond the fishing boat hitched to a beach tractor is the Lifeboat Station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/The_village_of_Mundesley_-_geograph.org.uk_-_968098.jpg",
      "title": "Evelyn Simak / The village of Mundesley, via Wikimedia Commons",
      "caption": "The village of Mundesley. This view was taken in northwesterly direction, diagonally across the grid square. The red-brick building seen in mid-distance (at right) is the Manor Hotel. In the background (centre) the church of All Saints can be seen. The building glimpsed on the horizon (at left, in adjacent grid square), located high above the village, is Trafalgar Court. When the railway opened in 1889 - bringing visitors wishing to sample the fresh sea air - the village of Mundesley grew rapidly. The railway is now long gone but Mundesley is still considered to be one of the best a holiday resorts in Norfolk, offering a sandy beach with safe swimming for children when the tide is out; the East Norfolk Coast Path/Peddars Way follows the coastline and offers splendid views across the North Sea. Properties date mainly from Victorian times and many houses are constructed from traditional Norfolk materials such as flint and brick, with thatch or pantile roofs"
    }
  ],
  "distance_km": 11.5,
  "description": "Enjoy a lovely coastal walk from Cromer to Mundesley on this route in Norfolk. The route runs on or close to the beach for a distance of about 7 miles with cliff tops, woodland, pretty villages and nice sea views along the way. The walk starts from Cromer Pier and follows the coast path up to Cromer Lighthouse. The present lighthouse was built half of a mile from the cliff edge (although it is now much closer) and came into operation in 1833. The trail then passes Royal Cromer Golf Course before descending into the village of Overstrand. The trail continues from Overstrand by heading inland past the Overstrand Disused Railway wildlife site, and along a quiet road before heading back towards the sea. You'll then pass along the cliffs at Sidestrand and Trimingham before coming to Marl Point and Cliftonville. Shortly after you come into Mundesley where the route finishes. The village has some nice beaches and a good selection of pubs. You could extend the walk by following the coast path to nearby Bacton. The Paston Way long distance trail also runs alongside the coastal route. The waymarked trail makes for an alternative inland path or you could use it to create a longer circular walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Horse in Overstrand is a nice place to stop for refreshments. There's a good menu and a nice large garden to relax in when the weather is fine. You can find it on the High Street with a postcode of NR27 0AB."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could follow the Paston Way from Mundesley to the North Walsham and Dilham Canal and the Pretty Pigney's Wood Nature Reserve. They're located a few miles south of the village and offer more good walking opportunites. From Mundesley you could pick up the Paston Way and follow it south west to visit Gunton Park. There's a huge deer park and a 19th century working sawmill to see here. The picturesque thatched mill is notable as the only surviving water powered sawmill in Norfolk. The walk also includes a visit to the excellent Gunton Arms pub where there are fine views over the estate. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "district": "North Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hotel de Paris, High Street, Cromer, North Norfolk, Norfolk, England, NR27 9HG, United Kingdom",
  "postcode": "NR27 9HG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland",
    "cliff tops"
  ],
  "points_of_interest": [
    "historical sites",
    "sea views",
    "villages"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}