{
  "created_at": "2025-01-06T08:18:31.929979+00:00",
  "objectID": "af9fd1a1ebe59df132f56ac8d709406a",
  "ref": "bridgwater-walking-route",
  "title": "Bridgwater Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Bridgwater_Docks_-_geograph.org.uk_-_925650.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/af9fd1a1ebe59df132f56ac8d709406a.gpx",
  "_geoloc": {
    "lat": 51.1332377777,
    "lng": -3.0040966874
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Bridgwater_Docks_-_geograph.org.uk_-_925650.jpg",
      "title": "Ken Grainger / Bridgwater Docks",
      "caption": "Bridgwater Docks Bridgwater Docks, now a marina. The first stage of an abortive project to link the Bristol Channel with the south coast by canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Bridgwater_and_Taunton_Canal_-_geograph.org.uk_-_1006591.jpg",
      "title": "Ken Grainger / Bridgwater and Taunton Canal",
      "caption": "Bridgwater and Taunton Canal. Where it enters the old dock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Bridgwater_cornexchange_staute_and_church.jpg",
      "title": "Ken Grainger, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridgwater corn exchange staute and church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Cornhill%2C_Bridgwater_-_geograph.org.uk_-_1721681.jpg",
      "title": "Derek Harper / Cornhill, Bridgwater",
      "caption": "Cornhill, Bridgwater. The way in which Fore Street funnels out to give this view of St Mary's church and the rotunda of the market hall is worthy of an Italian townscape, though the modest scale of the church supporting the fine spire is very English provincial. The market hall has been described as a \"spectacular shallow-domed circular portico\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Eastquay%2C_Bridgwater_-_geograph.org.uk_-_940142.jpg",
      "title": "Ken Grainger / Eastquay, Bridgwater",
      "caption": "Eastquay. From the west bank of the River Parrett"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Bridgwater_Market_Hall_-_geograph.org.uk_-_1721880.jpg",
      "title": "Derek Harper / Bridgwater Market Hall",
      "caption": "Bridgwater Market Hall. One of Somerset's most charming buildings. It has Ionic columns, and is surmounted by a domed drum with a hexagonal lantern and finial . It's now occupied by Prezzo, but the market hall behind it remains in use as such. Pevsner (1958) says \"the whole seems just right in scale and modest formality for a country town of some pride and traditions\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Town_bridge%2C_Bridgwater_-_geograph.org.uk_-_1721572.jpg/256px-Town_bridge%2C_Bridgwater_-_geograph.org.uk_-_1721572.jpg",
      "title": "Derek Harper / Town bridge, Bridgwater",
      "caption": "Town bridge. The one that gives the town its name. But this is the third on the site; a stone bridge was replaced by a cast-iron one in 1797; this structure dates from 1883"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/East_Quay%2C_Bridgwater_-_geograph.org.uk_-_1721608.jpg",
      "title": "Derek Harper / East Quay, Bridgwater",
      "caption": "East Quay seen from West Quay. Each of the buildings is listed, though Pevsner feels that only no 4, the white Georgian house with blue window surrounds, is worthy of note, and it is earlier (C18) than the others. Number 2, however, is remarkable for its parapet with volutes"
    }
  ],
  "distance_km": 6.0,
  "description": "This large Somerset market town has some nice waterside walking trails to try. There's also some fine architecture with a number of Georgian houses and the attractive Market Hall. This circular waterside walk takes you along the Bridgwater and Taunton Canal and the River Parret Trail which run through the town. The walk starts in the town centre at the Bridgwater Docks Marina in the town centre. Here you can pick up the canal towpath and follow it south. The route then crosses to the river where you can pick up another waterside trail and follow it back into the town. To extend the walk you could follow the waymarked River Parrett trail north to meet with the river at Combwich. The route then continues to the Bridgwater Bay National Nature Reserve .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Somerset Space Walk runs along the towpath of the Bridgwater canal. The route is lined with a number of interesting sculptures representing the planets of the Solar System. You can see the scale model of the sun at Maunsel Lock and the description panels next to the sculptures to find out more.The North Petherton Walk skirts the edge of the town. The circular route explores the area surrounding the small town which is located just to the south on the edge of the Quantocks . For more walking ideas in the area see the Somerset Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xg_ZWjVbv3Q",
  "district": "Bridgwater",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bridgwater Marina, Northgate, Bridgwater, Somerset, England, TA6 3JY, United Kingdom",
  "postcode": "TA6 3JY",
  "state": "England"
}