{
  "created_at": "2025-01-06T03:36:52.096736+00:00",
  "objectID": "afd7104fe0739593fc108cb4a07b1d2e",
  "ref": "botley-hill-walking-route",
  "title": "Botley Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Botley_Hill_trig_point_-_geograph.org.uk_-_788400.jpg/256px-Botley_Hill_trig_point_-_geograph.org.uk_-_788400.jpg",
  "nearby": [
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Vanguard Way",
      "objectID": "d526829c942476c5ae331b2b89b7b812",
      "ref": "vanguard-way-walking-route"
    },
    {
      "description": "Woldingham",
      "objectID": "a62199957c1cbd4a80df4eb44efbbd49",
      "ref": "woldingham-walking-route"
    },
    {
      "description": "Oxted Circular Walk",
      "objectID": "5937c30dd123b668bfb121ef07a898ae",
      "ref": "oxted-circular-walk-walking-route"
    },
    {
      "description": "Betsoms Hill",
      "objectID": "399b7dbdb563ee8faaa837686248e189",
      "ref": "betsoms-hill-walking-route"
    },
    {
      "description": "Warlingham",
      "objectID": "3fe5c5ce736da7bab331930f37fd0aac",
      "ref": "warlingham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/a/afd7104fe0739593fc108cb4a07b1d2e.gpx",
  "_geoloc": {
    "lat": 51.2814433748,
    "lng": 0.004151054
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Botley_Hill_trig_point_-_geograph.org.uk_-_788400.jpg/256px-Botley_Hill_trig_point_-_geograph.org.uk_-_788400.jpg",
      "title": "Ian Capper / Botley Hill trig point, via Wikimedia Commons",
      "caption": "Botley Hill trig point. The highest trig point on the North Downs (benchmark at 266.88m), and until recently most references claimed that this also marked the highest point of the whole of the North Downs. However, in practice, this is not the case. Firstly the land seems to rise slightly to the east, and there is another area slightly to the west which also lies above the 265m contour, with the same 267m spot height (although older maps give the latter point a slightly lower height than the trig point when measured in feet). But more significantly, old 1 inch maps show a spot height of 882 feet next to the water tower in the next square over (see Water tower photo), compared with only 877 feet at the trig point, implying that the true summit point of the North Downs could well be there. This has since been confirmed by surveys. Unfortunately, views to the south at this point are blocked by the woodland of Titsey Plantation, and the nature of the plateau means that the expected view north over London is not available. Behind is one of a number of masts near Botley Hill, this one beside Botley Hill Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Botley_Hill_Farmhouse_Public_House_-_geograph.org.uk_-_47512.jpg",
      "title": "Richard Mascall / Botley Hill Farmhouse Public House, via Wikimedia Commons",
      "caption": "Botley Hill Farmhouse Public House. A tea-room back in the 80s, but now a pub offering a range of entertainments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Botley_Hill_mast_-_geograph.org.uk_-_788403.jpg",
      "title": "Ian Capper / Botley Hill mast, via Wikimedia Commons",
      "caption": "Botley Hill mast"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Woldingham_water_tower_-_geograph.org.uk_-_788446.jpg",
      "title": "Ian Capper / Woldingham water tower",
      "caption": "Woldingham water tower on the hill. Above the door is written ESW Co 1931 - the East Surrey Water Company now forms part of the larger Sutton and East Surrey Water Company. Old 1 inch maps point to this being the highest point on the North Downs, at (pre metric!) 882 feet (as opposed to the trig point in the next square to the east which until recently was normally claimed as the highest point - see first photo for discussion), so presumably there is no problem with water pressure in Woldingham!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Radio_masts_and_reservoir_-_geograph.org.uk_-_19901.jpg",
      "title": "Nigel Freeman / Radio masts and reservoir",
      "caption": "Radio masts and reservoir. A familiar site when driving south out of Warlingham down towards Oxted. The ridge of the North Downs has numerous radio masts, dating back to WWII."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/The_Meridian_Line_Plaque_at_a_point_where_the_North_Downs_Way_crosses_it._-_geograph.org.uk_-_1053800.jpg",
      "title": "Colin Park / The Meridian Line Plaque at a point where the North Downs Way crosses it.",
      "caption": "The Meridian Line Plaque at a point where the North Downs Way crosses it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/The_Ridge_-_geograph.org.uk_-_788463.jpg",
      "title": "Ian Capper / The Ridge",
      "caption": "The Ridge. This lane runs along the route of a trackway following the crest of the North Downs - this stretch on Botley Hill is the highest road on the North Downs. To the right is Titsey Plantation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Cottages%2C_Chalkpit_Lane%2C_Oxted_-_geograph.org.uk_-_877022.jpg",
      "title": "Ian Capper / Cottages, Chalkpit Lane, Oxted",
      "caption": "Cottages, Chalkpit Lane, Oxted. Former quarryworkers cottages for the nearby Oxted Quarry."
    }
  ],
  "distance_km": 5.7,
  "description": "This circular walk explores the area around Botley Hill, the highest point in the North Downs. It's an interesting area with fine views, woodland areas and a historic farmhouse pub for post walk refreshment. The walk starts from the public car park on the hill though you could also start from the Botley Hill Farmhouse just around the corner. From near here you can pick up the North Downs Way and follow it south west through the woodland of the Titsey Plantation. At the Beech Plantation on Oxted Downs you can pick up the Vanguard Way and follow it north up to Botley Hill and the Woldingham Water Tower. The route then follows the Woldingham Road (The Ridge) north east back to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Botley Hill Farmhouse is located near the start of the walk. The 16th century farmhouse serves excellent, locally sourced food with some ingredients coming from their own garden. You can sit outside here and enjoy splendid views over the surrounding countryside with your meal. The site also includes the Sheep Shed tea room and a nice little gift shop."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and hill climbs on the route are ideal for fit dogs. The Botley Hill Farmhouse mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the hill you can pick up the circular Woldingham Walk which explores the attractive Marden Park estate. Just to the south you can pick up the Oxted Circular Walk which uses the Greensand Way to visit Limpsfield Common and Limpsfield Chart. There's also a train station which provides an alternative start point to the Botley Hill walk. You could follow the Greensand Way north from the station to the site. To the east is Betsoms Hill, the highest point in the county of Kent. This area also includes Westerham Heights, the highest point of Greater London. For more walking ideas in the area see the North Downs Walks page."
    }
  ],
  "postcode": "CR6 9QH",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Titsey Hill, Botley Hill, Titsey, Tandridge, Surrey, England, CR6 9QH, United Kingdom",
  "district": "Tandridge",
  "state": "England"
}