{
  "created_at": "2025-01-06T00:31:22.585632+00:00",
  "objectID": "908046917efdc700cc21b8f6af5d2844",
  "ref": "isaacs-tea-trail-walking-route",
  "title": "Isaac's Tea Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Isaac%27s_Tea_Trail_sign_-_geograph.org.uk_-_1101392.jpg/256px-Isaac%27s_Tea_Trail_sign_-_geograph.org.uk_-_1101392.jpg",
  "nearby": [
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "South Tyne Trail",
      "objectID": "5175f9ea7b30694bc74925113568a0e9",
      "ref": "south-tyne-trail-walking-and-cycle-route"
    },
    {
      "description": "Allendale",
      "objectID": "eb803feb2a7d6f01d2ae82e5b8254a49",
      "ref": "allendale-walking-route"
    },
    {
      "description": "Nenthead",
      "objectID": "3c923be62bc5c40033ceefa9847363bf",
      "ref": "nenthead-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/908046917efdc700cc21b8f6af5d2844.gpx",
  "_geoloc": {
    "lat": 54.895943248,
    "lng": -2.2579964058
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Isaac%27s_Tea_Trail_sign_-_geograph.org.uk_-_1101392.jpg/256px-Isaac%27s_Tea_Trail_sign_-_geograph.org.uk_-_1101392.jpg",
      "title": "Roger Morris / Isaac's Tea Trail sign",
      "caption": "Marker post with the waymark symbol for the trail. Located where the track to Roughside and the old quarries meets the Dykeheads road into Nenthead. At the Nenthead mining heritage centre you can learn all about the lead and zinc mining history of the North Pennines. There's also mine entrances, dumps, old buildings, reservoirs and some rare plants growing on the metal-rich mine dumps. It's an interesting and scenic area to explore if you have time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Peckriding_Crag%2C_Isaac%27s_Tea_Trail_-_geograph.org.uk_-_1633072.jpg",
      "title": "Roger Morris / Peckriding Crag: Isaac's Tea Trail",
      "caption": "Peckriding Crag: Isaac's Tea Trail. The crag stands above the East Allen River and overlooks the trail along the valley. The foreground was in past times a popular picnic spot"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Isaac%27s_Tea_Trail_near_Clargillhead_-_geograph.org.uk_-_1130114.jpg",
      "title": "Roger Morris / Isaac's Tea Trail near Clargillhead",
      "caption": "Trail view in the winter of 2009, near Clargillhead. This is where Isaac's Tea Trail meets the A686, look out for traffic especially motor bykes, when crossing road towards the Pennine Pottery or in the opposite direction down the Ayle Burn. The road can be very busy at weekends, in good weather. This is a popular route to the Lake District."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/On_Haggs_Bank%2C_Isaac%27s_Tea_Trail_-_geograph.org.uk_-_1603130.jpg",
      "title": "Roger Morris / On Haggs Bank: Isaac's Tea Trail",
      "caption": "On Haggs Bank. This is a view up the Nent Valley towards Greenends above the intersection with Isaac's Tea Trail. The Haggs Bank Stewardship Group oversee this site, where the disturbed ground is characterised by former lead mining and related activities. Records show Nentsberry Haggs Mine was working in 1692."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Isaac%27s_Tea_Trail%2C_crossing_River_South_Tyne_at_Kirkhaugh_-_geograph.org.uk_-_1335697.jpg",
      "title": "Roger Morris / Isaac's Tea Trail: crossing River South Tyne at Kirkhaugh",
      "caption": "Crossing River South Tyne at Kirkhaugh. The footbridge at Kirkhaugh is the only place to cross the River South Tyne upstream of the old ford. This is a historic crossing point used by drovers and during the Roman occupation of this neighbourhood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Fish_ladder_below_Isaac%27s_Tea_Trail_-_geograph.org.uk_-_1723060.jpg/256px-Fish_ladder_below_Isaac%27s_Tea_Trail_-_geograph.org.uk_-_1723060.jpg",
      "title": "Roger Morris / Fish ladder below Isaac's Tea Trail",
      "caption": "Fish ladder below the trail at Allendale. Flood damage to the weir below Allen Mill Bridge has given scope to create a new fish ladder for salmon and sea trout to reach their spawning grounds on the River East Allen. Photo taken in the winter of 2010."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Isaac%27s_Tea_Trail_%2C_on_the_Roughside_-_geograph.org.uk_-_1603122.jpg",
      "title": "Roger Morris / Isaac's Tea Trail : on the Roughside",
      "caption": "On the Roughside. The ruins of the farm of Roughside are a landmark below the broken ground of the site of an old quarry. The trail doubles back for a short distance near Roughside and follows the rough track along the contour down to the road into Nenthead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/John_Wesley%27s_steps_at_Nenthead_-_geograph.org.uk_-_1204988.jpg/256px-John_Wesley%27s_steps_at_Nenthead_-_geograph.org.uk_-_1204988.jpg",
      "title": "Roger Morris / John Wesley's steps at Nenthead",
      "caption": "John Wesley's steps at Nenthead, Cumbria. John Wesley preached from this step, where he converted the grand parents of Isaac Holden, after whom the trail is named."
    }
  ],
  "distance_km": 58.0,
  "description": "Follow in the footsteps of the legendary tea seller Isaac Holden on this challenging circular walk through the North Pennines. The walk starts at the pretty village of Allendale Town, and heads south along the River East Allen and through West Allen Dale to Nenthead, where you will find the interesting Nenthead Mining Centre. Another lovely waterside section along the River Nent then takes you to Alston, before turning north towards Kirkhaugh. One option is to take the fantastic South Tynedale Railway from Alston to Kirkhaugh (video below). The route then heads along the River South Tyne and then up to Ouston Fell before joining the River West Allen for another riverside section. The final leg follows the River East Allen back into Allendale town. The walk is waymarked with a green disc featuring a portrait of Isaac Holden. Around Alston the trail links with the South Tyne Trail. The riverside cycling and walking trail takes you from Tyne Head to Haltwhistle with more great views of the North Pennines. You can also pick up the Pennine Way in the same area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Lovelady Shield Hotel is a great place for an overnight stay on the trail. The renovated Georgian country house hotel features 14 en suite rooms, most offering serene views of the River Nent and the picturesque hills and pastures. There's also 3 acres of beautiful gardens to relax in. You can find them near Alston at Lovelady Lane, CA9 3LX.  In Allendale The Kings Head is a good choice for some refreshments on the route. They have a good menu and an outdoor area with nice views of the town. It's in a good location on the Market Place with a postcode of NE47 9BD for your sat navs. They are also dog friendly if you have your canine friend with you. In Alston the 17th century Angel Inn is another good option. It dates all the way back to 1611 and has a charming interior. You can find the old inn on Front Street with a postcode of CA9 3HU for your sat navs. In Nenthead there's The Hive at Nenthead. The cafe has been converted from an ancient Wesleyan Chapel with a magnificent organ and period features. There's also a fine art gallery, musical performances and a gift shop. The food is varied and of a good quality with mostly locally source ingredients. Hearty scones and cake are available as fuel for walkers and cyclists."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Allendale Walk is located at the start of the route. The circular route uses a section of the trail before heading into the countryside around Catton. The stone built village of Allendale is very pretty and is very pleasant to stroll around. It was twice crowned Village of the Year for All England and includes a notable fish ladder on the river. There's also the circular Alston Walk to try. This uses part of the trail and the Pennine Way to create a circular route around the town. For more walking ideas in the area see the Northumberland Walks and North Pennines Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ISotxHL1u5I",
  "postcode": "NE47 9NE",
  "district": "Allendale",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Peth, Thornley Gate, Allendale, Northumberland, North East, England, NE47 9NE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "railway",
    "views"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}