{
  "created_at": "2025-01-06T03:20:49.736542+00:00",
  "objectID": "910a27bf9b68227c0ad701ff409c32a2",
  "ref": "barrow-in-furness-walking-route",
  "title": "Barrow in Furness Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/68/Furness_Abbey_-_geograph.org.uk_-_42919.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/910a27bf9b68227c0ad701ff409c32a2.gpx",
  "_geoloc": {
    "lat": 54.1348334596,
    "lng": -3.1986962169
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Furness_Abbey_-_geograph.org.uk_-_42919.jpg",
      "title": "David Jackson / Furness Abbey",
      "caption": "Furness Abbey 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Furness_Abbey_-_geograph.org.uk_-_42926.jpg",
      "title": "David Jackson / Furness Abbey",
      "caption": "Furness Abbey 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Cavendish_Dock%2C_Barrow_from_railway_sidings_-_geograph.org.uk_-_34423.jpg",
      "title": "David Jackson / Cavendish Dock, Barrow from railway sidings",
      "caption": "Cavendish Dock, Barrow from railway sidings. View of Cavendish Dock with the disused Barrow Paper Mills in the background. The building with the tall chimney at right of photo is the gas fired Electricity Power Station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/The_Town_Hall_at_Barrow-in-Furness_-_geograph.org.uk_-_1512056.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The centre of Barrow-in-Furness is dominated by its fine red sandstone Town Hall. The building was the result of an architectural competition held in 1877, the winner of which was Belfast architect W. H. Lynn (1829-1915), a specialist in the design of imposing civic buildings in the Victorian Gothic style (other surviving examples of his work are the town halls at Chester and at Paisley, and the Belfast Central Library)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Barrow-in-Furness_-_geograph.org.uk_-_2000.jpg",
      "title": "Rosalind Mitchell / Barrow-in-Furness",
      "caption": "Walney Channel and the Jubilee Bridge, which connects Walney Island to the mainland. The slag banks of the long-defunct ironworks in the middle distance, and in the far distance can be made out the Scafell group of Lakeland mountains."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Pool_near_Sandscale_Haws_-_geograph.org.uk_-_850342.jpg",
      "title": "Espresso Addict / Pool near Sandscale Haws",
      "caption": "Pool near Sandscale Haws Small pool fringed with waterlilies in the wet meadow to the south west of the National Trust carpark."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Duddon_Sands_and_Sandscale_Haws_-_geograph.org.uk_-_849816.jpg",
      "title": "Espresso Addict / Duddon Sands and Sandscale Haws",
      "caption": "Duddon Sands and Sandscale Haws dunes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Track_on_Lowsy_Point_-_geograph.org.uk_-_850007.jpg",
      "title": "Espresso Addict / Track on Lowsy Point",
      "caption": "Track on Lowsy Point Track through the sand dunes of the Sandscale Haws National Nature Reserve at Lowsy Point. The cottages and houseboats on the Scarth Bight side of Lowsy Point are visible in the distance (right)"
    }
  ],
  "distance_km": 18.0,
  "description": "This large Cumbrian town has some good coastal walking opportunites along Morecambe Bay and the Duddon Estuary. It's also very close to the Lake District National Park which is a walkers paradise. In the town you can visit a significant ancient abbey and enjoy a stroll along the docks where the town's ship-building heritage is on show. This walk uses sections of the Cumbria Coastal Way and the Haematite Trail to take you to the Sandscale Haws National Nature Reserve. The walk starts at the historic Furness Abbey on the north eastern fringes of the town. The 12th century abbey was once the second-wealthiest and most powerful Cistercian monastery in the country, behind Fountains Abbey in Yorkshire. The site is now run by English Heritage who premit access for a fee. You can then explore the ruins and the visitor centre where there are a number of stone carvings and effigies to see. After exploring the abbey you can pick up the Haematite Trail and follow it south towards the docks and coast. Here you can pick up the Cumbria Coastal Way at Hindpool and follow the waymarked footpath north to Sandscale Haws. The coastal nature reserve has some nice footpaths with sand dunes, lots of wildlife and views of the Duddon Estuary. After exploring the reserve the route retraces its steps back into Barrow.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Harbour Inn is a good choice for some post walk refreshment in the town. The friendly pub serves good quality food and can be found near the docks. They also have a nice garden area for warmer days. You can find them at 1 The Strand with a postcode of LA14 2HG for your sat navs. There's also the Abbey Mill Coffee Shop next to Furness Abbey. They serve a fine afternoon tea which you can enjoy outside with nice views of the area. You can find them at Abbey Approach with postcode LA13 0PJ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north there's Dalton-in-Furness where you can visit Dalton Castle. The 14th century Pele Tower has strong connections to the abbey and is run by the National Trust. On the western side of the town there's Walney Island to explore. The scenic island includes two more nature reserves and the only grey seal colony in Cumbria. You can also pick up the long distance Cistercian Way here. From the island there are fine views over to Piel Island. The island includes a ruined 14th century castle and a historic pub dating back hundreds of years. You can catch a ferry to the island from nearby Roa Island. If you head north along the Cumbria Coastal Way it will take you to Broughton in Furness. The market town is not far from the southern tip of Coniston Water in the Lake District. To the east you could visit Ulverston and enjoy a waterside walk along the pretty Ulverston Canal. From the canal basin it's a short climb up to the impressive Ulverston Lighthouse or Hoad Monument. There's great views from the top of the hill and the 19th century monument. The distinctive structure commemorates the life and work of Sir John Barrow who was born in Ulverston in 1764. For more walking ideas in the area see the Lake District Walks and the Cumbria Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/EbgQjyYxTw8",
  "district": "Dalton-in-Furness",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Manor Road, Newbarns, Barrow, Dalton-in-Furness, Westmorland and Furness, England, LA13 0PJ, United Kingdom",
  "postcode": "LA13 0PJ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "archaeological sites"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}