{
  "created_at": "2025-01-06T03:57:13.927163+00:00",
  "objectID": "91513f0cf27a6bb0d1660dbdbde1f37d",
  "ref": "pevensey-castle-walking-route",
  "title": "Pevensey Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Pevensey_castle.jpg",
  "nearby": [
    {
      "description": "1066 Country Walk",
      "objectID": "9bd57595ddfd3ba764d3b6c788f098b6",
      "ref": "1066-country-walk-walking-route"
    },
    {
      "description": "Bexhill",
      "objectID": "60ad5be456784c327958d71e8138036b",
      "ref": "bexhill-walking-route"
    },
    {
      "description": "Eastbourne to Alfriston Walk",
      "objectID": "3089968690caa54dc964c71968a70b46",
      "ref": "eastbourne-to-alfriston-walk-walking-route"
    },
    {
      "description": "Eastbourne to Beachy Head",
      "objectID": "6097952bb1e789c8f9170defcb153416",
      "ref": "eastbourne-to-beachy-head-walking-route"
    },
    {
      "description": "Eastbourne to Hastings Walk",
      "objectID": "2555700e61a31255860dbe68880aea85",
      "ref": "eastbourne-to-hastings-walk-walking-route"
    },
    {
      "description": "Shinewater Lake Park",
      "objectID": "f21f9f057bf704cdbe5b175bc3d86760",
      "ref": "shinewater-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/91513f0cf27a6bb0d1660dbdbde1f37d.gpx",
  "_geoloc": {
    "lat": 50.8187716855,
    "lng": 0.335310373
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Pevensey_castle.jpg",
      "title": "Ron Strutt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Originally a Roman Saxon Shore fort called Anderitum, built in about AD290. The walls survive to an impressive height. Unlike most Roman forts which are of decidedly square shape, this one follows the lines of the peninsula on which it was built. Originally the sea lapped against its walls but it is now nearly a mile away. The Normans used the fort for their overnight camp before the Battle of Hastings and soon after built the castle (seen here) in a corner of the fort. The castle was further fortified in World War II."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Arch_at_Pevensey_Castle_%28geograph_5789095%29.jpg",
      "title": "Malc McDonald / Arch at Pevensey Castle",
      "caption": "An arch in the wall surrounding Pevensey Castle. This view was taken from within the grounds of the castle, looking out into the village of Pevensey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Gateway_to_the_Norman_Pevensey_Castle_-_geograph.org.uk_-_1410614.jpg",
      "title": "PAUL FARMER / Gateway to the Norman Pevensey Castle",
      "caption": "Gateway to the Norman Castle. The castle lies within the old, fairly complete Roman Walls."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Inner_Keep%2C_Pevensey_Castle_-_geograph.org.uk_-_1818935.jpg/512px-Inner_Keep%2C_Pevensey_Castle_-_geograph.org.uk_-_1818935.jpg",
      "title": "Inner Keep, Pevensey Castle by Simon Carey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Inner Keep."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Pevensey_Haven_-_geograph.org.uk_-_1670993.jpg/512px-Pevensey_Haven_-_geograph.org.uk_-_1670993.jpg",
      "title": "Simon Carey / Pevensey Haven",
      "caption": "Pevensey Haven. Viewed from the footbridge with the confluence of Chilley Stream on the left. The waterway would have been constructed during the original inning of the marshes between the 12th and 13th centuries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Castle_Road%2C_Pevensey_-_geograph.org.uk_-_109487.jpg",
      "title": "Simon Carey / Castle Road, Pevensey",
      "caption": "Castle Road, Pevensey. Now the B2191 until as recently as 2002 this was the main A259. This is the north eastern point of the castle walls and gives an idea of just how much the castle imposes itself on the small village. This view looks east as Castle Road swings round and becomes the High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Gatehouse%2C_Pevensey_Castle_-_geograph.org.uk_-_697727.jpg",
      "title": "Simon Carey / Gatehouse, Pevensey Castle",
      "caption": "Gatehouse. Entrance to the inner bailey built in the mid 13th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Beach_at_Norman%27s_Bay_-_geograph.org.uk_-_42056.jpg",
      "title": "Ron Strutt / Beach at Norman's Bay",
      "caption": "Beach at Norman's Bay, just to the east of Pevensey. A view eastwards along the beach at Norman's Bay, so-called because it was the site where the Norman army landed in 1066 before the Battle of Hastings."
    }
  ],
  "distance_km": 6.0,
  "description": "This walk takes you around the historic Pevensey Castle in East Sussex. The site has a fascinating history stretching back to the 4th century when it was originally a Roman fortification. It is also notable as the place where the Norman Conquest of England began, when William the Conqueror landed there on 28 September 1066. As such it marks the start of the 1066 Country Walk which visits several of the sites associated with the invasion and the subsequent Battle of Hastings. Today you can explore the ancient ruins of the Norman castle and its surrounding grounds on pleasant footpaths. After exploring the castle you can pick up a waterside section of the 1066 Country Walk and follow the waymarked footpath north along the Pevensey Haven to Rickney. The river will take you into the Pevensey Levels, an area of marshland that cover an area of around 47 square miles. It is a Site of Special Scientific Interest and nature reserve with many rare species of plant to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Right next to the castle is the Royal Oak and Castle pub. The pub dates back to 1853 and includes a lovely large garden area. You can find them on the High Street at postcode BN24 5LE. There's also the Smugglers Inn which dates all the way back to 1527. The oak beamed pub serves fine food and also has a good sized garden for warmer days. They are also on the High Street at postcode BN24 5LF. If you head to the coast at Pevensey Bay you could visit the Castle Inn. The inn dates all the way back to the 16th Century. It's recently been tastefully renovated, with its low ceilings and oak beams it retains its 'old world' pub charm. The pub has a large suntrap garden which is enjoyed by many during sunny weather. You can find the inn at a postcode of BN24 6HS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The castle grounds are a nice place to bring your dog for a stroll. You are requested to keep them on leads though. The Royal Oak and the Smugglers pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The 1066 Country Walk will take you to Battle Abbey and Herstmonceux Castle, two other significant historical sites in the area. Head east along the coast and you could visit Norman's Bay, the site where the Norman army landed in 1066 before the Battle of Hastings. Just beyond that is the coastal town of Bexhill. In nearby Eastbourne you can pick up the Eastbourne to Alfriston Walk, the Eastbourne to Beachy Head and the Eastbourne to Hastings Walk. Just a couple of miles to the west there's Shinewater Lake Park where there's some nice waterside trails and lots of birdlife to see. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wkZfg-uJ8UM",
  "district": "Pevensey",
  "county": "East Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}