{
  "created_at": "2025-01-06T02:57:55.080779+00:00",
  "objectID": "91769fede91a52546a8eb90883996d5a",
  "ref": "burwardsley-walking-route",
  "title": "Burwardsley Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Burwardsley_-_Pheasant_Inn.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/91769fede91a52546a8eb90883996d5a.gpx",
  "_geoloc": {
    "lat": 53.1057095107,
    "lng": -2.726080116
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Burwardsley_-_Pheasant_Inn.jpg",
      "title": "Peter Styles, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pheasant Inn, Burwardsley. The Pheasant Inn, in the village of Burwardsley, sits on the western edge of the Peckforton Hills, a Ridge of Triassic Sandstone rising above the Cheshire Plain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Burwardsley.jpg",
      "title": "Eirian Evans / Parish Church of St John the Divine, Burwardsley",
      "caption": "Parish Church of St John the Divine, Burwardsley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Peckforton_Castle_2014.jpg/512px-Peckforton_Castle_2014.jpg",
      "title": "Bs0u10e01, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Peckforton Castle 2014"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Peckforton_Hills_2.jpg/512px-Peckforton_Hills_2.jpg",
      "title": "Vertigogen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Peckforton Hills 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Beeston_Castle_-_Inner_Gatehouse.jpg/512px-Beeston_Castle_-_Inner_Gatehouse.jpg",
      "title": "Ihaveseenthings, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Beeston Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Natural_viewing_platform%2C_Bulkeley_Hill_-_geograph.org.uk_-_2333767.jpg/512px-Natural_viewing_platform%2C_Bulkeley_Hill_-_geograph.org.uk_-_2333767.jpg",
      "title": "Natural viewing platform, Bulkeley Hill by Peter Turner, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Natural viewing platform, Bulkeley Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Bickerton_Hill.jpg/512px-Bickerton_Hill.jpg",
      "title": "Espresso Addict at English Wikipedia, CC BY-SA 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>, via Wikimedia Commons",
      "caption": "Bickerton Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/View_towards_Maiden_Castle_ramparts_-_geograph.org.uk_-_1830107.jpg",
      "title": "View towards Maiden Castle ramparts by Espresso Addict, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View towards Maiden Castle ramparts"
    }
  ],
  "distance_km": 22.5,
  "description": "This Cheshire based village is crossed by two signficant long distance trails. There's also some fine local hill climbs to historic sites and miles of woodland trails in the surrounded forested areas. This figure of eight loop walk visits some of the walking highlights of the area from the village. On the route you'll pass Peckforton Castle and Peckforton Hills, Beeston Castle, Bickerton Hill and Maiden Castle. The walk starts in the village and uses sections of the Eddisbury Way and Sandstone Trail to visit Peckforton Castle and Beeston Castle to the north east. Peckforton Castle is a Victorian country house built in the style of a medieval castle during the 19th century. It is now operated as a hotel. Beeston Castle dates from the 13th century and is one of the most popular viewpoints in the region. You then head south along the Sandstone Trail through the Peckforton Hills to Bulkeley Hill, Bickerton Hill and Maiden Castle. The Iron Age hill fort dates from 600 BC and commands a fine view over the Cheshire Plain You then head past Brown Knowl and Harthill to return to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Pheasant Inn is a good choice for some post walk refreshment. They serve fine home cooked food which you can enjoy with a countryside view from the lovely garden area. You can find them at postcode CH3 9PF."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails around the village are ideal for dog walking. The Pheasant mentioned above is also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you will find the neighbouring village of Tattenhall. Here you can visit the noteworthy Ice Cream Farm, the largest ice cream shop in the world. The popular tourist attraction includes expansive children's play areas, farm animals and quad bikes. You can find them at Drumlan Hall, Newton Ln, CH3 9NE. To the west there's the interesting village of Farndon. The village includes a noteworthy medieval bridge which spans the River Dee, connecting England to Holt in Wales. The Bishop Bennet Way and the Marches Way run past the settlement. Just to the south east of Bickerton you'll find Cholmondeley where you can explore the 19th century Cholmondeley Castle. The castle is surrounded by 70 acres of beautiful parkland and gardens with an arboretum, herbaceous borders, lakes and a fine viewpoint to enjoy. Near here there's also the market town of Malpas with its timber framed properties and noteworthy 14th century church. Bunbury locks and the associated village of Bunbury are located just to the east. The impressive staircase locks on the Shropshire Union Canal and the delightful historic settlement are well worth a visit. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/O-KcxkA-wV8",
  "district": "Burwardsley",
  "county": "Cheshire West and Chester",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}