{
  "created_at": "2025-01-06T18:45:57.360196+00:00",
  "objectID": "918220d5512af02d9bf281f57168d715",
  "ref": "derryounce-lakes-and-walkways-walking-route",
  "title": "Portarlington Derryounce Lakes Walk Route",
  "nearby": [
    {
      "description": "Rock Of Dunamase",
      "objectID": "aa678fa59283447e978c3d75db5a6b24",
      "ref": "rock-of-dunamase-walking-route"
    },
    {
      "description": "Slieve Bloom Way",
      "objectID": "e216fec10e2343612f00faf2a3f72c86",
      "ref": "slieve-bloom-way-walking-route"
    },
    {
      "description": "Emo Court",
      "objectID": "ca1c9b97d9a1130629fb1bc838dc7c20",
      "ref": "emo-court-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/918220d5512af02d9bf281f57168d715.gpx",
  "_geoloc": {
    "lat": 53.1650619,
    "lng": -7.1909122
  },
  "distance_km": 8.1,
  "description": "This circular loop walk explores the Derryounce Lakes near the town of Portarlington on the border of County Laois and County Offaly. You'll pass along raised walkways as you make your way around the bog, peaceful woodland and pretty lakes. It's a great place for nature with lots of interesting plants and wildlife to see. To continue your walking in the area head south to visit Emo Court. The splendid neo-classical mansion is surrounded by lovely woodland, parkland, gardens and a lake.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Derryounce Bog, originally developed by Bord na Móna as part of the larger Clonsast bog group in the mid-20th century, has undergone significant transformation over the decades. Initially, the bog was extensively harvested for sod peat, which supplied the Portarlington power station. Industrial peat extraction continued for several decades until the 1980s when the production ceased. Following the cessation of peat harvesting, the remaining cutaway bog was taken over by Coillte, who planted a conifer plantation on the site. A notable feature of the transformed landscape is Lough Lurgan, a lake that formed naturally after the peat production stopped and the pumps were turned off, leading to the flooding of a central basin created by the lowered ground levels. Nugent’s Hill, located to the west of Derryounce Lake, is another significant area within the bog, featuring dry grassland and woodlands. Historical maps indicate that this area once had human habitation, with a well and spring that were important to the local community. Derryounce Lake, an artificial creation, was formed by digging down to the sand layer beneath the peat, with the displaced sand forming an unofficial inland beach that is popular during the summer months. The surrounding wetlands, lakes, and forestry areas now make up the Derryounce Lakes and Walkways, an amenity area leased by the Portarlington Community Development Association (PCDA) from Bord na Móna. This area is now valued as a peaceful recreational space for various activities, including walking, angling, photography, and enjoying the natural environment, providing a serene escape for local residents and visitors alike. To further continue your walking in the area head south to visit a local historical highlight at the Rock Of Dunamase. Here you can explore the atmospheric ruins of a fascinating ancient Celtic fortification. Near here you can also pick up the epic Slieve Bloom Way."
    }
  ],
  "video_url": "https://www.youtube.com/embed/9HJDgPHaJQI?si=wLCdEm1hib92rb2c",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Derryounce Walk (Red Loop), Portarlington ED, The Municipal District of Graiguecullen — Portarlington, County Laois, Leinster, R32 TDN4, Éire / Ireland",
  "postcode": "R32 TDN4",
  "district": null,
  "county": "County Laois",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "bog",
    "lake"
  ],
  "points_of_interest": [
    "nature"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}