{
  "created_at": "2025-01-06T01:32:44.040494+00:00",
  "objectID": "9195b696e0a83ee0c727e7afa0adb2e4",
  "ref": "winchester-circular-walk-walking-route",
  "title": "Winchester Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/75/River_Itchen%2C_Winchester_-_geograph.org.uk_-_1338812.jpg",
  "nearby": [
    {
      "description": "St Catherine's Hill Winchester",
      "objectID": "ada71fffaace86ab9f2951ef046a6dad",
      "ref": "st-catherines-hill-winchester-walking-route"
    },
    {
      "description": "Itchen Way",
      "objectID": "536b9be9a0f34d2eef06d360207878af",
      "ref": "itchen-way-walking-route"
    },
    {
      "description": "Three Castles Path",
      "objectID": "5c133e175d5f3f3cadd0bb733e6437ed",
      "ref": "three-castles-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9195b696e0a83ee0c727e7afa0adb2e4.gpx",
  "_geoloc": {
    "lat": 51.0577651323,
    "lng": -1.3076731761
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/River_Itchen%2C_Winchester_-_geograph.org.uk_-_1338812.jpg",
      "title": "Dr Neil Clifton / River Itchen, Winchester, via Wikimedia Commons",
      "caption": "River Itchen, Winchester. This is the City Mill branch of the Itchen, with City Bridge in the distance and a bus crossing over it. The 'Bishop on the Bridge' public house is just left of the bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/St._Catherine%27s_Hill%2C_Winchester_05.jpg/512px-St._Catherine%27s_Hill%2C_Winchester_05.jpg",
      "title": "Simon Burchell [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Mizmaze on St. Catherine's Hill. This Iron Age hill fort sits on the outskirts of Winchester.It offers fine views over the city. Photo taken in February 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Wolvesey_Palace_-_geograph.org.uk_-_1776869.jpg/512px-Wolvesey_Palace_-_geograph.org.uk_-_1776869.jpg",
      "title": "Andrew Mathewson / Wolvesey Palace",
      "caption": "Wolvesey Palace. The ruins of one of the many palaces of the bishops of Winchester. The cathedral is in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Wharf_Bridge%2C_Winchester_-_geograph.org.uk_-_1338858.jpg",
      "title": "Dr Neil Clifton / Wharf Bridge, Winchester",
      "caption": "Wharf Bridge, Winchester. Officially the head of navigation, (although a few boats worked a short distance further upstream to serve Wharf Mill), this bridge, built in the 1760s, is the oldest surviving bridge over the River Itchen. The public right of navigation on the Itchen has never been statutorily extinguished."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/River_Itchen%2C_Winchester_-_geograph.org.uk_-_1338812.jpg",
      "title": "Dr Neil Clifton / River Itchen, Winchester",
      "caption": "This is the City Mill branch of the Itchen, with City Bridge in the distance and a bus crossing over it. The 'Bishop on the Bridge' public house is just left of the bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Riverside_walk%2C_Winchester_-_geograph.org.uk_-_1338750.jpg",
      "title": "Dr Neil Clifton / Riverside walk, Winchester",
      "caption": "Riverside walk, Winchester. This is the City Mill branch of the River Itchen. The popular 'Bishop on the Bridge' public house is on the right."
    }
  ],
  "distance_km": 5.0,
  "description": "This circular walk takes you around the city of Winchester in Hampshire. The walk makes use of the Itchen Way long distance footpath to take you along the River Itchen to St Catherine's Hill before returning to the town centre on other public footpaths. The walk starts in the centre of the city near Wharf Bridge and the Wolvesey Palace. It's a nice waterside walk with the option of taking a short detour to climb St Catherine's Hill for nice views over the city and the surrounding countryside. You can extend the walk by continuing south along the Itchen to Shawford and Twyford. There are also nice footpaths across Twyford Down, just to the south east of the city centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bishop on the Bridge is located right next to the River Itchen and a great place to stop at. It's dog friendly with a good menu and a nice riverside terrace for fine summer days. The classic English pub is located at number 1 High Street next to the Winchester Mill. The Queen Inn is located just to the north of the St Catherine's Hill and a good option for some refreshments on the walk. They offer a tasty home made bar snack menu, along with sandwiches, including items such as scotch eggs and sausage rolls as well as offering home made cake. The pub is also dog friendly and includes a nice beer garden to relax in on warmer days. You can find it a short distance north of the hill car park on 28 Kingsgate Rd with a postcode of SO239PG for your sat navs. At the foot of St Catherine's Hill there's the The Handlebar Cafe next to the East Winchester park and ride car park. The cafe is part of Bespoke Biking and includes a good range of meals and snacks. It is located on the old railway line, with the building's design reflecting this. The cafe is a popular place for both walkers and cyclists and provides a friendly service. You can find them on Garnier Road with a postcode of SO23 9PA. Just to the north of the cafe is the Winchester Bike Hub at Bespoke Biking. Here you can find lots of cycling information and bike hire. The address is 4a Middle Brook Street, SO23 8AQ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and then east along the Itchen Way and you will soon come to the neighbouring village of Itchen Abbas. It's a picturesque spot along the river with the option of visiting the nearby Avington Park on the southern side. There's a lovely lake, peaceful woodland and a herd of Highland Cattle to see here. The village is also notable for providing the inspiration for the setting of Charles Kinglsey's novel The Water Babies. The author was a regular visitor to the area. A few miles to the south there's the splendid Hinton Ampner near Cheriton. Here you can explore the beautiful gardens surrounding a fine stately home. In Cheriton there's a noteworthy 13th century church, some picturesque thatched cottages and the site of the Battle of Cheriton which took place as part of the English Civil War in 1544. You will also find the source of the River Itchen just south of the village. For more walking ideas in the area see the South Downs Walks and the Hampshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QF6T2YY06ts",
  "postcode": "SO23 9NQ",
  "district": "Winchester",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Black Boy, 1, Wharf Hill, Winchester, Hampshire, England, SO23 9NQ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "views",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}