{
  "created_at": "2025-01-06T02:01:53.809245+00:00",
  "objectID": "91b4d787b8caa1c7d1c22026ea5f0352",
  "ref": "llanidloes-walking-route",
  "title": "Llanidloes Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Long_Bridge_Street%2C_Llanidloes_-_geograph.org.uk_-_1589995.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/91b4d787b8caa1c7d1c22026ea5f0352.gpx",
  "_geoloc": {
    "lat": 52.4507767488,
    "lng": -3.5392317986
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Long_Bridge_Street%2C_Llanidloes_-_geograph.org.uk_-_1589995.jpg",
      "title": "Andrew Hill / Long Bridge Street, Llanidloes, via Wikimedia Commons",
      "caption": "Llanidloes. Near the centre of the little town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Llanidloes%2C_sculpture_-_geograph.org.uk_-_1243671.jpg",
      "title": "Mike Faherty / Llanidloes, sculpture, via Wikimedia Commons",
      "caption": "Llanidloes, sculpture Sculpture in Porte Gardens, overlooking the River Severn. Perhaps the incisions suggest local trees, hills & water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Severn_valley_west_of_Llanidloes_-_geograph.org.uk_-_573937.jpg",
      "title": "Graham Horn / Severn valley west of Llanidloes, via Wikimedia Commons",
      "caption": "Severn valley west of Llanidloes. A couple of miles west the town the Severn flood plain starts to widen out, and the initial enthusiasm of the river calms down. The river is hidden in the trees in the valley floor (obviously). The steep hillside to the left (north) is Pen y Banc."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Afon_Dulas_below_the_ford_geograph_-_2962117.jpg/512px-Afon_Dulas_below_the_ford_geograph_-_2962117.jpg",
      "title": "Andrew Hill / Afon Dulas below the ford, via Wikimedia Commons",
      "caption": "Afon Dulas below the ford. Beautiful river scenery close to meeting point with the Severn. Relief after a dry crossing - able to continue the planned walk without diverting back to Llanidloes and starting again."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Former_mill_at_Llanidloes_-_geograph.org.uk_-_573954.jpg",
      "title": "Graham Horn / Former mill at Llanidloes, via Wikimedia Commons",
      "caption": "Former mill at Llanidloes, now converted into apartments. The River Severn has just been joined by Afon Dulas and is becoming a sizeable but shallow river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Market_hall._%285980187681%29.jpg/512px-Market_hall._%285980187681%29.jpg",
      "title": "Peter Broster [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "The half-timbered Old Market Hall stands at the crossroads of the four streets of the original medieval town. Built around 1600, it is the only surviving building of this type in Wales. Assize courts were held in the hall around 1605, and John Wesley preached from a pulpit stone on the open ground floor in 1748."
    }
  ],
  "distance_km": 11.5,
  "description": "Llanidloes is nicely positioned for walking with waymarked trails eminating from the town in all directions. As such you are spoilt for choice with so much lovely scenery to explore. This circular walk makes use of the Severn Way long distance trail to explore the countryside to the west of the town. There's nice views of the River Severn and the River Dulas which also runs through the little town. Starting in the centre of town follow the waymarked path south west along Penygreen Road. You'll then cross the Severn on the Felindre Bridge and head north west past Felindre Mill. The country lane takes you along the river to Bronfelen where you turn south along a bridleway. You can then follow a nice scenic country lane past Caencoed and back into the town. There's several other good options for extending your walking in the area. You could pick up the epic Glyndwr's Way and follow it north west to visit the beautiful Llyn Clywedog. The lake is a great place for birdwatching and also includes a spectacular dam which is the tallest concrete dam in the UK. Also of interest are the peaceful woodland trails in nearby Hafren Forest and the Sarn Sabrina Walk which runs around the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a few nice pubs in the town where you can enjoy some refreshments after your walk. One of the highlights is the historic Angel Inn. The Timber framed former Coaching Inn was built way back in 1748. The Pub has a wealth of Character with many original features including Oak beams in the Bar and Lounge. There's a very good menu and some picnic tables outdoors for warmer days. It is located close to the center of Llanidloes on the High Street with a postcode of SY18 6BY for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The town is located close to the Cambrian Mountains where there are more fabulous walking opportunities including the climb to Plynlimon - the highest point in the range. Follow the Glyndwr's Way north for a few miles and you will soon come to Dylife where you can pick up the circular Dylife Waterfall Walk. This explores a wonderful gorge with spectacular views to the Ffrwd Fawr waterfall."
    }
  ],
  "postcode": "SY18 6HG",
  "district": "Llanidloes",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Long Bridge, B4518, Llanidloes, Powys, Cymru / Wales, SY18 6HG, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "scenic views",
    "birdwatching",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}