{
  "created_at": "2025-01-06T09:23:01.330046+00:00",
  "objectID": "920efc9dbcb10bacde45ac1c56fa55dd",
  "ref": "harefield-walking-route",
  "title": "Harefield Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/64/Grand_Union_Canal_in_South_Harefield_-_geograph.org.uk_-_522529.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/920efc9dbcb10bacde45ac1c56fa55dd.gpx",
  "_geoloc": {
    "lat": 51.600428117,
    "lng": -0.4837503564
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Grand_Union_Canal_in_South_Harefield_-_geograph.org.uk_-_522529.jpg",
      "title": "Nigel Cox / Grand Union Canal in South Harefield",
      "caption": "Grand Union Canal in South Harefield. This is the Broad Water reach of the canal, upstream of Wide Water lock. The towpath forms part of the London Loop and is also the route of National Cycle Network 61."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Harefield%2C_The_Countess_of_Derby%27s_Almshouses_-_geograph.org.uk_-_519456.jpg",
      "title": "Nigel Cox / Harefield: The Countess of Derby's Almshouses",
      "caption": "The Countess of Derby's Almshouses. These Almshouses were founded by the will of Lady Alice, Countess of Derby, to provide for six poor women of the parish of Harefield. The Countess, who lived as the Lady of the Manor at Harefield Place, died in 1637. The almshouses are on Church Hill, and are Grade II* listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Harefield%2C_Church_of_St_Mary_the_Virgin_-_geograph.org.uk_-_520268.jpg",
      "title": "Nigel Cox / Harefield: Church of St Mary the Virgin",
      "caption": "Harefield, Church of St Mary the Virgin. The church is in Countess Close, off Church Hill. The churchyard contains a large number of graves of Australian soldiers who died of their wounds at the hospital at Harefield Park during the First World War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Grand_Union_Canal%2C_Widewater_Lock_in_South_Harefield_-_geograph.org.uk_-_523109.jpg",
      "title": "Nigel Cox / Grand Union Canal: Widewater Lock in South Harefield",
      "caption": "Grand Union Canal: Widewater Lock in South Harefield Photographed from the Moorhall Road bridge, this is Lock No. 86 and its associated lock keeper's cottage. As its name suggests, the canal is wider than usual here, both upstream and downstream of the lock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Harefield_-_geograph.org.uk_-_274853.jpg",
      "title": "Colin Smith / Harefield",
      "caption": "Harefield War memorial and village pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/River_Misbourne_in_Denham_Country_Park_-_geograph.org.uk_-_854924.jpg",
      "title": "Nigel Cox / River Misbourne in Denham Country Park",
      "caption": "River Misbourne in Denham Country Park. The Misbourne is a chalk stream that rises northwest of Great Missenden in SP8902 and runs for about 23 kilometres, as the crow flies, before ending where it joins the River Colne in TQ0585. Here, only about 1 kilometre upstream of the confluence with the Colne, it is still very shallow. This view was taken from the Denham Court Drive bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Ruislip_Lido_beach.JPG/512px-Ruislip_Lido_beach.JPG",
      "title": "By Dudley Miles (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Ruislip Lido beach"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Mature_trees_in_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_62489.jpg/256px-Mature_trees_in_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_62489.jpg",
      "title": "David Hawgood / Mature trees in Bayhurst Wood Country Park",
      "caption": "Mature trees in Bayhurst Wood Country Park. An information board says that this wood boasts many fine mature trees, unusual for a country park. Some of these are oak trees growing tall and straight."
    }
  ],
  "distance_km": 16.0,
  "description": "This Hillngdon based village is located in a lovely spot for canal and river walks through the Colne Valley. There's also miles of trails through the local woodland nature reserve and the popular Ruislip Lido within walking distance of the village centre. The village is also notable as the westernmost settlement in Greater London. This circular route from the town visits some of the walking highlights of the area including Bayhurst Wood Country Park and Ruislip Woods, Ruislip Lido the Grand Union Canal, Denham Country Park and the lakes of the Colne Valley. The route starts in the town centre where you can pick up the Hillingdon Trail. Follow the waymarked footpath south east and it will take you through the countryside to the Bayhurst Wood Country Park. You continue east through North Riding Wood and Mad Bess Wood before coming to Ruislip Lido. The trail then heads south west through Ruislip before heading west to visit Denham Country Park in the Colne Valley. Here you pick up the Grand Union Canal and follow the towpath north along a series of lakes. The route then picks up the Hillingdon Trail again and follows it back east into Harefield.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Orchard is a lovely place for some post walk refreshment. They have a smashing large garden area where you can enjoy a meal on finer days. From there's a wonderful view towards the surrounding countryside, rivers and lakes. They also have a charming interior with old photos on the wall. They serve a good range of high quality food and have a good drinks selection as well. You can find them at Park Lane with a postcode of UB9 6HJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and waterside trails are ideal for a dog walk. There's even a doggy beach at the Lido for them to run around on. The Orchard mentioned above is also very dog friendly with water bowls and biscuits available for your canine friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west from the village and you can visit the neighbouring settlements of Chalfont St Peter and Gerrards Cross where there's a nice local common and pub to investigate. In Chalfont St Giles you'll find the former residence of John Milton, author of the epic poem 'Paradise Lost'. The cottage is now open as a museum and one of the literary highlights of the area. Also in Hillingdon is the popular Celandine Route. The trail runs along the River Pinn from Cowley to Pinner. It is named after the pretty Lesser Celandine flowers you can see on the walk. For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/oPnklYVbIgU",
  "postcode": "UB9 6DJ",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hillingdon Trail, London Borough of Hillingdon, London, Greater London, England, UB9 6DJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "canal"
  ],
  "points_of_interest": [
    "country park",
    "woods",
    "lido"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "pub/cafe",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}