{
  "created_at": "2025-01-06T00:13:58.990393+00:00",
  "objectID": "921f1069ceff9c3adfefa70ae38877b4",
  "ref": "milk-hill-walking-route",
  "title": "Milk Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Alton_Barnes_White_Horse_-_geograph.org.uk_-_1744619.jpg",
  "nearby": [
    {
      "description": "Wansdyke Path",
      "objectID": "ac6dd2658519f5e7fc14e4ab0edc68ef",
      "ref": "wansdyke-path-walking-route"
    },
    {
      "description": "Tan Hill Way",
      "objectID": "99103b0b809df298bea29fe71b2b20f3",
      "ref": "tan-hill-way-walking-route"
    },
    {
      "description": "Alton Barnes White Horse",
      "objectID": "010a251326922871866292a843035c1e",
      "ref": "alton-barnes-white-horse-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/921f1069ceff9c3adfefa70ae38877b4.gpx",
  "_geoloc": {
    "lat": 51.3726605123,
    "lng": -1.8358514492
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Alton_Barnes_White_Horse_-_geograph.org.uk_-_1744619.jpg",
      "title": "Brian Robert Marshall / Alton Barnes White Horse",
      "caption": "Alton Barnes White Horse. The chalk figure is here viewed from a distance of 1.6 kilometres south-west of the horse. The horse was designed and cut in 1812 so it will reach its 200th birthday in time for the London Olympics."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Downland_West_of_Milk_Hill._-_geograph.org.uk_-_185577.jpg",
      "title": "Colin Smith / Downland West of Milk Hill.",
      "caption": "Downland West of Milk Hill. Rolling grassy fields north-west of Pewsey lead up to Milk Hill which has a white horse carved on the other side of it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Adams_Grave_-_panoramio.jpg/512px-Adams_Grave_-_panoramio.jpg",
      "title": "ian freeman [CC BY-SA 3.0  (https://creativecommons.org/licenses/by-sa/3.0 )], via Wikimedia Commons",
      "caption": "Adams Grave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Downland%2C_Alton_Barnes_-_geograph.org.uk_-_844742.jpg",
      "title": "Andrew Smith / Downland, Alton Barnes",
      "caption": "Downland, Alton Barnes. The top of the scarp to the east of the White Horse. This is within the Pewsey Downs National Nature Reserve. Controlled grazing is part of the habitat management regime."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Downland%2C_Stanton_St_Bernard_-_geograph.org.uk_-_844979.jpg",
      "title": "Andrew Smith / Downland, Stanton St Bernard",
      "caption": "Downland, Stanton St Bernard. The undulating scarp slope of Milk Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/The_springers_explore_Wansdyke_%28geograph_2705555%29.jpg/512px-The_springers_explore_Wansdyke_%28geograph_2705555%29.jpg",
      "title": "Russel Wills / The springers explore Wansdyke",
      "caption": "Two dogs explore Wansdyke"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/The_Wansdyke%2C_North_of_Milk_Hill._-_geograph.org.uk_-_185562.jpg",
      "title": "Colin Smith / The Wansdyke, North of Milk Hill.",
      "caption": "The Wansdyke, North of Milk Hill. A typical section of this man-made ditch and earthwork which runs between Bath and Marlborough. It was probably built by the Britons in the 6th - 7th Century as a defence against the Saxons coming in from the north. They were unsuccessful!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Byway_near_New_Town%2C_Wiltshire_-_geograph.org.uk_-_833966.jpg",
      "title": "Brian Robert Marshall / Byway near New Town, Wiltshire",
      "caption": "Byway near New Town, Wiltshire. The byway leads away till to the north towards the Wansdyke, the ancient earthwork betsween Bath and Savernake. As can be seen the byway passes through a field of sheep. There is a notice at the entrance to the byway imploring people to keep their dogs on leads."
    }
  ],
  "distance_km": 5.0,
  "description": "Climb to the highest point in Wiltshire on this circular walk near the village of Alton Barnes. The hill is located on the Pewsey Downs National Nature Reserve near to the Alton Barnes White Horse. The walk starts from the Pewsey Downs car park just to the east of the hill. From here you can pick up a footpath heading west past the white horse hill figure to Milk Hill. At the 295 m (968 ft) summit there are extensive views to the Mendip Hills, the Cotswolds and in clear weather as far as the Black Mountains in Wales. After taking in the views you descend to the north on another path. This soon joins with the Wansdyke Path and the Tan Hill Way. Here you have the option of heading west to visit Tan Hill (294m) the second highest point of Wiltshire. The long distance trails also visit some of the other hills in the North Wessex Downs AONB. This route continues the descent east to Red Shore where you turn south to return to the car park. To extend the walk continue west along the Tan Hill Way to visit Morgan's Hill which is also a nature reserve of the Wiltshire Wildlife Trust. Head east along the Wansdyke Path and you will soon come to West Woods where there's miles of peaceful woodland trails to explore.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south from the hill to the canal at Honeystreet for some refreshments after your walk. Here you'll find the idyllic Barge Inn. This historic pub is located right next to the canal and includes an outdoor seating area wih glorious views across the canal to the Marlborough Downs and the Alton Barnes White Horse. It's the ideal place to relax in and watch the world go by on warm summer days. The pub also has an interesting history having originally been built in 1810 to service the newly built Kennet and Avon canal, it was the equivalent of a modern day motorway service station. It then burnt down in the 1850s only to be rebuilt in record time so it now stands as it did then. The pub can be found just to the west of Pewsey in Honeystreet, near Alton Barnes. Postcode for you sat navs is SN9 5PS. For an alternative walk around the hill see the Alton Barnes White Horse Walk which starts and ends from the pub. It also visits the village of Stanton Bernard and includes a waterside stroll along the canal."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Pewsey Walk will take you along the Kennet and Avon Canal Walk and then up towards the downs and the hill. It's a nice way of visiting the hill from the town and exploring the area further. For more walking ideas in the area see the Wiltshire Walks and North Wessex Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Yw2QnJ4V_nk",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "New Town, Alton, Alton Priors, Wiltshire, England, SN8 4JX, United Kingdom",
  "postcode": "SN8 4JX",
  "district": "Alton Priors",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "woodland"
  ],
  "points_of_interest": [
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}