{
  "created_at": "2025-01-06T02:35:20.947139+00:00",
  "objectID": "922f5bf591807de73e3758863309c026",
  "ref": "pencaitland-railway-walk-walking-and-cycle-route",
  "title": "Pencaitland Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Pencaitland_Railway_Walk_-_geograph.org.uk_-_895539.jpg",
  "nearby": [
    {
      "description": "Dalkeith Country Park",
      "objectID": "f32c8e54d30f6810827a18ba2ad4fac8",
      "ref": "dalkeith-country-park-walking-and-cycle-route"
    },
    {
      "description": "Haddington to Longniddry Railway Walk",
      "objectID": "23ebc7e92ec418ffefec44d2473444c3",
      "ref": "haddington-to-longniddry-railway-walk-walking-and-cycle-route"
    },
    {
      "description": "Gosford Estate",
      "objectID": "37b13834ddd18f48f6d3242d89a30658",
      "ref": "gosford-estate-walking-route"
    },
    {
      "description": "Vogrie Country Park",
      "objectID": "83400e9f92210b677343b5c863471d3c",
      "ref": "vogrie-country-park-walking-and-cycle-route"
    },
    {
      "description": "Carberry Hill and Tower",
      "objectID": "b3e31d083b4552b47396fbc9c7a792ad",
      "ref": "carberry-hill-and-tower-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/922f5bf591807de73e3758863309c026.gpx",
  "_geoloc": {
    "lat": 55.9089394909,
    "lng": -3.0098493217
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Pencaitland_Railway_Walk_-_geograph.org.uk_-_895539.jpg",
      "title": "M J Richardson / Pencaitland Railway Walk",
      "caption": "Pencaitland Railway Walk. Detail from the board at the southern end of the walk, with information about the history of the railway, which dates from 1857 and was closed in 1965 as passengers and freight declined with the increase in road travel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Pencaitland_Railway_Walk_-_geograph.org.uk_-_895520.jpg",
      "title": "M J Richardson / Pencaitland Railway Walk",
      "caption": "On the trail looking north from an adjacent grassy field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Pencaitland_Railway_Walk_-_geograph.org.uk_-_895548.jpg",
      "title": "M J Richardson / Pencaitland Railway Walk",
      "caption": "A smart, new and decorative board near the car park at the southern end, with information about the walk, its wildlife and history"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Footbridge_on_the_Railway_Walk_-_geograph.org.uk_-_405685.jpg",
      "title": "Sandy Gemmill / Footbridge on the Railway Walk",
      "caption": "The raised footbridge takes cyclists and walkers on the Railway Walk and Nature Trail over a minor road. The footbridge is built at a raised level above that of the original railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Railway_Walk_-_geograph.org.uk_-_405648.jpg",
      "title": "Sandy Gemmill / Railway Walk",
      "caption": "The view of the cycle path to Pencaitland to the south of the A6093. The cycle path is also a nature trail and follows the line of the former Gifford and Garvald Railway (from Ormiston to Gifford)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Rails_on_the_Pencaitland_Railway_Path_-_geograph.org.uk_-_963036.jpg",
      "title": "A-M-Jervis / Rails on the Pencaitland Railway Path",
      "caption": "Rails on the Pencaitland Railway Path. The former Macmerry railway branch east of Crossgatehall and the former Gifford & Garvald Light Railway south from Ormiston to Saltoun have become official foot- and cycle-paths known as the Pencaitland Railway Walk. The only section of railway track left in situ is this bit embedded in a level crossing on a private road"
    }
  ],
  "distance_km": 11.0,
  "description": "This shared cycling and walking trail runs along a disused railway line in Dalkeith near Edinburgh. It runs for a distance of just under 7 miles on a flat path which is suitable for most abilities. On the way look out for a variety of flora and fauna especially in the summer months when you can see lots of wildflowers. There's also good information boards to look out for. These tell you about the history of the line which was built in 1867 and used until 1965 when it closed. Start the walk from the public car park just to the south of Carberry Hill and Tower. From here you can pick up the waymarked trail and follow it east towards the villages of Ormiston and Wester Pencaitland. The trail then finishes shortly after near Saltoun Forest. This end of the trail also has a car park if you prefer to start from here.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Mercat Grill is located close by and a good choice for some refreshments after your exercise. They do very good food and also have a superb garden area with tables and chairs for alfresco dining. You can find the bar at 10 Whitecraig Rd, Whitecraig with a postcode of EH21 8PG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail makes for a fine dog walk, but it's best to keep them on a lead as there are a few bikes around. The Mercat Grill mentioned above is also dog friendly, even serving up dog beers and gourmet treats for your four-legged friend!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east there's another similar trail to try. The Haddington to Longniddry Railway Walk runs between the two East Lothian towns for a distance of about 5 miles. Near here you'll also find the Gosford Estate where there's some nice trails to follow around the grounds of grand mansion. Dalkeith Country Park is located to the west of the route. There's some nice waymarked walking trails here running through ancient oak woodland and along the River Esk. The Penicuik to Dalkeith Railway Walk can be picked up near the park. It takes you through some of Midlothian’s historic villages on an easy path. Carberry Hill and Tower are located near the start of the route. There's a fine woodland walk with excellent views over Edinburgh and the Firth of Forth. It's also of historic interest as the place where Mary Queen of Scots surrendered to the Confederate Lords in 1567. At the other end of the trail you'll find Saltoun Forest where there are more nice woodland paths to try. Also in Dalkeith is Vogrie Country Park where you'll find some attractive parkland and gardens surrounding the baronial-styled Vogrie House."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3ssz8uSKBhw",
  "postcode": "EH21 8QB",
  "county": "East Lothian",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}