{
  "created_at": "2025-01-05T23:37:07.310684+00:00",
  "objectID": "923e1fd3ea3116e087ff9add0c44b053",
  "ref": "driffield-walking-route",
  "title": "Driffield Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a8/The_Head_of_the_Driffield_Canal_-_geograph.org.uk_-_424127.jpg",
  "nearby": [
    {
      "description": "East Riding Heritage Way",
      "objectID": "dae222421f692a2a60be1e219339f832",
      "ref": "east-riding-heritage-way-walking-route"
    },
    {
      "description": "Sledmere House",
      "objectID": "2388d486621e7739f50c6afce9d6a672",
      "ref": "sledmere-house-walking-route"
    },
    {
      "description": "Huggate",
      "objectID": "c67690915badf964f4a5ceb167596fbf",
      "ref": "huggate-walking-route"
    },
    {
      "description": "Rudston",
      "objectID": "d2f7dc7a367c89e53d0ee9945141c3e2",
      "ref": "rudston-walking-route"
    },
    {
      "description": "Tophill Low",
      "objectID": "76fd0f54fc0a4dd891276e726f6d066f",
      "ref": "tophill-low-walking-route"
    },
    {
      "description": "Skipsea",
      "objectID": "8ec1513a01050ba2e28dd38672ce8744",
      "ref": "skipsea-walking-route"
    },
    {
      "description": "Brandesburton",
      "objectID": "5fbff958c6c8c24edef4fec1a118fa98",
      "ref": "brandesburton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/923e1fd3ea3116e087ff9add0c44b053.gpx",
  "_geoloc": {
    "lat": 54.0011415155,
    "lng": -0.4323914782
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/The_Head_of_the_Driffield_Canal_-_geograph.org.uk_-_424127.jpg",
      "title": "Andy Beecroft / The Head of the Driffield Canal",
      "caption": "The Head of the Driffield Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Driffield_Canal_-_geograph.org.uk_-_149703.jpg",
      "title": "Stephen Horncastle / Driffield Canal",
      "caption": "Driffield Canal south east of Driffield, East Riding of Yorkshire, England. This view of the canal looking east on the south edge of the grid square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Driffield_Canal_-_geograph.org.uk_-_73589.jpg",
      "title": "Phil Williams / Driffield Canal",
      "caption": "Looking to the west across the Driffield Canal and the River Hull beyond. Otter Island is on the left, with the mills at Driffield on the skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/The_Driffield_Canal%2C_Wansford_-_geograph.org.uk_-_785348.jpg",
      "title": "Paul Glazzard / The Driffield Canal, Wansford",
      "caption": "Looking south along the disused Canal from the field boundary between Wansford Bridge and Snakeholm Lock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Driffield_Canal_at_Wansford.jpg",
      "title": "Andy Beecroft / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The canal in full flood after the recent unprecedented heavy rainfall of late June 2007. The view and lighting seem almost to give it a 'Constable painting' feel to this waterway! Picutred here at Wansford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Footpath_by_Nafferton_Beck_-_geograph.org.uk_-_768813.jpg",
      "title": "Christine Church / Footpath by Nafferton Beck",
      "caption": "Footpath by Nafferton Beck"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Nafferton_Mere_-_geograph.org.uk_-_697122.jpg",
      "title": "Paul Glazzard / Nafferton Mere",
      "caption": "Nafferton Mere, Nafferton, East Riding of Yorkshire, England. Looking north-northwest from near the spring on the northeast side of Priestgate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/All_Saints_Church%2C_Nafferton._-_geograph.org.uk_-_530195.jpg",
      "title": "Peter Church / All Saints Church, Nafferton.",
      "caption": "All Saints Church, Nafferton. As seen from the footpath leading from Wansford to Nafferton as it crosses the railway."
    }
  ],
  "distance_km": 11.0,
  "description": "This circular walk explores the Driffield Canal before heading to the neighbouring village of Nafferton along the Nafferton Brook. The route runs for just under 7 miles on a series of flat footpaths so is suitable for most abilities. Driffield is a noteworthy town having been named The Capital of the Wolds because of its central position in the Yorkshire Wolds. It's a pleasant place to visit and was listed in the 2019 Sunday Times report on the Best Places to Live in northern England. The associated canal has recently been restored by the Driffield Navigation Trust and now has new navigable sections and footpaths for walkers. The route starts from the centre of Driffield, close to the train station at the head of the canal. It's a very pretty area with two 19th century cranes and the old mills. From here you can pick up a footpath and follow it south east towards Wansford. On this section there's also views of the River Hull which runs alongside the canal. At Wansford you turn north east to follow a public footpath along the Nafferton Beck which will lead you into Nafferton. It's a picturesque village with the attractive Nafferton Mere as the centrepiece. From Nafferton you then head west, following Markman Lane and Meadow Lane back into Driffield.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Mishka Pub is conveniently located near the start of the walk at River Head. They do very good food and have an outdoor area. You can find the pub at postcode YO25 6NX for your sat navs.Also nearby is the The Butchers Dog where there is a microbrewery with a fine selection of cask beers and ciders. You can find it at 24 Middle St at postcode YO25 6PS. The pub is also dog friendly if you have your four legged friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head a few miles north to visit the village of Rudston. It's well known for it's ancient monolith and adjacent Grade I listed church. The photogenic stone is said to be the tallest standing stone remaining in England. Also nearby is Sledmere House. Here you'll find a beautiful Capability Brown designed park surrounding a fine Georgian country house.The long distance East Riding Heritage Way also passes through the town providing an opportunity to explore the area on a good waymarked footpath. Head west and you can try the circular Huggate Walk also visits Fridaythorope and explores the attractive Huggate Wold.  A few miles south east of the town there's the lovely Tophill Low Nature Reserve to explore. The reserve includes two pretty reservoirs and easy footpaths along the River Hull. It's a great place for birdwatching with several hides dotted around the site. Near here is the worthy vlllage of Brandesburton with its medieval church and historic 16th century pub. To the east there's the worthy village of Skipsea where you can explore the 11th century Skipsea Castle. For more walks in the area see the Yorkshire Wolds Walks page."
    }
  ],
  "postcode": "YO25 6NW",
  "district": "Driffield",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Riverhead Court, Riverside, Driffield, East Riding of Yorkshire, England, YO25 6NW, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "footpath",
    "canal"
  ],
  "points_of_interest": [
    "historical sites",
    "river views",
    "village"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}