{
  "created_at": "2025-01-06T01:44:47.877094+00:00",
  "objectID": "928e56c6a6c868355ef1a26f5e709aad",
  "ref": "gritstone-trail-walking-route",
  "title": "Gritstone Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fe/The_Gritstone_Trail_-_geograph.org.uk_-_856900.jpg",
  "nearby": [
    {
      "description": "Bosley Cloud",
      "objectID": "aa614a8a6c25a01b2ea54fb66a17eeec",
      "ref": "bosley-cloud-walking-route"
    },
    {
      "description": "Mow Cop",
      "objectID": "d016778371268db928d07f591b3f87a9",
      "ref": "mow-cop-walking-route"
    },
    {
      "description": "White Nancy",
      "objectID": "ba7ae58ed476b1a8c7ca82c9e1dbcbe6",
      "ref": "white-nancy-walking-route"
    },
    {
      "description": "Tegg's Nose Country Park",
      "objectID": "7a63ac6888ee9bd47a98ad67811ef794",
      "ref": "teggs-nose-country-park-walking-and-cycle-route"
    },
    {
      "description": "Macclesfield Forest and Trentabank Reservoir",
      "objectID": "fe24b1a96c37cbd128a47849327539d0",
      "ref": "macclesfield-forest-and-trentabank-reservoir-walking-route"
    },
    {
      "description": "Lyme Park",
      "objectID": "f5f02b4b8e24938b1c37c524f487d0d0",
      "ref": "lyme-park-walking-route"
    },
    {
      "description": "Macclesfield Canal",
      "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
      "ref": "macclesfield-canal-walking-route"
    },
    {
      "description": "Disley",
      "objectID": "dd3dda60ee5bb53be795299fe3d2ac87",
      "ref": "disley-walking-route"
    },
    {
      "description": "Pott Shrigley",
      "objectID": "48cfa54df0668d9f67451620d6d8ef96",
      "ref": "pott-shrigley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/928e56c6a6c868355ef1a26f5e709aad.gpx",
  "_geoloc": {
    "lat": 53.3585222392,
    "lng": -2.0425563613
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/The_Gritstone_Trail_-_geograph.org.uk_-_856900.jpg",
      "title": "Kate Jewell / The Gritstone Trail, via Wikimedia Commons",
      "caption": "The Gritstone Trail signs. The Long Distance Footpath skirts the Mow Cop Castle mound and leads down to the car park before heading north east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Stile_on_the_Gritstone_Trail_-_geograph.org.uk_-_258314.jpg",
      "title": "Espresso Addict / Stile on the Gritstone Trail, via Wikimedia Commons",
      "caption": "Stile on the Gritstone Trail. View south east along the trail near Buxton Old Road and the Tegg's Nose viewpoint"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Farmland_on_the_Gritstone_Trail_-_geograph.org.uk_-_258303.jpg",
      "title": "Espresso Addict / Farmland on the Gritstone Trail, via Wikimedia Commons",
      "caption": "Farmland on the Gritstone Trail. Rolling pastureland around the Gritstone Trail. View from the junction of Buxton New Road and the lane to Rainow. Hordern Farm (in SJ9574) is out of frame on the right"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Gritstone_Trail_descending_Brink_hill_-_geograph.org.uk_-_258306.jpg",
      "title": "Espresso Addict / Gritstone Trail descending Brink hill, via Wikimedia Commons",
      "caption": "Gritstone Trail descending Brink hill. The trail here is a faint depression in rough grass. Buxton New Road runs along the valley. The distant ridge is probably Tower Hill. The young conifer plantation (left of frame) is not marked on the OS map"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Shutlingsloe_view_from_the_Gritstone_Trail_-_geograph.org.uk_-_258312.jpg",
      "title": "Espresso Addict / Shutlingsloe view from the Gritstone Trail, via Wikimedia Commons",
      "caption": "Shutlingsloe view from the trail. This sloping cattle pasture lies on the trail just north of the Buxton Old Road, near the Tegg's Nose visitor centre. The buildings in the foreground are dog kennels; Windyway House is hidden in the trees. The distinctive profile of Shutlingsloe can be seen on the right"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Gritstone_Trail_near_Harrop_Brook_-_geograph.org.uk_-_236954.jpg",
      "title": "Peter Standing / Gritstone Trail near Harrop Brook, via Wikimedia Commons",
      "caption": "Gritstone Trail near Harrop Brook. The wooded valley of Harrop Brook is seen just above centre below Berristall Hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Sutton_-_Tegg%27s_Nose.jpg",
      "title": "John Maris / Tegg's Nose from the Gritstone Trail at Greenbarn, via Wikimedia Commons",
      "caption": "Tegg's Nose from the Gritstone Trail at Greenbarn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Hawkslee_-_geograph.org.uk_-_55453.jpg",
      "title": "Dave Smethurst / Hawkslee, via Wikimedia Commons",
      "caption": "Hawkslee farm buildings"
    }
  ],
  "distance_km": 56.0,
  "description": "This beautiful, challenging walk runs through the Peak District from Disley to Kidsgrove. The walk begins at the train station at Disley and soon comes to the wonderful Lyme Park (video below) with its mansion house and Medieval deer park. You continue south passing the town of Bollington before climbing to the unusual structure of White Nancy and crossing the Saddle of Kerridge. From the elevated position above Bollington you can enjoy splendid views across the Cheshire Plain, the mountains of North Wales to the west, the hills of Shropshire to the south and the Pennines to the north and east. The route continues to the lovely Tegg's Nose Country Park via Tower Hill. The views are truly dramatic from this former quarry site, including Shutlingsloe, the second highest point in Cheshire. The next section takes you on towards Rushton Bank before climbing the Bosley Cloud - at 1,125 ft it's a challenging section but the views of Congleton, Macclesfield and Greater Manchester are magnificent. The path continues to Mow Cop with its ruined castle, before you join the Macclesfield Canal and then the Trent and Mersey Canal taking you to Kidsgrove.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk you can stop for refreshments at the excellent Leather's Smithy near Langley. This fine pub is located next to Ridgegate Reservoir, just to the east of Bottoms Reservoir in Tegg's Nose Country Park. There's a great selection of ales and a nice beer garden to relax in when the weather is good. You can find the pub on Clarke Ln, at the north western tip of Ridgegate Reservoir, just slightly off the trail. Postcode is SK11 0NE. In Lyme Park there's a fine cafe with seats next to the pretty lake. They do a good range of meals and snacks which you can enjoy with a fine view. Just to the east of White Nancy you will find the Bulls Head in the hamlet of Kerridge. The pub dates from the 17th century and has a lovely cosy interior to relax in after your exercise. It's nice outside too with a patio area and a garden both with great views. In the paddocks attached to the pub you will usually find pigs and sheep looked after by the landlord. It's a friendly place with a good menu and selection of ales. You'll probably see plenty of other walkers in there too on a fine day. You can find the pub at the foot of the hill on 2 Oak Lane with a postcode of SK10 5BD for your sat navs. At the start/end of the route there's a few good options in the village of Disley. Firstly there's The White Lion which is notable for its excellent selection of real ales and some delicious home made pies. You can find them at postcode SK12 2HA for your sat navs. There's also the noteworthy Rams Head Inn. This historic building was built by the Legh family in c.1640, though the current exterior was built around 1840. It was formerly a lodge belonging to the Lyme Park estate. They have a lovely garden area where you can sit outside on warmer days. The pub can be found at postcode SK12 2AE. In Rainow there's the Robin Hood. The pub has a large car park and a fine outdoor decking area with splendid views towards White Nancy and other Peak District hills. The quaint old inn also serves fine food with a good tapas selection on the menu. You can find them at Chapel Brow with postcode SK10 5XE for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One of the highlights on the walk is the fantastic Lyme Park. The expansive park has miles of cycling and walking trails with woodland, ponds and deer to look out for on the way. The trail passes right through the park and past the historic house with its beautiful gardens and orangery.  Pictured above, the splendid Lyme Park. The National Trust owned park is a major highlight of the area. You can enjoy fine views towards Manchester from the high points here. Also of interest is the climb to White Nancy overlooking Bollington. Here you will find an unusual folly in the shape of a small domed sugar loaf and thought to have been built in 1817 by Colonel Gaskell as a monument to the Battle of Waterloo."
    }
  ],
  "video_url": "https://www.youtube.com/embed/c9OLPloFSlw",
  "district": "Disley",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Buxton Road, Disley, Cheshire East, England, SK12 2JN, United Kingdom",
  "postcode": "SK12 2JN",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "hard",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "mansion house",
    "deer park",
    "structure",
    "quarry site"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "canal"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}