{
  "created_at": "2025-01-06T05:11:36.144526+00:00",
  "objectID": "929134ed82fb78ad2bf8980a3d31c7ec",
  "ref": "gawsworth-walking-route",
  "title": "Gawsworth Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Gawsworth_Hall_open_air_theatre-geograph-3171170-by-Peter-Turner.jpg/512px-Gawsworth_Hall_open_air_theatre-geograph-3171170-by-Peter-Turner.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/929134ed82fb78ad2bf8980a3d31c7ec.gpx",
  "_geoloc": {
    "lat": 53.2241688024,
    "lng": -2.1667807317
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Gawsworth_Hall_open_air_theatre-geograph-3171170-by-Peter-Turner.jpg/512px-Gawsworth_Hall_open_air_theatre-geograph-3171170-by-Peter-Turner.jpg",
      "title": "Peter Turner / Gawsworth Hall open air theatre",
      "caption": "Gawsworth Hall open air theatre. Every summer the gardens are hosts to a variety of performances, plays and concerts. Here in July 2007 the Wilmslow Green Room company are performing a modern(ish) dress production of Shakespeare's Romeo And Juliet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Gawsworth_Old_Hall2.jpg",
      "title": "Phil Eptlett, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gawsworth Old Hall and pond. Notable residents have included Mary Fitton, perhaps the \"Dark Lady\" of Shakespeare's sonnets, and Samuel \"Maggoty\" Johnson, a playwright described as the last professional jester in England, whose grave is nearby in Maggoty Wood, a small National Trust woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Gawsworth_Church_in_August_-_geograph.org.uk_-_46521.jpg",
      "title": "Andrew Huggett / Gawsworth Church in August",
      "caption": "Gawsworth Church in August. Grade I listed and dating to the 15th century. The walls of the nave were built of limestone in 1430 and the chancel and tower of pink sandstone in 1480."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/The_Great_Barn_and_coach_House%2C_Gawthorpe_Hall-geograph-3101023-by-K--A.jpg/512px-The_Great_Barn_and_coach_House%2C_Gawthorpe_Hall-geograph-3101023-by-K--A.jpg",
      "title": "K A / The Great Barn and coach House, Gawthorpe Hall",
      "caption": "The Great Barn and coach House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Gawsworth_Old_Hall1.jpg",
      "title": "Neil Kennedy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The old hall is surrounded by formal gardens and parkland, which once comprised an Elizabethan pleasure garden and, possibly, a tilting ground for jousting."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Maggoty_Wood_Gawsworth_-_geograph.org.uk_-_2830584.jpg/512px-Maggoty_Wood_Gawsworth_-_geograph.org.uk_-_2830584.jpg",
      "title": "Maggoty Wood Gawsworth by Peter Turner, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Maggoty Wood Gawsworth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Clouds_above_The_Cloud_-_geograph.org.uk_-_2447097.jpg/512px-Clouds_above_The_Cloud_-_geograph.org.uk_-_2447097.jpg",
      "title": "Clouds above The Cloud by Michael Fox, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clouds above The Cloud. View to Bosley cloud from just south of the hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Old_Rectory.jpg/512px-Old_Rectory.jpg",
      "title": "Peter I. Vardy, CC0, via Wikimedia Commons",
      "caption": "Old Rectory. Grade I listed building built in 1470. It is considered to be an exceptionally fine example of a tudor timber-framed house."
    }
  ],
  "distance_km": 11.0,
  "description": "This Cheshire based village includes three significant houses with some nice countryside footpaths to try as well. Gawsworth is located just a few miles south west of Macclesfield and is well worth a visit if you are in the area. Gawsworth Old Hall, Gawsworth New Hall and Gawsworth Old Rectory are all historic listed buildings to see in the small settlement. The old hall is a black and white Tudor manor house dating back to the 15th century. During the summer it is open to the public on certain days so you can tour the beautiful gardens and the house with its paintings, sculpture and stained glass. This circular walk from the village takes you south to visit North Rode before linking up with the Macclesfield Canal. The canal lies just to the east of the settlement and includes nice easy trails along the towpath. The walk also passes very close to Sutton Reservoir and Danes Moss Nature Reserve. The reservoir is another nice place for a waterside stroll while the reserve has some pleasant boardwalks taking you over lowland raised bog. It's an interesting area with some rare flora and fauna to see. You can find the reserve just a short walk north east from the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Gawsworth Old Hall has a delightful tea room selling a good range of meals and snacks. If you fancy a pub lunch head to the Harrington Arms in the village. The pub is another historic local building dating to 1710. It retains many of the original features, including open fires, low beams and beautiful tiled floors. The pub is also a CAMRA Heritage site, one of the few remaining in the country. They serve fine dishes utilising the best local produce and have a pleasant outdoor area to relax in on warmer days. You can find them on Church Lane at postcode SK11 9RJ for your sat navs. The pub is dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gHtFN-Na6AI",
  "postcode": "SK11 9RJ",
  "district": "Gawsworth",
  "county": "Cheshire East",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}