{
  "created_at": "2025-01-06T10:23:38.347286+00:00",
  "objectID": "92bcfddce26cc8f583a87c02d820e25f",
  "ref": "burbage-walking-route",
  "title": "Burbage Wiltshire Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/71/Wolfhall_Manor%2C_Burbage%2C_Marlborough%2C_Wiltshire_-_geograph.org.uk_-_4393275.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/92bcfddce26cc8f583a87c02d820e25f.gpx",
  "_geoloc": {
    "lat": 51.352344504,
    "lng": -1.6676270403
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Wolfhall_Manor%2C_Burbage%2C_Marlborough%2C_Wiltshire_-_geograph.org.uk_-_4393275.jpg",
      "title": "Wolfhall Manor, Burbage, Marlborough, Wiltshire by Brian Robert Marshall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wolfhall Manor, Burbage, Marlborough, Wiltshire. The parish includes the hamlets of Durley, Eastcourt, Marr Green, Ram Alley, Stibb Green, The Warren (which is close to Tottenham House), and Westcourt."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Burbage_Wharf_-_geograph.org.uk_-_4735338.jpg/512px-Burbage_Wharf_-_geograph.org.uk_-_4735338.jpg",
      "title": "Burbage Wharf by Wayland Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Burbage Wharf. The Kennet and Avon Canal, a historic waterway completed in 1810, intersects the parish just north of Burbage village, traversing the Bruce Tunnel in the process. Burbage Wharf, located further west, was a vital point where the canal passed beneath the present-day A346 road. In the 1860s, the Great Western Railway's Berks and Hants Extension Railway, linking Hungerford to Devizes, was constructed in close proximity to the canal. Over time, this railway line became integral to the main line connecting London Paddington to Plymouth, officially designated in 1906. Savernake Low Level station, situated north of the village above the canal tunnel, was established by the GWR; although British Railways ceased operations there in 1966, the line remains active. Additionally, until 1947, Burbage Wharf accommodated a goods-only railway station. Another significant railway addition was the Midland and South Western Junction Railway, inaugurated in 1882, with a station named Grafton and Burbage located in nearby West Grafton. This railway line formed part of a broader network connecting Southampton Central to Cheltenham and the Midlands. Despite its importance, British Railways ceased operations on this line in 1961."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Thatched_cottages%2C_Burbage_-_geograph.org.uk_-_4393269.jpg",
      "title": "Thatched cottages, Burbage by Robin Webster, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Thatched cottages. Burbage is strategically located on a watershed at the eastern extremity of the Vale of Pewsey. Its geographical position sees streams flowing eastwards, eventually joining the Thames via the Dun and Kennet rivers. To the south, streams drain into the Salisbury Avon via the River Bourne. Conversely, those to the north and west directly feed into the Avon. The village's historical significance is underscored by its location along the former main north–south road from Marlborough to Andover, now represented by the A346 primary route. However, in 1991, a bypass was constructed to the west, diverting traffic away from the village. Another route, connecting Pewsey to Hungerford and the M4, skirts the southern edge of Burbage, designated as A338 to the east and B3087 to the west. Although Burbage once had a railway station on the Reading to Taunton line, it no longer operates. Presently, commuters rely on stations at Great Bedwyn (offering services to London) and Pewsey. Nestled amidst the picturesque landscapes of the North Wessex Downs, Burbage finds itself situated within a designated Area of Outstanding Natural Beauty, providing residents and visitors alike with scenic vistas and abundant natural attractions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Pasture%2C_Burbage_-_geograph.org.uk_-_4373291.jpg",
      "title": "Pasture, Burbage by Andrew Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pasture. The population of Burbage reached its peak of approximately 1600 residents, during the railway's construction in the 1860s. However, it experienced a decline over the subsequent century, hitting a low of 1000 residents. Nevertheless, population growth has been steady since then, with Burbage reclaiming its 1860s demographic levels in the 21st century. Education in Burbage traces back to the establishment of the village's first school at Eastcourt in 1806. Rebuilt in 1856 and augmented with a separate building for younger pupils in 1861, this educational institution transitioned to county council oversight around 1906. It served students of all ages until the opening of Marlborough secondary school in 1946. The 19th-century school buildings, recognized as Grade II listed structures in 1988, ceased operations in 1989 following the inauguration of a new school, subsequently being repurposed as a private residence."
    }
  ],
  "distance_km": 1.0,
  "description": "This Wiltshire village is located near the Kennet and Avon Canal Walk in the Vale of Pewsey. It's a pleasant area for a stroll with pretty thatched cottages, an historic church and some attractive surrounding countryside. Head north east from the village and you will soon come to the canal where you can enjoy some easy walks along the towpath. Heading east will take you to Wilton where you can enjoy one of the area highlights at Wilton Windmill. Please scroll down for the full list of walks near and around Burbage. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/tNh-NAgZkvg?si=fQhE5wHya5orcYW6",
  "district": "Burbage",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}