{
  "objectID": "92f9b62c7c476188deb7dad54e2e90c4",
  "created_at": "2024-12-18T11:28:43.986735+00:00",
  "ref": "bransgore-walking-route",
  "title": "Bransgore Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Little_Cottage%2C_Hill_Lane%2C_Bransgore_-_geograph.org.uk_-_1895617.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/F1C88F65C8F1EFF1862586FD0025645B/$FILE/Bransgore.gpx",
  "_geoloc": {
    "lat": 50.7970810126,
    "lng": -1.7197492006
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Little_Cottage%2C_Hill_Lane%2C_Bransgore_-_geograph.org.uk_-_1895617.jpg",
      "title": "Little Cottage, Hill Lane, Bransgore by Peter Facey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Little Cottage, Hill Lane, Bransgore"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Track_on_Dur_Hill_Down%2C_New_Forest_-_geograph.org.uk_-_502693.jpg",
      "title": "Jim Champion / Track on Dur Hill Down, New Forest",
      "caption": "Track on Dur Hill Down, New Forest This track leads down from Dur Hill Inclosure to the Burley-Bransgore road. The tree on the left is some kind of willow, showing that the soil here is suitably damp. This is presumably why the track is hard - it is the main route for timber vehicles leaving the Dur Hill Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Track_from_Dur_Hill_Inclosure%2C_New_Forest_-_geograph.org.uk_-_501452.jpg",
      "title": "Jim Champion / Track from Dur Hill Inclosure, New Forest",
      "caption": "Track from Dur Hill Inclosure, New Forest. This track leads down to the Burley-Bransgore road from Dur Hill Inclosure. The inclosure was created in 1962, and presumably this hard track was made at the same time. It is the only access route for the extraction of harvested timber from the inclosure, and from Kingston Great Common to the north of the dismantled railway line. The body of water in Whitten Bottom below is called Whitten Pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Cleared_area_in_the_west_of_the_Dur_Hill_Inclosure%2C_New_Forest_-_geograph.org.uk_-_501339.jpg",
      "title": "Jim Champion / Cleared area in the west of the Dur Hill Inclosure, New Forest",
      "caption": "Cleared area in the west of the Dur Hill Inclosure. The pines from this western strip of the Dur Hill Inclosure have been harvested and the ground has been left to revert to its former heathy state. Many small pine saplings have sprung up, not surprising considering the number of pine cones on the ground. If this area is to be managed as heathland then human intervention will be needed to remove the saplings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Kingston_Great_Common_NNR_-_geograph.org.uk_-_502661.jpg",
      "title": "Jim Champion / Kingston Great Common NNR",
      "caption": "Kingston Great Common NNR. Everything beyond the fence and boundary stone in the foreground is Kingston Great Common National Nature Reserve, a strip of heath and mire immediately to the west of the New Forest. A few self-sown pines have sprung up, offspring of the pines in the plantations on other parts of Kingston Great Common. The bright green region, illuminated by direct sunlight, is the mire that drains the New Forest bog complexes of Cranes Moor and Vales Moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Ponies_on_Vereley_Hill%2C_New_Forest_-_geograph.org.uk_-_495937.jpg",
      "title": "Jim Champion / Ponies on Vereley Hill, New Forest",
      "caption": "Ponies on Vereley Hill. These are a few of a much larger social gathering of ponies on the heathland plateau on Vereley Hill. The ground has been cleared recently by burning, and the regrowth has been kept low by heavy grazing pressure from ponies and cattle. In some places in the New Forest area (e.g. the Bramshaw Commons) the grazing pressure is so intense that heather has been eliminated from the heathland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Heathland_view_over_Broad_Bottom%2C_New_Forest_-_geograph.org.uk_-_497335.jpg",
      "title": "Jim Champion / Heathland view over Broad Bottom, New Forest",
      "caption": "Heathland view over Broad Bottom. The broad valley in the middle distance is, appropriately enough, Broad Bottom, with the sandy undulations of Vales Moor to the right (which, appropriately enough, has a lot of small valleys). In the foreground, on the edge of Vereley Hill plateau, bell heather is blooming purple. Some ponies are grazing in the mire below. In the far distance (on the left) is Castle Hill near Burley Street, and in the very far hazy distance (to the right) is what might be Town Common near Christchurch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Ridley_Bottom_and_Ridley_Wood_seen_from_Picket_Plain_-_geograph.org.uk_-_178744.jpg",
      "title": "Peter Facey / Ridley Bottom & Ridley Wood seen from Picket Plain",
      "caption": "Ridley Bottom & Ridley Wood seen from Picket Plain. On a path running from Picket Plain over a ford and into Ridley Wood. Ridley Bottom is the sunlit valley. Little Wood on horizon left. There is a panoramic view across Foulford Bottom from here."
    }
  ],
  "distance_km": 11.4,
  "description": "This picturesque New Forest village is close to some fine trails, a national nature reserve and some notable park viewpoints. There's also some quaint cottages and a nice old thatched inn for refreshments. This walk from the village visits the Dur Hill Inclosure, Kingston Great Common National Nature Reserve and the viewpoints at Vereley Hill and Picket Plain. There's great views from the high points and lots of ponies and horses to see on the way too. The walk starts at Thorney Hill just to the north east of the village. From here you can pick up a trail heading north west to the Dur Hill Inclosure. Follow the trails north and they will take you into the Kingston Great Common National Nature Reserve where there's lots of wildlife to look out for. Head north through the reserve and you'll pass Burnt Axon, Church Moor, Castle Hill Fort, Little Castle Common and Vereley Hill before coming to the viewpoint at Picket Plain. There's splendid views over the area from this elevated position which is over 300 feet above sea level.",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}