{
  "created_at": "2025-01-06T01:04:25.291402+00:00",
  "objectID": "93090c63f677a76d3542e08fd8b161bb",
  "ref": "newcastle-under-lyme-walking-route",
  "title": "Walks in Newcastle Under Lyme Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Lyme_Brook_from_the_A500_%28geograph_5002718%29.jpg/512px-Lyme_Brook_from_the_A500_%28geograph_5002718%29.jpg",
  "nearby": [
    {
      "description": "Apedale Country Park",
      "objectID": "22545983cbb451e8bda9890cb938422a",
      "ref": "apedale-country-park-walking-route"
    },
    {
      "description": "Silverdale Country Park",
      "objectID": "fe04265eb3813aa7d306dff666c486dd",
      "ref": "silverdale-country-park-walking-and-cycle-route"
    },
    {
      "description": "Newcastle Way",
      "objectID": "1f70ff0d4d1248d6e3451d08a65d4789",
      "ref": "newcastle-way-walking-route"
    },
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Westport Lake",
      "objectID": "7aa8cae506a10a3e16499d669a2672e7",
      "ref": "westport-lake-walking-route"
    },
    {
      "description": "Stoke on Trent Canal Walk",
      "objectID": "f2115d2d09b66edcd3f74ad3b3505853",
      "ref": "stoke-on-trent-canal-walk-walking-route"
    },
    {
      "description": "Keele",
      "objectID": "c760804168f31a33be8a8c16813db687",
      "ref": "keele-walking-route"
    },
    {
      "description": "Trentham Gardens",
      "objectID": "24470142f39df7da552e64decb739282",
      "ref": "trentham-gardens-walking-route"
    },
    {
      "description": "Maer Hills",
      "objectID": "be288ddf68bda49a3e8909052cdde117",
      "ref": "maer-hills-walking-route"
    },
    {
      "description": "Bathpool Park",
      "objectID": "0bcb8b0080a391ef2dedae9eeb0658d1",
      "ref": "bathpool-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/93090c63f677a76d3542e08fd8b161bb.gpx",
  "_geoloc": {
    "lat": 53.0165579749,
    "lng": -2.227427888
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Lyme_Brook_from_the_A500_%28geograph_5002718%29.jpg/512px-Lyme_Brook_from_the_A500_%28geograph_5002718%29.jpg",
      "title": "Jonathan Hutchins / Lyme Brook from the A500",
      "caption": "Lyme Brook from the A500"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Footbridge_over_Lyme_Brook_-_geograph.org.uk_-_394417.jpg",
      "title": "Steve Lewin / Footbridge over Lyme Brook",
      "caption": "Footbridge over Lyme Brook There are quite a number of small streams round this area, all known locally as Lyme Brook. Most of them disappear underground fairly often so I suppose it is just possible that they are all the same stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Newcastle_Way_at_Apedale_Country_Park_-_geograph.org.uk_-_394454.jpg",
      "title": "Steve Lewin / Newcastle Way at Apedale Country Park",
      "caption": "Newcastle Way at Apedale Country Park. This is the entrance the car park off Black Bank Rd in the south east of Apedale Country Park. The Newcastle Way long distance walk passes through the park on its way from Mow Cop in the north to Market Drayton in the south.In the distance is Chesterton Industrial Area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Chesterton_School_From_Apedale_Country_Park_-_geograph.org.uk_-_565816.jpg",
      "title": "Richard Styles / Chesterton School From Apedale Country Park",
      "caption": "Chesterton School From Apedale Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Apedale_Country_Park_near_Newcastle_under_Lyme_-_geograph.org.uk_-_272572.jpg",
      "title": "Pete Greatbatch / Apedale Country Park near Newcastle under Lyme",
      "caption": "Apedale Country Park near Newcastle under Lyme. Pit head wheel and coal tub memorial to the miners of North Staffordshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Ironmarket%2C_Newcastle-Under-Lyme_-_geograph.org.uk_-_2101001.jpg",
      "title": "Derek Harper / Ironmarket, Newcastle-Under-Lyme",
      "caption": "Ironmarket, Newcastle-Under-Lyme, near to Newcastle-Under-Lyme, Staffordshire, Great Britain. Shops on the north side of the pedestrianised street. The building beyond Caffe Java, occupied by Venue clothing, is listed - the shop front and 1800 facade hide a C17 interior"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Red_Lion_Square%2C_Newcastle-Under-Lyme_-_geograph.org.uk_-_2101410.jpg",
      "title": "Derek Harper / Red Lion Square, Newcastle-Under-Lyme",
      "caption": "Red Lion Square, Newcastle-Under-Lyme, near to Newcastle-Under-Lyme, Staffordshire, Great Britain. The north corner of the square, with the end of Church Street to the left, and High Street contuing round the corner to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Liverpool_Road%2C_Newcastle-Under-Lyme_-_geograph.org.uk_-_2101271.jpg",
      "title": "Derek Harper / Liverpool Road, Newcastle-Under-Lyme",
      "caption": "Liverpool Road, Newcastle-Under-Lyme, near to Newcastle-Under-Lyme, Staffordshire, Great Britain. The junction with Bridge Street (left). The gabled building with the timber-effect facade is the Full Moon pub."
    }
  ],
  "distance_km": 8.8,
  "description": "The Staffordshire based town of Newcastle Under Lyme is well known for a number of attractive parks and gardens. It has done consistently well in the Royal Horticultural Society Britain in Bloom competition. There's lovely walks to be found in the Queen's Gardens at the eastern end of Ironmarket and also along the Lyme Brook in Lyme Valley Parkway to the south of the town centre. It's also well known for its market which takes place six days a week on the High Street. This walk from the town takes you along the Lyme Brook to the nearby Apedale Country Park. It's a pretty area with nice waterside paths and easy woodland trails in the park. The walk starts in the town centre and follows footpaths north west out of the town. The trails take you along the Lyme Brook to the Chesterton Stadium and then into Apedale Park. The park is a nice area for a stroll with a number of well maintained footpaths taking you to open meadows, secluded woodland glades and silent pools.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town head to The Lymestone Vaults for some refreshments after your walk. The pub has Lymestone award-winning cask ales on tap and a good menu. Inside there's a cosy log burning stove and there's also an outdoor area. The pub won Bronze in the Pub of the Year category at the Enjoy Staffordshire Tourism Awards 2019. You can find the pub on Pepper St, at postcode ST5 1PR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking with some fine woodland trails in the park to enjoy. The Lymestone Vaults mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head to the nearby Silverdale Country Park. Here there are more nice trails with a wildlife pond, farm meadows, wilidlife conservation areas and woodland areas. The long distance Newcastle Way also passes through the area. You can pick up the trail in Apedale Park and follow it north to Kidsgrove where you can pick up the Trent and Mersey Canal. If you follow the waymarked trail south west it will take you to some rich farming country near Madeley and the woodland of the Maer Hills. In the neighboring city of Stoke you can try the Stoke on Trent Canal Walk. Just to the east of Stoke there's some nice cycling and walking trails around Park Hall Country Park. The former quarry site is now notable as Stoke on Trent's only National Nature Reserve comprising woodland, heathland and ponds. Just south of the town there's the worthy village of Keele. Here you can explore the lovely campus of Keele University which includes an arboretum, lakes and gardens. It's well laid out with several colour coded footpaths to try. Just to the north there's the lovely Bathpool Park where you'll find more waterside trails around a pretty reservoir. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "postcode": "ST5 0SR",
  "district": "Newcastle-under-Lyme",
  "county": "Staffordshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}