{
  "created_at": "2025-01-06T11:01:02.041505+00:00",
  "objectID": "9335e863f89a2f25f59ef62de10bb9cb",
  "ref": "house-of-dun-walking-route",
  "title": "House of Dun Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/81/The_Gardens_of_the_House_of_Dun_-_geograph.org.uk_-_951774.jpg",
  "nearby": [
    {
      "description": "Montrose Basin",
      "objectID": "b6f59e1825a36e2fbfd5c646390b3a7b",
      "ref": "montrose-basin-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9335e863f89a2f25f59ef62de10bb9cb.gpx",
  "_geoloc": {
    "lat": 56.7300066158,
    "lng": -2.5465707532
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/The_Gardens_of_the_House_of_Dun_-_geograph.org.uk_-_951774.jpg",
      "title": "Sarah Charlesworth / The Gardens of the House of Dun",
      "caption": "The Gardens of the House of Dun. You can explore the lovely walled garden, featuring a beautiful rose bower at its centre, restored to Lady Augusta's original design from the 1840s. Enjoy the fragrant roses, peonies, violas, and lupins in spring and summer. Walk along the south terrace for stunning views of the Montrose Basin and beyond. Lady Augusta added the stone steps, pillars, yew hedges, and parterre, while the urns on the pillars are modern. Admire the espaliers of pears and Scottish apple varieties on the walls. The 1723 sundial on the lawn is older than the house. Don't miss the towering wellingtonias planted over 160 years ago, among the first in the UK."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/House_of_Dun_-_geograph.org.uk_-_951773.jpg",
      "title": "Sarah Charlesworth, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "House of Dun. Commissioned by David Erskine, the 13th Laird of Dun, and crafted in the Palladian architectural style by esteemed architect William Adam, the House of Dun stands as an exemplary Georgian mansion. Construction commenced in 1730, spanning over 13 years to reach completion, showcasing meticulous attention to detail and style evident even in the minutest features. The remarkable plasterwork, executed by Joseph Enzer, commands attention within the main Saloon of the house. Adorned with classical scenes and family emblems, it serves to elevate the significance of the Erskine family for visiting guests. Throughout the premises, the elegant family furnishings are complemented by the exquisite embroidery and woolwork of Lady Augusta Fitzclarence, the daughter of William IV and actress Dorothy Jordan. Delve into captivating family narratives narrated by our costumed guides, bringing their stories vividly to life. Venturing downstairs, visitors can immerse themselves in the ambiance of a Georgian kitchen, complete with the evocative sounds and aromas of the era. Witness the household's pioneering technological advancements, including the labour-saving clockwork spit. Isabella, the cook, extends a warm welcome, inviting guests to explore and offering insights into the lives of the household staff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Courtyard_service_entrance_to_the_House_of_Dun_-_geograph.org.uk_-_1440767.jpg",
      "title": "C Michael Hogan / Courtyard service entrance to the House of Dun",
      "caption": "Courtyard service entrance to the House of Dun"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/House_of_Dun_NTS_near_Montrose_-_enclosed_gardens_-_geograph.org.uk_-_5231739.jpg/512px-House_of_Dun_NTS_near_Montrose_-_enclosed_gardens_-_geograph.org.uk_-_5231739.jpg",
      "title": "House of Dun NTS near Montrose - enclosed gardens by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "House of Dun NTS near Montrose"
    }
  ],
  "distance_km": 1.2,
  "description": "Enjoy a stroll around the beautiful grounds of this historic estate in Angus. The fine Georgian house is surrounded by some stunning gardens and woodland where you can look out for red squirrels and other wildlife. Walking highlights include Lady Augusta’s Walk, which traverses the Den of Dun, a narrow gorge situated in the western section of the estate. Along the way, visitors will encounter cascading waterfalls amidst well-established woodland adorned with rhododendrons and azaleas, creating a vibrant spectacle during the spring season. Upon reaching the west walled garden, remnants of the original Dun Castle and the family mausoleum await exploration. Dating back to the 14th century, the castle succumbed to destruction during the 17th-century Civil War. Subsequently, this area transitioned into a thriving kitchen garden supporting the main residence. Look out for wildlife sightings – roe deer, otters, and red squirrels occasionally grace the surroundings, alongside woodland birds such as treecreepers, woodpeckers, and yellowhammers. Continuing the woodland trek beneath the road bridge leads to Fordhouse Barrow, an ancient burial mound, before circling back to the residence. This site, during the Neolithic era circa 4000BC, served as a religious site. Inhabitants constructed a lengthy barrow – a substantial rectangular mound formed with wooden posts and earth – where they interred their deceased within the mound or perhaps laid them atop it. You can continue your walking around the Montrose Basin where there is a nature reserve with a huge variety of wildlife.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/APCl3ZgWiWc?si=6oI26rLQR2UR8aZq",
  "county": "Angus",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dun, Bridge of Dun, Angus, Alba / Scotland, DD10 9LW, United Kingdom",
  "postcode": "DD10 9LW",
  "district": "Bridge of Dun",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "garden",
    "historical"
  ],
  "points_of_interest": [
    "historical sites",
    "wildlife sightings",
    "ancient burial mound"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}