{
  "created_at": "2025-01-06T03:07:22.645882+00:00",
  "objectID": "9347b9cce58fdc011d690567f18ff44d",
  "ref": "frome-valley-walkway-walking-route",
  "title": "Frome Valley Walkway Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Snuff_Mills_restored_mill.jpg/512px-Snuff_Mills_restored_mill.jpg",
  "nearby": [
    {
      "description": "Yate",
      "objectID": "d6fdee7d526619bee0a4f3585034396c",
      "ref": "yate-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Snuff Mills",
      "objectID": "14cbb2432a1ab435290e4bf585d4eb41",
      "ref": "snuff-mills-walking-route"
    },
    {
      "description": "Winterbourne",
      "objectID": "ab2c233ccd2dcd7e140ef86f69ef3f28",
      "ref": "winterbourne-walking-route"
    },
    {
      "description": "Iron Acton",
      "objectID": "f57417de92cefae84a687b695671bf43",
      "ref": "iron-acton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9347b9cce58fdc011d690567f18ff44d.gpx",
  "_geoloc": {
    "lat": 51.4761966955,
    "lng": -2.5536884481
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Snuff_Mills_restored_mill.jpg/512px-Snuff_Mills_restored_mill.jpg",
      "title": "William Avery, CC BY-SA 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>, via Wikimedia Commons",
      "caption": "Snuff Mills restored mill just east of Bristol and next to the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/River_Frome_footbridge.jpg/512px-River_Frome_footbridge.jpg",
      "title": "William Avery, CC BY-SA 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>, via Wikimedia Commons",
      "caption": "Footbridge over the River Frome near Snuff Mills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Oldbury_Court_Estate%2C_Winter_2010._-_panoramio.jpg/512px-Oldbury_Court_Estate%2C_Winter_2010._-_panoramio.jpg",
      "title": "Robert Powell, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Oldbury Court Estate, Winter 2010."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/River_Frome_below_Frenchay_-_geograph.org.uk_-_1216832.jpg",
      "title": "Paul Harvey / River Frome below Frenchay",
      "caption": "River Frome below Frenchay. In the distance can be seen the flow meter for flood control when water levels are high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Damsons_Bridge_Winterbourne_Down_%28geograph_4302812%29.jpg/512px-Damsons_Bridge_Winterbourne_Down_%28geograph_4302812%29.jpg",
      "title": "Steve Coffin / Damsons Bridge Winterbourne Down",
      "caption": "Damsons Bridge Winterbourne Down. The trail passes through the little village and provides views of the Huckford Viaduct. The impressive viaduct spans the River Frome just north of Winterbourne Down. It was was constructed during 1902 by the Great Western Railway as part of the Wootton Bassett to Patchway railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Welcome_to_Oldbury_Court_Estate%2C_Frenchay_%28geograph_3977869%29.jpg",
      "title": "Jaggery / Welcome to Oldbury Court Estate, Frenchay",
      "caption": "Welcome to Oldbury Court Estate, Frenchay. The estate was originally an old hunting lodge within the Royal Forest of Kingswood. You could leave the path near here to explore Frenchay village which includes a lovely large village common overlooked by a number of 18th-century houses built by wealthy Quaker families. Sporting buffs will be interested in the common as it used to be the home of the historic Frenchay Cricket Club. This was captained by W.G. Grace, the famous Victorian cricketer who also captained England and Gloucestershire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Frampton_Cotterell_-_geograph.org.uk_-_32978.jpg",
      "title": "Chris Shaw / Frampton Cotterell",
      "caption": "Frampton Cotterell. Frampton Cotterell. The Globe pub and Frampton Cotterell parish church sit inside the extreme Southern edge of the square near to the river Frome"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Chipping_Sodbury%2C_Broad_Street_-_geograph.org.uk_-_1415590.jpg",
      "title": "Colin Smith / Chipping Sodbury, Broad Street",
      "caption": "Chipping Sodbury, Broad Street. The former market place is a long and wide street lined by many pubs and shops. Chipping comes from the Old English for market."
    }
  ],
  "distance_km": 29.0,
  "description": "This pleasant and fairly easy walk takes you from Eastville Park on the outskirts of Bristol to the village of Old Sodbury along the River Frome. The route starts passing through the parks and woodlands around Bristol before entering the open countryside of Gloucestershire. You will pass through Frampton Cotterell, Chipping Sodbury and Yate with the Cotswold Hills providing a splendid backdrop for the route. For an excellent full guide to this walk please click here .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The market town of Chipping Sodbury is a nice place to stop for some refreshments on the route. The Horseshoe is a friendly place with a great atmosphere and a nice little garden for warmer days. It has some history too, being set in a wonderful building dating back to the 15th century. They are nicely located on the High Street at postcode BS37 6AH for your sat navs. Just up the road there's The Royal Oak. The 17th century inn does fine home cooked food in the restaurant. You can find them on Broad Street at postcode BS37 6AG. The town itself is worth taking a detour from the route to explore. There's a series of fine looking 17th century stone cottages to see on the attractive Broad Street. At Oldbury Court near the start there's a café kiosk. The pretty park is a nice place to stop and enjoy a snack before heading onwards. In Iron Acton there's The Lamb Inn to consider. The inn has some historical signficance as a former coaching house dating from 1690. It is also claimed that William of Orange once stayed here. They serve good quality food and also have a nice garden area with a children's swing, a stream and a covered verandah. You can find them at Wotton Road with postcode BS37 9UZ. They are dog friendly and also have car parking. The village also has a nice garden centre where you could visit the on site cafe. It's a lovely place for a stroll and a bite to eat in the village. You can find them near the pub at postcode BS37 9XA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is a nice one to do with your dog. They will enjoy the waterside and woodland sections on the route. The Royal Oak pub in Chipping Sodbury is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route runs for about 18 miles on a path that rises steadily from Bristol to Old Sodbury. If you'd like an easier walk you could start in Old Sodbury and then gently descend into Bristol. Near the start of the walk you'll pass the noteworthy Snuff Mills near the historic village of Winterbourne. This pleasant park includes an old mill which was used for cutting and crushing stone from the sereies of quarries in the Frome Valley during the late 19th century. The area is also great for wildlife watching with otters seen in the river and various birds in the peaceful surrounding woodland. Adjacent to the mill is the Oldbury Court Estate. You could take a small detour from the path to explore the estate which includes some nice parkland trails. Just to the south of the trail you can pick up the Bristol and Bath Railway Path. This shared cycling and walking trail runs along a disused railway line between the two cities. When in the centre of Bristol you could pick up the River Avon Trail for more riverside walking through the area. At the other end of the route the trail links with the epic Cotswold Way National Trail. For more walking ideas see the Cotswolds Walks and Gloucestershire Walks pages."
    }
  ],
  "district": "Bristol",
  "county": "City of Bristol",
  "region": "West of England",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Fishponds Road, Greenbank, Eastville, Bristol, City of Bristol, West of England, England, BS5 6FF, United Kingdom",
  "postcode": "BS5 6FF",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "countryside"
  ],
  "points_of_interest": [
    "parks",
    "countryside"
  ],
  "facilities": [
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}