{
  "created_at": "2025-01-06T01:02:00.882673+00:00",
  "objectID": "938402ee0496b74c4b98a5e2e0327498",
  "ref": "castle-crag-walking-route",
  "title": "Castle Crag Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Castle_Crag_-_geograph.org.uk_-_761648.jpg",
  "nearby": [
    {
      "description": "Borrowdale",
      "objectID": "30459903103ffc9158473880383cb5e0",
      "ref": "borrowdale-walking-route"
    },
    {
      "description": "Catbells",
      "objectID": "a6b9c91df4606d2f6994b45a02d7ca90",
      "ref": "catbells-walking-route"
    },
    {
      "description": "Derwent Water",
      "objectID": "985a4a278a6fa78df33209bb1df4af97",
      "ref": "derwent-water-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Allerdale Ramble",
      "objectID": "641f71c34743ce206179b03c5da3b722",
      "ref": "allerdale-ramble-walking-route"
    },
    {
      "description": "Bowder Stone",
      "objectID": "45a2169e64564b789686419fe12f5895",
      "ref": "bowder-stone-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/938402ee0496b74c4b98a5e2e0327498.gpx",
  "_geoloc": {
    "lat": 54.5469244986,
    "lng": -3.1568712939
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Castle_Crag_-_geograph.org.uk_-_761648.jpg",
      "title": "Ian Capper / Castle Crag, via Wikimedia Commons",
      "caption": "Castle Crag is on the right, with Derwent Water and Skiddaw in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/On_Castle_Crag_-_geograph.org.uk_-_3211991.jpg/512px-On_Castle_Crag_-_geograph.org.uk_-_3211991.jpg",
      "title": "On Castle Crag by Michael Graham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On Castle Crag, looking down to autumn trees"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Quarry%2C_Castle_Crag_-_geograph.org.uk_-_486642.jpg",
      "title": "Michael Graham / Quarry, Castle Crag, via Wikimedia Commons",
      "caption": "Quarry, Castle Crag. Looking to the Crags of Low Scawdel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Castle_Crag_Summit_-_geograph.org.uk_-_1514818.jpg",
      "title": "Shaun Ferguson / Castle Crag Summit, via Wikimedia Commons",
      "caption": "Castle Crag Summit with cairn above rock mounted war memorial. The summit area is also believed to have been an ancient hill fort."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Cairn_on_the_Spoil_Heap%2C_Castle_Crag_-_geograph.org.uk_-_5340446.jpg/512px-Cairn_on_the_Spoil_Heap%2C_Castle_Crag_-_geograph.org.uk_-_5340446.jpg",
      "title": "Cairn on the Spoil Heap, Castle Crag by Anthony Foster, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cairn on the Spoil Heap"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/View_to_Borrowdale_fells_from_Castle_Crag_-_geograph.org.uk_-_361480.jpg",
      "title": "lis blamire / View to Borrowdale fells from Castle Crag",
      "caption": "View to Borrowdale fells from Castle Crag"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Slate_Sculpture_Park_on_Castle_Crag_-_geograph.org.uk_-_1028130.jpg",
      "title": "Trevor Harris / Slate Sculpture Park on Castle Crag",
      "caption": "Slate Sculpture Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Derwent_Water_and_Skiddaw_from_Castle_Crag_-_panoramio.jpg/256px-Derwent_Water_and_Skiddaw_from_Castle_Crag_-_panoramio.jpg",
      "title": "SteveMi, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Derwent Water and Skiddaw from Castle Crag"
    }
  ],
  "distance_km": 5.0,
  "description": "Castle Crag is the smallest hill included in Alfred Wainwright's Pictorial Guide to the Lakeland Fells. It stands at 290 m (950 ft) in the beautiful Borrowdale area of the Lake District. This walk begins at the pretty village of Grange and makes use of the Cumbria Way and the Allerdale Ramble to take you along the River Derwent before ascending Castle Crag. At the summit you will find a circular cairn of slate and a memorial to Borrowdale men killed in World War I. The views of Derwent Water and Borrowdale are truly wonderful. The climb can also be started from nearby Rosthwaite. If you wanted to continue your walk you could follow the Cumbria Way north to the beautiful Derwent Water and enjoy a lakeside stroll. Another popular fell is the nearby Catbells which gives faboulous views across Derwent Water.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Borrowdale Gates Hotel is conveniently located just to the north of the crag in Grange. The hotel is in a lovely spot and includes a terrace and some pretty gardens with fine views of the surrounding fells. During the colder months, open log fires are lit in the lounges all day, providing warmth and cosiness for reading and drinks. The restaurant is open to non residents and includes panoramic windows offering captivating fell views to complement the imaginative menu. It's a fine place to enjoy a meal and then stroll around the pretty gardens surrounding the hotel. You can find the Borrowdale Gates in Grange at postcode CA12 5UQ. The Glaramara House hotel in Seatoller is in a stunning location, just south west of Rosthwaite. There's wonderful views of the Borrowdale Fells from the lovely outdoor seating area in the spacious grounds. It's the perfect place to relax after a long walk on a warm day. Indoors there's a cosy resident’s lounge with a log fire and a spacious bar. They do very good food and also provide top quality accommodation if you need to stay over. You can find the hotel just to the east of the National trust car park on the Honister Pass at postcode CA12 5XQ. From here you can also enjoy a climb to Thornythwaite Fell and Glaramara mountain. You could also head north to Derwentwater and visit the delightful Lingholm Kitchen. It's a major local attraction and worth some investigation if you have time after your walk. The splendid cafe also includes the Kitchen gardens which Beatrix Potter credited as her inspiration for Mr McGregor’s garden in The Tale of Peter Rabbit. The Victorian style garden has herbaceous borders while it’s central areas are for vegetable production that is then served fresh daily in the Kitchen. Within the walled garden there is the splendid bonus of an outdoor gallery dedicated to Beatrix Potter’s work in the Derwentwater area, much of it undertaken whilst she stayed at Lingholm. The gallery takes a journey through her years at Lingholm and the Northern Lakes and how she wrote and illustrated some of her best known stories here. From the kitchen there are tremendous views towards the surrounding mountains. It's a lovely place to get a bite to eat and then enjoy a little stroll around the gardens afterwards. Also on the estate is an Alpaca Farm where you can take part in feeding time and ask the keepers all about these beautiful animals."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Located just to the east of the hill is the National Trust's Bowder Stone. The giant stone makes a worthy extension to the walk, standing at a height of about 30 feet (9.1 m) high and weighing around 2000 tons. There is a 19th century staircase which you can climb to the top. From there you can enjoy more fine views over the area. The stone is located about a quarter of mile to the east of the crag, on the other side of the River Derwent. Near the Lingolhm Estate you'll also find another noteworthy site at Brandlehow Park, considered the birthplace of the National Trust. The lakeside park has some interesting wooden sculptures including the cupped hands (below) which commemorates the centenary of the National Trust's first ever land purchase, 108 acres of the Brandlehow estate. Octavia Hill, one of the founders of the Trust, planted a tree at the official opening of Brandelhow to the public in October 1902. It's another very pleasant place for a stroll, with peaceful woodland paths and lots of interesting flora and fauna. Look out for kingfishers, woodpeckers, nuthatches, roe deer, red squirrels and, if you're very lucky, perhaps even an otter.  Above: The wooden sculptures in Brandlehow Park. You will often see children climbing on them!"
    }
  ],
  "video_url": "https://www.youtube.com/embed/tNBSfsMHOv4",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grange Coffee, Field Lane, Manesty, Grange, Borrowdale, Cumberland, England, CA12 5UQ, United Kingdom",
  "postcode": "CA12 5UQ",
  "district": "Grange",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "river"
  ],
  "points_of_interest": [
    "views",
    "memorial"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}