{
  "created_at": "2025-01-06T04:29:57.700622+00:00",
  "objectID": "9430ef819c9cfcf583a63e85842df3a7",
  "ref": "albrighton-walking-route",
  "title": "Albrighton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Churchyard_Cross%2C_Albrighton.jpg/512px-Churchyard_Cross%2C_Albrighton.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9430ef819c9cfcf583a63e85842df3a7.gpx",
  "_geoloc": {
    "lat": 52.6377546954,
    "lng": -2.2850409795
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Churchyard_Cross%2C_Albrighton.jpg/512px-Churchyard_Cross%2C_Albrighton.jpg",
      "title": "Jaggery / Medieval churchyard cross in Albrighton",
      "caption": "Churchyard Cross, Albrighton. Stone cross in the parish churchyard of St Mary Magdalene. The parish church, dedicated to St Mary Magdalene was completed around 1181, and some rebuilding work was done in 1853. It is built of red sandstone in the Norman style."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Beckbury_Signpost_-_geograph.org.uk_-_2030283.jpg",
      "title": "Beckbury Signpost by Gordon Griffiths, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Beckbury Signpost"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Badger_Pond_and_House_-_geograph.org.uk_-_467948.jpg",
      "title": "Ian Hughes / Badger Pond & House",
      "caption": "Badger Pond and House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/A_cascade_in_Badger_Dingle_-_geograph.org.uk_-_1303004.jpg",
      "title": "Ian Slater / A cascade in Badger Dingle",
      "caption": "A cascade in Badger Dingle. In the late 18th and early 19th Century, Sir Isaac Hawkins Browne, an iron and coal magnate who owned the Badger Hall estate, hired William Emes, a pupil of Capability Brown, to create a picturesque landscape in the sandstone gorge of the Dingle. Paths were laid and the brook that runs through the Dingle was dammed to form a series of pools with a rotunda at one end and a boathouse at the other. Today most of it has gone or been overgrown but there are still two small cascades below the dammed pond. This photo shows the lower, more natural cascade, the upper one being a series of steps."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Lane_through_Burnhill_Green_-_geograph.org.uk_-_748074.jpg",
      "title": "Row17 / Lane through Burnhill Green",
      "caption": "Lane through Burnhill Green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Cedar_tree_at_Patshull_Park_-_geograph.org.uk_-_1834748.jpg/512px-Cedar_tree_at_Patshull_Park_-_geograph.org.uk_-_1834748.jpg",
      "title": "Cedar tree at Patshull Park by Richard Law, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cedar tree at Patshull Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/The_western_arm_of_Church_Pool_-_geograph.org.uk_-_1835307.jpg",
      "title": "The western arm of Church Pool by Richard Law, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The western arm of Church Pool at Patshull Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Donington_and_Albrighton_Nature_Reserve_03.jpg/512px-Donington_and_Albrighton_Nature_Reserve_03.jpg",
      "title": "The joy of all things, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Humphreston Brook flowing through Donington and Albrighton Nature Reserve"
    }
  ],
  "distance_km": 18.6,
  "description": "This large Shropshire based village is located close to Telford and Bridgnorth. It's accessible by train on the Shrewsbury to Wolverhampton Line. The settlement includes a noteworthy Norman church dating from the 12th century and the Donington and Albrighton Nature Reserve where you can look out for lots of wildlife in the village. This walk from the village takes you along a section of the Monarch's Way to visit one of the hidden gems of the area at Badger Dingle. The circular walk starts in the village near to the historic church where you'll find the Donington and Albrighton Nature Reserve. There's some nice trails here along the Humphreston Brook and the Donington Pool where you can look out for interesting pond life. From here you can pick up the Monarch's Way and follow the waymarked footpath south west towards Beckbury. Here you can follow Badger Lane south to the pretty village of Badger where there's some thatched cottages and two large village ponds. The area also includes Badger Dingle. There's a delightful little wood here with a brook, pools, sandstone outcrops and a rushing waterfall to admire. The route then heads north east to Burnhill Green before heading to Patshull Park. There's two large lakes here and a hotel and country club here. The route then heads north along country lanes to Boningale before returning to Albrighton.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Also in the area is the lovely Aqualate Mere. There's a pleasant waterside path to pick up at this large, scenic lake. The site is one of the area's highlights and notable as the largest natural lake in the English Midlands. Just to the west of here there's the interesting market town of Newport where you can enjoy another waterside stroll along the old Newport Canal. The Wellington Walk starts from the historic market town which lies just north west of Telford. It visits the wonderful viewpoint at The Wrekin and The Ercall Nature Reserve where there are some striking geological features to admire. The walk start from close to the town's bus station and train station making the area accessible by public transport. The town is also well worth exploring with its historic market and the splendid Victorian house and garden at the National Trust's Sunnycroft to see. For more walking ideas in the area see the Shropshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/DN_ySG1Vvqg",
  "postcode": "WV7 3EH",
  "district": "Albrighton",
  "county": "Shropshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rectory Road, Albrighton, Shropshire, England, WV7 3EH, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "historic church",
    "nature reserve",
    "village",
    "waterfall"
  ],
  "facilities": [
    "visitor center",
    "pub/cafe",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}