{
  "created_at": "2025-01-06T03:02:56.546130+00:00",
  "objectID": "94d761967c0c3eb23216161af3fcde6d",
  "ref": "byland-abbey-walking-route",
  "title": "Byland Abbey Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Byland_Abbey_-_panoramio.jpg/512px-Byland_Abbey_-_panoramio.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/94d761967c0c3eb23216161af3fcde6d.gpx",
  "_geoloc": {
    "lat": 54.2036653444,
    "lng": -1.1577949571
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Byland_Abbey_-_panoramio.jpg/512px-Byland_Abbey_-_panoramio.jpg",
      "title": "Keith Ruffles [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Byland Abbey 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Byland_Abbey_MMB_17.jpg/512px-Byland_Abbey_MMB_17.jpg",
      "title": "By mattbuck (category) [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0) or CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], from Wikimedia Commons",
      "caption": "Byland Abbey 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Near_Wass_-_geograph.org.uk_-_1077517.jpg",
      "title": "Andrew Blades / Near Wass",
      "caption": "Near Wass"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Forest_Track_Great_Cockerdale_Wood_-_geograph.org.uk_-_376737.jpg/256px-Forest_Track_Great_Cockerdale_Wood_-_geograph.org.uk_-_376737.jpg",
      "title": "colin grice [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Forest Track Great Cockerdale Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Footpath_through_Snever_Wood%2C_near_Wass_%28N_Yorks%29_-_geograph.org.uk_-_73873.jpg",
      "title": "Uncredited [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Footpath through Snever Wood, near Wass (N Yorks)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Mount_Snever_Observatory_-_geograph.org.uk_-_138830.jpg",
      "title": "Chris McLean / Mount Snever Observatory",
      "caption": "Mount Snever Observatory"
    }
  ],
  "distance_km": 7.0,
  "description": "Visit this fascinating ruined abbey before exploring the surrounding countryside of Ryedale. There's interesting history, peaceful woodland trails, moderate hill climbs and splendid North York Moors scenery to enjoy on the way. The circular walk starts at the abbey where you will find extensive ruins of the 12th century buildings. Highlights include the nave, the fine rose window, the brightly coloured medieval floor tiles and the cloister and warming house. After exploring the abbey site you head towards Wass, before following woodland trails through Abbey Bank Wood and Snever Wood to the Oldstead Observatory. The tower was built in 1838 to commemorate Queen Victoria's coronation. The route then leaves the woods, passing the village of Olstead and picking up country trails to lead you back to the abbey. After your walk you can enjoy refreshments in the lovely Stapylton Arms pub in the nearby village of Wass. The abbey is located close to the very popular Sutton Bank and the Kilburn White Horse. With fabulous views and some dramatic scenery it's a great place to extend your walking in the area. The area includes the pretty Gormire Lake which has a nice footpath around the perimeter. The circular Felixkirk Walk visits the lake and hill from the nearby village. You can also explore the Hambleton Hills by picking up the trail from the Kilburn White Horse car park.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The abbey grounds make for a pleasant dog walk though you are requested to keep them on leads in this area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head just a mile south west from the abbey and you will soon come to the pretty little village of Coxwold. The village is notable as the location where the author Laurence Sterne wrote the well known novel 'The Life and Opinions of Tristram Shandy'. You can learn about his life and works at the museum at Shandy Hall, where he wrote some of his novels. In the village you can pick up the circular Coxwold Walk which visits Newburgh Priory and Shandy Hall before heading to Byland Abbey. The priory is another historic highlight of the area dating back to 1145. The abbey grounds are a lovely place for a stroll with a water garden, hand crafted topiary, a walled garden, woodland and a large lake.  Just to the south you can pick up the circular Easingwold Walk and visit neighbouring Crayke and Oulston Reservoir. The pretty lake is a nice place for a stroll and also the source for the River Foss which runs through the area. The market town of Easingwold is also worth a visit with a number of fine Georgian buildings to see. It's well known for its excellent food and lovely old Sweet shop. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/x_HMPQiVp1c",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Byland Abbey, Oldstead Road, College Farm, Byland with Wass, York, North Yorkshire, York and North Yorkshire, England, YO61 4BD, United Kingdom",
  "postcode": "YO61 4BD",
  "district": "York",
  "state": "England"
}