{
  "created_at": "2025-01-06T01:06:52.909657+00:00",
  "objectID": "9651b3eed00756ea794edb3c629d3c94",
  "ref": "chesterton-windmill-walking-route",
  "title": "Chesterton Windmill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/08/Chesterton_Windmill_-_geograph.org.uk_-_94722.jpg",
  "nearby": [
    {
      "description": "Warwickshire Centenary Way",
      "objectID": "2d56795dfe8694c3f520e2951c450b0e",
      "ref": "warwickshire-centenary-way-walking-route"
    },
    {
      "description": "Charlecote Park",
      "objectID": "ef994cdd9275a249401562a17a00a607",
      "ref": "charlecote-park-walking-route"
    },
    {
      "description": "Southam",
      "objectID": "e61536b5f2ceb18269c712abbf0d52e2",
      "ref": "southam-walking-route"
    },
    {
      "description": "Harbury",
      "objectID": "45d43e063b6451339a67c5334dfd7aa1",
      "ref": "harbury-walking-route"
    },
    {
      "description": "Napton on the Hill",
      "objectID": "5da4a7a8328ea70cd70c8a7a22f674af",
      "ref": "napton-on-the-hill-walks"
    },
    {
      "description": "Napton Reservoir",
      "objectID": "c6450334e0feaf026f2a2a542f288072",
      "ref": "napton-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9651b3eed00756ea794edb3c629d3c94.gpx",
  "_geoloc": {
    "lat": 52.2326152091,
    "lng": -1.486892313
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Chesterton_Windmill_-_geograph.org.uk_-_94722.jpg",
      "title": "David Stowell / Chesterton Windmill",
      "caption": "The windmill seen from the south in the December of 2005. The structure is often claimed to be England's most unusual windmill since it was designed as an architectural landmark as much as a functioning mill. The current machinery dates from 1860 and was used until about 1910 before gradually becoming derelict. The mill was restored to working order between 1965 and 1971 and is now owned by Warwickshire County Council. Open days are held for members of the public to visit the mill, although these had to cancelled during the early part of 2001 when the windmill lost two of its sails in a storm. As can be seen from the picture these have now been repaired."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Chesterton_Windmill_-_geograph.org.uk_-_13057.jpg",
      "title": "Richard Webb / Chesterton Windmill",
      "caption": "Chesterton Windmill. Built in 1632, now restored. Situated in a field of oilseed rape."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/View_towards_Windmill_Hill_Farm_and_Chesterton_Windmill_-_geograph.org.uk_-_113621.jpg",
      "title": "David Stowell / View towards Windmill Hill Farm and Chesterton Windmill",
      "caption": "View towards Windmill Hill Farm and Chesterton Windmill. The view looking east from the footpath from Chesterton Green to Field Farm Cottages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Chesterton_Windmill_-_without_sails_-_geograph.org.uk_-_552254.jpg",
      "title": "David Stowell / Chesterton Windmill - without sails",
      "caption": "The windmill without sails In an unfortunate accident during an open day on September 2006 one of the sails fell off, slightly injuring a woman standing nearby. The rest of the sails have since been removed for investigation and repair."
    }
  ],
  "distance_km": 1.0,
  "description": "This walk visits a 17th century windmill near Harbury in Warwickshire. The Grade I listed mill is a well known local landmark and the earliest tower mill in England to retain any of its working parts. You can start the walk from the roadside parking close the mill. It's located on Windmill Hill Lane just to the west of Harbury. From here you can directly access a footpath leading up to the windmill. It's about a half mile walk there and back, taking place on a fairly flat grassy path. The mill is in a nice position surrounded by some lovely Warwickshire countryside. There are also views to a Roman settlement in the adjacent field, to the north west of the mill.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Harbury there's the The Crown Inn on Crown Street at postcode CV33 9HE. They have a good menu and selection of ales to enjoy after your exercise. There's also the historic Shakespeare Inn, a 16th century timber framed pub on Mill Street at postcode CV33 9HR. The pub includes a nice large garden for warmer days."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into Harbury and you can pick up the Warwickshire Centenary Way to extend your walking in the area. For example you could follow it north to visit Ufton Fields where there are some ponds and a nature reserve. Just to the south of the mill there are also some public footpaths around Chesterton, where there are some fish ponds and a mill pool.A few miles to the south west you'll find Charlecote Park. The park is another lovely place for a walk with river trails along the River Avon and pretty gardens to see. You can reach the site from the nearby village of Wellesbourne on the Wellesbourne Walk. It's about a 2 mile walk from the village, running along the River Dene. You can also visit the village's historic watermill beforehand. Near here there's a similar local highlight at Compton Verney. The fine Georgian Mansion is surrounded by Capability Brown landscaped grounds with woodland, lakes, sculptures and some particularly impressive redwoods. The site also includes an award winning art gallery which is well worth a visit. The woodland trails in Oakley Wood are also easily reachable from the mill. Head north east from the mill and you will come to the attractive market town of Southam. You can try the circular Southam Walk which visits the River Stowe, the River Itchen and the Ufton Fields Nature Reserve."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Avjxlqta6FI",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Windmill Hill Lane, Chesterton Green, Chesterton and Kingston, Stratford-on-Avon, Warwickshire, England, CV33 9LB, United Kingdom",
  "postcode": "CV33 9LB",
  "district": "Stratford-on-Avon",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}