{
  "created_at": "2025-01-06T09:34:06.602744+00:00",
  "objectID": "966c6818a4ec3f1bf02a0685ddd7b65b",
  "ref": "pewsey-walking-route",
  "title": "Pewsey Canal Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/The_Kennet_and_Avon_Canal_at_Pewsey_Wharf._-_geograph.org.uk_-_187177.jpg",
  "nearby": [
    {
      "description": "Kennet and Avon Canal Walk",
      "objectID": "0c879db862142efde19b17abd060ac05",
      "ref": "kennet-and-avon-canal-walk-walking-route"
    },
    {
      "description": "Tan Hill Way",
      "objectID": "99103b0b809df298bea29fe71b2b20f3",
      "ref": "tan-hill-way-walking-route"
    },
    {
      "description": "Pewsey Avon Trail",
      "objectID": "d1be7faeb8811e89d434233844792b35",
      "ref": "pewsey-avon-trail-walking-route"
    },
    {
      "description": "Great Bedwyn",
      "objectID": "dd4fff7d0c563e778e7860f503e40f37",
      "ref": "great-bedwyn-walking-route"
    },
    {
      "description": "Wilton Windmill",
      "objectID": "8a594819e63e1fc942fb4fe430b91a42",
      "ref": "wilton-windmill-walking-route"
    },
    {
      "description": "Salisbury Plain",
      "objectID": "3fdec00b122e35f35a2eeb86a2c810f7",
      "ref": "salisbury-plain-walking-route"
    },
    {
      "description": "Salisbury Circular Walk",
      "objectID": "03cb8dc1b9a6194e29fb9564b8a79092",
      "ref": "salisbury-circular-walk-walking-route"
    },
    {
      "description": "Avebury Stones",
      "objectID": "131fc4cd3eaa13cde0fc3361fc0d2e7a",
      "ref": "avebury-stones-walking-route"
    },
    {
      "description": "Stonehenge",
      "objectID": "53957255d5fdc8c9682d20c40abd1889",
      "ref": "stonehenge-walking-route"
    },
    {
      "description": "White Horse Trail",
      "objectID": "f8439cbeac9e3bb5a4852659b79a5429",
      "ref": "white-horse-trail-walking-route"
    },
    {
      "description": "Westbury White Horse",
      "objectID": "ec48d6976520c8bb9d93d0a7ddbd3b0a",
      "ref": "westbury-white-horse-walking-route"
    },
    {
      "description": "West Woods",
      "objectID": "5c1f1a7b944e2fa7e1eab70f8c668195",
      "ref": "west-woods-walking-and-cycle-route"
    },
    {
      "description": "Alton Barnes White Horse",
      "objectID": "010a251326922871866292a843035c1e",
      "ref": "alton-barnes-white-horse-walking-route"
    },
    {
      "description": "Wootton Rivers",
      "objectID": "70e54b42dca5bdce02cac84cd3d18c0a",
      "ref": "wootton-rivers-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/966c6818a4ec3f1bf02a0685ddd7b65b.gpx",
  "_geoloc": {
    "lat": 51.3485986292,
    "lng": -1.7757379722
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/The_Kennet_and_Avon_Canal_at_Pewsey_Wharf._-_geograph.org.uk_-_187177.jpg",
      "title": "Colin Smith / The Kennet & Avon Canal at Pewsey Wharf.",
      "caption": "The Kennet & Avon Canal at Pewsey Wharf. The old warehouse in the 1992 photograph has now become a pub and restaurant. It seems to be popular with both passing boat and road traffic and a car park has been laid out. The wharf originally dealt with trade to and from the Vale of Pewsey eg coal from Somerset."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/River_Avon_in_Pewsey_-_geograph.org.uk_-_1401701.jpg",
      "title": "Nigel Cox / River Avon in Pewsey",
      "caption": "River Avon in Pewsey. This is the Avon flowing downstream towards the photographer after coming under the High Street bridge. The High Street is visible over the bridge to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/The_Kennet_and_Avon_Canal%2C_Wilcot_-_geograph.org.uk_-_842631.jpg",
      "title": "Andrew Smith / The Kennet and Avon Canal, Wilcot",
      "caption": "The Kennet and Avon Canal, Wilcot. Looking west from Ladies Bridge beside Cocklebury Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Honeystreet_-_geograph.org.uk_-_3646.jpg",
      "title": "David Stowell / Honeystreet",
      "caption": "Honeystreet and the The Barge Inn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Hillside%2C_Knap_Hill%2C_Pewsey_Downs_-_geograph.org.uk_-_38370.jpg",
      "title": "Chris Collard / Hillside, Knap Hill, Pewsey Downs",
      "caption": "Hillside, Knap Hill, Pewsey Downs. The view north, towards Knap Cottage from the Knap hillside with summer wildflowers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Downs%2C_West_Stowell_-_geograph.org.uk_-_282696.jpg",
      "title": "Andrew Smith / Downs, West Stowell",
      "caption": "Downs, West Stowell. At the top of the smaller combe in the west of the grid-square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Martinsell_Hill_-_geograph.org.uk_-_282595.jpg",
      "title": "Andrew Smith / Martinsell Hill",
      "caption": "Martinsell Hill. Showing the ditch that encircles the top and is part of a former fort. Scrubby woodland to the right hides the trig point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Milkhouse_Water_Bridge%2C_Kennet_and_Avon_Canal_-_geograph.org.uk_-_415665.jpg",
      "title": "Dr Neil Clifton / Milkhouse Water Bridge, Kennet and Avon Canal",
      "caption": "Milkhouse Water Bridge, Kennet and Avon Canal. A very peaceful stretch of canal here. The bridge carries only a minor metalled road."
    }
  ],
  "distance_km": 24.0,
  "description": "This Wiltshire based village is a great place to visit with excellent walking opportunities in the surrounding area. There's canalside paths and the countryside of Pewsey Downs Nature Reserve and the Vale of Pewsey to explore. You can also easily access the village by train, direct from London Paddington station. This circular walk from the village takes you along a section of the Kennet and Avon Canal before exploring the countryside of the Vale of Pewsey to the north of the village. The walk starts at Pewsey Wharf on the canal, just to the north of the village centre and train station. From here you can pick up the towpath and follow it west to Stowell Park, Lower Bristow and Wilcot before coming to Honeystreet where you leave the canal. Head north to Alton Barnes and Walkers Hill. This section takes you past the Pewsey Downs and the Alton Barnes White Horse. The area is designated as a National Nature Reserve and covers three hills and the Alton Barnes chalk white horse cut into the hillside. There's splendid views here stretching across the Vale to Salisbury Plain and the MOD's Imber Range. Near Walkers Hill and Knap Hill you pick up the where you pick up the Tan Hill Way and follow it east to Draycott Hill, Gopher Wood, Huish Hill, Oare Hill and Martinsell Hill. It's a lovely section with fine views from the elevated position of the trail. Just after passing Martinsell Hill you pick up a country lane and follow it south east to the village of Wootton Rivers where you can pick up the canal again. Follow the towpath west and it will take you back to Pewsey Wharf, passing Carrel Crown Bridge and Milkhouse Water on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Waterfront Bar And Bistro is conveniently located at Pewsey Wharf at the start/end of the route. You can sit outside in the garden area and enjoy watching the boats go by with your meal. You can find them at postcode SN9 5NU for your sat navs. On the route you could also stop off at the the idyllic Barge Inn at Honeystreet. This historic pub is located right next to the canal and includes an outdoor seating area wih glorious views across the canal to the Marlborough Downs and the Alton Barnes/Pewsey White Horse. It's the ideal place to relax in and watch the world go by on warm summer days. The pub also has an interesting history having originally been built in 1810 to service the newly built Kennet and Avon canal, it was the equivalent of a modern day motorway service station. It then burnt down in the 1850s only to be rebuilt in record time so it now stands as it did then. The pub can be found just to the west of Pewsey in Honeystreet, near Alton Barnes. Postcode for you sat navs is SN9 5PS. In Wootton Rivers there's The Royal Oak, another charming thatched pub dating from the 16th century. Formerly a coaching inn the building has also been used as a farrier’s yard and the village bakery. There's a fine old interior with low, oak-beamed ceilings and wide, open log fires during the winter months. They have a fine menu and a garden to relax in on warmer days. You can find them at postcode SN8 4NQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canal and the surrounding countryside on the route are ideal for dog walking. The Waterfront Bar And Bistro mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Great Bedwyn Walk will take you east from the village to the neighbouring village of Great Bedwyn. You'll pass Burbage and Wilton where you can visit the noteworthy Wilton Windmill. The mill is notable as the only working windmill in Wessex and still produces wholemeal, stone-ground flour. During the summer season there are also guided tours available on certain days. You'll also pass the Crofton Pumping Station which is one of the most significant industrial heritage sites in the UK. You can learn about the industrial and social history of the area at this interesting site. It dates from 1812 and is the oldest working beam engine in the world. The steam-powered pumping station is well preserved and operates on selected weekends. It's another of the highlights of the Vale of Pewsey. The Pewsey Avon Trail also starts in the village. This long distance footpath heads south through the countryside to the historic city of Salisbury. On the way you will also pass the famous Stonehenge. To the north of the village you can also visit one of the historical sites of the area at the Avebury Stones. Near here there's also the expansive West Woods where you'll find lots of bluebells in the spring. For more walking ideas in the area see the North Wessex Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZcL-9TX9WLg",
  "district": "Pewsey",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}