{
  "created_at": "2025-01-06T02:50:51.062313+00:00",
  "objectID": "966e1991f6aaa7e4aa3c66074c4d192c",
  "ref": "giggleswick-walking-route",
  "title": "Giggleswick Walks Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Building_in_Giggleswick_School%2C_Giggleswick_-_geograph.org.uk_-_928544.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/966e1991f6aaa7e4aa3c66074c4d192c.gpx",
  "_geoloc": {
    "lat": 54.0712868689,
    "lng": -2.2920274432
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Building_in_Giggleswick_School%2C_Giggleswick_-_geograph.org.uk_-_928544.jpg",
      "title": "Humphrey Bolton / Building in Giggleswick School, Giggleswick",
      "caption": "Building in Giggleswick School. The older buildings are Gothic in style, with curved tops to the window lights. Here there is a change to larger, rectangular windows, but there is still a castle-like tower and large windows with mullions and transoms harking back to the 17th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Giggleswick_Quarry_2007_-_geograph.org.uk_-_918640.jpg",
      "title": "William Bartlett / Giggleswick Quarry 2007",
      "caption": "Giggleswick Quarry 2007. A dry stone wall was started in the summer of 2007 but it was soon found that the quality of the stone from the quarry was not good enough to make a solid enough wall. Concrete was used as hearting (fillings) and the copestones have been cemented on, so technically this is not a dry stone wall anymore, although it looks like one."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Old_signpost%2C_Giggleswick_-_geograph.org.uk_-_1445482.jpg",
      "title": "Humphrey Bolton / Old signpost, Giggleswick",
      "caption": "Old signpost in the village. This is of the 'pre-Worboys' type, with place-names in capitals and an arrow rather than a chevron. The lettering is raised, but is not of metal. The '4' of the mileage to Clitheroe is deteriorating, and is made of a substance looking like plaster, with a black '4' of a thin material stuck on to it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Tems_Side%2C_Giggleswick_-_geograph.org.uk_-_919356.jpg",
      "title": "Humphrey Bolton / Tems Side, Giggleswick",
      "caption": "Tems Side. There is a little Lane alongside Tems Beck called Tems Street, and from it this bridge gives access to a group of houses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Cairn%2C_Stack_House_Scar%2C_Giggleswick_-_geograph.org.uk_-_2006493.jpg/512px-Cairn%2C_Stack_House_Scar%2C_Giggleswick_-_geograph.org.uk_-_2006493.jpg",
      "title": "Cairn, Stack House Scar, Giggleswick by Humphrey Bolton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cairn, Stack House Scar, Giggleswick"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/The_dry_valley_below_Kinsey_Cave_-_geograph.org.uk_-_2117593.jpg",
      "title": "The dry valley below Kinsey Cave by Karl and Ali, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The dry valley below Kinsey Cave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Giggleswick_Scar_-_geograph.org.uk_-_42107.jpg",
      "title": "Chris Eccleston / Giggleswick Scar",
      "caption": "Giggleswick Scar is a series of long limestone cliffs which were formed by the Craven Fault and which run along the route of the A65 (prior to the construction of the Settle by-pass), between the village of Giggleswick and Buckhaw Brow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Buckhaw_Brow_Cave%2C_Giggleswick_Scar_-_geograph.org.uk_-_1765003.jpg",
      "title": "Karl and Ali / Buckhaw Brow Cave, Giggleswick Scar",
      "caption": "Buckhaw Brow Cave, Giggleswick Scar. One of two caves (Upper and Lower) both \"aligned on a barytes string which has been worked in the lower cave\" (Northern Caves vol two, Dalesman 1982). This is the view from the Upper Cave (length 9m) looking towards a distant, misty Pendle Hill. Cars can just be seen passing on the road below."
    }
  ],
  "distance_km": 8.0,
  "description": "This picturesque village is located close to Settle in the Craven district of North Yorkshire. The village includes a railway station, a noteworthy 15th century church, a fine old pub and pleasant waterside walks through the Ribble Valley. This circular walk from the village takes you up to the viewpoints on Giggleswick Scar before a riverside stroll along the River Ribble. The walk starts in the village where you can follow Mill Hill Lane north to the quarries and Schoolboys Tower Cairn. You then head west along Gigglsewick Scar where there are a number of intriguing caves, limestone cliffs and wonderful views from the high points. After exploring the Scar you head back to the east to pick up the Ribble Way. Follow this south towards Settle before turning west to return to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Craven Arms is a good choice for post walk refreshment. They serve a good Sunday lunch and have a decent sized car park and large garden area as well. You can find them near the train station at Brackenber Lane with postcode BD24 0EA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails are a good one for fit dogs and the Craven Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head across the river to neighbouring Settle and you could pick up the Settle Caves and Waterfalls Walk and visit the splendid Catrigg Force and Scaleber Force waterfalls. One of the highlights of the area can also be found a few miles to the east on the wonderful Malham Tarn Estate. The Settle Riverside Walk will take you along the River Ribble to neighbouring Stainforth where you can visit the photogenic Stainforth Force Waterfall. For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/NsSXMQBVUXs",
  "postcode": "BD24 0DD",
  "district": "Giggleswick",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}