{
  "created_at": "2025-01-06T00:23:47.672375+00:00",
  "objectID": "9693799ef553d974574227073fb7df28",
  "ref": "hereford-walking-route",
  "title": "Hereford Circular River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/29/Hereford%2C_the_River_Wye_and_the_cathedral_-_geograph.org.uk_-_636826.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9693799ef553d974574227073fb7df28.gpx",
  "_geoloc": {
    "lat": 52.053832108,
    "lng": -2.7161205787
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Hereford%2C_the_River_Wye_and_the_cathedral_-_geograph.org.uk_-_636826.jpg",
      "title": "Chris Downer / Hereford: the River Wye and the cathedral",
      "caption": "Hereford, the River Wye and the cathedral. A place of worship has existed on the site of the present cathedral since the 8th century or earlier. Building commenced on the cathedral during the late 11th century. Substantial parts of the building date from both the Norman and the Gothic periods. It is designated as a Grade I listed building. It contains the largest library of chained book in the world, its most famous treasure being the Mappa Mundi, a medieval map of the world created around 1300 by Richard of Holdingham. The map is listed on the UNESCO Memory of the World Register."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Hereford%2C_Victoria_Bridge_-_geograph.org.uk_-_636825.jpg",
      "title": "Chris Downer / Hereford: Victoria Bridge",
      "caption": "Victoria Bridge. An ornate footbridge that crosses the Wye."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Hereford_Castle_-_geograph.org.uk_-_552397.jpg",
      "title": "David Stowell / Hereford Castle",
      "caption": "Hereford Castle. The green area in which the memorial stands was once the site of Hereford Castle. By the end of the English Civil War the castle was in much need of repair. Instead however is was largely demolished and the motte, visible in the trees was much reduced. Toady this is an open public area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Hereford_Market_Place_-_geograph.org.uk_-_552390.jpg",
      "title": "David Stowell / Hereford Market Place",
      "caption": "Hereford Market Place. With the Old House now preserved and standing alone at the eastern end of the square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Waterworks_Museum%2C_Broomy_Hill_-_geograph.org.uk_-_965152.jpg",
      "title": "Roger Cornfoot / Waterworks Museum, Broomy Hill",
      "caption": "Waterworks Museum, Broomy Hill. Extension added to house equipment from the Royal Ordnance Munitions Factory at Rotherwas."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/River_Wye_near_Lower_Brienton_-_geograph.org.uk_-_454501.jpg",
      "title": "Trevor Rickard / River Wye near Lower Brienton",
      "caption": "River Wye near Lower Brienton. Looking across the river towards the Belmont Hotel and golf course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Lawn_near_Lower_Brienton_Church_-_geograph.org.uk_-_454329.jpg",
      "title": "Trevor Rickard / Lawn near Lower Brienton Church",
      "caption": "Lawn near Lower Brienton Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Orchard%2C_Warham_court_-_geograph.org.uk_-_358263.jpg",
      "title": "Richard Greenwood / Orchard: Warham court",
      "caption": "Orchard: Warham court. This mature orchard has been well maintained. Great Spotted woodpeckers were drumming on this fine early spring morning."
    }
  ],
  "distance_km": 9.0,
  "description": "This splendid cathedral city is a fine place to explore for walkers. There's some lovely riverside trails, attractive parks and easy access to the local countryside from the city centre. The city is also very close to the Malvern Hills and the Wye Valley AONB where there are numerous walking options through beautiful scenery. This circular riverside walk from the city visits the cathedral and the castle site before following a riverside path into the surrounding countryside. The walk starts at Hereford Cathedral. The historic site dates from the late 11th century and houses a particularly noteworthy chain library. The site also includes a nice cafe and some lovely cathedral gardens. From the cathedral it is a short walk east to visit the site of Hereford Castle. The fortification was one of the earliest castles in England. It was probably destroyed when the Welsh sacked Hereford in 1055, but seems to have been replaced by the following decade. You then cross the river on the Victoria Footbridge and pick up the Wye Valley Walk. Follow the waymarked footpath west along the River Wye and it will take you to a playing field where you cross again. The trail continues west to Lower Breinton, a riverside area run by the National Trust. It's a picturesque area with an old church, pretty orchards and woodlands with bluebells during the spring months. From here you pick up a country lane and follow it east to the old Warham Court where there's an orchard and fields. You continue east past the Broomy Hills Waterworks Museum before returning to the city centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back at the cathedral you could enjoy some refreshments in the on site coffee shop. If you prefer a pub lunch then The Barrels is a good choice. The inn dates from the 18th century and is formed partly from the old city wall. It includes a large, partially covered, walled and flag-stoned brewery yard, providing year-round 'alfresco' drinking. You can find them at 69 Owen's St with a postcode of HR1 2JQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and country trails make for a fine dog walk. The Barrels pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Herefordshire Walks, the Malvern Hills Walks and the Wye Valley Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4MEJ1EWTaRw",
  "postcode": "HR1 2NG",
  "district": "Hereford",
  "county": "Herefordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cloister Café, St John's Walk, Portfields, Hereford, Herefordshire, England, HR1 2NG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "historical sites",
    "parks",
    "countryside"
  ],
  "facilities": [
    "cafe",
    "visitor center",
    "wheelchair accessible",
    "play area"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}