{
  "created_at": "2025-01-06T02:30:20.710608+00:00",
  "objectID": "96a48ed86c6f82c4fb8c9f351aa63567",
  "ref": "great-flat-lode-trail-walking-and-cycle-route",
  "title": "Great Flat Lode Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/27/Bridleway_near_Carn_Entral_-_geograph.org.uk_-_535849.jpg",
  "nearby": [
    {
      "description": "Stithians Lake",
      "objectID": "e3d8daada933d78351c9945947c77c85",
      "ref": "stithians-lake-walking-and-cycle-route"
    },
    {
      "description": "Poldice Valley",
      "objectID": "66115e133fdc6f4995c121cae61984c4",
      "ref": "poldice-valley-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/96a48ed86c6f82c4fb8c9f351aa63567.gpx",
  "_geoloc": {
    "lat": 50.2085073883,
    "lng": -5.2519066788
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Bridleway_near_Carn_Entral_-_geograph.org.uk_-_535849.jpg",
      "title": "Tony Atkin / Bridleway near Carn Entral",
      "caption": "Bridleway near Carn Entral"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/On_the_Great_Flat_Lode_Trail_-_geograph.org.uk_-_992820.jpg",
      "title": "Chris Allen / On the Great Flat Lode Trail",
      "caption": "Shire Horse Farm on the trail. The museum sign is a few hundred metres before the actual museum. The engine house is Daubuz's engine house of South Wheal Francis."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Path_across_Newton_Moor_-_geograph.org.uk_-_534688.jpg",
      "title": "Tony Atkin / Path across Newton Moor",
      "caption": "Path across Newton Moor. Newton Moor is a large flat marshy area of land in the valley bottom. This bridleway shown here is part of the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Great_Flat_Lode_-_geograph.org.uk_-_51136.jpg",
      "title": "Gwyn Jones / Great Flat Lode",
      "caption": "Old tin mines line the route of the Great Flat Lode, looking east across the valley, from South Wheal Francis towards West Wheal Bassett"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Higher_Brea_-_geograph.org.uk_-_535855.jpg",
      "title": "Tony Atkin / Higher Brea",
      "caption": "Higher Brea. Looking over the upper part of Brea village from the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Tunnel_on_the_Basset_Tramway_-_geograph.org.uk_-_533493.jpg",
      "title": "Tony Atkin / Tunnel on the Basset Tramway",
      "caption": "Tunnel on the Basset Tramway. This tunnel was opened in 1908 and took a tramway underneath the road between Four Lanes and Camborne. The tramway was built to take ore from South Wheal Francis to the processing works at Basset Stamps and was worked by steam engine. The tunnel was rebuilt in 1997 to allow it to be used as part of the bridleway which runs along the old track bed and forms part of the Great Flat Lode trail."
    }
  ],
  "distance_km": 10.5,
  "description": "This is a short, circular off road walk or cycle that circles the historic hilltop site of Carn Brea. The route is one of Cornwall's Mineral Tramway Trails which take you on a tour of the disused mines of the county. You will pass South Wheal Frances and South Crofty mines as you head through some beautiful Cornish countryside. Good access points are Camborne or Redruth train stations, or the car park at Treskillard. The route runs for about 7 miles on an undulating path with some climbs on the way. If you enjoy this trail you may also be interested in the Mineral Tramways trail which runs from Portreath to Devoran and also visits several historic mine buildings.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Countryman Inn is located close to the start/end of the route. They have a good menu and a nice outdoor seating area with views of the little village. You can find them just to the north of the car park in Piece, Carnkie with a postcode of TR16 6SG for your sat navs. If you climb up to Carn Brea hill you could visit the wonderful restaurant inside Carn Brea Castle. Set in the 18th century castle the restaurant serves high quality food. You can also explore the historic building where you can gain access to the roof for excellent views over the area. In the Camborne area there's The Beacon Inn. The friendly inn is set in the old mining district above Camborne and includes an interesting mural depicting local mining scenes. Outside there is a beer garden used in summer for barbecues and a cider frestival. They are located at postcode TR14 7SE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is a good one to do with your dog so you'll probably see other owners as you make your way along the path. The Countryman Inn mentioned above is also dog friendly in one of the bars and in the outdoor section."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head a couple of miles south east from the trail you will come to Stithians Lake. The expansive reservoir has some nice waterside walking trails to try. Just a few miles to the east of Redruth there's some great walking and mountain bike trails to be found at the Poldice Valley. The area has a wonderful moon like appearance with the historic Poldice Mine buildings adding to the atmospheric landscape. In Camborne you could visit the King Edward Mine Museum. Here you can learn all about the area's mining heritage at a former working mine. A guide will take you around the Cornish Tin Mill, demonstrating the unique equipment in action. You can find them at postcode TR14 9HW for your sat navs. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/XnH1Vvbw14k",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "South Wheal Frances, Filtrick Lane, High Carnkie, Carn Brea, Four Lanes, Cornwall, England, TR16 6JX, United Kingdom",
  "postcode": "TR16 6JX",
  "district": "Four Lanes",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "path"
  ],
  "points_of_interest": [
    "historic sites",
    "mines"
  ],
  "facilities": [
    "car park",
    "train station"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}