{
  "created_at": "2025-01-05T23:41:41.423634+00:00",
  "objectID": "975cde8ec9cf04c9a8ddc73aae1a02f6",
  "ref": "chipperfield-common-walking-route",
  "title": "Chipperfield Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e5/The_Two_Brewers_pub_at_Chipperfield_with_part_of_Chipperfield_common_in_foreground_-_geograph.org.uk_-_691093.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/975cde8ec9cf04c9a8ddc73aae1a02f6.gpx",
  "_geoloc": {
    "lat": 51.7024167114,
    "lng": -0.4889182776
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/The_Two_Brewers_pub_at_Chipperfield_with_part_of_Chipperfield_common_in_foreground_-_geograph.org.uk_-_691093.jpg",
      "title": "Graham Hale / The Two Brewers pub at Chipperfield with part of Chipperfield common in foreground, via Wikimedia Commons",
      "caption": "The Two Brewers pub at Chipperfield with part of Chipperfield common in foreground"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Chipperfield_Common_-_geograph.org.uk_-_113952.jpg",
      "title": "Nigel Cox / Chipperfield Common, via Wikimedia Commons",
      "caption": "Chipperfield Common. Viewed looking westwards along the main footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Hertfordshire_Way_by_Chipperfield_Common_-_geograph.org.uk_-_1513057.jpg",
      "title": "Colin Smith / Hertfordshire Way by Chipperfield Common, via Wikimedia Commons",
      "caption": "Hertfordshire Way by Chipperfield Common. Well-trodden footpath passing a grassy meadow beside The Common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Chipperfield%2C_War_Memorial_and_The_Two_Brewers_-_geograph.org.uk_-_122311.jpg",
      "title": "Nigel Cox / Chipperfield: War Memorial & The Two Brewers, via Wikimedia Commons",
      "caption": "Chipperfield: War Memorial & The Two Brewers. Viewed looking westwards across Chipperfield Common. The village sign on the common is just visible to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Tumulus_in_Chipperfield_Woods_-_geograph.org.uk_-_2316948.jpg/512px-Tumulus_in_Chipperfield_Woods_-_geograph.org.uk_-_2316948.jpg",
      "title": "Tumulus in Chipperfield Woods by Graham Hale, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tumulus in Chipperfield Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Ancient_sweet_chestnut_tree_-_geograph.org.uk_-_2316958.jpg/512px-Ancient_sweet_chestnut_tree_-_geograph.org.uk_-_2316958.jpg",
      "title": "Ancient sweet chestnut tree by Graham Hale, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ancient sweet chestnut tree. These are estimated to date back to the 1600s and believed to be descended from specimens brought from Spain in the Middle Ages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Apostles_Pond_-_geograph.org.uk_-_2172241.jpg",
      "title": "Apostles Pond by Shaun Ferguson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Apostles Pond. The pond has twelve lime trees surrounding it and was once a monastery fishpond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Signs_for_Kings_Langley_and_Sarratt_-_geograph.org.uk_-_4666310.jpg/512px-Signs_for_Kings_Langley_and_Sarratt_-_geograph.org.uk_-_4666310.jpg",
      "title": "Signs for Kings Langley and Sarratt by Peter S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Signs for Kings Langley and Sarratt. Car parking area in the background."
    }
  ],
  "distance_km": 1.5,
  "description": "The 117 acre common in Chipperfield has some waymarked woodland walking trails. Features on the common include eight veteran Spanish sweet chestnut trees, two early Bronze Age burial mounds and the Apostles Pond which is surrounded by willow trees. You can start your walk from the car park at the northern end of the site. From here you can pick up a network of paths taking you across the common. After your walk you can enjoy a stroll around the pretty village of Chipperfield with its nice pubs, cricket pavilion, war memorial, village green and old churches. To extend your walking in the area you could pick up the Grand Union Canal towards Hemel Hempstead or Watford. The Chess Valley Walk also passes to the south of Chipperfield, near Sarrat and Chenies.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "A fine example of an 18th Century Inn The Two Brewers in the tranquil and picturesque village of Chipperfield is a traditional pub filled with old world charm. Opposite the pub is a quintessential village green where guests are free to take in a local cricket match or just simply soak up the sun. Indoors on cold days there’s a roaring open fire surrounded by luxurious leather sofas. You can find the pub at postcode WD4 9BS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails on the common are ideal for dog walking. The Two Brewers mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The common is located only a couple of miles north east of the splendid Chenies Manor House. You could follow footpaths and country lanes south west from the common to reach the historic house. The Tudor House is a Grade I listed building and is surrounded by award-winning gardens. Original 13th Century features including a Medieval well, a dungeon and a reputed priest hole. You can tour the house and garden for a fee, from April to October. Near Chenies is the worthy village of Little Chalfont where you could pay a visit to the Little Chalfont Nature Park. The lovely little park includes a rare wild flower meadow, old woodlands and relics of its past as a farm and a cherry orchard. There's information boards where you can learn about the variety of flora and fauna at the site. You can find them on Cokes Lane at postcode HP7 9QB for sat navs. To the east of the common there's the interesting village of Kings Langley where there's a 14th century church, a local common and some pretty locks and weirs along the canal. For more walking ideas in the area see the Hertfordshire Walks and Chilterns Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hNPSWsxf0W0",
  "district": "Chipperfield",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}