{
  "created_at": "2025-01-06T08:20:42.352455+00:00",
  "objectID": "97750d2c38ec554f4ea046442b9d5c39",
  "ref": "captain-cooks-monument-walking-route",
  "title": "Captain Cook's Monument Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Captain_Cook%27s_Monument_-_geograph.org.uk_-_923536.jpg",
  "nearby": [
    {
      "description": "Cleveland Way",
      "objectID": "9d56c63c556a167d04b175f1b86b24e0",
      "ref": "cleveland-way-walking-route"
    },
    {
      "description": "Roseberry Topping",
      "objectID": "2eeed7806bdbd1d3c4000cd114e5c9b8",
      "ref": "roseberry-topping-walking-route"
    },
    {
      "description": "Guisborough Forest and Walkway",
      "objectID": "fbd6e92f52d57c6051687b8cb1b8d13c",
      "ref": "guisborough-forest-and-walkway-walking-and-cycle-route"
    },
    {
      "description": "Wainstones",
      "objectID": "e0a1f1bbbaedd1bd63d23af3e7dc9036",
      "ref": "wainstones-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/97750d2c38ec554f4ea046442b9d5c39.gpx",
  "_geoloc": {
    "lat": 54.4887449712,
    "lng": -1.1318424221
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Captain_Cook%27s_Monument_-_geograph.org.uk_-_923536.jpg",
      "title": "Christine Church / Captain Cook's Monument, via Wikimedia Commons",
      "caption": "This is the south side of the monument, and the photograph also captures Roseberry Topping"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Approaching_Captain_Cook%27s_Monument_-_geograph.org.uk_-_582883.jpg",
      "title": "Graham Horn / Approaching Captain Cook's Monument, via Wikimedia Commons",
      "caption": "Approaching Captain Cook's Monument. Westbound walkers on the Cleveland Way leave the Coate Moor plantations and this is the first view of the monument. A resting point beckons."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/The_Captain_Cook_Monument_-_geograph.org.uk_-_1628866.jpg",
      "title": "Bill Boaden / The Captain Cook Monument, via Wikimedia Commons",
      "caption": "The monument stands proud on Easby Moor. Roseberry Topping is in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Rocks_on_Hilltop_by_Captain_Cooks_Monument_-_geograph.org.uk_-_1767207.jpg",
      "title": "Paul Buckingham / Rocks on Hilltop by Captain Cooks Monument, via Wikimedia Commons",
      "caption": "Rocks on Hilltop by the monument. The hazy outline of the Cleveland Hills can be seen in the distant background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Boundary_Stone%2C_Easby_Moor_-_geograph.org.uk_-_942288.jpg",
      "title": "Mick Garratt / Boundary Stone, Easby Moor",
      "caption": "Boundary Stone and pretty heather, Easby Moor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/The_Cleveland_Way_above_Gribdale_-_geograph.org.uk_-_923641.jpg",
      "title": "Peter Church / The Cleveland Way above Gribdale",
      "caption": "The Cleveland Way above Gribdale. The Cleveland Way runs north - south here, and looking south, Captain Cook's monument stands on the skyline. Three paragliders are also caught by the camera."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Path_on_the_edge_of_Great_Ayton_Moor_-_geograph.org.uk_-_1628837.jpg",
      "title": "Bill Boaden / Path on the edge of Great Ayton Moor",
      "caption": "Path on the edge of Great Ayton Moor in summer. The Captain Cook Monument is on the far skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/School_Mill_Dam_-_geograph.org.uk_-_598893.jpg",
      "title": "Mick Garratt / School Mill Dam",
      "caption": "School Mill Dam in Great Ayton. Ayton once had three mills. Most visitors are familiar with the lower weir. This is the one providing power to the School Mill higher upstream. In times of low flow in the River Leven there was some animosity between the mill owners."
    }
  ],
  "distance_km": 10.0,
  "description": "Enjoy a walk from Great Ayton to this iconic landmark on Easby Moor. Captain Cook's Monument is an obelisk 60 ft (18 m) high in memory of the great British explorer. This walk starts in the village of Great Ayton and climbs to the monument through woodland and moorland. You then pick up the Cleveland Way to take you across Great Ayton Moor to the wonderful Roseberry Topping. This distinctive hill commands wonderful views across the Cleveland Plain towards the Pennine Hills. The route then descends from Roseberry Topping to Great Ayton and the finish point. If you'd like to continue your walking in the area then you could climb Roseberry Topping on the National Trust walk or continue east along the Cleveland Way towards Guisborough Forest and Walkway .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Great Ayton the Royal Oak is a nice option for some post walk refreshments. This former coaching inn dates back to the 17th century and oozes charm and character. There's a cosy interior with original beams and log fires. You can find the pub on the High Street with a postcode of TS9 6BW. You could also pay a visit to the Buck Hotel. The pub sits in a nice location on the banks of the river Leven. You can sit outside and enjoy nice views on a fine day. They have a very good menu and good selection of ales too. You can find the pub at 1 West Terrace with a postcode of TS9 6PA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and surrounding woods are a great place for a dog walk. The Royal Oak pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you'd like to come by public transport then Great Ayton rail station is located less than a mile north west from the monument. The station is on the Esk Valley Line which runs from Middlesbrough to Whitby. You can pick up a footpath just to the east of the station on Dikes Lane. This will take you up to the monument. For a longer, more challenging route try our Cleveland Way Circular Walk from Great Ayton. This starts from the village and uses a section of the National Trail to take you to the iconic Roseberry Topping before climbing to the monument. A few miles north east of the monument you will find the attractive market town of Guisborough where a visit to Gisborough Priory is a worthy addition to your outing. The Augustinian priory has a facinating history dating back to the 12th century. You can enjoy a stroll around the atmospheric ruins where there is a distinctive arch, which is a well-known landmark used as a symbol for Guisborough. The site is run by English Heritage and is free to explore. You can find it in the attracive market town at Priory Grounds, Church Street at postcode TS14 6HG. The Cleveland Street Walk can also be picked up here.  To the south there's the fascinating ancient sites at the Lord Stones and the Wainstones. The climb to Carlton Bank near Carlton in Cleveland is also located in this area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Qd3LrNcbbVc",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Newton Road, Great Ayton, North Yorkshire, York and North Yorkshire, England, TS9 6BS, United Kingdom",
  "postcode": "TS9 6BS",
  "district": "Great Ayton",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland"
  ],
  "points_of_interest": [
    "viewpoints"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}