{
  "created_at": "2025-01-06T03:56:40.379496+00:00",
  "objectID": "97ae16a79fbc69180cd6cd11fdd317e5",
  "ref": "west-and-east-witton-walking-route",
  "title": "West Witton and East Witton Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/df/A684_eastbound_through_West_Witton_village_%28geograph_2960760%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/97ae16a79fbc69180cd6cd11fdd317e5.gpx",
  "_geoloc": {
    "lat": 54.291166861,
    "lng": -1.903569111
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/A684_eastbound_through_West_Witton_village_%28geograph_2960760%29.jpg",
      "title": "John Firth / A684 eastbound through West Witton village",
      "caption": "A684 eastbound through West Witton village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/The_Blue_Lion_at_East_Witton._-_geograph.org.uk_-_527400.jpg",
      "title": "Steve Partridge / The Blue Lion at East Witton.",
      "caption": "The Blue Lion at East Witton. The Blue Lion was originally built towards the end of the 18th century as a coaching inn, attracting trade from travellers and cattle drovers on their journey through Wensleydale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Coverham_Abbey.jpg",
      "title": "Chris Heaton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Coverham Abbey. The site is usually inaccessible to the public but can be glimpsed from the churchyard of Coverham's redundant medieval parish church, Holy Trinity Church, Coverham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Footpath_to_West_Witton_-_geograph.org.uk_-_556420.jpg",
      "title": "Gordon Hatton / Footpath to West Witton",
      "caption": "Footpath to West Witton. The path hugs the northern edge of Spigot Lodge Plantation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Jervaulx_Abbey_-_geograph.org.uk_-_1401425.jpg",
      "title": "Gordon Hatton / Jervaulx Abbey",
      "caption": "Jervaulx Abbey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/River_Cover_-_geograph.org.uk_-_127148.jpg",
      "title": "Chris Heaton / River Cover",
      "caption": "River Cover"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Ridge-and-furrow_near_Braithwaite_Hall_-_geograph.org.uk_-_94637.jpg",
      "title": "Chris Yeates / Ridge-and-furrow near Braithwaite Hall",
      "caption": "Ridge-and-furrow near Braithwaite Hall. Medieval ridge-and-furrow is clearly shown in slanting winter sunlight; the 17th century farmhouse of Braithwaite hall is at upper right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Mill_Race%2C_Coverham_-_geograph.org.uk_-_439775.jpg/256px-Mill_Race%2C_Coverham_-_geograph.org.uk_-_439775.jpg",
      "title": "Gordon Hatton / Mill Race, Coverham",
      "caption": "Mill Race, Coverham Tracing the line of the mill race upstream from Coverham Low Mill [SE1186] is interesting. For a short way it is exposed, but for most of its course it is in a culvert beneath the fields. This short section appears to have been deliberately exposed to provide water for farm animals. Unfortunately the junction of mill race with the river is inaccessible."
    }
  ],
  "distance_km": 27.0,
  "description": "This circular walk takes you between the villages of West and East Witton in North Yorkshire. On the way there's some lovely Wensleydale scenery and visits to Coverham Abbey and Jervaulx Abbey. There's also some nice waterside sections along the River Cover and River Ure to enjoy. The walk starts in West Witton and follows footpaths south east to Capple Bank and Spigot Lodge. You then turn south to Tupgill Park before coming to the remains of Coverham Abbey. The 12th century abbey ruins are a Scheduled Ancient Monument and a Grade I listed building. You then head east along the River Cover, the River Ure and the long distance Six Dales Trail to visit Jervaulx Abbey. The 12th century ruined abbey is surrounded by 126 acres of attractive parkland with wildflowers, grazing sheep, a pretty pond and fine views of the surrounding North Yorkshire countryside. There's also a lovely tea rooms to stop at for refreshment. The route then retraces its steps before turning south to visit East Witton where there's a fine 18th century stone pub to visit. After exploring the village you follow country lanes west to Braithwaite Hall. This 17th-century manor house in Coverdale is Grade II listed and run by the National Trust. From here you continue to Cherry Hill and Hanghow Pastures. You then pass Agllethorpe and Middleham High Moor before turning north to return to West Witton.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Blue Lion in East Witton is a good choice for refreshment. The 18th-century ivy-covered stone pub serves good quality food and can be found at the Main Road, East Witton, DL8 4SN."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine dog walk. The Blue Lion mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route passes close to neighbouring Middleham where you can visit the historic castle. Near Jervaulx Abbey you could take a detour north to visit the pretty Thornton Steward Reservoir where there's a peaceful waterside trail. For more walking ideas in the area see the Nidderdale Walks and the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jw0omPfbIK0",
  "postcode": "DL8 4LU",
  "district": "West Witton",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Main Street, West Witton, North Yorkshire, York and North Yorkshire, England, DL8 4LU, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "pasture",
    "rural"
  ],
  "points_of_interest": [
    "abbey ruins",
    "historic house",
    "moor"
  ],
  "facilities": [
    "tea rooms",
    "pub/cafe",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}