{
  "created_at": "2025-01-06T00:49:36.266529+00:00",
  "objectID": "97f252c582b409010f6daf70209d4b57",
  "ref": "venford-reservoir-walking-route",
  "title": "Venford Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Venford_Reservoir_-_geograph.org.uk_-_596797.jpg",
  "nearby": [
    {
      "description": "Hembury Woods",
      "objectID": "d1aea0855f6d20466086c5eedbf41d46",
      "ref": "hembury-woods-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "River Dart Country Park",
      "objectID": "57d7c8fbcdca33cf230d52438c923f36",
      "ref": "river-dart-country-park-walking-route"
    },
    {
      "description": "Buckfastleigh and Buckfast Abbey",
      "objectID": "66e6d774af73641b114af54a746796fa",
      "ref": "buckfastleigh-and-buckfast-abbey-walking-route"
    },
    {
      "description": "Holne Woods",
      "objectID": "6248f449c385be6909767cc0dbf06b6a",
      "ref": "holne-woods-walking-route"
    },
    {
      "description": "Dartmeet",
      "objectID": "261be4af8d326296957d4bf0490595e4",
      "ref": "dartmeet-walking-route"
    },
    {
      "description": "Buckland Beacon",
      "objectID": "9fccf7b06873c2662891c9d23a085cc9",
      "ref": "buckland-beacon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/97f252c582b409010f6daf70209d4b57.gpx",
  "_geoloc": {
    "lat": 50.5258452848,
    "lng": -3.8552489637
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Venford_Reservoir_-_geograph.org.uk_-_596797.jpg",
      "title": "Derek Harper / Venford Reservoir",
      "caption": "View down to the reservoir. The dam was completed in 1907. The road across it goes on towards Hexworthy. The tarmac on the right is the entrance to the waterworks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Car_park%2C_Venford_reservoir_-_geograph.org.uk_-_595152.jpg",
      "title": "Derek Harper / Car park, Venford reservoir",
      "caption": "Car park, Venford reservoir. On the right is the lane to Holne."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Track_below_Venford_Reservoir_-_geograph.org.uk_-_592892.jpg",
      "title": "Derek Harper / Track below Venford Reservoir",
      "caption": "Track below the reservoir. With the valley of Venford Brook on the left, and the slopes below Bench Tor on the right. Sharp Tor is beyond the Dart valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Towards_Venford_Reservoir_from_Bench_Tor_-_geograph.org.uk_-_596581.jpg",
      "title": "Derek Harper / Towards Venford Reservoir from Bench Tor",
      "caption": "Towards the Reservoir from Bench Tor. A variety of tracks make their way across the moorland between the tor and the nearest road past the reservoir, which is in SX6871/6870. In the distance is Ryder's Hill, the highest point in the southern moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Edge_of_Venford_Reservoir_-_geograph.org.uk_-_1321480.jpg",
      "title": "Sarah Smith / Edge of Venford Reservoir",
      "caption": "Edge of the lake. The soft greens of the conifers and shrubs and the pinks of the rhododendrons create a pleasant border to the waters of the reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/View_over_Venford_Reservoir_-_geograph.org.uk_-_1321536.jpg",
      "title": "Sarah Smith / View over Venford Reservoir",
      "caption": "A peaceful scene over the water to the moors beyond. The construction of the dam, which was to supply water to the expanding population of Paignton, was carried out by Hawkins & Best of Teignmouth with a Mr Frederick Vanstone, Water Engineer for Paignton, in charge of the works. The estimated cost in 1901 was £27,583. By the time the dam was completed it had risen to £119,697.13s.6d. Much of the extra was spent on laying a satisfactory foundation: instead of solid granite under the turf, faults and broken rocks were found which had to be cemented over."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/New_auxiliary_overflow_-_Venford_Reservoir_-_geograph.org.uk_-_1321498.jpg",
      "title": "Sarah Smith / New auxiliary overflow - Venford Reservoir",
      "caption": "New auxiliary overflow. The new project at the reservoir has been to build this auxiliary overflow to manage any superfluous quantities of water which may occur after torrential rainfall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Reservoir_bridge_-_Venford_-_geograph.org.uk_-_1321516.jpg/256px-Reservoir_bridge_-_Venford_-_geograph.org.uk_-_1321516.jpg",
      "title": "Sarah Smith / Reservoir bridge - Venford",
      "caption": "Reservoir bridge. The reservoir was built in 1907 to provide water for the people of Paignton. It covers an area of some 33 acres filled by the waters flowing off Holne Moor by way of Venford Brook. The bridge carries the road to Holne and beyond. The drop on the left hand side is considerable in comparison to the water level on the right."
    }
  ],
  "distance_km": 2.0,
  "description": "This short circular walk takes you around the pretty Venford Reservoir on Dartmoor. It's a nice easy stroll with woodland sections and waterside trails to enjoy. Parking is available and there are picnic tables dotted around the lake. If you'd like to extend your walk you could climb Bench Tor to the north of the reservoir. From here you can enjoy splendid views of River Dart Valley. The reservoir is located just to the west of the Dartmoor Way long distance footpath. You could pick up the waymarked trail and visit the nearby Hembury Woods and River Dart Country Park to extend your exercise.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One good idea is to head south from the site to the little village of Scorriton. Here you could pay a visit to the Tradesman's Arms where you can enjoy home cooked food in the lovely garden area, overlooking the Little Combe Valley. You can find them at postcode TQ11 0JB for your sat navs. Another worthy option is to head north to Dartmeet. The little village is the location where the tributaries of the East Dart and West Dart meet. It's a fine place for a stroll and includes the splendid Badger's Holt tea rooms where you could enjoy a delicious cream tea with a view of the river. There's also peacocks, hens and goats adding to the appeal."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir is a nice place to bring your dog for a walk so you'll probably see other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Holne Woods Walk visits the reservoir from the nearby village. The walk also visits the viewpoint at Bench Tor and the secluded Venford Waterfall just to the north of the lake. The site is located just a few miles north east from Buckflastleigh. Here you can try the Buckfastleigh and Buckfast Abbey Walk. The historic abbey is one of the area's highlights and includes a Lavender garden, Physic garden and Sensory garden. Just a few miles to the south there's more pleasant waterside paths at the impressive Avon Dam Reservoir. Here you'll find a fine walk running along the River Avon up to the lake where there's a photogenic dam and some excellent views. To the north east there's the worthy climb to Buckland Beacon. The beacon is well known for its Ten Commandments Stones and its excellent views over the Dart Valley. The interesting rock formations at Combestone Tor are located just to the north west. There is a car park directly next to the tor for easy access or you could follow a country lane north west from the reservoir."
    }
  ],
  "video_url": "https://www.youtube.com/embed/5Z_H4CgfzNo",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}