{
  "created_at": "2025-01-06T02:49:51.605613+00:00",
  "objectID": "97f9c7058ca9d00a1a78b417af8c3e23",
  "ref": "bourton-on-the-water-walking-route",
  "title": "Circular Walk Around Bourton on the Water Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Bourton_on_the_Water_-_geograph.org.uk_-_1055569.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/97f9c7058ca9d00a1a78b417af8c3e23.gpx",
  "_geoloc": {
    "lat": 51.8819064827,
    "lng": -1.7539205004
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Bourton_on_the_Water_-_geograph.org.uk_-_1055569.jpg",
      "title": "Graham Taylor / Bourton on the Water",
      "caption": "The mill and old stone footbridge over the River Windrush."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Bourton_on_the_Water_-_geograph.org.uk_-_273558.jpg",
      "title": "Keith Fairhurst / Bourton on the Water",
      "caption": "Taken on one of the four footbridges across the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/River_Windrush_at_Bourton-on-the-Water_-_geograph.org.uk_-_841015.jpg",
      "title": "Trevor Rickard / River Windrush at Bourton-on-the-Water",
      "caption": "Looking south-east to the most downstream of the bridges in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/War_Memorial%2C_Bourton-on-the-Water_-_geograph.org.uk_-_996626.jpg",
      "title": "Robin Drayton / War Memorial, Bourton-on-the-Water",
      "caption": "War Memorial, Bourton-on-the-Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Lake_at_Bourton_on_the_Water%2C_Gloucestershire_-_geograph.org.uk_-_695456.jpg",
      "title": "Christine Matthews / Lake at Bourton on the Water, Gloucestershire",
      "caption": "Lake at Bourton on the Water. Bench and lake at Bourton on the Water near Cotswold Carp Farm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Converted_Mill_House_at_Bourton-on-the-Water_-_geograph.org.uk_-_453734.jpg",
      "title": "Trevor Rickard / Converted Mill House at Bourton-on-the-Water",
      "caption": "Converted Mill House. This private house has the garden on an island to the left with the main dwelling on the right. Looks like the river Windrush flows underneath the lounge!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/The_Motor_Museum%2C_Bourton-on-the-Water._-_geograph.org.uk_-_138523.jpg",
      "title": "Colin Smith / The Motor Museum, Bourton-on-the-Water.",
      "caption": "The Motor Museum. This popular Gloucestershire village on the shallow River Windrush attracts hordes of day trippers from the West Midlands conurbation on a fine day. The museum itself is built in typical Cotswold stone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Restaurant_alongside_the_river%2C_Bourton_on_the_Water_-_geograph.org.uk_-_699181.jpg",
      "title": "Alan Sillitoe / Restaurant alongside the river, Bourton on the Water",
      "caption": "Restaurant alongside the river, Bourton on the Water"
    }
  ],
  "distance_km": 5.0,
  "description": "Enjoy a walk through this lovely village known as the 'Venice of the Cotswolds'. The High Street is particularly picturesque with the River Windrush running through it with several pretty little stone bridges crossing. This walk makes use of the North Cotswold Diamond Way and the Oxfordshire Way to take you through the countryside to the nearby fishing lakes. You could also extend your walk by following the Windrush Way west along the river. The walk also passes Birdland which has a variety of exotic birds and a collection of penguins. There is a large pond full of salmon which can be fed by the public. The 1930s Model village and Model Railway Exhibition are also well worth seeing. To extend your walking from the village try our Circular Walk from Bourton through Naunton and The Slaughters. It will take you to the village of Naunton along the river before heading to The Slaughters where there's lovely paths along the River Eye to enjoy.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Mousetrap Inn is a good choice for some post walk refreshments. The pub does excellent food and also has its own art gallery with landscape paintings in oil by local artist Silvi Schaumloeffel. There's a cosy, attractive interior with a log fire while outside there's a garden area for warmer days. You can find the inn at Lansdowne with a postcode of GL54 2AR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The village and surrounding countryside are a good place for a dog walk. The Mousetrap Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Bourton is a real tourist honeypot so there's plenty of other activities you can try. If you're a car enthusiast then the Cotswold Motoring Museum is a must see. There's vintage cars, old caravans, fine looking motorcycles and classic old motoring signs to see here. It's housed in the Old Mill on Sherborne Street with a postcode of GL54 2BY for your sat navs. If you'd like to continue your exercise in the outdoors then Birdland is a great option. There's nice footpaths to follow to woodland, river and gardens where you can look out for hundreds of birds including swans, King Penguins, pelicans, flamingos, hornbills, cranes, storks, cassowar and owls. The Rissington Round is a nice circular walk which also passes the village. It visits the series of lakes at the nearby Cotswolds Carp Farm before heading to the picturesque villages of Little Rissington and Great Rissington. The Windrush Way Circular Walk starts and finishes in the village. It uses several of the waymarked footpaths running through the area to visit a number of neighbouring villages. The Donnington Way - Cotswolds Pub Walk passes through the village. The long circular walk visits 15 fine old Donnington Brewery pubs in the Cotswolds. For more walking ideas in the area see the Cotswolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/WRZm6VR18eU",
  "postcode": "GL54 2DR",
  "district": "Cotswold",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rissington Road, Bourton-on-the-Water, Cotswold, Gloucestershire, England, GL54 2DR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "bird watching",
    "historical sites",
    "villages"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}