{
  "created_at": "2025-01-06T02:40:27.184444+00:00",
  "objectID": "98000c30c4221ef9fcf5f690a6c5f0f7",
  "ref": "kersey-walking-route",
  "title": "Kersey Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8a/In_Kersey_village_-_geograph.org.uk_-_1474471.jpg",
  "nearby": [
    {
      "description": "Dedham Vale",
      "objectID": "23861d638b53f649b1111e45fbc5f183",
      "ref": "dedham-vale-walking-route"
    },
    {
      "description": "Dedham to Flatford Walk",
      "objectID": "b201a942f3cfd11bd39de6f961300dec",
      "ref": "dedham-to-flatford-walk-walking-route"
    },
    {
      "description": "Hadleigh Railway Walk",
      "objectID": "2e126846c9187a5678141400b4c8808d",
      "ref": "hadleigh-railway-walk-walking-route"
    },
    {
      "description": "Flatford Mill",
      "objectID": "eec84ad71b6541ce7a0ed4e4c05ef87a",
      "ref": "flatford-mill-walking-route"
    },
    {
      "description": "Stour Valley Path",
      "objectID": "6520fddacf3da51173f572c2fb90f7d2",
      "ref": "stour-valley-path-walking-route"
    },
    {
      "description": "Lavenham Circular Walk",
      "objectID": "945ec4c0f22410d6842942283b3524c9",
      "ref": "lavenham-circular-walk-walking-route"
    },
    {
      "description": "Lavenham",
      "objectID": "e33f94d83bda6bd2a9ca9f9102e8ebee",
      "ref": "lavenham-walking-route"
    },
    {
      "description": "East Bergholt",
      "objectID": "47f5efcfdf24145e717874bbd07be061",
      "ref": "east-bergholt-walking-route"
    },
    {
      "description": "Wolves Wood",
      "objectID": "65af6c1b42b841eb0a30b0c58afafc9b",
      "ref": "wolves-wood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/98000c30c4221ef9fcf5f690a6c5f0f7.gpx",
  "_geoloc": {
    "lat": 52.0595421307,
    "lng": 0.9149565602
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/In_Kersey_village_-_geograph.org.uk_-_1474471.jpg",
      "title": "Andrew Hill / In Kersey village",
      "caption": "Looking down to the ford from the south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Village_pump_and_cottage%2C_Kersey_-_geograph.org.uk_-_1474489.jpg",
      "title": "Andrew Hill / Village pump and cottage, Kersey",
      "caption": "Village pump and cottage, Kersey. At the corner at the top of the hill north of the ford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Kersey_ford_-_geograph.org.uk_-_593010.jpg",
      "title": "Bob Jones / Kersey ford",
      "caption": "Kersey ford. The ancient building behind the ford is 'Ye Olde River House'. The former gatehouse has been retained with a more recent house attached."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Countryside_west_of_Kersey_-_geograph.org.uk_-_1474497.jpg",
      "title": "Andrew Hill / Countryside west of Kersey",
      "caption": "Countryside west of Kersey. Looking across the valley. The stream is not named, even on the 1:25,000 map."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Water_splash_Kersey_-_geograph.org.uk_-_588420.jpg",
      "title": "Keith Evans / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Kersey Water Splash. One of the most photgraphed parts of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/St._Peter%27s_church%2C_Lindsey%2C_Suffolk_-_geograph.org.uk_-_191723.jpg",
      "title": "Robert Edwards / St. Peter's church, Lindsey, Suffolk",
      "caption": "St. Peter's church, Lindsey, Suffolk. Lindsey church stands at the centre of a scattered village. It once had a west tower, but it was removed in 1836 and replaced by the weatherboarded bell-turret, which is seen in this picture. The church is basically 14th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/St_James_Chapel%2C_Lindsey_-_geograph.org.uk_-_322310.jpg/256px-St_James_Chapel%2C_Lindsey_-_geograph.org.uk_-_322310.jpg",
      "title": "Joan Vaughan / St James Chapel, Lindsey",
      "caption": "St James Chapel, Lindsey. This thatched chapel dates from the 13th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/The_Bell_Inn_at_Kersey%2C_Suffolk_-_geograph.org.uk_-_113372.jpg",
      "title": "Robert Edwards / The Bell Inn at Kersey, Suffolk",
      "caption": "The Bell Inn at Kersey, Suffolk. This 14th century inn is just one of the many beautiful old listed buildings that make up the village of Kersey, often referred to as the prettiest village in Suffolk."
    }
  ],
  "distance_km": 8.0,
  "description": "This Suffolk based village is regarded as one of the most picturesque villages in East Anglia. A stroll around the village is a real delight and it is also surrounded by some attractive countryside. This circular walk from Kersey explores the countryside to the west of the village around Lindsey. In the village you'll pass the famous Water Splash which runs across its main street and is one of the county’s most documented scenes. There's also a number of delightful cottages, some of which date from the medieval period. The church dates from the 12th century and is also worthy of some investigation. The walk starts in the village and follows public footpaths north west through the countryside to Lindsey. There's a 14th century church, a fine pub and more pretty cottages in this small village. Also of interest is St James's Chapel, a 13th-century thatched chapel under the protection of English Heritage. After exploring the village you then head south to Lindsey Hall and Lindsey Castle before coming to Bridges Farm near Kersey Tye. Here you turn north east to follow footpaths back into the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bell Inn is a fine place for some refreshments after your walk. The 14th century pub is housed in a wonderful timber framed building with a charming interior. Outside there's a lovely garden area to relax in if the sun is shining. They do very good food and have a fine selection of ales too. You can find the pub at postcode IP7 6DY for your sat navs. If you fancy a break on the route then stop off at the Lindsey Rose in Lindsey. It's another splendid old village pub dating back over 500 years. There's an open log fire, some fine cask ales and a garden area too. You can find it at The Tye, Lindsey, IP7 6PP."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails are a nice place to take your dog for a walk. The Bell Inn and Lindsey Rose pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Kersey is located just a couple of miles north west of Hadleigh where you can enjoy trails along the River Brett and pick up the Hadleigh Railway Walk. This shared cycling and walking trail takes you along the trackbed of the old Hadleigh Railway line from Hadleigh to Raydon Wood railway station. Near here you can also visit the wildlife rich Wolves Wood which is owned by the RSPB. A few miles north west there's another pretty Suffolk village at Lavenham where you can try the Lavenham Circular Walk. Just to the south there's the Dedham Vale AONB where there's some wonderful scenery. Here you can try the Dedham to Flatford Walk and visit Flatford Mill, the site of Constable's most famous painting. His birthplace at East Bergholt is also nearby and well worth visiting. You can pick up the Stour Valley Path in this area and enjoy riverside trails. The village is not from Ipswich where there's nice trails to try along the River Orwell and the River Gipping. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/kNM34jEKS8A",
  "postcode": "IP7 6ED",
  "district": "Babergh",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Street, Kersey, Babergh, Suffolk, England, IP7 6ED, United Kingdom",
  "state": "England"
}