{
  "created_at": "2025-01-05T23:45:35.805892+00:00",
  "objectID": "98321fb9bfd8602cf8a5a510a72a7e57",
  "ref": "southwick-country-park-walking-route",
  "title": "Southwick Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Entrance_track%2C_Southwick_Country_Park_-_geograph.org.uk_-_877588.jpg",
  "nearby": [
    {
      "description": "Bradford on Avon Canal and River Walk",
      "objectID": "894b72e8509ad0d9282c08ad12367482",
      "ref": "bradford-on-avon-canal-and-river-walk-walking-route"
    },
    {
      "description": "Trowbridge Park and River Walk",
      "objectID": "d4ac385601adcbfd4b10682750a183df",
      "ref": "trowbridge-park-and-river-walk-walking-route"
    },
    {
      "description": "Biss Meadows Country Park",
      "objectID": "ddd19d43818db9f4e1cf5b5c9f8c662e",
      "ref": "biss-meadows-country-park-walking-and-cycle-route"
    },
    {
      "description": "Westbury White Horse",
      "objectID": "ec48d6976520c8bb9d93d0a7ddbd3b0a",
      "ref": "westbury-white-horse-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/98321fb9bfd8602cf8a5a510a72a7e57.gpx",
  "_geoloc": {
    "lat": 51.3028830033,
    "lng": -2.2318992158
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Entrance_track%2C_Southwick_Country_Park_-_geograph.org.uk_-_877588.jpg",
      "title": "Philip Reed / Entrance track, Southwick Country Park",
      "caption": "Entrance track. A view looking backwards down the entrance track of Southwick Country Park, showing the large oak tree at the entrance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Southwick_Country_Park_-_geograph.org.uk_-_221928.jpg",
      "title": "Alan Cooper / Southwick Country Park",
      "caption": "Part of Southwick Country Park just outside Trowbridge on the road to Frome. Over 1,000 trees have been planted throughout the 100 acre park which has paths and picnic areas. In the far distance in the very centre of the photo, as a white spot, is the Westbury White Horse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_Farmhouse_Inn%2C_Southwick_-_geograph.org.uk_-_1587418.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Farmhouse Inn, in Southwick village. Built in the 17th century this building was originally a farmhouse before becoming an inn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Arboretum_at_Southwick_Country_Park_-_geograph.org.uk_-_221922.jpg",
      "title": "Alan Cooper / Arboretum at Southwick Country Park",
      "caption": "Arboretum. This arboretum was planted in 1990s with support from the International Tree Foundation. Over 1,000 trees have been planted throughout the 100 acre park which has paths and picnic areas. In the distance is St John's Church in Frome Road on the edge of Trowbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/The_Spirit_of_the_parkrunner_-_geograph.org.uk_-_3306870.jpg?20220313092118",
      "title": "The Spirit of the parkrunner by Shaun Ferguson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Spirit of the parkrunner sculpture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/The_Old_Post_Office_-_geograph.org.uk_-_635077.jpg?20110207103912",
      "title": "Maurice Pullin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Old Post Office in the village. The village lies close to the Somerset border, which is approximately one mile to the south-west. The surrounding villages include Rode, situated about 2 miles (3 km) to the south-west, and North Bradley, just a mile to the east. The Lambrok Stream, a tributary of the River Biss, flows near the village. It is fed by streams originating from the south and west of the parish. This stream flows to the south-east of Southwick before turning to form part of the parish's north-eastern boundary, which borders Trowbridge. The stream is an important geographical feature, contributing to the area's drainage and natural landscape."
    }
  ],
  "distance_km": 4.0,
  "description": "Southwick Country Park is a popular place for walkers with a series of well laid out walking paths linking a series of fields. It is located on the edge of Trowbridge in Wiltshire. This walk takes you through the 100 acre site and into the surrounding countryside where you can see woodpeckers, buzzards and water voles. There is also a nature centre where you can feed the animals. See the video below for more details of this. To continue your walking in the area you could try our Trowbridge Park and River Walk which visits the lovely sensory garden in the park. Biss Meadows Country Park is also nearby and has some good riverside trails to try. The park is also located close to the town of Bradford on Avon where you can extend your walking along the Kennet and Avon Canal and the River Avon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a nice on site cafe where you can enjoy refreshments after your walk. If you fancy a pub lunch then head into nearby Southwick and you could visit The Farmhouse. It's an historic pub full of character, being housed in a 17th century building. They do great home cooked food and have a nice garden area for warmer days. They can be found on Frome Road at postcode BA14 9QD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The large fields and woodland areas are ideal for dog walking. It's a popular place so you're likely to see other owners on your visit. The Farmhouse pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head just a couple of miles east of the park and you'll come to the delightful Clanger Wood. The woods have some nice easy trails with flora and fauna including the nuthatch, butterflies and carpets of bluebells in the spring. To the south there's the popular climb to the Westbury White Horse where you can enjoy wonderful views from the elevated hill figure. North of the town there's also the delightful village of Holt where there are two historic National Trust properties with beautiful gardens. For more walking ideas in the area see the Wiltshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jt4RfoilxAk",
  "postcode": "BA14 9QD",
  "district": "Trowbridge",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hope Nature Centre, Southwick Country Park, Southwick, Trowbridge, Wiltshire, England, BA14 9QD, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "grassland",
    "countryside"
  ],
  "points_of_interest": [
    "nature center",
    "wildlife viewing"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "loop",
  "activities": [
    "walking"
  ]
}