{
  "created_at": "2025-01-05T23:44:53.152133+00:00",
  "objectID": "985fb8ce79be69d07f91387902469052",
  "ref": "cliveden-house-walking-route",
  "title": "Cliveden Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Cliveden_%287311006446%29.jpg/512px-Cliveden_%287311006446%29.jpg",
  "nearby": [
    {
      "description": "Burnham Beeches",
      "objectID": "544a0e54f113cb0580e8c889e13c32e0",
      "ref": "burnham-beeches-walking-and-cycle-route"
    },
    {
      "description": "Beeches Way",
      "objectID": "33076677d305a9d062a06b14a04ffab3",
      "ref": "beeches-way-walking-route"
    },
    {
      "description": "Bisham Woods",
      "objectID": "748aa1bdb74d1496e530b5470639c8c9",
      "ref": "bisham-woods-walking-and-cycle-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Shakespeare's Way",
      "objectID": "615b47375e17aba190c6894edd0b8f5f",
      "ref": "shakespeares-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/985fb8ce79be69d07f91387902469052.gpx",
  "_geoloc": {
    "lat": 51.5616931985,
    "lng": -0.6868663218
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Cliveden_%287311006446%29.jpg/512px-Cliveden_%287311006446%29.jpg",
      "title": "Timo Newton-Syms from Helsinki, Finland and Chalfont St Giles, Bucks, UK [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cliveden House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Cliveden_-_Afternoon_view_over_the_Parterres_-_panoramio.jpg/512px-Cliveden_-_Afternoon_view_over_the_Parterres_-_panoramio.jpg",
      "title": "Adrian Farwell [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Afternoon view over the Parterres"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/River_Thames_at_Cliveden_%28geograph_4464305%29.jpg/512px-River_Thames_at_Cliveden_%28geograph_4464305%29.jpg",
      "title": "Des Blenkinsopp / River Thames at Cliveden",
      "caption": "River Thames at Cliveden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Cliveden_grounds-geograph-2579860.jpg",
      "title": "Graham Horn / Cliveden grounds",
      "caption": "Walkers in the grounds. There is a wide variety of routes to follow in the Cliveden grounds, and a plan is handy. This one passes Seven Gables Cottage, formerly estate cottages now holiday lets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/The_Gas_Yard%2C_Cliveden_-_geograph.org.uk_-_60108.jpg",
      "title": "David Hawgood / The Gas Yard, Cliveden",
      "caption": "The Gas Yard. This is the estate yard of Cliveden. It is just by the National Trust car park. One building is used to show a film including the association of the house with the Astor family and later Christine Keeler. Another building shown here is the forge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Baboon_statues_in_Cliveden_gardens-geograph-2579476.jpg",
      "title": "Graham Horn / Cliveden gardens",
      "caption": "This pair of granite baboon statues has recently been returned to Cliveden after 40 years. They are 2,500 years old and originally made to flank the entrance to a temple of Thoth in ancient Egypt. They were purchased in 1898 by William Waldorf Astor for the grounds at the house, and sometime during the 1960s were moved to another Astor residence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Pagoda%2C_Cliveden_-_geograph.org.uk_-_1606088.jpg/256px-Pagoda%2C_Cliveden_-_geograph.org.uk_-_1606088.jpg",
      "title": "Derek Harper / Pagoda, Cliveden",
      "caption": "Pagoda. \"Exhibited at Paris Exhibition 1867 and bought from Lord Hertford's villa in France by Lord Astor\", with a finial in the shape of a fish. It overlooks a pond in the northeast part of the grounds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Cliveden_Reach_-_geograph.org.uk_-_1419392.jpg",
      "title": "Derek Harper / Cliveden Reach",
      "caption": "Cliveden Reach. The Thames looking downstream from its junction with the Cookham Lock Cut. On the left side of the river are the wooded slopes below Cliveden House."
    }
  ],
  "distance_km": 3.0,
  "description": "Explore the stunning gardens and woodlands surrounding this Italianate mansion near Maidenhead. The grounds include several beautifully laid out gardens. The Rose Garden with red, orange and yellow flowers, the oriental water garden with Chinese pagoda and the Long Garden with stunning floral displays and topiary. There are also miles of woodland paths with stunning views back to the gardens and over the surrounding Berkshire countryside. Look out for elephant, bear and tiger wood carvings as you go. The grounds also extend down to the River Thames so there is the opportunity for some waterside walking too. Other highlights include the recently restored maze, a number of exquisite temples, pavilions and follies, and the Fountain of Love located the end of the lime tree avenue which runs up to the house. The house itself is now a luxury hotel but tours are available for the general public. The house has been home to an earl, three countesses, two dukes, a Prince of Wales and the Viscounts Astor. During the 1960s, it became the setting for key events of the notorious Profumo Affair. The Thames Path and the Shakespeare's Way walking routes run past Cliveden. Both of these are good options if you would like to continue your walk. You could also head west to Bisham Woods where there are miles of good walking trails and mountain bike tracks to try. The Beeches Way runs past the northern edge of Cliveden. If you pick this up and head east you will soon come to the splendid Burnham Beeches Nature Reserve. The popular site covers over 500 acres with a network of woodland trails. There's also ponds, grassland, heathland with wildlife including Exmoor Ponies.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Conservatory Café is a nice place to stop of for some refreshments on your walk. They do a good range of meals and snacks in a lovely setting."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The estate is a fine place for a dog walk and you are sure to see plenty of other dogs on pleasant day. Most of the estate is open to dog walkers with the exception of the Water Garden, Parterre lawn and some of the buildings including the Chapel, Orangery and the House itself. Some areas are also off lead too with the National Trust providing a map at the information point."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The house is strongly associated with the Profumo Affair of the 1960s. Conservative politician John Profumo and Christine Keeler met at the house in 1961. They subsequently started an affair which was to force his resignation, severley damage the government of the time, and create a lasting impact on the future course of British politics. Just to the north there's the neighbouring village of Wooburn Green. There's a pleasant large green here with a number of historic properties including a 16th century public house. There's also a pretty local park with walks along the River Wye and peaceful adjacent woodland. You can pick up the Beeches Way just to the north of the house and follow it towards the worthy settlement."
    }
  ],
  "video_url": "https://www.youtube.com/embed/B4IQwHw9R5c",
  "county": "Buckinghamshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}