{
  "objectID": "9890d17074a6985cd548d989e3b5822d",
  "created_at": "2024-12-18T01:03:45.433583+00:00",
  "ref": "mid-wilts-way-walking-route",
  "title": "Mid-Wilts Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Bridleway_near_Horningsham_-_geograph.org.uk_-_1388279.jpg",
  "nearby": [
    {
      "description": "Cley Hill",
      "objectID": "f9e00a5a027fca7279f1ee6f84df2b21",
      "ref": "cley-hill-walking-route"
    },
    {
      "description": "Kennet and Avon Canal Walk",
      "objectID": "0c879db862142efde19b17abd060ac05",
      "ref": "kennet-and-avon-canal-walk-walking-route"
    },
    {
      "description": "White Horse Trail",
      "objectID": "f8439cbeac9e3bb5a4852659b79a5429",
      "ref": "white-horse-trail-walking-route"
    },
    {
      "description": "Inkpen",
      "objectID": "8e0242a41276b78e4d059bee461837cc",
      "ref": "inkpen-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9890d17074a6985cd548d989e3b5822d.gpx",
  "_geoloc": {
    "lat": 51.3654901619,
    "lng": -1.5259441762
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Bridleway_near_Horningsham_-_geograph.org.uk_-_1388279.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridleway near Horningsham. The bridleway takes walkers and riders to Bidcombe Wood and it is part of the Mid Wilts Way. The MWW start in Wootton Rivers SU1962 and ends 55 miles later in Mere ST8132. The walk was devised by James Alsop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Roundway_Hill_Covert%2C_near_Heddington_-_geograph.org.uk_-_1536416.jpg",
      "title": "Brian Robert Marshall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Roundway Hill Covert, near Heddington. This is a view of the Covert from the Mid Wilts Way, which passes the northern edge. The covert is quite large at over a kilometre in length and about 300 metres in width on average. It seems to be mostly deciduous with beeches being a particular feature."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Bridleway_to_Roundway_Hill_Covert%2C_near_Heddington_-_geograph.org.uk_-_1536340.jpg",
      "title": "Brian Robert Marshall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridleway to Roundway Hill Covert, near Heddington. The bridleway is unnamed at this point as the Way diverts to the west towards Oliver's Castle before this point is reached. The bridleway rejoins the Way at the treeline in the distance, which also marks the northern point of the Covert."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Gone_fishin%27_-_geograph.org.uk_-_1690552.jpg/512px-Gone_fishin%27_-_geograph.org.uk_-_1690552.jpg",
      "title": "Roger Gittins / Gone fishin'",
      "caption": "Gone fishin' Lone fisherman, lower lock pond on the Kennet and Avon Canal. 16 locks of the Caen Hill flight can be seen in the distance rising approximately 45m. The towpath forms part of the Way and White Horse Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Access_land_west_of_the_Mid_Wilts_Way_near_Heddington_-_geograph.org.uk_-_1535578.jpg",
      "title": "Brian Robert Marshall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Access land west of the Way near Heddington. Beacon Hill is a pleasant and popular area of access land. In essence it is a predominantly west-facing chalk escarpment. Peaceful now, once it was the site of the end-game of the Battle of Roundway Down that took place during the English Civil War. On the 13th July 1643, had you been an observer here, you would have seen the routed cavalry of the Parliamentary forces seeking to escape Royalist forces tumbling end over end down this scarp into what became known as 'Bloody Ditch'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Beacon_Hill_access_land%2C_near_Heddington_-_geograph.org.uk_-_1536656.jpg",
      "title": "Brian Robert Marshall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Beacon Hill access land. The viewpoint is the Way along its diversion around Oliver's Castle. Seen here is some of the unimproved chalk grassland for which Wiltshire is famous - more than half of Britain's such land is in the County. The area is held within Netherstreet Farm. In the years after the 1950s agricultural production was focused on cereal production and cattle and sheep disappeared from the area leading to the cultivation of the lower reaches of the hill. The steepness of the remaining downland meant that it stayed free of such attention. The absence of livestock in turn allowed longer grasses to grow together with taller plants such as knapweed, devil's bit scabious and the rare round-headed rampion. In parts where the grass remained shorter because of thinner soils wild plants including horseshoe vetch, wild thyme and bird's-foot trefoil can be found together with several types of orchid. The diversity of flora allows for a number of butterfly species to flourish such as the common blue, chalk hill blue, marbled white, green hairstreak and the rare adonis blue. In recent years livestock has been returned to former arable land as part of a government-funded scheme to retain and stabilise the bio-diversity of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Towpath_Underpass_-_geograph.org.uk_-_1690492.jpg/512px-Towpath_Underpass_-_geograph.org.uk_-_1690492.jpg",
      "title": "Roger Gittins / Towpath Underpass",
      "caption": "Towpath Underpass. Kennet and Avon canal towpath under B3101. The towpath is also part of the Way and White Horse Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Field_near_the_Mid_Wilts_Way%2C_near_Heddington_-_geograph.org.uk_-_1535530.jpg",
      "title": "Brian Robert Marshall, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Near Heddington In the distance is Roundway Hill"
    }
  ],
  "distance_km": 109.0,
  "description": "A 68-mile walking route that takes in some of Wiltshire's finest countryside and downland areas. The walk runs from the village of Ham (near Inkpen ) to Mere (near Warminster ). You will visit a series of pretty villages including Wilton, Wootton Rivers, Oare, Seend Cleeve, Keevil, Steeple Ashton, Bratton, Upton Scudamore, Horningham and Kingston Deverill. The walk includes several hill climbs with fabulous views of the Wiltshire countryside. This includes a climb to Cley Hill in the Cranborne Chase AONB. The hill is owned by the National Trust and commands great views over Wiltshire and Somerset. There are also long waterside sections along the Kennet and Avon Canal and a section through Longleat Center Parcs towards the end of the walk. The route is now officially open and has been waymarked with discrete MWW discs. The Visit Wiltshire website has some excellent downloadable guides. Please note the route has recently been extended so this link does not include the full current route.",
  "postcode": "SN8 3RD",
  "district": "Ham",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England"
}