{
  "objectID": "98d04a210aca59b1c01f160d7619b2d2",
  "created_at": "2024-12-21T09:37:32.140508+00:00",
  "ref": "ballinamore-canal-walk",
  "title": "Ballinamore Canal Walk on the Shannon Erne Waterway Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/Canal_basin%2C_Ballinamore_-_geograph.org.uk_-_3667670.jpg?20220808115705",
  "nearby": [
    {
      "description": "Carrick On Shannon",
      "objectID": "8da718cee891050c122234771ec652a6",
      "ref": "carrick-on-shannon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/98d04a210aca59b1c01f160d7619b2d2.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Canal_basin%2C_Ballinamore_-_geograph.org.uk_-_3667670.jpg?20220808115705",
      "title": "Canal basin, Ballinamore by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Canal basin, Ballinamore"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Aghoo_Lock_-_geograph.org.uk_-_1405844.jpg?20110301113931",
      "title": "Oliver Dixon / Aghoo Lock",
      "caption": "Aghoo Lock. The first attempts to construct a canal linking the Shannon and Erne dated back to 1780, but it was not until 1847 that construction of what was then known as the Ballinamore and Ballyconnell Canal started in earnest. By the time of completion in 1858, money had run out, competition from the railways severely impacted on the canal's commercial viability, and the requirements of drainage over-rode the requirements of navigation. Over the course of nine years, only eight boats were recorded as using the canal (although others probably did so without paying their dues). The canal was thereupon abandoned for navigation and the construction of railway bridges with low headroom over the canal put the final nails in the coffin of a project which had never been properly completed in the first place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/The_quayside_at_Ballinamore_-_geograph.org.uk_-_3667673.jpg?20220808115759",
      "title": "The quayside at Ballinamore by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The quayside at Ballinamore. The idea of connecting the two main river systems of Ireland was revived in 1988 as a flagship project of cooperation between the Irish Republic and Northern Ireland. Work started in 1990 with completion in 1994. Essentially a new construction along the line of the old canal, the waterway links a number of loughs along the way. The canal is 61 km long and links the Shannon at Leitrim village with the Erne downstream from Belturbet. There are 16 locks on the canal; the Aghoo Lock is the fifth on the eastern section on the descent from the summit level of Lough Scur, bringing the waterway down to the level of Garadice Lough. This image shows the upper lock gates open. The Waterway is a major tourist attraction - not only being used by boats, but also followed by a waymarked footpath and scenic drive. The Kingfisher Trail, the first signed cycle route to be established in Ireland, follows parts of the Waterway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Main_Street%2C_Ballinamore_-_geograph.org.uk_-_3667566.jpg?20220808112347",
      "title": "Main Street, Ballinamore by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Main Street, Ballinamore"
    }
  ],
  "distance_km": 7.8,
  "description": "This walk follows the Shannon Erne Waterway from Ballinamore in the south-east of County Leitrim. The canal links the River Shannon in the Republic of Ireland with the River Erne in Northern Ireland. You can follow pleasant footpaths south along the canal from Ballinamore and enjoy some lovely views of the countryside on the way. Much of the path is also suitable for cyclists. You can continue your waterside walking in the area by heading to nearby Ballyconnell where you can enjoy a stroll along the canalised section of the Woodford River on the Ballyconnell Canal Walk ."
}