{
  "created_at": "2025-01-06T00:48:46.213222+00:00",
  "objectID": "98f5c162ad30cbe58662827924002061",
  "ref": "serpent-trail-walking-route",
  "title": "Serpent Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Crosstracks_on_the_Serpent_Trail_-_geograph.org.uk_-_1071932.jpg",
  "nearby": [
    {
      "description": "Lavington Common",
      "objectID": "d3985a05a4b9c7c4f68806efe4dc96e1",
      "ref": "lavington-common-walking-route"
    },
    {
      "description": "Petersfield Lake and Heath",
      "objectID": "30dbdb2eea6c25dda6b190fa569d79f5",
      "ref": "petersfield-lake-and-heath-walking-route"
    },
    {
      "description": "Marley Common",
      "objectID": "fe2aafb35f896af21adbfe47446ff1c8",
      "ref": "marley-common-walking-route"
    },
    {
      "description": "Iping Common and Stedham Common",
      "objectID": "3577a8e4b9b3dcb503e96958b2dab7d0",
      "ref": "iping-common-and-stedham-common-walking-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Black Down",
      "objectID": "d13d828818d1e801d378aaf4cb507128",
      "ref": "black-down-walking-and-cycle-route"
    },
    {
      "description": "Haslemere Circular Walk",
      "objectID": "2a099cac05f6f1c64128d29444c98175",
      "ref": "haslemere-circular-walk-walking-route"
    },
    {
      "description": "Liss",
      "objectID": "8babad3e7ee63144b35134ad4cadb1e5",
      "ref": "liss-walking-route"
    },
    {
      "description": "Midhurst Way",
      "objectID": "845705544ed938877ca9e35d73469ba4",
      "ref": "midhurst-way-walking-route"
    },
    {
      "description": "Petworth Park",
      "objectID": "89bd9d3a35d1f461b60a41e10460f256",
      "ref": "petworth-park-walking-route"
    },
    {
      "description": "Burton Mill Pond",
      "objectID": "b0c5f25c4d330d8bfb87ffb8a288bcd7",
      "ref": "burton-mill-pond-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/98f5c162ad30cbe58662827924002061.gpx",
  "_geoloc": {
    "lat": 51.0892417814,
    "lng": -0.7082780011
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Crosstracks_on_the_Serpent_Trail_-_geograph.org.uk_-_1071932.jpg",
      "title": "Shazz / Crosstracks on the Serpent Trail",
      "caption": "Crosstracks on the Serpent Trail. The tarmac road is a public footpath. There is a stile by the rucksack to a grass path. In the distance is St Michael's church at Burton Park. The Serpent Trail is 64 miles long winding from Haslemere to Petersfield which are only 11 miles apart in a straight line"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Triangulation_Pillar_on_the_Serpent_Trail_-_geograph.org.uk_-_1071969.jpg",
      "title": "Shazz / Triangulation Pillar on the Serpent Trail",
      "caption": "Triangulation Pillar on the Serpent Trail. This pillar is on Hesworth Common near Fittleworth. Note the pretty heather around the pillar"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Cattle_grazing_on_the_Serpent_Trail_-_geograph.org.uk_-_1071937.jpg",
      "title": "Shazz / Cattle grazing on the Serpent Trail",
      "caption": "Cattle grazing on the Serpent Trail. This is on Lavington Common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/The_edge_of_Black_Down_on_the_Serpent_Trail_-_geograph.org.uk_-_1071961.jpg",
      "title": "Shazz / The edge of Black Down on the Serpent Trail",
      "caption": "The edge of Black Down on the Serpent Trail. In the distance are the South Downs from this elevated section of the trail. Blackdown is the highest point in both the historic county of Sussex and the South Downs National Park. It is also one of the highest points in the south east of England, exceeded by Walbury Hill and Leith Hill. There are several footpaths from the surrounding villages including a steep walk up the southern escarpment from Lurgashall. Blackdown is also well known as the site of the poet Tennyson's houses, Aldworth and Foxholes. Keen to escape the summer 'trippers' who came to his Isle of Wight home, Farringford House, Tennyson purchased Blackdown, and built Aldworth in 1869.  There are three National Trust car parks at the site and the Sussex Border Path can also be picked up here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Deer_in_Petworth_Park._-_geograph.org.uk_-_175596.jpg",
      "title": "Colin Smith / Deer in Petworth Park.",
      "caption": "Deer in Petworth Park. The route runs along the southern side of Petworth Park near Petworth village. The park is one of the highlights of the walk and includes 700 acres of parkland with a lake, resident deer and 'Capability' Brown landscaped grounds. The park surrounds the historic 17th-century mansion which contains galleries, fine furniture and sculptures."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Heather_on_Stedham_Common_-_geograph.org.uk_-_1071974.jpg",
      "title": "Shazz / Heather on Stedham Common",
      "caption": "Heather on Stedham Common. Seen on the Serpent Trail and in the distance above the trees a glimpse of the South Downs. The area is described by Natural England as one of the richest areas of heath in the county. It is mostly dry heath but there are also areas of wet heath, two ponds, woodland, scrub and grassland. It has a rich invertebrate fauna and breeding heathland birds include nightjars and stonechats. There are views of the River Rother just to the north of the common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Fairytale_walk_through_the_woods_-_geograph.org.uk_-_1071948.jpg",
      "title": "Shazz / Fairytale walk through the woods",
      "caption": "Fairytale walk through the woods. This is on the land known as Severals, on the Serpent Trail near Midhurst."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Heath_Pond%2C_Petersfield_-_geograph.org.uk_-_317846.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Heath Lake, Petersfield, at the end of the walk. The lake was created by farmers from marsh land around the end of the 18th C. The 22 acre lake is now a major recreational facility for the town. There's also footpaths branching off across the adjacent heath with areas of grassland and bronze age burial mounds to look out for."
    }
  ],
  "distance_km": 103.0,
  "description": "This walk runs from Haslemere to Petersfield through the beautiful Sussex greensand hills. The path takes its name both from its serpentine shape and from passing through the habitat of all three British species of snake. The route crosses many heathland areas and heads along the greensand ridges in the western Weald, visiting Liphook, Milland, Fernhurst, Petworth Park, Fittleworth, Duncton, Burton Mill Pond, Heyshott, Midhurst, Stedham and Nyewood before reaching the serpent's tail at Petersfield Lake and Heath in Hampshire. The trail is waymarked with white plastic discs showing a snake in the approximate shape of the route on a purple triangle. Route highlights include a climb to the highest point on the South Downs at Black Down in West Sussex. You'll also visit the pretty Iping and Stedham Commons near Midhurst.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Petersfield you can stop for refreshments at The Old Drum on Chapel St at postcode GU32 3DP. The contemporary country pub is located in the centre of Petersfield and has a lovely beer garden. Built in the 18th Century, it is the oldest in the area and has been beautifully restored to keep its character and charm. In Midhurst you can visit the noteworthy Royal Oak. The 17th century pub includes a splendid large garden area with an outdoor grill. It's a lovely place to relax with a meal on finer days. You can find them near Goodwood on Oaklands Lane at a postcode of GU29 0EP for your sat navs. In Liphook there's the 17th century Deers Hut to investigate. The historic pub is set in a former Queen Anne Hunting Lodge dating back to the 1600's. They serve a delicious Sunday lunch and have a lovely garden to sit out in on warmer days. You can find them at Longmoor Rd, Griggs Green, GU30 7PD. In Fittleworth the Swan is something of an historic gem on the walk. The pub dates to the 14th century and has a charming interior adorned with numerous paintings depicting the local scenery. Notably, the pub was frequented by Edward Elgar, the renowned music composer, and Hubert Parry, famous for composing 'Jerusalem'. Rudyard Kipling, another regular guest, is honoured with quotes from his 'Jungle Book' embellishing the beams in the bar. You can find them at postcode RH20 1EN."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Midhurst you can pick up the Midhurst Way and visit the splendid Cowdray Park. There's the ruins of a an old castle here with a fascinating history attached to it. The old town part of Midhurst is also well worth exploring with some fine medieval architecture to see. For more walking ideas in the area see the Sussex Walks and South Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bqBhvQ1aM3c",
  "district": "Waverley",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Nail Perfectionists, Well Lane, Haslemere, Waverley, Surrey, England, GU27 2LA, United Kingdom",
  "postcode": "GU27 2LA",
  "state": "England"
}