{
  "created_at": "2025-01-06T19:05:39.379380+00:00",
  "objectID": "9908f1511350c4d9e4a0fe63ab65b5a6",
  "ref": "ravensbourne-river-walk-walking-route",
  "title": "Ravensbourne River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c3/The_River_Ravensbourne_west_of_Calmont_Road%2C_BR1_%2815%29_-_geograph.org.uk_-_2258104.jpg?20210630140702",
  "nearby": [
    {
      "description": "Beckenham Place Park",
      "objectID": "4fbe9ca16ee8c9430b911828385aa596",
      "ref": "beckenham-place-park-walking-route"
    },
    {
      "description": "Three Commons",
      "objectID": "89a19922a1818a87302a4964f36f2b26",
      "ref": "three-commons-walking-route"
    },
    {
      "description": "Keston Common",
      "objectID": "1dea12b5e9df69967dc90601adb7cbe0",
      "ref": "keston-common-walking-route"
    },
    {
      "description": "Hayes Common",
      "objectID": "569ed3abd77beb78a0b69aa433e2b599",
      "ref": "hayes-common-walking-route"
    },
    {
      "description": "Waterlink Way",
      "objectID": "51a43c01c022b5bf2991dbe4370be276",
      "ref": "waterlink-way-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9908f1511350c4d9e4a0fe63ab65b5a6.gpx",
  "_geoloc": {
    "lat": 51.41642,
    "lng": -0.00596
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/The_River_Ravensbourne_west_of_Calmont_Road%2C_BR1_%2815%29_-_geograph.org.uk_-_2258104.jpg?20210630140702",
      "title": "The River Ravensbourne west of Calmont Road, BR1 (15) by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The River Ravensbourne is an important tributary of the River Thames, flowing through South London before it merges with the Thames at Deptford, where its tidal section is known as Deptford Creek. This 11-mile (17 km) river travels through the boroughs of Bromley, Lewisham, and Greenwich, and has a total catchment area of about 180 square kilometres. The river originates from Caesar's Well in Keston, located to the south of Bromley town centre. From there, it flows northward, crossing various common lands and being joined by several branches, including the Ravensbourne South and East branches, which significantly increase its volume. The river then continues through various parks and urban areas, including Beckenham Place Park and Ladywell Fields, where significant restoration work has been done to return parts of the river to a more natural state."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/The_River_Ravensbourne_-_geograph.org.uk_-_2237720.jpg?20210627022004",
      "title": "The River Ravensbourne by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Ravensbourne forms part of the boundary between several parishes and has a rich history, with its name first recorded as Randesbourne in 1360. Throughout its course, the river has seen many historical events, such as the Battle of Deptford Bridge in 1497, and has been integral to local industry, including housing corn mills as noted in the Domesday Book. Over the centuries, the area around Deptford Creek became a hub for shipbuilding and other heavy industries, largely driven by its proximity to Deptford Dockyard, a significant Royal Dockyard."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Public_open_space_south_of_Brangbourne_Road%2C_BR1_-_geograph.org.uk_-_2258245.jpg?20210630144623",
      "title": "Public open space south of Brangbourne Road, BR1 by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Public open space south of Brangbourne Road, BR1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Duckboards_over_the_River_Ravensbourne_in_Padmall_Wood_-_geograph.org.uk_-_2271128.jpg?20210703012438",
      "title": "Duckboards over the River Ravensbourne in Padmall Wood by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Duckboards over the River Ravensbourne in Padmall Wood. These woods are located between Keston and Hayes Common. Padmall Wood is a semi-natural ancient woodland and Local Nature Reserve (LNR), located along the banks of the River Ravensbourne, just north of Ravensbourne Open Space. This woodland has a long history, with its sweet chestnut trees having been planted in the 19th century. Historically, the chestnut was harvested every 15 to 20 years, primarily for the production of hop poles and heavy hurdles, though today, it's used mainly for post and rail fencing. The wood also contains birch trees, traditionally utilised for making broom handles and cotton reels, and hazel, a versatile wood historically important in the construction of wattle and daub house walls. Hazel continues to be used for wicker hurdles, hedging, and bean poles. The diversity of tree species in Padmall Wood reflects its long-standing use and the traditional woodland management practices that have shaped it over the centuries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Caesar%27s_Well_in_Keston.jpg/512px-Caesar%27s_Well_in_Keston.jpg?20180923210552",
      "title": "Ethan Doyle White, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Caesar's Well in Keston. In recent years, the area around the lower reaches of the Ravensbourne and Deptford Creek has undergone significant regeneration, with new residential developments and cultural institutions like the Laban Dance Centre revitalizing the riverside. The Docklands Light Railway (DLR) also closely follows the river's course between Lewisham and Greenwich. Additionally, the Ravensbourne River has influenced local culture, with annual May Day celebrations at its source in Caesar's Well by the Ravensbourne Morris Men. The river's name was even used for a parliamentary constituency between 1974 and 1997. The Ravensbourne continues to play a vital role in the ecology and history of the areas it flows through, contributing to both the natural environment and the cultural heritage of South London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/River_Ravensbourne_-_geograph.org.uk_-_3168395.jpg?20220201195657",
      "title": "River Ravensbourne by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Ravensbourne"
    }
  ],
  "distance_km": 1.4,
  "description": "This walk takes you along the Ravensbourne Greenway on the eastern side of Beckenham Place Park on the border of the London Boroughs of Lewisham and Bromley. The shared walking and cycling trail takes you along the River Ravensbourne with some nice views across the expansive park. You can continue your walking along the river on the Three Commons Walk which visits Keston Common, Hayes Common and Padmall Wood (pictured below). There's also the Waterlink Way which runs along the nearby Pool River.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/ymC0kOCgxhM?si=e0gVCNKzJ1ikq-W5",
  "postcode": "BR3 5HG",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ravensbourne Greenway, Southend, London Borough of Lewisham, London, Greater London, England, BR3 5HG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "park",
    "common",
    "wood"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}