{
  "created_at": "2025-01-06T01:34:07.374456+00:00",
  "objectID": "991e111ff7aed6a1c76d339c12e1ed7b",
  "ref": "castle-acre-walking-route",
  "title": "Castle Acre Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Castle_Acre_-_geograph.org.uk_-_578494.jpg",
  "nearby": [
    {
      "description": "Nar Valley Way",
      "objectID": "38bb691f170838e05ddfd5fc8732c107",
      "ref": "nar-valley-way-walking-route"
    },
    {
      "description": "Peddars Way and Norfolk Coast Path",
      "objectID": "4e358890f1c641370cd442450ff77e93",
      "ref": "peddars-way-and-norfolk-coast-path-walking-route"
    },
    {
      "description": "Castle Rising",
      "objectID": "9b8149d1c153ef9eedc423113d4bf6f1",
      "ref": "castle-rising-walking-route"
    },
    {
      "description": "Bawsey Pits",
      "objectID": "409141b650142b9cd84f56c11c09309b",
      "ref": "bawsey-pits-walking-route"
    },
    {
      "description": "King's Lynn and The Walks",
      "objectID": "56652f8a61235771b1c5a95d57616747",
      "ref": "kings-lynn-and-the-walks-walking-route"
    },
    {
      "description": "Swaffham",
      "objectID": "47fe2b84e982a33945289286149a7a00",
      "ref": "swaffham-walking-route"
    },
    {
      "description": "Dersingham Bog",
      "objectID": "38b8ad630bfe6c864e0469c804ffe5f6",
      "ref": "dersingham-bog-walking-route"
    },
    {
      "description": "Roydon Common",
      "objectID": "98297160a7218ab00857bff2c07903e9",
      "ref": "roydon-common-walking-route"
    },
    {
      "description": "Great Massingham",
      "objectID": "69cecf30872eea75e93e9df4cbb428ea",
      "ref": "great-massingham-walking-route"
    },
    {
      "description": "Litcham",
      "objectID": "71654046aa9486d7410bad72c722b9be",
      "ref": "litcham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/991e111ff7aed6a1c76d339c12e1ed7b.gpx",
  "_geoloc": {
    "lat": 52.7030881577,
    "lng": 0.6897388136
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Castle_Acre_-_geograph.org.uk_-_578494.jpg",
      "title": "Richard Croft / Castle Acre",
      "caption": "View of the ruins and the surrounding countryside from the upper ward"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Castle_Acre_Priory%2C_Castle_Acre%2C_Norfolk_-_geograph.org.uk_-_687676.jpg",
      "title": "Christine Matthews / Castle Acre Priory, Castle Acre, Norfolk",
      "caption": "Castle Acre Priory, Castle Acre, Norfolk. Remains of Castle Acre Priory, which is one of the largest and best preserved monastic sites in England, the foundation of Castle Acre Priory in about 1090 sprang directly from a visit by William de Warenne II and his wife Gundrada to the great French monastery of Cluny. So impressed were they by its beauty and holiness that they vowed to introduce the Cluniac order of monks to England. Through the opening you can see St James's Church in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Castle_Acre_-_geograph.org.uk_-_578560.jpg/256px-Castle_Acre_-_geograph.org.uk_-_578560.jpg",
      "title": "Richard Croft / Castle Acre",
      "caption": "Castle Acre village. Village sign erected to commemorate the Festival of Britain in 1951, the coronation of Her Majesty Queen Elizabeth II in 1953 and refurbished in honour of her Golden Jubilee in 2002"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_castle_at_Castle_Acre%2C_Norfolk_-_geograph.org.uk_-_40546.jpg",
      "title": "Ron Strutt / The castle at Castle Acre, Norfolk",
      "caption": "The massive remains of the castle at Castle Acre in Norfolk. It was begun soon after the Norman conquest and was built by William de Warenne, one of the Conqueror's close associates."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Priory_ruins%2C_Castle_Acre_-_geograph.org.uk_-_1557570.jpg",
      "title": "Evelyn Simak / Priory ruins, Castle Acre",
      "caption": "A fine view of the Priory ruins"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Tea_Rooms%2C_Castle_Acre_-_geograph.org.uk_-_1718489.jpg/512px-Tea_Rooms%2C_Castle_Acre_-_geograph.org.uk_-_1718489.jpg",
      "title": "Gordon Hatton / Tea Rooms, Castle Acre",
      "caption": "Tea rooms and bed & breakfast accommodation located on the High Street in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Gatehouse%2C_Castle_Acre_Priory_-_geograph.org.uk_-_1718416.jpg/512px-Gatehouse%2C_Castle_Acre_Priory_-_geograph.org.uk_-_1718416.jpg",
      "title": "Gordon Hatton / Gatehouse, Castle Acre Priory",
      "caption": "Gatehouse at the Priory. The priory gatehouse as seen from the south side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Field_at_Castle_Acre%2C_Norfolk_-_geograph.org.uk_-_1358122.jpg",
      "title": "nick macneill / Field at Castle Acre, Norfolk",
      "caption": "The field with the church beyond is between the main entrance to the priory and the rest of the village. No animals were grazing."
    }
  ],
  "distance_km": 12.0,
  "description": "This lovely circular walk takes you around the grounds of Castle Acre Priory, before heading along the River Nar to the nearby Castle Acre Common. You can then explore the wider countryside surrounding the village on various footpaths and bridleways. The walk starts at the castle in the centre of this pretty Norfolk village. The remains of the motte-and-bailey castle are well worth exploring before you head off towards the priory. It dates from the 11th century and is in the care of English Heritage. From the castle you head west through the village to the priory. The fascinating and atmospheric ruins date back to the late 11th century. There are substantial remains of many of the buildings round the cloister, a beautiful west end church gable and a herb garden. After exploring the priory you continue west along the Nar Valley Way to West Acre where you can stop for refreshments at the Stag pub. You can then follow other trails through the countryside to Bartholomew's Hills before returning to the village along the Peddars Way and Norfolk Coast Path. If you would like to extend your walk then you can continue along the River Nar to Narford Lake and Narborough, a few miles west of West Acre. Following the Peddars Way and Norfolk Coast Path south will take you towards Swaffham where you'll find some fine Georgian buildings and an interesting medieval church. Head north and you will come to the pretty neighbouring village of Great Massingham. Near here you can pay a visit to the historic Houghton Hall and gardens. You can virtually explore the grounds of the priory on the google street view link below!",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Ostrich Inn for some refreshments after your walk. It's a historic pub of some note, being set in a former coaching inn from the 16th century. The inn is located in a lovely spot by the village green and has a charming olde worlde interior with beams, brick fireplaces and an old stable entrance. Outside there's a beautiful landscaped garden where you can relax on warmer days. They have a great menu and can be found at Stocks Green with a postcode of PE32 2AE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine dog walk. You are asked to keep them on leads in the castle and priory grounds though. The Ostrich pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more interesting local history in the area head to Castle Rising near King's Lynn. Here you'll find the ruins of an English Heritage owned castle surrounded by impressive earthworks. The pretty little village of the same name is also well worth exploring. Just to the north of the village you'll also find Sandringham Country Park. The expansive park surrounds the Queen's famous country retreat. In the park you'll find miles of excellent woodland and parkland walking trails. On the western side of the estate there's also the interesting village of Wolferton. Here you can visit the noteworthy Wolferton Railway Station. The now disused station was well known during the 1800’s through its association with the Royal Family who used the station because of its proximity to Sandringham House. There are also trails to pick up around the Dersingham Bog Nature Reserve in this area. The reserve is part of the wider Sandringham Royal Estate and includes attractive heathland with interesting flora and fauna to see.Bawsey Country Park is also located nearby and has some lovely parkland and lakes with excellent wildlife spotting opportunites. Just north of the park you'll find purple heather and Dartmoor ponies on Roydon Common. Follow the Nar Valley Way west and you will soon come to Shouldham Warren where there are two colour coded waymarked walks. The nature reserve includes beautiful pine woodlands and a fine Rhododendron Avenue. The associated village is also worth seeing with a pretty village green and a 14th century church to see. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/R8J30Wt9NmY",
  "postcode": "PE32 2AJ",
  "district": "King's Lynn and West Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Castle Cottage, Castle Square, Castle Acre, King's Lynn and West Norfolk, Norfolk, England, PE32 2AJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "village",
    "gardens"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}