{
  "created_at": "2025-01-06T02:20:01.443727+00:00",
  "objectID": "99b88b58d3daf665588ad2b92e4de190",
  "ref": "king-arthurs-cave-walking-route",
  "title": "King Arthur's Cave Symonds Yat Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/58/Tranquil_waters_of_the_Wye_from_Symonds_Yat_East_-_geograph.org.uk_-_796316.jpg",
  "nearby": [
    {
      "description": "Symonds Yat Rock",
      "objectID": "27ae1ef3a27248ae6e61b29c0bb7b12e",
      "ref": "symonds-yat-rock-walking-and-cycle-route"
    },
    {
      "description": "Wye Valley Walk",
      "objectID": "2d61a4bb715468a803d0ebea2e261b67",
      "ref": "wye-valley-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/99b88b58d3daf665588ad2b92e4de190.gpx",
  "_geoloc": {
    "lat": 51.8399104479,
    "lng": -2.6348879453
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Tranquil_waters_of_the_Wye_from_Symonds_Yat_East_-_geograph.org.uk_-_796316.jpg",
      "title": "Pauline Eccles [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Tranquil waters of the Wye from Symonds Yat East. The holiday cottages at Symonds Yat West are reflected in the Wye on this humid morning without a breath of wind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/King_Arthur%27s_Cave_-_geograph.org.uk_-_88587.jpg",
      "title": "John Thorn / King Arthur's Cave, via Wikimedia Commons",
      "caption": "King Arthur's Cave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Lord%27s_Wood_near_King_Arthur%27s_Cave.JPG/256px-Lord%27s_Wood_near_King_Arthur%27s_Cave.JPG",
      "title": "Nessy [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Lord's Wood near King Arthur's Cave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/The_Olde_Ferry_Inn_-_geograph.org.uk_-_540640.jpg",
      "title": "Robin Baker / The Olde Ferry Inn, via Wikimedia Commons",
      "caption": "The Olde Ferry Inn Symonds Yat West"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/The_River_Wye_from_Lords_Wood_-_geograph.org.uk_-_250869.jpg",
      "title": "Peter Dean / The River Wye from Lords Wood, via Wikimedia Commons",
      "caption": "The River Wye from Lords Wood Taken from a viewpoint high on a cliff facing North. The river can be viewed to the south from this point also."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Rope_Ferry_at_Symonds_Yat_-_geograph.org.uk_-_993.jpg",
      "title": "Pam Brophy / Rope Ferry at Symonds Yat, via Wikimedia Commons",
      "caption": "Rope Ferry at Symonds Yat"
    }
  ],
  "distance_km": 6.5,
  "description": "This circular walk visits the mysterious King Arthur's Cave in the Wye Valley AONB near Symonds Yat. It's a lovely walk with long riverside sections and peaceful woodland trails. The area around the cave is also very quiet with just the sound of the river and birds to enjoy. Start the walk from the Hollow Rock car park in Symonds Yat East. From here you can pick up footpath taking you up to the river. Here you can follow the waymarked Wye Valley Walk south along the river to Lady Park Wood. A footbridge takes you over to the north side of the river here before trails through Lords Wood lead you to King Arthur's Cave. The cave entrance lies less than 100 metres above the river on a hill, with a double interconnected entrance and two main chambers. It's also a designated nature reserve under the protection of the Herefordshire Nature Trust. There is evidence that the cave was occupied by man during the Upper Palaeolithic era, and flint tools and woolly mammoth bones have been unearthed within and around the caves. After exploring the cave the walk heads north east through the woods and quarry to Symonds Yat West. Here you can catch the old rope ferry over the river and follow the path back to the car park. To continue your walking in the area try the wonderful climb up to Symonds Yat Rock where there are fabulous wide ranging views over the Wye Valley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Symonds Yat East head to the splendid Saracens Head Inn for some post walk refreshments. The family run inn is popular with walkers, cyclists, canoeists, fishermen and fans of good food and real ales. It has stood for centuries in a spectacular position on the east bank of the River Wye, where the river flows into a steep wooded gorge, on the edge of the Forest of Dean. In good weather you can sit outside and watch the ancient hand ferry from one of the riverside terraces. There's a good hot food menu and they also serve sandwiches and filled organic baguettes during lunchtimes. They also provide accommodation if you need to stay over. You can find it in the village with a postcode of HR9 6JL for your sat navs. In Symonds Yat West you could visit the noteworthy Ye Old Ferrie Inn. The beautiful riverside pub has been standing on the banks of the River Wye since 1473. With charming traditional features, warming open fires and stunning views across the Valley, it is the ideal place to enjoy the breath-taking countryside that surrounds it. The outdoor seatiing area directly overlooks the river so is perfect for fine summer days. You can find it on Ferrie Lane with a postcode of HR9 6BL."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SvqVdurcans",
  "postcode": "GL16 7NZ",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}