{
  "created_at": "2025-01-06T04:36:53.599372+00:00",
  "objectID": "99d0ee996b77fc0381f106e59e25f442",
  "ref": "bridgnorth-walking-route",
  "title": "Bridgnorth Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Bridgnorth_castle_ruins.jpg/512px-Bridgnorth_castle_ruins.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/99d0ee996b77fc0381f106e59e25f442.gpx",
  "_geoloc": {
    "lat": 52.5318455899,
    "lng": -2.4169199739
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Bridgnorth_castle_ruins.jpg/512px-Bridgnorth_castle_ruins.jpg",
      "title": "Dr Phillip McCavity at English Wikipedia [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Bridgnorth Castle Ruins"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Chelmarsh_Reservoir_and_Sailing_Club_-_geograph.org.uk_-_682346.jpg",
      "title": "Row17 / Chelmarsh Reservoir & Sailing Club",
      "caption": "Chelmarsh Reservoir and Sailing Club"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/River_Severn_at_Quatford_-_geograph.org.uk_-_1547213.jpg",
      "title": "Philip Halling / River Severn at Quatford",
      "caption": "River Severn at Quatford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/River_Severn_North_of_Hampton_Loade_-_geograph.org.uk_-_465553.jpg",
      "title": "Trevor Rickard / River Severn North of Hampton Loade",
      "caption": "River Severn North of Hampton Loade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Dudmaston_Hall_in_Spring_-_geograph.org.uk_-_465500.jpg",
      "title": "Trevor Rickard / Dudmaston Hall in Spring",
      "caption": "Dudmaston Hall in Spring"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Woodland%2C_near_Quatford%2C_Shropshire_-_geograph.org.uk_-_409173.jpg/256px-Woodland%2C_near_Quatford%2C_Shropshire_-_geograph.org.uk_-_409173.jpg",
      "title": "Roger Kidd / Woodland, near Quatford, Shropshire",
      "caption": "Woodland, near Quatford, Shropshire"
    }
  ],
  "distance_km": 30.0,
  "description": "This fine Shropshire town has some fine walking trails through the Severn Valley and a number of local parks and gardens to explore. This long walk from the town centre makes use of the Severn Way and Geopark Way long distance trails to take you on a tour of the countryside to the south of the town. On the way you'll visit the Severn Valley Country Park, Chelmarsh Reservoir and Dudmaston Hall while enjoying long riverside stretches along the River Severn. The walk starts in the town centre at the ruins of Bridgnorth Castle. The castle dates from the early part of the 12th century and is surrounded by pretty gardens. From here you can pick up the Severn Way running along the western side of the river. You head south passing Eardington before coming to Hampton Loade where you have the option of taking a detour to visit the nearby Chelmarsh Reservoir. The Jack Mytton Way runs along the northern end of the reservoir with nice views across the water. At Hampton you also have the option of catching the Severn Valley Railway back to Bridgnorth to shorten the walk. This route continues south to Highley where you cross the river and enter Severn Valley Country Park. The lovely 126-acre riverside park consists of woodland, meadows, a lake and riverside banks. Here you pick up the Geopark Way and follow it through the park toward Alveley. The route then turns north, passing Hampton Loade and a woodland section before coming to the noteworthy Dudmaston Hall. The fine 17th-century country house is surrounded by landscaped gardens, parkland, managed woodlands, lakes and farmland. The area also includes the adjacent Comer Woods. The tranquil woods have their own car park and entrance and are free to access. There's a number of picturesque pools and lots of woodland birds to see in this area. The route then heads through the woodland north of Dudmaston before passing Quatford and returning to the river for a final waterside stretch which leads you back into Bridgnorth. The town is also located close to Stanmore Country Park which is a great place to continue your walking in the area. Also of interest is the expansive Wyre Forest and the Sabrina Way long distance trail which passes through the town. The Severn Valley Railway Walk takes you further along the wonderful old heritage railway around Bewdley and Upper Arley.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east there's a bit of a hidden gem at Badger Dingle. There's a delightful little wood here with a brook, pools, sandstone outcrops and a rushing waterfall to admire. To the east there's Worfield where you can enjoy some pleasant trails through the valley of the River Worfe. The historic village is also worthy of exploration with its Saxon church, half timbered houses and the 18th century Davenport House. For more walking ideas in the area see the Shropshire Walks page."
    }
  ],
  "postcode": "WV16 4BT",
  "district": "Bridgnorth",
  "county": "Shropshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "King's Loade, Low Town, Oldbury, Bridgnorth, Shropshire, England, WV16 4BT, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "meadows"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "country house",
    "park"
  ],
  "facilities": [
    "car park",
    "dog friendly",
    "visitor center",
    "wheelchair accessible",
    "play area"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}