{
  "objectID": "9af4ba6028980236a621be6498a3f239",
  "created_at": "2024-12-18T09:32:15.818202+00:00",
  "ref": "harwich-walking-route",
  "title": "Harwich Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/32/Harwich_Green_-_geograph.org.uk_-_542083.jpg",
  "nearby": [
    {
      "description": "Essex Way",
      "objectID": "d9046b5c14755e51bd15de0c582f5292",
      "ref": "essex-way-walking-route"
    },
    {
      "description": "Wrabness",
      "objectID": "a53b7e558af03cd6ce86f23f7438635b",
      "ref": "wrabness-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9af4ba6028980236a621be6498a3f239.gpx",
  "_geoloc": {
    "lat": 51.9471727055,
    "lng": 1.2898484733
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Harwich_Green_-_geograph.org.uk_-_542083.jpg",
      "title": "Oxyman / Harwich Green",
      "caption": "Harwich Green with Old Harwich buoy and the tall lighthouse in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Harwich_Breakwater_-_geograph.org.uk_-_61216.jpg",
      "title": "Edward / Harwich Breakwater",
      "caption": "Harwich Breakwater. Breakwater at the entrance to Harwich Harbour, looking toward the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Trinity_House_Pier%2C_Harwich_-_geograph.org.uk_-_899096.jpg",
      "title": "Humphrey Bolton / Trinity House Pier, Harwich",
      "caption": "Trinity House Pier. Trinity House is the white building with the bowed front. St Nicholas's Church is in the centre of the view. It was built of yellow brick in 1821, almost at the same time as the lighthouse of 1818."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Harwich_Station_-_geograph.org.uk_-_198098.jpg",
      "title": "Mike Snoswell / Harwich Station",
      "caption": "Harwich Station. The station was very important before Parkston Quay came into being in the 1920's and 1930's. The famed boat Train sailed from Harwich docks and the coaches actually went on the ferry itself. My Great-great-Grandfather was the StationMaster here during those heady days."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Navyard_Wharf%2C_Harwich_-_geograph.org.uk_-_749035.jpg",
      "title": "Bob Jones / Navyard Wharf, Harwich",
      "caption": "Navyard Wharf. Navyard Wharf is operated by the Harwich Dock Company. This warehouse is used for the short-term storage of materials such as paper reels, which need to be kept dry. The yellow objects at the side of the warehouse are diggers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Dovercourt_low_lighthouse_and_groyne_-_geograph.org.uk_-_748823.jpg",
      "title": "Bob Jones / Dovercourt low lighthouse and groyne",
      "caption": "Dovercourt low lighthouse and groyne. The two groynes, one to the low lighthouse and the other, almost covered by the beach, are angled towards each other. Whilst all the main groynes along the beach are parallel, the lighthouse and its taller sister were once the leading lights for vessels entering the port of Harwich, and therefore needed to point in a different direction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Copperas_Bay_on_the_River_Stour_-_geograph.org.uk_-_361824.jpg",
      "title": "John Lemay / Copperas Bay on the River Stour",
      "caption": "Copperas Bay on the River Stour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Stilt_houses_at_Wrabness_Point_-_geograph.org.uk_-_646037.jpg",
      "title": "Zorba the Geek / Stilt houses at Wrabness Point",
      "caption": "Stilt houses at Wrabness Point. A long line of houses like these stand snugly side by side beside the Stour at Wrabness Point. Presumably floor level is above the highest tides."
    }
  ],
  "distance_km": 16.5,
  "description": "This Essex based port town has some decent waterside walking trails along the coast and the river on which it sits. The town is also notable as the likely launch point of the Mayflower which carried English Puritans to North America in 1620. This walk from the town follows a section of the Essex Way to the nature at Wrabness on the River Stour. It's a long walk of about 10 miles (so 20 miles there and back). It does use a series of flat footpaths however and you have the option of catching the train back from Wrabness. The walk starts next to the pier in Harwich and follows the waymarked trail south past the harbour, Harwich Green and the beach. You continue to Beacon Cliff before turning south west to pass along the coast at Dovercourt Bay. Near South Hall creek you turn inland towards the villages of Little Oakley and Ramsey. You continue north west to meet with the River Stour around Copperas Bay and Copperas Wood nature reserve. You can then follow the footpath west along the river where it will take you to the Oakfield Wood Nature Reserve before arriving at Wrabness. To continue your walking in the town you could try the Hariwch Maritime Trail which takes you to some of the historic highlights of the area. See the video below for more details of this route.",
  "video_url": "https://www.youtube.com/embed/NjqQ3oeD-tY",
  "district": "Harwich",
  "county": "Essex",
  "region": "Eastern",
  "country": "England"
}