{
  "created_at": "2025-01-06T03:30:55.367748+00:00",
  "objectID": "9b0ebc708d7f6edf19dcccfd0a0f336d",
  "ref": "grassington-walking-route",
  "title": "Walks Around Grassington Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8b/River_Wharfe_Grassington_-_geograph.org.uk_-_640540.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9b0ebc708d7f6edf19dcccfd0a0f336d.gpx",
  "_geoloc": {
    "lat": 54.0709940325,
    "lng": -1.9983588725
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/River_Wharfe_Grassington_-_geograph.org.uk_-_640540.jpg",
      "title": "Kevin Rushton / River Wharfe Grassington",
      "caption": "River Wharfe Grassington Bridge End Farm Guest House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Grassington_Village_-_geograph.org.uk_-_543173.jpg",
      "title": "HENRY CLARK / Grassington Village",
      "caption": "Grassington Village. Looking down from The Square"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/The_Square_in_Grassington_-_geograph.org.uk_-_2660250.jpg/512px-The_Square_in_Grassington_-_geograph.org.uk_-_2660250.jpg",
      "title": "The Square in Grassington by Steve Daniels, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Square and parking area. The square is bustling with people on this summer day. Centred on its small cobbled square are shops, public houses, the village museum, small cafes, restaurants and hotels. Grassington Folk Museum also houses a collection which tells the story of Wharfedale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/The_Smithy_-_Grassington_-_geograph.org.uk_-_2765106.jpg/512px-The_Smithy_-_Grassington_-_geograph.org.uk_-_2765106.jpg",
      "title": "The Smithy - Grassington by Anthony Parkes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Smithy. This Grade II listed stone building dates to the 18th century. A very important building in the lead mining complex, as by the early 19th century hundreds of ponies were used to haul ore from the mines and packhorses carried the ore to Gargrave, Skipton, Pateley Bridge and beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/The_Devonshire_Hotel%2C_Grassington_-_geograph.org.uk_-_2948043.jpg/512px-The_Devonshire_Hotel%2C_Grassington_-_geograph.org.uk_-_2948043.jpg",
      "title": "The Devonshire Hotel, Grassington by Pauline E, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Devonshire Hotel. An historic inn dating from the 1700s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Main_Street%2C_Grassington_-_geograph.org.uk_-_3760917.jpg/512px-Main_Street%2C_Grassington_-_geograph.org.uk_-_3760917.jpg",
      "title": "Main Street, Grassington by Ian S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Main Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Grassington_Bridge_-_geograph.org.uk_-_3670053.jpg",
      "title": "Grassington Bridge by G Laird, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Grassington Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Limestone_cottages%2C_Grassington_-_geograph.org.uk_-_2932427.jpg/512px-Limestone_cottages%2C_Grassington_-_geograph.org.uk_-_2932427.jpg",
      "title": "Limestone cottages, Grassington by Pauline E, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Old Limestone cottages"
    }
  ],
  "distance_km": 16.0,
  "description": "The North Yorkshire town of Grassington is an excellent base for exploring the beautiful Wharfedale on foot. It is the main residential and tourist centre in Upper Wharfedale and a popular place for walkers. Centred on its small cobbled square are a number of shops, public houses, cafes, restaurants and hotels. There is also the fascinating Grassington Folk Museum which tells the story of the history of Wharfedale. This walk uses the Dales Way and other public footpaths to visit some of the highlights of the area. You'll enjoy riverside paths, waterfalls, rushing becks, historic houses, challenging climbs and wonderful limestone scenery. The walk starts in the centre of the town and follows the Dales Way to the River Wharfe where you pick up the riverside path. It heads south east to the beautiful Linton Falls where there is a great viewpoint from the bridge over the river. The route continues towards Hebden and Burnsall before turning north along the Fir Beck towards Skyreholme. Shortly after you come to the delightful Parceval Hall Gardens. This Grade II listed manor house has 24 acres of formal and woodland gardens to explore and is well worth a small detour from the route. The walk continues to another major highlight of Wharfedale at Troller's Gill. The wonderful limestone gorge includes the pretty Skyreholme Beck which flows through it. The final section of the walk climbs to Grimwith Reservoir. The large reservoir is another must see attraction of the area. It has a splendid circular trail running around the perimeter of the water with a wide variety of water loving birdlife to look out for. To continue your walking in the Grassington area you could head north west of the town to the Grass Wood Nature Reserve. The reserve has miles of woodland trails with lots of wildlife to look out for. If you follow the Dales Way north from the town you could visit the interesting limestone valley at Conistone Dib and the pretty village of Kettlewell. See full details on the Grassington to Kettlewell Walk. This is another great area for walkers with the climb to Great Whernside starting from the village. You could also try our alternative Grassington Circular Walk which visits the pretty village of Hebden before climbing into the countryside above the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Foresters Arms - this popular community pub is located on the Main Street at postcode BD23 5AA. They serve good quality food and have a garden area. Devonshire Hotel - stone built hotel dating back to the 18th century. They have a charming old interior with attractive flagged floors, open fires and wooden beamed ceilings. Old photos of the local area line the walls. They are dog friendly and located on the Main Street at postcode BD23 5AD.  In Burnsall there's also the The Red Lion for a pit stop. The historic inn dates back to the 16th century and serves high quality food. They also provide rooms if you'd like to stay in the area. You can find them in a lovely spot overlooking the river at postcode BD23 6BU for your sat navs. In the village there's also the noteworthy church to see. It's a Grade I listed building and is almost entirely Perpendicular. Inside there's an 11th-century font carved with bird and beasts, twelve Anglo-Saxon sculpture fragments and a 14th-century alabaster panel depicting the Adoration of the Magi."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cjE_6LNgQfE",
  "district": "Skipton",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grassington Church of England Voluntary Controlled Primary School, Acre Lane, Skipton, North Yorkshire, York and North Yorkshire, England, BD23 5LB, United Kingdom",
  "postcode": "BD23 5LB",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "limestone"
  ],
  "points_of_interest": [
    "historic houses",
    "waterfalls",
    "viewpoints",
    "gardens",
    "reservoir"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}