{
  "created_at": "2025-01-06T19:01:01.813434+00:00",
  "objectID": "9b1d1adec7ed3ee8365fc09b9d6ebd03",
  "ref": "ticknock-forest-walking-route",
  "title": "Ticknock Forest Fairy Castle Loop Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Fairy_Castle_on_Two_Rock_Mountain.jpg/512px-Fairy_Castle_on_Two_Rock_Mountain.jpg",
  "nearby": [
    {
      "description": "Bohernabreena Reservoir",
      "objectID": "ee1663c24d67e292136e548a302d41e8",
      "ref": "bohernabreena-reservoir-walking-route"
    },
    {
      "description": "Dublin Mountains Way",
      "objectID": "13522940808aebe1977fa18a3d576bb9",
      "ref": "dublin-mountains-way-walking-route"
    },
    {
      "description": "Tymon Park",
      "objectID": "f933c428a321ccbc95e9d02ae2267aa9",
      "ref": "tymon-park-walking-route"
    },
    {
      "description": "Blessington Lakes",
      "objectID": "e5f805f39d10e6f7f30201af716f6d68",
      "ref": "blessington-lakes-walking-route"
    },
    {
      "description": "Lough Bray Loop",
      "objectID": "6d09a3ab8832017f3bda29900774b7f2",
      "ref": "lough-bray-loop-walking-route"
    },
    {
      "description": "Saggart Woods Slade Valley",
      "objectID": "efccc956193120c990f8ce1df9607cb3",
      "ref": "saggart-woods-slade-valley-walking-route"
    },
    {
      "description": "Barnaslingan and Carrickgollogan Walk",
      "objectID": "d20a0e333b8a6e53b2ad238f6615c3e4",
      "ref": "barnaslingan-and-carrickgollogan-walking-route"
    },
    {
      "description": "Great Sugar Loaf",
      "objectID": "08f89044ee40bdaed4b7521c5eeabc0a",
      "ref": "great-sugar-loaf-walking-route"
    },
    {
      "description": "Glen Of The Downs",
      "objectID": "aacce3b102e946535f847599cbe19880",
      "ref": "glen-of-the-downs-walking-route"
    },
    {
      "description": "Ballymore Eustace Loop",
      "objectID": "b357c02b78bb0bf853bc4409c9ffd0f2",
      "ref": "ballymore-eustace-loop-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9b1d1adec7ed3ee8365fc09b9d6ebd03.gpx",
  "_geoloc": {
    "lat": 53.2468212,
    "lng": -6.2567079
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Fairy_Castle_on_Two_Rock_Mountain.jpg/512px-Fairy_Castle_on_Two_Rock_Mountain.jpg",
      "title": "Joe King, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Fairy Castle on Two Rock Mountain. Fairy Castle, the summit's name, is distinguished by a stone cairn and an Ordnance Survey trig pillar. These landmarks rest atop a circular structure made of granite and quartz blocks, measuring 25 metres (82 feet) across and 2 metres (6.6 feet) high, which is covered by turf and vegetation. This structure represents the remains of a passage tomb, the most easterly among a series of such tombs extending across the Dublin and West Wicklow Mountains. While the entrance to the tomb, once likened to a \"cave\" by locals, is no longer visible due to the collapse of the cairn's edges, there is no evidence to suggest that the tomb has ever been opened. Nevertheless, archaeologists speculate that the interior likely contains a small burial chamber."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Three_Rock_Mountain_Southern_Tor.jpg/512px-Three_Rock_Mountain_Southern_Tor.jpg",
      "title": "Joe King, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Three Rock Mountain Southern Tor. The mountain derives its name from the three clusters of granite rocks found at its summit. At one time, there was a belief that these formations were constructed by humans. For instance, Gabriel Beranger mentioned them in 1780, stating, \"I take them to be altars upon which sacrifices were offered [...] the regularity which is observed in piling them convinces me they are the work of man, as they could not grow in that position\". However, these features are actually tors, natural geological formations created through gradual weathering processes. Today, the summit is characterised by numerous radio masts and towers, which utilize the site to broadcast signals across the Dublin area below. The slopes of the mountain are primarily covered with forestry plantations, predominantly consisting of Sitka spruce, Japanese larch, Scots pine, Monterey pine, and lodgepole pine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/P60901-113558.jpg/512px-P60901-113558.jpg",
      "title": "瑞丽江的河水, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Skyline of Dublin from the viewpoint. The views from the summit are expansive and have been drawing visitors for many years. The writer Weston St. John Joyce described the panorama as follows: \"The view from this elevated point, standing at 1,479 feet above sea level, stretches across a vast expanse of mountains, sea, and plains. To the north, one can see the azure waters of Dublin Bay, along with Clontarf and Howth, the Naul or Man-of-War hills, and the Mourne Mountains. Towards the east, there's Kingstown, Dalkey, and Killiney, followed by the fertile valley of Shanganagh, Carrickgollogan, the Scalp, Bray Head, the Sugar Loaves, and the slopes of Prince William's Seat. On clear days, Holyhead and the Welsh mountains are often visible, with Snowdon and the Llanberis Pass typically standing out the most, although occasionally, the elongated silhouette of Cader Idris may be seen at a distance to the right.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Kilmashogue_Mountain.jpg/512px-Kilmashogue_Mountain.jpg",
      "title": "Joe King, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Kilmashogue Mountain. Another fine climb in the area, just north of Two Rock. The name of the mountain may derive from \"coill na fumsaoige,\" meaning \"the wood of the ash,\" or \"coill na fuiseoige,\" which translates to \"the wood of the lark.\" Near the car park, there is a Bronze Age megalithic tomb. Kilmashogue forest also provides convenient access to Three Rock Mountain, Tiknock Forest, and Tibradden Mountain. On the northern slopes, near the forest recreation area car park, lies the remains of a wedge tomb. Excavated in 1953 by H. E. Kilbride-Jones, assisted by Rúaidhrí de Valera and Seán Ó Nualláin of the Royal Irish Academy, the tomb comprises two chambers originally covered by a stone cairn. Some of this material remains scattered around the tomb area, though many stones were repurposed for nearby stone walls. The main chamber, measuring 4 meters (13 feet) in length and 1.5 meters (4.9 feet) in width, features a triple-walled gallery, an unusual characteristic as most wedge tombs are double-walled. It faces towards the summit of Montpelier Hill, where a passage tomb once stood. During the Bronze Age, parts of the chamber were dismantled to construct three stone-lined cists inserted into the cairn material. One cist has its chamber visible as its capstone has been moved aside. During excavation, two middle Bronze Age food vessels and a late Bronze Age cinerary urn were discovered within the cists."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Two_Rock_Mountain_Tors.jpg/512px-Two_Rock_Mountain_Tors.jpg",
      "title": "Joe King, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Two Rock Mountain Tors. The twin tors (rock piles in foreground, left and right) give Two Rock mountain (foreground) in County Dublin in Ireland its name. The mountains in the background are Little Sugar Loaf mountain (left) and Great Sugar Loaf mountain (right), both in County Wicklow. Standing at 536 metres (1,759 feet) high, Two Rock ranks as the 382nd highest mountain in Ireland. It represents the highest point within the group of hills known as the Dublin Mountains, which includes Two Rock, Three Rock, Kilmashogue, and Tibradden Mountains. The mountain derives its name from the two granite tors situated to the southeast of the summit. Referred to as Fairy Castle, the summit offers panoramic views encompassing much of the Dublin area, stretching from Tallaght to Howth in the north, while landmarks such as Bray Head, Killiney Hill, the Great Sugar Loaf, and the Wicklow Mountains are visible to the south. The summit area primarily consists of shallow bog, with ferns and gorse adorning the lower slopes. Moreover, the mountain serves as a crucial habitat for red grouse. The mountain boasts a number of prehistoric monuments, including a passage tomb located atop the summit and a wedge tomb situated on the slopes near Ballyedmonduff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Ballyedmonduff_Wedge_Tomb.jpg/512px-Ballyedmonduff_Wedge_Tomb.jpg",
      "title": "Joe King, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Ballyedmonduff Wedge Tomb. Known locally as the \"Giant's Grave\", this is a wedge-shaped gallery grave – a type of communal burial place built in the second millenium B. C. The three compartments of the central chamber which housed the burials were surrounded by a horseshoe-shaped setting of stones and covered by a cairn. When excavated in 1945 the tomb produced Beaker pottery and flint implements. More detail below: The site is widely regarded as one of the most exceptional examples of a wedge tomb in Ireland. John O'Donovan, an antiquarian, remarked, \"I doubt I have encountered such a perfect pagan grave in any other counties examined thus far.\" The appearance of the tomb has evolved since its initial discovery: sketches from the 1830s by the Ordnance Survey depict a grass-covered tumulus, while a drawing by George Du Noyer suggests that the roof was partially intact during that period. Additionally, the pine forest surrounding the site today obscures the vistas of the Great Sugar Loaf mountain and the twin tors of Two Rock that were once visible from this location. The tomb was first excavated in 1832 by Alderman Blacker of St. Andrew Street, Dublin, although no records of this excavation survive. Locals informed John O'Donovan, who visited on behalf of the Ordnance Survey, that ashes had been discovered when the grave was opened. Following this initial excavation, many of the larger stones were removed by local stonecutters. In 1945, the site was excavated again by Seán P. Ó Riordáin and Rúaidhri de Valera, who unearthed sherds of decorated Beaker pottery, a polished hammer, a possible polishing stone, and a flint scraper. Additionally, a small amount of cremated human bone was discovered. Subsequent to the excavation, the monument was reconstructed to its present form. The tomb comprises a burial gallery spanning over 6 metres (20 feet) in length, divided into three chambers and surrounded by a horseshoe-shaped arrangement of stones with a straight façade at the western end. At the southern end lies a long stone adorned with seven cupmarks on one surface. This type of rock art is typically associated with earlier Neolithic culture and is commonly found on natural rock outcrops. It is possible that the stone was sourced from a natural boulder transported to the site during construction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Bullauns_on_Three_Rock_Mountain.jpg/512px-Bullauns_on_Three_Rock_Mountain.jpg",
      "title": "Joe King, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Bullauns on Three Rock Mountain. On the apex of the central tor at the summit, there are four bowl-shaped hollows known as bullauns, which were used in early Christian times for grinding. At one point, situated to the east of the central tor, there were the remnants of a deserted public house. Nearby the summit lies the ruins of an old army shooting range, which ceased operation in the 1970s. The targets were raised and lowered by a team of 12 men using levers in a concrete dugout. To warn visitors, a red flag was hoisted along the forest road during firing exercises. The slopes of the mountain are home to the remains of several hill forts, ring forts, and other enclosures, although these have largely been obscured by the forestry plantations. During the nineteenth century, much of the lower slopes of Three Rock were dotted with small quarries, particularly around the village of Barnacullia, which provided paving stones for Dublin Corporation for numerous years. In close proximity to Barnacullia stood a cottage that served as the residence of the Countess Markievicz until the 1916 Easter Rising. The children of James Connolly stayed at the cottage during the week of the Rising. Additionally, during the Irish War of Independence (1919–21), the 6th Battalion of the Dublin Brigade set up a camp at Barnacullia. Further down the slopes, near the Ticknock Road, lies Grumley's Well, a holy well renowned for its reputed ability to cure eye ailments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/ThreeRock_Jan_2003_349.jpg/512px-ThreeRock_Jan_2003_349.jpg",
      "title": "Sarah777 at en.wikipedia, Public domain, via Wikimedia Commons",
      "caption": "Three Rock Big Boulder. The primary broadcasting facility on Three Rock is owned and managed by 2RN, a subsidiary of the Irish national broadcaster RTÉ. Its 140-metre cable-stayed mast sits near the summit, which stands at 448 metres above Ordnance Datum. This location, along with Cairn Hill in County Longford, marked the initial UHF television transmission sites constructed by RTÉ to support the launch of their second television channel (RTÉ 2) in 1978. Both transmitters also played a role in enhancing television reception within their respective coverage areas. Prior to this, Dublin city had relied on the Kippure VHF television transmitter in County Wicklow since 1961, but it did not adequately cover certain eastern and southern parts of the city. A low-power VHF TV relay transmitter (now inactive) had previously broadcasted from the links tower at the RTÉ campus in Donnybrook to reach areas not covered by Kippure. The original transmission tower at the Three Rock site was replaced by the current 140m mast in 2002, although the tower still functions as a microwave link facility for broadcasting and telecommunications services. Presently, the Three Rock transmitters deliver the Irish digital television service, Saorview, to Dublin city and county, as well as FM and DAB radio networks. Additionally, other masts at the site host the majority of Dublin's local radio stations."
    }
  ],
  "distance_km": 6.0,
  "description": "Ticknock Forest is located in County Dublin, at the northeastern foothills of the Dublin Mountains. It's a popular place for walking and cycling with miles of mountain and forest walks, boasting breathtaking views of Dublin City, Dublin Bay, Bray Head, and the Wicklow Mountains. The forest features an extensive network of trails winding through the trees, offering pleasant and moderate walks suitable for all ages and fitness levels. Additionally, a tarmac road leads all the way to the top, making it easily accessible for children and individuals with lower levels of fitness. At the end of the tarmac road, there are three large rock formations known as Three Rock Mountain, which are perfect for climbing and provide a picturesque spot to sit and admire the stunning views over the Wicklow mountains and the coast. Further up in the area, visitors can explore Two Rock Mountain, standing at 536 meters above sea level, where they'll find the romantic ruins of Fairy Castle. This circular walk follows the popular Fairy Castle Loop which climbs to a wonderful viewpoint on Two Rock Mountain. Part of the route runs along sections of the Dublin Mountains Way and the Wicklow Way. You can use these waymarked, long distance trails to extend your walking in the area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The nearby Saggart Woods in the Slade Valley includes some pleasant woodland paths and mountain bike trails. To the south east there's fine viewpoints, woodland trails, historic leadmines and a noteworthy ruined ancient church on the Barnaslingan and Carrickgollogan Walk."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tUltPICGx_M?si=aGLN4pRP_Ew_bhsI",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Wicklow Way, Tiknock, Glencullen Electoral Division, Dún Laoghaire-Rathdown, County Dublin, Leinster, D18 C8W7, Éire / Ireland",
  "postcode": "D18 C8W7",
  "district": null,
  "county": "County Dublin",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "forest"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}