{
  "created_at": "2025-01-06T02:35:50.867406+00:00",
  "objectID": "9b1e728a28d1dd414c007ac53bb597db",
  "ref": "fowey-hall-walk-walking-route",
  "title": "Fowey Hall Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Fowey_Hall_hotel_-_geograph.org.uk_-_799435.jpg/256px-Fowey_Hall_hotel_-_geograph.org.uk_-_799435.jpg",
  "nearby": [
    {
      "description": "Fowey to Golant Walk",
      "objectID": "14b0f31911299db461cb7aa9d360327d",
      "ref": "fowey-to-golant-walk-walking-route"
    },
    {
      "description": "Par Sands",
      "objectID": "408383fa264023da85a0adfd9f5c5f00",
      "ref": "par-sands-beach-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9b1e728a28d1dd414c007ac53bb597db.gpx",
  "_geoloc": {
    "lat": 50.340402794,
    "lng": -4.6335137622
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Fowey_Hall_hotel_-_geograph.org.uk_-_799435.jpg/256px-Fowey_Hall_hotel_-_geograph.org.uk_-_799435.jpg",
      "title": "Rod Allday / Fowey Hall hotel, via Wikimedia Commons",
      "caption": "Fowey Hall hotel Built in 1899 by Sir Charles Hanson, a former Lord Mayor of London, Fowey Hall regularly hosted royal visitors and it was the inspiration for Toad Hall in The Wind in the Willows. It is now a luxury family hotel and every May hosts the Daphne Du Maurier literary festival."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/View_down_to_the_river_from_the_grounds_of_Fowey_Hall_-_geograph.org.uk_-_799429.jpg/256px-View_down_to_the_river_from_the_grounds_of_Fowey_Hall_-_geograph.org.uk_-_799429.jpg",
      "title": "Rod Allday / View down to the river from the grounds of Fowey Hall, via Wikimedia Commons",
      "caption": "View down to the river from the grounds of Fowey Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Fowey%2C_from_across_the_estuary_-_geograph.org.uk_-_1361651.jpg",
      "title": "Martin Bodman / Fowey: from across the estuary, via Wikimedia Commons",
      "caption": "Fowey, from across the estuary. View near Penleath Point by the Hall Walk. (The Hall Walk was created by the Mohun family and was in existence in 1585 \u0096 an early example of an estate or pleasure garden promenade)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Fowey%2C_seen_from_the_Hall_Walk_-_geograph.org.uk_-_138232.jpg",
      "title": "Martin Bodman / Fowey: seen from the Hall Walk, via Wikimedia Commons",
      "caption": "Fowey, seen from the Hall Walk. Fowey: seen from the Hall Walk. Here the mv Wisaforest is being manoeuvred upstream to the china clay docks at Carne Point by two tugs, one out of shot to the right. 1.8 million tons of china clay were being exported from this port by 1994. Looking roughly west"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Pont_Pill_-_geograph.org.uk_-_2300267.jpg",
      "title": "Pont Pill by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pont Pill. This tidal river joins the River Fowey at Penleath Point just below the memorial to Sir Arthur Quiller-Couch at the north-east corner of Fowey harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Penleath_Point_and_Fowey_Harbour_-_geograph.org.uk_-_254027.jpg",
      "title": "Rib / Penleath Point and Fowey Harbour",
      "caption": "Penleath Point and Fowey Harbour. Taken from the remains of St.Catherine's Castle. Penleath Point is near the centre of picture, above the large boat.The River Fowey, to the left, meets the sea about here.The more distant small craft are moored in Pont Pill (a pill is a small tidal inlet/creek usually having a muddy bottom).The two headlands from the right are Brawn Point, upper, and part of the rocky shoreline of Polruan...the water between is Polruan Pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Lanteglos%2C_Pont_Quay_-_geograph.org.uk_-_48011.jpg",
      "title": "Martin Bodman / Lanteglos: Pont Quay",
      "caption": "Lanteglos: Pont Quay. Small sailing barges and smacks visited this quay \u0096 at the eastern end of Pont Pill \u0096 in the 19th century, bringing culm and limestone for two lime kilns, one of which is visible here, to the right, smothered in ivy. There was also a malthouse here. Now a National Trust estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Polruan_quayside_-_geograph.org.uk_-_2433993.jpg/512px-Polruan_quayside_-_geograph.org.uk_-_2433993.jpg",
      "title": "Polruan quayside by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Polruan quayside"
    }
  ],
  "distance_km": 6.0,
  "description": "This popular circular walk in Fowey involves two ferry crossings and lovely waterside sections along Pont Pill and Fowey Quay. Along the way you'll enjoy wonderful views over Fowey Harbour, the River Fowey and the south coast. There's also pretty little quays, Cornish villages and splendid pubs for refreshments. The walk starts in Fowey, at the Fowey to Bodinnick Ferry. After catching the ferry to Bodinnick you pick up the footpath and head south to the 'Q' memorial. The route then runs east along the green waters of the tidal river of Pont Pill to the pretty hamlet of Pont. Here you cross a footbridge to the southern side of Pont Pill and head west to Polruan. At Polruan you catch the ferry back to Fowey and finish the walk with a stroll along the quay. To extend your walking in the area you could follow the coast path east and try the popular Looe to Polperro Walk. The walk takes in Talland Bay, the Looe Estuary and Hannafore with great views to Looe Island. You could also head in the other direction on the Fowey to Polkerris Walk. The circular walk visits the National Trust's Gribbin Head and the pretty beach and harbour at the village of Polkerris. The long distance Saints Way also passes through Fowey. If you follow it north on the Fowey to Golant Walk you can enjoy views of the river and the noteworthy Sawmills Studio.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk you could stop off at the Fowey Hall Hotel and enjoy an afternoon tea. This includes a classic selection of finger sandwiches, homemade scones with preserve and clotted cream, alongside a selection of cakes and sweet treats. Afterwards you could enjoy a stroll through the hotel's lovely gardens. You can find the hotel at postcode PL23 1ET for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/oC-rULYJzI4",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Station Road, Fowey, Cornwall, England, PL23 1DF, United Kingdom",
  "postcode": "PL23 1DF",
  "district": "Fowey",
  "state": "England"
}