{
  "created_at": "2025-01-06T03:37:23.109867+00:00",
  "objectID": "9bac060ba17e107bdca38060132daa54",
  "ref": "luds-church-walking-route",
  "title": "Lud's Church Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Luds_Church_-_geograph.org.uk_-_852024.jpg",
  "nearby": [
    {
      "description": "The Roaches",
      "objectID": "194625dc6c0829f6ced66369d74d3b1a",
      "ref": "the-roaches-walking-route"
    },
    {
      "description": "Dane Valley Way",
      "objectID": "582095bf203f299b18ab2b96d6f2fd79",
      "ref": "dane-valley-way-walking-route"
    },
    {
      "description": "Three Shires Head",
      "objectID": "8af34abb4d9976c4dfecd1ff72288ae7",
      "ref": "three-shires-head-walking-route"
    },
    {
      "description": "Gradbach",
      "objectID": "cc0beb89d9168f47e7260c29f79af5e1",
      "ref": "gradbach-walking-route"
    },
    {
      "description": "Wincle",
      "objectID": "09b85e32e91d9130e3ea59dc09795b7a",
      "ref": "wincle-walking-route"
    },
    {
      "description": "Wildboarclough",
      "objectID": "11390c32ce6b633610681b7bee49530a",
      "ref": "wildboarclough-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9bac060ba17e107bdca38060132daa54.gpx",
  "_geoloc": {
    "lat": 53.192960088,
    "lng": -2.0037765661
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Luds_Church_-_geograph.org.uk_-_852024.jpg",
      "title": "Raymond Knapman / Luds Church, via Wikimedia Commons",
      "caption": "Walkers make there way through the mossy rocks in the church. Lud's Church is carved within the thick bed of coarse Carboniferous sandstone, specifically known as the Roaches Grit. This geological formation dips northeastwards into the Goyt Syncline. The region is crisscrossed by numerous faults and fracture planes, oriented roughly northwest-to-southeast. Within the rock sequence, there are also layers of weaker mudstone. The rift at Lud's Church is formed along these lines of weakness, where a substantial mass of the Roaches Grit on the northeast side of the rift has slid slightly downhill into the Dane Valley. The exact age of this movement is uncertain but is likely to have occurred after the last glacial period."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Rocks_near_Lud%27s_Church_-_geograph.org.uk_-_906702.jpg",
      "title": "Bob Jones / Rocks near Lud's Church, via Wikimedia Commons",
      "caption": "Rocks near Lud's Church. These rocks in Back Forest are close to the entrance. The location of the \"Green Chapel\" in the medieval poem Sir Gawain and the Green Knight has been a subject of scholarly debate. R. W. V. Elliot proposed Lud's Church in the Staffordshire Moorlands as one of the key settings for the climax of the poem in May 1958. The Church, with its unique geological features, fits the descriptions provided in the poem. Elliot further explored and explicated the local landscape elements in a series of essays, later compiled in his book in 1984. While there have been other suggestions, Elliot's claim that Lud's Church could be the location of \"The Green Chapel\" has gained scholarly support. Additionally, another location, Nan Tor cave above the former railway station at Wetton Mill, has also been suggested."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Lud%27s_Church_-_geograph.org.uk_-_198567.jpg/256px-Lud%27s_Church_-_geograph.org.uk_-_198567.jpg",
      "title": "Oliver Dixon / Lud's Church, via Wikimedia Commons",
      "caption": "Lud's Church holds significance in Christian history, particularly in connection with the Lollards, followers of John Wycliffe, an early church reformer. It is believed that Lud's Church served as a clandestine place of worship for the Lollards during the early 15th century. During this time, they faced persecution for their religious beliefs. The name \"Lud's Church\" could be linked to Walter de Ludank or Walter de Lud-Auk, who was reportedly captured here during one of their meetings. The figurehead of a wooden ship, known as 'Lady Lud,' from the ship Swythamley once stood in a prominent niche above Lud's Church. This installation, dating back to around 1862, was orchestrated by Philip Brocklehurst, the landowner at the time. The figurehead was named 'Lady Lud' and was intended to serve as a commemoration of the daughter of a Lollard preacher who, according to the narrative, met her demise. The addition of the figurehead added a poignant and historical element to the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Lud%27s_Church_-_geograph.org.uk_-_56725.jpg",
      "title": "Steve Partridge / Lud's Church, via Wikimedia Commons",
      "caption": "Supplemental image to show steps near the entrance to the church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/The_ship_Inn%2C_Wincle%2C_Cheshire_-_geograph.org.uk_-_1554827.jpg",
      "title": "Dave Croker, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The ship Inn, Wincle. A good choice for some post walk refreshment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Wallaby_near_Gradbach_Mill_-_geograph.org.uk_-_1254610.jpg",
      "title": "Chris Denny / Wallaby near Gradbach Mill",
      "caption": "Wallaby near Gradbach Mill. One of a colony of wallabies variously described as having escaped / been released from a local private zoo around 1940. I took this picture twenty years ago and there now seems to be some debate about whether they still survive (according to various websites)."
    }
  ],
  "distance_km": 5.0,
  "description": "This walk visits the fascinating deep chasm of Lud's Church on the edge of the Staffordshire Peak District. It's a lovely place for a walk with nice views of the Dane Valley and woodland trails through Forest Wood and Gradbach Wood near the chasm. You can start the walk from the car park off Gradbach Mill Lane, about a mile to the east of the cave. From here you can pick up the Dane Valley Way and follow the River Dane to the chasm. The Millstone Grit geological formation is covered in moss and has an unusual atmospheric feel to it. It's 100 metres (328ft) long and 18 metres (59 ft) deep so you can walk along for quite a way between the tall mossy rocks. After exploring Lud's church you can explore the surrounding woodland before crossing Black Brook and returning to the car park along the riverside path. This area of the White Peak is great for walkers so there's lots of options for extending your walk. You could continue west along the Dane Valley Way and visit nearby Danebridge. From the same car park you can visit Three Shires Head. The beautiful area is where the counties of Cheshire, Derbyshire and Staffordshire meet. There's lots of pretty waterfalls and a wonderful grade II listed packhorse bridge over the River Dane. Just to the south of Lud's Church you will find The Roaches. The elevated rocky ridge, includes fascinating rock formations and wonderful views of the surrounding countrsyide.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One nice idea is to follow the river footpath west into Wincle where you could pay a visit to the noteworthy Ship Inn. The historic pub dates all the way back to the 16th century and has a cosy interior with fires to warm yourself by during the colder months. In the summer you can sit outside in the little beer garden. There's a good menu and decent selection of ales at this fine village pub. You can find the Ship at Barlow Hill, Wincle with a postcode of SK11 0QE for your sat navs. Near here you can also visit the excellent Wincle brewery. The site includes a small shop and tasting room where you can sample some of the 'eccentric' ales brewed here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The church is a nice place to explore with your dog. The Ship Inn mentioned above is also very dog friendly and even has a menu for your four legged friend!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The longer Gradbach Walk starts from the car park in the little hamlet. It visits the site before heading to The Roaches, Hen Cloud and Three Shires Head. It's a nice way of seeing several of the highlights of the area on one trail loop. On the way you'll also pass the picturesque Gradbach Mill on the River Dane. The 18th century mill was used to manufacture sewing silk and is an interesting reminder of the historic past of Gradbach. Today it's a Youth Hostel providing accommodation if you wish to stay over in this lovely area. To the north there's Wildboarclough where there's a fine 17th century pub, a Georgian hall and a beautiful valley to explore. You can also start the climb to the excellent viewpoint at Shutlingsloe from here. For more walking ideas in the area see the White Peak Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nmYNuhazgxc",
  "postcode": "SK17 0SU",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Gradbach Mill Lane, Quarnford, Staffordshire Moorlands, Staffordshire, England, SK17 0SU, United Kingdom",
  "district": "Staffordshire Moorlands",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "viewpoints",
    "geological formations",
    "waterfalls"
  ],
  "facilities": [
    "car park",
    "packhorse bridge"
  ],
  "route_type": "loop",
  "activity_type": [
    "walking"
  ]
}