{
  "created_at": "2025-01-06T09:00:09.506546+00:00",
  "objectID": "9c38362680a6444930d6b8a8e15e6a85",
  "ref": "wepre-park-walking-route",
  "title": "Wepre Park and Ewloe Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Wepre_Park_-_geograph.org.uk_-_709475.jpg",
  "nearby": [
    {
      "description": "Flint Castle and the Dee Estuary",
      "objectID": "28debb0dabdcb92e6f991ce61defc8a7",
      "ref": "flint-castle-and-the-dee-estuary-walking-route"
    },
    {
      "description": "Along the River Dee from Chester to Connah's Quay",
      "objectID": "22ea6230afc24ad6308d663f3a39f9d2",
      "ref": "along-the-river-dee-from-chester-to-connahs-quay-walking-and-cycle-route"
    },
    {
      "description": "Hawarden Castle",
      "objectID": "60603fac8af6e66179117febecca9d58",
      "ref": "hawarden-castle-walking-route"
    },
    {
      "description": "Chester Millennium Greenway",
      "objectID": "524bb1239f0a39c72f1d865f17abcc0f",
      "ref": "chester-millennium-greenway-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9c38362680a6444930d6b8a8e15e6a85.gpx",
  "_geoloc": {
    "lat": 53.2087173509,
    "lng": -3.0571622736
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Wepre_Park_-_geograph.org.uk_-_709475.jpg",
      "title": "Eirian Evans / Wepre Park, via Wikimedia Commons",
      "caption": "Wepre Park covers 160 acres of woodland, used for recreation by the people of Connah's Quay.Wepre Brook is on the left of this photo, and a raised boardwalk has been erected for a path alongside it over the wet meadow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Waterfall_in_Wepre_Park_-_geograph.org.uk_-_285184.jpg",
      "title": "Peter Craine / Waterfall in Wepre Park, via Wikimedia Commons",
      "caption": "Waterfall in the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Pont_Aber%2C_Wepre_Park_-_geograph.org.uk_-_709477.jpg",
      "title": "Eirian Evans / Pont Aber, Wepre Park, via Wikimedia Commons",
      "caption": "Pont Aber. The little arched stone bridge that crosses Wepre Brook near Ewloe castle was built just after Wepre Hall in 1800. It was actually an older bridge, Pont Saeson, that was demolished further up the valley and rebuilt here. It was near this spot that Owain Gwynedd, Prince of North Wales, ambushed and defeated the troops of Henry II in 1157."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Red_Rocks%2C_Wepre_Park_-_geograph.org.uk_-_709476.jpg",
      "title": "Eirian Evans / Red Rocks, Wepre Park, via Wikimedia Commons",
      "caption": "Red Rocks. Hard sandstone (or millstone grit) outcrop in Wepre Park. This was the stone used to construct Ewloe Castle at the southern end of the woodland. This is red sandstone, typical of many sandstone outcrops in this area, the red colour caused by oxidised iron. They are an indication of possible coal seams lower down, and the park has many small surface pits which were dug by hand."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Weir_-_Wepre_Park_-_geograph.org.uk_-_27845.jpg",
      "title": "alan smethurst / Weir - Wepre Park, via Wikimedia Commons",
      "caption": "A weir on Wepre brook - the resulting reservoir behind fed Wepre Mill by pipeline in the mid 19th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Ewloe_Castle%2C_Flintshire_-_geograph.org.uk_-_285171.jpg",
      "title": "Peter Craine / Ewloe Castle, Flintshire, via Wikimedia Commons",
      "caption": "Ewloe Castle, Flintshire. The historical details of this castle are not very clear, but it is believed to have been built in 1275 by Llywelyn ap Gruffydd. Whereas the large well-known castles of North Wales were built by the English King Edward I, this is a good example of a Welsh castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Footpath_to_Ewloe_Castle_-_geograph.org.uk_-_709481.jpg/256px-Footpath_to_Ewloe_Castle_-_geograph.org.uk_-_709481.jpg",
      "title": "Eirian Evans / Footpath to Ewloe Castle",
      "caption": "Footpath to Ewloe Castle From the B5125. The arms of Llywelyn ap Gruffydd, the last prince of Wales, are painted on either side of the gate. It was he who built Ewloe Castle after he reclaimed Ewloe Forest from the lordship of Hawarden in 1257."
    }
  ],
  "distance_km": 5.0,
  "description": "Follow a series of walking trails through the ancient woodland of this pretty country park in Connah's Quay in Flintshire. There are 160 acres to explore with highlights including the river, waterfall and the 12th century ruins of Ewloe Castle. If you would like to extend your walking then the 13th century ruins of Hawarden Castle and its surrounding woodland and parkland are well worth exploring. You could also pick up the River Dee and follow the riverside path into Chester. Also nearby is the fascinating ruins of Flint Castle with views over the Dee Estuary.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "GT's Bar and Grill is a great choice for some post walk refreshments. There's a splendid large garden to sit out in on warmer days and it's located just a stones throw away from the park. It's easily accessible from the A55 and can be found on Wepre Lane at postcode CH5 4JR. On the nearby Hawarden Estate there's a farm shop with a nice cafe which you could head to after your walk. It serves warming breakfasts, delicious light lunches, and tea with scones and cake. There's also an outdoor seating area for the summer months. You can find it just over a mile to the south east of the park on Chester Road at postcode CH5 3FB for your sat navs.In Hawarden village you could try the Glynn Arms. Much of the meat served in the pub is sourced from the sister business at the Hawarden Estate Farm Shop. The pub was constructed around 1812, and named in honour of the Glynne Family, whose ancestral seat was Hawarden Castle. You can sit outside and enjoy your meal in a nice garden area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CXcd3NaP-6I",
  "district": "Connah's Quay",
  "county": "Flintshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wepre Park Carpark - Waterfall Path, Connah's Quay, Flintshire, Cymru / Wales, CH5 4HL, United Kingdom",
  "postcode": "CH5 4HL",
  "state": "Cymru / Wales"
}