{
  "created_at": "2025-01-06T01:00:32.971964+00:00",
  "objectID": "9c491889e018cf809ec9ed36d4b56ef4",
  "ref": "llangynidr-walking-route",
  "title": "Llangynidr Canal and River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Walkers_approaching_Llangynidr_-_geograph.org.uk_-_2174673.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9c491889e018cf809ec9ed36d4b56ef4.gpx",
  "_geoloc": {
    "lat": 51.869119382,
    "lng": -3.2291263165
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Walkers_approaching_Llangynidr_-_geograph.org.uk_-_2174673.jpg",
      "title": "Walkers approaching Llangynidr by John Brightley, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Walkers approaching Llangynidr"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Llangynidr_Bridge_-_geograph.org.uk_-_1374439.jpg",
      "title": "Philip Halling / Llangynidr Bridge",
      "caption": "Llangyridr Bridge dates from around 1700 and crosses the River Usk near the village of Llangynidr."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Llangynidr_Locks_-_geograph.org.uk_-_1414122.jpg",
      "title": "Stephen McKay / Llangynidr Locks",
      "caption": "Llangynidr Locks. A boat approaches Lower Lock, the bottom of a flight of five, as it descends the Monmouthshire and Brecon Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Llangynidr%2C_the_Coach_and_Horses_Tavern_-_geograph.org.uk_-_1921232.jpg/512px-Llangynidr%2C_the_Coach_and_Horses_Tavern_-_geograph.org.uk_-_1921232.jpg",
      "title": "Llangynidr: the Coach and Horses Tavern by Keith Salvesen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Llangynidr, the Coach and Horses Tavern"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/St_Cynidr_Stone%2C_Llangynidr_-_geograph.org.uk_-_4103050.jpg/512px-St_Cynidr_Stone%2C_Llangynidr_-_geograph.org.uk_-_4103050.jpg",
      "title": "St Cynidr Stone, Llangynidr by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Cynidr Stone, Llangynidr. Located at the entrance to the village hall. The text on the brown tablet on the stone is in Welsh and English. The English is: ST CYNIDR STONE ERECTED IN THE YEAR A.D.2000 TO CELEBRATE THE MILLENNIUM WE ACKNOWLEDGE THE PAST WITH PRIDE WE APPRECIATE THE PRESENT WITH JOY WE ANTICIPATE THE FUTURE WITH HOPE Llangynidr is named after Cynidr, a 6th century Welsh saint."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Church_of_St_Cynidr_and_St_Mary%2C_Llangynidr_-_geograph.org.uk_-_2174683.jpg",
      "title": "Church of St Cynidr and St Mary, Llangynidr by John Brightley, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Church of St Cynidr and St Mary, Llangynidr. The church is dedicated to St Mary and St Cynidr and lies about 6km to the west of Crickhowell, on the opposite side of the Rive Usk. The structure was completely rebuilt after a fire in 1928 and only a broken font and a few other fixtures survive from the earlier building. The churchyard was probably once sub-circular. Totally rebuilt in 1928. Old stone re-used, but upper wall faces of nave have new masonry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Red_phonebox_at_a_bend_in_Duffryn_Road%2C_Llangynidr_-_geograph.org.uk_-_4109690.jpg",
      "title": "Red phonebox at a bend in Duffryn Road, Llangynidr by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Red phonebox at a bend in Duffryn Road in the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Llangynidr%2C_River_Usk_with_bedrock_exposed_after_prolonged_dry_weather_-_geograph.org.uk_-_1922373.jpg/512px-Llangynidr%2C_River_Usk_with_bedrock_exposed_after_prolonged_dry_weather_-_geograph.org.uk_-_1922373.jpg",
      "title": "Llangynidr: River Usk with bedrock exposed after prolonged dry weather by Keith Salvesen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Usk with bedrock exposed after prolonged dry weather"
    }
  ],
  "distance_km": 6.0,
  "description": "This pretty village in Powys is in a fine location for exploring the surrounding hills and countryside of the Black Mountains, the Brecon Beacons and the Usk Valley. There's also nice local trails along the canal and river which flow through this picturesque area. This circular walk from the village follows paths along the Monmouthshire and Brecon Canal and the River Usk. The walk starts from the public car park in the village and follows a footpath north east past Pencommin to the canal. Follow the towpath west and it will link up with the river after about a mile. You can then follow a riverside path east passing the old Llangynidr Bridge and a waterfall. At Cyffredyn you turn west to return to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the Coach and Horses for some post walk refreshments. This fine old coaching inn has an appealing interior with old beams, oak panelling and flagstone floors. Outside there's a peaceful garden overlooking the canal with stunning views over the local countryside. It's a great place to relax on a summer day after your exercise. You can find them on Cwm Crawnon Road with a postcode of NP8 1LS."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canal and river paths make for a fine dog walk and the Coach and Horses mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can extend the walk by continuing east along the canal to neighbouring Crickhowell where you can pick up the Crickhowell River Walk. Here you can visit the 12th century Crickhowell Castle and see the 18th century bridge over the river. Also nearby is the climb to the splendid Llangattock Escarpment. This elevated area includes great limestone cliffs, old quarries and wonderful views over the Usk Valley. Here you can also explore the Craig y Cilau National Nature Reserve with its interesting rare plantlife. The climb to Tor Y Foel starts from the village. It will take you up to a fine viewpoint above the picturesque Talybont Reservoir in the Brecon Beacons. For more walking ideas in the area see the Black Mountains Walks and the Brecon Beacons Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SvRG0SL5wmU",
  "district": "Llangynidr",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "cyclebasket.com, Cwm Crawnon Road, Lower Llangynidr, Llangynidr, Powys, Cymru / Wales, NP8 1LS, United Kingdom",
  "postcode": "NP8 1LS",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "river",
    "footpath"
  ],
  "points_of_interest": [
    "historical sites",
    "waterfall"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}