{
  "created_at": "2025-01-06T03:27:29.067386+00:00",
  "objectID": "9c524914b468c62c841218976e742574",
  "ref": "hathersage-walking-route",
  "title": "Hathersage Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Main_Road%2C_Hathersage_-_geograph.org.uk_-_1112164.jpg",
  "nearby": [
    {
      "description": "Longshaw Estate",
      "objectID": "0b9c1baa1438184d592ba3bede64e0e2",
      "ref": "longshaw-estate-walking-and-cycle-route"
    },
    {
      "description": "Stanage Edge",
      "objectID": "aeb98b950a0ea11aa9ec2496476800f5",
      "ref": "stanage-edge-walking-route"
    },
    {
      "description": "Derwent Valley Heritage Way",
      "objectID": "13871570524b1197efa9f0e608a7b222",
      "ref": "derwent-valley-heritage-way-walking-route"
    },
    {
      "description": "Padley Gorge Trail",
      "objectID": "9f9ac86d769422e0d03e52aeab28103c",
      "ref": "padley-gorge-trail-walking-route"
    },
    {
      "description": "Ladybower Reservoir",
      "objectID": "dc9cd529b4225315fc364c4fc05f43f3",
      "ref": "ladybower-reservoir-walking-route"
    },
    {
      "description": "Sheffield Country Walk",
      "objectID": "4caaa7a5581688587153613229aa70e6",
      "ref": "sheffield-country-walk-walking-route"
    },
    {
      "description": "Bamford Edge",
      "objectID": "e9cbbfc99fac4954d698e8166d81df0e",
      "ref": "bamford-edge-walking-route"
    },
    {
      "description": "Eyam",
      "objectID": "746562b6ae2364a7b1b39213ad92d36e",
      "ref": "eyam-walking-route"
    },
    {
      "description": "Higger Tor",
      "objectID": "f0360506ad5ffb1e088c3925493af4a9",
      "ref": "higger-tor-walking-route"
    },
    {
      "description": "Burbage Edge and Burbage Brook Walk",
      "objectID": "89f0f461846a74712b419a32e604d893",
      "ref": "burbage-edge-and-burbage-brook-walk-walking-route"
    },
    {
      "description": "Thornhill Trail",
      "objectID": "5772ea16f51968d8ad1ebfc30f44a7f4",
      "ref": "thornhill-trail-walking-and-cycle-route"
    },
    {
      "description": "Millstone Edge",
      "objectID": "2b6d88ef2f1eb107edeb805f68443ce1",
      "ref": "millstone-edge-walking-route"
    },
    {
      "description": "Owler Tor",
      "objectID": "1990dd31b1ae438cb81ed3d471a3f830",
      "ref": "owler-tor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9c524914b468c62c841218976e742574.gpx",
  "_geoloc": {
    "lat": 53.3278177555,
    "lng": -1.6491839834
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Main_Road%2C_Hathersage_-_geograph.org.uk_-_1112164.jpg",
      "title": "DAVID M GOODWIN / Main Road, Hathersage",
      "caption": "Main Road, Hathersage. The busy main street with many shops and the hills rising up in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Stream_by_the_A6_Hathersage_-_geograph.org.uk_-_1319520.jpg/256px-Stream_by_the_A6_Hathersage_-_geograph.org.uk_-_1319520.jpg",
      "title": "SMJ / Stream by the A6 Hathersage",
      "caption": "Pretty cottages and gardens by the stream in the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Cintra%27s_Tea_Rooms%2C_Hathersage_-_geograph.org.uk_-_1634827.jpg/256px-Cintra%27s_Tea_Rooms%2C_Hathersage_-_geograph.org.uk_-_1634827.jpg",
      "title": "Dave Croker / Cintra's Tea Rooms, Hathersage",
      "caption": "Cintra's Tea Rooms"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/North_Lees_Hall%2C_near_Hathersage_-_geograph.org.uk_-_591175.jpg",
      "title": "J147 / North Lees Hall, near Hathersage",
      "caption": "North Lees Hall, located just to the north of Hathersage. This fine Elizabethan hall, built circa 1590, is a nice example of the North Derbyshire tower house. It was occupied at various times by members of the Eyre family and was stayed in by Charlotte Bronte in 1845, who immortalised it in \"Jane Eyre\" as \"Thornfield Hall\". The former estate is now owned and managed by the Peak District National Park. The hall is now divided into two apartments, which are available as holiday lets. You can follow public footpaths north from the village to reach the hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/The_Millstone%2C_Hathersage_Booths_-_geograph.org.uk_-_1731141.jpg/512px-The_Millstone%2C_Hathersage_Booths_-_geograph.org.uk_-_1731141.jpg",
      "title": "Bill Boaden / The Millstone, Hathersage Booths",
      "caption": "The Millstone. A good source of real ale; on this day it had two beers from Abbeyvale plus Landlord and Black Sheep. Taken from the car park across the main road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Hathersage_-_School_Lane_and_Scotsmans_Pack_Inn_-_geograph.org.uk_-_940802.jpg",
      "title": "Alan Heardman / Hathersage - School Lane and Scotsmans Pack Inn",
      "caption": "Hathersage. Scotsmans Pack Inn"
    }
  ],
  "distance_km": 12.5,
  "description": "The village of Hathersage is a popular base for walkers wishing to explore some of the highlights of the Peak District National Park. It has several long distance trails running past it and a number of challenging climbs to try. Set in the beautiful Hope and Derwent Valleys the village is accessible by rail services to Hathersage train station. Probably the most popular walk from the village is the climb to the beautiful gritstone escarpment of Stanage Edge. A similarly exhilirating climb across Bamford Edge is also possible from the village. There's more interesting gritstone rock formations and fabulous views from here. The Derwent Valley Heritage Way also runs through the village along the River Derwent. If you follow the riverside path in a north westerly direction it will soon take you to the beautiful Ladybower Reservoir. Heading south along the river will take you to the splendid Longshaw Estate and Padley Gorge with its beautiful wooded valley. The 'Plague Village' of Eyam is just a few miles to the south of Hathersage. It is well worth a visit with its fascinating history, 17th century Eyam Hall and stone circle on Eyam Moor. This circular walk takes you up on to Hathersage Moor, visiting Higger Tor and Carl Wark Hill Fort. There's lovely moorland scenery, fine views back down to the village and some interesting rock formations to look out for. The walk starts in the village and follows footpaths to High Lees before climbing onto Hathersage Moor. Here you visit the Iron Age Hill Fort of Carl Wark which stands at a height of 370 metres (1,214 ft). The path then climbs to the nearby Higger Tor at a height of 434 m (1,424 ft). The striking gritstone tor overlooks the Burbage Valley. The route then descends to Burbage Bridge with views of the pretty Burbage Brook. Around here you can pick up the Padley Gorge Trail which takes you along the delightful brook with its waterfalls, rocky boulders and wooden bridges. This walk heads into the National Trust owned Longshaw Estate. The estate is fabulous walking country with ancient woods, parkland, heather moorland, ponds and the pretty Barbrage Brook. This section of the trail also links with the Sheffield Country Walk which takes you on a circular tour of the countryside around the city of Sheffield. The final section of the walk takes you through Granby Wood and Yarncliff Wood before crossing the western side of the moor and returning to the village. For alternative route to the tor see our Higger Tor Walk. It's a much shorter route which starts from the Burbage Bridge car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Cintra’s Tea Rooms are a nice place for some post walk refreshments. You can enjoy afternoon tea in the delighful gardens if the weather is fine. You can find them on the Main Road at postcode S32 1BB for your sat navs. The Plough Inn dates all the way back to the 16th century and is beautifully situated in nine acres of its own private land which gently slope towards the banks of the River Derwent. They also do accommodation and have a suntrap beer garden to relax in. You can find it at Leadmill Bridge with a postcode S32 1BA for your sat navs. The pub is very dog friendly if you have your canine friend with you. The Peak District Pub Walk - The Inn Way passes through the village. The circular route takes you to over 50 pubs in the National Park. It's a great one for those into walking and the pub history of the area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west you can pick up the circular Bradwell Walk. This visits the pretty village before heading to the ancient Roman Fort at Brough and climbing Bradwell Edge. There's also a fine 16th century pub in the area. Just over a mile to the south east there's Millstone Edge where there's some wonderful rock formations and the old millstones from the Millstone Edge Quarry. The climb to Owler Tor can also be started from the same Surprise View car park here. For more walking ideas in the area see the Peak District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/pO-Z-epatns",
  "district": "Derbyshire Dales",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "S32 337, Sheffield Road, Hathersage Booths, Hathersage, Derbyshire Dales, Derbyshire, East Midlands, England, S32 1DT, United Kingdom",
  "postcode": "S32 1DT",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "wooded valley",
    "gritstone"
  ],
  "points_of_interest": [
    "hill fort",
    "rock formations",
    "wooded valley",
    "brook"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wooded valley"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}