{
  "created_at": "2025-01-06T01:05:37.322527+00:00",
  "objectID": "9ccdc1449bdc71d024492b19a411a751",
  "ref": "lepe-country-park-walking-and-cycle-route",
  "title": "Lepe Country Park Beach Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Beach_car_park_facilities%2C_Lepe_Country_Park_-_geograph.org.uk_-_284345.jpg",
  "nearby": [
    {
      "description": "Beaulieu River",
      "objectID": "0252332f3b21d5a4605d753840f0209c",
      "ref": "beaulieu-river-walking-route"
    },
    {
      "description": "Beaulieu Heath",
      "objectID": "79a58b4f603e92d79f03ef88668b7c58",
      "ref": "beaulieu-heath-walking-route"
    },
    {
      "description": "Exbury Gardens",
      "objectID": "2cea57eb3947f2346ec0995b2b26d527",
      "ref": "exbury-gardens-walking-route"
    },
    {
      "description": "Ashlett Creek to Calshot Walk",
      "objectID": "b2adeea319ab8a9a806bee12a065eaec",
      "ref": "ashlett-creek-to-calshot-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9ccdc1449bdc71d024492b19a411a751.gpx",
  "_geoloc": {
    "lat": 50.7843300965,
    "lng": -1.3551261733
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Beach_car_park_facilities%2C_Lepe_Country_Park_-_geograph.org.uk_-_284345.jpg",
      "title": "Jim Champion / Beach car park facilities, Lepe Country Park",
      "caption": "Beach car park facilities, Lepe Country Park. The park office, toilets and restaurant are behind the beach car park at Lepe Country Park. An overflow car park is on the field above, beyond the distinctive pines. On the left, reflecting the sunshine, is a telephone call box (abbreviated to TCB on Ordnance Survey maps)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Lepe_Country_Park_-_geograph.org.uk_-_33304.jpg",
      "title": "Jim Champion / Lepe Country Park",
      "caption": "A view from the Solent View car park at the Country Park. A popular place in the summer, with views across the north Solent to the Isle of Wight.The photograph shows one of the wide grassy areas in the park with an old anchor and a bench to relax on and take in the stunning views."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Lepe_House_foreshore_-_geograph.org.uk_-_1134727.jpg/256px-Lepe_House_foreshore_-_geograph.org.uk_-_1134727.jpg",
      "title": "Jim Champion / Lepe House foreshore",
      "caption": "Lepe House foreshore. A view along the foreshore at Lepe House. The gravel footpath is to the right of the groynes, with Lepe House off to the right of the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Lepe_beach_during_rough_seas_-_geograph.org.uk_-_284361.jpg",
      "title": "Jim Champion / Lepe beach during rough seas",
      "caption": "Lepe beach during rough seas. Looking east along the sea defences on Lepe beach from the shelter of the Watch House. The waves are occasionally topping the concrete wall and throwing water onto the road where it crosses Dark Water. The Country Park car park is in the distance, full of windsurfers' vans."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Lepe_shoreline_at_dusk_-_geograph.org.uk_-_146963.jpg",
      "title": "Jim Champion / Lepe shoreline at dusk",
      "caption": "Lepe shoreline at dusk. In the foreground are the remains of groynes made of wooden stakes, and on the left is the sea-washed remains of a tree that fell long ago from the sandy cliff. The yellow pole is a warning sign indicating the presence of a submerged power cable. In the distance the white Watch House is a prominent landmark"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Corn_crop_west_of_Lepe_Farm%2C_Lepe_-_geograph.org.uk_-_33293.jpg",
      "title": "Jim Champion / Corn crop west of Lepe Farm, Lepe",
      "caption": "Corn crop west of Lepe Farm. Many game birds were hiding in this tall corn, as well as a young deer. The trees on the left are part of Cump Copse, and the chimney stack of Fawley Power Station can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Sandstone_cliff%2C_Lepe_-_geograph.org.uk_-_1146133.jpg",
      "title": "Jim Champion / Sandstone cliff, Lepe",
      "caption": "Sandstone cliff. A view along the crumbling sandstone cliff, west of Lepe House. The Isle of Wight can be seen in the distance on the right - the white boat is the Southampton-Cowes ferry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/North_Solent_National_Nature_Reserve%2C_between_Lepe_and_Calshot_-_geograph.org.uk_-_33319.jpg",
      "title": "Jim Champion / North Solent National Nature Reserve, between Lepe and Calshot",
      "caption": "North Solent National Nature Reserve, between Lepe and Calshot. At the north-east extreme of the Country Park the shingle beach is part of the National Nature Reserve (down to low water) and should not be disturbed."
    }
  ],
  "distance_km": 5.5,
  "description": "Lepe is a coastal Country Park located near Southampton, in the New Forest National Park. There is a large beach and stunning cliffs where there are fabulous views across the Solent to the Isle of Wight. The park has excellent facilities with Barbeque areas, picnic areas and a cafe. The route below is designed for walkers but there is a Lepe cycle route running through the park and the surrounding area - please click here for details. The park is located a few miles east of Bealieu where you can continue your walking on Beaulieu Heath or along the lovely Beaulieu River to the maritime village of Buckler's Hard.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a decent on site cafe at the park, selling a good range of meals and snacks. You can sit outside and enjoy fine views across the water with your meal."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park and beach trails are ideal for dog walking so you'll probably see other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head north east along the coast to visit Calshot Castle and the Calshot Marshes Nature Reserve. The Ashlett Creek to Calshot Walk will take you from Ashlett Quay along the creek to the site. There's great views across Southampton Water and lots of birdlife to look out for in the reserve. The castle and sea wall are also well worth exploring. The artillery fort has an interesting history having been constructed by Henry VIII on the Calshot Spit during the 16th century. Just to the north west there's the lovely Exbury Gardens to explore. There's 200 acres of flowers and rare plants with good surfaced footpaths provided. For more walking ideas in the area see the Hampshire Walks and the New Forest Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QUrFJ9iSkak",
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lepe Road, Exbury and Lepe, New Forest, Hampshire, England, SO45 1AD, United Kingdom",
  "postcode": "SO45 1AD",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "viewpoints",
    "natural landscapes"
  ],
  "facilities": [
    "barbeque areas",
    "picnic areas",
    "cafe"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}