{
  "objectID": "9d20d5b1cd5b61e5978568b967941de0",
  "created_at": "2024-12-18T01:34:49.932537+00:00",
  "ref": "abermawr-woods-walking-route",
  "title": "Abermawr Beach and Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/54/Abermawr_Woods_-_geograph.org.uk_-_984348.jpg",
  "nearby": [
    {
      "description": "Pembrokeshire Coast Path",
      "objectID": "ad6d6081a04362874fc894b50c9a12b7",
      "ref": "pembrokeshire-coast-path-walking-route"
    },
    {
      "description": "Strumble Head",
      "objectID": "17ca340a814d9e51445adb0e6c4b0100",
      "ref": "strumble-head-walking-route"
    },
    {
      "description": "Fishguard",
      "objectID": "e97f518ef59638485922f0bbb9113223",
      "ref": "fishguard-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/0AC7E1B1AA35759085257F3200408A8E/$FILE/Abermawr Woods.gpx",
  "_geoloc": {
    "lat": 51.9711292465,
    "lng": -5.0822574402
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Abermawr_Woods_-_geograph.org.uk_-_984348.jpg",
      "title": "Martyn Harries / Abermawr Woods",
      "caption": "Access to Abermawr Woods (National Trust) and Abermawr Beach (Not National Trust),a road used as a public path from Dyffryn-dwarch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Abermawr_beach_-_geograph.org.uk_-_1276387.jpg",
      "title": "Martyn Harries / Abermawr beach",
      "caption": "Abermawr beach. The pebble bank and exposed sand can be seen at low tide.The Pembrokeshire Coast National Park path continues from the gate by the turning circle.Walkers have to cross the pebble bank that runs across the back of the beach to rejoin the path close to a disused quarry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Cable_hut%2C_Abermawr_-_geograph.org.uk_-_685341.jpg",
      "title": "ceridwen / Cable hut,  Abermawr",
      "caption": "Cable hut. This tiny building, now a holiday let, played a significant role in history as the place where the first underwater cable link between Ireland and Great Britain came ashore in 1862, and a second one in 1880. Equipment here received the messages and operators relayed them to London. During WW1 the terminal was deemed important enough to warrant an armed guard to be stationed here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Ruin_above_Abermawr_-_geograph.org.uk_-_685866.jpg",
      "title": "ceridwen / Ruin above Abermawr",
      "caption": "Ruin above Abermawr. Although this would be a wonderful position for a house, commanding the whole of Abermawr Bay, there is no evidence that this ruin was ever a dwelling, despite the fine masonry employed in its construction. There are a series of joined stone sheds without windows, and an enclosed yard with rounded wall ends. According to information gratefully received from local historian Roy Lewis: this ruin was in fact the stable block for Tregwynt mansion. On the hill below can be seen the remains of Llewellyn's well, still flowing strongly.Just below there was the crossing point for Brunel's rail track,accidently found by a local farmer when recovering some cattle that had strayed into the bog!When Brunel was active the small stream had access to the sea. The bog was created during the great gale of 1859 when the pebble bank arrived blocking the stream's entry point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/The_path_to_Abermawr_-_geograph.org.uk_-_1441765.jpg",
      "title": "ceridwen / The path to Abermawr",
      "caption": "The path to Abermawr. The kissing gate leads the path across the field and on through Coed Pen-yr-allt to the beach. Had Isambard Kingdom Brunel's initial plan come to fruition this peaceful valley would have become a transport hub filled with railway lines and dockyards."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Thatched_cottage_near_Abermawr_-_geograph.org.uk_-_943747.jpg",
      "title": "ceridwen / Thatched cottage near Abermawr",
      "caption": "Thatched cottage near Abermawr. Traditional single-storey restored cottages near Felin Dwarch. It is unusual to see thatch in Pembrokeshire these days although it was once common. However it was a poor choice for roofing material since it did not stand up well to wind and rain but would most likely have been the only option for the very poor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Ragwort_and_woods_near_Abermawr_-_geograph.org.uk_-_1441780.jpg",
      "title": "ceridwen / Ragwort and woods near Abermawr",
      "caption": "Ragwort and woods near the site. A fine stand of this much-maligned plant. Ragwort (Senecio jacobae) has received an enormous amount of condemnation from the horseloving community on account of its toxicity; in fact much of the negative publicity is based on myth and misinformation and its destruction usually does more harm than good. Ragwort is a foodplant for around 30 insect species and others are attracted by its nectar. This particular clump was host to Painted Lady and Small Copper butterflies, honey and other bees, hoverflies and many more."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Abermawr%2C_it_could_have_been_so_different..._-_geograph.org.uk_-_685332.jpg",
      "title": "ceridwen / Abermawr: it could have been so different...",
      "caption": "It could have been so different... Abermawr is a beautiful, peaceful bay providing inspiration for artists, tranquillity for thinkers, waves for surfers and healthy fun for children and dogs -- but in the mid-C19 it was surveyed by the engineer Isambard Kingdom Brunel as the possible location for a major railway terminus and transatlantic harbour. In the event, Neyland on the south coast of Pembrokeshire, was selected instead and Abermawr was allowed to remain in the seclusion it enjoys today."
    }
  ],
  "distance_km": 2.5,
  "description": "This short walk takes you along Abermawr Beach and through Abermawr Woods on the Pembrokeshire Coast. You'll pass along the pretty shingle beach and enjoy peaceful woodland trails in the adjacent wood. It's a lovely spot with great coastal views and bluebells in the wood in the spring. Parking is available at the turning circle near the beach from which this walk starts.",
  "video_url": "https://www.youtube.com/embed/A8msTe2J93E",
  "county": "Sir Benfro - Pembrokeshire",
  "region": "Wales",
  "country": "Wales"
}