{
  "created_at": "2025-01-06T02:47:13.496669+00:00",
  "objectID": "9d89f92c861f6dba5b20843870c1978e",
  "ref": "devoke-water-walking-route",
  "title": "Devoke Water Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Devoke_Water_-_geograph.org.uk_-_340753.jpg",
  "nearby": [
    {
      "description": "Stanley Ghyll Force",
      "objectID": "48f73715f0c2524da29a516614a3710c",
      "ref": "stanley-ghyll-force-walking-route"
    },
    {
      "description": "Muncaster Castle",
      "objectID": "8b383869f7e95ee29b65bbc8e8f0578d",
      "ref": "muncaster-castle-walking-route"
    },
    {
      "description": "Ravenglass",
      "objectID": "b8da90f13a2570cae8b129adfaf20f7c",
      "ref": "ravenglass-walking-route"
    },
    {
      "description": "Eskdale Green",
      "objectID": "3e0b7d4d3a94b1194ace0601bfc5145c",
      "ref": "eskdale-green-walking-route"
    },
    {
      "description": "Irton Pike",
      "objectID": "5b5c162f025e6981c38a6371870aa090",
      "ref": "irton-pike-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9d89f92c861f6dba5b20843870c1978e.gpx",
  "_geoloc": {
    "lat": 54.3680194533,
    "lng": -3.2778241327
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Devoke_Water_-_geograph.org.uk_-_340753.jpg",
      "title": "Michael Graham / Devoke Water, via Wikimedia Commons",
      "caption": "The largest Tarn in the Lake District having a surface area of over Three Hundred Thousand square feet in old money.The deepest point is at about Forty Six Feet on the North side of the Tarn. According to Heaton Cooper in the Thirteenth Century it was named 'Dudockis Terne and also Fosse Terne.' The locals call it 'Duvvock Water'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Boathouse%2C_Devoke_Water_-_geograph.org.uk_-_1261399.jpg",
      "title": "Michael Graham / Boathouse, Devoke Water, via Wikimedia Commons",
      "caption": "Boathouse. Described by Heaton Cooper '... the two storied boathouse and stable and small room for gillies who saw to the needs of the Muncaster house party in the room above...'. He also says the Tarn was stocked by the Monks of Furness Abbey with trout from Italy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Devoke_Water_-_geograph.org.uk_-_1724808.jpg",
      "title": "Ian Taylor / Devoke Water, via Wikimedia Commons",
      "caption": "The Eskdale Fells are in the distance - the slopes of Scafell Pike (on the left), Esk Pile, Bowfell & Long Top. Taken in Spring 1983."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Approaching_Devoke_Water_-_geograph.org.uk_-_1261391.jpg",
      "title": "Michael Graham / Approaching Devoke Water, via Wikimedia Commons",
      "caption": "Approaching Devoke Water. On the track which leads from the Birker Fell road."
    }
  ],
  "distance_km": 3.5,
  "description": "This walk visits Devoke Water, the largest tarn in the Lake District. It's a very peaceful area being a bit of a hidden Lake District gem. To start the walk you can park by the side of the road at Austhwaite Brow and pick up the bridleway to the tarn. It's about a half mile walk from the road to the tarn with the footpath heading along the southern side of the water. You have the option of continuing around the tarn to climb Water Crag and Rough Crag where there are great views towards Eskdale and the Scafell range. The video below shows and extended circular walk visiting these fells. To extend your walk you can continue west along the bridleway to Birkby Fell and then onto Muncaster Castle near the coast at Ravenglass. The castle estate has 77 acres of gardens and over 6 miles of walking paths to try. If you head north from the tarn you can visit the lovely Stanley Ghyll Force Waterfall. The falls are located in Eskdale and drop 60 feet into a narrow river gorge with attractive woodland and views of the River Esk. They are located just over a mile north of the start point for this route.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the north east of the tarn you will find the noteworthy Woolpack Inn which is a fine place to go for some refreshments after your walk. The inn also contains the Hardknott Cafe. It's located at the top of one of England’s most dramatic valleys, and the bottom of one of its most exciting roads – the Hardknott Pass. The inn has a good menu with cosy fires indoors to warm yourself next to. There's also a nice outdoor area for the summer and it is dog friendly too. You can find the pub on the pass at a postcode of CA19 1TH for your sat navs. Just to the north is the worthy village of Eskdale Green. The pretty settlement includes a tarn, woods, a Japanese Garden, riverside trails and two fine historic pubs. There's also Eskdale Green station or Irton Road Station on the heritage Ravenglass and Eskdale Railway here. Just north of the village there's the climb to Irton Pike. There's some excellent views to Wast Water from this fine viewpoint."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To further continue your walking in the area try the Ravenglass Circular Beach Walk which visits the Drigg Beach Nature Reserve from the nearby village. Here you'll find sand dunes, an abundance of interesting plantlife and lots of wildlife, with several species of wading birds to look out for on the river estuary."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_LgHuVWnfaE",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Eskdale, Ulpha, Cumberland, England, CA19 1TJ, United Kingdom",
  "postcode": "CA19 1TJ",
  "district": "Ulpha",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}