{
  "created_at": "2025-01-06T10:18:12.457648+00:00",
  "objectID": "9d9eaedb227c3b03971547f8e0d2aff1",
  "ref": "the-hardy-way---wareham-corfe-castle-kimmeridge-walking-route",
  "title": "The Hardy Way - Wareham-Corfe Castle-Kimmeridge Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/41/River_Frome%2C_Wareham_-_geograph.org.uk_-_2241130.jpg",
  "nearby": [
    {
      "description": "Corfe Castle",
      "objectID": "a41a4f07c0e3e0ab6661161546ce00bf",
      "ref": "corfe-castle-walking-route"
    },
    {
      "description": "Blue Pool Dorset",
      "objectID": "02d397ad19dd922f80b044187aa536a6",
      "ref": "blue-pool-dorset-walking-route"
    },
    {
      "description": "Kimmeridge Bay to Chapmans Pool",
      "objectID": "8bf494265d0239bbd58479ec4d6f762c",
      "ref": "kimmeridge-bay-to-chapmans-pool-walking-route"
    },
    {
      "description": "Swyre Head",
      "objectID": "a118e13def0e80a0123289d25511f18f",
      "ref": "swyre-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9d9eaedb227c3b03971547f8e0d2aff1.gpx",
  "_geoloc": {
    "lat": 50.68647467,
    "lng": -2.11006164
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/River_Frome%2C_Wareham_-_geograph.org.uk_-_2241130.jpg",
      "title": "River Frome, Wareham by Maigheach-gheal, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Frome, Wareham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Corfe_Castle_and_Greyhound_Inn_Dorset_England.jpg/512px-Corfe_Castle_and_Greyhound_Inn_Dorset_England.jpg",
      "title": "JimChampion, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Corfe Castle and Greyhound Inn Dorset England"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Junction_of_paths_to_Corfe_Castle_-_geograph.org.uk_-_1026322.jpg",
      "title": "Jim Champion / Junction of paths to Corfe Castle",
      "caption": "Junction of paths to Corfe Castle. At this point the bridleway descends gently down the southern side of Challow Hill towards Corfe Castle. A permissive path continues along the top of the ridge to East Hill, then descends rapidly via a set of steps. Corfe Castle can be seen in the middle distance, perched on Castle Hill in the Corfe Gap in the Purbeck chalk ridge. The village of Corfe Castle is to the left, with the church tower standing out prominently."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Restoration_work_at_Corfe_Castle_-_geograph.org.uk_-_767146.jpg/256px-Restoration_work_at_Corfe_Castle_-_geograph.org.uk_-_767146.jpg",
      "title": "Jim Champion / Restoration work at Corfe Castle",
      "caption": "Restoration work at Corfe Castle. In 2008 parts of the castle are undergoing conservation work to preserve the remains and ensure that it doesn't have to be shut to the paying public. There is plenty of signage around the site telling you what's gone wrong - here they are replacing the mortar. Frost damage was shattering the mortar and stone and chunks were falling off."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/The_Flats%2C_Kimmeridge_Bay_-_geograph.org.uk_-_696254.jpg/256px-The_Flats%2C_Kimmeridge_Bay_-_geograph.org.uk_-_696254.jpg",
      "title": "Jim Champion / The Flats, Kimmeridge Bay",
      "caption": "The Flats, Kimmeridge Bay. This dolomite platform is known as \"The Flats\" and appears at various places in the western part of Kimmeridge Bay. It also forms the Flats at Broad Bench and, due to a fault, the rocks of Long Ebb between Hobarrow Bay and Brandy Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Bowl_barrow_on_Corfe_Common_-_geograph.org.uk_-_695896.jpg",
      "title": "Jim Champion / Bowl barrow on Corfe Common",
      "caption": "Bowl barrow on Corfe Common. The bowl barrow in the foreground is part of a Bronze Age barrow cemetery on Corfe Common. This particular mound is 22 metres in diameter and over 1 metre tall. Beyond is the village of Corfe Castle, overlooked by the ruins of the castle itself."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Two_churches%2C_Kingston_-_geograph.org.uk_-_939510.jpg/256px-Two_churches%2C_Kingston_-_geograph.org.uk_-_939510.jpg",
      "title": "Jim Champion / Two churches, Kingston",
      "caption": "Two churches, Kingston. View from the churchyard of St James' parish church, Kingston, Purbeck, Dorset, built in 1880, across rooftops to the tower of the former St James' parish church built in 1833"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/View_west_from_Swyre_Head_-_geograph.org.uk_-_222323.jpg",
      "title": "Jim Champion / View west from Swyre Head",
      "caption": "View west from Swyre Head. The chalk headland is called Bat's Head, and the small natural arch below it is called Bat's Hole. The stack in the bottom left is Butter Rock. On the horizon to the left is the northern end of the Isle of Portland, across Weymouth Bay. For some reason there are two Swyre Heads on this part of the Dorset coastline, the other is in gridsquare SY9378. [Note: much of the east Dorset coastline has been rebranded as the \"Jurassic Coast\" even though much of it, like this portion, is Cretaceous rather than Jurassic.]"
    }
  ],
  "distance_km": 18.0,
  "description": "The Hardy Way is a long distance walk created to celebrate the life and works of the author Thomas Hardy. His novels were set in the fictional area of Wessex which is based on the countryside around Dorchester. This section of the walk takes you from the town of Wareham to Kimmeridge Bay via Corfe Castle. It's a splendid area of Dorset with beautiful countryside, the Purbeck Hills and wonderful coastal views. The route is waymarked with a 'HW' on a green disc. The walk starts in the popular town of Wareham which is well served by public transport with a train station and various bus routes. You then enjoy a riverside stroll along the River Frome before heading to Stoborough Green and Stoborough Heath Nature Reserve. The reserve is very pretty with heathland, woodland and birds such as dartford warblers, skylarks and nightjars to look out for. The abandoned tramway through the centre of the heath is great for walking on. After leaving the heath you soon come to the wonderful Blue Pool. The site is well worth a small detour from the route as it contains an extraordinary lake which changes colour regularly. The next section climbs to Knowle Hill before descending to the village of Corfe Castle. Here you will find the historic 11th century ruined castle and the pretty Church of St. Edward which dates from the 12th century. From the village you head south across Corfe Common where there are great views back to the castle and lots of pretty wildflowers in the summer. After leaving the common you soon come to the little village of Kingston where there is a notable church. The Victorian Church of St James is Grade I listed and known as 'The Cathedral of the Purbecks'. The village pub dates from the late 18th century. The next section takes you south west to Swyre Head, the highest point in the Purbeck Hills. From the 208 m (682 ft) summit there are splendid views as far as the Isle of Portland and Dartmoor. You then head north west to the Kimmeridge village passing Smedmore House and Smedmore Hill on the way. The final section then descends to the Bay which is part of the Purbeck Marine Wildlife Reserve. It's a beautiful spot with lots of rock-pools where you can look out for a variety of marine wildlife.",
  "details": [],
  "postcode": "BH20 4AF",
  "district": "Wareham",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "North Street, Wareham Town, Wareham, Dorset, England, BH20 4AF, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "coastal",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve",
    "wildflowers"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}