{
  "created_at": "2025-01-05T23:51:23.054874+00:00",
  "objectID": "9dbde3ad06a87452a3afae0f429f77ae",
  "ref": "stocks-reservoir-walking-route",
  "title": "Stocks Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/51/Stocks_Reservoir_-_geograph.org.uk_-_883440.jpg",
  "nearby": [
    {
      "description": "Forest of Bowland Walk",
      "objectID": "22d745148502d4cae568114dcf0d5174",
      "ref": "forest-of-bowland-walk-walking-route"
    },
    {
      "description": "Trough of Bowland",
      "objectID": "3f44c071ef311eec11ebb1e8dc6e8a66",
      "ref": "trough-of-bowland-walking-route"
    },
    {
      "description": "Gisburn Forest",
      "objectID": "6285dcf3dd53424c50f7fe5ac4796961",
      "ref": "gisburn-forest-walking-and-cycle-route"
    },
    {
      "description": "Slaidburn",
      "objectID": "f7be3dd6e453264ad14cae4a1e57ff68",
      "ref": "slaidburn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9dbde3ad06a87452a3afae0f429f77ae.gpx",
  "_geoloc": {
    "lat": 54.0036942301,
    "lng": -2.4099824178
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Stocks_Reservoir_-_geograph.org.uk_-_883440.jpg",
      "title": "Allister Combe / Stocks Reservoir, via Wikimedia Commons",
      "caption": "A view of the little fishing boat marina on the west bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Stocks_reservoir_-_geograph.org.uk_-_967128.jpg",
      "title": "Tom Richardson / Stocks reservoir, via Wikimedia Commons",
      "caption": "Beautiful day at the resevoir with a view the little island in the centre and the rolling Bowland hills behind. Photo taken from the path along the southern shore"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Stocks_Reservoir_-_geograph.org.uk_-_184931.jpg",
      "title": "Ron Shirt [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Footpath view near the Dam end. Fly fishing is popular on the reservoir. I certainly got a few bites (from flies!) as I walked by."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Stocks_Reservoir_-_geograph.org.uk_-_184504.jpg",
      "title": "Ron Shirt [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Looking towards Gisburn Forest from 10 Acre Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/The_dam_at_Stocks_Reservoir_-_geograph.org.uk_-_3539495.jpg/512px-The_dam_at_Stocks_Reservoir_-_geograph.org.uk_-_3539495.jpg",
      "title": "The dam at Stocks Reservoir by John Slater, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The dam"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/The_northern_end_of_Stocks_Reservoir_-_geograph.org.uk_-_3860305.jpg",
      "title": "The northern end of Stocks Reservoir by Karl and Ali, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The northern end of Stocks Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Trackbed_of_former_railway_by_Stocks_Reservoir_-_geograph.org.uk_-_1300755.jpg",
      "title": "John Darch / Trackbed of former railway by Stocks Reservoir",
      "caption": "Trackbed of former railway on the western side of the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Nan_Brow_-_geograph.org.uk_-_2906726.jpg",
      "title": "Nan Brow by John Topping, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Nan Brow"
    }
  ],
  "distance_km": 10.0,
  "description": "Enjoy a waterside circular walk around this lovely reservoir in the Forest of Bowland. The walk begins at the car park at the northern end of the reservoir and heads through the edge of Gisburn Forest and crosses the causeway. You then pick up a walking track which runs close to the waters edge, passing Rushton Hill and Ten Acre Hill on the way. On the western side you head to Eak Hill and Copped Hill Clough before a final woodland section through Gisburn Forest returns you to the car park. This is a lovely walk through woodland and farmland on well maintained, signed footpaths. There are splendid views of the surrounding countryside and hills plus ample opportunity for wildfowl spotting on the water. If you'd like to continue your walking in the area then you could head deeper into the adjacent Gisburn Forest. You could also pick up the long distance Forest of Bowland Walk or head to the beautiful Trough of Bowland. You can visit the reservoir from the village of Slaidburn on our Slaidburn Walk .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Stocks Reservoir Cafe is conveniently located on the shores of the lake. There's great views from the outdoor seating area looking north across the reservoir to Gisburn Forest. It's a few miles from the site but The Inn At Whitewell is a great place to visit if you are in the car. The beautiful inn sits in a wonderful location high on the banks of the River Hodder a few miles south west of the reservoir. It's a place of some note with a history stretching back hundreds of years. In the 1300’s the inn was just a small manor house, lived in by the keepers of the Royal forest. It was not until the 1700’s, that the building was transformed into a resting place where travellers en route to or from Lancaster could safely stay before continuing their perilous journey. You can follow the River Hodder Walk from the reservoir to the inn. The inn has got a delightful interior and a nice outdoor seating area with views over the river. It's the ideal spot to rest your legs on a summer day. After your meal you can enjoy a stroll along the river where there are stepping stones and a waterfall nearby. You can find the inn a couple of miles south of Dunsop Bridge at postcode BB7 3AT.   Picture above: the Inn at Whitewell and the River Hodder stepping stones just below the inn."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The reservoir is a great place for wildlife spotting so be sure to bring your binoculars. In spring and autumn you might see an Osprey hunting as it takes a break on its migration from Africa to nest in Scotland. There's also a variety of waders on the water and the possibility of seeing Bowland Hen Harriers flying above the water. Near the cafe there's also a bird feeding station which is always a hive of activity. Stocks also has an interesting history having been created in 1932 by the Fylde Water Board by flooding the Dalehead valley and the surrounding farmland, including the hamlet of Stocks-in-Bowland from which the reservoir derives its name. Prince George officially opened the reservoir in the same year.  If you have some time after your walk pay a visit to the nearby Bowland Wild Boar Park. The park is a highglight of the area with animal feeding, tractor rides, plays areas and a cafe. There's also some nice riverside walks along the River Hodder here too. There's lots of different animals in the park including Red Deer, Peacock, Ostriches, Emu and of course Wild Boar. You can explore the site on 7 different waymarked nature trails. It's a lovely place for a stroll with bluebell woods, sculptures and plenty of wildlife to look out for on the way.  The park is located in the heart of the Trough of Bowland situated about 2 miles from the picturesque village of Chipping, on the Chipping to Dunsop Bridge road. They are signposted clearly from Chipping and have a postcode of PR3 2QT for your sat navs.   Above: Views of the park with the River Hodder and a wooden sculpture on the right."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Pinz3uqNcTM",
  "county": "Lancashire",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}