{
  "created_at": "2025-01-06T07:46:46.531440+00:00",
  "objectID": "9e4da4b0ff5b80c5a5c543ba7c501f4a",
  "ref": "burton-constable-walking-route",
  "title": "Burton Constable Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/02/Burton_Constable_Hall1.jpg",
  "nearby": [
    {
      "description": "Hull",
      "objectID": "cc5e364b3b09faea0d57a30e44a15714",
      "ref": "hull-walking-route"
    },
    {
      "description": "Hornsea Mere",
      "objectID": "493137a1f89d53ded8551b18e6bb3af1",
      "ref": "hornsea-mere-walking-route"
    },
    {
      "description": "Withernsea",
      "objectID": "38d80bbe2ce24083898deb6f247c70ae",
      "ref": "withernsea-walking-route"
    },
    {
      "description": "Spurn Point",
      "objectID": "db5a31ae1b9ae138d73bd401a31de1a7",
      "ref": "spurn-point-walking-route"
    },
    {
      "description": "Tophill Low",
      "objectID": "76fd0f54fc0a4dd891276e726f6d066f",
      "ref": "tophill-low-walking-route"
    },
    {
      "description": "Brandesburton",
      "objectID": "5fbff958c6c8c24edef4fec1a118fa98",
      "ref": "brandesburton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9e4da4b0ff5b80c5a5c543ba7c501f4a.gpx",
  "_geoloc": {
    "lat": 53.8140568041,
    "lng": -0.1954752596
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Burton_Constable_Hall1.jpg",
      "title": "Paul Glazzard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The 'West Front' of Burton Constable Hall, perhaps more commonly known as 'the back'. Burton Constable Hall is a large Elizabethan mansion set in 300 acres of parkland which was landscaped by Capability Brown in the 1770s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Flower_border%2C_Burton_Constable_Hall_-_geograph.org.uk_-_2005293.jpg",
      "title": "Flower border, Burton Constable Hall by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Flower border, Burton Constable Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Brickyard_House%2C_Burton_Constable_-_geograph.org.uk_-_600244.jpg/256px-Brickyard_House%2C_Burton_Constable_-_geograph.org.uk_-_600244.jpg",
      "title": "Paul Glazzard / Brickyard House, Burton Constable",
      "caption": "Brickyard House. Looking east-northeast along the driveway from Crook Lane, southwest of Smithy Briggs. There have been a number of brickyards on the Burton Constable estate and bricks were produced locally for the building of Burton Constable Hall, although the brick ponds here at Brickyard House are thought to date from the mid 19th century, by which time the hall already looked pretty much as it does today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Orangery%2C_Burton_Constable_Hall_-_geograph.org.uk_-_2005287.jpg",
      "title": "Orangery, Burton Constable Hall by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Orangery. The orangery was completed in 1782, to designs by Thomas Atkinson with artificial stone ornaments supplied by Eleanor Coade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Bridge_over_lake%2C_Burton_Constable_Hall_-_geograph.org.uk_-_2005343.jpg",
      "title": "Bridge over lake, Burton Constable Hall by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridge over lake, Burton Constable Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Gamekeepers_Cottage_Burton_Constable.jpg",
      "title": "Paul Glazzard / Gamekeeper's Cottage, Burton Constable",
      "caption": "Gamekeeper's Cottage. Former gamekeeper's cottage on the track between Higher Moor Plantation and Lower Moor Plantation, north of Burton Constable Hall. The cottage was home to the gamekeeper employed by the Burton Constable Estate until about 1992, when the Burton Constable Foundation was set up with an endowment from the National Heritage Memorial Fund to run Burton Constable Hall as a Country House Museum and charitable trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/The_Constable_Arboretum_-_geograph.org.uk_-_600379.jpg",
      "title": "Paul Glazzard / The Constable Arboretum",
      "caption": "The Constable Arboretum, Sproatley. South of the Old Lodge in the park at Burton Constable Hall, the Constable Arboretum is a collection of plants laid out to a design by Stephen Bean Associates for John Chichester Constable. The new garden design is based on the historical development of the formal garden and also reflects the twelve 'feature rooms' at Burton Constable Hall. The driveway through 'The Great Hall' section of the garden is also the access road to Burton Constable Holiday Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Tower_House%2C_Burton_Constable_-_geograph.org.uk_-_600234.jpg",
      "title": "Paul Glazzard / Tower House, Burton Constable",
      "caption": "Tower House. Neo-Tudor castellated house called Tower House (sometimes 'Engine House'), probably built around 1860 onto an earlier octagonal tower south-east of Burton Constable Hall. The original brick tower was built in the late 16th or early 17th century and possibly combined a viewing point with a high-level water tank."
    }
  ],
  "distance_km": 5.0,
  "description": "Explore the extensive parks and gardens of this Elizabethan country house near Hull. The hall is a Grade I listed building, set in a 300 acre park designed by Capability Brown. The park includes a large lake and an Orangery. There is a Waymarker Trail that takes you around the main features of the park. For more details on the walks and trails in the park see the Burton Constable Walking page. This will tell you more information about the Wildlife Sculpture Trail & the Parkland Waymarker Trail. To continue your walking in the area head south west to explore the city of Hull. If you head a few miles north there's a lovely waterside trail and lots of wildlife to see at Hornsea Mere .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a lovely on site tea room in the old stables. You can enjoy a delicious afternoon tea here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The parkland at the hall makes for a fine dog walk. The cafe mentioned above also includes a Doggy Dining Room where you can enjoy delicious homemade food in a warm and cosy environment with your dog."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east to the coast and you could enjoy a walk from Withernsea towards Spurn Point. The narrow sand spit is a scenic nature reserve with sand dunes and huge variety of wildlife to see. The Tophill Low Nature Reserve is also nearby. The reserve includes two pretty reservoirs and easy footpaths along the River Hull. It's another great place for birdwatching with several hides dotted around the site. Near here is also the worthy vlllage of Brandesburton with its medieval church and historic 16th century pub"
    }
  ],
  "video_url": "https://www.youtube.com/embed/SNj7niYm9jY",
  "county": "East Riding of Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}