{
  "created_at": "2025-01-06T00:40:49.235284+00:00",
  "objectID": "9e5cd22c37b1be41a492341eb97fe4f6",
  "ref": "buttermere-walking-route",
  "title": "Buttermere Lake Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Buttermere_-_geograph.org.uk_-_286845.jpg",
  "nearby": [
    {
      "description": "Fleetwith Pike",
      "objectID": "7415c576e6dcaf8bcd538fd07f6355b8",
      "ref": "fleetwith-pike-walking-route"
    },
    {
      "description": "Haystacks",
      "objectID": "6f4d85256a5a1a7c1437fc215d675a49",
      "ref": "haystacks-walking-route"
    },
    {
      "description": "Crummock Water",
      "objectID": "778948ecf18acc2fa4dcc7adb47b1ed1",
      "ref": "crummock-water-walking-route"
    },
    {
      "description": "Loweswater",
      "objectID": "c72c8c5008e823c614cd04061aea6f44",
      "ref": "loweswater-walking-route"
    },
    {
      "description": "Rannerdale Knotts",
      "objectID": "65de0a9da7547072a5b09ca4992850e1",
      "ref": "rannerdale-knotts-walking-route"
    },
    {
      "description": "Keswick to Buttermere Walk",
      "objectID": "6777b87d18924a0fc0fd435f13dbc1f9",
      "ref": "keswick-to-buttermere-walk-walking-route"
    },
    {
      "description": "Scale Force",
      "objectID": "228e6f5ba7bafffc46c174128691e52d",
      "ref": "scale-force-walking-route"
    },
    {
      "description": "Force Crag Mine",
      "objectID": "b47fd1c6d7598f833dc4c3ae32637bfa",
      "ref": "force-crag-mine-walking-route"
    },
    {
      "description": "Honister Pass Slate Mine",
      "objectID": "a77b3c7f24a88c5740aa95d511594b8f",
      "ref": "honister-pass-slate-mine-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9e5cd22c37b1be41a492341eb97fe4f6.gpx",
  "_geoloc": {
    "lat": 54.5414140215,
    "lng": -3.2754682687
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Buttermere_-_geograph.org.uk_-_286845.jpg",
      "title": "Richard Webb / Buttermere, via Wikimedia Commons",
      "caption": "Buttermere village with a view of Dodd. The walk offers a rich tapestry of flora and fauna, characteristic of the Lake District's diverse ecosystems. Along the shoreline and surrounding woodlands, walkers can observe a variety of plant species. In spring, wildflowers such as bluebells carpet the forest floors, creating vibrant displays. Summer brings blooming heather on the fells, adding hues of purple to the landscape. The area is also home to ancient woodlands, where native trees like oak and birch provide habitats for various species."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Buttermere_-_geograph.org.uk_-_7125.jpg",
      "title": "Val Vannet / Buttermere, via Wikimedia Commons",
      "caption": "This October view of the south east end of Buttermere leads the eye in to Gatesgarthdale and the Honister pass. The fauna around Buttermere is equally captivating. The clear waters of the lake are inhabited by fish species including Arctic char and brown trout. Sea trout and salmon pass through the lake to spawn in nearby becks. Birdwatchers may spot species such as the peregrine falcon and buzzard soaring above, while the surrounding woodlands are habitats for red squirrels and deer. Otters have also been observed in the area, indicating a healthy aquatic ecosystem."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Fields_Above_Buttermere_-_geograph.org.uk_-_765698.jpg",
      "title": "Mick Garratt / Fields Above Buttermere, via Wikimedia Commons",
      "caption": "Fields Above Buttermere. The path includes a tunnel on the eastern side of the lake, which adds an element of adventure to the walk. This tunnel can be wet, especially after rainfall, so appropriate footwear is recommended."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Buttermere_geograph-3496953-by-Ben-Brooksbank.jpg/512px-Buttermere_geograph-3496953-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank / South end of Buttermere, via Wikimedia Commons",
      "caption": "South end of Buttermere. View south from the scenic but narrow extension of the B5289 road (from Cockermouth) which continues over Honister Pass to Borrowdale. Ahead is Haystacks and beyond it is Grey Knott (both 2,287 ft.), approaching the centre of the Lakeland Mountains."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Gatesgarthdale_Beck_entering_Buttermere_-_geograph.org.uk_-_3210879.jpg/512px-Gatesgarthdale_Beck_entering_Buttermere_-_geograph.org.uk_-_3210879.jpg",
      "title": "Gatesgarthdale Beck entering Buttermere by Anthony Parkes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gatesgarthdale Beck entering Buttermere at the south eastern end"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Warnscale_Beck_-_geograph.org.uk_-_1373677.jpg",
      "title": "Trevor Rickard / Warnscale Beck",
      "caption": "Warnscale Beck. From Peggy's Bridge looking north-west along Warnscale Beck to its entry point into Buttermere. Crummock Water is not visible but sits between the dark dome of Mellbreak on the left and the less imposing ridge of Runnerdale Knotts in the centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Buttermere_and_Fleetwith_Pike_-_geograph.org.uk_-_1373725.jpg",
      "title": "Trevor Rickard / Buttermere and Fleetwith Pike",
      "caption": "Buttermere and Fleetwith Pike. From the footpath along the southern shore looking eastwards across the lake to Fleetwith Edge. Littledale Edge and Hindscarth Edge on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Buttermere_and_Hassness_House_-_geograph.org.uk_-_1373712.jpg",
      "title": "Trevor Rickard / Buttermere and Hassness House",
      "caption": "Buttermere and Hassness House. Looking north across the lake to the large white building which is Hassness House. Owned by the Ramblers Association and provides accommodation for walking holidays with the added bonus that there are no TVs or telephones in the rooms! Goat Crag above Kirk Close Wood on the right."
    }
  ],
  "distance_km": 7.0,
  "description": "This is a fine circular walk around the beautiful Buttermere lake in the Lake District National Park. The lake has a delightful walking path running along most of the shoreline making for an idyllic waterside stroll. It's one the most popular and scenic areas of the Lake District with the lake surrounded by several fells. Look out for the High Stile range to the south west, Robinson to the north east, Fleetwith Pike and Haystacks to the south east and Grasmoor to the north west. You start off in the pretty village of Buttermere which takes its name from the lake. The village contains several Grade II listed farmhouses and barns dating from the 16th and 17th centuries. It's a short stroll south from the village centre to the lake. You then pick up the shoreline trail passing through a rock tunnel beneath Hassness on the way round. The fells of Fleetwith Pike and Haystacks make a tremendous backdrop to the walk. Back in the village you can enjoy refreshments at one of the fine pubs. The Bridge Inn is a firendly pub with a good menu and an outdoor seating section with fine views of the surrounding fells. The lake is reachable on foot from the popular town of Keswick on the Keswick to Buttermere Walk. It's about a 9 mile hike, passing Catbells and Robinson fell on the way. If you would like to extend this walk then you could head to Crummock Water which is right next to Buttermere. Loweswater is also not far and is generally a more peaceful option as there are usually fewer visitors to this area. For great views back down to the water you could try the climb to the lovely Rannerdale Knotts which overlooks Buttermere and Crummock Water. The small fell also includes the delightful bluebell valley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Fish Inn in Butteremere village is a lovely place to go for some post walk refreshment. The inn has an interesting history being one of the oldest inns in the Lake District. They do good food and there's a comfy lounge with sofas and a fireplace to relax in indoors. There's also seating outside with fabulous views of the surrounding fells. You can easily find it in the village at postcode CA13 9XA.The Bridge Inn is also located right in the village. There's another fine garden area with one of the best views in England here.  Pictured above the Fish Hotel and the Bridge Hotel in Buttermere village. Dodd can be seen in the background rising up behind the Fish. The eponymous bridge by the Bridge Hotel carries the B5289 over Mill Beck. The hotel has a deep and interesting history stretching back several centuries. The current building stands on a site tracing back to the 11th century, where an armoury and a bakery stood, in connection with a watermill built higher up the stream. For seven centuries the mill worked continuously, the buildings being many times renewed. Around 1734, the buildings were sold to the church who obtained a beer licence and originated the 'Bridge Inn'. In 1837, Jonathan Thomas Sleap purchased the property, rebuilding the inn using stone obtained from the old watermill."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake is a lovely place for a dog walk and the Bridge Inn mentioned above is also very dog friendly. There's even an option on the menu for them!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In the village pay a visit to the pretty St James Church. The noteworthy church was built in 1840, though the original chapel dates back to 1507. Inside there is a stone tablet set into a window sill as a memorial to the famous walker Alfred Wainwright. The window looks out on his favourite place to walk, Haystacks, where his ashes were scattered. It's a picturesque and peaceful place to visit after your exercise.   Pictured above, the church of St James in Buttermere village, exterior and interior. Another popular walk from the village is the circular route up to Scale Force. The pretty falls are located just over a mile west of the village centre and can be reached on good public footpaths. It's well worth a visit as it's the site of the highest waterfall in the Lake District.  Pictured above Scale Force waterfall, a worthy walk from the village. Although it is less visited now, in the past boat trips across Crummock Water followed by guided excursions up to the waterfall were popular. The trail takes you along the bubbling waters of Scale Beck before coming to the falls. Just to the north you can pick up the Coledale Horseshoe. The popular circular walk starts from the village of Braithwaite, exploring the wonderful hanging valley and visiting several of the area's significant peaks on the way. The route also passes close to Force Crag Mine. The Scheduled ancient monument dates back to the 1800s and is now run by the National Trust. It's an interesting place to visit with information boards detailing the mine's history and some pleasant walks along the Coledale Beck."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hKqTQRiQIjI",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B5289, Buttermere, Cumberland, England, CA13 9UZ, United Kingdom",
  "postcode": "CA13 9UZ",
  "district": "Buttermere",
  "state": "England"
}