{
  "created_at": "2025-01-06T01:37:38.281239+00:00",
  "objectID": "9e97a99e692e9e98ff9f943a5aca7504",
  "ref": "valeways-millennium-heritage-trail-walking-route",
  "title": "Vale of Glamorgan Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Descending_towards_Dunraven_Bay_-_geograph.org.uk_-_161825.jpg",
  "nearby": [
    {
      "description": "Porthkerry Country Park",
      "objectID": "a423e7e4a8b8e12a4de40aa2acbea027",
      "ref": "porthkerry-country-park-walking-and-cycle-route"
    },
    {
      "description": "Glamorgan Heritage Coast",
      "objectID": "4306a39e1f2fa17d3c7e649594fa6c58",
      "ref": "glamorgan-heritage-coast-walking-route"
    },
    {
      "description": "Nash Point",
      "objectID": "88701c2e1b72d9fada49f219fe741031",
      "ref": "nash-point-walking-route"
    },
    {
      "description": "Cowbridge",
      "objectID": "d24180a89ac1048582dfb7ef7d29e94b",
      "ref": "cowbridge-walking-route"
    },
    {
      "description": "Llantwit Major",
      "objectID": "e30301cd015873753de7d342941ce479",
      "ref": "llantwit-major-walking-route"
    },
    {
      "description": "Ogmore by Sea",
      "objectID": "76206b7b56060df09a605b6585dce9e2",
      "ref": "ogmore-by-sea-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9e97a99e692e9e98ff9f943a5aca7504.gpx",
  "_geoloc": {
    "lat": 51.4854127964,
    "lng": -3.2695006899
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Descending_towards_Dunraven_Bay_-_geograph.org.uk_-_161825.jpg",
      "title": "Nigel Homer / Descending towards Dunraven Bay, via Wikimedia Commons",
      "caption": "Descending towards Dunraven Bay. The popular bay is often referred to as Southerndown Beach due to its proximity to the nearby village. The walled gardens and the ruins of Dunraven Castle, located just back from the beach, are well worth a visit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Nash_Point_to_Cwm_Nash_-_geograph.org.uk_-_1323212.jpg",
      "title": "Kev Griffin / Nash Point to Cwm Nash, via Wikimedia Commons",
      "caption": "Nash Point to Cwm Nash on the spectacular Glamorgan Heritage Coast. The stretch of coast is popular with hikers with cliff top views, nice beaches and a Grade II listed lighthouse, which dates from 1831-32."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Glowering_skies_west_of_Llantwit_Major_-_geograph.org.uk_-_1279266.jpg",
      "title": "Mick Lobb / Glowering skies west of Llantwit Major",
      "caption": "Glowering skies west of Llantwit Major. A view approaching the Coastal Path. The coast of Somerset can be made out across the channel with the woodland above St Donats at the highest point to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/The_Physic_Garden_-_Cowbridge_-_geograph.org.uk_-_1263583.jpg",
      "title": "Mick Lobb / The Physic Garden - Cowbridge",
      "caption": "The Physic Garden. This delightful garden in Cowbridge is well worth exploring. ln it you will find a collection of medicinal plants and herbs, typical of physic gardens from centuries past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Porthkerry_Viaduct%2C_Barry%2C_South_Wales%2C_UK_-_geograph.org.uk_-_1019129.jpg",
      "title": "Vincent Babb / Porthkerry Viaduct, Barry, South Wales, UK",
      "caption": "Porthkerry Viaduct, Barry, South Wales. View of the Viaduct that cuts through Porthkerry Park in Barry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/View_from_St_Donat%27s_Castle_-_geograph.org.uk_-_1322809.jpg/512px-View_from_St_Donat%27s_Castle_-_geograph.org.uk_-_1322809.jpg",
      "title": "Kev Griffin / View from St Donat's Castle",
      "caption": "View from St Donat's Castle. The castle stands above the Bristol Channel in the south of the rich agricultural lands of the Vale. It is the longest continually inhabited castle in Wales. The present castle's origins date from the 12th century. The castle is one of the highlights on the route and includes fine antique ceilings, a moat, battlements and dungeons."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/St_Brides_Major_War_Memorial_-_geograph.org.uk_-_6258230.jpg/512px-St_Brides_Major_War_Memorial_-_geograph.org.uk_-_6258230.jpg?20240204212704",
      "title": "St Brides Major War Memorial by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Brides Major War Memorial"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/12th_century_Ewenny_Priory_from_the_footpath_on_Ewenny._Moor.jpg/512px-12th_century_Ewenny_Priory_from_the_footpath_on_Ewenny._Moor.jpg?20140910211315",
      "title": "Philip manghan, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "12th century Ewenny Priory from the footpath on Ewenny. The priory, founded in 1141 by Maurice de Londres as an offshoot of Gloucester’s Benedictine abbey, stands as a remarkable example of Norman Romanesque architecture in Wales. The priory's church, presbytery, and transepts are particularly noteworthy for their austere design and historical significance. In addition to its architectural heritage, Ewenny Priory is distinguished by its unusually robust defences. The impressive walls and gates that remain today hint at a significant level of fortification. The exact reason for such defences in a small and otherwise unremarkable settlement like Ewenny is uncertain. There is speculation that these fortifications might have been more for display rather than practical defensive purposes. Despite the ambiguity surrounding the purpose of its defences, Ewenny Priory has maintained a continuous and active presence in the community. The Norman nave, a testament to the priory's enduring legacy, still functions as the local parish church, underscoring its long-standing role in the region's religious and cultural life."
    }
  ],
  "distance_km": 105.0,
  "description": "Follow the Valeways Millennium Heritage Trail on this long circular walk through the Vale of Glamorgan. The epic route includes a splendid coastal section along the Glamorgan Heritage Coast and visits a series of lovely Welsh towns and villages. The route runs through Peterston-super-Ely, Barry, Cowbridge, Llantwit Major, St Brides Major and Llanharry, Ewenny Priory and St. Fagans. It includes a waterside section along the River Ely as you pass the through the beautiful Ely Valley. You will also pass through the lovely Porthkerry Country Park near Barry, while visiting the historic castles at Boverton and St Donat's. This section runs along the beautiful Glamorgan Heritage Coast and visits the lighthouse at the picturesque Nash Point too. The walk is waymarked with a yellow and white disc.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near Nash Point you could stop at the The Horseshoe Inn in the peaceful little village of Marcross for some refreshments on the walk. The historic country pub dates from the 19th century and has been serving the local farming community for well over a century. There's a friendly welcome, a good menu and a lovely large garden to sit out and relax in on warmer days. You can find the pub in the village with a postcode of CF61 1ZG for your sat navs. The Watermill is a notable pub located on the river Ewenny in Ogmore village. There's a lovely outdoor seating area with views of the picturesque countryside surrounding the pub. It's a great place to relax on summer days and watch the horses graze in the adjacent field. Indoors there's an attractive interior with a cosy atmophere. There's a very good menu and the pub is also very dog friendly. You can find it on the Ogmore Road at a postcode of CF32 0QP for your sat navs. In Ogmore by Sea there's the delightful Hilary and Iain's Kitchen. This cafe bistro does great food and also has an outdoor seating area with fine sea views. You can find it at 87 Main Rd, with a postcode of CF32 0PW. The attractive town of Cowbridge is another good place to stop for a while for a break. You could try The Duke of Wellington where there's a very good menu and a landscaped patio. You can find it in the town centre on the High Street at postcode CF71 7AG for your sat navs. There's also The Bear which has a nice old country pub feel to it. There's open fires and a lovely beer garden here too. You can find it at postcode CF71 7AF. A stroll around the town is also pleasant with a Physic Garden and riverside park to enjoy. In Llantwit Major there's the noteworthy Old Swan Inn. The pub dates all the way back to the 12th Century and includes a charming old interior with log fires and oak beams. They have a very good menu and a lovely garden area to relax in on warmer days. You can find the pub on Church Street with a postcode of CF61 1SB for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/VPvfFYVXyFE",
  "district": "Cardiff",
  "county": "Cardiff",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Silverstream Cottage, Castle Hill, St Fagans, St. Fagans, Cardiff, Cymru / Wales, CF5 6EJ, United Kingdom",
  "postcode": "CF5 6EJ",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "river",
    "rural"
  ],
  "points_of_interest": [
    "towns",
    "villages",
    "historic castles",
    "country park",
    "lighthouse"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}