{
  "created_at": "2025-01-06T10:58:14.467876+00:00",
  "objectID": "9f698fbb4d1814e5f81ec9731503ad99",
  "ref": "middleham-walking-route",
  "title": "Middleham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Upper_Market_Place%2C_Middleham_-_geograph.org.uk_-_1032746.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9f698fbb4d1814e5f81ec9731503ad99.gpx",
  "_geoloc": {
    "lat": 54.2844671988,
    "lng": -1.8061262563
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Upper_Market_Place%2C_Middleham_-_geograph.org.uk_-_1032746.jpg",
      "title": "Gordon Hatton / Upper Market Place, Middleham",
      "caption": "Upper Market Place. The town of Middleham is no bigger than a village, yet has two market places linked by a broad street lined by a variety of 18th and 19th century houses. The buildings here look 18th century, but could be earlier."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Middleham_Castle_-_geograph.org.uk_-_19428.jpg",
      "title": "David Hatch / Middleham Castle",
      "caption": "The view northwards from Middleham Castle, which once belonged to Richard Duke of Gloucester, later King Richard III. The castle was built in the 12th century to defend the road from Richmond to Skipton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Market_Cross%2C_Middleham_-_geograph.org.uk_-_1035023.jpg/512px-Market_Cross%2C_Middleham_-_geograph.org.uk_-_1035023.jpg",
      "title": "Gordon Hatton / Market Cross, Middleham",
      "caption": "Market Cross. The tiny town has two market places and two market crosses. This one in the Lower Market Place is the more conventional in shape, but the date is unknown, although Middleham received its market charter in 1389."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Middleham_Low_Moor_-_geograph.org.uk_-_201485.jpg",
      "title": "Iain Macaulay / Middleham Low Moor",
      "caption": "Middleham Gallops. A good surfaced footpath on an elevated area to the west of the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Tupgil_Park_Fish_Temple_-_geograph.org.uk_-_1526600.jpg",
      "title": "Paul Brooker / Tupgil Park Fish Temple",
      "caption": "Tupgil Park. Fish Temple This folly is just outside the entrance to the Forbidden corner"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Hullo_Bridge_-_geograph.org.uk_-_126756.jpg",
      "title": "Chris Heaton / Hullo Bridge",
      "caption": "Hullo Bridge. This charming little structure spans the River Cover about a mile south west of Middleham, and is only suitable for pedestrians and farm vehicles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Coverham_Bridge_-_geograph.org.uk_-_127195.jpg",
      "title": "Chris Heaton / Coverham Bridge",
      "caption": "Coverham Bridge. Vehicular crossing over a single arched hump backed bridge in Lower Coverdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Georgian_houses_in_Middleham_-_geograph.org.uk_-_1032792.jpg",
      "title": "Gordon Hatton / Georgian houses in Middleham",
      "caption": "Georgian houses in the town. Sturdy, no nonsense Yorkshire stone houses in the town centre with an interesting variety of window styles."
    }
  ],
  "distance_km": 11.0,
  "description": "This circular walk takes you around the countryside surrounding the North Yorkshire village of Middleham. There's much to enjoy with a visit to the Middleham Gallops, Coverham Abbey, riverside paths along the River Cover and the atmospheric ruins of Middleham Castle. The walk starts in the centre of the village and soon comes to the fascinating 12th century castle. The castle was the childhood home of Richard III and also owned by Richard Neville, 16th Earl of Warwick, known to history as the 'Kingmaker', a leading figure in the Wars of the Roses. For a fee you can explore the castle and learn about the history through interesting exhibitions. You can also enjoy wonderful views of Wensleydale from the elevated viewing platform. After passing the castle the route heads west on footpaths across Middleham Low Moor. This section rises to a height of over 700ft so there are more great views to enjoy here. It is also known as the 'gallops' as it is where racehorses are taken for training from one of the many stables in the village. At Fern Gill you turn south towards Tupgill Park. Also known as 'The Forbidden Corner' the park includes a herb garden and fish temple. The route continues east to Coverham where you will pass the ruins of the 12th century Coverham Abbey. The surviving remains include the ruins of the church, the guesthouse, the gatehouse and several tomb covers with effigies of knights, from the 14th century. The route then heads along the River Cover with woodland trails along the river. You then turn north to return to the village. The long distance Six Dales Trail starts in the village so you can pick this up to extend your walk. The trail passes through six of the beautiful Yorkshire Dales - Wharfedale, Washburndale, Nidderdale, Colsterdale, Coverdale, and Wensleydale. If you head north from the village you could visit Leyburn and try our circular walk which visits the village of Wensley and the River Ure.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Richard the Third Hotel for some post walk refreshment. The inn is located in a nice spot on the market square and dates all the way back to the 17th century. There's a charming interior with wood beamed ceilings, and also some outdoor seating if the weather is good. You can easily find them near the start/end of the walk, next to the castle at postcode DL8 4NP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and river trails make for a fine walk with your dog. The Richard the Third Hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head north to Leyburn you can try the Harmby Waterfall Walk. It's a lovely area for a stroll and a particularly impressive sight after rainfall. You could also climb to the splendid limestone escarpment at Leyburn Shawl for fine views over the area. A few miles to the east of the village you'll find one of the historic highlights of the area at Jervaulx Abbey. The 12th century ruined abbey is surrounded by 126 acres of attractive parkland with wildflowers, grazing sheep, a pretty pond and fine views of the surrounding North Yorkshire countryside. Just to the north of here you'll also find the picturesque Thornton Steward Reservoir where there's a peaceful waterside trail. The noteworthy village of Constable Burton and the historic Constable Burton Hall are located in this area too. The grade-I-listed Georgian mansion includes some beautiful grounds with peaceful woodland, pretty becks and delightful gardens to see. For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/d_cSnMmaT2A",
  "postcode": "DL8 4RD",
  "district": "Middleham",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Back Street, Middleham, North Yorkshire, York and North Yorkshire, England, DL8 4RD, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "castle ruins",
    "park"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}