{
  "created_at": "2025-01-06T07:54:15.817240+00:00",
  "objectID": "9fbe9a851814c2deaed57fa95722f624",
  "ref": "anston-stones-walking-route",
  "title": "Anston Stones Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Anston_Stones_top_path_-_geograph.org.uk_-_1542751.jpg",
  "nearby": [
    {
      "description": "Cuckoo Way",
      "objectID": "59f5d2938ac7e897897ac1e5cb9382a7",
      "ref": "cuckoo-way-walking-route"
    },
    {
      "description": "Five Churches Walk",
      "objectID": "8a62ce2d696f9ffb96c1ff8bda361ad4",
      "ref": "five-churches-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9fbe9a851814c2deaed57fa95722f624.gpx",
  "_geoloc": {
    "lat": 53.350705002,
    "lng": -1.2203672153
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Anston_Stones_top_path_-_geograph.org.uk_-_1542751.jpg",
      "title": "Robin Stonebridge / Anston Stones top path, via Wikimedia Commons",
      "caption": "Anston Stones top path. The rocks seen to the right of the path are lumps of Permian dolomitic limestone. The outcrops were part of a 'coral garden' laid down when the area was covered by the Zechstein Sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Anston_Stones_Wood_-_geograph.org.uk_-_1540630.jpg",
      "title": "Robin Stonebridge / Anston Stones Woods, via Wikimedia Commons",
      "caption": "Anston Stones Wood is situated on either side of an ancient river gorge and its flora and fauna contribute to it being designated as a Site of Special Scientific Interest. This picture, taken on the northern, top path shows Yew tree roots growing through the clints in the magnesian limestone. The gorge is renowned for its unique geological and ecological features. It stands out as one of the finest examples of gorges within the Creswell Limestone Heritage Area. The landscape is characterised by Magnesium Limestone cliffs, which host distinctive rare plants, animals, and ancient woodlands. Notably, limestone from this area was used in the reconstruction of the Houses of Parliament after the 1834 fire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Dead_Man%E2%80%99s_Cave_-_geograph.org.uk_-_5978953.jpg/512px-Dead_Man%E2%80%99s_Cave_-_geograph.org.uk_-_5978953.jpg?20231222125504",
      "title": "Dead Man’s Cave by Mike Nield, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dead Man’s Cave. Dead Man's Cave was excavated in the 1960s, uncovering flint stone tools used by hunters approximately 12,000 years ago. Archaeologists also discovered bones of Ice Age animals, such as reindeer and hyena, highlighting the area's rich prehistoric significance. To visit Dead Man's Cave, start from the Anston Parish Hall car park and follow the well-marked path to the gorge. At the fork, take the higher path, leading to a mini gorge with unexcavated rock shelters and fissures. Just before the path descends, take the right fork to reach the edge of the limestone cliff. The left path descends to the cave/rock shelter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Anston_Brook_in_Lindrick_Dale_-_geograph.org.uk_-_4116905.jpg/256px-Anston_Brook_in_Lindrick_Dale_-_geograph.org.uk_-_4116905.jpg?20221210165857",
      "title": "Anston Brook in Lindrick Dale by Neil Theasby, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Anston Brook in Lindrick Dale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Path_Through_Anston_Stones_Wood_-_geograph.org.uk_-_128698.jpg?20100131041211",
      "title": "Michael Patterson / Path Through Anston Stones Wood",
      "caption": "This footpath through Anston Stones Wood passes by the limestone rocks on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Honeycomb_weathering_on_Magnesian_Limestone_-_geograph.org.uk_-_5985531.jpg/512px-Honeycomb_weathering_on_Magnesian_Limestone_-_geograph.org.uk_-_5985531.jpg?20231223141315",
      "title": "Honeycomb weathering on Magnesian Limestone by Michael Cooper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Honeycomb weathering on Magnesian Limestone"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Path_between_the_railway_and_Anston_Brook_-_geograph.org.uk_-_2053564.jpg?20210525012356",
      "title": "Path between the railway and Anston Brook by Andrew Hill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path between the railway and Anston Brook"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Brook_Walk_in_Anston_-_geograph.org.uk_-_5037680.jpg/512px-Brook_Walk_in_Anston_-_geograph.org.uk_-_5037680.jpg?20230701180522",
      "title": "Brook Walk in Anston by Jonathan Clitheroe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Brook Walk in Anston"
    }
  ],
  "distance_km": 4.0,
  "description": "Anston Stones Wood is a biological site of Special Scientific Interest in Anston, South Yorkshire. It's a nice place for a peaceful stroll with interesting vegetation and the Anston Brook running through the woods. The site is a local nature reserve consisting of grassland, scrub and wetland. The woodland is the second best example of limestone woodland in South Yorkshire. The area is known for its limestone gorges and interesting geological features. As such it is very popular with rock climbers. There is also an Ice Age Cave known as 'Dead Man's cave'. In the 1960's ancient flint tools from the ice age and animal bones from animals such reindeer and hyena were uncovered. The walk can be extended by heading east to Woodsetts via Lindrick Common. Just to the north is Swinston Hill Wood and if you head south you can pick up the Cuckoo Way and enjoy a stroll along the Chesterfield Canal.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In South Anston you can enjoy some post walk refreshments at The Loyal Trooper. It's an historic pub, dating back to 1690 with an attractive oak beamed interior. It offers a range of real ales and serves wholesome, locally sourced food at reasonable prices. The pub frequently features guest beers from local breweries. Recently redecorated, its layout remains unchanged since the 1960s, maintaining a classic and nostalgic ambiance. The interior includes a public bar, a snug, a lounge, and an upstairs function room used by various local groups, including a vibrant folk club. There's also a nice garden area to relax in on warmer days.Situated near St James's Church, the pub is conveniently located on the Five Churches Walk and is close to historic Anston Stones Wood and the nearby Butterfly Farm. The pub has been a regular entry in the Good Beer Guide and has frequently won local CAMRA awards, celebrating its commitment to quality ales and community atmosphere. You can find them at 29 Sheffield Rd with postcode S25 5DT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are an ideal place to walk your dog and meet other owners. The Loyal Trooper mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Tropical Butterfly House is North Anston is well worth a visit if you have time after visiting the woods. There's much to see here with free flying butterflies, tropical birds, creepy crawlies and reptiles. Outside there's also a lively family of meerkats. You can find them at postcode S25 4EQ. The Five Churches Walk passes through the area. The circular walk visits five historic churches with the Chesterfield Canal and the ruins of Thorpe Hall to see as well."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2lU-PXjw0cs?si=YJQfQN286HFEBbRo",
  "district": "Rotherham",
  "region": "South Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ryton Road/Worksop Road, Ryton Road, Anston, North Anston, Rotherham, South Yorkshire, England, S25 4DL, United Kingdom",
  "postcode": "S25 4DL",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "wetland",
    "gorge"
  ],
  "points_of_interest": [
    "historical sites",
    "geological features",
    "nature reserve"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}