{
  "objectID": "9fccf7b06873c2662891c9d23a085cc9",
  "created_at": "2024-12-18T16:32:59.251010+00:00",
  "ref": "buckland-beacon-walking-route",
  "title": "Buckland in the Moor and Buckland Beacon Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Buckland_Beacon_-_geograph.org.uk_-_1228927.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9fccf7b06873c2662891c9d23a085cc9.gpx",
  "_geoloc": {
    "lat": 50.55429,
    "lng": -3.7796
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Buckland_Beacon_-_geograph.org.uk_-_1228927.jpg",
      "title": "Derek Harper / Buckland Beacon",
      "caption": "Buckland Beacon. The elevated position of the hill top meant that it was the location of a fire beacon to warn of danger, and the tor takes its name from this role."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Ten_Commandments_Stone%2C_Buckland%2C_recut_yet_again_%28geograph_6555529%29.jpg/512px-Ten_Commandments_Stone%2C_Buckland%2C_recut_yet_again_%28geograph_6555529%29.jpg",
      "title": "Sloop John B / Ten Commandments Stone, Buckland, recut yet again",
      "caption": "Ten Commandments Stone, Buckland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Buckland_Beacon_stitch.jpg/512px-Buckland_Beacon_stitch.jpg",
      "title": "Nilfanion, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Mr. Whitley commissioned the carving of the Ten Commandments upon learning of proposed revisions to the Book of Common Prayer that would have brought the Church of England closer to Catholic doctrines. As a staunch Protestant, Whitley vehemently opposed these changes. The defeat of the proposed revisions in the House of Commons is commemorated on the rocks, along with verses from a hymn and John 13:34. Additionally, the commencement and completion dates of the carving project, from December 15th, 1927, to June 14th, 1928, are inscribed. Over time, weathering has affected the lettering, necessitating several recuttings, with the most recent one occurring in 2016 at a cost of £16,000."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Cold_East_Cross_-_geograph.org.uk_-_4104076.jpg",
      "title": "Cold East Cross by Alex McGregor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cold East Cross car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Gate%2C_Buckland_Common_-_geograph.org.uk_-_4910319.jpg/512px-Gate%2C_Buckland_Common_-_geograph.org.uk_-_4910319.jpg",
      "title": "Gate, Buckland Common by Alan Hunt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gate, Buckland Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Buckland_Beacon_-_geograph.org.uk_-_4234738.jpg",
      "title": "Buckland Beacon by jeff collins, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "In addition to the Ten Commandments, there is another carved rock on the summit of the tor, known as the Jubilee Stone. The Jubilee Stone commemorates the Silver Jubilee of George V and bears the inscription: 1282 FT BUCKLAND BEACON A BEACON FIRE – ONE OF A CHAIN- WAS LIT HERE BY THE PARISHIONERS OF BUCKLAND-IN’THE-MOOR IN CELEBRATION OF THEIR MAJESTIES SILVER JUBILEE MAY 6TH 1935 AND ALL OF THE PEOPLE SHOUTED AND SAID GOD SAVE THE KING Unlike the Ten Commandments rocks, the Jubilee Stone has not been maintained and is now barely visible. It is worth noting that the inscription indicates 1282ft, which is almost 50 feet (15 m) shorter than the actual height of the beacon recorded by Ordnance Survey. The beacon was also used for chains of fire beacons for the millennium celebrations in 2000 and for subsequent jubilees, including those of Queen Elizabeth II."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/On_Buckland_Common_%281%29_-_geograph.org.uk_-_5948735.jpg/512px-On_Buckland_Common_%281%29_-_geograph.org.uk_-_5948735.jpg",
      "title": "On Buckland Common [1] by Michael Dibb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On Buckland Common 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/On_Buckland_Common_%285%29_-_geograph.org.uk_-_5948765.jpg/512px-On_Buckland_Common_%285%29_-_geograph.org.uk_-_5948765.jpg",
      "title": "On Buckland Common [5] by Michael Dibb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On Buckland Common 2"
    }
  ],
  "distance_km": 3.0,
  "description": "This walk climbs to Buckland Beacon near the village of Buckland-in-the-Moor in the Dartmoor National Park. The beacon is well known for its Ten Commandments Stones and its excellent views over the Dart Valley. The walk starts off from the Cold East Cross car park which lies just to the north of the hill. There is also a smaller roadside parking area just south of here if you would like to get a bit closer to the hill. There is limited spaces here though. From Cold East Cross you can pick up trails heading south across the expansive Buclkand Common to the Beacon. The summit stands at a height of 382 metres (1,253 ft) and commands fine views over the area. After admiring the views you can descend on alternative paths across the common to the car park. If you'd like to continue your walking in the area head west to visit the Blackadon Down Nature Reserve. Here you can look out for a variety of wildlife along the River Webburn. Please scroll down for the full list of walks near and around Buckland in the Moor. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "video_url": "https://www.youtube.com/embed/CoSjSBbLAPc?si=h-pb7czbAX_RfPBj",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}