{
  "created_at": "2025-01-05T23:30:42.193595+00:00",
  "objectID": "9fe099a8aa523f215b2c9314d101a783",
  "ref": "keswick-railway-path-walking-and-cycle-route",
  "title": "Keswick to Threlkeld Railway Path Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Keswick_Station_-_geograph.org.uk_-_1745456.jpg/256px-Keswick_Station_-_geograph.org.uk_-_1745456.jpg",
  "nearby": [
    {
      "description": "Latrigg",
      "objectID": "09d646991e4ef882b779fc988c326add",
      "ref": "latrigg-walking-route"
    },
    {
      "description": "Castlerigg Stone Circle",
      "objectID": "1fd83774112eef69462fd00ff465cb97",
      "ref": "castlerigg-stone-circle-walking-route"
    },
    {
      "description": "Blencathra",
      "objectID": "c23f02f83ea8af252ccd0440215981cf",
      "ref": "blencathra-walking-route"
    },
    {
      "description": "Keswick to Buttermere Walk",
      "objectID": "6777b87d18924a0fc0fd435f13dbc1f9",
      "ref": "keswick-to-buttermere-walk-walking-route"
    },
    {
      "description": "Force Crag Mine",
      "objectID": "b47fd1c6d7598f833dc4c3ae32637bfa",
      "ref": "force-crag-mine-walking-route"
    },
    {
      "description": "National Cycle Route 71",
      "objectID": "26c4002893b94173a23cb99d80168308",
      "ref": "national-cycle-route-71"
    },
    {
      "description": "Threlkeld",
      "objectID": "47bb810f4d5da563492bdac78c793a42",
      "ref": "threlkeld-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9fe099a8aa523f215b2c9314d101a783.gpx",
  "_geoloc": {
    "lat": 54.6038515207,
    "lng": -3.1287601073
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Keswick_Station_-_geograph.org.uk_-_1745456.jpg/256px-Keswick_Station_-_geograph.org.uk_-_1745456.jpg",
      "title": "Malc McDonald / Keswick Station",
      "caption": "Keswick Station. The railway to Keswick was closed to trains in 1972, but the station building survives. Part of the trackbed forms a section of the C2C (Sea to Sea) cycle route, one of the first on the National Cycle Network"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Greta_bridges_-_Threlkeld_Bridge_-_geograph.org.uk_-_772268.jpg",
      "title": "Ian Capper / Greta bridges – Threlkeld Bridge",
      "caption": "Greta bridges \u0096 Threlkeld Bridge Between the former Keswick and Threlkeld stations, the disused Cockermouth, Keswick and Penrith Railway crossed the River Greta no fewer than 8 times in a distance of only 4 miles. All these bridges are of the bow-string girder construction, of various sizes and alignments. In addition, the same stretch saw it crossing the Greta's main feeder, the River Glenderamackin, although the bridge here is of a simpler design."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Calvert_Bridge_-_geograph.org.uk_-_577596.jpg",
      "title": "Peter Worrell / Calvert Bridge",
      "caption": "Calvert Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Greta_bridges_-_Threlkeld_Bridge_-_geograph.org.uk_-_772222.jpg",
      "title": "Ian Capper / Greta bridges – Threlkeld Bridge",
      "caption": "This is Threlkeld Bridge on the old A594, now bypassed by the A66, from which this photo is taken. What is interesting about this bridge is that it is at the junction of the River Glenderamackin (which comes in from the left through the left hand arch of the bridge), St John\u0092s Beck (which comes in from the right through the right hand arch of the bridge and the River Greta, which is the combined river flowing towards the photographer\u0092s position \u0096 so arguably a bridge over three rivers!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Disused_Railway_Tunnel%2C_Keswick_Cycleway_-_geograph.org.uk_-_47916.jpg",
      "title": "Mick Garratt / Disused Railway Tunnel, Keswick Cycleway",
      "caption": "Disused Railway Tunnel, Keswick Cycleway. The tunnel was used to carry the Penrith to Keswick railway and was block during the construction of the A66 Keswick bypass. At this point on the cycleway a wooden platform has been constructed overhanging the narrow gorge of the River Greta in order to get round the obstruction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Old_railway_bridge_nearing_Threlkeld_from_Keswick._-_panoramio.jpg/256px-Old_railway_bridge_nearing_Threlkeld_from_Keswick._-_panoramio.jpg",
      "title": "brian gillman / CC BY (https://creativecommons.org/licenses/by/3.0)",
      "caption": "Old railway bridge nearing Threlkeld from Keswick."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Cycling_through_old_railway_tunnel_-_geograph.org.uk_-_785407.jpg",
      "title": "Alex Robinson / Cycling through old railway tunnel",
      "caption": "Cycling through old railway tunnel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Looking_across_the_Greta_valley_-_geograph.org.uk_-_3592260.jpg/512px-Looking_across_the_Greta_valley_-_geograph.org.uk_-_3592260.jpg",
      "title": "Looking across the Greta valley by David Purchase, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking across the Greta valley at the eastern end of the route near Threlkeld."
    }
  ],
  "distance_km": 10.0,
  "description": "Enjoy an easy cycle or walk along the Keswick Railway Path in the Lake District National Park. The tree lined path runs along the trackbed of the old Cockermouth, Keswick and Penrith railway, following the River Greta from Keswick to Threlkeld. It's great for families as it's a nice easy cycle ride with a flat and well defined path. Walkers can enjoy the path too as it makes for a super riverside stroll. The latter part of the video below gives a good commentary on the railway path and shows the lovely scenery you can expect to see on the route. This includes the beautiful tree-clad Greta Gorge and views of the magnificent Blencathra mountain. Near to the route is the fascinating Castlerigg Stone Circle. Often thought of as the Stonehenge of the Lake District the ancient stone circle is located just to the south of the path and is well worth a visit. To extend your walk you climb to the nearby Latrigg Fell and enjoy great views over the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Keswick the Lake Road Inn is a good choice for some refreshments after your exercise. The pub does good food and also has a nice garden area to sit out in if the weather is fine. You can find the pub on 10 Lake Road with a postcode of CA12 5BT for your sat navs. At the other end of the route in Threlkend there's the noteworthy Salutation Inn. The historic pub dates all the way back to 1664 when it began life as a coaching inn. It's in a great spot with fine views up to Blencathra from the lovely south facing garden area. Inside there's a charming interior with flag stone floors, oak beams and roaring log fires. They also do good food and quality accommodation if you need to stay over. You can find the pub at a postcode of CA12 4SQ for your sat navs. It's also dog friendly if you have your four legged friend with you."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is popular with dog walkers so you're bound to see other owners on your visit. The Lake Road Inn mentioned above is also dog friendly inside and outside."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Threlkeld you could pay a visit to the Threlkeld Quarry Museum. Here you can enjoy a ride on the narrow gauge railway that runs into the old quarry. There's also a collection of historic machinery, such as locomotives and cranes, an underground tour of a realistic mine, a comprehensive geological and mining museum, and mineral panning. Just to the west you can pick up the Coledale Horseshoe. The popular circular walk starts from the village of Braithwaite, exploring the wonderful hanging valley and visiting several of the area's significant peaks on the way. The route also passes close to Force Crag Mine. The Scheduled ancient monument dates back to the 1800s and is now run by the National Trust. It's an interesting place to visit with information boards detailing the mine's history and some pleasant walks along the Coledale Beck. The route runs along a section of National Cycle Route 71 which runs from Whitehaven to Kirby Knowle through the Lake District. You could continue your outing along this signed Sustrans path."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PqXzibXVaB4",
  "postcode": "CA12 4NL",
  "district": "Keswick",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brundholme Gardens, Old Windlebrowe, Keswick, Cumberland, England, CA12 4NL, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1-2 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "stone circle",
    "mountain"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}