{
  "created_at": "2025-01-06T02:04:32.976448+00:00",
  "objectID": "9fecf42c6853e4fd34e6f45ab32b2dd0",
  "ref": "summerseat-walking-route",
  "title": "Summerseat Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/93/Summerseat_Railway_Bridge_-_geograph.org.uk_-_388955.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/9/9fecf42c6853e4fd34e6f45ab32b2dd0.gpx",
  "_geoloc": {
    "lat": 53.6279990925,
    "lng": -2.3132268339
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Summerseat_Railway_Bridge_-_geograph.org.uk_-_388955.jpg",
      "title": "Paul Anderson / Summerseat Railway Bridge",
      "caption": "Summerseat Railway Bridge. The railway bridge crossing over the river Irwell here in Summerseat is part of the East Lancashire Railway. The cottages underneath the bridge are Hamer Terrace. The terrace overlooks the river Irwell at Brooksbottoms. The retaining wall along the river bank was rebuilt and strengthened a few years ago. The monument on top of the hill on the extreme right is Peel Tower, a memorial to Sir Robert Peel the founder of the modern police force."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Old_Mill_Workers_Houses_at_Brooksbottoms_-_geograph.org.uk_-_295026.jpg",
      "title": "Paul Anderson / Old Mill Workers Houses at Brooksbottoms",
      "caption": "Old Mill Workers Houses at Brooksbottoms In 1885 many rows of red brick houses were built for the mill workers at Brooksbottoms. The initial rent for these houses was four shillings equivalent to 20p by today's money. Many of these houses have been modernised and as you can see are in use today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Brooksbottom_Viaduct_Summerseat_-_geograph.org.uk_-_427777.jpg",
      "title": "Paul Anderson / Brooksbottom Viaduct Summerseat",
      "caption": "Brooksbottom Viaduct Summerseat. This six arched 200 yard long viaduct built in 1845 is on the approach to the railway bridge. This view shows the western aspect of the viaduct at its southern end. Although made mainly of stone the arched inner rings are made of brick. The viaduct is still used today by the East Lancashire Railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Summerseat_Railway_Station_-_geograph.org.uk_-_893818.jpg",
      "title": "Paul Anderson / Summerseat Railway Station",
      "caption": "Summerseat Railway Station. Locomotive No 92214 is seen here about to leave the station and head north for Ramsbottom. This is just one of the six stations on the line known as the East Lancashire Railway. The heritage railway line runs between Heywood in Greater Manchester and Rawtenstall in Lancashire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Burrs_Weir_Summerseat.jpg",
      "title": "Paul Anderson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Burrs Weir Summerseat"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Summerseat_Moss_Lane_-_geograph.org.uk_-_388800.jpg",
      "title": "Paul Anderson / Summerseat Moss Lane",
      "caption": "Moss Lane. These cottages in Summerseat are in beautiful spot overlooking the cricket ground of Brooksbottom Cricket Club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Water_Fowl_Lake_-_geograph.org.uk_-_388764.jpg",
      "title": "Paul Anderson / Water Fowl Lake",
      "caption": "Water Fowl Lake. Next to the Irwell Sculpture Trail just south of the village, is this small well maintained lake which has a large variety of ducks and geese."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Nuttall_Park_in_June_-_geograph.org.uk_-_464791.jpg",
      "title": "liz dawson / Nuttall Park in June",
      "caption": "Nuttall Park in June. Nuttall Park opened in 1928 and is just 600 metres from the centre of Ramsbottom. The mill chimney in the centre of the picture is the Paper Mill. Formerly the Trinity paper mill it was owned by Mondi when this picture was taken in 2007. Mondi are the country's third largest corrugated packaging company making corrugated sheet from recycled cardboard at this plant in Ramsbottom. In September 2008 the Austrian paper mill operator Mondi announced that it had entered into a staff consultation over the closure of its Holcombe Mill in Ramsbottom. Holcombe Mill produced 105,000 tonnes of recycled containerboard a year for the UK market. Mondi also blamed rising energy costs, declining demand and a slowing economy for the closure. The mill closed down in December 2008 and remains empty to this day. In January 2007 the park was badly flooded after the nearby river Irwell burst its banks."
    }
  ],
  "distance_km": 5.0,
  "description": "This village near Ramsbottom is a lovely place for a stroll. There's good riverside trails, a heritage railway, old mills and pretty cottages to see in this attractive conservation area. The walk starts from the train station on the East Lancashire Railway and follows the Irwell Sculpture Trail north to visit the river and mills in the village. You'll pass Brooksbottom where there's an interesting old mill and an impressive six arched viaduct over the river. The route continues up to Nuttall Park where there are some nice riverside trails and views of the passing old trains to enjoy.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Hamers Arms for some post walk refreshment. The traditional, stone-built pub includes an open fire and a nice garden area outside. They also do a fine Sunday carvery. You can find them at postcode BL0 9UG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and parkland trails make for a fine dog walk. The Hamers Arms mentioned above is also very dog friendly with water and treats available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north west from the village and you can enjoy a climb to Peel Tower where you can enjoy splendid views over the area. Just south of Ramsbottom there's the worthy Redisher Wood to explore. In the woods there are peaceful woodland trails and water features including the Holcombe Brook, a picturesque lake and photogenic waterfalls. Just to the east you can enjoy waterside paths around Ashworth Moor Reservoir before visiting the old mill ruins in the pretty Cheesden Valley. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/EOFtxdYePgw",
  "district": "Bury",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Railway Street, Wood Road, Summerseat, Bury, Greater Manchester, England, BL9 5PZ, United Kingdom",
  "postcode": "BL9 5PZ",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}