{
  "created_at": "2025-01-05T23:28:41.242374+00:00",
  "objectID": "20550cfa52df0e2368881b67d5e8608e",
  "ref": "haverfordwest-walking-route",
  "title": "Haverfordwest Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/da/Haverfordwest_priory_ruins_-_geograph.org.uk_-_322724.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/20550cfa52df0e2368881b67d5e8608e.gpx",
  "_geoloc": {
    "lat": 51.7985982299,
    "lng": -4.9644589756
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Haverfordwest_priory_ruins_-_geograph.org.uk_-_322724.jpg",
      "title": "ceridwen / Haverfordwest priory ruins",
      "caption": "Haverfordwest priory ruins. The priory was built by the Augustinian monastic order on the bank of the Cleddau just outside the town wall in the early C13. It consisted of a cruciform church, cloister, garden and ancillary structures. The monks would have made a living from rents and spiritual duties, while providing work for the local people who serviced the priory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Weir_on_the_River_Cleddau_at_Haverfordwest_-_geograph.org.uk_-_1022187.jpg",
      "title": "Angela Jones / Weir on the River Cleddau at Haverfordwest",
      "caption": "Weir on the River Cleddau at Haverfordwest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/River_Cleddau_at_Haverfordwest_from_the_Priory_ruins_-_geograph.org.uk_-_831690.jpg",
      "title": "Deborah Tilley / River Cleddau at Haverfordwest from the Priory ruins",
      "caption": "River Cleddau at Haverfordwest from the Priory ruins. The County Hall can be seen to the right and the old quayside warehouses centre left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Fish_Pass_on_the_Western_Cleddau%2C_Haverfordwest_-_geograph.org.uk_-_616470.jpg",
      "title": "Humphrey Bolton / Fish Pass on the Western Cleddau, Haverfordwest",
      "caption": "Fish Pass on the Western Cleddau. \u0093The fish pass was installed in 2003 by the Environment Agency Wales Fishing Wales Project. The new pass allows migratory fish to enter the river to complete their life cycle.\u0094 The New Bridge is in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Little_Milford_on_the_West_Cleddau_-_geograph.org.uk_-_844364.jpg",
      "title": "Shaun Butler / Little Milford on the West Cleddau",
      "caption": "Little Milford on the West Cleddau"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Camouflaged_fingerpost_-_geograph.org.uk_-_944064.jpg",
      "title": "Shaun Butler / Camouflaged fingerpost",
      "caption": "Fingerpost at Little Milford, blending into the background..."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Looking_up_High_Street_-_geograph.org.uk_-_501602.jpg",
      "title": "ceridwen / Looking up High Street",
      "caption": "Looking up the High Street. Entering the town at this point, from Picton Place across the new bridge, there is a prospect of the High Street climbing up from Castle Square towards St Mary's Church at the top of the hill. The bridge, and the terraces lining it, were built in the early 1830's. The bank on the left in the image was the family home of Gwen and Augustus John towards the end of the C19. The pink building is the Castle Hotel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Haverfordwest_Museum_-_geograph.org.uk_-_280970.jpg",
      "title": "ceridwen / Haverfordwest Museum",
      "caption": "Castle Museum. Straight ahead is the town museum and on the left the County Records Office housed in the former county jail, both within the castle keep. The curtain wall can be seen beyond."
    }
  ],
  "distance_km": 9.7,
  "description": "Haverfordwest is the county town of Pembrokeshire. There are some nice waterside walks along the River Cleddau which runs through the town. The town is also not far from the wonderful Pembrokeshire Coast Path. This walk takes you along the Western Cleddau to the village of Little Milford, just to the south of the town. The walk starts at the ruins of Haverfordwest priory, located next to the river, just to the south west of the train station. It's a peaceful and atmospheric spot with the picturesque ruins and flowing river. There's also a number of information boards detailing the history of the priory which dates back to the 12th century. From here you can pick up a public footpath heading south along the river to the village of Little Milford. The area is run by the National Trust and includes ancient woodland and river views. You can follow the peaceful trails around the woods before returning to Haverfordwest on the same river paths. If you continue south you could visit nearby Llangwm where there are some fine trails along the river estuary with lots of wildlife to look out for on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bristol Trader is in a nice location right next to the river. The pub has an interesting history as there has been an inn at the quay since at least the 1700’s. It was once a bustling trading port at the tidal limit of the river Cleddau, upstream from Milford Haven. They do good food and can be found on Quay Street at a postcode of SA61 1BE."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The riverside paths and woodland trails on the route make for a good dog walk. The Bristol Trader Pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east of the town and you'll soon come to the nearby Picton Castle Gardens. There's some nice easy footpaths to follow around the grounds of the historic castle. Near here you can pick up the Landsker Borderlands Trail, visit Slebech Park and explore the expansive Canaston Woods. To the north of the town is Scolton Manor Country Park where there's 60 acres of attractive parkland surrounding a Victorian manor house. The Brunel Trail can be picked up in Harverfordwest. The popular route runs south along an old railway line to Johnston and Neyland Marina. It's traffic free so suitable for both cyclists and walkers."
    }
  ],
  "district": "Haverfordwest",
  "county": "Pembrokeshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Haverfordwest Priory, Freemens Way, Haverfordwest, Pembrokeshire, Cymru / Wales, SA61 1TR, United Kingdom",
  "postcode": "SA61 1TR",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical site",
    "river views"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}