{
  "created_at": "2025-01-06T18:49:14.672950+00:00",
  "objectID": "2090e350006080cec1e75bc53217247f",
  "ref": "troup-head-walking-route",
  "title": "Troup Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Gannets_at_Troup_Head_-_geograph.org.uk_-_4572776.jpg?20230329062947",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2090e350006080cec1e75bc53217247f.gpx",
  "_geoloc": {
    "lat": 57.68786,
    "lng": -2.29956
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Gannets_at_Troup_Head_-_geograph.org.uk_-_4572776.jpg?20230329062947",
      "title": "Gannets at Troup Head by Gordon Brown, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gannets at Troup Head. The area is also renowned for its birdlife, particularly in spring and summer when thousands of seabirds flock to the cliffs to breed. Troup Head is home to one of the largest seabird colonies in Scotland, and the iconic puffins, along with guillemots, razorbills, and kittiwakes, can be spotted from the cliffs. The walk offers excellent opportunities for birdwatching, with the sounds of the seabirds and the occasional sight of a passing gannet or sea eagle enhancing the experience. Along the way, you'll also encounter a range of coastal plants, including thrift, sea campion, and viper's bugloss, which thrive in the salty sea air."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Troup_Head_-_geograph.org.uk_-_434465.jpg?20110204092654",
      "title": "Anne Burgess / Troup Head",
      "caption": "Troup Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Triangulation_Pillar_at_Troup_Head_-_geograph.org.uk_-_909377.jpg?20110221210608",
      "title": "Claire Pegrum / Triangulation Pillar at Troup Head",
      "caption": "Triangulation Pillar at Troup Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/View_of_Lions_Head_and_Pennan_from_Troup_Head_-_geograph.org.uk_-_596123.jpg?20110206211718",
      "title": "sylvia duckworth / View of Lions Head and Pennan from Troup Head",
      "caption": "View of Lions Head and Pennan from Troup Head"
    }
  ],
  "distance_km": 2.0,
  "description": "This circular walk takes you around RSPB Troup Head on the Moray Coast. The route starts from the parking area and then takes you along rugged cliffs, providing stunning views over the North Sea. As you walk, you'll see the dramatic coastal landscape, with the cliffs of Troup Head rising steeply above the water, and the surrounding countryside offering a peaceful contrast of rolling fields and coastal heathland. The path also passes through areas of grassland and gorse, where a variety of wildflowers bloom in the warmer months, adding a splash of colour to the otherwise wild and windswept landscape. As you near the end of the route, the views expand to include distant headlands and the neighbouring coastline, making it a great spot for photography. Whether you're an avid birdwatcher, a nature enthusiast, or simply someone looking to enjoy the dramatic landscapes of the Scottish coast, the Troup Head walk offers a memorable experience. The quiet beauty of the area, combined with its rich wildlife and varied scenery, makes this a rewarding and relatively undisturbed walk for those seeking a peaceful escape.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/X_BIYdy_Lsw?si=S5_9ZWUBonN4NGla",
  "postcode": "AB45 3JJ",
  "county": "Aberdeenshire",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}