{
  "created_at": "2025-01-05T23:46:04.546298+00:00",
  "objectID": "210bae605c6e28bd62c4e2d683d361e6",
  "ref": "crewkerne-walking-route",
  "title": "Crewkerne Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/86/Behind_The_George_-_Crewkerne_-_geograph.org.uk_-_980077.jpg",
  "nearby": [
    {
      "description": "Hardy Monument",
      "objectID": "3f577f18db95a76774e71d703caa64fe",
      "ref": "hardy-monument-walking-route"
    },
    {
      "description": "River Parret Trail",
      "objectID": "1b25fa6dc78efa7cac7abfa6629880aa",
      "ref": "river-parret-trail-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Wayford Woods",
      "objectID": "e6129bf7502cfb0f4d045b83d44d86ce",
      "ref": "wayford-woods-walking-route"
    },
    {
      "description": "Forde Abbey",
      "objectID": "1ebbb7de73ab5f80b3e5657d37eef4ca",
      "ref": "forde-abbey-walking-route"
    },
    {
      "description": "Liberty Trail",
      "objectID": "c3975730f5d984ea6aa97c0f43011ab1",
      "ref": "liberty-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/210bae605c6e28bd62c4e2d683d361e6.gpx",
  "_geoloc": {
    "lat": 50.8856366417,
    "lng": -2.7893586309
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Behind_The_George_-_Crewkerne_-_geograph.org.uk_-_980077.jpg",
      "title": "Sarah Smith / Behind The George - Crewkerne",
      "caption": "Behind The George. In the old days the carriages and horses came through the arch to the back here. Now the area has been made into an attractive walkway through to a supermarket and carparks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Church_Hall_-_blue_plaque_-_geograph.org.uk_-_893912.jpg",
      "title": "Sarah Smith / Church Hall - blue plaque",
      "caption": "Church Hall, Crewkerne. There is always confusion over Dorset's two famous men called Thomas Hardy. This plaque mentions Thomas Masterman Hardy (or \"Kiss me Hardy\") born in Dorset at Kingston Russell, moving to Portesham in 1769 and going to sea in 1781 to become a close friend of Admiral Nelson - Hardy was at his side when Nelson was dying in battle. Hardy's Monument on the hill above Portesham is in his memory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Behind_the_Town_Hall_Crewkerne_-_geograph.org.uk_-_1324534.jpg",
      "title": "Sarah Smith / Behind the Town Hall Crewkerne",
      "caption": "Behind the Town Hall Crewkerne. The cars from North Street whizz past the Georgian houses on the north side of Market Square. No longer lived in the buildings are now used as offices. On the right is the back of the Town Hall. Notice the matching door and telephone box."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Church_Hall_Crewkerne_-_geograph.org.uk_-_897115.jpg",
      "title": "Sarah Smith / Church Hall Crewkerne",
      "caption": "Church Hall, Crewkerne. The former Grammar School was founded in 1499 on the site of a priest's house by John Combe,a Canon of Exeter who was vicar of Crewkerne from 1472 to 1496. The present building dates from 1636 and is now the Church Hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Where_Curriott_Hill_Road_meets_Barn_Street_-_Crewkerne_-_geograph.org.uk_-_1139978.jpg",
      "title": "Sarah Smith / Where Curriott Hill Road meets Barn Street - Crewkerne",
      "caption": "Where Curriott Hill Road meets Barn Street - Crewkerne. On the right is the sixteenth century rear wing of The Old Parsonage, built originally as a farm house, and over the junction in Barn Street is a housing development which looks like a converted barn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/East_Hams_Lane%2C_minor_tributary_of_R._Parrett_-_geograph.org.uk_-_680681.jpg",
      "title": "Rabbi WP Thinrod / East Hams Lane, minor tributary of R. Parrett",
      "caption": "East Hams Lane, minor tributary of the River Parrett, just east of the town. Last Summer's teasels enliven a bleak wintry landscape. The water flows from the direction of the nearby sewage works but looked clear and bright."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Stile%2C_Perrott_Hill._-_geograph.org.uk_-_680813.jpg",
      "title": "Rabbi WP Thinrod / Stile, Perrott Hill.",
      "caption": "Stile, Perrott Hill. A lifting top rail keeps stock in place but allows easy passage for walkers. In the background is out-of-square Higher Easthams Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/North_Perrott_-_geograph.org.uk_-_457443.jpg",
      "title": "Mike Searle / North Perrott",
      "caption": "North Perrott. The pub on the right is the Manor Arms."
    }
  ],
  "distance_km": 8.0,
  "description": "This Somerset based market town has some nice trails along the River Parret and is close to the epic Monarch's Way long distance footpath. There's also a fine nature reserve on the outskirts of the town where you can enjoy peaceful walks and look out for wildlife. The town itself has a number of interesting 18th and 19th century Georgian Houses, several antique shops and a noteworthy 15th century church to see. This circular walk from the town takes you to the nearby villages of North Perrott and Misterton. The walk starts in the town centre but you could also start from the train station which is located just to the south east of the town. From the town you follow footpaths east to link up with the River Parret Trail near Higher Easthams Farm. You can then follow this waymarked trail east into North Perrott. Here you can pay a visit to the Church of St Martin. This historic church dates from the 12th century and has been designated by English Heritage as a Grade I listed building. The route then heads east through the countryside to Misterton where you'll find the train station. There's more interesting old buildings here with the manor house dating from the 18th century and the Globe Inn dating back to the 17th century. The inn makes for a nice pit stop on the route. From Misterton you can follow paths north to return to the town centre where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town the Crooked Swan is a good choice for some post walk refreshment. The 18th century coaching inn has a fine interior with exposed steel beams, open fire and cosy nooks and crannies. Outside there's a lovely garden area to relax in on warmer days. They serve excellent food and can be found on Church Street at postcode TA18 7HR for your sat navs. You could also stop off at the Grade II listed Globe Inn in Misterton. The classic stone pub dates to the 17th century and has a good selection of ales. You can find them on Middle Street at postcode TA18 8LX. It's located very close to the train station so if you are starting/finishing the walk from there it's a nice option. The waymarked Liberty Trail can also be picked up in this area."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a nice walk with your dog. The Crooked Swan mentioned above is dog friendly in the courtyard area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Bincombe Beeches Nature Reserve can be found on the north side of the town. The reserve derives its name from the magnificent line of beech trees, some between 150 and 200 years old, on the town side of the hill. From the elevated position of the reserve there are fine views over the town to the surrounding countryside. It's a great spot for flora and fauna with the veteran trees and a variety of butterflies to see. Also look out for birds such as Woodpeckers, Goldcrests and Buzzards in the skies above. You can find the reserve at postcode TA18 7AJ for your sat navs. For more great views and some interesting local history climb to the nearby Hardy Monument. Here you'll find a monument to Vice-Admiral Sir Thomas Masterman Hardy, Nelson's Flagship Captain of HMS Victory at the Battle of Trafalgar. Hardy was schooled at Crewkerne Grammar School at the Jacobean Church Hall in the town. You can find a plaque with this information at the building which dates from 1636. Head a few miles south west of the town and you could visit Wayford Woods. It's a picturesque spot with pretty streams, an ornamental lake, Rhododendrons, azaleas and bluebells in the spring months. You could also explore the nearby village of Wayford where there's the 17th century Wayford Manor House and a notable 13th century church to see. In the area you can also pick up the long distance Liberty Trail. This can be followed to another highlight of the area at Forde Abbey where you will find a historic Cistercian monastery with 30 acres of award winning gardens to explore.A few miles west of the town there's Cricket St Thomas to consider. The area around the delightful village includes peaceful lakes, secluded woodland and beautiful gardens.  For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "district": "Crewkerne",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Easthams Road, Crewkerne, Somerset, England, TA18 7AQ, United Kingdom",
  "postcode": "TA18 7AQ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "river"
  ],
  "points_of_interest": [
    "historic churches",
    "villages",
    "countryside"
  ],
  "facilities": [
    "pub",
    "historic buildings"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}