{
  "created_at": "2025-01-06T08:05:55.351610+00:00",
  "objectID": "211079356575fd2b01f48654b573ae02",
  "ref": "coalbrookdale-walking-route",
  "title": "Coalbrookdale and the Ironbridge Gorge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Coalbrookdale%2C_Shropshire_-_geograph.org.uk_-_139108.jpg",
  "nearby": [
    {
      "description": "Severn Way",
      "objectID": "72be59b71bcbfee43d10b1521911293f",
      "ref": "severn-way-walking-route"
    },
    {
      "description": "Telford",
      "objectID": "773b8caa60b4c80640a6d16aa219b0cb",
      "ref": "telford-walking-route"
    },
    {
      "description": "Ironbridge Way",
      "objectID": "cfe0eedf53a1feba8997d3edde99c201",
      "ref": "ironbridge-way-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "The Wrekin",
      "objectID": "382172122ba35a0c58e6a5273a47bc50",
      "ref": "the-wrekin-walking-route"
    },
    {
      "description": "Shifnal",
      "objectID": "6864b5a39ad0e9f974daf09c3b155d05",
      "ref": "shifnal-walking-route"
    },
    {
      "description": "Benthall Hall",
      "objectID": "6814fe0f3cefc4679ad545383ee34ecc",
      "ref": "benthall-hall-walking-route"
    },
    {
      "description": "Wellington",
      "objectID": "1291476225fcc70c11a3a6ea160f8837",
      "ref": "wellington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/211079356575fd2b01f48654b573ae02.gpx",
  "_geoloc": {
    "lat": 52.6400253189,
    "lng": -2.4903946856
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Coalbrookdale%2C_Shropshire_-_geograph.org.uk_-_139108.jpg",
      "title": "Tammy Winand / Coalbrookdale, Shropshire",
      "caption": "Coalbrookdale, Shropshire. Viaduct over the pond once used to power Darby Furnace, now at the Museum of Iron"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Dale_End_Court%2C_Coalbrookdale_-_geograph.org.uk_-_1242793.jpg",
      "title": "Anji Carrier / Dale End Court, Coalbrookdale",
      "caption": "Dale End Court, Coalbrookdale. Dale End Court at the bottom of Dale Road, which is at the lower end of the village where it meets Ironbridge Gorge. A complex of flats and apartments built at the end of the last century during 1999. The building looks to have been carefully designed to echo the local historical architectural features of the decorative dentil brickwork cornicing at the eaves and the simple barred casement windows, both seen frequently within this Ironbridge and Coalbrookdale conservation area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Coalbrookdale_Museum_-_geograph.org.uk_-_690304.jpg",
      "title": "Row17 / Coalbrookdale Museum",
      "caption": "Museum of Iron, Coalbrookdale. One of the 10 museums in Ironbridge Valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Ironbridge_Town_-_geograph.org.uk_-_1637666.jpg",
      "title": "Paul Buckingham / Ironbridge Town",
      "caption": "Ironbridge Town. View of the town from the iron bridge. The Tontine hotel is on the right of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/The_very_end_of_the_Rough_Park_Way%2C_Coalbrookdale_-_geograph.org.uk_-_1763813.jpg",
      "title": "Richard Law / The very end of the Rough Park Way, Coalbrookdale",
      "caption": "The very end of the Rough Park Way. Ironbridge 1/2 Marathon disgorges runners off the Rough Park Way onto the roads at the upper end of Coalbrookdale here, from where it's downhill all the way to the bridge itself."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/The_Rough_Park_Way%2C_north_of_Woodside_-_geograph.org.uk_-_1763767.jpg/512px-The_Rough_Park_Way%2C_north_of_Woodside_-_geograph.org.uk_-_1763767.jpg",
      "title": "Richard Law / The Rough Park Way, north of Woodside",
      "caption": "The Rough Park Way, north of Woodside. This walking trail runs just to the east of the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Trevithick_locomotive_at_Blists_Hill_-_geograph.org.uk_-_571032.jpg?20110206115546",
      "title": "M J Richardson / Trevithick locomotive at Blists Hill",
      "caption": "Trevithick locomotive at Blists Hill. This is a replica of the first railway locomotive in the world. It was designed by Richard Trevithick and built by the Coalbrookdale ironworks in 1802."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/The_Upper_Furnace_Pool_-_geograph.org.uk_-_571108.jpg?20110206114532",
      "title": "M J Richardson / The Upper Furnace Pool",
      "caption": "The Upper Furnace Pool. Part of the water management scheme for the Coalbrookdale foundries, this provided water to power the bellows for the blast furnaces, and the turning and grinding machines. The railway viaduct was built in 1862-64 to carry trains from Wellington to Craven Arms. It still carries trains, taking coal to the power station."
    }
  ],
  "distance_km": 5.3,
  "description": "A circular walk from the village of Coalbrookdale exploring Shropshire's wonderful Ironbridge Gorge. The walk starts from the Coalbrookdale Museum of Iron which is located south west of Telford at postcode TF8 7DQ. The fascinating museum details the history of the area and features stunning exhibits, exquisite art castings and functional cookware all made from iron. From the museum you can pick up woodland trails heading south through the gorge to the town of Ironbridge on the River Severn. The historic town takes its name from, The Iron Bridge, a 100-foot (30 m) cast iron bridge that opened in 1781. The surrounding gorge, was formed by a glacial overflow from the long drained away Lake Lapworth, at the end of the last ice age. After exploring the town the route then follows the Severn Way footpath east along the river before picking up the Ironbridge Way. This waymarked trail will take you north through the gorge to Rough Park. There are some nice trails here heading west along the Rough Park Way back into Coalbrookdale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Hart in Ironbridge is a good place to stop for refreshments. The 18th century inn is located in a great spot next to the river. You can find it at 10 Wharfage, with a postcode of TF8 7AW for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails in the gorge are ideal for dog walking. The White Hart pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east of the gorge you'll find the attractive market town of Shifnal. There's a nice easy climb to Lodge Hill to the south of the town. It's a good viewpoint with nice views over the area to the Wrekin. The Shifnal Walk visits the hill and the gorge from the town and is a nice way to reach it on foot. The village is also close to Telford so you can easily pick up the Telford Walk. The route uses the Silkin Way and the Ironbridge Way to create a circular walk around the town on good waymarked footpaths. Also nearby is the lovely Granville Country Park where there more nice trails to try. Just a mile south of the Iron Bridge you can follow a footpath to Benthall Hall. This National Trust owned hall dates from the 16th century and includes some beautiful gardens. You can tour the fine house and learn all about the interesting family history which dates back to the doomsday. book.  Just to the north west there's the lovely Aqualate Mere to explore. There's a pleasant waterside path to pick up at this large, scenic lake. The site is one of the area's highlights and notable as the largest natural lake in the English Midlands. Just to the west of here there's the interesting market town of Newport where you can enjoy another waterside stroll along the old Newport Canal. The Wellington Walk starts from the historic market town which lies just north west of Telford. It visits the wonderful viewpoint at The Wrekin and The Ercall Nature Reserve where there are some striking geological features to admire. The walk start from close to the town's bus station and train station making the area accessible by public transport. The town is also well worth exploring with its historic market and the splendid Victorian house and garden at the National Trust's Sunnycroft to see. For more walks in the area see the Shropshire Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/9O5NhpUtGTs",
  "postcode": "TF8 7ED",
  "district": "Coalbrookdale",
  "county": "Telford and Wrekin",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Woodside, Hollybank, The Gorge, Coalbrookdale, Telford and Wrekin, England, TF8 7ED, United Kingdom",
  "state": "England"
}