{
  "created_at": "2025-01-06T00:14:59.179103+00:00",
  "objectID": "218ad351954d52da1e29bb640bfe039f",
  "ref": "mevagissey-walking-route",
  "title": "Mevagissey Walks - Mevagissey to Pentewan Coastal Walk",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Harbour_entrance%2C_Mevagissey_-_geograph.org.uk_-_1389092.jpg",
  "nearby": [
    {
      "description": "Pentewan Trail",
      "objectID": "c48fb23e27feeeea185d149ec0d0b06d",
      "ref": "pentewan-trail-walking-and-cycle-route"
    },
    {
      "description": "Lost Gardens of Heligan",
      "objectID": "7341db414faccd0638034c6c5fa430c9",
      "ref": "lost-gardens-of-heligan-walking-route"
    },
    {
      "description": "Dodman Point",
      "objectID": "a6371c94aa25dc9e38d44323716ce353",
      "ref": "dodman-point-walking-route"
    },
    {
      "description": "Tregargus Valley",
      "objectID": "464a66a71305043b5090ae389d383bd0",
      "ref": "tregargus-valley-walking-route"
    },
    {
      "description": "Gorran Haven to Mevagissey Circular Walk",
      "objectID": "6c986d536962b06f99aea9031e560a3f",
      "ref": "gorran-haven-to-mevagissey-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/218ad351954d52da1e29bb640bfe039f.gpx",
  "_geoloc": {
    "lat": 50.2705548312,
    "lng": -4.7849178254
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Harbour_entrance%2C_Mevagissey_-_geograph.org.uk_-_1389092.jpg",
      "title": "Derek Harper / Harbour entrance, Mevagissey",
      "caption": "Harbour entrance, Mevagissey. A trip boat leaves The Pool between North Pier and Victoria Pier, with its lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_Cliff%2C_Mevagissey_-_geograph.org.uk_-_1389054.jpg",
      "title": "Derek Harper / The Cliff, Mevagissey",
      "caption": "The Cliff, Mevagissey The Hoss, occupying an unusual footprint between The Cliff and East Wharf, is so named because \"timbers in the house were taken from a ship in the 17th century named the Horse\". These buildings overlook the harbour from the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Little_Polstreath_-_geograph.org.uk_-_1389197.jpg/256px-Little_Polstreath_-_geograph.org.uk_-_1389197.jpg",
      "title": "Derek Harper / Little Polstreath",
      "caption": "Little Polstreath. The small beach is separated from Polstreath to the north by what appears, from this angle, to be a single headland. The further, less vegetated part is a separate stack. That water does look tempting, but it is about 70 metres below."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/The_Cliff%2C_Mevagissey_-_geograph.org.uk_-_1389070.jpg",
      "title": "Derek Harper / The Cliff, Mevagissey",
      "caption": "The Cliff, Mevagissey. This path lined on the north side with cottages leads to the coast path to Pentewan. Wedged in between two paths, number 18 is listed. The white building down by the harbour is the village Museum."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Polstreath_and_Little_Polstreath_-_geograph.org.uk_-_1389190.jpg",
      "title": "Derek Harper / Polstreath and Little Polstreath",
      "caption": "Polstreath and Little Polstreath. The two beaches are separated by the headland and stack; Little Polstreath is the beach on this side. Beyond is Penare Point, with Black Head in the distance. Seen over a rather awkward high fence at Pentillie."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Caravan_and_camping_park%2C_Pentewan_-_geograph.org.uk_-_1389545.jpg",
      "title": "Derek Harper / Caravan and camping park, Pentewan",
      "caption": "Caravan and camping park, Pentewan. Pentewan Sands Holiday Park, seen from the coast path just south of the entrance. Black Head peers round the corner of Gamas Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Cove_near_Portgiskey_-_geograph.org.uk_-_1389337.jpg",
      "title": "Derek Harper / Cove near Portgiskey",
      "caption": "Cove near Portgiskey. This little cove is between Portgiskey (left) on the way to the white sands of Pentewan."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Rhododendrons_over_water%2C_Heligan_-_geograph.org.uk_-_82844.jpg/256px-Rhododendrons_over_water%2C_Heligan_-_geograph.org.uk_-_82844.jpg",
      "title": "Rob Farrow / Rhododendrons over water, Heligan",
      "caption": "Rhododendrons over water, Heligan. The \"Lost\" Gardens of Heligan are quite magnificent. The rhododendrons are particularly spectacular."
    }
  ],
  "distance_km": 8.0,
  "description": "The fishing village of Mevagissey is located in a lovely spot on the Cornish coast. There's a picturesque harbour, interesting narrow streets with old shops and pretty cottages to see. The village is notable for its thriving fishing industry, being the second biggest fishing port in Cornwall. For walkers there's lovely coastal trails, an inland riverside rail trail and one of Cornwall's highlights at the nearby Lost Gardens of Heligan. This circular walk from the village heads north along the coastal path to Pentewan before returning inland through the countryside. The walk starts on the front where you can pick up the South West Coast Path and follow the waymarked footpath north to Polstreath, Penare Point, Portgiskey and Tregiskey before passing Sconhoe Beach and arriving at Pentewan. The route then heads west to Barton Farm before climbing to Dart's Well and Peruppa Farm. Near here you can take a small detour from the route to visit the stunning Lost Gardens of Heligan. This route picks up the Pentewan Trail and follows it south east to Heligan Mill and Cheeswarne Farm. The final section then descends through the village to finish back on the front.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village the Sharksfin is a great choice for some post walk refreshments. The pub is ideally located next to the quay with views across the harbour. They do excellent seafood including a particularly popular fish and chips. The interior is very attractive too, being decorated with works by local artists. You can find them at a postcode of PL26 6QU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal and country paths make for a bracing dog walk. The inland Pentewan trail section may have a few cyclists so it's best to keep your dog under control in this area. The Sharksfin pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking around the village you could continue along the Pentewan Trail. The shared cycling and walking trail runs from Mevagissey to St Austell along a disused railway line. When in St Austell you could enjoy a stroll around the lovely Pinetum Gardens. The 30-acre garden is home to one of the largest plant collections in the county. Head south from the village and you could visit Gorran Haven and Dodman Point. There's a nice circular trail around this beautiful area which is notable as the highest headland on the south coast of Cornwall. Just to the north west there's the Tregargus Valley where you can enjoy woodland walks along the River Fal. There's also interesting industrial history with a series of old mine buildings and the old China Clay Works at Goonvean Quarry. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3I-bOiLi01E",
  "postcode": "PL26 6QT",
  "district": "Mevagissey",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Frazier's Cottage, 24, The Cliff, Mevagissey, Cornwall, England, PL26 6QT, United Kingdom",
  "state": "England"
}