{
  "created_at": "2025-01-06T04:02:52.114024+00:00",
  "objectID": "21afd33527f96f7f6d8f57de8a3e5d97",
  "ref": "foremark-reservoir-walking-route",
  "title": "Foremark Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/68/Foremark_Reservoir_dam_and_outfall_-_geograph.org.uk_-_466029.jpg",
  "nearby": [
    {
      "description": "Staunton Harold Reservoir",
      "objectID": "346d68b440468414343cafa95b753d5d",
      "ref": "staunton-harold-reservoir-walking-route"
    },
    {
      "description": "Willington",
      "objectID": "feb879e9f1005b6ae2d09118cf41dacc",
      "ref": "willington-walking-route"
    },
    {
      "description": "Branston Water Park",
      "objectID": "cb78aad3a88eb15226ddfd0fc37e895a",
      "ref": "branston-water-park-walking-route"
    },
    {
      "description": "National Forest Way",
      "objectID": "33273a16668d5733c3b1e311dffdbaed",
      "ref": "national-forest-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/21afd33527f96f7f6d8f57de8a3e5d97.gpx",
  "_geoloc": {
    "lat": 52.8135236585,
    "lng": -1.5031509509
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Foremark_Reservoir_dam_and_outfall_-_geograph.org.uk_-_466029.jpg",
      "title": "Jerry Evans / Foremark Reservoir dam and outfall, via Wikimedia Commons",
      "caption": "Foremark Reservoir dam and outfall. The reservoir at Foremark supplies Leicestershire with water, The dam is up to 200 feet high and over 1000m long. It is normally closed to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/The_visitor_centre_-_geograph.org.uk_-_387605.jpg",
      "title": "John Poyser / The visitor centre, via Wikimedia Commons",
      "caption": "The visitor centre at the reservoir, a small cafe is open at weekends."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Foremark_reservoir_-_geograph.org.uk_-_393759.jpg",
      "title": "Lynne Kirton / Foremark reservoir",
      "caption": "Foremark, a 230 acre, Severn -Trent owned reservoir and nature reserve near Ticknall, providing fishing, watersports, picnic areas & children's playground. There is a small visitor centre. The Reservoir was built in the 1970s and originally supplied Leicester and the East Midlands with drinking water, but it now supplies Melbourne water treatment works."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Foremark_Reservoir_dam_and_outfall_-_geograph.org.uk_-_466029.jpg",
      "title": "Jerry Evans / Foremark Reservoir dam and outfall",
      "caption": "Dam and outfall. The reservoir at Foremark supplies Leicestershire with water, The dam is up to 200 feet high and over 1000m long. It is normally closed to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Permissive_bridleway_-_geograph.org.uk_-_393797.jpg",
      "title": "Lynne Kirton / Permissive bridleway",
      "caption": "View of the permissive bridleway on the eastern side of the water. This is suitable for a cycle ride."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Young_saplings_-_geograph.org.uk_-_387612.jpg",
      "title": "John Poyser / Young saplings",
      "caption": "Young saplings. Planted in the field next to the reservoir are these young beech saplings,this is another part of theNational Forest."
    }
  ],
  "distance_km": 3.0,
  "description": "This walk visits the pretty Foremark Reservoir near Burton Upon Trent in Derbyshire. The walk starts at the car park at the north eastern end of the reservoir and follows woodland trails along the reservoir to Carver's Rocks. The area is a nature reserve so look out for a variety of wildlife including several species of butterflies and wildfowl. The woodland area is lovely with bluebells and silver birches near the reservoir banks. It's a great place for a picnic and you can also purchase refreshments at the cafe. The reservoir is located near Ashby-de-la-Zouch, Ingleby, Swadlincote and Willington. To extend your walking in the area you can visit the lovely Staunton Harold Reservoir or Calke Park .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a nice on site cafe where you can enjoy some refreshments after your exercise. There's plenty of seating outside where you can enjoy the views in fine weather. There's also the option of heading a short distance east into the village of Ticknall. Here you'll find the excellent Chequers Inn. The friendly pub has a cosy fire indoors and a good sized garden area to sit out in. You can find it in the village at 27 High St with a postcode of DE73 7JH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir is a great place to take the dogs for a walk. You'll often see dogs splashing around in the beachy area by the water. There's also some pockets of woodland surrounding the water which are ideal for you and your pet. The on site cafe and the Chequers Inn mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The reservoir is located close to the town of Melbourne where there are some lovely walks at the southern end of the town. Our Melbourne Hall and Pool Walk visits the historic Georgian hall and the adjacent pretty pool. You can pick up the two mile trail about three miles east of the reservoir. Just over a mile north of the town you can also join with the Trent and Mersey Canal near Weston-on-Trent. There's some nice easy cycling and walking along the towpath here. In Calke park you could try the interesting Ticknall Tramway Tunnel Walk. This visits the old industrial tramway which connected the brickyards, lime quarries and lime yards of Ticknall to the Ashby Canal. The horse drawn system operated from 1802 to 1913. Today part of the route makes for a nice leisurely walk or cycle. You can pick up the trail just to the east of the water at Ticknall village. Just west of Burton there's the lovely Branston Water Park where there's a series of lakes to admire. The National Forest Way passes through the area. The long distance trail takes you to several of the highlights of the National Forest area. You could pick it up and visit the aforementioned Branston Water Park."
    }
  ],
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Repton Road, Foremark CP, South Derbyshire, Derbyshire, East Midlands, England, DE73 7JR, United Kingdom",
  "postcode": "DE73 7JR",
  "district": "South Derbyshire",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "nature reserve",
    "wildlife viewing"
  ],
  "facilities": [
    "car park",
    "cafe",
    "picnic"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}