{
  "created_at": "2025-01-06T04:01:38.937443+00:00",
  "objectID": "21be9ceae72cec7449000760d136c67e",
  "ref": "exton-walking-route",
  "title": "Exton Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Thatched_cottages_at_Exton_-_geograph.org.uk_-_63612.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/21be9ceae72cec7449000760d136c67e.gpx",
  "_geoloc": {
    "lat": 52.693504796,
    "lng": -0.6328242039
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Thatched_cottages_at_Exton_-_geograph.org.uk_-_63612.jpg",
      "title": "Humphrey Bolton / Thatched cottages at Exton",
      "caption": "Thatched cottages at Exton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Fort_Henry%2C_Exton-geograph-4818705.jpg/512px-Fort_Henry%2C_Exton-geograph-4818705.jpg",
      "title": "Alan Murray-Rust / Fort Henry, Exton Park",
      "caption": "Fort Henry. Pleasure House and flanking retaining Walls and Parapet, Exton, Rutland. A Grade II* listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/National_byway_junction_Exton_-_geograph.org.uk_-_1276707.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "National byway junction. With the Lodge to the former Exton Hall in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Exton_Church_-_geograph.org.uk_-_63975.jpg",
      "title": "Humphrey Bolton / Exton Church",
      "caption": "The Church of St Peter and St Paul is in the grounds of the big mansion of the parish, Exton Park. It has a 14C steeple of unusual outline, having an octagonal stage between the pinnacles and the spire. The church was thoroughly restored in 1850 after being damaged by lightning in 1843, and has had a Victorian appearance although 13C work is incorporated. There is an important collection of monuments from the 14C to the 18C, possibly the most beautiful being a recumbent sculpture of Anne, wife of Lord Bruce of Kinross, d.1627."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Fort_Henry%2C_Exton_Park_-_geograph.org.uk_-_188418.jpg",
      "title": "Tim Heaton / Fort Henry, Exton Park",
      "caption": "Fort Henry and lake. A mock-gothic fishing folly built in 1788"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Bridleway_in_open_farmland_-_geograph.org.uk_-_1276665.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridleway in open farmland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Bridleway_leading_to_Fort_Henry_Lake_and_also_the_A1_-_geograph.org.uk_-_1276637.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridleway leading to Fort Henry Lake and also the A1. A wonderful quiet area with lost to see and some excellent bridleways."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Bridleway_south_of_Tunneley_Wood%2C_Exton_Park_-_geograph.org.uk_-_188407.jpg",
      "title": "Tim Heaton / Bridleway south of Tunneley Wood, Exton Park",
      "caption": "Bridleway south of Tunneley Wood. The bridleway curves round towards the right, running between wheat and set-aside fields towards the village."
    }
  ],
  "distance_km": 6.5,
  "description": "This Rutland based village has some pleasant trails to follow through the parkland of the historic Exton Hall. There's also a particularly fine 17th century pub for rest and refreshment after your exercise. This circular walk from the village takes you through Exton Park to visit Fort Henry Lake. The walk starts in the village where you can pick up the Viking Way. Follow the waymarked footpath north east and it will take you to Tunneley Wood in Exton Park. Here you can pick up a bridle track and follow it south east to visit the two pretty lakes at Fort Henry. The route then follows an alternative bridleway back to the village. The flat bridle paths on the trail are ideal for easy walking with some pleasant farmland views to enjoy on the walk. To extend your walk follow the Viking Way south to visit Rutland Water. There's miles of great cycling and walking trails around the expansive lake which is one of the highlights of the county.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village there's the Fox and Hounds for some post walk refreshments. The attractive 17th century coaching inn overlooks the village green in the village. There's a cosy interior with a real log fire and a stunning English country garden for warmer weather. You can find them at postcode LE15 8AP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The parkland and woodland trails make for a fine dog walk. The Fox and Hounds mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Barnsdale Gardens are located just south west of the village. The beautiful gardens were created by former Gardener's World presenter Geoff Hamilton during the 1980s and 1990s. They are now open to the public and include Britain's largest collection of individually designed gardens. Highlights are the ornamental kitchen garden, a cottage garden and the Versailles garden. Head a few miles to the north and you'll find some peaceful woodland trails around Twyford Wood in Colsterworth. Just south there's neighbouring Empingham where you can enjoy a stroll down to the dam at Rutland Water. Just to the north there's Clipsham where you can enjoy a stroll along the tranquil Yew Tree Avenue with its splendid topiary. The pretty village also includes an award winning pub for refreshments afterwards. For more walking ideas in the area see the Rutland Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xZLEA-wWkx4",
  "district": "Exton",
  "county": "Rutland",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}