{
  "created_at": "2025-01-06T02:30:17.768603+00:00",
  "objectID": "220bddd97302e7779044aacde196eec4",
  "ref": "moira-furnace-walking-route",
  "title": "Moira Furnace Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Moira_Furnace_-_geograph.org.uk_-_275644.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/220bddd97302e7779044aacde196eec4.gpx",
  "_geoloc": {
    "lat": 52.7330631902,
    "lng": -1.5355357629
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Moira_Furnace_-_geograph.org.uk_-_275644.jpg",
      "title": "cris sloan / Moira Furnace",
      "caption": "Moira Furnace, with its ramp over the Ashby Canal, was Built by Francis Rawdon Hastings in 1804. Intending to exploit local minerals to smelt iron, it failed within months and was soon colonised by locals in need of housing. The building was used in this way right through to the early 1970's when it was earmarked for demolition. Thankfully it was saved and now is a jewel in Britain's industrial heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/The_Ashby_Canal_at_Donisthorpe%2C_Leicestershire.jpg",
      "title": "cris sloan / Not so new",
      "caption": "The Ashby Canal at Donisthorpe, Leicestershire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Bridge_over_Bramborough_brook_-_geograph.org.uk_-_663668.jpg",
      "title": "Jim Thornton / Bridge over Bramborough brook",
      "caption": "Bridge over Bramborough brook"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Engine_House_Cottage_-_geograph.org.uk_-_602951.jpg/256px-Engine_House_Cottage_-_geograph.org.uk_-_602951.jpg",
      "title": "Chris Allen / Engine House Cottage",
      "caption": "Engine House Cottage. Once a beam pumping engine house, now a des res with a Merecedes in the drive. Well known structure of IA (industrial archaeology) interest and photographed from the road outside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Sleeping_-_geograph.org.uk_-_561523.jpg",
      "title": "cris sloan / Sleeping",
      "caption": "Sleeping The Moira Furnace trip boat, The Joseph Wilkes, is moored up at night alongside. Firefly in the middle of the canal in an attempt to stop local idiots messing about with it at night. Up ahead the swingbridge can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Pay_a_visit_-_geograph.org.uk_-_561495.jpg",
      "title": "cris sloan / Pay a visit",
      "caption": "A dog poses by the sign in the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Pit_cage_from_nearby_Donisthorpe_Colliery_-_geograph.org.uk_-_275641.jpg",
      "title": "cris sloan / Pit cage from nearby Donisthorpe Colliery",
      "caption": "Pit cage from nearby Donisthorpe Colliery. This cage was a \"spare\" from the pit in the next village of Donisthorpe, and would accommodate 7 men per each of its 2 decks for the descent. Never used, it now stands in the shadow of Moira Furnace. It is quite sobering to stand inside it and imagine the cramped conditions endured by those of days past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Canal_terminus%2C_Moira_-_geograph.org.uk_-_60327.jpg",
      "title": "David Kitching / Canal terminus, Moira",
      "caption": "Canal terminus, Moira. The terminal basin of the Ashby Canal outside the National Forest Visitor Centre. Few boats will be seen here until the canal is restored and linked up again with the main canal network."
    }
  ],
  "distance_km": 3.3,
  "description": "This attraction in Moira includes a 36 acre country park with walking and cycling trails along the Ashby Canal. The Iron furnace was built by the Earl of Moira in 1804, during the Industrial Revolution. It has since been preserved by North West Leicestershire District Council as a museum featuring lime kilns and craft workshops. The circular walk starts at the Furnace car park and then follows the Ashby Canal south to Donisthorpe Woodland park. You can then pick up a section of the waymarked Ivanhoe Way to take you back towards the car park. You can extend the walk by continuing north to Conkers Waterside park and the terminus of the canal where you'll find the National Forest visitor centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There are a few nice shops and a good on site cafe selling a range of meals and snacks."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is dog friendly with bins dotted around the site. The parkland and woodland paths are popular with dog walkers so you'll probably see other owners on your visit."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Ashby Woulds Heritage Trail passes the site, providing an opportunity for further exploring this historic area. It additionally visits the Donisthorpe Colliery site exposing you to more of Moira's industrial heritage. If you head north you could visit neighbouring Swadlincote and the lovely Bretby Park. Less than half a mile to the east you'll find Hicks Lodge. This expansive area of woodland includes pleasant walking trails around several pretty ponds. There's also some excellent mountain bike trails to enjoy here. Just to the south east you'll find more woodland trails and a series of pretty lakes at Queen Elizabeth Diamond Jubilee Wood and Sence Valley Forest Park on the outskirts of Coalville. The National Forest Way passes through the area. The long distance trail takes you to several of the highlights of the National Forest area. Just to the west there's the Rosliston Forestry Centre to explore. The centre provides a wealth of information on the area and also has on site bike hire. The surrounding parkland is well worth exploring too with woodland trails, meadows, ponds, lots of butterflies and some interesting sculptures to see. The Woodland Trust's Badger Wood can also be accessed in this area. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gJr_qFwQHOo",
  "postcode": "DE12 6AT",
  "district": "North West Leicestershire",
  "county": "Leicestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swing Bridge, Ashby Woulds, Moira, North West Leicestershire, Leicestershire, England, DE12 6AT, United Kingdom",
  "state": "England"
}