{
  "created_at": "2025-01-06T03:36:04.834663+00:00",
  "objectID": "228e6f5ba7bafffc46c174128691e52d",
  "ref": "scale-force-walking-route",
  "title": "Scale Force Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Scale_Force_-_geograph.org.uk_-_1176876.jpg/256px-Scale_Force_-_geograph.org.uk_-_1176876.jpg",
  "nearby": [
    {
      "description": "Crummock Water",
      "objectID": "778948ecf18acc2fa4dcc7adb47b1ed1",
      "ref": "crummock-water-walking-route"
    },
    {
      "description": "Buttermere",
      "objectID": "9e5cd22c37b1be41a492341eb97fe4f6",
      "ref": "buttermere-walking-route"
    },
    {
      "description": "Loweswater",
      "objectID": "c72c8c5008e823c614cd04061aea6f44",
      "ref": "loweswater-walking-route"
    },
    {
      "description": "Ennerdale Water",
      "objectID": "e80e86107013e92fb3a9b4fb58254edd",
      "ref": "ennerdale-water-walking-route"
    },
    {
      "description": "Keswick to Buttermere Walk",
      "objectID": "6777b87d18924a0fc0fd435f13dbc1f9",
      "ref": "keswick-to-buttermere-walk-walking-route"
    },
    {
      "description": "Force Crag Mine",
      "objectID": "b47fd1c6d7598f833dc4c3ae32637bfa",
      "ref": "force-crag-mine-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/228e6f5ba7bafffc46c174128691e52d.gpx",
  "_geoloc": {
    "lat": 54.5411747443,
    "lng": -3.2768520048
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Scale_Force_-_geograph.org.uk_-_1176876.jpg/256px-Scale_Force_-_geograph.org.uk_-_1176876.jpg",
      "title": "Trevor Harris / Scale Force, via Wikimedia Commons",
      "caption": "Although it is less visited now, in the past boat trips across Crummock Water followed by guided excursions up to the waterfall were popular."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Scale_Beck_-_geograph.org.uk_-_1509795.jpg",
      "title": "Shaun Ferguson / Scale Beck, via Wikimedia Commons",
      "caption": "Scale Beck. The Beck flows out from Scale Force waterfall under the footbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Scale_Beck_-_geograph.org.uk_-_883077.jpg",
      "title": "Michael Graham / Scale Beck, via Wikimedia Commons",
      "caption": "Scale Beck. Runs a short but interesting course from under Little Dodd culminating in Scale Force before entering Crummock Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Crummock_Water_and_Grasmoor_from_above_Scale_Force_-_geograph.org.uk_-_1291077.jpg",
      "title": "Kenneth Yarham / Crummock Water and Grasmoor from above Scale Force, via Wikimedia Commons",
      "caption": "Crummock Water and Grasmoor from above Scale Force. The highest waterfall in the Lake District, is in the dip ahead. At 2,791 feet, Grasmoor is the highest of the fells in the group between Derwent Water and Crummock Water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Buttermere_Valley_-_geograph.org.uk_-_881714.jpg",
      "title": "Michael Graham / Buttermere Valley",
      "caption": "Buttermere Valley. Grazing land at the north end of the lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Buttermere_Dubs_-_geograph.org.uk_-_3483196.jpg/256px-Buttermere_Dubs_-_geograph.org.uk_-_3483196.jpg",
      "title": "Buttermere Dubs by Anne Burgess, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Buttermere Dubs. A section of the River Cocker connecting Crummock Water and Buttermere. You'll cross this waterway just to the south east of Buttermere village on your way to the falls."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Scale_Beck_-_geograph.org.uk_-_123460.jpg/256px-Scale_Beck_-_geograph.org.uk_-_123460.jpg",
      "title": "Ron Shirt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Scale Beck. Sunlight catching the lower slopes of Grasmoor. Taken on the descent from Scale Force to Crummock Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Bleaberry_Tarn_-_geograph.org.uk_-_782497.jpg",
      "title": "Andrew Smith / Bleaberry Tarn",
      "caption": "Bleaberry Tarn. Viewed from the top of Red Pike. The tarn is located in a typical hanging valley. Sour Milk Gill issues to the left."
    }
  ],
  "distance_km": 8.5,
  "description": "This walk visits Scale Force, the highest waterfall in the Lake District. The waterfall, though narrow, drops from a height of 170 feet in a deep wooden gorge. It's an impressive sight and well worth the short climb from Buttermere. This circular walk starts in the village of Buttermere, taking you along the beautiful Crummock Water and the pretty Scale Beck to the waterfall. From here you can simply descend back to Buttermere or follow the rest of the route to the nearby Red Pike. This is a challenging climb, passing Blea Crag and Lingcomb Edge before reaching the 2,476 ft (755 m) Red Pike Summit. It's worth the climb as there are wonderful views over a number of lakes including Derwentwater, Buttermere, Crummock Water, Ennerdale Water and Loweswater. The walk then descends to Buttermere passing the pretty Bleaberry Tarn and Buttermere lake on the way. If you'd like to continue your walking in this area you can enjoy lakeside walks around Crummock Water, Buttermere and Loweswater .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Buttermere village head to the The Fish Inn for some well earned refreshments. The inn has an interesting history being one of the oldest inns in the Lake District. They do good food and there's a comfy lounge with sofas and a fireplace to relax in indoors. There's also seating outside with fabulous views of the surrounding fells. You can easily find it in the village at postcode CA13 9XA.The Bridge Inn is also located right in the village. There's another fine garden area with one of the best views in England here.  Pictured above the Fish Hotel and the Bridge Hotel in Buttermere village. Dodd can be seen in the background rising up behind the Fish. The eponymous bridge by the Bridge Hotel carries the B5289 over Mill Beck. The hotel has a deep and interesting history stretching back several centuries. The current building stands on a site tracing back to the 11th century, where an armoury and a bakery stood, in connection with a watermill built higher up the stream. For seven centuries the mill worked continuously, the buildings being many times renewed. Around 1734, the buildings were sold to the church who obtained a beer licence and originated the 'Bridge Inn'. In 1837, Jonathan Thomas Sleap purchased the property, rebuilding the inn using stone obtained from the old watermill.  Just to the east you can pick up the Coledale Horseshoe. The popular circular walk starts from the village of Braithwaite, exploring the wonderful hanging valley and visiting several of the area's significant peaks on the way. The route also passes close to Force Crag Mine. The Scheduled ancient monument dates back to the 1800s and is now run by the National Trust. It's an interesting place to visit with information boards detailing the mine's history and some pleasant walks along the Coledale Beck."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ea3VpF1alBk",
  "postcode": "CA13 9UZ",
  "district": "Buttermere",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Buttermere, Cumberland, England, CA13 9UZ, United Kingdom",
  "state": "England"
}