{
  "objectID": "22ad636b94fa1f1ba97b9317a8eee3e8",
  "created_at": "2024-12-18T11:27:48.967948+00:00",
  "ref": "kit-hill-walking-route",
  "title": "Kit Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/92/Kit_Hill_Quarry_Face_-_geograph.org.uk_-_1265736.jpg",
  "nearby": [
    {
      "description": "Cotehele House",
      "objectID": "e5ead3a1d512ad5500de1318457a7d42",
      "ref": "cotehele-house-walking-route"
    },
    {
      "description": "Tamar Valley Discovery Trail",
      "objectID": "ee55b9ee756d935ffaa037bca736c52b",
      "ref": "tamar-valley-discovery-trail-walking-route"
    },
    {
      "description": "Gunnislake",
      "objectID": "3420cefbb0245d60dc532178bbd48bc7",
      "ref": "gunnislake-walking-route"
    },
    {
      "description": "Callington",
      "objectID": "2fe0bafbbbdeb8e6bf5ccd67d16f8c6c",
      "ref": "callington-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/01BFD2F54A79A8C58025807C007F8DE8/$FILE/Kit Hill.gpx",
  "_geoloc": {
    "lat": 50.5203387721,
    "lng": -4.2871825942
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Kit_Hill_Quarry_Face_-_geograph.org.uk_-_1265736.jpg",
      "title": "Tony Atkin / Kit Hill Quarry Face",
      "caption": "Kit Hill Quarry Face. The disused granite quarry on Kit Hill was excavated to form something of an amphitheatre with a narrow entrance. A lake has formed below the quarry face which as the sign in the foreground warns is deep in places."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Entrance_to_Kit_Hill_-_geograph.org.uk_-_1265660.jpg",
      "title": "Tony Atkin / Entrance to Kit Hill",
      "caption": "Entrance to Kit Hill. Most people get onto the hill via the road on the eastern side which takes you up to the top. This is the far less used and more interesting northern entrance to the hill. Here the only way to the top is to walk or ride a horse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Kit_Hill_Quarry_-_geograph.org.uk_-_1265749.jpg",
      "title": "Tony Atkin / Kit Hill Quarry",
      "caption": "This disused granite quarry near the summit of the hill was worked from the early 19th century until 1955. The structures in which Kit Hill granite was used include six bridges over the Thames in London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/South_Kit_Hill_Mine_with_the_stack_of_Kit_Hill_Mine_in_the_background_-_geograph.org.uk_-_1058172.jpg",
      "title": "M Hunter / South Kit Hill Mine with the stack of Kit Hill Mine in the background",
      "caption": "South Kit Hill Mine with the stack of the mine in the background. The Chimney on the right of the image is the stack from the steam pumping engine of the former mine. The circular structure in the middle of the image behind the fence is the top of the engine shaft. Water would have been pumped up this shaft by the steam engine. It discharged into a short adit (horizontal shaft) a few metres beneath the surface. The adit opened out into the area of vegetation in the bottom left of the image in front of the fence. The adit is still open but inaccessible due to the dense mass of prickly gorse in front of the portal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Kelly_Bray_and_Holmbush_plantation_from_the_western_slopes_of_Kit_Hill_-_geograph.org.uk_-_1058201.jpg",
      "title": "M Hunter / Kelly Bray and Holmbush plantation from the western slopes of Kit Hill",
      "caption": "Kelly Bray and Holmbush plantation from the western slopes of the hill. The houses in the top right corner are in the village of Kelly Bray. The buildings visible on the edge of Holmbush plantation are the ruined buildings of Holmbush Mine. This image was taken from SX37137154."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/The_Eastern_Slope_of_Kit_Hill_-_geograph.org.uk_-_1265978.jpg",
      "title": "Tony Atkin / The Eastern Slope of Kit Hill",
      "caption": "The Eastern Slope of the hill. Looking down along the access road to the hill. In the distance the land rises up again to Hingston Down on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Car_Park_halfway_up_Kit_Hill_-_geograph.org.uk_-_1265968.jpg",
      "title": "Tony Atkin / Car Park halfway up Kit Hill",
      "caption": "Car Park halfway the hill. You can drive to the top if you want but this car park built on an old mine spoil tip is a good place to set out to explore the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/The_Southern_Slope_of_Kit_Hill_-_geograph.org.uk_-_1265999.jpg",
      "title": "Tony Atkin / The Southern Slope of Kit Hill",
      "caption": "The Southern Slope of the hill. From the top of a derelict flywheel housing which was part of the South Kit Hill mine looking towards Callington."
    }
  ],
  "distance_km": 2.0,
  "description": "This country park in Cornwall covers 400 acres with miles of good footpaths to try.  The park was given to the people of Cornwall in 1985 by Prince Charles to mark the birth of his son Prince William. You can climb to the 334 m (1,096 ft) Kit Hill summit and enjoy wonderful views over the Tamar Valley AONB, Dartmoor and Bodmin Moor. At the top of the hill you'll find an artificial fort and a folly built built in the style of a low-walled Saxon castle. There's also a number of viewing tables which highlight features of the surrounding countryside you can see from the summit. The area is great for wildlife with buzzards, sparrowhawks, deer and various butterflies to look out for. Attractive vegetation includes heathers, gorses, grasses and bilberry. There's also an interesting mining history with the 19th century Summit Stack a well known landmark. The park is located just to the north of Callington and has a car park on the eastern side near Monkscross. To continue your walking in the area you could try the Tamar Valley Discovery Trail and enjoy a waterside walk along the River Tamar. If you head a couple of miles east to Chilsworthy you can pick up the trail there. Also nearby is the splendid Cotehele House. The Tudor house has nice footpaths taking you around the extensive grounds.",
  "video_url": "https://www.youtube.com/embed/oXEhhvOAuh0",
  "postcode": "PL17 8HR",
  "district": "Clitters",
  "county": "Cornwall",
  "region": "South West",
  "country": "England"
}