{
  "created_at": "2025-01-06T01:10:27.862854+00:00",
  "objectID": "22c9725f4cdbee8ed058e0867dc860eb",
  "ref": "penicuik-to-dalkeith-railway-walk-walking-and-cycle-route",
  "title": "Penicuik to Dalkeith Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Eskbridge_geograph-3876059-by-Ben-Brooksbank.jpg/512px-Eskbridge_geograph-3876059-by-Ben-Brooksbank.jpg",
  "nearby": [
    {
      "description": "Roslin Glen Country Park",
      "objectID": "4e2e53b575c2c9843791b9f01a77db90",
      "ref": "roslin-glen-country-park-walking-and-cycle-route"
    },
    {
      "description": "Flotterstone",
      "objectID": "1a476a61e8510b9e52d87d2f69fe37c9",
      "ref": "flotterstone-walking-route"
    },
    {
      "description": "Dalkeith Country Park",
      "objectID": "f32c8e54d30f6810827a18ba2ad4fac8",
      "ref": "dalkeith-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/22c9725f4cdbee8ed058e0867dc860eb.gpx",
  "_geoloc": {
    "lat": 55.824505059,
    "lng": -3.2155711996
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Eskbridge_geograph-3876059-by-Ben-Brooksbank.jpg/512px-Eskbridge_geograph-3876059-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank / Site of former Eskbridge station, 2000",
      "caption": "View northward, towards Bonnyrigg and Edinburgh: ex-NBR (Edinburgh - Millerhill) Hardengreen Junction - Bonnyrigg - Penicuick branch. The station was closed to passengers 22/9/30, but the Penicuick branch had a passenger service until 10/9/51 and was not closed finally until 27/3/67."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Firth_viaduct_near_Auchendinny_-_geograph.org.uk_-_917038.jpg",
      "title": "Morley Sewell / Firth viaduct near Auchendinny",
      "caption": "Firth viaduct near Auchendinny. This 10 arch viaduct carried the Penicuik Branch of the North British Railway until the line closed in 1967. The viaduct is 66 feet high and each arch spans 35 feet. The viaduct now carries the Penicuik-Dalkeith walkway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Tunnel_under_Harpers_Brae%2C_Penicuik_-_geograph.org.uk_-_913330.jpg",
      "title": "Morley Sewell / Tunnel under Harpers Brae, Penicuik",
      "caption": "Tunnel under Harpers Brae, Penicuik. Once used by trains on the Penicuik-Rosewell branch of the North British Railway. Now takes the Penicuik-Dalkeith walkway under the road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Footbridge_across_the_Dean_Burn_-_geograph.org.uk_-_1398777.jpg",
      "title": "Morley Sewell / Footbridge across the Dean Burn",
      "caption": "Footbridge across the Dean Burn This footbridge takes the footpath that runs west from the Penicuik Dalkeith Walkway along the Dean Burn in Lady Wood, Penicuik across the burn to give access to the Ladywood estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/New_housing_on_an_old_industrial_estate_at_Eskmills%2C_Penicuik_-_geograph.org.uk_-_913285.jpg",
      "title": "Morley Sewell / New housing on an old industrial estate at Eskmills, Penicuik",
      "caption": "New housing on an old industrial estate at Eskmills, Penicuik. These flats and houses have been built next to the North Esk river on the site of the old Eskmills paper mill. Seen from the bridge carrying the Penicuik-Dalkeith Walkway over the river along the line of the old Penicuik-Rosewell railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Retaining_wall_by_old_railway_track_-_geograph.org.uk_-_913295.jpg",
      "title": "Morley Sewell / Retaining wall by old railway track",
      "caption": "Retaining wall by old railway track. The wall is against the bank on the opposite side of the track bed of the erstwhile Penicuik-Rosewell railway to the North Esk river. The track now forms part of the Penicuik-Dalkeith Walkway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/New_Housing_at_Valleyfield_-_geograph.org.uk_-_929905.jpg",
      "title": "Morley Sewell / New Housing at Valleyfield",
      "caption": "New Housing at Valleyfield. This new Housing is on the site of Penicuik Railway Station and Valleyfield Paper Mill. The station closed in 1966. The mill operated from 1809-1996, being owned and operated by successive generations of the Cowan family from 1779. The site was cleared in 2004."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Bridge_to_Firth_House_-_geograph.org.uk_-_1199440.jpg",
      "title": "Callum Black / Bridge to Firth House",
      "caption": "Bridge to Firth House. A bridge over the North Esk linking Firth House to Old Woodhouselee. Viewed from the railway path."
    }
  ],
  "distance_km": 12.8,
  "description": "This shared cycling and walking trail runs from Penicuik to Dalkeith along a dismantled railway line. The Penicuik line opened in 1872 and closed in 1967. It's now a pleasant leisure route taking you through some of Midlothian’s historic villages. Along the way there's lovely country views and lots of flora and fauna to look out for. The route starts in Penicuik on the River North Esk. You then follow the waymarked trail north along the eastern side of the town. The trail then turns east to take you past Old Woodhouselee Castle and Roslin Glen Country Park. The pretty park includes wooded glens, the ruined Roslin Castle and views of the rushing River North Esk. After passing through the park you continue north east past Bonnyrigg and Lasswade before coming into Dalkeith where you can explore Dalkeith Country Park .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a nice cafe in Dalkeith Country Park where you can enjoy refreshments after your exercise. Also nearby is The Mercat Grill. They do very good food and also have a superb garden area with tables and chairs for alfresco dining. You can find the bar at 10 Whitecraig Rd, Whitecraig with a postcode of EH21 8PG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The path makes for a nice dog walk, though it's best to keep them on leads because of the cyclists. The Mercat Grill mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route finishes near the lovely Dalkeith Country Park. There's some nice waymarked walking trails here running through ancient oak woodland and along the River Esk. Just to the east of the park you can pick up the Pencaitland Railway Walk. The trail runs along a dismantled railway and is suitable for both walkers and cyclists. Similarly the Haddington to Longniddry Railway Walk runs between the two East Lothian towns for a distance of about 5 miles. Near here you'll also find the Gosford Estate where there's some nice trails to follow around the grounds of grand mansion. Just to the north of the start point you can try the Flotterstone to Glencorse Reservoir Walk and the climb to the viewpoint at Scald Law. At Roslin you could take a detour to visit the noteworthy Rosslyn Chapel. There's some stunning architecture at the 15th century site which includes some pleasant trails through a wooded glen to the ruins of Roslin Castle. The chapel became famous when it was featured in Dan Brown's the Da Vinci Code. For more walks in the area see the Edinburgh Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iWJk2metrmk",
  "postcode": "EH26 8NT",
  "district": "Penicuik",
  "county": "Midlothian",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lower Valleyfield View, Kirkhill, Penicuik, Midlothian, Alba / Scotland, EH26 8NT, United Kingdom",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "country views",
    "park"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}