{
  "objectID": "22cf1e596441d550178300cb742ac194",
  "created_at": "2024-12-19T10:57:08.580837+00:00",
  "ref": "portwrinkle-and-whitsand-bay-walking-route",
  "title": "Portwrinkle and Whitsand Bay Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Portwrinkle_Harbour_-_geograph.org.uk_-_203663.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Rame Head",
      "objectID": "222c5699a50675f16f4676445b2bb719",
      "ref": "rame-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/22cf1e596441d550178300cb742ac194.gpx",
  "_geoloc": {
    "lat": 50.3619026458,
    "lng": -4.3143561352
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Portwrinkle_Harbour_-_geograph.org.uk_-_203663.jpg",
      "title": "Tony Atkin / Portwrinkle Harbour",
      "caption": "Portwrinkle Harbour. The Banjo Pier built when this village was founded as a pilchard fishery is still in place. This photograph was taken from the coast path just to the west of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Portwrinkle_seafront_-_geograph.org.uk_-_1978687.jpg",
      "title": "Portwrinkle seafront by Maurice D Budden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Portwrinkle seafront"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Tregantle_Fort_-_geograph.org.uk_-_74967.jpg",
      "title": "Tony Atkin / Tregantle Fort",
      "caption": "Tregantle Fort, Cornwall. This 19th century fortification was completed in 1865 and overlooks Whitsand Bay. The intention of the fort was to hold guns which could fire on ships at sea. Whilst its guns were upgraded in the late 19th century they did not keep pace with the advances in naval guns at the time. This photograph shows the southwestern aspect of the fort. The fort and its surrounds now contain rife ranges for military practice."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Freathy_-_geograph.org.uk_-_2367470.jpg/512px-Freathy_-_geograph.org.uk_-_2367470.jpg",
      "title": "Freathy by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Freathy. Freathy, known as Frydhi in Cornish, is a charming coastal settlement located on the Rame Peninsula in eastern Cornwall, England, within the United Kingdom. To reach Freathy, you can follow the picturesque coast road, which also accommodates the South West Coast Path. Most of the residential buildings in this delightful village are situated to the north of the road, atop the plateau overlooking Freathy Cliffs. Additionally, you'll find a scattering of chalets on the cliffside, providing captivating views of the beach below. In the summertime, Freathy's beach becomes a magnet for tourists who come to bask in its beauty and enjoy the coastal ambiance. This idyllic spot offers a serene escape for those seeking a seaside retreat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Above_the_Cliff_-_geograph.org.uk_-_205704.jpg",
      "title": "Tony Atkin / Above the Cliff",
      "caption": "Above the Cliff. This shows the only land in this square which you can get to without being tied to a rope. The rest is cliff face. The island off the point on the right of the photo is The Long Stone below Cargloth Cliff and is in the next grid square to the west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Whitsand_Bay_-_geograph.org.uk_-_2635044.jpg",
      "title": "Whitsand Bay by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "West of Captain Blake's Point, long stretches of sand are interspersed with rocky headlands and small bays, many inaccessible at high tide"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Polhawn_Cove_-_geograph.org.uk_-_2370195.jpg/512px-Polhawn_Cove_-_geograph.org.uk_-_2370195.jpg",
      "title": "Polhawn Cove by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Polhawn Cove. Polhawn Cove is a rough beach, consisting of sharp rocks, shingle and an area of open sand."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Rame_Head_-_geograph.org.uk_-_36840.jpg",
      "title": "Tony Atkin / Rame Head",
      "caption": "Rame Head. This conical shaped headland has a distinctive triangular outline from whichever direction and is an easily recognisable guide point for seafarers. The building on top is a chapel which has been there since the 14th century."
    }
  ],
  "distance_km": 10.7,
  "description": "This walk takes you along a lovely section of the South West Coast Path from  Portwrinkle to Rame Head on the Cornish coast. The route runs along the picturesque Whitsand Bay with splendid coastal views throughout. It's a photogenic area with imposing cliffs and long stretches of sandy beaches to enjoy. There's also a number of historic coastal fortifications to investigate as well. You start the walk from the little village of Portwrinkle at the western end of the bay. The trail then heads east past the golf course to the Tregantle Fort. You continue past Freathy Cliff to the Whitsand Bay Battery and Wiggle Cliff before coming to Rame Head at the bay's eastern end. This area has some wonderful views over Cawsand Bay and the mediaevel Rame Chapel to explore.",
  "video_url": "https://www.youtube.com/embed/2LZx2uK3FUk?si=yvFjnw4o5mAKHSAn",
  "district": "Portwrinkle",
  "county": "Cornwall",
  "region": "South West",
  "country": "England"
}