{
    "objectID": "2309dc6c55c841af6a28d98983fc658d",
    "created_at": "2024-12-21T17:12:09.922439+00:00",
    "ref": "glenarm-walking-route",
    "title": "Glenarm Coast, Castle and Forest Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c8/River%2C_Glenarm_forest_-_geograph.org.uk_-_946430.jpg",
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/FEB09BD140E5374D86258B02003A2E51/$FILE/Glenarm.gpx",
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/River%2C_Glenarm_forest_-_geograph.org.uk_-_946430.jpg",
            "title": "Albert Bridge / River, Glenarm forest",
            "caption": "River, Glenarm forest. Glenarm Forest Park is an 800-acre (3.2 km2) nature preserve once part of the demesne of Glenarm Castle, but now in public and maintained by the Ulster Wildlife Trust."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Glenarm_Castle.jpg",
            "title": "GlenarmCastle, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
            "caption": "Glenarm Castle. A castle has stood at Glenarm since the 13th century, anchoring one of Northern Ireland's oldest estates. Initially owned by John Bisset, who acquired lands between Larne and Ballycastle from Hugh de Lacy, the Earl of Ulster, Glenarm became Bisset's capital. By 1260, the castle was already established at the heart of the present village, surrounded by a kitchen garden, orchard, mill, woods, and meadows. The remnants of the old village courthouse still contain parts of its walls, where an immured skeleton was discovered in the 1970s. In 1495, Con O'Donnell of Tirconnell launched an attack on 'MacEoin of the Glens' (the Bisset chieftain) upon hearing of his reputedly fine wife, steed, and hound. Despite being refused the steed by MacEoin, O'Donnell arrived at his house unannounced, captured MacEoin, and claimed his wife, steed, and hound. The last MacEoin Bisset was killed in battle against the O'Donnells in 1522. Subsequently, their lands were seized by the MacDonnells, their former allies, who occupied the Bisset's castle until constructing a new one."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Glenarm_Estates_Gardens_%282%29_-_geograph.org.uk_-_1896301.jpg",
            "title": "Glenarm Estates Gardens (2) by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Glenarm Estates Gardens. The current castle was erected by Sir Randal MacDonnell, 1st Earl of Antrim, in 1636, and has remained under family ownership since its inception. Presently, it belongs to Randal McDonnell, the 10th Earl of Antrim. The McDonnells have been established in Glenarm for nearly six centuries, with the estate remaining within the family for four hundred years. During the months of May to September, the Castle's Walled Garden opens its doors to the public and serves as a venue for numerous events. Annually in July, the grounds host a prestigious Highland Games. Glenarm Castle also accommodates the Dalriada Festival, a celebration of sport, music, and cuisine from Scotland and Ireland, held both on the castle grounds and in the surrounding village. Additionally, the castle serves as a venue for traditional Ulster Scots cultural events. As part of the Dalriada Festival, Glenarm Castle has expanded to host large-scale outdoor concerts. Since 2012, it has featured performances by artists such as General Fiasco, The Priests, Duke Special, Ronan Keating, Sharon Corr, Brian Houston, and David Phelps. Summer Madness, Ireland's largest Christian festival, relocated from its annual venue at the Kings Hall in Belfast to Glenarm Castle in 2012. It is anticipated that this festival will continue to take place at Glenarm on an annual basis in the foreseeable future."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Waterfall%2C_Glenarm_forest_-_geograph.org.uk_-_946300.jpg",
            "title": "Albert Bridge / Waterfall, Glenarm forest",
            "caption": "Waterfall, Glenarm forest"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Mouth_of_the_Glenarm_River_-_geograph.org.uk_-_925638.jpg",
            "title": "Sue Adair / Mouth of the Glenarm River",
            "caption": "Mouth of the Glenarm River"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Glenarm_Bay_-_geograph.org.uk_-_954783.jpg",
            "title": "Kenneth  Allen / Glenarm Bay",
            "caption": "Glenarm Bay"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/View_of_Glenarm_Gardens_-_geograph.org.uk_-_1896317.jpg",
            "title": "View of Glenarm Gardens by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "View of Glenarm Gardens. The estate's Woodland Walk offers an excellent opportunity to take a leisurely stroll around the grounds. Begin your walk at the entrance located at the top of the Walled Garden and immerse yourself in this tranquil sanctuary, home to red squirrels, robins, rabbits, and a variety of other birds and wildlife. From here, you can enjoy a panoramic view of the Walled Garden and the estate park, where you may catch sight of the prize-winning herd of Shorthorn cows grazing peacefully. During spring, the woodland comes to life with the vibrant blooms of specimen camellias and rhododendrons, accompanied by carpets of delicate white wild garlic flowers. In autumn, marvel at the stunning display of colours as our collection of acer maple trees showcases their rich hues of autumn foliage."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Fountain%2C_Glenarm_Gardens_-_geograph.org.uk_-_1896323.jpg",
            "title": "Fountain, Glenarm Gardens by Kenneth  Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Fountain, Glenarm Gardens"
        }
    ],
    "distance_km": 6.1,
    "description": "This walk explores the picturesque village of Glenarm in County Antrim. The village is a splendid place for a walk with a delightful coastline, the historic Glenarm Castle and the peaceful woodland trails in Glenarm Forest. This walk starts from the castle where you can enjoy a walk around the castle grounds and walled garden. There is also a woodland walk where you can look out for wildlife including red squirrels. Head north from here and you can pick up trails along the beautiful Glenarm Bay to the marina. The route then heads south through the village to the forest where you can enjoy waterfalls and views of the river. To continue your walking in the area head south along the coast to the popular Carnfunnock Country Park near Larne. Please scroll down for the full list of walks near and around Glenarm. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
    "video_url": "https://www.youtube.com/embed/tScFhTqcy_Y?si=wcrbgEr3GLeJG1fO"
}
