{
  "created_at": "2025-01-06T04:10:45.539921+00:00",
  "objectID": "235c8e6b53002df9593313125e922fa4",
  "ref": "windy-gyle-walking-route",
  "title": "Windy Gyle Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Reaching_the_Top_of_Windy_Gyle_-_geograph.org.uk_-_18468.jpg",
  "nearby": [
    {
      "description": "The Cheviot",
      "objectID": "f0d3d6a51a5dd4a9f5f949e86f80d4cc",
      "ref": "the-cheviot-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Hedgehope Hill",
      "objectID": "d2a3fc0fa3f45cfa69eef72136be154f",
      "ref": "hedgehope-hill-walking-route"
    },
    {
      "description": "Kidland Forest",
      "objectID": "2af0fe2d9b2df40a2a9b08ce43aca243",
      "ref": "kidland-forest-cycle-route"
    },
    {
      "description": "Harbottle",
      "objectID": "78044d2725cc73985214462786f169ea",
      "ref": "harbottle-walking-route"
    },
    {
      "description": "Davidson's Linn",
      "objectID": "24a8549ac348223a4a83a4f1de764e94",
      "ref": "davidsons-linn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/235c8e6b53002df9593313125e922fa4.gpx",
  "_geoloc": {
    "lat": 55.3868635048,
    "lng": -2.2121519387
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Reaching_the_Top_of_Windy_Gyle_-_geograph.org.uk_-_18468.jpg",
      "title": "Christine Westerback / Reaching the Top of Windy Gyle",
      "caption": "Reaching the Top of Windy Gyle. A steep climb then fantastic views"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Pennine_Way_on_Windy_Gyle_-_geograph.org.uk_-_539004.jpg",
      "title": "Eileen Henderson / Pennine Way on Windy Gyle",
      "caption": "Pennine Way on Windy Gyle. View along the long-distance footpath from the west slope of Windy Gyle. The border fence is on the left of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Bridleway%2C_Windy_Gyle_-_geograph.org.uk_-_48610.jpg",
      "title": "Dave Dunford / Bridleway, Windy Gyle",
      "caption": "Bridleway on the Gyle. Looking ESE towards Scotchman's Ford from below Russell's Cairn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Summit_of_Windy_Gyle_-_geograph.org.uk_-_670034.jpg",
      "title": "Kenneth  Ross / Summit of Windy Gyle",
      "caption": "Summit of Windy Gyle. Looking east to the Cheviot"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Windy_Gyle_Summit_-_geograph.org.uk_-_282594.jpg",
      "title": "Chris Heaton / Windy Gyle Summit",
      "caption": "Summit view at 2034 ft. Passed by the Pennine Way to the right. The England/Scotland border also cuts across this lofty place"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Mozie_Law_path_junction_-_geograph.org.uk_-_1131.jpg/256px-Mozie_Law_path_junction_-_geograph.org.uk_-_1131.jpg",
      "title": "Andy Stephenson / Mozie Law path junction",
      "caption": "Mozie Law path junction. Between Windy Gyle and Mozie Law in the Cheviot Hills. An important junction: the path from Barrowburn joins the Pennine Way here. Altitude: 1670 feet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Windy_Gyle_summit_cairn_-_geograph.org.uk_-_640015.jpg",
      "title": "Neil Turnbull / Windy Gyle summit cairn",
      "caption": "Summit cairn Looking roughly south east on a fine August day. The signpost indicates the direction of the Pennine Way. On my OS map the cairn seems to be named Russell's Cairn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Beef_Stand_looking_to_Black_Braes_and_Windy_Gyle_-_geograph.org.uk_-_614531.jpg",
      "title": "Kenneth  Ross / Beef Stand looking to Black Braes and Windy Gyle",
      "caption": "Beef Stand looking to Black Braes and the Gyle. An area of isolated rough grazing south of Beef Stand Hill. The name suggests cattle were kept here in days gone by. A remote area of a similar nature in the Moffat Hills is also called Beef Stand and was used as hiding place for stolen cattle in the historical days of the Reivers (Cattle Raiders) on the English-Scottish Border."
    }
  ],
  "distance_km": 16.0,
  "description": "Climb to the summit of this hill in the Cheviots and enjoy fabulous views into Scotland and England as you stand high on the border. This challenging circular route runs for a distance of about 10 miles using the bridleways and footpaths that cross the area. The walk begins from the Wedder Leap car park and heads towards Shorthope hill, crossing the River Coquet and following the Rowhope Burn as you go. You continue the climb to Little Ward Law before coming to Russel's Cairn at the 619 m (2,031 ft) summit of Windy Gyle. From here there are wonderful views over the Scottish Borders, the Eildon Hills and Edinburgh. You begin the descent by heading west along the Pennine Way and then south towards Swineside Law and Hindside Knowe. Shortly after you cross the River Coquet and return to the car park. This is a challenging walk but the footpaths are generally good and you're rewarded with some stunning scenery. To continue your walking in the Cheviots you could climb the highest hill - The Cheviot .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you head south east you'll come to the village of Harbottle where there's the noteworthy Star Inn. The pub was built as a coaching inn over 200 years ago, and similar to many other properties in the village, was built using sandstone from the ruins of nearby Harbottle Castle. It's steeped in history and would have once been used by drovers crossing the Anglo-Scottish border just a few miles away in The Cheviot Hills. There's courtyard seating and a small shop at the rear selling a good range of essential items, newspapers, magazines, greeting cards, fresh and frozen food, crisps, snacks and sweets. The shop is also an official Information Point for the Northumberland National Park with leaflets, maps and books of the area. You can find it at a postcode of NE65 7DG. From here you can also enjoy a climb to Harbottle Crags for some more fine views."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills are a great place for dog walking and the Star Inn mentioned above is also dog friendly. The expansive Kidland Forest is also located just to the east of the car park. There's miles of woodland trails here, ideal for you and your pet. The Barrowburn Farm hotel is located close to the start of the walk. They provide good accommodation if you need to stay over. For more walking ideas in the area see the Cheviots Walks and Northumberland Walks pages."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The walk to Davidson's Linn starts from the same car park. It takes you past a series of hills to a lovely remote waterfall on the Usway Burn."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2C9_xtkaNBo",
  "postcode": "NE65 7BP",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Alwinton, Northumberland, North East, England, NE65 7BP, United Kingdom",
  "district": null,
  "state": "England"
}