{
    "objectID": "23696ec56f21a08fe7bce7aa52b9dfb4",
    "created_at": "2024-12-21T09:54:23.188475+00:00",
    "ref": "drumtochty-forest-walking-route",
    "title": "Drumtochty Forest Walks ",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Southwest_tower_of_Drumtochty_Castle_-_geograph.org.uk_-_894777.jpg",
    "nearby": [
        {
            "description": "Durris Forest",
            "objectID": "75ab9ecec7d38d604f5d5f4f7249503f",
            "ref": "durris-forest-walking-route"
        },
        {
            "description": "Fetteresso Forest",
            "objectID": "ca09c36ffb4c04bedaa01ce6a62355b3",
            "ref": "fetteresso-forest-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/2154EC5DA41D426686258AED00699B77/$FILE/Drumtochty Forest.gpx",
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Southwest_tower_of_Drumtochty_Castle_-_geograph.org.uk_-_894777.jpg",
            "title": "C Michael Hogan / Southwest tower of Drumtochty Castle",
            "caption": "Southwest tower of Drumtochty Castle. The castle is a neo-gothic style fortified mansion constructed in 1812, situated approximately three kilometres northwest of Auchenblae, Kincardineshire, Scotland. This edifice is located on the southern edge of the forest. It was designed by James Gillespie Graham, with additional extensions added around 1815. Although Gillespie Graham was initially commissioned for the extension designs, the actual construction was carried out by John Smith, the Aberdeen City Architect. There is speculation that Gillespie Graham may have had a disagreement with George Drummond, the owner, but it is considered more likely that Smith's closer proximity to the site led to his involvement. Gillespie Graham was later involved in further additions around 1839. During the Second World War, Drumtochty Castle was purchased by the Norwegian government-in-exile and served as a boarding school for Norwegian children who sought refuge from the German occupation of Norway. On 1 May 1947, Robert and Elizabeth Langlands opened a boys' preparatory school at the Castle after acquiring it from the Norwegian government. The school ceased operations in 1971. Drumtochty Castle was designated as a category A listed building by Historic Scotland in August 1972."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Picnic_area_-_geograph.org.uk_-_1391826.jpg",
            "title": "Stanley Howe / Picnic area",
            "caption": "Picnic area"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/View_from_Drumtochty_Forest_car_park_-_geograph.org.uk_-_1391829.jpg",
            "title": "Stanley Howe / View from Drumtochty Forest car park",
            "caption": "View from Drumtochty Forest car park.  Historically, this forest was closely linked to Drumtochty Castle. Other notable landmarks in this area of the Mearns include Fasque House, Fetteresso Castle, and Muchalls Castle. Ian Maclaren references Drumtochty Forest in his bestselling book of stories \"Beside the Bonnie Brier Bush,\" a collection of tales depicting rural life in Scotland, offering insights into the Scottish way of life. Covering a distance of 1.5 miles, traversing Drumtochty forest typically takes around one hour. It is advisable for hikers to carry a map to navigate through the forest, as there are no way markings present."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Turning_circle_at_the_end_of_the_Goyle_Hill_track_-_geograph.org.uk_-_1453607.jpg",
            "title": "ian shiell / Turning circle at the end of the Goyle Hill track",
            "caption": "Turning circle at the end of the Goyle Hill track"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Goyle_Hill_forest_track_leaves_open_ground_and_enters_the_forest_proper_-_geograph.org.uk_-_1453587.jpg",
            "title": "ian shiell / Goyle Hill forest track leaves open ground and enters the forest proper",
            "caption": "Goyle Hill forest track leaves open ground and enters the forest proper"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Boggy_pool_on_moorland_west_of_Goyle_Hill_-_geograph.org.uk_-_1453677.jpg",
            "title": "ian shiell / Boggy pool on moorland west of Goyle Hill",
            "caption": "Boggy pool on moorland west of Goyle Hill"
        }
    ],
    "distance_km": 7.4,
    "description": "This walk explores Drumtochty Castle and forest near Stonehaven in Kincardineshire. You can start off at the car park near the castle and then follow the trails into the peaceful woodland. The route then climbs up to Goyle Hill where there's lots of pretty heather and some fine views over the surrounding hills and countryside. The forest includes some good mountain bike tracks as well. See the video towards the bottom of the page for an idea of the MTB trails you can try at the site. You can see the trails on openstreetmap below marked in blue. To the east there's also Maryculter Woods where you can enjoy some lovely views of the Crynoch Burn. To the north is Durris Forest and the climb to the viewpoint at Cairn-mon-earn. Fetteresso Forest also lies to the north east.",
    "video_url": "https://www.youtube.com/embed/JD5xgqfECiM?si=848F7Pkm3UoqY52b"
}
