{
  "objectID": "23861d638b53f649b1111e45fbc5f183",
  "created_at": "2024-12-19T23:12:54.389153+00:00",
  "ref": "dedham-vale-walking-route",
  "title": "Dedham Vale Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_River_Stour_at_Dedham_-_geograph.org.uk_-_46649.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/17F8A421353BD990802580EF007BA470/$FILE/Dedham Vale.gpx",
  "_geoloc": {
    "lat": 51.956727024,
    "lng": 0.9942396064
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_River_Stour_at_Dedham_-_geograph.org.uk_-_46649.jpg",
      "title": "Ron Strutt / The River Stour at Dedham",
      "caption": "The River Stour at Dedham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Flatford_Mill_-_geograph.org.uk_-_574302.jpg",
      "title": "terry joyce / Flatford Mill",
      "caption": "Flatford Mill is a Grade I listed 18th Century Watermill built in 1733 in Flatford, East Bergholt, Suffolk. It is noted as the location for works by John Constable, whose father owned the mill. Constable made the mill and its immediate surroundings the subject of a many of his most famous paintings; it is the title of one of his most iconic paintings Flatford Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/River_Stour%2C_Flatford_Mill_-_geograph.org.uk_-_158156.jpg",
      "title": "Stephen McKay / River Stour, Flatford Mill",
      "caption": "This shows Flatford Mill from the right bank (south side) of the river at this popular National Trust spot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Hay_Wain_-_panoramio.jpg/256px-Hay_Wain_-_panoramio.jpg",
      "title": "PJMarriott / CC BY (https://creativecommons.org/licenses/by/3.0)",
      "caption": "Willy Lott's Cottage. The 16th century cottage appeared in several of Constable's paintings, most famously the Hay Wain. It is Grade I listed to reflect its importance \"as part of the Flatford Mill group\" and \"its significance in the work of the artist John Constable\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/High_Street%2C_Dedham_-_geograph.org.uk_-_305730.jpg",
      "title": "Jurek and Trish  Sienkiewicz / High Street, Dedham",
      "caption": "High Street, Dedham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Dedham_church_across_the_park_-_geograph.org.uk_-_1503446.jpg",
      "title": "Paul Shreeve / Dedham church across the park",
      "caption": "Dedham church across the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/The_Stour_looking_east_from_the_river_path_-_geograph.org.uk_-_336496.jpg",
      "title": "Liz McCabe / The Stour looking east from the river path",
      "caption": "The Stour looking east from the river path. A very typical winter view along the upper tidal reaches of the river Stour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Dedham_across_flooded_marshes_-_geograph.org.uk_-_1159347.jpg/256px-Dedham_across_flooded_marshes_-_geograph.org.uk_-_1159347.jpg",
      "title": "Zorba the Geek / Dedham across flooded marshes",
      "caption": "Dedham across flooded marshes. The rainfall in early February 2009 after a wet winter brought water levels in the lower Stour Valley up to a point not seen for nearly a decade."
    }
  ],
  "distance_km": 11.5,
  "description": "Explore John Constable country and visit the site of his famous Hay Wain painting on this circular walk in the Dedham Vale AONB. The route makes use of the Stour Valley Path , the St Edmund Way and the Essex Way to create a round walk starting and finishing from the village of Dedham. You'll enjoy riverside paths, countryside views and gentle ascents as you make your way through this picturesque area. The walk starts in the Essex village of Dedham which has strong links with John Constable and his family. Constable attended the Grammar School and would walk to school each morning along the Stour from his family's home in East Bergholt . From the village you head north to Dedham Bridge and Dedham Mill which was owned by Constable's father. Here you can pick up the riverside path to Flatford Mill and Willy Lott's Cottage, scene of The Hay Wain. The Grade I listed cottage dates from the 16th century and is now owned by the National Trust. Right next to it you will find Flatford Mill which is also Grade I listed. The watermill dates from the 18th century and includes a 17th-century miller's cottage. You can enjoy refreshments at the National Trust's lovely riverside cafe. After leaving the delightful riverside scene, the route then heads away from the river towards the town of Manningtree . You then head past Lawford where you can visit the Grade I listed St Mary's Church. Fabric in the nave of the church dates from around 1200. From Lawford you follow the Essex Way west towards Dedham Heath, passing attractive countryside and woodland on the way. Around Dedham Heath you turn north and return to Dedham village and the finish point. To extend your walking in the area you could visit the nearby Alton Water where there are nice cycling and walking trails around the large reservoir.",
  "video_url": "https://www.youtube.com/embed/2Vf6bwtMoew",
  "district": "Dedham",
  "county": "Essex",
  "region": "Eastern",
  "country": "England"
}