{
  "created_at": "2025-01-06T01:37:05.363892+00:00",
  "objectID": "23861d638b53f649b1111e45fbc5f183",
  "ref": "dedham-vale-walking-route",
  "title": "Dedham Vale Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_River_Stour_at_Dedham_-_geograph.org.uk_-_46649.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/23861d638b53f649b1111e45fbc5f183.gpx",
  "_geoloc": {
    "lat": 51.956727024,
    "lng": 0.9942396064
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_River_Stour_at_Dedham_-_geograph.org.uk_-_46649.jpg",
      "title": "Ron Strutt / The River Stour at Dedham",
      "caption": "The River Stour at Dedham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Flatford_Mill_-_geograph.org.uk_-_574302.jpg",
      "title": "terry joyce / Flatford Mill",
      "caption": "Flatford Mill is a Grade I listed 18th Century Watermill built in 1733 in Flatford, East Bergholt, Suffolk. It is noted as the location for works by John Constable, whose father owned the mill. Constable made the mill and its immediate surroundings the subject of a many of his most famous paintings; it is the title of one of his most iconic paintings Flatford Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/River_Stour%2C_Flatford_Mill_-_geograph.org.uk_-_158156.jpg",
      "title": "Stephen McKay / River Stour, Flatford Mill",
      "caption": "This shows Flatford Mill from the right bank (south side) of the river at this popular National Trust spot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Hay_Wain_-_panoramio.jpg/256px-Hay_Wain_-_panoramio.jpg",
      "title": "PJMarriott / CC BY (https://creativecommons.org/licenses/by/3.0)",
      "caption": "Willy Lott's Cottage. The 16th century cottage appeared in several of Constable's paintings, most famously the Hay Wain. It is Grade I listed to reflect its importance \"as part of the Flatford Mill group\" and \"its significance in the work of the artist John Constable\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/High_Street%2C_Dedham_-_geograph.org.uk_-_305730.jpg",
      "title": "Jurek and Trish Sienkiewicz / High Street, Dedham",
      "caption": "High Street, Dedham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Dedham_church_across_the_park_-_geograph.org.uk_-_1503446.jpg",
      "title": "Paul Shreeve / Dedham church across the park",
      "caption": "Dedham church across the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/The_Stour_looking_east_from_the_river_path_-_geograph.org.uk_-_336496.jpg",
      "title": "Liz McCabe / The Stour looking east from the river path",
      "caption": "The Stour looking east from the river path. A very typical winter view along the upper tidal reaches of the river Stour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Dedham_across_flooded_marshes_-_geograph.org.uk_-_1159347.jpg/256px-Dedham_across_flooded_marshes_-_geograph.org.uk_-_1159347.jpg",
      "title": "Zorba the Geek / Dedham across flooded marshes",
      "caption": "Dedham across flooded marshes. The rainfall in early February 2009 after a wet winter brought water levels in the lower Stour Valley up to a point not seen for nearly a decade."
    }
  ],
  "distance_km": 11.5,
  "description": "Explore John Constable country and visit the site of his famous Hay Wain painting on this circular walk in the Dedham Vale AONB. The route makes use of the Stour Valley Path, the St Edmund Way and the Essex Way to create a round walk starting and finishing from the village of Dedham. You'll enjoy riverside paths, countryside views and gentle ascents as you make your way through this picturesque area. The walk starts in the Essex village of Dedham which has strong links with John Constable and his family. Constable attended the Grammar School and would walk to school each morning along the Stour from his family's home in East Bergholt. From the village you head north to Dedham Bridge and Dedham Mill which was owned by Constable's father. Here you can pick up the riverside path to Flatford Mill and Willy Lott's Cottage, scene of The Hay Wain. The Grade I listed cottage dates from the 16th century and is now owned by the National Trust. Right next to it you will find Flatford Mill which is also Grade I listed. The watermill dates from the 18th century and includes a 17th-century miller's cottage. You can enjoy refreshments at the National Trust's lovely riverside cafe. After leaving the delightful riverside scene, the route then heads away from the river towards the town of Manningtree. You then head past Lawford where you can visit the Grade I listed St Mary's Church. Fabric in the nave of the church dates from around 1200. From Lawford you follow the Essex Way west towards Dedham Heath, passing attractive countryside and woodland on the way. Around Dedham Heath you turn north and return to Dedham village and the finish point. To extend your walking in the area you could visit the nearby Alton Water where there are nice cycling and walking trails around the large reservoir.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a delightful National Trust Tea Room at Flatford Mill where you can stop off for some refreshments on the walk. You can sit on a balcony overlooking the river if the weather is good. It's a lovely spot to relax in and take the weight of your feet. You can find the tea rooms at a postcode of CO7 6UL for your sat navs. For a pub lunch you could head to The Sun Inn on the High Street in Dedham. The ancient inn has some history stretching back hundreds of years to its time as a coaching inn. There's a charming interior with an elm bar, an open, thick beamed dining room and a snug, oak panelled lounge with bespoke furniture and fabrics. Outside there's a pleasant terrace and a boules pitch in the garden. You can find them at postcode CO7 6DH."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and country paths make for an excellent dog walk. Around the Flatford Mill area you are requested to keep them on leads though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north west from the Dedham on the Stour Valley Path and you can visit the villages of Stratford St Mary and Stoke By Nayland. Here you'll find another picturesque village with many cottages and fine old timber-framed houses. There's also a noteworthy village church which dates from the 15th century and features several times in Constable's paintings. Polstead with its village green and 17th century inn is also located in this area. The East Bergholt circular walk starts from the noteworthy village. The village is notable as the birthplace of the famous painter John Constable in 1776. It contains Bridge Cottage a 16th-century dwelling used as a location by Constable. There's also a 15th century church and a noteworthy 14th century pub to investigate. To enjoy the AONB by bike please see the Dedham Vale Cycle Route. The circular route uses quiet country lanes to visit many of the historic settlements of the area. For more walking ideas in the area see the Essex Walks and Suffolk Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2Vf6bwtMoew",
  "district": "Colchester",
  "county": "Essex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Drift, Dedham, Colchester, Essex, England, CO7 6AW, United Kingdom",
  "postcode": "CO7 6AW",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "countryside",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "cultural sites",
    "villages"
  ],
  "facilities": [
    "cafe",
    "church",
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}