{
  "created_at": "2025-01-06T04:33:40.649324+00:00",
  "objectID": "23ec92ee4698b0dd917d6b4b50ec3444",
  "ref": "royal-military-canal-path-walking-route",
  "title": "Royal Military Canal Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d3/The_Royal_Military_Canal_-_geograph.org.uk_-_451832.jpg",
  "nearby": [
    {
      "description": "Rye Harbour",
      "objectID": "b791f95ebba33eb4db2d5b875528dd2b",
      "ref": "rye-harbour-walking-route"
    },
    {
      "description": "Hythe",
      "objectID": "a1c7b48264ed82e3b4edf1d4ed4ef806",
      "ref": "hythe-walking-route"
    },
    {
      "description": "Camber Castle",
      "objectID": "1f9068eb30704ad4f733954d3be9df32",
      "ref": "camber-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/23ec92ee4698b0dd917d6b4b50ec3444.gpx",
  "_geoloc": {
    "lat": 50.8888794472,
    "lng": 0.6821894057
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/The_Royal_Military_Canal_-_geograph.org.uk_-_451832.jpg",
      "title": "Carol Rose / The Royal Military Canal, via Wikimedia Commons",
      "caption": "Grassy towpath and canalside houses at Seabrook. The canal is a Scheduled Ancient Monument and part of Kent's Historic Landscape."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Royal_Military_Canal_-_geograph.org.uk_-_719013.jpg",
      "title": "Sebastian Ballard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Canal st Seabrook. The bend in the canal can be clearly seen in this photo. This was a deliberate design to allow soldiers to fire down the length of the canal should any invaders approach by boat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Footbridge_over_the_Royal_Military_Canal_-_geograph.org.uk_-_408583.jpg",
      "title": "Thomas Grant / Footbridge over the Royal Military Canal, via Wikimedia Commons",
      "caption": "Footbridge over the Royal Military Canal. It links Burmarsh Road on the south bank with Royal Military Road on the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Steps_down_to_the_Royal_Military_Canal_-_geograph.org.uk_-_451816.jpg",
      "title": "Carol Rose / Steps down to the Royal Military Canal, via Wikimedia Commons",
      "caption": "Steps down to the Royal Military Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Lemanis_Roman_Fort%2C_Lympne%2C_Kent_-_geograph.org.uk_-_41700.jpg",
      "title": "Ron Strutt / Lemanis Roman Fort, Lympne, Kent",
      "caption": "The remains of Lemanis, the Roman fort, also known as Stutfall Castle near Lympne. The sea once reached right to the foot of the hills here and this was once a major Roman port and one of the Saxon Shore forts. Landslips have destroyed many of the remains."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/West_Hythe%2C_Royal_Military_Canal_-_geograph.org.uk_-_2585469.jpg/512px-West_Hythe%2C_Royal_Military_Canal_-_geograph.org.uk_-_2585469.jpg",
      "title": "West Hythe, Royal Military Canal by Helmut Zozmann, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "West Hythe"
    }
  ],
  "distance_km": 43.0,
  "description": "This walking route runs from Pett Level to Seabrook along the Royal Military Canal. Constructed in the early 19th century as a defence against a possible invasion by Napoleon, the canal-side path now makes for a nice easy walk. The route starts off on the coast at Pett Level and heads inland towards Winchelsea and then onto Rye. The path then heads to Hythe via Appledore before finishing at Seabrook just outside Hythe. Highlights on the route include the lovely Rye Harbour Nature Reserve near Rye. The reserve includes saltmarsh, lagoons, grazing marsh, shingle and reedbeds. You can also visit the ruins of Henry VIII's Camber Castle. The Device Fort was built to protect the Sussex coast against French attack in the 16th century. You'll also pass Lympne where there's the splendid Port Lympne Wild Animal Park, the medieval Lympne Castle and the interesting Portus Lemanis Roman Fort. Winchelsea is also a fine place for a stroll with a series of interesting medieval buildings and a splendid old museum.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's some good choices for refreshments in the Rye Harbour area. The William the Conqueror pub is located right on the harbour and worthy of investigation. Recently refurbished, it’s a smart, friendly, traditional pub, boasting real ales, hearty pub food and a friendly welcome. There’s a large outdoor area here, with plenty of alfresco seating on the banks of the River Rother. It's a great spot to enjoy lunch while looking out for some of the local wildlife that make this a Site of Special Scientific Interest. You can find the pub near the car park on the eastern side of the reserve at postcode TN31 7TU. The delightful Avocet Tea Room is located in the same area as well. The tea room also includes a lovely art gallery showcasing the talent of local artists. The gallery is run by award-winning photographer Peter Greenhalf and former journalist Morgan (who makes all the cakes). The gallery reflects the artists’ love of the natural world and is well worth seeing if you have time after your walk. At Lympne The County Members is in a good spot close to the 13th century castle. They serve good home cooked food and have a nice garden area to sit out in. You can find them at Aldington Road at postcode CT21 4LH for your sat navs. In Winchelsea there's the New Inn to consider. The pub dates back to 1778 and includes a beamed interior and a nice walled garden area outside. They also provide rooms if you would like to stay in the area. You can find them on German Street at a postcode of TN36 4EN for your sat navs. The pub is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the northern edge of Rye harbour there's the Rye Castle Museum or Ypres Tower. The museum has lots of interesting artifacts and exhibits to see including locally-made medieval pottery, an embroidery depicting many aspects of Rye life and history, medieval artifacts, activities and town maps. You can also climb to the top of the tower and enjoy fantastic views over the harbour and the river. It's a nice place to visit after your walk if you have time.  Above: Ypres Tower or Rye Castle. A worthy addition to your outing. At the western end of the canal you can extend your walk in Hastings Country Park. The 600 acre park has miles of trail to explore with lots of interesting wildlife to look out for on the way. The park includes the village of Fairlight where there's some particularly fine cliff top walking in the Fire Hills section of the park. For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "postcode": "TN35 4HF",
  "district": "Rother",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pett Level Road, Pett, Cliff End, Rother, East Sussex, England, TN35 4HF, United Kingdom",
  "state": "England"
}