{
  "created_at": "2025-01-06T02:11:19.298583+00:00",
  "objectID": "247b9cab39c3a1a2667138b7c15d05ef",
  "ref": "clitheroe-walking-route",
  "title": "Clitheroe - Castle and River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Clitheroe_Castle_Museum_editathon_005.jpg/512px-Clitheroe_Castle_Museum_editathon_005.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/247b9cab39c3a1a2667138b7c15d05ef.gpx",
  "_geoloc": {
    "lat": 53.8706442411,
    "lng": -2.3927091772
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Clitheroe_Castle_Museum_editathon_005.jpg/512px-Clitheroe_Castle_Museum_editathon_005.jpg",
      "title": "Photograph by Mike Peel (www.mikepeel.net). [CC BY-SA 4.0  (https://creativecommons.org/licenses/by-sa/4.0 )], from Wikimedia Commons",
      "caption": "War Memorial with Pendle Hill in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Clitheroe_Castle_Museum_-_geograph.org.uk_-_439608.jpg",
      "title": "Alexander P Kapp / Clitheroe Castle Museum",
      "caption": "Clitheroe Castle Museum"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Clitheroe_Castle_bowling_green_8162.JPG/512px-Clitheroe_Castle_bowling_green_8162.JPG",
      "title": "By Photograph by Clem Rutter, Rochester, Kent. (www.clemrutter.net). [CC BY-SA 3.0  (https://creativecommons.org/licenses/by-sa/3.0 )], from Wikimedia Commons",
      "caption": "Castle bowling green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Clitheroe_Castle_with_keep_8154.JPG/512px-Clitheroe_Castle_with_keep_8154.JPG",
      "title": "By Photograph by Clem Rutter, Rochester, Kent. (www.clemrutter.net). [CC BY-SA 3.0  (https://creativecommons.org/licenses/by-sa/3.0 )], from Wikimedia Commons",
      "caption": "Castle with keep"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Weir_and_salmon_leap_on_the_River_Ribble_-_geograph.org.uk_-_827431.jpg",
      "title": "Alexander P Kapp / Weir and salmon leap on the River Ribble",
      "caption": "Weir and salmon leap on the River Ribble"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Footpath_-_geograph.org.uk_-_827389.jpg",
      "title": "Alexander P Kapp / Footpath",
      "caption": "Footpath near the Ribble"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Parlick_through_the_arch._-_geograph.org.uk_-_1650210.jpg",
      "title": "Tom Howard / Parlick through the arch.",
      "caption": "Parlick Fell through the arch from the castle. Parlick as seen through the arch looking in a westerly direction. Parlick is the large mole hill on the sky line right of centre. To the right of Parlick on sky line is Wolf Fell then Saddle Fell, they all melt into one another. This photo is taken from Clitheroe Castle grounds on Wednesday 06/01/2010 at 4.27pm. The little hump on the horizon at the left of the picture is part of the famous Beacon Fell Country Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Stone_framed_Dusk_-_Kemple_End%2C_Beacon_Fell%2C_Parlick._-_geograph.org.uk_-_1652865.jpg",
      "title": "Tom Howard / Stone framed Dusk - Kemple End, Beacon Fell, Parlick.",
      "caption": "Stone framed Dusk - Kemple End, Beacon Fell, Parlick. This photo was taken at 4.32pm looking through the stone frame at the top of the steps next to Clitheroe Castle Keep. In the dusk from left to right we see Kemple End (the local name for the eastern end of Longridge Fell), the small hump in the centre is Beacon Fell which looks like a whale back when seen closer rising out of the lower land around. Lastly we have Parlick. Snow is on the ground which can be seen on the roofs of the houses in the town of Clitheroe."
    }
  ],
  "distance_km": 6.0,
  "description": "Explore the Lancashire town of Clitheroe on this lovely walk in the Ribble Valley. The walk explores the historic castle before heading to the River Ribble and the pretty Cross Hill Nature Reserve. The walk starts at the very fine Clitheroe Castle, located close to the train station in the town centre. The ruined medieval castle is thought to date from the 12th century and includes extensive grounds which are also a public park. Here you will find a fine war memorial with wonderful views towards Pendle Hill. There's also a fascinating Castle Museum housed in a Grade II listed 18th century building. Here you can see collections of natural history, local art and period costume, and an archaeology collection including items recovered from excavations on the site. After exploring the castle grounds the route then heads to the river where you can see a photogenic weir and salmon leap. Turn right and follow the river path past Brungerley Bridge to Brungerley Park. Continue towards Horrocksford and you can visit the Cross Hill Nature Reserve. Here you will find some nice woodland trails, meadows, wildflowers and wildlife spotting opportunities. Look out for Blackcap, Willow Warbler, Chiffchaff and Herons around the river. After exploring the pretty reserve the walk returns to the castle using the same paths. You can extend your walk by continuing along the Ribble Way long distance footpath. Following the riverside trail east will take you to West Bradford and Chatburn. Heading south from Eddisford Bridge will take you to Great Mitton and Hurst Green where you can pick up the Tolkien Trail. The literary trail explores an area connected with the Lord of the Rings trilogy. The town is also on the edge of the Forest of Bowland AONB. Just to the west you can enjoy a climb to Longridge Fell and enjoy fabulous views over the area. Around here you can also pick up the Forest of Bowland Walk which takes on a tour of the AONB. Whalley Abbey and the historical Roman village of Ribchester are also nearby.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to Holmes Mill for some refreshment after your walk. The extensive complex is housed in an old textiles mill and includes a beer hall, hotel, bistro and a food hall. It's described as 'celebration of Lancashire food' with a variety of options to tempt your palate. There's also a series of historic buildings so it's a nice place to browse around even if you're not felling hungry. You can find them on Greenacre Street with a postcode of BB7 1EB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a lovely dog walk with dogs allowed in the castle grounds. Holmes Mill is also dog friendly in the beer hall and outside. Water and treats are available here."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to follow the Ribble Way north and visit the pretty village of Sawley. Here you can visit the ruins of the 12th century Sawley Abbey which is run by English Heritage. The river is particularly scenic here and there's also a splendid riverside pub for post walk refreshments. On the way you would pass close to the neighbouring village of Waddington. The village is very pretty and a regular winner of the Lancashire Best Kept Village awards. A stroll along the Waddington Brook and through the delightful Coronation gardens is recommended here. To the east is Gisburn with its fine 18th century coaching inn and views of the Stock Beck. For more walking ideas in the area see the Ribble Valley Walks and the Lancashire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/slLuPMg1WUI",
  "postcode": "BB7 1AZ",
  "district": "Ribble Valley",
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Clitheroe War Memorial, Castle Gate, Clitheroe, Ribble Valley, Lancashire, England, BB7 1AZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "park"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve",
    "museum"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}