{
  "created_at": "2025-01-05T22:30:42.706112+00:00",
  "objectID": "24a56d859a8200c5f219a610a9e57ce8",
  "ref": "cambridge-backs-walk-walking-route",
  "title": "Cambridge Backs Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/23/St_John%27s_College_from_The_Backs_-_Cambridge_-_geograph.org.uk_-_1433301.jpg",
  "nearby": [
    {
      "description": "Milton Country Park",
      "objectID": "e75bcc584f7dc40c731974a3907d0adb",
      "ref": "milton-country-park-walking-and-cycle-route"
    },
    {
      "description": "Harcamlow Way",
      "objectID": "bb6518acb599bd810287707809e3ef55",
      "ref": "harcamlow-way-walking-route"
    },
    {
      "description": "Fen Rivers Way",
      "objectID": "4b991f049780ddecdbe1d4b28a67f0b0",
      "ref": "fen-rivers-way-walking-route"
    },
    {
      "description": "Anglesey Abbey",
      "objectID": "a5a25d94ff3279289c307ac1f4bfa2cd",
      "ref": "anglesey-abbey-walking-route"
    },
    {
      "description": "Wandlebury Country Park",
      "objectID": "d86ae8a474db0bb59dfdd11d4adb1b7a",
      "ref": "wandlebury-country-park-walking-route"
    },
    {
      "description": "Gog Magog Hills",
      "objectID": "6509fabe604a0870d8c384b14db027dd",
      "ref": "gog-magog-hills-walking-route"
    },
    {
      "description": "Cambridge to Grantchester",
      "objectID": "35e68933ff95e9a9b91ceb6559b51e80",
      "ref": "cambridge-to-grantchester-walking-route"
    },
    {
      "description": "Haslingfield",
      "objectID": "793605eba9bc9262caeb24619a089f3d",
      "ref": "haslingfield-walking-route"
    },
    {
      "description": "Cambourne",
      "objectID": "631b3ead8e49de4e7f096bb3d20efbeb",
      "ref": "cambourne-walking-route"
    },
    {
      "description": "Madingley Hall",
      "objectID": "f39c723846fbea15815fb5730838cd7c",
      "ref": "madingley-hall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/24a56d859a8200c5f219a610a9e57ce8.gpx",
  "_geoloc": {
    "lat": 52.1940775019,
    "lng": 0.137341182
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/St_John%27s_College_from_The_Backs_-_Cambridge_-_geograph.org.uk_-_1433301.jpg",
      "title": "Mick Lobb [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "St John's College. One of the most famous Oxbridge colleges, St John's was founded in the early 16th century by Lady Margaret Beaufort, the mother of King Henry VII, the first Tudor monarch. The college's alumni include poet William Wordsworth and seven of the country's prime ministers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Trinity_Hall_College_and_the_Cam_-_geograph.org.uk_-_3836467.jpg/512px-Trinity_Hall_College_and_the_Cam_-_geograph.org.uk_-_3836467.jpg",
      "title": "Trinity Hall College and the Cam by John Sutton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Trinity Hall College and the Cam. Founded in 1546 by King Henry VIII, Trinity is one of the largest Cambridge colleges, with the largest financial endowment of any Oxbridge college. Trinity performs exceptionally as measured by the Tompkins Table (the annual unofficial league table of Cambridge colleges), coming top from 2011 to 2017."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Cambridge_King%27s_College_Chapel_geograph-4091247-by-Ben-Brooksbank.jpg/512px-Cambridge_King%27s_College_Chapel_geograph-4091247-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "King's College Chapel. The Chapel was built in phases by a succession of kings of England from 1446 to 1515, a period which spanned the Wars of the Roses and three subsequent decades. The Chapel's large stained glass windows were completed by 1531, and its early Renaissance rood screen was erected in 1532–36. The Chapel is an active house of worship, and home of the King's College Choir. It is a significant landmark and a commonly used symbol of the city of Cambridge. They broadcast a popular carol service live on radio to millions worldwide every Christmas."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Cambridge_up_the_River_Cam_geograph-4091606-by-Ben-Brooksbank.jpg/512px-Cambridge_up_the_River_Cam_geograph-4091606-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Up the River Cam at the Backs, past King's College. View south from Clare Bridge to King's Bridge, with another punting group."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Cambridge_-_MathematicalBridge.jpg/512px-Cambridge_-_MathematicalBridge.jpg",
      "title": "By Jean-Christophe BENOIST (Own work) [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Mathematical Bridge. The bridge was designed in 1748 by William Etheridge (1709–76), and was built in 1749 by James Essex the Younger (1722–84). It has subsequently been repaired in 1866 and rebuilt to the same design in 1905. The red-brick building seen on the right of the photograph is the riverside building (ca. 1460), the oldest building on the river at Cambridge, containing parts of the President’s Lodge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Cambridge_-_St_John_College_-_New_Court.jpg/512px-Cambridge_-_St_John_College_-_New_Court.jpg",
      "title": "By Jean-Christophe BENOIST (Own work) [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "St John's College - New Court. St John's is the second wealthiest college in Oxford and Cambridge, after neighbouring Trinity, at Cambridge. College alumni include the winners of twelve Nobel Prizes, seven prime ministers, twelve archbishops of various countries, at least two princes and three saints. The Romantic poet William Wordsworth studied at St John's, as did William Wilberforce and Thomas Clarkson, two abolitionists who led the movement that brought slavery to an end in the British Empire. Prince William was affiliated with the college while undertaking a university-run course in estate management in 2014."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Cambridge_-_Bridge_of_Sighs.jpg/512px-Cambridge_-_Bridge_of_Sighs.jpg",
      "title": "By Jean-Christophe BENOIST (Own work) [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Bridge of Sighs. The bridge was built in 1831 and crosses the River Cam between the college's Third Court and New Court. The architect was Henry Hutchinson. It is named after the Bridge of Sighs in Venice, although they have little architecturally in common beyond the fact that they are both covered bridges with arched bases. The bridge, a Grade I listed building, is a Cambridge attraction and Queen Victoria is said to have loved it more than any other spot in the city"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Jesus_Green_Lido_approach.jpg/512px-Jesus_Green_Lido_approach.jpg",
      "title": "By Marvinthefish (Own work) [CC BY-SA 4.0 (http://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Jesus Green Lido. One of the few remaining examples of the lidos built across the country in the 1920s. It is among the longest outdoor swimming pools in Europe at 100 yards (91 m) in length. On the northern edge of Jesus Green is the River Cam, with Chesterton Road (the A1303) on the opposite side. To the east is Victoria Avenue and beyond that Midsummer Common, common land that is still used for grazing."
    }
  ],
  "distance_km": 7.0,
  "description": "This circular city walk takes you around the highlights of Cambridge, visiting The Backs, a picturesque area where several colleges of the University of Cambridge back on to the River Cam. It's a delightful area for a stroll with magnificent architecture including St John's College, King's College and the fine bridges over the River Cam. The walk starts from the train station and follows Station Road and Hills Road to Downing College. Founded in 1800, it was the only college to be added to Cambridge University between 1596 and 1869, and is often described as the oldest of the new colleges and the newest of the old. You continue past Peterhouse College to the world famous Mathematical Bridge over the Cam. The Grade II listed wooden bridge was originally built in the 18th century and connects two parts of Queens' College. You can virtually explore this part of the walk using the google street view link below! The route then passes around Queens' College, one of the oldest and largest colleges of the university, founded in 1448 by Margaret of Anjou (the queen of Henry VI, who founded King's College). It spans both sides of the river and has some of the most recognisable buildings in Cambridge. The trail then heads aroud the back of King's College, St John's, Trinity, and Trinity Hall. King's was founded in 1441 by Henry VI, soon after he had founded its sister college in Eton . It is regarded as one of the greatest examples of late Gothic English architecture and includes a 13th century chapel with splendid stained-glass windows. The route then crosses the Cam, passing Trinity Lane and Bridge Street before coming to Magdalene College. Founded in 1428 the college's old buildings are representative of the growth from a monks' foundation into a centre of education. After heading around the back of Magdalene the route crosses Jesus Green where there is a lido. It is one of the few remaining examples of the lidos built across the country in the 1920s. After passing through the park you head around Jesus College. The college was established in the late 15th century and includes expansive grounds. Notable alumni include Thomas Cranmer, Samuel Taylor Coleridge, Lord Reid, Lord Toulson, Sir Rupert Jackson, Sir David Hare, Sir Roger Scruton, and Nick Hornby. The final section takes you past Christ's Pieces and through Parker's Piece parks. Christ's Pieces is a pretty Victorian park with flower beds and ornamental trees. Parker's Piece is a 25 acre park now regarded as the birthplace of the rules of Association Football. From here it is a short stroll back to the train station and the finish point. To extend your walking in the area try the Cambridge to Grantchester Walk. The delightful riverside walk starts in the city centre and takes you to the pretty village of Grantchester. The last mile of this walk makes use of the Fen Rivers Way long distance trail. At Jesus Green you have the option of picking up the trail and following it along the Cam to the nearby Milton Country Park. It's about 2 miles to the north and includes nice trails around several pretty lakes. The long distance Harcamlow Way also passes through the city. You could pick this up and head north east towards Lode and visit Anglesey Abbey. The National Trust site includes 114 acres of beautiful gardens surrounding a Jacobean mansion. To the south of the city you will find Wandlebury Country Park in the Gog Magog Hills. This is another excellent area for walking near the city.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles south of the city and you could visit the nearby village of Haslingfield. Here you'll find pleasant walks along the River Rhee, rows of quaint thatched cottages, a church dating back to the 12th century and a noteworthy Tudor Manor House where Queen Elizabeth I stayed during the 16th century. To the west is the new settlement of Cambourne. There's some pleasant walks around this modern village with a lovely local nature reserve to explore. The wildlife rich reserve includes pretty lakes, wildflower meadows and wetland areas. On the walk you can also visit the ancient Bourn Windmill, the oldest surviving windmill in the United Kingdom. Just to the north of the city is the delightful Wicken Fen. The nature reserve is a great place for walking and cycling with flowering meadows, reedbeds, waterways and an abundance of wildlife to see. The Lodes Way can also be picked up here. This circular walk or cycle follows National Cycle Route 11 through the Cambridgeshire Lodes, a series of ancient man made waterways created to link a series of Fenland villages to the River Cam. Just to the west there's another highlight of the area at the historic Madingley Hall. Here you will find some beautiful ‘Capability’ Brown landscaped gardens surrounding a fine 16th century manor house."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tqR62cXwLt4",
  "postcode": "CB1 2JW",
  "district": "Cambridge",
  "county": "Cambridgeshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}