{
  "created_at": "2025-01-06T18:46:37.359310+00:00",
  "objectID": "24aadf2f9a81ab47dce1a00cb314f0af",
  "ref": "mullaghmore-head-walking-route",
  "title": "Mullaghmore Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Mullaghmore_Head_Cliffs.jpg/512px-Mullaghmore_Head_Cliffs.jpg",
  "nearby": [
    {
      "description": "Rougey Cliff Walk",
      "objectID": "6c67dffaac3a558aaa8065c0162a688b",
      "ref": "rougey-cliff-walk-walking-route"
    },
    {
      "description": "Glencar Waterfall",
      "objectID": "f6ed83ccfdd0d7f6938abf144170e413",
      "ref": "glencar-waterfall-walking-route"
    },
    {
      "description": "Lough Eske",
      "objectID": "ff0ec6265e3d4357fd668fb56dcc1efd",
      "ref": "lough-eske-walking-route"
    },
    {
      "description": "Benbulben Forest",
      "objectID": "fef8d4791e5930b9f554162f489fc349",
      "ref": "benbulben-forest-walking-route"
    },
    {
      "description": "Rosses Point",
      "objectID": "79cad6798bd688aced6bc3f2bf965213",
      "ref": "rosses-point-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/24aadf2f9a81ab47dce1a00cb314f0af.gpx",
  "_geoloc": {
    "lat": 54.46432,
    "lng": -8.45031
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Mullaghmore_Head_Cliffs.jpg/512px-Mullaghmore_Head_Cliffs.jpg",
      "title": "Kent Wang, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mullaghmore Head Cliffs. The village has 136 year-round residents according to the 2016 Census; however, its population is significantly higher during summer months. The peninsula is bounded by two large beaches on either side, and sports panoramic views of Ben Bulben and the Dartry Mountains, making it one of Sligo's most popular seaside destinations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Pier_Head_Hotel%2C_Mullaghmore_-_geograph.org.uk_-_2513277.jpg/512px-Pier_Head_Hotel%2C_Mullaghmore_-_geograph.org.uk_-_2513277.jpg",
      "title": "Pier Head Hotel, Mullaghmore by Eric Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Pier Head Hotel is located in Mullaghmore village by the Pier wall. Originally established as McHugh's Hotel & Tearooms in the early twentieth century, it also housed a schoolhouse. Presently, it remains under the ownership of the McHugh family. In 2005, the hotel underwent significant renovations, introducing additional rooms, a heated pool, a spa, and a new restaurant. Notably, in 2007, the hotel served as the rally headquarters for the final stage in the Rally Ireland stages. In 2010, the Pier Head Hotel hosted the legendary Leonard Cohen, who chose Mullaghmore for its peaceful ambiance outside of Sligo town. Cohen, known for his appreciation of scenic walks, enjoyed the beach and the village during his stay. The hotel was his residence while he performed two gigs in Sligo, with one of them being at Lissadell House, a venue he praised as one of his favorites. In 2015, The Pier Head welcomed Charles, Prince of Wales, and Camilla, Duchess of Cornwall, during their official visit to Mullaghmore, a place with personal significance as it is where Prince Charles's uncle was tragically killed. The hotel even organized a brief history exhibition for the royal visitors. As of July 2022, The Pier Head Hotel boasts over 40 rooms, Nimmo's residents bar (named after the Harbour's designer), and a restaurant known as The Clashybann Restaurant, offering scenic views of Donegal Bay. The restaurant is open to the public, as is the leisure centre and the Quay Bar."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Mullaghmore_Head%2C_Sligo.jpg/512px-Mullaghmore_Head%2C_Sligo.jpg",
      "title": "NTF30, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Mullaghmore Head, Sligo. One of the standout features of Mullaghmore is Mullaghmore Head, a captivating viewpoint that provides awe-inspiring panoramic views of the coastline. Perched atop rugged cliffs, the head offers a vantage point to witness the vastness of the Atlantic, dramatic waves crashing against the shore, and the distant silhouette of Classiebawn Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Classiebawn_Castle_-_geograph.org.uk_-_1152490.jpg",
      "title": "Joseph Mischyshyn / Classiebawn Castle",
      "caption": "Classiebawn Castle. Classiebawn Castle, a prominent structure in the vicinity, adds a touch of historical intrigue to the landscape. Built in the 19th century, the castle stands proudly against the backdrop of Mullaghmore Head, contributing to the area's unique charm.. Designed in the Baronial style by the accomplished Dublin architect James Rawson Carroll, the castle stands as a testament to the historical and cultural richness of the region. Its construction employed a yellow-brown sandstone, meticulously transported by sea from County Donegal, showcasing the dedication to craftsmanship and attention to detail. The architectural ensemble of Classiebawn Castle includes a distinctive gabled range featuring a central tower crowned by a conical-roofed turret, adding to the castle's picturesque allure. The castle's design echoes the Baronial style, characterised by its romanticised interpretation of medieval architecture, creating a harmonious blend with the rugged coastal surroundings. The history of Classiebawn Castle is intertwined with the complex narratives of Irish land ownership. Originally part of the holdings of the O'Connor Sligo family, the land upon which the castle stands underwent confiscation by the English Parliament as a form of compensation for those who quelled an Irish rebellion. Subsequently, approximately 4,000 hectares (10,000 acres) of this land were granted to Sir John Temple (1600–1677), who held the esteemed position of Master of the Rolls in Ireland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Mullaghmore_Harbour_August_2020.jpg/512px-Mullaghmore_Harbour_August_2020.jpg",
      "title": "NTF30, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Mullaghmore Harbour. Mullaghmore's maritime heritage is evident in its functioning harbor, where fishing boats sway gently in the breeze. The village, with its quaint cottages and welcoming atmosphere, is a haven for those seeking a peaceful escape from the hustle and bustle of modern life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Mullaghmore_Beach_%2849316792647%29.jpg/512px-Mullaghmore_Beach_%2849316792647%29.jpg",
      "title": "David Stanley from Nanaimo, Canada, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Mullaghmore Beach. Mullaghmore is renowned as a destination for big wave surfing. On 8 March 2012, surfers and windsurfers, hailing from various corners of the globe, navigated waves reaching heights of up to 15 metres (49 ft) off Mullaghmore Head. Although impressive, these waves fell short by about five metres (16 ft) compared to the tallest wave ever recorded in Ireland, which occurred in County Donegal on 13 December 2011, measuring a staggering 20.4 metres (67 ft). The formidable waves at Mullaghmore were a consequence of a intricate weather system aptly named the \"Viking storm,\" creating significant wave conditions in the region consistently for the month of March over a 15-year period. Despite the thrill, some riders experienced injuries, including bruising, broken bones, and damaged surfboards. A low-pressure system originating from North America advanced eastward and merged with another cyclone in the Western Atlantic. This combined system positioned itself off the coast of Ireland, already marked by high waves from preceding strong weather systems. Furthermore, a robust anticyclone over the Azores established a substantial pressure gradient in the North Atlantic, directing a powerful fetch towards Ireland. Alongside this, there was an extended fetch length in the North Atlantic directed towards Europe, contributing to the creation of swells. The amalgamation of these conditions was validated by satellite data on 7 March 2012, confirming waves exceeding 15 metres (49 ft) in height."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Mullaghmore_0001.jpg/512px-Mullaghmore_0001.jpg",
      "title": "Dieglop, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Mullaghmore 0001"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/The_Beach_House_Hotel%2C_Mullaghmore%2C_from_the_harbour_mole_-_geograph.org.uk_-_2513289.jpg/512px-The_Beach_House_Hotel%2C_Mullaghmore%2C_from_the_harbour_mole_-_geograph.org.uk_-_2513289.jpg",
      "title": "The Beach House Hotel, Mullaghmore, from the harbour mole by Eric Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Beach House Hotel, Mullaghmore, from the harbour mole. The Beach Hotel, positioned just across the road from the Pier Head and offering a picturesque view of the harbour, has been a prominent establishment in Mullaghmore since its inception in the 1950s. Over the years, it has been a favored choice, especially during the heyday of showbands. In the late 1990s, the hotel underwent expansions that included the introduction of Corki's Niteclub and the establishment of a leisure center featuring a 15-meter pool, a gym, and a Jacuzzi. Notably, the hotel was showcased in Episode 6 of Series 7 of RTÉ's At Your Service in 2015. Renowned hoteliers Francis Brennan and his brother John intervened to revitalize the hotel, implementing a comprehensive plan encompassing room renovations, refurbishment of the function room, and a strategic rebranding initiative. Despite budget constraints leading to the decommissioning of the leisure center, the outcomes were transformative, breathing new life into the hotel. Presently, the Beach Hotel boasts 28 rooms, a resident's restaurant, and the Boatmans Bistro Bar, open to the public, marking its continued success in Mullaghmore."
    }
  ],
  "distance_km": 4.8,
  "description": "This pretty village sits in a lovely coastal spot on the west coast of Ireland in County Sligo. It's a fine place for a walk with views to the Mullaghmore Peninsula and Benbulben mountain. This circular loop walk takes you along quiet roads to the viewpoint at Mullaghmore head. You can start the walk at Mullaghmore Harbour and then follows trails north and west to the Head where you'll find a splendid, rugged coastline. There's some wonderful views over the Atlantic coast from this scenic spot too. Just south of here there's also the Castle Classiebawn Viewpoint. Here you can enjoy views to the photogenic castle which is perched majestically atop a rocky promontory. Continue your coastal cliff walking by heading east to the popular Rougey Cliff Walk in the town of Bundoran. There's glorious sea views and some interesting rock formations to see on the circular walk.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Benbulben Forest Walk is a popular walk through some peaceful woodland with excellent views of Benbulben Mountain. A few miles to the south west there's the delightful village of Rosses Point where you can enjoy some lovely coastal walks, pretty beaches and fine views over Sligo Bay."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jroT6TNzyHM?si=9GPbc3B4M0cF9U9R",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Mullaghmore Road, Cliffony North ED, Sligo Municipal Borough District, County Sligo, Connacht, Éire / Ireland",
  "postcode": null,
  "district": null,
  "county": "County Sligo",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "cliff"
  ],
  "points_of_interest": [
    "viewpoints",
    "coastline",
    "rock formations"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}