{
  "created_at": "2025-01-06T04:17:51.542667+00:00",
  "objectID": "2510ab2ef0f253f44f1de6629e049580",
  "ref": "swanton-morley-walking-route",
  "title": "Swanton Morley Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/The_war_memorial_in_Swanton_Morley_-_geograph.org.uk_-_1894742.jpg/256px-The_war_memorial_in_Swanton_Morley_-_geograph.org.uk_-_1894742.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2510ab2ef0f253f44f1de6629e049580.gpx",
  "_geoloc": {
    "lat": 52.7147474161,
    "lng": 0.9881821335
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/The_war_memorial_in_Swanton_Morley_-_geograph.org.uk_-_1894742.jpg/256px-The_war_memorial_in_Swanton_Morley_-_geograph.org.uk_-_1894742.jpg",
      "title": "The war memorial in Swanton Morley by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The war memorial in Swanton Morley. The village has an interesting history stretching back to the Domesday Book in the 11th century. It was also home to the ancestors of Abraham Lincoln, 16th President of the United States. The village has won several awards including the Calor Village of the Year award 2009/10 for the East of England"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/The_church_of_All_Saints_in_Swanton_Morley_-_churchyard_-_geograph.org.uk_-_1894740.jpg",
      "title": "The church of All Saints in Swanton Morley - churchyard by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The church of All Saints in Swanton Morley. The church dates back to the 14th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Pastures_in_Swanton_Morley_-_geograph.org.uk_-_1894731.jpg",
      "title": "Pastures in Swanton Morley by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pastures in Swanton Morley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Worthing_Mill_-_geograph.org.uk_-_326467.jpg",
      "title": "Adrian Hodge / Worthing Mill",
      "caption": "Worthing Mill. Although having stopped commercial operation in 1928, Worthing Mill still stands beside the River Blackwater."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/River_beside_Swanton_Morley_road%2C_near_Worthing%2C_Norfolk_-_geograph.org.uk_-_523507.jpg/256px-River_beside_Swanton_Morley_road%2C_near_Worthing%2C_Norfolk_-_geograph.org.uk_-_523507.jpg",
      "title": "Zorba the Geek / River beside Swanton Morley road, near Worthing, Norfolk",
      "caption": "River beside Swanton Morley road, near Worthing, Norfolk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/River_Blackwater_and_Worthing_Church_-_geograph.org.uk_-_309471.jpg",
      "title": "Adrian Hodge / River Blackwater and Worthing Church",
      "caption": "River Blackwater and Worthing Church. The River Blackwater joins the River Wensum between North Elmham and Billingford. Here it flows between rough meadows in the hamlet of Worthing. The Romanesque doorway to this tiny church, dedicated to St Margaret, is evidence of its antiquity."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Cottages_in_Hoe_-_geograph.org.uk_-_396593.jpg",
      "title": "Adrian Hodge / Cottages in Hoe",
      "caption": "Cottages in Hoe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Country_Lane_0.6_Km_WEST_SWANTON_MORLEY_Norfolk_-_geograph.org.uk_-_293144.jpg",
      "title": "Clem Maginniss / Country Lane 0.6 Km WEST SWANTON MORLEY Norfolk",
      "caption": "Country Lane 0.6 Km west of Swanton Morley"
    }
  ],
  "distance_km": 12.7,
  "description": "This attractive Norfolk village is located just to the north of Dereham in the heart of the county. The award winning village includes a noteworthy 14th century church and an early 17th century pub with links to the ancestors of Abraham Lincoln. This route from the village uses sections of the Walsingham Way and the Wensum Way to create a circular walk through the surrounding countryside. On the way there's pretty villages, ancient churches and views of the River Blackwater to enjoy. The walk starts on the northern side of the village where you can pick up the Walsingham Way and follow it north to Worthing where you can see the picturesque Worthing Mill on the River Blackwater. The route then heads south west on country lanes towards Hoe where you can pick up the Wensum Way. You could take a small detour from the route here and head west to visit The Rough nature reserve near Gressenhall. This route follows the trail east to return to Swanton Morley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy some post exercise refreshment at Darby's. The Rustic country pub includes a characterful interior with tractor seats as bar stools. They have an extensive menu including a fine Sunday roast. You can find them on Elsing Road with a postcode of NR20 4NY for your sat navs. There's also the Angel which dates back to 1610 and is Grade II listed. Inside there's roaring fire and a low ceiling with original beams which have English hops hanging from them. You can find them at 66 Greengate, NR20 4LX"
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk. The two local pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Follow the Walsingham Way north and you could visit the lovely Pensthorpe Park near Fakenham. This 700 acre natural park is something of a local highlight with miles of walking trails taking you to lakes, ponds, gardens and riverside trails. Just to the north is neighbouring North Elmham where you could visit the ruins of the ancient North Elmham Chapel. A few miles east is the village of Lyng where there's the Sparham Pools Nature Reserve to explore. The reserve includes a series of lakes with lots of water loving wildlife to look out for. Just to the west there's Beetley and Hoe Rough to explore. The nature reserve includes find peaceful riverside trails with wildlife such as otter, water vole and great crested newt to see."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1Kam_HRwbFs",
  "district": "Breckland",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Town Street, Swanton Morley, Breckland, Norfolk, England, NR20 4PB, United Kingdom",
  "postcode": "NR20 4PB",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "river"
  ],
  "points_of_interest": [
    "villages",
    "churches",
    "river views"
  ],
  "facilities": [
    "pub",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}