{
  "created_at": "2025-01-06T00:06:30.168473+00:00",
  "objectID": "2521530447e4bce5b0e18c54cb40468e",
  "ref": "wanderlust-way-walking-route",
  "title": "Wanderlust Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Wanderlust_Way_-_geograph.org.uk_-_822244.jpg",
  "nearby": [
    {
      "description": "Cleethorpes Country Park",
      "objectID": "561f5fbfd9696032adafbc24692b4e0a",
      "ref": "cleethorpes-country-park-walking-and-cycle-route"
    },
    {
      "description": "Cleethorpes to Tetney Lock Walk",
      "objectID": "360700238a87c663e4dee33491bf31be",
      "ref": "cleethorpes-to-tetney-lock-walk-walking-route"
    },
    {
      "description": "Weelsby Woods",
      "objectID": "6438e0ec878cb9450504a76d2b036517",
      "ref": "weelsby-woods-walking-route"
    },
    {
      "description": "Barnoldby le Beck",
      "objectID": "7594141a88d12893a703606dd8355c80",
      "ref": "barnoldby-le-beck-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2521530447e4bce5b0e18c54cb40468e.gpx",
  "_geoloc": {
    "lat": 53.5343277104,
    "lng": -0.124946178
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Wanderlust_Way_-_geograph.org.uk_-_822244.jpg",
      "title": "Richard Croft / Wanderlust Way",
      "caption": "Wanderlust Way. Footpath to Bradley Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Wanderlust_Way_-_geograph.org.uk_-_111438.jpg",
      "title": "Richard Croft / Wanderlust Way",
      "caption": "On the trail near Barnoldby le Beck. The signpost points northwards along the \"Wanderlust Way\". The obelisk is a monument to William Shaw of Brocklesby .. the plaque reads 'This monument was erected by his many friends as a token of their regard and to mark the spot where William Smith, huntsman to the Earl of Yarborough fell on 11th April 1845. His gallant horsemanship and management of hounds in the kennel and in the field were unsurpassed. His horse falling over a small leap whilst Smith was cheering on his favourite hounds, he was thrown on his head and from the injuries he then received, he died on 16th April 1845 at the house of his friend Richard Nainby of this village esquire, by whom the site for this memorial was given on the 6th day of April 1861'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/The_Ice_Cream_Shop%2C_Brigsley_-_geograph.org.uk_-_873454.jpg",
      "title": "Paul Glazzard / The Ice Cream Shop, Brigsley",
      "caption": "The Ice Cream Shop, Brigsley. In the mid 1930s Mrs Eliza Leary began selling sandwiches and tea to the many walkers who stopped by the Waithe Beck Bridge at Brigsley. A small shop was soon established which sold ice creams and general goods, the original ice cream machine being capable of making one pint of ice cream every 45 minutes. The Learys continued to make ice cream from goats milk during World War 2 and by the mid 1960s decided to forget about selling other stuff and concentrate on ice cream only, building a reputation locally as \"the famous Brigsley ice cream shop\". The business was sold in 2003 and a new revamped shop opened on 10th March 2004."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/The_Wanderlust_Way%2C_Brigsley_-_geograph.org.uk_-_873414.jpg/256px-The_Wanderlust_Way%2C_Brigsley_-_geograph.org.uk_-_873414.jpg",
      "title": "Paul Glazzard / The Wanderlust Way, Brigsley",
      "caption": "Horses in a field at Brigsley. Looking west-southwest from the Way near Waithe Beck, just north of Rose Cottage and the Brigsley Ice Cream Shop on Waltham Road. Originally known as the 'Bradley 20' after its most popular starting point at Bradley Woods, the twenty mile circular walk was renamed in 1990 to commemorate the life of James Neville 'Nev' Cole (1916 - 1989) who founded the Wanderlust Rambling Club and campaigned to keep public footpaths open and well maintained in this part of the Lincolnshire Wolds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/The_Wanderlust_Way%2C_Brigsley_-_geograph.org.uk_-_873372.jpg",
      "title": "Paul Glazzard / The Wanderlust Way, Brigsley",
      "caption": "Approaching the parish boundary between Brigsley and Barnoldby le Beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Gates_and_barns_-_geograph.org.uk_-_378762.jpg",
      "title": "John Beal / Gates and barns",
      "caption": "Gates and barns. Part of the Melbourne House farm complex at Brigsley, with the small wooden stile next to the barn which starts the Barnoldby-le-Beck section of the Wanderlust Way. For interest, the barns are in fact stables."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Village_portrait%2C_Ashby-cum-Fenby_-_geograph.org.uk_-_378585.jpg",
      "title": "John Beal / Village portrait, Ashby-cum-Fenby",
      "caption": "Village portrait, Ashby-cum-Fenby. Just a very pleasing view of a very pleasant village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Thatched_cottage%2C_East_Ravendale_-_geograph.org.uk_-_390339.jpg",
      "title": "John Beal / Thatched cottage, East Ravendale",
      "caption": "Thatched cottage, East Ravendale. An excellent example, found near to the church on the eastern side of the village."
    }
  ],
  "distance_km": 32.0,
  "description": "Follow the Wanderlust Way through the Lincolnshire Wolds AONB and enjoy splendid views of the Humber Estuary on this circular walk. The circular walk takes place just west of Grimsby and visits Bradley Woods, Brigsley, Hatcliffe and Ashby Cum Fenby. The route runs for a distance of about 20 miles and includes some small climbs on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the little village of Barnoldby le Beck you could enjoy a pit stop at the Ship Inn. They serve award winning dishes and have a pleasant garden area to relax in on warmer days. You can find them on the Main Road at a postcode of DN370BG for your sat navs. The pub is dog friendly if you are out walking with your canine friend. The village also includes a noteworthy 13th century church which is worth investigating."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Grimsby you could pay a visit to the coastal Cleethorpes Country Park or enjoy a stroll around the peaceful woodland trails at Weelsby Woods. You can also pick up the Cleethorpes to Tetney Lock Walk in this area. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/TyapmXNAk3Y",
  "county": "North East Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bradley Road, Low Farm, Bradley, North East Lincolnshire, England, DN37 0AH, United Kingdom",
  "postcode": "DN37 0AH",
  "district": "Bradley",
  "state": "England"
}