{
  "objectID": "2522c877fea31a0d119931d386891c5b",
  "created_at": "2024-12-18T18:42:04.154879+00:00",
  "ref": "blakeney-point-nature-reserve-walking-route",
  "title": "Blakeney Point Seals Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Seals_Blakeney_Point.jpg",
  "nearby": [
    {
      "description": "Peddars Way and Norfolk Coast Path",
      "objectID": "4e358890f1c641370cd442450ff77e93",
      "ref": "peddars-way-and-norfolk-coast-path-walking-route"
    },
    {
      "description": "Cley Marshes Nature Reserve",
      "objectID": "d3f72ebb05b448abfa3e91dec245899f",
      "ref": "cley-marshes-nature-reserve-walking-route"
    },
    {
      "description": "Blakeney Circular Walk",
      "objectID": "7ff7cf713beb85f916e3e552e5020f29",
      "ref": "blakeney-circular-walk-walking-route"
    },
    {
      "description": "Walsingham Way",
      "objectID": "30e51cb2690e80ea946d3b969e61fdb3",
      "ref": "walsingham-way-walking-route"
    },
    {
      "description": "Binham Priory",
      "objectID": "df9b9eb5ebc58abadd9373f123bc604d",
      "ref": "binham-priory-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/8DBD0DDF691B405E80257D4A0073E3CD/$FILE/Blakeney Point Nature Reserve.gpx",
  "_geoloc": {
    "lat": 52.965854953,
    "lng": 1.0490279245
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Seals_Blakeney_Point.jpg",
      "title": "Roy Turner / Grey Seals basking on Beach",
      "caption": "Grey Seals basking on the Beach, Blakeney Point. In Norfolk small colonies of grey and of common seals can be seen near Blakeney and there is a colony of grey seals along a section of coast between the villages of Horsey and Winterton. The latter spend several weeks out of water when their pups are born in December and January; around 100 seal pups are born here every year. Grey seals feed on a wide variety of fish, basically any that are available, which they catch at depths down to 70 metres; sand eels form an important part in their diet in many localities as do octopus, crabs and lobsters. The daily food requirement is estimated to be 5kg; the animals do not feed every day, however, and they fast during the breeding season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/No_pictures%2C_please%5E_-_geograph.org.uk_-_1016300.jpg",
      "title": "Evelyn Simak / No pictures, please!",
      "caption": "No pictures, please! Seemingly unperturbed by nearby construction work this colony of grey seals has settled down on the beach for an afternoon nap. They are used to passersby and will usually remain on the beach, if not approached too closely, and one can spend as long as one wishes watching these creatures which move so gracefully when in their element. The grey seal (Halichoerus grypus) is a medium-sized seal with the bulls weighting up to 300 kg and the cows being much smaller and weighing 100-150 kg. There are several colonies of grey seals along the British and Irish coasts. Large colonies numbering up to 6,000 animals can be seen at the Farne Islands off the Northumberland Coast, on North Rona (Scotland), on Lambay Island (near Dublin) and Ramsey Island off the coast of Pembrokeshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Blakeney_Point_-_geograph.org.uk_-_1567573.jpg",
      "title": "Hugh Venables / Blakeney Point",
      "caption": "Sand dunes and upper saltmarsh near the end of the spit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/The_Tern_Colony_on_Blakeney_Point_-_geograph.org.uk_-_491700.jpg",
      "title": "Stuart Warrington / The Tern Colony on Blakeney Point",
      "caption": "The Tern Colony on Blakeney Point. The National Trust look after this site. I was able to crawl to this vantage point accompanied by a NT warden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Blakeney_Point_-_geograph.org.uk_-_848282.jpg",
      "title": "Graham Taylor / Blakeney Point",
      "caption": "Looking across from Morston Creek to the Old Lifeboat Station on the Point. Notice the old lifeboat moored in the channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/The_Southern_Edge_of_The_Hood_on_Blakeney_Point_-_geograph.org.uk_-_480574.jpg",
      "title": "Nigel Stickells / The Southern Edge of The Hood on Blakeney Point",
      "caption": "The Southern Edge of The Hood on the Point. The Hood is a small cluster of sand dunes that project southwards into an area of marshland called North Side on that side of the Blakeney Channel. To the left of this view in the distance can be seen the sand dunes that go to make up the western end of the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Blakeney_Spit_-_geograph.org.uk_-_980805.jpg",
      "title": "Evelyn Simak / Blakeney Spit",
      "caption": "Blakeney Spit viewed across the realigned channel of the River Glaven. The tidal River Glaven extends from the sluices on the A149 coast road and from there runs parallel to the coast, through the Glaven estuary behind the sand and shingle spit known as Blakeney Spit (seen in the background), before it discharges into the sea at Blakeney Point. Flood defence embankments run adjacent to the channel, which prevents the tidal flooding of adjacent fresh water marshes at Blakeney Freshes and at Cley and Salthouse. Because of the impeding danger of the former channel of the River Glaven being blocked by natural southwards migration of Blakeney Spit, and more recently also because of shingle that had become displaced following storms in 1993 and in 1996, resulting in flooding of the adjacent Blakeney Freshes Special Protection Area and the village of Cley, the Environment Agency decided to cut a new channel to the south of the old one . Blakeney Spit, an extensive sand and shingle spit extending to Blakeney Point, two kilometres to the north west, can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/The_beach_at_Cley_Eye_-_geograph.org.uk_-_980985.jpg",
      "title": "Evelyn Simak / The beach at Cley Eye",
      "caption": "The beach at Cley Eye. This shingle beach is vast and photographs can be very deceiving; for better perspective, hopefully, an almost fully submerged marker can just be glimpsed (at right) in the sea beyond. The car park for the start of the walk is located near here."
    }
  ],
  "distance_km": 8.3,
  "description": "This beautiful National Nature Reserve on the Norfolk coast is a four-mile-long sand and shingle spit with sand dunes, salt marshes, tidal mudflats and farmland. There is a mixed colony of around 500 seals which can be seen on the beach or from boat trips departing from Morston Quay to Blakeney Point. This is a very popular walk, running for just over 7 miles along the beach and shingle reach. Start the walk from the good sized car park at Cley Beach at the end of Beach Road. It's located just to the north of the little village of Cley-Next-the-Sea. From the car park head west along the beach to the reserve where you will find a variety of rare flora and fauna. Look out for interesting plantlife including Sea Lavenders, Yellow-Horned Poppy and the white petals of Sea Campion. There is also an abundance of wildlife with migrant terns, the resident seals, wintering wildfowl and the occasional otter. The walk below takes you along the soft shingle beach and then on to the lifeboat house. You can also catch boat trips to Blakeney Point from Morston Quay which has an excellent visitor centre. It has a wealth of information about the area and you can catch a boat from the pretty quay to the reserve. Morston is located just to the west of both Blakeney and Cley. The Peddars Way and Norfolk Coast Path runs past the reserve so you have the option of following this trail to some other lovely locations in the area. On the trail to the west is the Stiffkey Salt Marsh where you will find a vast open expanse of salt marshes which attracts large numbers of birdlife including waders and wintering wildfowl. If you head east along the trail you will pass Blakeney with its pretty key and then on to the Cley Marshes Nature Reserve . This 430 acre reserve contains reed beds, freshwater marsh, pools and wet meadows.",
  "video_url": "https://www.youtube.com/embed/fnPchsoWAC8",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}