{
  "created_at": "2025-01-06T10:26:11.219148+00:00",
  "objectID": "25b7bbbdb098c57d915f4d385199f375",
  "ref": "codsall-walking-route",
  "title": "Codsall Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/22/Codsall_Church_-_geograph.org.uk_-_31991.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/25b7bbbdb098c57d915f4d385199f375.gpx",
  "_geoloc": {
    "lat": 52.6272952628,
    "lng": -2.2023900118
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Codsall_Church_-_geograph.org.uk_-_31991.jpg",
      "title": "Hilary Wright / Codsall Church",
      "caption": "Codsall Church. Photo taken from the fields along Whitehouse Lane,looking east. The Church stands above the village, which is S.E.Farmland predominates the North & West"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/The_Crown%2C_Codsall_-_geograph.org.uk_-_1563741.jpg",
      "title": "Geoff Pick / The Crown, Codsall",
      "caption": "The Crown, Codsall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Oak_Trees_near_Wrottesley_Hall%2C_Staffordshire_-_geograph.org.uk_-_386634.jpg",
      "title": "Roger Kidd / Oak Trees near Wrottesley Hall, Staffordshire",
      "caption": "Oak Trees near Wrottesley Hall, Staffordshire. The fields (including the rape field) and oak trees are in the square, even if Wrottesley Hall (distance) is not!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Inland_Pool%2C_Wrottesley_Park_-_geograph.org.uk_-_1420578.jpg",
      "title": "Richard Law / Inland Pool, Wrottesley Park",
      "caption": "Inland Pool, Wrottesley Park One of a number of pools and ponds in the grounds of Wrottesley Hall; this one has three small islands in the middle; each island has a small, mysterious brick structure on it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/The_Cross_Guns_-_geograph.org.uk_-_512535.jpg",
      "title": "A Holmes / The Cross Guns",
      "caption": "The Cross Guns, Codall Wood. A popular village pub/restaurant with a handy phone box outside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Chillington_Pool%2C_Chillington_Estate_-_geograph.org.uk_-_665941.jpg",
      "title": "kevin skidmore / Chillington Pool, Chillington Estate",
      "caption": "Chillington Pool, Chillington Estate. One of the first views of the Pool when entering the Estate from the Lodge at the Codsall Wood end. \"The Island\" is in the background, left hand side of the photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Gardens_at_Chillington_Hall_-_geograph.org.uk_-_1415090.jpg",
      "title": "A Holmes / Gardens at Chillington Hall",
      "caption": "Gardens at Chillington Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Codsall_Windmill-geograph.org-2336932.jpg/256px-Codsall_Windmill-geograph.org-2336932.jpg",
      "title": "John M / Codsall Mill",
      "caption": "Codsall Windmill"
    }
  ],
  "distance_km": 17.6,
  "description": "This large Staffordshire based village is well positioned for picking up a number of waymarked footpaths which run through the surrounding countryside. Nearby there's also a historic old hall with attractive parkland and gardens to explore. This route from the town makes use of sections of the Monarch's Way and the Staffordshire Way to create a circular walk through the surrounding countryside and woodland. On the way you'll visit some of the highlights of the area including Wrottesley Hall and Chillington Hall. The walk starts from the train station on the western side of the town. From here you can pick up the Staffordshire Way and the Monarch's Way and follow the waymarked footpaths south west to visit Wrottesley Hall and Park. The route then retraces its steps to Oaken before heading west and then north to Codsall Wood. You then skirt the western edge of Chillington Park on another section of the Monarch's Way. The route then heads east along Brick Kiln lane which will take you to the entrance of Chillington Hall. The Georgian country house has some fine walks around the Capability Brown landscaped park and lake. It is only open on a select number of days each year but there are public footpaths around the estate. From the hall you head south past Gunstone to return to Codsall and the train station.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Codsall Station Pub is located right next to the train station at the start/end of the walk. The Grade II listed pub has been converted from the old station buildings and includes interesting railway memorabilia on the walls. There's an outdoor seating area where you can see the working platforms. You can find them on Chapel Lane with postcode WV8 2EH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route are ideal for a dog walk. Please keep them on leads within the grounds of Chillington Hall. The Station pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Nearby you can pick up the Brewood Canal Walk which visits the Shropshire Union Canal, Wheaton Aston, Belvide Reservoir and Chillington Hall. On the eastern side of the village you can visit the canal and the Pendeford Mill Nature Reserve where there are good bird spotting opportunities. You can find the pretty reserve at postcode WV9 5ET. In neighbouring Perton there's a nice cyling and walking trail along the River Penk which runs between two pretty lakes. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QtZ_D_XvXZM",
  "postcode": "WV8 1BZ",
  "district": "South Staffordshire",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Station Road, Oaken, Codsall, South Staffordshire, Staffordshire, England, WV8 1BZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "park"
  ],
  "facilities": [
    "visitor center",
    "public footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}