{
  "created_at": "2025-01-05T23:34:44.465320+00:00",
  "objectID": "25c01a6b4cd7f8191e29396274fcd084",
  "ref": "caversham-court-gardens-walking-route",
  "title": "Caversham Court Gardens Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Caversham_court_-_geograph.org.uk_-_2358907.jpg/512px-Caversham_court_-_geograph.org.uk_-_2358907.jpg",
  "nearby": [
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Mapledurham House",
      "objectID": "45a3cb3f7b494ba15e2842c18c067faa",
      "ref": "mapledurham-house-walking-route"
    },
    {
      "description": "Caversham",
      "objectID": "df85ce2db682514bd7e1d0dd8d7119e7",
      "ref": "caversham-walking-route"
    },
    {
      "description": "Burghfield Wokefield Common",
      "objectID": "4b555f81aaa5a1cac1f094f25835b2ce",
      "ref": "burghfield-wokefield-common-walking-route"
    },
    {
      "description": "Twyford",
      "objectID": "d1c66f6f43a39507d445658215340198",
      "ref": "twyford-walking-route"
    },
    {
      "description": "Charvil Country Park",
      "objectID": "14701ba00a50d642f2aee27703edf87b",
      "ref": "charvil-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/25c01a6b4cd7f8191e29396274fcd084.gpx",
  "_geoloc": {
    "lat": 51.4676490374,
    "lng": -0.9794796853
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Caversham_court_-_geograph.org.uk_-_2358907.jpg/512px-Caversham_court_-_geograph.org.uk_-_2358907.jpg",
      "title": "Bill Nicholls / Caversham court",
      "caption": "View of Caversham court from the entrance gates."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Causeway_to_the_gazebo%2C_Caversham_Court_-_geograph.org.uk_-_1936365.jpg",
      "title": "Rose and Trev Clough / Causeway to the gazebo, Caversham Court",
      "caption": "Causeway to the gazebo, Caversham Court, near to Caversham, Reading, Great Britain. The two-storey gazebo and causeway have survived from the 17th century (Grade II listed. The upper room now contains information panels, and the causeway is marked out with a timeline relating events at Caversham Court to national history. The tree to the left is part of a large \"yew family\", which is several hundred years old. Low branches from the parent have taken root, creating a ring of offspring around it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Tea_Kiosk%2C_Caversham_Court_-_geograph.org.uk_-_1936377.jpg",
      "title": "Rose and Trev Clough / Tea Kiosk, Caversham Court",
      "caption": "Tea Kiosk. Built in 1934 as a toilet block when the gardens first opened to the public. Today it has a dual role - the part facing is used by local charities to provide refreshments , and there are still toilets round the back. It was designed by the Reading Corporation architect - the style has been described as either \"cottage \" or Arts and Crafts. It is believed some of the building materials were taken from the demolished house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Griffin_Plinths_-_geograph.org.uk_-_1936357.jpg",
      "title": "Rose and Trev Clough / Griffin Plinths",
      "caption": "Griffin Plinths. Either side of steps leading from the middle of the Long Walk to the riverside lawn. The griffin head on the right is a restored original, the one on the left had been lost and this is a new replacement. In times past griffins were thought to protect a house and keep away unwanted visitors. Two carved cat-like faces are set into the stone plinths, about halfway down. These are about 800 years old and probably came from the demolished Reading Abbey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Gallery_Garden_and_St._Peter%27s_Church_-_geograph.org.uk_-_1936293.jpg",
      "title": "Rose and Trev Clough / Gallery Garden and St. Peter's Church",
      "caption": "Gallery Garden and St. Peter's Church, near to Caversham. A door from a gallery on the first floor of the demolished house opened on to the garden at the top of the bank. The wall running down the bank has a gate leading to allotments, which occupy the former kitchen garden. The building on the right is the back of the old stable block."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/The_Long_Walk%2C_Caversham_Court.jpg",
      "title": "Rose and Trev Clough / The Long Walk, Caversham Court",
      "caption": "A path between the riverside lawn (left) and the allotments. The lawn has some fine old trees. Behind the fence on the right is a yew hedge, over 250 years old."
    }
  ],
  "distance_km": 1.0,
  "description": "Explore these beautiful award winning gardens on the banks of the River Thames on this short walk in the Caversham area of Reading. There are three lovely trails in park: Tree Trail - the park contains many fine specimen trees, some of which are over 100 years old. These include Lime, Yew and Magnolia. The Detective Trail - a historical walk for children. The Griffin's Trail - a family walk taking you to the pond, vinery, courtyard, font and riverbank. The gardens have a wide variety of plants and flowers including Wisteria, Lavender, Tulips, Nepeta and Roses. Caversham gardens are located just north of Reading town centre, over the Caversham Bridge. The Thames Path runs past the park so there is plenty of scope for continuing your walk along the river. For example if you head west you will soon come to the beautiful Mapledurham House with its 15th century watermill and lovely parkland.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the on site Tea Kiosk for some refreshments after your walk. They have some delicious home made cakes and an outdoor seating area with views over the gardens and the river."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of the village there's a pretty little nature reserve to visit in the shape of Clayfield Copse. The site includes woodland paths, a sculpture trail and a wildflower meadow. It's a nice place for a peaceful, easy stroll in the town. For more walking ideas in the area see the Berkshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hFLo1FqwTlA",
  "district": "Caversham",
  "county": "Reading",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}