{
  "created_at": "2025-01-06T02:31:57.953627+00:00",
  "objectID": "26038566dcff9158b0c128ce61f201e2",
  "ref": "patterdale-walking-route",
  "title": "Patterdale Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Patterdale_Church_-_geograph.org.uk_-_1470147.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/26038566dcff9158b0c128ce61f201e2.gpx",
  "_geoloc": {
    "lat": 54.5344668824,
    "lng": -2.9342417427
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Patterdale_Church_-_geograph.org.uk_-_1470147.jpg",
      "title": "Philip Halling / Patterdale Church",
      "caption": "Patterdale church is dedicated to St Patrick."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Goldrill_Beck%2C_Patterdale_-_geograph.org.uk_-_893276.jpg",
      "title": "Tom Richardson / Goldrill Beck, Patterdale",
      "caption": "Goldrill Beck, Patterdale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Patterdale_-_geograph.org.uk_-_361516.jpg",
      "title": "Richard C / Patterdale",
      "caption": "Patterdale. A nice view of the village from across the pretty Goldrill Beck which runs through the area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/The_White_Lion%2C_Patterdale_-_geograph.org.uk_-_771378.jpg",
      "title": "Jeff Tomlinson / The White Lion, Patterdale",
      "caption": "The White Lion, Patterdale. A pub of some note with a fine history."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Brothers_Water_-_geograph.org.uk_-_342185.jpg",
      "title": "Mick Garratt / Brothers Water",
      "caption": "Brothers Water. According to a legend it was named so because two brothers drowned there. The summit of Brock Crags in the distance on the right. On the left is the Angletarn Pikes and in the middle Lingy Crag."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Angle_Tarn_-_geograph.org.uk_-_614554.jpg",
      "title": "George Tod / Angle Tarn",
      "caption": "Looking west across Angle Tarn towards Helvellyn and Catstye Cam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Hayeswater_Reservoir_-_geograph.org.uk_-_182751.jpg",
      "title": "Bob Danylec / Hayeswater Reservoir",
      "caption": "Hayeswater reservoir looking towards High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Scattered_woodland%2C_Patterdale_-_geograph.org.uk_-_858835.jpg",
      "title": "Andrew Smith / Scattered woodland, Patterdale",
      "caption": "Scattered woodland, Patterdale. In the pastures just above the village. The flat grass in the foreground is the cricket ground."
    }
  ],
  "distance_km": 11.7,
  "description": "This small village sits in a lovely position in the Ullswater Valley, near the southern tip of the same named lake. It makes a good base for exploring the lake and many of the surrounding fells. This circular walk from the village visits three of the lovely lakes including Angle Tarn, Hayeswater and Brothers Water. The walk starts in the village and follows footpaths south east up to Boredale Hause and Stony Rigg. You then come to the Angletarn Pikes and Angle Tarn. It's a beautiful spot with fine views to Ullswater Lake and the surrounding fells. From the tarn you continue south east towards Satura Crag and the Knott, passing Rest Dodd on the way. The path then descends to Hayeswater Lake. From the lake you can pick up the Hayeswater Gill and follow it north east towards the little village of Hartsop. At Hartsop it is a short stroll to Brothers Water. It's another delightful, peaceful spot with a circular trail around the small lake. From Brothers Water you then head north to follow footpaths back into Patterdale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village, pay a visit to the noteworthy White Lion Inn for some refreshments. The pub has an interesting history having existed since the early 1800s. It's said that Wordsworth was in the bar as news arrived that Nelson had died at Trafalgar in 1805. The interior is full of old world charm while outside there's a nice beer garden just across the road. It's a lovely place to relax and soak in the fine views if the weather is good. You can find the pub in the village at postcode CA11 0NW for your sat navs. On the walk there's also the Brotherswater Inn located just to the south of the lake. The friendly inn does good food which you can enjoy outside with fine views of the surrounding fells. They also provide good quality accommodation if you need to stay over. You can find the pub just south of the lake at postcode CA11 0NZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and the White Lion Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Lots of popular climbs can be started from Patterdale. The circular St Sunday Crag Walk is located to the south west and will take you up to the crag and to the pretty Grisdale Tarn and Grisedale Beck. There's also the climb up to the nearby Place Fell. The fell is located just to the north east of the village, and just to the east of the southern end of the lake. It's a popular one to do in the Ullswater area because of a fairly decent path and a gradual ascent. There are great views over the village and the lake to the Helvellyn Range from the summit. The village is located very close to Ullswater Lake. There's lots of good options here with the Glenridding to Aira Force Walk where there's a wonderful waterfall and woodland area. The Howtown to Glenridding Walk can also be picked up in nearby Glenridding. The easy trail follows the lakeshore to Howtown Pier where the Ullswater Steamer boats dock. Just to the west of the village there's the noteworthy Lanty's Tarn. The peaceful and secluded tarn is a lovely place to visit with fine views back down to the Ullswater on the climb up.  For more walking ideas in the area see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Gd2Jr83LVOk",
  "postcode": "CA11 0NN",
  "district": "Glenridding",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A592, Rooking, Glenridding, Patterdale, Westmorland and Furness, England, CA11 0NN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "lakes"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}