{
  "objectID": "261be4af8d326296957d4bf0490595e4",
  "created_at": "2024-12-18T16:58:08.174978+00:00",
  "ref": "dartmeet-walking-route",
  "title": "Dartmeet Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Dartmeet_-road_bridge_and_river_-_geograph.org.uk_-_643491.jpg",
  "nearby": [
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Princetown",
      "objectID": "e262f139bed90e80eb60a8565de92a2c",
      "ref": "princetown-walking-route"
    },
    {
      "description": "Two Bridges Dartmoor Walk",
      "objectID": "0e9ca17c212bd97239421f81cd18b50d",
      "ref": "two-bridges-dartmoor-walk-walking-route"
    },
    {
      "description": "Venford Reservoir",
      "objectID": "97f252c582b409010f6daf70209d4b57",
      "ref": "venford-reservoir-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/50170DBF563AD75B802583630067450B/$FILE/Dartmeet.gpx",
  "_geoloc": {
    "lat": 50.5435285956,
    "lng": -3.8756323712
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Dartmeet_-road_bridge_and_river_-_geograph.org.uk_-_643491.jpg",
      "title": "Colin Vosper / Dartmeet -road bridge and river",
      "caption": "Dartmeet - road bridge and river. Downstream from the two bridges at Dartmeet lies Huccaby Cleave, a location steeped in folklore where it's said that pixies reside in a cave. The tales of pixies in this area are believed to be a local invention, perhaps crafted to enhance the allure of Dartmeet. During the Victorian period, Dartmeet gained popularity as a scenic beauty spot, drawing visitors to its picturesque landscapes and, perhaps, to the enchanting stories of mythical beings like pixies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/The_clapper_bridge_at_Dartmeet_-_geograph.org.uk_-_1498681.jpg",
      "title": "Steve Daniels / The clapper bridge at Dartmeet",
      "caption": "The clapper bridge at Dartmeet. Dartmeet boasts two significant bridges—the ancient clapper bridge and the more recent road bridge constructed in 1792. Clapper bridges, such as the one at Dartmeet, are notoriously challenging to date accurately, with potential origins ranging from the Bronze Age to the medieval period. Historic England cautiously suggests that the Dartmeet bridge could date back to the 17th century 'or earlier'. This bridge features five spans, supported on piers and abutments made of natural stone boulders stacked on top of each other without mortar. Unfortunately, the central three clapper stones were washed away in a flood on August 4, 1826, leaving behind the stone piers. Surprisingly, the remaining two clapper stones closest to each bank of the river remain intact, enduring a second major flood in 1888. Clapper bridges are distinctive features in the Dartmoor landscape, characterised by their simplicity. These bridges are constructed by laying large, flat boulders on piers made of piled stones. The clapper-stones that stretch across the piers are typically massive and hefty, indicating that their installation required a significant communal effort. These bridges are often quite narrow, only allowing enough width for a packhorse or a lone traveler to pass. This design reflects the historical context and the practical needs of the communities in Dartmoor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Dartmoor%2C_East_Dart_looking_North_2007_-_geograph.org.uk_-_711115.jpg",
      "title": "Trevor Durritt LRPS [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Dartmoor, East Dart looking North. This image was taken just to the north of Dartmeet, a place where the West and East Dart rivers meet. The boulders in the water are granite. Dartmeet has historical significance as one of the boundary points described in the 1240 Perambulation of the Forest of Dartmoor. This ancient boundary traverses the East Dart from the Wallabrook and continues up the West Dart to the foot of the O Brook. Although not explicitly named in the 1240 document, Dartmeet was likely a notable landmark along this boundary. The first recorded mention of the name Dartmeet appears in a document from the Duchy of Cornwall dated 1616. This reflects its historical importance and continued relevance over the centuries. Halfway up Dartmeet Hill, near the road, you'll find the Coffin Stone. This stone served a practical purpose in history, being a resting place for bearers carrying coffins on their way to Widecombe-in-the-Moor for burial. The Coffin Stone is split along its length, and local legend attributes this division to a thunderbolt strike from God. According to the legend, a particularly wicked man's body was laid there, and God's disapproval led to the stone being split, destroying the coffin in the process."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Yar_Tor_-_geograph.org.uk_-_1410340.jpg",
      "title": "Derek Harper / Yar Tor",
      "caption": "Yar Tor. The hilltop tor straddles a gridline, but the highest point, marked by a cairn, is in SX6773. This view is from a path climbing from Dartmeet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Dartmeet_Bridge%2C_Dartmeet%2C_Devon_taken_1964_-_geograph.org.uk_-_774719.jpg",
      "title": "Christine Matthews / Dartmeet Bridge, Dartmeet, Devon taken 1964",
      "caption": "Dartmeet Bridge, Dartmeet, Devon taken 1964. Bridge and river with house in background. While strolling along the river, keep an eye out for a variety of dragonflies, damselflies, and butterflies. Some species you might encounter include the Golden-Ringed Dragonfly, Keeled Skimmer, and Small Pearl-Bordered Fritillary. If you're fortunate, you may even catch sight of a Kingfisher. Additionally, try to observe signs of otters, such as footprints in the sand or spraint on the rocks. The diverse wildlife along the riverbank adds to the charm of the natural surroundings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Yar_Tor_-_geograph.org.uk_-_1410364.jpg",
      "title": "Derek Harper / Yar Tor",
      "caption": "Yar Tor. Looking west from the southern area of the summit. Brimpts Farm, across the East Dart River can be seen on the left. Here you can visit the Tin Mine Display, created by the Dartmoor Tin Research Group and learn more about Tin Mining in the area.  Dartmoor has a significant historical legacy in tin exploitation, dating back to at least the 12th century and persisting through the 20th century. In the early stages, miners practiced 'tin streaming,' extracting tin ore from stream beds, which significantly altered the landscapes of Dartmoor's valleys. As these easily accessible sources were depleted, miners turned to ground mining, employing deep trenches and eventually delving into underground workings. During medieval times, the importance of tin mining grew, leading to the establishment of stannary towns around Dartmoor, serving as administrative centers to oversee the industry for the Crown. However, in the post-medieval period, tin mining experienced a decline. It underwent a revival in the Victorian era with the application of new technologies. Many mines were re-established during this time, and new ones were set up to exploit not only tin but also copper and iron resources. This period of industrial activity left a lasting impact on the Dartmoor landscape."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/The_Money_Pit_-_geograph.org.uk_-_1607675.jpg",
      "title": "Guy Wareham / The Money Pit",
      "caption": "The Money Pit. A cairn and cist known as the Money Pit on the south-east slopes of Yar Tor.  Yartor Down, dating back to the Middle Bronze Age (around 1,500 BC), housed a flourishing community on Dartmoor. The archaeological landscape is adorned with multiple hut circles and settlements, showcasing evidence of an extensive reave system. In Dartmoor terminology, a 'reave' refers to the remnants of field boundaries that constituted comprehensive systems delineating fields and enclosed settlements during the Bronze Age."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Unfenced_Dartmoor_road_leading_to_Dartmeet_-_geograph.org.uk_-_1106304.jpg",
      "title": "Ruth Sharville / Unfenced Dartmoor road leading to Dartmeet",
      "caption": "Unfenced Dartmoor road leading to Dartmeet"
    }
  ],
  "distance_km": 3.0,
  "description": "This circular walk visits the popular tourist spot of Dartmeet in the Dartmoor National Park. It's a lovely scenic area where the tributaries of the East Dart and West Dart meet. Highlights include a set of stepping stones and a picturesque clapper bridge which dates from the medieval period. There's also nice easy riverside paths along the river and a more challenging climb to the nearby Yar Tor to try from here. Start the walk from the Badger's Holt car park, next to the Dartmeet Bridge. From here you can follow footpaths north along the river before turning north east. The route then climbs to Yar Tor which stands at a height of 416 metres (1364 feet), providing fabulous views over the surrounding area. After taking in the views the route descends to a country lane where you pick up the Dartmoor Way long distance trail which runs through the area. Follow the trail west and it leads across Yar Tor Down to the car park. To continue your walking in the area head west along the Dartmoor Way to visit the pretty village of Princetown. Here you can visit Two Bridges, another popular beauty spot on Dartmoor. The atmospheric Wistman's Wood Nature Reserve is easily reachable from here.",
  "video_url": "https://www.youtube.com/embed/3VMM44c5SiE",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}