{
  "objectID": "263d3edaedbd061bfe1bad4fe84ace85",
  "created_at": "2024-12-18T16:38:33.167467+00:00",
  "ref": "brockham-walking-route",
  "title": "Brockham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/46/Brockham_Green%2C_Surrey%2C_old_cottages_by_All_Saints_Church_-_geograph.org.uk_-_525055.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/EBC9B0C716514BFB862587750045454E/$FILE/Brockham.gpx",
  "_geoloc": {
    "lat": 51.2318566279,
    "lng": -0.2865212305
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Brockham_Green%2C_Surrey%2C_old_cottages_by_All_Saints_Church_-_geograph.org.uk_-_525055.jpg",
      "title": "Dr Neil Clifton / Brockham Green, Surrey: old cottages by All Saints Church",
      "caption": "View south across part of Brockham Green, Surrey. On the left is Vicarage Cottage, which is probably 17th-century. On the right is All Saints' parish church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/The_%27Duke%27s_Head%27%2C_Brockham_Green%2C_Surrey_-_geograph.org.uk_-_517265.jpg",
      "title": "Dr Neil Clifton / The 'Duke's Head', Brockham Green, Surrey",
      "caption": "The 'Duke's Head', Brockham Green, Surrey.  The Duke portayed on the sign is of course the great Duke of Wellington, beside whom all other dukes are lesser men. Now the Inn on the Green."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Bridges_over_the_River_Mole%2C_Brockham%2C_Surrey_-_geograph.org.uk_-_525370.jpg",
      "title": "Dr Neil Clifton / Bridges over the River Mole, Brockham, Surrey",
      "caption": "Bridges over the River Mole, Brockham. Just north of Brockham Green are these two separate bridges: a single-track road bridge for cars, and a separate 'safe' footbridge for pedestrians."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/The_Borough%2C_Brockham%2C_Surrey_-_geograph.org.uk_-_525376.jpg",
      "title": "Dr Neil Clifton / The Borough, Brockham, Surrey",
      "caption": "The Borough, Brockham, Surrey. This lane leads westwards from just north of the bridge over the River Mole. The nearer cottages, with three storeys, are of interest. Perhaps the top storey was intended for some sort of home industry, although little light can have been admitted by the small dormer windows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Towards_Box_Hill_-_geograph.org.uk_-_1805314.jpg",
      "title": "Ian Capper / Towards Box Hill",
      "caption": "Towards Box Hill. Looking towards Box Hill from Betchworth Park Golf Course. The prominent house above the stand of trees is Boxhurst."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Box_Hill_-_geograph.org.uk_-_3048185.jpg",
      "title": "Box Hill by Ian Capper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Box Hill, Olympic Rings sculpture"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Denbies_Vineyard_-_geograph.org.uk_-_971360.jpg",
      "title": "Colin Smith / Denbies Vineyard",
      "caption": "Denbies Vineyard. A grassy bay on the western side of the Mole Gap with rows of vines."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Woodland_on_Ranmore_Common%2C_Surrey_-_geograph.org.uk_-_1395028.jpg",
      "title": "Peter Trimming / Woodland on Ranmore Common, Surrey",
      "caption": "Woodland on Ranmore Common, Surrey. Probably my favourite photograph from the walk. On much of Ranmore Common, the woodland is extremely dense; here, there are just sufficient breaks in the leaf canopy to let sunlight filter through."
    }
  ],
  "distance_km": 18.0,
  "description": "This award winning village sits in a fine spot in the Mole Valley of Surrey. It's a wonderful place for walkers with several major waymarked footpaths passing through the area. It's a picturesque place with a village green, pretty cottages and a fine old church to see. This circular walk from the village makes use of sections of the Greensand Way, the Mole Gap Trail and the North Downs Way to visit some of the highlights of the surrounding area. On the walk you'll pass the popular Box Hill Country Park, Brockham Quarry Nature Reserve, Denbies Hillside, Ranmore Common and the neighbouring town of Dorking. The walk starts in the village and first heads north to Betchworth Park, passing the golf course and Betchworth Castle. After crossing the railway line you will come to Brockham Quarry Nature Reserve. The interesting site was once the site of chalk extraction and the lime making industry during the Victorian Era. After exploring the quarry you come to Box Hill where there are miles of great woodland walking and cycling trails with fine views from the high points. You continue west past Westhumble to Denbies Hillside which contains wildflowers, wayamarked trails and an informative visitor centre and the largest vineyard in England. The route continues through the adjacent Ranmore Common where there's more peaceful woodland and open downland, with great views of the Surrey Hills. From here you head south along the Greensand Way to Westcott where you turn east past Bury Hill and the fishing lake. The final stretch takes you through Dorking town before returning to Brockham.",
  "video_url": "https://www.youtube.com/embed/W-kdv2GTZ8w",
  "postcode": "RH3 7JJ",
  "district": "Brockham",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}