{
  "created_at": "2025-01-06T18:51:14.402670+00:00",
  "objectID": "2646fd18ad9f2bf31fc75558c248a9a7",
  "ref": "beverley-westwood-walking-route",
  "title": "Beverley Westwood Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/52/Beverley_Westwood_Pasture_-_geograph.org.uk_-_1315341.jpg",
  "nearby": [
    {
      "description": "Beverley Twenty",
      "objectID": "e99aca0d27b8670b2206b288b4e1982a",
      "ref": "beverley-twenty-walking-route"
    },
    {
      "description": "Beverley Beck",
      "objectID": "6ec76a28677811f52f7a3ea0591f4986",
      "ref": "beverley-beck-walking-route"
    },
    {
      "description": "Walkington",
      "objectID": "3f03aa914b8babb63366b67f13becc7d",
      "ref": "walkington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2646fd18ad9f2bf31fc75558c248a9a7.gpx",
  "_geoloc": {
    "lat": 53.84365,
    "lng": -0.44043
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Beverley_Westwood_Pasture_-_geograph.org.uk_-_1315341.jpg",
      "title": "David Wright / Beverley Westwood Pasture",
      "caption": "Beverley Westwood Pasture"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Beverley_Westwood_IMG_1338.JPG_-_panoramio.jpg/512px-Beverley_Westwood_IMG_1338.JPG_-_panoramio.jpg",
      "title": "Paul Lakin, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Black Mill. The Black Mill holds a captivating history of its own. Around 1850, during the peak of agriculture, Westwood boasted six operational mills—five corn mills and one whiting mill. Originally, the exterior of the Black Mill was whitewashed, but it was later tarred, leading to its new nickname. Unfortunately, a fire in 1868 caused damage, leading to the dismantling of all the timber parts and working gear. Although the mill served as a dwelling until 1934, it now stands as a monument and a local landmark. An exhibition by East Ridings Museums on the Westwood highlights the site's significance in the hearts of local cricketers during the 19th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Beverley_Westwood_IMG_3661_-_panoramio.jpg/512px-Beverley_Westwood_IMG_3661_-_panoramio.jpg",
      "title": "Paul Lakin, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Buttercups in mid summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Westwood%2C_Beverley%2C_Yorkshire_%28geograph_5062642%29.jpg/512px-Westwood%2C_Beverley%2C_Yorkshire_%28geograph_5062642%29.jpg",
      "title": "Bernard Sharp / Westwood, Beverley, Yorkshire",
      "caption": "Lowson's Mill, or Westwood Mill, is first mentioned in 1802 when George Jakeman was permitted to have a cart-road (extant today) from Keldgate Road to the windmill he had erected in his close, adjoining but not actually part of the Westwood. It was a brick tower mill with five sails. The mill was dismantled in 1891 and today only the lower part of the tower remains. In this photograph, it is hidden from view by the private house far left, still known as Lowson's Mill. The white-painted buildings, originally part of the same close, are today semi-detached houses, being Westwood Mill and Westwood Mill Cottage respectively."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Beverley_Westwood_Common_Land_-_geograph.org.uk_-_514559.jpg",
      "title": "Andy Beecroft / Beverley Westwood Common Land",
      "caption": "Beverley Westwood Common Land. Beverley Minster can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Beverley_Westwood_Houses_-_geograph.org.uk_-_514779.jpg",
      "title": "Andy Beecroft / Beverley Westwood Houses",
      "caption": "Beverley Westwood Houses. St. Mary's Church towers behind them."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Coronation_Gardens%2C_Beverley_-_geograph.org.uk_-_878164.jpg",
      "title": "Andy Beecroft / Coronation Gardens, Beverley",
      "caption": "Coronation Gardens. Located east of the common these pretty gardens are also a fine place for a stroll."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Woolpack_Inn_on_Westwood_Road%2C_Beverley_-_geograph.org.uk_-_4392332.jpg/512px-Woolpack_Inn_on_Westwood_Road%2C_Beverley_-_geograph.org.uk_-_4392332.jpg",
      "title": "Woolpack Inn on Westwood Road, Beverley by Ian S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Woolpack Inn on Westwood Road, Beverley. A nice place for some post walk refreshments on the edge of the common."
    }
  ],
  "distance_km": 3.1,
  "description": "This walk explores a lovely area of common land in Beverley in East Riding of Yorkshire. The wide area of pasture includes some fine trails with countryside views and cows roaming freely through the area. You'll find Beverley Westwood on the western side of the town. The Cinder Path can be picked up just off York Road near the pretty Coronation Gardens which are also well worth a visit. Follow the path west and it will take you onto the common where you can enjoy fine views of the historic Black Mill (more information below). There are also views back to the famous Beverley Minster, St Mary's Church and the adjacent Beverley Racecourse to enjoy. The Beverley Twenty long distance footpath crosses the common. You could extend your walk by following the trail west through the countryside to visit the nearby village of Walkington .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There is a good Ice cream van located next to the off road parking at the site. If you fancy a pub lunch then The Woolpack is located on the eastern side of the common. Nestled on the periphery of the Westwood, the classic pub attracts a diverse crowd of drinkers, diners, and warmly welcomes both walkers and locals. A mere 10-minute stroll will take you to Beverley's bustling Saturday Market, while the expansive Beverley Westwood pastures are just a brief 5-minute walk away. The pub actively supports the local parkrun group, even hosting their monthly social gatherings. Originally fashioned from two cottages in the mid-19th century, The Woolpack exudes a charming character. The snug, a cosy nook that accommodates just a few patrons adds a touch of uniqueness. The pub prides itself on offering four real ales, perfectly complemented by a diverse and freshly prepared menu. Whether you're seeking a relaxing drink, a delightful meal, or a friendly atmosphere, The Woolpack aims to cater to a variety of tastes You can find them at 37 Westwood Rd, HU17 8EN."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is very popular with dog walkers. Please keep them on leads as there are many cows grazing and roaming on the pasture. The Woolpack mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Beverley boasts four pastures situated in various directions from the town. Along the river Hull, Figham and Swinemoor pastures are located to the east and southeast, while Westwood and Hurn form a large pasture to the east and southeast of the town. The chalk extracted from these pastures played a vital role in constructing the foundations of Beverley's streets and producing lime. Until 1812, the Corporation derived a consistent income from leasing out lime kilns on the Westwood. Local brick makers utilised clay from the area for brick production, with Beverley-made bricks used in notable structures like the North Bar in Beverley. Evidence of this historical industry can still be observed in the numerous hollows and pits that characterize the pasture. The Westwood hosts both a challenging golf course popular with visitors and a racecourse that attracts increasing interest, featuring various events and festivals throughout the year. The oversight of the pastures falls under the responsibility of the Pasture Masters, a group of elected individuals from the Freemen of Beverley each March. While the Pasture Act of 1836 clarified the Pasture Masters' authority to administer and enforce bylaws, it did not explicitly state the land's ownership. In 1978, the courts determined that the pastures were owned by the then Borough Council, and it is currently \"owned\" by the East Riding of Yorkshire Council."
    }
  ],
  "video_url": "https://www.youtube.com/embed/H4ndSqZdcJs?si=CuGNbRgoANYdTpLX",
  "postcode": "HU17 8GF",
  "district": "Beverley",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cinder Path, Beverley, East Riding of Yorkshire, England, HU17 8GF, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "pasture",
    "countryside"
  ],
  "points_of_interest": [
    "historic buildings",
    "views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}