{
  "created_at": "2025-01-06T04:34:42.331527+00:00",
  "objectID": "2708548407d44e49aee0a0884ca34ac7",
  "ref": "aira-force-walking-route",
  "title": "Aira Force Waterfall Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Entrance%2C_National_Trust_Car_Park_at_Aira_Force_-_geograph.org.uk_-_955543.jpg",
  "nearby": [
    {
      "description": "Ullswater Way",
      "objectID": "a3712da828190a2af557d545f046c7e7",
      "ref": "ullswater-way-walking-route"
    },
    {
      "description": "Glenridding to Aira Force Walk",
      "objectID": "607e66271108d8f8198c28b5bd44ec2c",
      "ref": "glenridding-to-aira-force-walk-walking-route"
    },
    {
      "description": "Howtown to Glenridding",
      "objectID": "608007b0dd65a569d9dbdd54a3616aa2",
      "ref": "howtown-to-glenridding-walking-route"
    },
    {
      "description": "Gowbarrow Fell",
      "objectID": "7d9a40260b5208f1ce6e7af92c9c3c79",
      "ref": "gowbarrow-fell-walking-route"
    },
    {
      "description": "Great Mell Fell",
      "objectID": "0d44d3cc52416d207910a9e85caf6c52",
      "ref": "great-mell-fell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2708548407d44e49aee0a0884ca34ac7.gpx",
  "_geoloc": {
    "lat": 54.5721902113,
    "lng": -2.9282952696
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Entrance%2C_National_Trust_Car_Park_at_Aira_Force_-_geograph.org.uk_-_955543.jpg",
      "title": "Trevor Harris / Entrance, National Trust Car Park at Aira Force",
      "caption": "Entrance, National Trust Car Park at Aira Force"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Bridge_over_Aira_Force_-_geograph.org.uk_-_530570.jpg",
      "title": "DS Pugh / Bridge over Aira Force",
      "caption": "Bridge over the falls. Lots of tourists looking down Aira force from this bridge above the drop. Poet William Wordsworth visited the falls many times. He was probably inspired to write his poem \"Daffodils\" when he observed daffodils growing on the shore of Ullswater near where Aira Beck enters the lake near Glencoyne Bay. The falls are mentioned in three Wordsworth poems, the most well known reference being in \"The Somnambulist\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Aira_Force_%28Ullswater%29_-_geograph.org.uk_-_176899.jpg",
      "title": "James Hearton / Aira Force (Ullswater)",
      "caption": "The falls and vegetation. An athmospheric shot with the light shining through the ravine"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Lower_bridge_at_Aira_Force_-_geograph.org.uk_-_4983004.jpg?20230623002843",
      "title": "Lower bridge at Aira Force by Sarah Charlesworth, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lower bridge. The area features two picturesque arched bridges. The first bridge spans the beck right before it plunges over the falls, providing a view from the top, while the second bridge is situated at the base of the waterfall. Both bridges were built in the early 20th century in honour of the Spring family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Aira_Force_Viewing_Area_-_geograph.org.uk_-_1222795.jpg/256px-Aira_Force_Viewing_Area_-_geograph.org.uk_-_1222795.jpg",
      "title": "Mick Garratt / Aira Force Viewing Area",
      "caption": "Aira Force Viewing Area. Looking down on the viewing area from the bridge over the top of the waterfall. The falls are located on National Trust land, part of the 750-acre Gowbarrow Park, acquired in 1906. The Trust provides facilities such as parking, disabled access, pathways, and viewing platforms, making it a popular site in the Lake District. There are also toilets, a café, and a visitor centre. A public footpath from Dockray leads to the waterfall, and a Wish Tree, where visitors embed coins into a fallen log, can be found along the route. In 2015, a jetty opened nearby for Ullswater 'Steamers', enhancing accessibility."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Path_to_Aira_Force_up_the_eastern_side_of_the_ravine%2C_Watermillock_township%2C_Matterdale_CP_-_geograph.org.uk_-_280234.jpg",
      "title": "Humphrey Bolton / Path to Aira Force up the eastern side of the ravine, Watermillock township, Matterdale CP",
      "caption": "Path to Aira Force up the eastern side of the ravine, Watermillock township, Matterdale CP. Here the path zigzags up onto the flank of Gowbarrow Park. The surrounding woodland has been enhanced with non-native trees like the Douglas fir, creating a picturesque Victorian-style parkland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Rapids_near_Aira_Force_Waterfall%2C_Ullswater_-_geograph.org.uk_-_916233.jpg",
      "title": "Emily Frankish / Rapids near Aira Force Waterfall, Ullswater",
      "caption": "Rapids near the falls"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Aira_Beck_-_geograph.org.uk_-_724088.jpg",
      "title": "Craig Allan / Aira Beck",
      "caption": "A long exposure shot of Aira Beck downstream from Aira Force."
    }
  ],
  "distance_km": 5.0,
  "description": "This walk visits the beautiful Aira Force waterfall next to Ullswater Lake in the Lake District National Park. The National Trust owned area is very popular and a must see if you're visiting this part of the National Park. You start off in the car park by the lake and then head through ancient woodland to the spectacular 65ft high waterfall. You can cross a bridge over the falls for fantastic views. You then head through Gowbarrow Park before reaching the lakeside where you can follow a waterside path back to the start point. As well as the splendid falls there's also a series of lovely woodland trails with Himalayan firs, red squirrels and views of the Aira Beck. The walk can be extended by picking up the Ullswater Way which runs past the falls. You could reach the falls by following the waymarked trail from nearby Glenridding or Patterdale as an alternative start point. See the Glenridding to Aira Force Walk for full details of this route. In Glenridding you can also pick up the Howtown to Glenridding Walk which is another major highlight of the area. Gowbarrow Fell sits just above the falls and is a great place to continue your walk. You can try our circular walk through Gowbarrow Park where you can enjoy wonderful views over the lake and surrounding fells.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a tea room on site where you can enjoy some refreshments after your walk. It's run by the National Trust and located close to the car park. There's a good menu and nice outdoor seating for finer days. Alternativley you could head into Glenridding where there's some great lakeside options. The Inn on the Lake does light lunches and afternoon teas and includes 15 acres of grounds with lawns sweeping to the shores of Lake Ullswater. It's a beautiful spot to sit out and enjoy a meal with wonderful views over the lake to the surrounding fells."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The falls and surrounding woods make for a fine dog walk though it's advised to please keep them on leads. The National Trust also provide water bowls around the car park and tea room."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head into Glenridding you could visit the Ullswater Information Centre. There's lots of good walking advice here with maps, guides and details of guided walks in the area. You can find the centre in the village at the Beckside Car Park with a postcode of CA11 0PD for your sat navs. A few miles north of the falls there's the climb to Great Mell Fell to try. The fell is owned by the National Trust and inlcudes some pleasant woodland trails with fine views from the 537 metre high summit. For more walking ideas in the area see the Lake District Walks page."
    },
    {
      "subtitle": "Visitor Reviews",
      "content": "\"Aira Force Waterfall is an absolute gem! The short walk from the car park is well worth it, with stunning views along the way. The falls themselves are breathtaking, especially when you can see them from the stone bridge above.\" \"Visiting Aira Force was a highlight of our trip to the Lake District. The sound of the cascading water is invigorating, and the surrounding woodland adds to the charm. Just be ready for some steps!\" \"Beautiful spot for a family outing! The paths are well maintained, making it accessible for most. The views of the falls from different angles are incredible—definitely bring your camera!\" \"I loved the peaceful atmosphere at Aira Force. It was easy to navigate, and the sight of the waterfall is spectacular. A perfect place for a picnic with plenty of scenic spots to choose from.\" \"Aira Force offers a lovely nature walk with a stunning waterfall as the main attraction. It's not overly challenging, but the steps can be steep, so wear good shoes. A must-visit if you're in the area!\""
    }
  ],
  "video_url": "https://www.youtube.com/embed/RayFwHoQ6tQ",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Aira Force, A592, Matterdale, Westmorland and Furness, England, CA11 0JS, United Kingdom",
  "postcode": "CA11 0JS",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lakeside",
    "mountain"
  ],
  "points_of_interest": [
    "waterfall",
    "views",
    "woodland trails",
    "lake views"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}