{
  "created_at": "2025-01-06T10:39:03.345032+00:00",
  "objectID": "2719938926f5cc8a8ece06ef0c09afdb",
  "ref": "chirk-aqueduct-walking-route",
  "title": "Chirk Aqueduct and Viaduct Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Chirk_Tunnel%2C_Shropshire_Union_Canal_%28geograph_4024229%29.jpg/512px-Chirk_Tunnel%2C_Shropshire_Union_Canal_%28geograph_4024229%29.jpg",
  "nearby": [
    {
      "description": "Llangollen Canal",
      "objectID": "17c628d8a920bec4f253febceb624514",
      "ref": "llangollen-canal-walking-and-cycle-route"
    },
    {
      "description": "Chirk Castle",
      "objectID": "c655ad75b91663f6b9f62d43b269491e",
      "ref": "chirk-castle-walking-and-cycle-route"
    },
    {
      "description": "Chirk to Llangollen Canal Walk",
      "objectID": "27d7d9883158727469de2ff72575736b",
      "ref": "chirk-to-llangollen-canal-walk-walking-route"
    },
    {
      "description": "Erbistock",
      "objectID": "a270605e3032a8797bda5ef8ed82e31c",
      "ref": "erbistock-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2719938926f5cc8a8ece06ef0c09afdb.gpx",
  "_geoloc": {
    "lat": 52.9328362865,
    "lng": -3.0668251611
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Chirk_Tunnel%2C_Shropshire_Union_Canal_%28geograph_4024229%29.jpg/512px-Chirk_Tunnel%2C_Shropshire_Union_Canal_%28geograph_4024229%29.jpg",
      "title": "El Pollock / Chirk Tunnel, Shropshire Union Canal",
      "caption": "Entering the Chirk Tunnel just north of the aqueduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Southern_portal_of_Chirk_canal_tunnel_-_geograph.org.uk_-_1293092.jpg",
      "title": "Richard Green / Southern portal of Chirk canal tunnel",
      "caption": "Southern portal of Chirk canal tunnel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Chirk_Aqueduct.jpg/512px-Chirk_Aqueduct.jpg",
      "title": "DeFacto, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Looking across the Chirk Aqueduct from the north. To the right is the later railway viaduct. The aqueduct was devised by civil engineer Thomas Telford for the Ellesmere Canal. M. Davidson, the resident engineer, oversaw its construction, also serving in the same capacity for several other projects by Telford. Construction commenced on 17 June 1796, with completion achieved in 1801. Enclosed within its masonry walls is a cast iron trough that holds the water. Inspired by Telford's innovative Longdon-on-Tern Aqueduct on the Shrewsbury Canal, this aqueduct served as a precursor to the Pontcysyllte Aqueduct on the Llangollen Canal. At the time of its completion, it briefly held the title of the tallest navigable aqueduct ever built. Presently, it holds Grade II* listed status in both England and Wales. It is part of the Pontcysyllte Aqueduct World Heritage Site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Aqueduct_and_viaduct_-_geograph.org.uk_-_874763.jpg",
      "title": "Row17 / Aqueduct & viaduct",
      "caption": "Aqueduct and viaduct. The viaduct carries the Shrewsbury–Chester line from the Welsh town of Chirk in historic Denbighshire from the north to the English village of Chirk Bank in Weston Rhyn, Shropshire to the south. The viaduct was engineered by Henry Robertson, the principal engineer of the Shrewsbury and Chester Railway, to traverse the meadows of the Vale of Ceiriog between Chirk and Chirk Bank, straddling both Wales and England. Construction took place between 1846 and 1848 under the supervision of Thomas Brassey, with additional work undertaken in 1858–1859. The structure, which originally featured ten arches, was intended to accommodate sixteen stone arches according to the initial design. However, due to engineering challenges concerning the river piers, the number of arches was reduced during construction. Originally, the design necessitated the construction of two piers into the slopes of the adjacent valleys. However, due to safety concerns and the unstable condition of the abutments of the neighbouring Chirk Aqueduct, this approach was deemed impractical and costly. Consequently, the design was modified, with the end piers of the viaduct transformed into abutments, and a lengthy 36.5-metre (120 ft) laminated timber arch constructed to connect to the stone viaduct. Subsequently, ten years later, the timber arches were replaced, and three stone arches were added at either end, restoring the total number of arches to sixteen as originally planned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/View_from_the_Chirk_canal_aqueduct_-_geograph.org.uk_-_4131453.jpg/512px-View_from_the_Chirk_canal_aqueduct_-_geograph.org.uk_-_4131453.jpg",
      "title": "View from the Chirk canal aqueduct by Humphrey Bolton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from the Chirk canal aqueduct. The aqueduct comprises ten arches, each spanning 40 feet (12 m). Positioned 65 feet (20 m) above the ground and 70 feet (21 m) above the River Ceiriog, it is constructed from yellow sandstone. William Hazledine supplied the ironwork for the aqueduct. Initially, iron plates were only installed at the base of the trough; however, in 1870, additional iron side plates were incorporated to address leakage issues. Adjacent to the north end of the Chirk Aqueduct, the Chirk Tunnel facilitates the canal's onward journey towards Llangollen. Subsequently, the Chirk Railway Viaduct was constructed parallel to the aqueduct, slightly surpassing it in height."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Chirk_Viaduct.jpg/512px-Chirk_Viaduct.jpg",
      "title": "Mike Faherty / Chirk Viaduct",
      "caption": "Chirk Viaduct. The viaduct, along with the Cefn Viaduct to the north, was constructed to cater to the growing demand for rail freight transport between Wrexham, Chester, and Shrewsbury, which the existing canal system could not adequately meet. The railway line became part of the Great Western Railway (GWR) in 1854 and was not converted to GWR's Broad gauge. The structure showcases rock-faced ashlar stone with yellow engineering brick lining its central section. Rising to a height of 30 metres (98 ft) above the river, the central portion comprises ten 13.7-metre (45 ft) elliptical semicircular arches flanked by pedimented abutments, completed in 1848. These central arches feature rock-faced pointed voussoirs, projecting keystones, and moulded imposts extending to the soffit, along with a modillioned cornice and a plain parapet. The abutments boast shallow pediments resting on corbelled cornices, accompanied by round-headed niches adorned with mounded impost bands and prominent moulded keystones. Additionally, three additional stone arches were introduced at each end in 1858–1859, replacing the previous 36.5-metre (120 ft) timber arches. Overall, the viaduct spans a length of 260 metres (850 ft)."
    }
  ],
  "distance_km": 1.6,
  "description": "This walk takes you to the Chirk Aqueduct and Viaduct in Wales. The Aqueduct is in a significant location, spanning two countries on the England-Wales border. The 18th century structure carries the Llangollen Canal across the Ceiriog Valley just to the south of the town. You can start the walk just west of the station on the canal. Here you can head south through the Chirk Tunnel towards both the Aqueduct and the Viaduct. From atop the Aqueduct you can enjoy wonderful views over the surrounding countryside of the River Ceiriog Valley. As you cross you will also enter England at the southern end. You can extend the walk by heading a short distance west to visit the historic Chirk Castle. The Chirk to Llangollen Canal Walk will take you north along the canal towpath to nearby Llangollen.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/d1GwU6QwqqA?start=16",
  "district": "Chirk",
  "county": "Wrexham",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Twnell Y Waun / Chirk Tunnel, Castle Road, Rhosywaun, Chirk, Wrexham, Cymru / Wales, LL14 5BQ, United Kingdom",
  "postcode": "LL14 5BQ",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal towpath",
    "rural"
  ],
  "points_of_interest": [
    "historic castle",
    "canal"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}