{
  "created_at": "2025-01-06T10:40:12.165640+00:00",
  "objectID": "276c730b23db01dc4a2f7c7096f2ae3f",
  "ref": "golspie-big-burn-walking-route",
  "title": "Golspie Big Burn Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Small_Waterfall_in_the_Big_Burn%2C_Golspie%2C_Sutherland_-_geograph.org.uk_-_5607520.jpg/512px-Small_Waterfall_in_the_Big_Burn%2C_Golspie%2C_Sutherland_-_geograph.org.uk_-_5607520.jpg",
  "nearby": [
    {
      "description": "Ben Bhraggie",
      "objectID": "3c45bd08e36be6fbf93b03d8757d1c8d",
      "ref": "ben-bhraggie-walking-route"
    },
    {
      "description": "Falls of Shin",
      "objectID": "fe12f5092e7dbcbdf0e455ef84eb147d",
      "ref": "falls-of-shin-walking-route"
    },
    {
      "description": "Loch Brora",
      "objectID": "b21db038b9c5839992b18ff1f1480a2c",
      "ref": "loch-brora-walking-route"
    },
    {
      "description": "Loch Fleet",
      "objectID": "8f2e9548e222fbf350bf7e3b1ad97d1d",
      "ref": "loch-fleet-walking-route"
    },
    {
      "description": "Lairg",
      "objectID": "aef4d5c6c5393e6c70fe2b554931c022",
      "ref": "lairg-walking-route"
    },
    {
      "description": "Dornoch to Embo",
      "objectID": "f6e255ae183523fbf78446935adfcce4",
      "ref": "dornoch-to-embo-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/276c730b23db01dc4a2f7c7096f2ae3f.gpx",
  "_geoloc": {
    "lat": 57.9860212901,
    "lng": -3.9691566237
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Small_Waterfall_in_the_Big_Burn%2C_Golspie%2C_Sutherland_-_geograph.org.uk_-_5607520.jpg/512px-Small_Waterfall_in_the_Big_Burn%2C_Golspie%2C_Sutherland_-_geograph.org.uk_-_5607520.jpg",
      "title": "Small Waterfall in the Big Burn, Golspie, Sutherland by Andrew Tryon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Small Waterfall in the Big Burn, Golspie, Sutherland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Golspie_Big_Burn_Walk_-_geograph.org.uk_-_5313870.jpg",
      "title": "Golspie Big Burn Walk by valenta, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Golspie Big Burn Walk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Golspie_Mill%2C_Sutherland_-_geograph.org.uk_-_1356.jpg",
      "title": "Dorcas Sinclair / Golspie Mill, Sutherland",
      "caption": "Golspie Mill, Sutherland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Big_Burn%2C_Golspie_-_geograph.org.uk_-_1885402.jpg",
      "title": "Big Burn, Golspie by sylvia duckworth, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Big Burn, Golspie"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Golspie_Harbour_-_geograph.org.uk_-_5784777.jpg",
      "title": "Golspie Harbour by valenta, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Golspie Harbour. Golspie is an attractive little seaside resort situated just 10 miles north of Dornoch. The village of Golspie boasts a lovely long sandy beach and there are a number of great scenic walks around the area including one at the Big Burn with its spectacular waterfalls. There are a number of historic buildings too, including St Andrews Church dating from the 16th century and the magical fairytale building which is Dunrobin Castle. This is one of the grandest houses in the north of Scotland and is situated just north of the village. The village has its own golf course and bowling club as well as tennis courts, and it also boasts its own swimming pool with fitness facilities. There are also many opportunities for loch and sea angling in the area. One unusual sporting venue is the local kart track which sees race meetings take place throughout the summer months. The latest addition to Golspie’s list of sporting attractions is the Highland Wildcat mountain bike trails. These have been designed for all levels of experience with different routes suitable for families and novices through to more difficult and technical trails for experienced mountain bikers. The most difficult trail features the longest free ride descent in Britain down from the summit of Ben Bhraggie. The village has a good range of local services including a number of shops and cafes. There is plenty of accommodation with several hotels in the village as well as B&Bs, guest houses and self-catering establishments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Dunrobin_Castle_Gardens.jpg/512px-Dunrobin_Castle_Gardens.jpg",
      "title": "Jooniur, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Dunrobin Castle Gardens. The gardens were laid out in 1850 by the architect Sir Charles Barry, who was responsible for the Victorian extension to the Castle and who designed the Houses of Parliament. Inspiration came from the Palace of Versailles in Paris, and they have changed little in the 150 years since they were planted, although new plants are constantly being introduced. Despite its northerly location, the sheltered gardens are able to support a surprising range of plants, including at the foot of the steps leading to the garden a huge clump of Gunnera manicata, a native rhubarb of South America that has eight-foot leaves! The castle is the most northerly of Scotland's great houses and the largest in the Northern Highlands with 189 rooms. It is also one of Britain's oldest continuously inhabited houses dating back to the early 1300s, home to the Earls and later, the Dukes of Sutherland. The structure, which resembles a French château with its towering conical spires, has seen the architectural influences of Sir Charles Barry, who designed London’s Houses of Parliament, and Scotland’s own Sir Robert Lorimer. The site was used as a naval hospital during the First World War and as a boys’ boarding school from 1965 to 1972. Dunrobin Castle is on the east coast of the Northern Highlands overlooking the Moray Firth, just north of the villages of Golspie and Dornoch (famous for its cathedral and Royal Dornoch Golf Club)."
    }
  ],
  "distance_km": 3.0,
  "description": "This delightful circular walk takes you through a lovely wooded gorge in Golspie, Sutherland. You'll follow trails along the Golspie Burn with footbridges, waterfalls and ponds. There's also an information board detailing the flora and fauna you can see on the trail. This includes wren, robin, buzzard, willow warbler, and badger. There is a handy car park right next to the trail where you can start your walk. It's a fairly easy walk but if you fancy something a bit more challenging you could head north west to Ben Bhraggie. Here you will find the Sutherland monument and some wonderful views over the area. The gorge also borders the historic Dunrobin Castle which lies just to the east. The 14th century castle has a fascinating history and some beautiful gardens to explore.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/0YEBMVAJfQg?si=LA7ZFZLX8vOPPhwf",
  "district": "Golspie",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Big Burn Walk, Backies, Golspie, Highland, Alba / Scotland, KW10 6RZ, United Kingdom",
  "postcode": "KW10 6RZ",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}