{
  "created_at": "2025-01-06T00:21:39.833494+00:00",
  "objectID": "27c22b8c3ab40d27b053a9bb80337b34",
  "ref": "minster-way-walking-route",
  "title": "Minster Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/de/On_the_Minster_Way_-_geograph.org.uk_-_10759.jpg",
  "nearby": [
    {
      "description": "Millington Woods",
      "objectID": "d2ecadc83a2be47aca2864734ae24bd2",
      "ref": "millington-woods-walking-route"
    },
    {
      "description": "Huggate",
      "objectID": "c67690915badf964f4a5ceb167596fbf",
      "ref": "huggate-walking-route"
    },
    {
      "description": "Bishop Wilton",
      "objectID": "6902a986cb9a6dbbfe62f47fe9a5863c",
      "ref": "bishop-wilton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/27c22b8c3ab40d27b053a9bb80337b34.gpx",
  "_geoloc": {
    "lat": 53.8397419003,
    "lng": -0.4235448819
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/On_the_Minster_Way_-_geograph.org.uk_-_10759.jpg",
      "title": "Andy Beecroft / On the Minster Way",
      "caption": "On the Minster Way, north east of Millington, East Riding of Yorkshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Minster_Way_-_geograph.org.uk_-_9113.jpg",
      "title": "Ian Lavender / Minster Way",
      "caption": "South of Huggate. Here the trail follows the high ground to the right, a private track goes to the left towards Santoft and Golden Valley Plantations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/The_Minster_Way_-_geograph.org.uk_-_252281.jpg",
      "title": "Andy Beecroft / The Minster Way",
      "caption": "East of Leconfield. Part of the footpath next to the Hull to Scarborough Railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/The_Minster_Way_-_geograph.org.uk_-_1420891.jpg",
      "title": "Dr Patty McAlpin / The Minster Way",
      "caption": "Bishop Wilton. This shows the footpath of the coincident Minster and Chalkland Ways where it leaves the minor road from Bishop Wilton to Pocklington to ascend South Cliff, heading towards Great Givendale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Pond_along_the_Minster_Way_-_geograph.org.uk_-_664020.jpg",
      "title": "Matthew Blurton / Pond along the Minster Way",
      "caption": "North Dalton. Small pond next to the footpath. Looking south-east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/The_Minster_Way%2C_Arram_-_geograph.org.uk_-_919670.jpg",
      "title": "Paul Glazzard / The Minster Way, Arram",
      "caption": "Sheep at Arram. Looking south on the public footpath along Catchwater Drain between Leconfield Airfield and the Beverley to Driffield railway line south of Arram station. The trail is a fifty mile walking route between the Minsters of Beverley and York which was established in 1980 by the East Yorkshire & Derwent Area of The Ramblers' Association."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/The_Minster_Way_at_Great_Givendale_-_geograph.org.uk_-_1420816.jpg",
      "title": "Dr Patty McAlpin / The Minster Way at Great Givendale",
      "caption": "This shows the start of the footpath from Givendale Lane at Great Givendale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Minster_Way_Trail_at_TA0302045979_-_geograph.org.uk_-_45986.jpg",
      "title": "Stephen Horncastle / Minster Way Trail at TA0302045979",
      "caption": "North east of Scorborough. Looking south along the drain which runs parallel with the rail track in this grid square. This view from the bridge over the drain which is in the top NW corner of the square."
    }
  ],
  "distance_km": 80.0,
  "description": "This splendid walk runs between the well known minsters at Beverley and York, visiting Arram, Scorborough, North Dalton, Lockington, Millington, Great Givendale, Bishop Wilton, Full Sutton, Stamford Bridge, Kexby and Fulford. The path crosses the chalk hills of the Yorkshire Wolds, as well as a wide variety of beautiful East Yorkshire countryside. Highlights include delightful waterside stretches along the River Derwent and along the River Ouse into York. You'll also pass the pretty Millington Woods at Millington. The site consists of the best ancient ash woods in the Yorkshire Wolds. The route is waymarked by white symbols depicting a view of an ecclesiastical building representing the two minsters and the words 'Minster Way'.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the little village of Millington you can visit the charming Gait Inn for some refreshments on the route. The pub has a delightful large garden area to relax in on warmer days. There's a good selection of drinks, a fine menu and a friendly atmosphere too. The pub also has an interesting history, dating from the 16th century. They provide accommodation in the shape of two pretty cottages so you can stay over if you need to. You can find the pub in the pretty little village with a postcode of YO42 1TY for your sat navs. In Bishop Wilton there's the Fleece Inn. They serve good food and have a nice garden area for warmer days. You can find them on the Main Street at postcode YO42 1RU. The pretty village is also worth exploring with a Grade I listed medieval church and the highest point in the Wolds at the nearby Garrowby Hill."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You'll pass close to Pocklington where we recommend a visit to the very pretty Burnby Hall Gardens. It's a lovely place for an afternoon stroll with landscaped gardens and two lakes. The park is notable for over 100 types of water lilies displayed in the lakes where you can also feed the fish. There's also an ornamental bridge, a Victorian Garden, an Aviary Garden, a newly restored Edwardian Rock Garden, a Stumpery, and a Birch Walk, the latter being the most recent horticultural addition. You can find out about the history of the area in the Stewart Museum. It houses a fascinating collection of artefacts collected by Major Stewart on eight world tours that were undertaken between 1906 and 1926, several of which have been deemed by UNESCO as being of national and international importance. Afterwards visit the cafe where you can enjoy refreshments with a view. You can find the park in the town centre with a postcode of YO42 2QF for your sat navs.  Burnby Hall - Victorian Gardens and Dragonfly Pond Just to the south east of York the trail passes very close to Wheldrake Woods. The peaceful woods are a nice place for a quiet stroll with lots of woodland birds and deer to look out for. For more walking ideas in the area see the Yorkshire Walks and Yorkshire Wolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_Bi0sjrunV8",
  "district": "Beverley",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Friary Garden, The Cloisters, Beverley, East Riding of Yorkshire, England, HU17 0HE, United Kingdom",
  "postcode": "HU17 0HE",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "chalk hills",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature trails"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}