{
  "created_at": "2025-01-05T23:54:26.422111+00:00",
  "objectID": "27f732753fb9f6ec15cbf045f6f023ad",
  "ref": "oversley-wood-walking-route",
  "title": "Oversley Wood Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/94/Oversley_Wood_-_geograph.org.uk_-_134313.jpg",
  "nearby": [
    {
      "description": "Alcester",
      "objectID": "c5c59b4005542cbd9bab046e13e03fa5",
      "ref": "alcester-walking-route"
    },
    {
      "description": "Arden Way",
      "objectID": "d94b2b4f2ec4d866bd306d675ef5dc1f",
      "ref": "arden-way-walking-route"
    },
    {
      "description": "Bidford on Avon",
      "objectID": "46c92f5516cb6cc5cf90bbae218b6ae4",
      "ref": "bidford-on-avon-walking-route"
    },
    {
      "description": "Inkberrow",
      "objectID": "ea4cef247c3a2bec8cb09b21846498f3",
      "ref": "inkberrow-walking-route"
    },
    {
      "description": "Ragley Hall",
      "objectID": "0faa82fe06a483d088bc8d10c4f623a6",
      "ref": "ragley-hall-walking-route"
    },
    {
      "description": "Flyford Flavell",
      "objectID": "07c4e951c1b68c9d585b244c500fc7a6",
      "ref": "flyford-flavell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/27f732753fb9f6ec15cbf045f6f023ad.gpx",
  "_geoloc": {
    "lat": 52.2082905692,
    "lng": -1.8404775251
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Oversley_Wood_-_geograph.org.uk_-_134313.jpg",
      "title": "David Stowell / Oversley Wood, via Wikimedia Commons",
      "caption": "Looking SSE toward the wood on top of the hill from the Alcester Bypass."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Oversley_Wood_-_geograph.org.uk_-_128744.jpg",
      "title": "David Stowell / Oversley Wood, via Wikimedia Commons",
      "caption": "Oversley Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Farmland_between_Oversley_Wood_and_Grove_Hill_-_geograph.org.uk_-_888984.jpg",
      "title": "Claire Seyler / Farmland between Oversley Wood and Grove Hill, via Wikimedia Commons",
      "caption": "Farmland between Oversley Wood and Grove Hill Viewed from the top of the open access land on Grove Hill"
    }
  ],
  "distance_km": 3.5,
  "description": "Follow the woodland trails through the delightful forest on this circular walk in Alcester. The woods are located just to the south of Alcester. You can easily reach them from the town by following the Arden Way over the River Arrow and past Oversley Green. There's also a car park in the north eastern corner just off the A46. This will give you access to miles of good woodland trails. It's great in the spring and summer with lots of bluebells and wildflowers to enjoy. Look out for butterflies, badgers and lots of birdlife as you make your way through the woods. To extend your walk you can continue along the Arden Way towards Upton and Walcote.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Alcester and visit The Moat House Inn for some refreshments after your walk. The pub has a lovely large garden area where you can even hire a teepee. It's a lovely place to relax on a warm summer day. The menu is also very good and there's nice cosy fires indoors for colder days. You can find the pub on Birmingham Rd with a postcode of B49 5QF for sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are a great place for a dog walk and there are some off lead areas too. The Moat House mentioned above is also dog friendly and will provide a water bowl for your pooch."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head just a mile west of the woods and you could visit Ragley Hall. The fine stately home dates from the 17th century and is surrounded by attractive parklands and gardens. The hall is not open a daily basis but often has open days which provide an opportunity to explore the estate. For example the Snowdrop walk in the winter months allows you to explore the 26 acres of formal gardens and see the multitude of snowdrop varieties. Just a few miles to the south there's the lovely riverside village of Bidford on Avon to visit. The Saxon settlement includes a Grade I listed bridge dating from the early 15th century and Big Meadow, a 26 acre recreational park next to the river. To the west is the village of Inkberrow. It's a worthy place to visit with a picturesque village green, a historic church and a fine 16th century pub. The settlement is also notable as the model for Ambridge, the setting of BBC Radio 4's long-running series The Archers. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "postcode": "B49 6LR",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Alcester, Upton, Stratford-on-Avon, Warwickshire, England, B49 6LR, United Kingdom",
  "district": "Stratford-on-Avon",
  "state": "England"
}