{
  "objectID": "286b48eeefedb421f682c27a64dbf79f",
  "created_at": "2024-12-18T13:33:27.772819+00:00",
  "ref": "tavistock-canal-walking-route",
  "title": "Tavistock Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Tavistock%2C_Tavistock_Canal_-_geograph.org.uk_-_715513.jpg",
  "nearby": [
    {
      "description": "Grenofen Bridge to Double Waters",
      "objectID": "84714176f168ece32670baf07fcec86c",
      "ref": "grenofen-bridge-to-double-waters-walking-route"
    },
    {
      "description": "West Devon Way",
      "objectID": "7743b069899a3f6f411a29a8707273a7",
      "ref": "west-devon-way-walking-route"
    },
    {
      "description": "Abbot's Way",
      "objectID": "d9f4cb8d57bdeea1fdfe3d8949ee261e",
      "ref": "abbots-way-walking-route"
    },
    {
      "description": "Tavistock Viaduct",
      "objectID": "966fb5347d359632edb88a2f0af974c0",
      "ref": "tavistock-viaduct-walking-route"
    },
    {
      "description": "Peter Tavy",
      "objectID": "ab6ec6f3e4892d9c80202d3ac547409d",
      "ref": "peter-tavy-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/7D775CF1B1F4D66E80257FAC002FE55D/$FILE/Tavistock Canal.gpx",
  "_geoloc": {
    "lat": 50.5492667716,
    "lng": -4.1447707868
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Tavistock%2C_Tavistock_Canal_-_geograph.org.uk_-_715513.jpg",
      "title": "Martin Bodman / Tavistock: Tavistock Canal",
      "caption": "View of the tree lined canal just south of Tavistock. It's 4.5 miles long, of which 1.5 miles are in tunnel under Morwell Down: the canal was officially opened in 1817, after 14 years work. Steam engines and waterwheels cast in ironfoundries in the town were exported on the canal to Cornwall via Morwellham Quay and the river Tamar. The canal has a fall of about 1 foot per mile, which allows water from the river Tavy to flow towards Morwellham: the canal water once powered waterwheels along the route"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/The_Tavistock_Canal_-_geograph.org.uk_-_6092.jpg",
      "title": "David Stowell / The Tavistock Canal",
      "caption": "Nice view of the surfaced footpath along the canal. This former navigation is now the feeder to one of the smallest commercial hydro-electric power stations in the South West."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/The_Tavistock_Canal_-_geograph.org.uk_-_332566.jpg",
      "title": "Tony Atkin / The Tavistock Canal",
      "caption": "This canal linked Tavistock with the Tamar port of Morwellham in the early part of the 19th century and was used to carry copper ore and other heavy goods, which all ended in 1859 when Tavistock was linked to the railway network. The canal is now used as one of the water supplies for the Morwellham Hydro Electric plant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Tavistock_Canal_in_the_Meadows_-_geograph.org.uk_-_332593.jpg",
      "title": "Tony Atkin / Tavistock Canal in the Meadows",
      "caption": "Lovely view of the canal as it flows through The Meadows. he Meadows is Tavistock's main recreation park near the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Tavistock%2C_River_Tavy_and_Abbey_Bridge_-_geograph.org.uk_-_1027419.jpg",
      "title": "Nigel Cox / Tavistock: River Tavy and Abbey Bridge",
      "caption": "River Tavy and Abbey Bridge. This is located at the start of the walk where the canal and river meet. Quoting from the Devon County Council's plaque on Abbey Bridge:-\n\"A mediaeval bridge here served Tavistock Abbey. It was replaced in 1763 to accommodate the new turnpike road system. This bridge was widened in 1860 to carry increased traffic following the opening of the Great Western Railway station nearby.\"\nToday it carries the A386 road to and from Okehampton into the town centre.\nOn the left is the intake from the River Tavy that feeds the Tavistock Canal which has served Morwellham hydro power station since 1934. In 2008 a new automatic screening mechanism was installed (the green and grey shovel-like structure) that will prevent salmon smolts from entering the canal and becoming trapped, instead allowing them to swim down the Tavy to the sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/The_Meadows_-_geograph.org.uk_-_1353746.jpg",
      "title": "jeff collins / The Meadows",
      "caption": "The Meadows. The area known as the Meadows, is the main park in Tavistock.Here the small Bandstand can be seen,with the children's play area in the background.The park is situated between the river Tavy and the Canal. You could take a small detour from the route to explore the footpaths in this pleasant park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Stable_range%2C_Crowndale_Farm_-_geograph.org.uk_-_5953803.jpg/512px-Stable_range%2C_Crowndale_Farm_-_geograph.org.uk_-_5953803.jpg",
      "title": "Stable range, Crowndale Farm by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Stable range, Crowndale Farm. The Grade II listed barn here is located at Crowndale Farm on Crowndale Road, which forms an important piece of Tavistock’s agricultural history. The farm itself dates from before the 16th century and was the birthplace of Tavistock’s favourite seafarer Sir Francis Drake. His parents, Edmund and Mary, were tenant farmers who leased the property from Francis, second Earl of Bedford. The ruins of the farmhouse where Sir Francis Drake was born still lie at Crowndale Farm to this day. Drake is best known for his circumnavigation of the world in a single expedition between 1577 and 1580 in his ship The Golden Hind. In 1588 he was part of the fight against the Spanish Armada as a vice-admiral."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Lumburn_lifting_bridge_-_geograph.org.uk_-_4980064.jpg/512px-Lumburn_lifting_bridge_-_geograph.org.uk_-_4980064.jpg",
      "title": "Lumburn lifting bridge by Guy Wareham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lumburn lifting bridge"
    }
  ],
  "distance_km": 4.5,
  "description": "Enjoy a peaceful stroll along the towpath of the Tavistock Canal on this easy walk in West Devon. The route starts at Tavistock Wharf and heads through the outskirts of the town towards Crowndale Farm, passing West Bridge on the way. You continue to the pretty Shillamill Aqueduct before finishing at Lumburn where the canal meets the River Lumburn. Along the way you will pass pretty locks, canalside cottages and old stone bridges. There are also sections through woodland and great views of the surrounding Devon countryside. If you'd like to continue your waterside walking in this area then you could head to the nearby Grenofen Bridge and visit Double Waters where the River Tavy meet the River Walkham. You could also pick up the West Devon Way which passes through Tavistock. The Abbot's Way long distance trail will take you from the ruins of Tavistock Abbey to Buckfast Abbey, 22 miles to the east of the town.",
  "video_url": "https://www.youtube.com/embed/fJbJM3dYDXc",
  "postcode": "PL19 8BB",
  "district": "Tavistock",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}