{
  "created_at": "2025-01-06T04:13:15.237941+00:00",
  "objectID": "28a9e6a1b2b0d111b23365fdc7d14509",
  "ref": "luxulyan-valley-walking-route",
  "title": "Luxulyan Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Luxulyan_valley_-_geograph.org.uk_-_43645.jpg",
  "nearby": [
    {
      "description": "Saints Way",
      "objectID": "8d883d251886cb93951db47f4c100ddb",
      "ref": "saints-way-walking-route"
    },
    {
      "description": "Helman Tor",
      "objectID": "2956a00a7723ca895f02b04b938012ea",
      "ref": "helman-tor-walking-route"
    },
    {
      "description": "St Austell",
      "objectID": "98d74e84776e6797473d79b3f91c678e",
      "ref": "st-austell-walking-route"
    },
    {
      "description": "Lostwithiel",
      "objectID": "eeccb8a03a4896cadd4b486b56675623",
      "ref": "lostwithiel-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/28a9e6a1b2b0d111b23365fdc7d14509.gpx",
  "_geoloc": {
    "lat": 50.383253351,
    "lng": -4.7323605152
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Luxulyan_valley_-_geograph.org.uk_-_43645.jpg",
      "title": "Ron Strutt / Luxulyan valley",
      "caption": "The Luxulyan valley is packed with reminders of the industrial history of the area, all of it now merging into the lush greenery. A group has been set up to help protect the valley's unique, unspoilt characteristics"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Leat_in_Luxulyan_Valley_-_geograph.org.uk_-_567069.jpg",
      "title": "Tony Atkin / Leat in Luxulyan Valley",
      "caption": "Leat in the valley. This leat is the lower of two which run along the eastern side of the valley. At this point it is some 30 metres above the valley floor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Treffry_Viaduct%2C_Luxulyan%2C_Cornwall_%28geograph_4030541%29.jpg/512px-Treffry_Viaduct%2C_Luxulyan%2C_Cornwall_%28geograph_4030541%29.jpg",
      "title": "Mary Williams / Treffry Viaduct, Luxulyan, Cornwall",
      "caption": "Treffrey's Viaduct, 650 feet long and 100 feet high, dominates the beautiful, lush Luxulyan valley. Built in 1842, it was the first all stone viaduct in Cornwall. Not only did it carry the rails of a tramway from Bugle to near St Blazey, but there was also an aqueduct beneath the tramway deck, part of a system of leats used to power machinery further down the valley. You can walk across the viaduct and see the water flowing underneath the stone decking. The tramway closed when the present Newquay railway (which runs under the viaduct) replaced it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Treffry_Viaduct_2.jpg",
      "title": "Crispin Purdye, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path along the viaduct. The structure dominates the beautiful, lush Luxulyan valley. This is the trackbed on the top of the viaduct looking north west towards Luxulyan, taken in 1979"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Lanlivery%2C_river_below_the_Treffry_Viaduct_-_geograph.org.uk_-_95335.jpg",
      "title": "Martin Bodman / Lanlivery: river below the Treffry Viaduct",
      "caption": "Lanlivery: river below the Treffry Viaduct. In the Luxulyan valley, one with numerous granite boulders."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/East_of_Luxulyan_-_geograph.org.uk_-_566351.jpg",
      "title": "Tony Atkin / East of Luxulyan",
      "caption": "East of Luxulyan. On the eastern edge of the village the land dips down towards the valley floor. Across the fields are what looks like a development of holiday chalets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Wooded_Valley_south_of_Trevanney_Farm_-_geograph.org.uk_-_565506.jpg",
      "title": "Tony Atkin / Wooded Valley south of Trevanney Farm",
      "caption": "Wooded Valley south of Trevanney Farm. The photograph shows the Saint's Way Footpath as it traverses the valley bottom."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Cottages_in_Luxulyan_-_geograph.org.uk_-_566344.jpg",
      "title": "Tony Atkin / Cottages in Luxulyan",
      "caption": "Cottages in Luxulyan village"
    }
  ],
  "distance_km": 9.1,
  "description": "This walk explores the Luxulyan Valley in Cornwall, near the towns of St Austell and Lostwithiel. The area is designated as a World Heritage Site due to the series of 19th century industrial remains that can be found here. It's one of the highlights of the area and a popular place for a walk with decent footpaths running through the densley wooded valley of the River Par. The valley is particularly lovely during the spring months when you can see carpets of bluebells in the woods. This circular walk takes you through the valley, visiting the Treffry Viaduct, Prideaux Woods and the village of Luxulyan. The walk starts from the Luxulyan Valley car park, which is located just to the south east of Luxulyan village. From here you can pick up footpaths heading south through the woodland towards Ponts Mill where there is an alternative car park. You continue south to Porcupine and Kilhallon where you pick up the Saints Way around St Blazey. Follow the waymarked footpath north along the edge of the Prideaux Wood Nature Reserve and Warren Wood. The trail continues north past Trevanney Wood before crossing the Treffry Viaduct to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into the village and you can enjoy some post walk refreshment at the Kings Arms. The classic granite pub serves good food and has an outdoor area for warmer days. You can find the inn at Rosevale Gardens, Bridges PL30 5EF."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As you'd imagine the woodland trails are ideal for dog walking. You will probably meet other owners on a fine day. The Kings Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head north along the Saints Way and enjoy a climb to Helman Tor. There's some excellent views from the summit and the adjacent Breney Common Nature Reserve to explore here. The famous Eden Project is less than 2 miles to the west and well worth a visit. The popular attraction includes wonderful botanical gardens with thousands of plant species."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UuuxWC2WmIA",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Higher Tramway, Lanlivery, Luxulyan, Cornwall, England, PL24 2SS, United Kingdom",
  "postcode": "PL24 2SS",
  "district": "Luxulyan",
  "state": "England"
}