{
  "created_at": "2025-01-06T02:26:01.838105+00:00",
  "objectID": "2906f1ae45252b4221a5ad370596a8b4",
  "ref": "shipston-on-stour-walking-route",
  "title": "Shipston on Stour Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/48/River_Stour%2C_Shipston_on_Stour_-_geograph.org.uk_-_318457.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2906f1ae45252b4221a5ad370596a8b4.gpx",
  "_geoloc": {
    "lat": 52.0634135491,
    "lng": -1.6240892504
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/River_Stour%2C_Shipston_on_Stour_-_geograph.org.uk_-_318457.jpg",
      "title": "Stephen McKay / River Stour, Shipston on Stour",
      "caption": "River Stour, Shipston on Stour. The name Shipston is a derivation of Sheepwashtown, a saxon settlement by a ford that was used as a sheep wash. There is no ford here now, but this old bridge carries the B4035 to Banbury over the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/River_Stour_-_geograph.org.uk_-_59985.jpg",
      "title": "John Smith / River Stour",
      "caption": "Part of the River Stour at Fell Mill. This spot is located just to the north east of the town on the Centenary Way.There's nice views of the river and the surrounding Warwickshire countryside here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Bridge_over_the_mill_stream_-_geograph.org.uk_-_59988.jpg",
      "title": "John Smith / Bridge over the mill stream",
      "caption": "Bridge over the mill stream. Footbridge forming part of The Centenary Way at Fell Mill, River Stour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Honington%2C_village_street_-_geograph.org.uk_-_1633832.jpg",
      "title": "John Brightley / Honington: village street",
      "caption": "Honington: village street. It is quite unusual in Warwickshire to find a village street like this with such wide grass verges."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Honington_Hall_-_geograph.org.uk_-_1633777.jpg",
      "title": "John Brightley / Honington Hall",
      "caption": "Honington Hall. The garden front facing the river, showing the colonnaded garden room. The Georgian style house has a number of fine features including round headed niches over the ground floor windows of the east front which contain busts of Roman Emperors. The house is not generally open to the public but may be available for visitations by prior group arrangements."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Cottages%2C_Idlicote_-_geograph.org.uk_-_179204.jpg",
      "title": "David Stowell / Cottages, Idlicote",
      "caption": "Cottages, Idlicote. With the gateway to the drive to Idlicote House visible beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Shipston-on-Stour_street_-_geograph.org.uk_-_1392450.jpg",
      "title": "Colin Craig / Shipston-on-Stour street",
      "caption": "Shipston-on-Stour street. The town has traditional shops including bakers, butchers and an Aladdin's Cave-style antiques shop. It also has some nice architecture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/The_Manor_House%2C_Shipston_on_Stour_-_geograph.org.uk_-_1443708.jpg",
      "title": "Colin Craig / The Manor House, Shipston on Stour",
      "caption": "The Manor House, Shipston on Stour"
    }
  ],
  "distance_km": 8.0,
  "description": "This attractive Warwickshire based town is in a good location for exploring the North Cotswolds. The historic market town was known for its sheep market, playing a major part in the local wool trade. The town derives its name from the Olde English 'Sheep-wash-Town'. This walk from the town uses a section of the Warwickshire Centenary Way to visit the nearby villages of Honington and Idlicote. The walk starts in the town centre where you can pick up the waymarked trail and follow it north east along the River Stour. The route turns north to visit the neighbouring village of Honington where you will find Honington Hall. This privately owned 17th century country house is Grade I listed. The River Stour flows past the village on the western side and has a noteworthy 5-arched 17th-century bridge crossing it. The local church has been re-built, but retains its 13th-century tower. After exploring the village and hall you continue to Idlicote. Here you'll find a number of pretty cottages and the Church of St James the Great which has features dating from the 13th century. There's also Idlicote House, a grade II listed country house, on a site once owned by St Mary's Abbey, Kenilworth. After exploring the village you can then return to Shipston on the same paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the historic Black Horse Inn for some refreshments after your walk. The 16th century pub is the oldest pub and the only thatched building in Shipston. Outside there's a large decking area where you can enjoy your meal on finer days. You can find them on Station Road with a postcode of CV36 4BT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Black Horse Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking from the village follow the Centenary Way north east to visit Ilmington and Stratford Upon Avon. On the way you could visit Tysoe Windmill, a photogenic old mill sitting on top of a 184 metre hill with excellent views over the Cotswolds. For more walking ideas in the area see the Cotswolds Walks and Warwickshire Walks pages."
    }
  ],
  "postcode": "CV36 4AG",
  "district": "Stratford-on-Avon",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Seccombes, Market Place, Shipston on Stour, Shipston-on-Stour, Stratford-on-Avon, Warwickshire, England, CV36 4AG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "historic villages",
    "churches",
    "country houses"
  ],
  "facilities": [
    "church",
    "historic buildings"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}