{
  "created_at": "2025-01-06T08:55:05.465411+00:00",
  "objectID": "2956a00a7723ca895f02b04b938012ea",
  "ref": "helman-tor-walking-route",
  "title": "Helman Tor Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Logan_Rock_at_Helman_Tor_-_geograph.org.uk_-_196582.jpg",
  "nearby": [
    {
      "description": "Saints Way",
      "objectID": "8d883d251886cb93951db47f4c100ddb",
      "ref": "saints-way-walking-route"
    },
    {
      "description": "Lanhydrock",
      "objectID": "12cee43b0cc0c074bf34ec52893b5b0f",
      "ref": "lanhydrock-walking-and-cycle-route"
    },
    {
      "description": "Lostwithiel",
      "objectID": "eeccb8a03a4896cadd4b486b56675623",
      "ref": "lostwithiel-walking-route"
    },
    {
      "description": "Roche Rock",
      "objectID": "0017c2dd11ab20cf483920766f9b1f21",
      "ref": "roche-rock-walking-route"
    },
    {
      "description": "Goss Moor Trail",
      "objectID": "5cae2c97d995efef216227155e29aad5",
      "ref": "goss-moor-trail-walking-and-cycle-route"
    },
    {
      "description": "Luxulyan Valley",
      "objectID": "28a9e6a1b2b0d111b23365fdc7d14509",
      "ref": "luxulyan-valley-walking-route"
    },
    {
      "description": "Tregargus Valley",
      "objectID": "464a66a71305043b5090ae389d383bd0",
      "ref": "tregargus-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2956a00a7723ca895f02b04b938012ea.gpx",
  "_geoloc": {
    "lat": 50.42019469,
    "lng": -4.72957134
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Logan_Rock_at_Helman_Tor_-_geograph.org.uk_-_196582.jpg",
      "title": "Phil Williams / Logan Rock at Helman Tor",
      "caption": "A view looking north to the Logan Rock at Helman Tor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/The_throne_on_Helman_Tor_-_geograph.org.uk_-_196579.jpg/256px-The_throne_on_Helman_Tor_-_geograph.org.uk_-_196579.jpg",
      "title": "Phil Williams / The throne on Helman Tor",
      "caption": "The throne. A view looking south towards the triangulation pillar on Helman Tor, showing the sculpted rock which is just the right size to form a throne to survey the surrounding landscape."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Breney_Common_from_Helman_Tor_-_geograph.org.uk_-_196560.jpg",
      "title": "Phil Williams / Breney Common from Helman Tor",
      "caption": "Breney Common from the Tor. A view looking to the southwest over Breney Common Nature Reserve from the rocks of Helman Tor. The china clay spoil heaps near Bugle can be seen on the horizon, with Gunwen Methodist Church visible in the cluster of buildings at Lowertown (right)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Wind_sculpted_rocks_at_Helman_Tor_-_geograph.org.uk_-_197125.jpg",
      "title": "Phil Williams / Wind sculpted rocks at Helman Tor",
      "caption": "Wind sculpted rocks at the Tor. A view looking to the northeast to some of the rocks at the Tor. Higher Trevilmick Farm is visible at right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/The_lane_to_Helman_Tor_-_geograph.org.uk_-_212004.jpg",
      "title": "Terry McKenna / The lane to Helman Tor",
      "caption": "The lane to Helman Tor. This lane cuts off from the Saints Way as the route skirts around the edge of the Tor, an ancient natural rock feature a few miles south of Bodmin. Part of the hill can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Breney_Common%2C_Luxulyan_-_geograph.org.uk_-_61643.jpg",
      "title": "Humphrey Bolton / Breney Common, Luxulyan",
      "caption": "Breney Common, Luxulyan. This area of scrubland, beyond the green fields, is a nature reserve. The fields were part of the common in the 1940s. Taken from the Tor."
    }
  ],
  "distance_km": 3.5,
  "description": "This circular walk climbs to Helman Tor and then visits the adjacent Breney Common Nature Reserve in Bodmin. You can park at the Helman Tor car park just south of the hill to start your walk. It's a short climb from here to the rocky outcrop which stands at a height of 209 m (686 ft). From here there are fabulous views over the surrounding Cornish coutntryside. After descending from the tor the route then follows the Saints Way long distance trail around Breney Common. The reserve covers over 500 acres with heathland, grassland, wetland, woodland and ponds. It's great for widlife with grazing ponies and the rare Orange Tip butterfly to look out for. Various wildfowl can be seen on the open water too. Just to the south of the tor you can explore the popular Luxulyan Valley, a designated World Heritage Site. The valley is one of the highlights of the area with nice trails along the River Par, a series of historical industrial remains and the impressive Treffry Viaduct to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south of the hill along the Saints Way and you could visit the noteworthy Crown Inn in Lanlivery. The inn is one of the oldest in Cornwall, dating all the way back to the 12th century. It was later extended to house the stonemasons who built the charming church of St Brevita. The pub is full of character with low beamed ceilings, open fireplaces, thick stone walls and a Glass covered Well in porch. Outside there's a particularly delightful garden area where you can relax on warmer days. You can find them at a postcode of PL30 5BT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The Tor makes for a bracing walk for fit dogs. The Crown Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking in the area you could visit the nearby Lanhydrock estate where there are miles of cycling and walking trails through woodland and parkland. The circular Lostwithiel Walk starts from the nearby town and visits the Tor before heading to Lanhydrock. It's a nice way of visiting the site if you plan to come by public transport as there is a train station in Lostwithiel. The route also visits the historic ruins of Restormel Castle just north of the town. The English Heritage run castle is now a photogenic ruin set in beautiful Cornish countryside next to the River Fowey. It was built in the 13th century and used as a retreat for its medieval owners and was twice visited by Edward, the Black Prince. You can find it just a few miles east of the Tor, making it a nice addition to your outing. Just to the west you can enjoy a climb to Roche Rock. Here you'll find a striking granite tor with a ruined chapel and wonderful views. A little further to the west you can pick up the Goss Moor Trail. This shared cycling and walking trail explores the expansive Goss Moor National Nature Reserve where there's a number of rare plant and wildlife species to look out for. For more walking ideas in the area see the Bodmin Moor Walks and the Cornwall Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/x0FQymBzYiw",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lanlivery, Cornwall, England, PL30 5DF, United Kingdom",
  "postcode": "PL30 5DF",
  "district": null,
  "state": "England"
}