{
  "created_at": "2025-01-06T08:55:38.646772+00:00",
  "objectID": "2981631a331c3b16ae6d75f34ec67491",
  "ref": "blaenavon-walking-route",
  "title": "Blaenavon Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Blaenavon_World_Heritage_Centre_May_2010.jpg",
  "nearby": [
    {
      "description": "Blorenge",
      "objectID": "f519f7bf6a48449a4a10db358dce5833",
      "ref": "blorenge-walking-route"
    },
    {
      "description": "Abergavenny Castle Meadows and Linda Vista Gardens",
      "objectID": "153c540c301bfceae51d56b191af7c6a",
      "ref": "abergavenny-castle-meadows-and-linda-vista-gardens-walking-and-cycle-route"
    },
    {
      "description": "Abergavenny Sugarloaf Walk",
      "objectID": "a5fdc9bdb08c374755affb174850db71",
      "ref": "abergavenny-sugarloaf-walk-walking-route"
    },
    {
      "description": "Pontypool",
      "objectID": "68c1df86926be190277ab87a25a73a93",
      "ref": "pontypool-walking-route"
    },
    {
      "description": "Clydach Gorge",
      "objectID": "a941745636af68aa2a57382f5d1e8a0b",
      "ref": "clydach-gorge-walking-route"
    },
    {
      "description": "Goytre Wharf",
      "objectID": "a3ca2d49b4d68dc3a957c610ebdad343",
      "ref": "goytre-wharf-walking-route"
    },
    {
      "description": "Gilwern",
      "objectID": "7b00d52f1b2a6ddf63cddedd422c2c9a",
      "ref": "gilwern-walking-route"
    },
    {
      "description": "Keepers Pond",
      "objectID": "a12e0593ca3c30f310010763f470d6c2",
      "ref": "keepers-pond-walking-route"
    },
    {
      "description": "Llanfoist Canal Walk",
      "objectID": "308f970855a9b8d1765bf97edd14f31e",
      "ref": "llanfoist-canal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2981631a331c3b16ae6d75f34ec67491.gpx",
  "_geoloc": {
    "lat": 51.7733348003,
    "lng": -3.0881748726
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Blaenavon_World_Heritage_Centre_May_2010.jpg",
      "title": "Jaggery / Blaenavon World Heritage Centre",
      "caption": "Blaenavon World Heritage Centre May 2010"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Big_Pit_-_geograph.org.uk_-_779686.jpg",
      "title": "andy dolman / Big Pit",
      "caption": "Big Pit mine"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Big_Pit_Halt_-_geograph-4069323-by-Gareth-James.jpg/512px-Big_Pit_Halt_-_geograph-4069323-by-Gareth-James.jpg",
      "title": "Gareth James / Pontypool & Blaenavon Railway: Big Pit Station",
      "caption": "Big Pit Halt station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/The_Big_Pit_colliery_museum_-_geograph.org.uk_-_436091.jpg",
      "title": "Chris Gunns / The Big Pit colliery museum",
      "caption": "Big Pit, with Blaenavon in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Pontypool_and_Blaenavon_Railway_Crossing_-_geograph.org.uk_-_579896.jpg",
      "title": "Kev Griffin / Pontypool & Blaenavon Railway Crossing",
      "caption": "Pontypool and Blaenavon Railway Crossing"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Whistle_Inn_-_geograph.org.uk_-_1414994.jpg",
      "title": "Gareth James / Whistle Inn",
      "caption": "Whistle Inn. Current end-of-the-line for the Pontypool & Blaenavon Railway - Whistle Inn station and pub/restaurant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Whistle_Inn_Halt_railway_station_geograph-4658463-by-Gareth-James.jpg/512px-Whistle_Inn_Halt_railway_station_geograph-4658463-by-Gareth-James.jpg",
      "title": "Gareth James / Pontypool & Blaenavon Railway",
      "caption": "Whistle Inn Halt railway station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Well_constructed_gateway_on_the_Torfaen_Leisure_Route_-_geograph.org.uk_-_471211.jpg",
      "title": "Carol Rose / Well constructed gateway on the Torfaen Leisure Route",
      "caption": "Well constructed gateway on the Torfaen Leisure Route. A shared cycling and walking route along a good surfaced path along the railway."
    }
  ],
  "distance_km": 6.0,
  "description": "This interesting town in Torfaen county is part of the Blaenavon Industrial Landscape, a UNESCO World Heritage Site. There's much to enjoy with a fascinating industrial museum, a heritage steam railway and a popular local mountain to climb. This circular walk from the town visits the Big Pit Mining Museum before following the cycle trail along the Pontypool and Blaenavon Railway. The railway runs for 3.5 miles through the Blaenavon World Heritage site. It's a popular local attraction, run by dedicated volunteers who oversee the steam and heritage diesel services. Start the walk on the southern side of the town where you can pick up a footpath heading south west toward the railway line. The cycle path then runs west along the railway before turning to your left to visit the museum. The site was a working coal mine from 1880 to 1980, and then opened to the public in 1983. You can learn all about the Welsh heritage of coal mining through a multi-media tour of a modern coal mine with a virtual miner in the Mining Galleries. There's also exhibitions in the Pithead Baths and Historic colliery buildings. After exploring the museum you can follow footpaths past the Coity Pond to the Whistle Inn Halt station at the western end of the line. Here you'll find a nice pub for a pit stop and the pretty Garn Lakes. There's some nice trails around the lakes with wildfowl to look out for on the water. The route then turns around to follow the cycle trail past the Garn Lakes back to Blaenavon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Butterflies Bar and Kitchen is a fine place for some post walk refreshment back in the town. The historic gastropub dates all the way back to 1832 and has a delightful interior. The food is of a high quality with steaks that are renowned in the area. They have even won an award for “best steaks and grills” in South East Wales. There are two restaurant areas including a lovely Garden Room with views onto the courtyard and the large walled garden. The Cwtch room is part of the original 19th century pub and includes a cosy fire and log burner. You can find them in the town centre at 31 Old Queen Street with a postcode of NP4 9PN. On the route you could stop off at The Whistle Inn next to the Whistle Inn Halt train station. It's your typical pub with tasty meals and a good selection of ales. There's also some interesting mining memorabilia inside and a beer garden outdoors. You can find them at the western end of the walk at Garn Yr Erw, with a postcode of NP4 9SJ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The walk is a nice one to do with your dog but the museum only allows assistance dogs. The Whistle Inn mentioned above is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One of the walking highlights of the area is located just north of the town at the Blorenge Mountain. It's a popular climb with fabulous views over the Usk Valley, Sugarloaf Mountain and Skirrid Fawr from the 561 m (1,841 ft) summit. On the slopes of the mountain there's also the delightful Keepers Pond. The small lake is a popular place for easy walks, wild swimming and picnics. Catch the train to Pontypool and there's some lovely walks around Pontypool Park. The extensive park includes ponds, woodland, Italian gardens, a stone circle, streams and a ski slope. The Monmouthshire and Brecon Canal can be picked up here and followed to the popular Goytre Wharf here too.  A few miles to the north you'll find the splendid Clydach Gorge. The scenic steep-sided valley is where the River Clydach flows to the River Usk. At the eastern end of the gorge there's also the pretty Gilwern Wharf where there's some lovely scenery and a fine canalside pub. For more walking ideas in the area see the Abergavenny Walks and the Brecon Beacons Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/-kTK7QCab3Q",
  "district": "Blaenavon",
  "county": "Torfaen - Torfaen",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}