{
  "created_at": "2025-01-06T01:40:10.960089+00:00",
  "objectID": "299795fe50efc0861691d28d13ff467f",
  "ref": "littlehampton-walking-route",
  "title": "Around Littlehampton - Coastal Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Old_Quay_Wharf_-_geograph.org.uk_-_734423.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/299795fe50efc0861691d28d13ff467f.gpx",
  "_geoloc": {
    "lat": 50.810501391,
    "lng": -0.5493525344
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Old_Quay_Wharf_-_geograph.org.uk_-_734423.jpg",
      "title": "Simon Carey / Old Quay Wharf",
      "caption": "Old Quay Wharf. On the eastern bank of the Arun and the oldest known site of a harbour in Littlehampton, being the town's quay from the 17th century. Now largely redeveloped and viewed from The Harbour on the western bank where the rotting hulks of abandoned vessels juxtapose nicely the old and the new."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Looking_up_the_River_Arun%2C_Littlehampton_East_Pier_-_geograph.org.uk_-_2015279.jpg",
      "title": "Looking up the River Arun, Littlehampton East Pier by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking up the River Arun, Littlehampton East Pier. On the East Beach you will find Britain’s Longest Bench which stretches 324 metres along the majority ofthe east beach promenade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Atherington_beach_-_geograph.org.uk_-_2807965.jpg/512px-Atherington_beach_-_geograph.org.uk_-_2807965.jpg",
      "title": "Atherington beach by Stacey Harris, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Atherington beach"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Sand_Dunes%2C_West_Beach_-_geograph.org.uk_-_734656.jpg/256px-Sand_Dunes%2C_West_Beach_-_geograph.org.uk_-_734656.jpg",
      "title": "Simon Carey / Sand Dunes, West Beach",
      "caption": "Sand Dunes, West Beach. Near to the entrance to the beach the boardwalk provides access through the sand dunes to West Beach car park. This area of dunes has been fenced off to protect the vegetation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Littlehampton_Fort_-_geograph.org.uk_-_734650.jpg",
      "title": "Simon Carey / Littlehampton Fort",
      "caption": "Littlehampton Fort Built in 1854 at the same time as the one along the coast at Shoreham to guard the mouth of the Arun. Decommissioned in 1873 parts were dismantled in 1900 and the barracks followed in 1960. The fort is also gives a good indicator of how the dunes have spread in the last 150 years as it originally had a clear view of fire out to sea when constructed. Now overgrown with vegetation and off limits to the public as it falls within the fenced off area of the West Beach Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Littlehampton_Marina_-_geograph.org.uk_-_734079.jpg/256px-Littlehampton_Marina_-_geograph.org.uk_-_734079.jpg",
      "title": "Simon Carey / Littlehampton Marina",
      "caption": "Littlehampton Marina. Highlights the changing face of the river, much use now being put over to leisure and residential whilst the industrial side is limited to two quays on the eastern bank. The sleet shower is heading out into the channel whilst the sun is shining on the marina causing a rainbow to brighten up Littlehampton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Littlehampton_Golf_Club_-_geograph.org.uk_-_734451.jpg",
      "title": "Simon Carey / Littlehampton Golf Club",
      "caption": "Littlehampton Golf Club. Laid out in 1889 and one of the few links courses in Sussex. Originally the land was part of the Arun estuary but silted up during the early modern period with a sand spit deflecting the river east until the present day mouth was cut in the late 18th century. On the horizon are the sand dunes that separate the course from the beach. The clubhouse was rebuilt in 1985 to replace the original which was destroyed by fire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Atherington_Beach_-_geograph.org.uk_-_638213.jpg",
      "title": "Simon Carey / Atherington Beach",
      "caption": "Atherington Beach. Looking down from the embankment along the groynes as the tide recedes. This part of the Sussex coast has long suffered from erosion with most of the hamlet of Atherington and all of the nearby village of Cudlow disappearing beneath the waves."
    }
  ],
  "distance_km": 6.5,
  "description": "This West Sussex based town is a fine place for walkers with coastal trails, riverside paths, a picturesque harbour and two beautiful award winning beaches. This circular walk from the town takes you along the coastal path to nearby Atherington before returning through inland footpaths by the golf course. The walk starts in the town next to the train station where you can cross the River Arun on the Arun Footbridge. Head south along Rope Walk and you can then pick up a nice footpath along the Arun running down to the sea front at West Pier. On the way you will pass the old Littlehampton fort, built to guard the mouth of the Arun. Head west along the beach and the dunes and you will soon come to Atherington. There's another nice beach here and good facilites with a cafe and car park. From Atherington head north and then east to follow footpaths along the golf course. These will lead you back towards the river and the train station. On the way you will pass the picturesque Climping Mill. To continue your walking around Littlehampton pick up the Arundel to Littlehampton River Walk and head north along the river to visit the splendid Arundel Castle and Arundel Park. Continuing west along the coastal path will take you to the popular resort of Bognor Regis. Heading east will take you into the larger town of Worthing where you can visit Bramber Castle and the ancient Cissbury Ring .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Arun View for some rest and refreshment after your exercise. The riverside pub sits in a fine location overlooking the Arun. You can sit outside on the lovely patio and enjoy some delicious sea food with a view. The pub can be found at Wharf Road with postcode BN17 5DD for your sat navs. There's also the noteworthy East Beach Cafe to consider. This striking piece of architecture resembles a giant piece of driftwood. You can enjoy some delicious seafood here. You can find them on the Promenade at postcode BN17 JG."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The beach and river trails make for a fine dog walk. The Arun View mentioned above is also dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nIJUppuTZH0",
  "postcode": "BN17 5BZ",
  "district": "Arun",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "River Road, Littlehampton, Arun, West Sussex, England, BN17 5BZ, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "beach"
  ],
  "facilities": [
    "car park",
    "cafe",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}