{
  "created_at": "2025-01-06T01:20:43.114128+00:00",
  "objectID": "29a45cd6e3d48a39db37b92c59b151bb",
  "ref": "grosmont-to-whitby-walk-walking-route",
  "title": "Grosmont to Whitby Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Grosmont_Station_-_geograph.org.uk_-_452498.jpg",
  "nearby": [
    {
      "description": "Esk Valley Walk",
      "objectID": "cc316203dca3d92a16b5be91c504bdfd",
      "ref": "esk-valley-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/29a45cd6e3d48a39db37b92c59b151bb.gpx",
  "_geoloc": {
    "lat": 54.4360881402,
    "lng": -0.7267025966
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Grosmont_Station_-_geograph.org.uk_-_452498.jpg",
      "title": "Stephen McKay / Grosmont Station",
      "caption": "Grosmont Station. A crowd alights from an afternoon Whitby - Middlesbrough train at Grosmont. The North Yorkshire Moors Railway station - a much more substantial affair - is to the left of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Ford_over_River_Esk_near_Grosmont_-_geograph.org.uk_-_561204.jpg",
      "title": "Brian Norman / Ford over River Esk near Grosmont",
      "caption": "Ford over River Esk near Grosmont. Although the water level was low when the picture was taken, vehicles have been washed away from this river crossing in the past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Sleights_station_steam_train.jpg/512px-Sleights_station_steam_train.jpg",
      "title": "Maniac Pony at English Wikipedia [CC BY-SA (http://creativecommons.org/licenses/by-sa/3.0/)]",
      "caption": "A steam train from Whitby to Grosmont operated by the North Yorkshire Moors Railway passes through Sleights Station, Esk Valley Railway. Mat Overton, 2006."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/River_Esk_-_geograph.org.uk_-_195006.jpg",
      "title": "Mick Garratt / River Esk",
      "caption": "River Esk. Gently flowing in high summer due partially to the weir at Ruswarp."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Footbridge_over_the_River_Esk_-_geograph.org.uk_-_804715.jpg",
      "title": "Stephen McCulloch / Footbridge over the River Esk",
      "caption": "Footbridge over the River Esk Leading to Sleights railway station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/The_River_Esk_at_Ruswarp_-_geograph.org.uk_-_1772377.jpg/512px-The_River_Esk_at_Ruswarp_-_geograph.org.uk_-_1772377.jpg",
      "title": "Philip Barker / The River Esk at Ruswarp",
      "caption": "The River Esk at Ruswarp This photograph shows a view of the River Esk as it makes its way in an easterly direction from Ruswarp towards Whitby. The picture was taken from the road-bridge on the B1416 road looking in an east-north-easterly direction towards the Larpool Hall Hotel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Shipyard_Sculpture_Whitby_with_Abbey_in_background.jpg/512px-Shipyard_Sculpture_Whitby_with_Abbey_in_background.jpg",
      "title": "The joy of all things [CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)]",
      "caption": "Shipyard Sculpture Whitby with Abbey in background. Part of a sculpture located on the site of the Thomas Fishburn shipyard that constructed the HMS Bark Endeavor, used by Captain Cook on his voyages of discovery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Whitby_railway_station_MMB_02.jpg/512px-Whitby_railway_station_MMB_02.jpg",
      "title": "mattbuck (category) [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Whitby railway station"
    }
  ],
  "distance_km": 11.5,
  "description": "This route follows a section of the Esk Valley Walk from Grosmont to Whitby on the North Yorkshire coast. The walk runs for a distance of just over 7 miles on an undulating, waymarked footpath. It starts and ends at train stations so you can catch the train back at the end of the route. Along the way there are nice views of the River Esk and the countryside of the lovely Esk Dale. The walk starts from Grosmont Station and heads north west along a country lane to Priory Lane. Here you can pick up the Esk Valley Walk and follow it north east through Dorsley Bank Wood and Hecks Wood to Sleights. Here you pass a weir and cross the river before continuing onto Ruswarp. There's another station here on the Esk Valley Railway where you can look out for the classic old steam trains that run through the valley. The final section bends round to the north before finishing in Whitby at the train station. To extend the walk continue through the town and visit the historic ruins of Whitby Abbey. Or you could head west and visit Whitby Sands.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off in Ruswarp and visit the Bridge Inn. The pub has a lovely garden area by the river where you can sit and watch the old steam trains go by. It's a splendid place to relax with a drink on warmer days. They are also dog friendly with a good menu and a fine selection of ales. You can find them on the High Street at a postcode of YO21 1NJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The epic Wainwright's Coast to Coast walk runs through Grosmont so you could pick this up to continue your walking in the area. If you follow it south east it will take you to one of the highlights of the area at Falling Foss. Here you'll find a beautiful 30ft high waterfall and a delightful old tea room. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "district": "Grosmont",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}