{
  "created_at": "2025-01-06T01:50:25.413598+00:00",
  "objectID": "2acb18d40c721a6e57c395866e8ad722",
  "ref": "paignton-to-brixham-walking-route",
  "title": "Paignton to Brixham Coastal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/19/Paignton_Pier_-_geograph.org.uk_-_578825.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Berry Head Country Park",
      "objectID": "5ff43fe6088009d123dfc33c1e5a3f9b",
      "ref": "berry-head-country-park-walking-route"
    },
    {
      "description": "Slapton Ley",
      "objectID": "28824a83a65521fc3d0debc552889a76",
      "ref": "slapton-ley-walking-and-cycle-route"
    },
    {
      "description": "Berry Pomeroy Castle",
      "objectID": "fcc61aaef41758bba8e8b11ecbab4b22",
      "ref": "berry-pomeroy-castle-walking-route"
    },
    {
      "description": "John Musgrave Heritage Trail",
      "objectID": "315c508a5a2e96b2374de6c0afd38855",
      "ref": "john-musgrave-heritage-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2acb18d40c721a6e57c395866e8ad722.gpx",
  "_geoloc": {
    "lat": 50.4352767963,
    "lng": -3.5593651426
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Paignton_Pier_-_geograph.org.uk_-_578825.jpg",
      "title": "Paul Anderson / Paignton Pier",
      "caption": "Paignton Pier. Work started on Paignton Pier in 1878 and was completed the following year. The 780ft (236m) pier, with its customary grand pavilion at the seaward end, was opened to the public for the first time in June 1879. In 1919 the pier-head and some other buildings were destroyed in a fire. These were never replaced and a period of decline followed. In 1980 the fortunes of Paignton Pier took a turn for the better when a major redevelopment project was undertaken. This included the widening of the shoreward end to ensure a uniform neck, and the construction of the rather stylish pavilions that remain today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Goodrington_Cliff_Gardens_-_geograph.org.uk_-_295010.jpg",
      "title": "Tony Atkin / Goodrington Cliff Gardens",
      "caption": "Goodrington Cliff Gardens. The southern side of the sandstone promontory of Roundham Head has been terraced and planted with a large variety of flowering plants."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Across_Broadsands_Beach_-_geograph.org.uk_-_31244.jpg",
      "title": "Tony Atkin / Across Broadsands Beach",
      "caption": "Across Broadsands Beach. Low tide, sandy beach and beach huts along the promenade, even the odd knotted hanky; this is a popular Torbay beach but surprisingly undeveloped with cultivated and uncultivated fields behind the beach. Note the railway viaduct in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Churston_Cove_-_geograph.org.uk_-_295793.jpg",
      "title": "Tony Atkin / Churston Cove",
      "caption": "Churston Cove. Looking down into the cove from Fishcombe Point. In the distance is the outer breakwater of Brixham Harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Elberry_Cove_-_geograph.org.uk_-_31250.jpg",
      "title": "Tony Atkin / Elberry Cove",
      "caption": "Elberry Cove. Unfortunately the shingle beach of the cove is just out of shot behind the foreground bank. Elberry Cove is a centre for water skiing and jet skiing. It is not a recommended place for people who like a quiet life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Cove_east_of_Elberry_-_geograph.org.uk_-_1437787.jpg",
      "title": "Robin Stott / Cove east of Elberry",
      "caption": "Cove east of Elberry. Reached by an informal side path off the South West Coast Path, and a thoughtfully provided rope, the rocks in shadow here are seen sunlit right of centre in: 1099594 Elberry Cove is out of sight, left, and on the right is the low bluff near Churston Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/One_of_the_Churston_Quarries_-_geograph.org.uk_-_1099623.jpg",
      "title": "Martin Wyatt / One of the Churston Quarries",
      "caption": "One of the Churston Quarries. Accessed from the coast path between Elberry Cove and Churston Cove. These quarries are beautiful and historically very interesting."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Brixham_Harbour_-_geograph.org.uk_-_516969.jpg",
      "title": "Paul Anderson / Brixham Harbour",
      "caption": "Brixham Harbour. The harbour is located on the southern aspect of Tor Bay and is home to one of the largest fishing fleets in the UK. It also has a thriving fish market next to the quay side."
    }
  ],
  "distance_km": 8.0,
  "description": "This is a popular coastal walk between these two lovely Torbay towns. It's about a 5 mile walk with the option of returning by bus or walking back the same way if you prefer. It's a beautiful stretch of coast with a number of pretty beaches, sheltered coves and a nice woodland section. Start the walk from Paignton Sands near to the train station and follow the South West Coast Path south to Goodrington Sands. You continue to Broadsands where there is another lovely little beach and a pitch and putt course on the adjacent headland. There's also good views of the Dartmouth Steam Railway, which crosses two Brunel viaducts near the beach. After leaving Broadsands you head around the Churston Golf Club and through The Grove, an ancient, semi-natural woodland. You then come to the pretty Brixham Battery and Gardens. Here you'll find 14-acres of gardens with an old Battery Observation Post and a 4.7 inch Gun Floor. The final section takes you to Brixham Harbour and the centre of this attractive coastal fishing port. Look out for the replica of the Golden Hind and the Victorian statue of William of Orange. You can extend the walk by continuing east along the coast path to Berry Head Country Park. The coastal park is also a nature reserve with lots of interesting coastal plantlife and a large Guillemot colony. For a longer route try the Torquay to Brixham Walk .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue south along the coast path from Brixham you will soon come to the splendid gardens at Coleton Fishacre. The National Trust property includes a 1920s Art Deco house surrounded by well laid out footpaths with coastal views. A few miles to the west of Paignton there's the historic Berry Pomeroy Castle to explore. Here you'll find the ruins of a 15th century castle surrounded by pleasant woodland trails. The site is run by English Heritage so there's good facilities with a car park, gift shop and cafe. The John Musgrave Heritage Trail can be picked up in this area too. The waymarked trail runs from Maidencombe to Brixham, visiting several of South Devon's interesting historical sites on the way. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Wlj_uyan3F0",
  "postcode": "TQ4 6AG",
  "district": "Paignton",
  "county": "Torbay",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Shoreline, Eastern Esplanade, Roundham, Paignton, Torbay, England, TQ4 6AG, United Kingdom",
  "state": "England"
}