{
  "objectID": "2b5825031438ff9d3e74569d4dd72955",
  "created_at": "2024-12-19T04:17:12.349697+00:00",
  "ref": "winsford-walking-route",
  "title": "Winsford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/War_Memorial_Winsford.jpg/512px-War_Memorial_Winsford.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/250EC2B33CE50D9C862586AA00508106/$FILE/Winsford.gpx",
  "_geoloc": {
    "lat": 53.1935441242,
    "lng": -2.5172345734
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/War_Memorial_Winsford.jpg/512px-War_Memorial_Winsford.jpg",
      "title": "Peter Turner / War memorials Winsford",
      "caption": "War Memorial in Winsford town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Southern_end_of_Bottom_Flash%2C_Winsford_-_geograph.org.uk_-_180027.jpg",
      "title": "Ian Warburton / Southern end of Bottom Flash, Winsford",
      "caption": "Southern end of Bottom Flash, Winsford. Taken from Weaver Dairy House. The river Weaver flows into the flash from the right. The large reservoir is located just south of Weaver Parkway and makes a nice diversion from the route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Meadowbank_rock_salt_mine%2C_Winsford_-_geograph.org.uk_-_1110178.jpg",
      "title": "Andrew Fielding / Meadowbank rock salt mine, Winsford",
      "caption": "Meadowbank rock salt mine, Winsford. Over 100 lorries queue on Bradford Road to load with crushed rock salt during the coldest week in seven years, 6 January 2009, 10am. During these cold spells many hundreds of lorries arrive daily to load with rock salt to de-ice the country's roads. The site is operated by the Salt Union (Compass and Minerals)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Newbridge_swing_bridge_-_geograph.org.uk_-_60315.jpg",
      "title": "David Kitching / Newbridge swing bridge",
      "caption": "Newbridge swing bridge. This distinctive bridge spans the river Weaver and is situated at the site of the former Newbridge Locks which were swept away when the navigation was modernised in the 1880's. In the foreground can be seen the gate recess for one of the lock gates."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Path_near_Vale_Royal_Abbey_-_geograph.org.uk_-_289247.jpg",
      "title": "Ian Nadin / Path near Vale Royal Abbey",
      "caption": "Path near Vale Royal Abbey. Broad field-edge path to the East of Vale Royal Abbey. The path emerges from the other side of the wood onto the banks of the original course of the River Weaver."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Vale_Royal_locks_on_the_River_Weaver_-_geograph.org.uk_-_1074972.jpg",
      "title": "Dr Duncan Pepper / Vale Royal locks on the River Weaver",
      "caption": "Vale Royal locks on the River Weaver. A well preserved and charming lock, construction was privately funded to transport salt along the canalised River Weaver."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/River_Weaver_-_marina_and_boatyard_-_geograph.org.uk_-_869791.jpg",
      "title": "Mike Harris / River Weaver - marina and boatyard",
      "caption": "River Weaver - marina and boatyard Davenham - view from footpath 2 near Kingsmead down the River Weaver towards the marina and shipyard on the Hartford bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/River_Weaver_near_Poor%27s_Wood_-_geograph.org.uk_-_866967.jpg",
      "title": "Mike Harris / River Weaver near Poor's Wood",
      "caption": "River Weaver near Poor's Wood"
    }
  ],
  "distance_km": 9.5,
  "description": "This Cheshire based town sits in a nice spot next to the canalised section of the River Weaver. It also includes a number of pretty lakes (or flashes) that show evidence of the town's salt mining history. This waterside walk from the town follows the Weaver Way to neighbouring Northwich along the canal. It's a nice easy walk with pretty locks and good views of the surrounding countryside on the way. The route starts on the eastern side of the town at Weaver Parkway, just north of the picturesque Bottoms Flash Reservoir. The parkway is a good sized green space on the outskirts of the town. There's nice trails along the river and lots of wildlife to look out for too. You can park for free at the Rangers’ Office here and then pick up a shared walking and cycling path running north along the Weaver Navigation. The trail will take you past Moulton, Meadowbank Salt Mine and Eaton Bank Woods before coming to the Valeroyal locks. The route then heads north east through Kingsmead and Northwich before finishing at Carey Park to the north of the town.",
  "video_url": "https://www.youtube.com/embed/J6Tds60yL68",
  "postcode": "CW7 3AA",
  "district": "Winsford",
  "county": "Cheshire West and Chester",
  "region": "North West",
  "country": "England"
}