{
  "created_at": "2025-01-06T01:55:18.776785+00:00",
  "objectID": "2bb6045c20e1ac25e8c2879623ac6263",
  "ref": "knockholt-walking-route",
  "title": "Knockholt Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Road_junction%2C_Knockholt_Pound%2C_Kent_-_geograph.org.uk_-_167792.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2bb6045c20e1ac25e8c2879623ac6263.gpx",
  "_geoloc": {
    "lat": 51.3150434256,
    "lng": 0.1258703459
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Road_junction%2C_Knockholt_Pound%2C_Kent_-_geograph.org.uk_-_167792.jpg",
      "title": "Dr Neil Clifton / Road junction, Knockholt Pound, Kent",
      "caption": "Road junction, Knockholt Pound, Kent. Knockholt Pound and its near neighbour Knockholt are not on the M.o.T A and B road network, but are served by a tangle of minor roads and lanes. In this photograph, taken from the steps of the Harrow public house, the fork to the right leads to Pratt's Bottom and Chelsfield, while the left-hand road goes to Biggin Hill and Westerham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/The_Three_Horseshoes_-_geograph.org.uk_-_817484.jpg",
      "title": "Ian Capper / The Three Horseshoes",
      "caption": "The Three Horseshoes. One of two pubs in Knockholt Pound, the records of landlords here date back to 1869. With thanks to John Trimmer for the following additional information: \"This pub is on a Drover's route and would have been frequented by the Welsh Drovers in the 16th and 17th centuries, when moving their cattle down to London from Kent. The Three Horseshoes is the heraldic sign of the Worshipful Company of Farriers, suggesting a nearby forge. The pound would have been used to corral the cattle at night. The Bull at Pratts Bottom (Spratts Bottom on the 1810 map), would also have been a stop-over point.\" For a photo of the Bull at Pratts Bottom (presumably the Bulls Head)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Chevening_House_-_geograph.org.uk_-_1930047.jpg",
      "title": "Chevening House by Ian Capper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Chevening House. The prime minister has the responsibility of nominating a person to occupy the house privately as a furnished country residence. This person can be the prime minister, a minister who is a member of the Cabinet, a lineal descendant of King George VI or the spouse, widow or widower of such a descendant. The usual nominee is the secretary of state for foreign and Commonwealth affairs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/St_Katharine%27s_Church%2C_Knockholt_-_geograph.org.uk_-_825342.jpg",
      "title": "Ian Capper / St Katharine's Church, Knockholt",
      "caption": "St Katharine's Church, Knockholt. The church was consecrated here in 1281, and it is thought that much of the original building exists in the present structure, although with various additions over the years, including the tower, and in 1881 the building of the north aisle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Footpath_junction_on_the_North_Downs_Way_near_Knockholt_-_geograph.org.uk_-_1578087.jpg",
      "title": "David Anstiss / Footpath junction on the North Downs Way near Knockholt",
      "caption": "Footpath junction on the North Downs Way near Knockholt. The long distance path heads from Brasted Lane towards Sundridge Lane. Another path leads left (through the field) towards Main Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/View_from_the_North_Downs_Way_-_geograph.org.uk_-_1578060.jpg",
      "title": "David Anstiss / View from the North Downs Way",
      "caption": "View from the North Downs Way. Looking Southwards from the long distance path over Roughletts Wood towards Sundridge and Brasted."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/North_Downs_Way_south_of_Knockholt_Pound_-_geograph.org.uk_-_1902179.jpg",
      "title": "North Downs Way south of Knockholt Pound by Ian Capper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "North Downs Way south of Knockholt Pound"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Portlands%2C_Cudham_Lane_South%2C_Knockholt%2C_Kent_-_geograph.org.uk_-_778343.jpg",
      "title": "Oast House Archive / Portlands, Cudham Lane South, Knockholt, Kent",
      "caption": "Portlands, Cudham Lane South, Kent. Single small round kiln oast house. Early-mid c19. Unusual flint and brink coursed walls. Grade II listed."
    }
  ],
  "distance_km": 11.5,
  "description": "This route from Knockholt Pound uses sections of the North Downs Way and the Pilgrims Way to create a circular walk through the area. There's fine views from the elevated position of the area and you'll also pass the noteworthy Chevening House on the route. The walk starts in Knockholt Pound and heads south past Lees Wood to link up with the ancient Pilgrims Way trail at Morants Court Farm. You then head west past Chevening House and Hagbush Wood before coming to Hogtrough Hill. The Grade I listed house was built between 1617 and 1630 to a design reputedly by Inigo Jones. It is often inhabited by a prominent member of ruling government and sometimes by the prime minister. At Hogtrough Hill you turn north to link up with a country lane to take you to the North Downs Way. The waymarked footpath will take you north east to Knockholt village. After exploring the village you return to the trail and continue east through a woodland area to return to Knockholt Pound.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east there's the popular town of Sevenoaks where you can pick up the Sevenoaks Circular Walk and visit the lovely Sevenoaks Wildlife Reserve and the deer at Knole Park. The Otford Circular Walk and the Kemsing Walk are other good local options. Here you can explore the attractive Kemsing Downs Nature Reserve. It's a lovely place for a walk with ancient woodland, wildlife, bluebells and more tremendous views from its elevated location. To the west is Betsoms Hill, the highest point in the county of Kent. This area also includes Westerham Heights, the highest point of Greater London. For more walking ideas in the area see the North Downs Walks and the Kent Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ygqBR4g4HN4",
  "postcode": "TN14 7LA",
  "district": "Sevenoaks",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Chevening Lane, Knockholt, Knockholt Pound, Sevenoaks, Kent, England, TN14 7LA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "historic house",
    "country lane"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}