{
  "created_at": "2025-01-06T00:08:19.960408+00:00",
  "objectID": "2bedb25bc8a0b75f6f9e132912aaa9e4",
  "ref": "newbury-walking-route",
  "title": "Newbury Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/22/Bulls-Lock-by-Maurice-Pullin.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2bedb25bc8a0b75f6f9e132912aaa9e4.gpx",
  "_geoloc": {
    "lat": 51.4024400518,
    "lng": -1.3213152778
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Bulls-Lock-by-Maurice-Pullin.jpg",
      "title": "Maurice Pullin [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bulls Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Widmead-Lock-by-John-Lloyd.jpg",
      "title": "John Lloyd [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Widmead Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Thatcham_Nature_Discovery_Centre_-_geograph.org.uk_-_9568.jpg",
      "title": "Pam Brophy [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Thatcham Nature Discovery Centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Thatcham_Reedbeds_Nature_Reserve_-_geograph.org.uk_-_9490.jpg",
      "title": "Pam Brophy [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Thatcham Reedbeds Nature Reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Newbury_-_Corn_Exchange_-_geograph.org.uk_-_2918239.jpg",
      "title": "Newbury - Corn Exchange by Chris Talbot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Newbury Corn Exchange"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Down_to_Newbury_-_geograph.org.uk_-_3986244.jpg/512px-Down_to_Newbury_-_geograph.org.uk_-_3986244.jpg",
      "title": "Down to Newbury by Bill Nicholls, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The canal in late winter/early spring with the town and church in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Newbury_-_Clock_Tower_-_geograph.org.uk_-_2918174.jpg",
      "title": "Newbury - Clock Tower by Chris Talbot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The clock tower in the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Newbury_Lock_-_geograph.org.uk_-_3902456.jpg/512px-Newbury_Lock_-_geograph.org.uk_-_3902456.jpg",
      "title": "Newbury Lock by Bill Nicholls, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Newbury Lock"
    }
  ],
  "distance_km": 6.0,
  "description": "The delightful Berkshire town of Newbury is a great place for waterside walks along the rivers, canal and lakes you can find in the area. This short, easy stroll takes you along the Kennet and Avon Canal to the nearby Thatcham Discovery Centre. It's a lovely stretch of the canal with lots of wildlife to look out for in the nature reserve at the end of the walk. The walk starts at Newbury Wharf where there's an information centre and cafe run by the Kennet & Avon Canal Trust. Follow the towpath east, passing Greenham Lock, Ham Lock and Bull's Lock with views of the River Kennet. At Widmead Lock bear left to enter the Thatcham Nature Discovery Centre. It's a lovely place for a stroll with a network of footpaths taking you around several pretty lakes. From the bird hide there's nice views across the reedbeds where you can look out for a wide variety of wildlife. Keep your eyes peeled for breeding common terns, house martins, swallows and swifts over the lake. In the summer months you can also see several species of butterfly including garden tiger, waved black, holly blue, and gatekeeper. There's lots of other great options for walkers in the Newbury area. You could enjoy a riverside stroll on the Lambourn Valley Way. Heading north along the trail will take you to the nearby Donnington Castle which is well worth a visit. English Heritage manage the site which includes atmospheric castle ruins dating from the 14th century. The large defences built to protect the castle during the English Civil War include a striking twin-towered gatehouse. There are lovely views of the surrounding Berkshire countryside from the elevated position of the castle. Another gem is the canal walk from Newbury to Kintbury and Hungerford. It also starts from the wharf and includes a number of historic locks and bridges.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk there's several fine options for refreshments. The canal passes along the Thatcham Nature reserve where there is a nice lakeside cafe. There's seats outside with nice views over the reserve's lake, so perfect for a fine day. You could also head into Thatcham village and visit the King's Head. It's a lovely, recently refurbished old Pub, with a wonderful Beer Garden and Garden Bar. The pub is also dog friendly and can be found it at 59 Broadway with a postcode of RG193HP for your sat navs.In Newbury you will find the delightful Tea Shop By The Canal which is perfect for afternoon tea. Set in an interesting old Grade II listed building the tea shop blends the comfort and warmth of Italian culture with the fine and splendid rituals of English Cream Teas. There's also outdoor seating so you can sit out right next to the canal on warm summer days. You can find it at The Stone Building, The Wharf, Newbury with a postcode of RG145AS.The route passes close to Greenham Common where you could visit Bowdown Woods and the old control tower. The 1950's building has been unused for almost 3 decades, but now it has been restored as a visitor centre, museum and community cafe. The cafe offers hot drinks and a variety of delicious cakes, pastries and more. There's also an observation deck where you can enjoy views across what was one of the longest runways in Western Europe. It's located just to the south of the canal near Thatcham and well worth a visit."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canalside paths are a pleasant place for a dog walk. At the nature reserve please keep them under control and on leads near the buildings. Tea Shop By The Canal is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head to the nearby town of Tadley and you could enjoy woodland trails around the expansive Pamber Forest before heading to the ancient Roman Fort at Silchester. In Hungerford there are some nice wide trails to follow across Hungerford Common. The expansive common is located just to the south of the canal and a popular place for dog walkers. The little village of Chilton Foliat is located a few miles to the west near Hungerford. It's a lovely place for a stroll with several pretty thatched cottages, wildlife rich marshland and nice views of the River Kennet which runs through the settlement. Near here you can also visit Littlecote House, another of the area's highlights. The house dates from the mid 16th century and is surrounded by beautiful parkland and gardens. There's also a wonderful ancient Roman mosaic and the opportunity to enjoy afternoon tea at the historic house which is now run as an hotel. For more walking ideas in the area see the Berkshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/USeKXc54Q0c?start=49",
  "postcode": "RG14 5AS",
  "district": "Newbury",
  "county": "West Berkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Parkway Bridge, Newbury Wharf, Newbury, West Berkshire, England, RG14 5AS, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "nature"
  ],
  "points_of_interest": [
    "visitor center",
    "bird hide",
    "castle ruins",
    "historic locks and bridges"
  ],
  "facilities": [
    "information centre",
    "cafe",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}