{
  "created_at": "2025-01-06T02:57:34.697461+00:00",
  "objectID": "2bfa9106a29293f2401bb322bf8c0b6a",
  "ref": "coltishall-walking-route",
  "title": "Coltishall Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Coltishall_Railway_Station_-_geograph.org.uk_-_1279128.jpg",
  "nearby": [
    {
      "description": "Bure Valley Path",
      "objectID": "dd6d03d36ac56a5bf738de8023a9e2cb",
      "ref": "bure-valley-path-walking-and-cycle-route"
    },
    {
      "description": "Wroxham",
      "objectID": "95e3ee4f695744d126f68779d652d920",
      "ref": "wroxham-walking-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Blickling Hall",
      "objectID": "a593d691cedb661ce3eefc3bbc3798c0",
      "ref": "blickling-hall-walking-and-cycle-route"
    },
    {
      "description": "Marriot's Way",
      "objectID": "ac67b521462a354e31726a78bd96d2bc",
      "ref": "marriots-way-walking-and-cycle-route"
    },
    {
      "description": "Aylsham",
      "objectID": "d43b9066b7a4736af0549e6f9dc99be5",
      "ref": "aylsham-walking-route"
    },
    {
      "description": "Horning",
      "objectID": "d122222572365349259ebb75697e2897",
      "ref": "horning-walking-route"
    },
    {
      "description": "Barton Broad Boardwalk",
      "objectID": "efd5d2467f9223754ba6b6dd256ba702",
      "ref": "barton-broad-boardwalk-walking-route"
    },
    {
      "description": "Marsham Heath",
      "objectID": "ab8aabc75d8893283f4ef0ceb344ae5c",
      "ref": "marsham-heath-walking-route"
    },
    {
      "description": "Hoveton",
      "objectID": "3cdbe0fdc8b5d722b72c294218fd0136",
      "ref": "hoveton-walking-route"
    },
    {
      "description": "Salhouse Broad",
      "objectID": "c93e211ed39909a07c3fe9ca41772aae",
      "ref": "salhouse-broad-walking-route"
    },
    {
      "description": "Heydon Hall",
      "objectID": "4177464e1cf9a8926d3800526af18249",
      "ref": "heydon-walking-route"
    },
    {
      "description": "Mannington Hall",
      "objectID": "c475597070c259e4d835fb9704d8828f",
      "ref": "mannington-hall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2bfa9106a29293f2401bb322bf8c0b6a.gpx",
  "_geoloc": {
    "lat": 52.7343217173,
    "lng": 1.3598741823
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Coltishall_Railway_Station_-_geograph.org.uk_-_1279128.jpg",
      "title": "Evelyn Simak / Coltishall Railway Station",
      "caption": "Coltishall Railway Station. The site of the old goods yard can be seen at left. The path in centre leads to the platform of the Bure Valley Railway which stops here, and continues as the Bure Valley long distance footpath which runs parallel with the railway line. Coltishall station was a stop on the East Norfolk Railway (ENR), opened in 1877 with the first section connecting Norwich and Cromer, and an extension from Wroxham to Aylsham in 1880. The line was taken over by the Great Eastern Railway in 1882 and amalgamated into the London & North Eastern Railway in 1923. Passenger service stopped in 1952 but freight service continued until the 1970s. Coal traffic was carried from Norwich Thorpe via Aylsham to Norwich City and concrete building components were carried from Lenwade. This traffic ended in 1981 and the line through Aylsham formally closed on 6 January 1982."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/War_memorial%2C_Coltishall_-_geograph.org.uk_-_400644.jpg",
      "title": "Nick Smith / War memorial, Coltishall",
      "caption": "War memorial, Coltishall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/The_River_Bure%2C_Coltishall_-_geograph.org.uk_-_773002.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The River Bure, Coltishall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Boat_at_Coltishall_-_geograph.org.uk_-_561962.jpg",
      "title": "DS Pugh / Boat at Coltishall",
      "caption": "Boat at Coltishall. Sat on the River Bure in Coltishall at the start of the broads."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Railway_bridge_over_the_River_Bure_-_geograph.org.uk_-_1272934.jpg",
      "title": "Evelyn Simak / Railway bridge over the River Bure",
      "caption": "Railway bridge over the River Bure. This girder bridge takes the Bure Valley Railway over the River Bure. The bridge is 105 foot long and by far the largest bridge on the lin"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/View_along_the_Bure_towards_Mayton_Bridge_-_geograph.org.uk_-_1273165.jpg",
      "title": "Evelyn Simak / View along the Bure towards Mayton Bridge",
      "caption": "View along the Bure towards Mayton Bridge. The river bank at right has been levelled so that the cattle populating this pasture can safely drink here. The River Bure rises near Melton Constable, 18 kilometres miles upstream of Aylsham, which was the original head of navigation. It flows into the North Sea by Breydon Water near Gorleston, further to the southeast. A special type of trading wherry, called the Bure wherry, was used on this river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Footbridge_over_drain_-_geograph.org.uk_-_1273030.jpg",
      "title": "Evelyn Simak / Footbridge over drain",
      "caption": "Footbridge over drain. This bridge takes the public footpath over a drain. The path here follows the river in southeasterly direction to Mayton bridge and beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Looking_across_the_River_Bure_-_geograph.org.uk_-_728307.jpg",
      "title": "Evelyn Simak / Looking across the River Bure",
      "caption": "Looking across the River Bure. At the site where St Mary's church once stood. No trace is left of this church. Bridge Farm can be seen in the distance (located in adjacent grid square)."
    }
  ],
  "distance_km": 9.5,
  "description": "This pretty riverside village is located in a lovely spot on the River Bure in the Norfolk Broads. It is often referred to as the \"Gateway to the Broads\" as it marks the start of the navigable portion of the River Bure. The village also includes an old thacthed church and the old Coltishall Station on The Bure Valley Railway. This route uses a section of the Bure Valley Path and other public footpaths to create a circular walk from the town. On the way there's nice views of the surrounding countryside and picturesque riverside paths along the River Bure. The walk starts at the old Coltishall Railway station where you can pick up the Bure Valley Path and follow the waymarked trail north west towards Little Hautbois and Buxton. Near here you cross the river to follow riverside paths back to Coltishall via Mayton Bridge and Mayton Hall.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rising Sun is in a lovely location right next to the river and adjacent to Coltishall Common. You can enjoy refreshments in the garden area with excellent views over the river. You can find the pub at 28 Wroxham Road with a postcode of NR12 7EA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and river trails are ideal fro a dog walk and the Rising Sun mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "From Coltishall Station you can enjoy a ride on the Bure Valley Railway. The steam trains run on Norfolk’s longest narrow gauge railway between Aylsham and Wroxham. It's a nostalgic day out with some fine broads scenery to enjoy on the way. Head east along the Bure Valley Path and you will soon come to the neighbouring town of Wroxham. There's lovely views here of Wroxham Broad and Hoveton Great Broad with excellent wildlife spotting opportunites at both. Here you can also pick up the Hoveton Walk which visits the nearby Hoveton Hall. The 19th century house includes some beautiful grounds with stunning gardens, a pretty lake and popular snowdrop walks in February. Also not far away is the lovely Ranworth Broad. There's a nature reserve here with a visitor centre, woodland, reed beds, a boardwalk and a huge variety of birdlife to see. There's also the noteworthy 16th century church of St Mary to visit in the village of Ranworth. The church has a 100ft tower which you can climb for excellent views over the area. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3G1rTJtP5Wc",
  "postcode": "NR12 7JG",
  "district": "Coltishall",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}