{
  "created_at": "2025-01-06T02:43:58.913587+00:00",
  "objectID": "2c0d31e85094e838683abe506b1208a8",
  "ref": "ampthill-park-walking-route",
  "title": "Ampthill Walks - Ampthill Park Walk",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Ampthill_Park_-_geograph.org.uk_-_583.jpg",
  "nearby": [
    {
      "description": "Greensand Ridge Walk",
      "objectID": "2ff60013a3fe963adfb865232091765c",
      "ref": "greensand-ridge-walk-walking-route"
    },
    {
      "description": "Maulden Woods",
      "objectID": "e86a8699007a59bfaf8030c188fc7791",
      "ref": "maulden-woods-walking-route"
    },
    {
      "description": "Wrest Park",
      "objectID": "e05ec438e9670a7a8ca59085dda64a1f",
      "ref": "wrest-park-walking-route"
    },
    {
      "description": "John Bunyan Trail",
      "objectID": "2c6219060d330beb650803a5941ebb8e",
      "ref": "john-bunyan-trail-walking-route"
    },
    {
      "description": "Stewartby Lake Country Park",
      "objectID": "8d035a6a8ff236550c9cfbea61debb20",
      "ref": "stewartby-lake-country-park-walking-and-cycle-route"
    },
    {
      "description": "Shefford",
      "objectID": "a9f1c53a9882e3f23202895b8f9f4607",
      "ref": "shefford-walking-route"
    },
    {
      "description": "Rowney Warren Wood",
      "objectID": "4131ce5417ef7dbe8d366c8fb1cce163",
      "ref": "rowney-warren-wood-walking-and-cycle-route"
    },
    {
      "description": "Flitwick",
      "objectID": "cb1cdeecae1cebfeda0946c32b595e29",
      "ref": "flitwick-walking-route"
    },
    {
      "description": "Chicksands Wood",
      "objectID": "2f5a1b20570c65724673164996803e49",
      "ref": "chicksands-wood-walking-route"
    },
    {
      "description": "Shefford",
      "objectID": "a9f1c53a9882e3f23202895b8f9f4607",
      "ref": "shefford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2c0d31e85094e838683abe506b1208a8.gpx",
  "_geoloc": {
    "lat": 52.0343758823,
    "lng": -0.4984171272
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Ampthill_Park_-_geograph.org.uk_-_583.jpg",
      "title": "Peter Roberts / Ampthill Park",
      "caption": "View from near Katherine's Cross Ampthill Park, looking North over the Bedfordshire plain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Ampthill_Park_House_-_geograph.org.uk_-_161468.jpg",
      "title": "Paul Dixon / Ampthill Park House",
      "caption": "Ampthill Park House was re-built between 1687-1689 under contract from the lease-holding Ossory family, by John Grumbold, the Cambridge mason and architect. It was altered between 1704-1707 under the direction of John Lumley and again by Robert Chambers between 1786-1772. The grounds were landscaped by Capability Brown."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Church_Tower_-_Ampthill_-_geograph.org.uk_-_522914.jpg",
      "title": "Dennis simpson / Church Tower - Ampthill",
      "caption": "Church Tower. The tower of St Andrews Church peeping through the trees. Visible from the John Bunyan Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/At_the_foot_of_the_Hill_-_geograph.org.uk_-_683845.jpg",
      "title": "Dennis simpson / At the foot of the Hill",
      "caption": "At the foot of the Hill. Farm buildings to the North of Ampthill Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Katherine%27s_Cross_-_geograph.org.uk_-_153976.jpg/256px-Katherine%27s_Cross_-_geograph.org.uk_-_153976.jpg",
      "title": "Paul Dixon / Katherine's Cross",
      "caption": "Katherine's Cross. The old Cross was erected in the 18th century to commemorate the time that Katherine of Aragon, first wife of King Henry VIII, was kept under house arrest at Ampthill Castle in 1533. This is the site of Ampthill Castle, and also where the \u0091Golden Hare\u0092 was buried as detailed in Kit Williams book \u0091Masquerade\u0092"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Ampthill_Town_Centre_-_geograph.org.uk_-_688411.jpg",
      "title": "Paul Billington / Ampthill Town Centre",
      "caption": "Ampthill Town Centre. This photograph shows the junction of Church St, Bedford St, Dunstable St and Woburn St in the centre of Ampthill. In the centre you can see the refurbished White Hart Hotel. The picture was taken from the corner of Bedford St and Church St."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Ampthill_Park_-_geograph.org.uk_-_154144.jpg/256px-Ampthill_Park_-_geograph.org.uk_-_154144.jpg",
      "title": "Paul Dixon / Ampthill Park",
      "caption": "View from the top of Ampthill Park, looking down towards the reservoir at the bottom of the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Ampthill_Park_-_geograph.org.uk_-_154142.jpg",
      "title": "Paul Dixon / Ampthill Park",
      "caption": "A painterly view from the top of Ampthill Park looking towards Bedford. The park is teeming with rabbits."
    }
  ],
  "distance_km": 2.0,
  "description": "Climb the Greensand Ridge and enjoy wonderful views over Bedfordshire in this pretty park in Ampthill. The park has good footpaths taking you to the high points and then around the pretty lake. There are also woodland trails in Laurel Wood and the option of extending your walk to the nearby Cooper's Hill which lies just to the south. In the park you will also find Katherine’s Cross - a memorial to Katherine of Aragon who stayed at the former Ampthill Castle. If you would like to continue your walk you could pick up the Greensand Ridge long distance walking trail which runs through the park. If you follow it east you will soon come to Maulden Woods where there are lots of nice woodland walking trails through semi-natural broadleaf woodland, acidic grassland and conifer plantations.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Queen's Head in Ampthill for some refreshments after your walk. This charming 18th century tavern is located in a great spot close to the park and the Greensand Ridge walk. There's a nice low-beamed saloon bar and a lounge to relax in here. The pub’s name refers to Catherine of Aragon who was imprisoned in Ampthill Castle while Henry VIII dissolved the monasteries and broke from the church of Rome. You can find them on Woburn Street with a postcode of MK45 2HP for your sat navs. There's also the on site Ampthill Hub cafe which sells a good range of meals and snacks."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland are ideal for dog walking so you'll probably see other owners on your walk. There are bins dotted around the park and you are asked to please keep them on leads around the car park and outside the cafe area. The Queen's Head pub mentioned above is dog friendly. Dogs are not allowed in the Hub cafe but there is seating outside where you can find water and biscuits for your dog."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head to nearby Silsoe and you can enjoy easy trails around Wrest Park. There's 92 acres of landscaped early eighteenth-century gardens to explore here. You can also enjoy a pleasant stroll around Silsoe village where there are a number of historic properties associated with the park estate. A couple of miles north of the park you'll find Stewartby Lake Country Park. There are some nice easy trails running around the park's large lakes. There's also 500 acres of parkland, woodland, grassland, meadow, and wetland habitats with wildlife to look out for. You can reach the park by following public footpaths north west past Millbrook for about 2 miles. The long distance John Bunyan Trail also passes through the area. The epic waymarked trail can be used to further explore the countryside surrounding Ampthill. Just to the south there's the neighbouring town of Flitwick where there's the Flitwick Moor Nature reserve to explore. The Site of Special Scientific Interest is the largest area of wetland in Bedfordshire. The village is also worth exploring with a medieval church and the Georgian Flitwick Manor, which is Grade II listed. For more walking ideas in the area see the Bedfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/yFVUchAIJ50",
  "postcode": "MK45 2HJ",
  "county": "Central Bedfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swaffield Close, Ampthill, Central Bedfordshire, England, MK45 2HJ, United Kingdom",
  "district": "Ampthill",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "memorial",
    "woodland trails",
    "long distance walking trail"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}