{
  "created_at": "2025-01-06T04:24:38.399281+00:00",
  "objectID": "2c10245d0aef7db4f6681cde77494dfc",
  "ref": "thorney-island-walking-route",
  "title": "Thorney Island Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Little_Deep%2C_Thorney_Island_-_geograph.org.uk_-_113156.jpg",
  "nearby": [
    {
      "description": "Chichester Harbour",
      "objectID": "4533e7ff5a4e6194eb25a8f820743ee4",
      "ref": "chichester-harbour-walking-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Hayling Island",
      "objectID": "7916221946784871c1a21ef6af29642b",
      "ref": "hayling-island-walking-route"
    },
    {
      "description": "Emsworth",
      "objectID": "e96f939c6e215bb8edb9657bf5bb2d48",
      "ref": "emsworth-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2c10245d0aef7db4f6681cde77494dfc.gpx",
  "_geoloc": {
    "lat": 50.8508784866,
    "lng": -0.9376315342
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Little_Deep%2C_Thorney_Island_-_geograph.org.uk_-_113156.jpg",
      "title": "Footprints / Little Deep, Thorney Island",
      "caption": "Little Deep, Thorney Island. A large expanse of reedbed, holding typical bird species such as Bearded Tit and Water Rail. This and the Great Deep used to make it a true island but it is now possible to walk around the perimeter sea wall. The village of West Thorney is located on the east coast of the island and has been incorporated into a British Army military base which occupies the southern part of the island, south of Great Deep."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Marker_Point%2C_Thorney_Island_-_geograph.org.uk_-_113183.jpg",
      "title": "Footprints / Marker Point, Thorney Island",
      "caption": "Marker Point. Showing the perimeter wall, ditch and unimproved grassland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Beach_and_Sea_Wall%2C_Thorney_Island_-_geograph.org.uk_-_113199.jpg",
      "title": "Footprints / Beach and Sea Wall, Thorney Island",
      "caption": "Beach and Sea Wall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Western_End_of_Great_Deep%2C_Thorney_Island_-_geograph.org.uk_-_113162.jpg",
      "title": "Footprints / Western End of Great Deep, Thorney Island",
      "caption": "Western End of Great Deep. The Deeps are slightly tidal and the small amount mud in this creek attracted a variety of wading birds"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Coast_Path_near_Prinsted_-_geograph.org.uk_-_594262.jpg",
      "title": "Bob Parkes / Coast Path near Prinsted",
      "caption": "Coast Path near Prinsted. Facing Thornton Grange Marina."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/View_east_towards_Chichester_Harbour_-_geograph.org.uk_-_595672.jpg",
      "title": "Bob Parkes / View east towards Chichester Harbour",
      "caption": "View east towards Chichester Harbour. The Thornham Point intertidal habitat creation scheme is on the right"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Coastal_path_at_West_Thorney_-_geograph.org.uk_-_1715369.jpg/512px-Coastal_path_at_West_Thorney_-_geograph.org.uk_-_1715369.jpg",
      "title": "Ian Cunliffe / Coastal path at West Thorney",
      "caption": "Coastal path at West Thorney. This strangely named area lies on the east coast of the island and has been incorporated into a British Army military base which occupies the southern part of the island, south of Great Deep. The church of St Nicholas can also be found here. The original building dates from around 1100 A.D. Pilsey Island can be viewed just off the south eastern tip of Thorney Island. The island is an RSPB nature reserve and a designated Local Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Brackish_Pool_-_geograph.org.uk_-_113249.jpg",
      "title": "Footprints / Brackish Pool",
      "caption": "Brackish Pool. Inside the sea wall, not sure whether the salty water was coming through the sea wall or over it but clearly brackish from the surrounding plants"
    }
  ],
  "distance_km": 15.0,
  "description": "Enjoy a coastal circular walk around this beautiful peninsula in Chichester Harbour. The 9.5 mile walk starts from Emsworth, near the train station. From here you can pick up the Sussex Border Path long distance footpath to take you south towards the marina. The waymarked path then takes you along the coast to the village of West Thorney before returning to Emsworth. Along the way there's views of the River Ems and lots of coastal wildlife to look out for. Part of the island is taken up by a British Army military base so it's important to keep to the footpaths. At the southern end of the island you will find a causeway connecting to the RSPB Pilsey Island. The reserve consists of a wide range of coastal habitats including sandflats, mudflats, dunes, shingle and saltmarsh. Look out for nesting oystercatchers and ringed plovers in this area. To extend your walking in the area you could explore the Chidham peninsula on our Chichester Harbour Walk. It's located just to the east of Thorney Island and includes more nice coastal paths and great views of Bosham Quay and West Itchenor. You could also head west to Hayling Island and enjoy more lovely coastal paths and nature reserves.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Emsworth you could enjoy some post walk refreshment at the Blue Bell Inn. It's located in a lovely spot on the quay and includes an outdoor terrace where you can enjoy a good quality meal with views over the water. They serve a good selection of drinks and particularly fine fish and chips. You can find them on South Street at postcode PO10 7EG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The sea wall path makes for a fine bracing walk with your dog. The Blue Bell Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7i5fzpZ3MLo",
  "postcode": "PO10 7PQ",
  "district": "Emsworth",
  "county": "Hampshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}