{
  "created_at": "2025-01-06T04:53:58.574471+00:00",
  "objectID": "2c3d13ccb5bba1d77fb03162050a4001",
  "ref": "combe-martin-walking-route",
  "title": "Combe Martin Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/South_West_Coast_Path_on_Holdstone_Down_-_geograph.org.uk_-_1597064.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2c3d13ccb5bba1d77fb03162050a4001.gpx",
  "_geoloc": {
    "lat": 51.2070726216,
    "lng": -4.0376468169
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/South_West_Coast_Path_on_Holdstone_Down_-_geograph.org.uk_-_1597064.jpg",
      "title": "Philip Halling / South West Coast Path on Holdstone Down, via Wikimedia Commons",
      "caption": "South West Coast Path on Holdstone Down. The track as well as being the route of the South West Coast Path it is also the route of the Tarka Trail, Great Hangman can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/On_Girt_Down_-_geograph.org.uk_-_1597079.jpg",
      "title": "Philip Halling / On Girt Down, via Wikimedia Commons",
      "caption": "Junction of footpaths on Girt Down on the southern slopes of Great Hangman."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Combe_martin.jpg",
      "title": "Tony Atkin [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Combe Martin is said to have the longest village street in the country. This large village (or small town) is stretched out for two miles along a single road at the bottom of the valley. This photograph shows the north-western end of the village where it reaches the sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/War_Memorial_Combe_Martin.jpg/512px-War_Memorial_Combe_Martin.jpg",
      "title": "User:Jack1956 [CC0], via Wikimedia Commons",
      "caption": "The War Memorial attached to the churchyard at the Church of St Peter ad Vincula in Combe Martin"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Combe_Martin_-_geograph.org.uk_-_218882.jpg",
      "title": "Pam Brophy / Combe Martin, via Wikimedia Commons",
      "caption": "This photograph was taken from the base of Lester Cliff, looking across the beach towards the main street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/View_of_Highveer_Point_from_Holdstone_Down_-_geograph.org.uk_-_106562.jpg",
      "title": "Grant Sherman / View of Highveer Point from Holdstone Down, via Wikimedia Commons",
      "caption": "View of Highveer Point from Holdstone Down. Taken on the South West Coastpath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Footpath_junction_on_Holdstone_Down_-_geograph.org.uk_-_1597071.jpg",
      "title": "Philip Halling / Footpath junction on Holdstone Down, via Wikimedia Commons",
      "caption": "Footpath junction on Holdstone Down. At this point the South West Coast Path turns right and descends into Sherrycombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Combe_Martin%2C_Holdstone_Down_-_geograph.org.uk_-_72132.jpg",
      "title": "Martin Bodman / Combe Martin: Holdstone Down, via Wikimedia Commons",
      "caption": "Combe Martin: Holdstone Down. Looking west to Girt Down and the Great Hangman; seen from the South West Coast Path"
    }
  ],
  "distance_km": 12.0,
  "description": "This pretty coastal village is located on the north-west edge of the Exmoor National Park, close to some spectacular coastal scenery. Three significant long distance trails also pass the village so it is easy to explore the area on well maintained, waymarked footpaths. This loop takes you to some of the highlights to the east of the village including the highest point on the South West Coast Path. Starting in the village you pick up the Samaritans Way South West and head east past Lester Cliff and Wild Pear Beach to Little Hangman Cliff. The route climbs east to Great Hangman in the Hangman Hills. There's a cairn and fine views from the 1044 feet (318 metres) high summit here. The route continues past Girt Down to Holdstone Down where you can follow a circular footpath around Holdstone Hill. The route then returns to Combe Martin via Girt Down Farm, Netherton and Knap Down. The village is located on the edge of Exmoor where there's miles of excellent walking trails to try. The Heddon Valley is a great option with the climb giving great views back down to Combe Martin.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "From nearby Ilfracombe you can catch a boat to the beautiful Lundy Island. The island is owned by the National Trust and has some splendid coastal walking trails. It's also a nature reserve with lots of wildlife to see, including the famous Lundy puffins. Just to the south you'll find the National Trust's Arlington Court. There's a fascinating old carriage museum and some lovely trails through the gardens and parkland of this 19th century house."
    }
  ],
  "video_url": "https://www.youtube.com/embed/O5nrhRUFxho",
  "district": "North Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Kiln Pay & Display Car Park, Hangman Path, Combe Martin, North Devon, Devon, England, EX34 0DN, United Kingdom",
  "postcode": "EX34 0DN",
  "state": "England"
}