{
  "created_at": "2025-01-06T04:22:11.209823+00:00",
  "objectID": "2c51f794ccb9236457663018e9957fb7",
  "ref": "nottingham-canal-walking-and-cycle-route",
  "title": "Nottingham Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/The_Canal_House%2C_Nottingham_-_geograph.org.uk_-_1588505.jpg",
  "nearby": [
    {
      "description": "Wollaton Park",
      "objectID": "4e838f70b0cbd29e08b08a54c8d6faf4",
      "ref": "wollaton-park-walking-and-cycle-route"
    },
    {
      "description": "Erewash Valley Trail",
      "objectID": "0a9afadb35d1090581c1ae9fe3e5d241",
      "ref": "erewash-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Nottingham Circular Walk",
      "objectID": "380493c57684d7fbf967b4031743020b",
      "ref": "nottingham-circular-walk-walking-route"
    },
    {
      "description": "Attenborough Nature Reserve",
      "objectID": "b7e367bf4456cdd77ed859556dcdd097",
      "ref": "attenborough-nature-reserve-walking-route"
    },
    {
      "description": "Cossall",
      "objectID": "2b77cdd1c7ac95324a14ac2cd80ad8b0",
      "ref": "cossall-walking-route"
    },
    {
      "description": "Lambley Dumbles",
      "objectID": "f595803d9d6c3541aa4e83e8e52b0dce",
      "ref": "lambley-dumbles-walking-route"
    },
    {
      "description": "Lowdham",
      "objectID": "fec8433505e28625462ebd8a2c18748b",
      "ref": "lowdham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2c51f794ccb9236457663018e9957fb7.gpx",
  "_geoloc": {
    "lat": 53.0194194182,
    "lng": -1.323916651
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/The_Canal_House%2C_Nottingham_-_geograph.org.uk_-_1588505.jpg",
      "title": "Dave Hitchborne / The Canal House, Nottingham, via Wikimedia Commons",
      "caption": "Nottingham The Canal House - with a narrowboat moored inside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/The_Nottingham_Canal_-_geograph.org.uk_-_177106.jpg",
      "title": "Lynne Kirton / The Nottingham Canal, via Wikimedia Commons",
      "caption": "The canal widens at this point with a short spur, possibly a turning area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Nottingham_Canal%2C_Nottingham_-_geograph.org.uk_-_1569516.jpg",
      "title": "Dave Hitchborne / Nottingham Canal, Nottingham, via Wikimedia Commons",
      "caption": "The Nottingham Canal was opened in 1796 and cost £80,000. The Engineer was William Jessop, who was one of the greatest of the canal builders, much in demand for his skills during the last decade of the 18th century, when canal construction was at its peak."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/The_Nottingham_Canal_-_geograph.org.uk_-_177122.jpg",
      "title": "Lynne Kirton / The Nottingham Canal, via Wikimedia Commons",
      "caption": "The canal, with the marina beyond. The canal was abandoned in 1937, having carried no traffic for the previous decade, but continued to receive nominal maintenance until 1971. In 1976 the Nottingham Canal Society was formed with the aim of restoring the canal for navigation between Langley Mill and Trowell. Broxtowe Borough Council originally supported this objective, but since then open cast mining has made this unrealistic, and the lengths in Council ownership are managed for nature and as a public amenity."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/The_Nottingham_Canal_-_geograph.org.uk_-_809866.jpg",
      "title": "Kate Jewell / The Nottingham Canal, via Wikimedia Commons",
      "caption": "Canal North of the Cossall Road car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Nottingham_Canal%2C_Nottingham_-_geograph.org.uk_-_1569503.jpg",
      "title": "Dave Hitchborne / Nottingham Canal, Nottingham, via Wikimedia Commons",
      "caption": "Steps down to the canal from the rear of the houses between Chippendale Street and Cecil Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Former_Canal_Museum_-_geograph.org.uk_-_678703.jpg/256px-Former_Canal_Museum_-_geograph.org.uk_-_678703.jpg",
      "title": "Alan Murray-Rust / Former Canal Museum, via Wikimedia Commons",
      "caption": "Former Canal Museum. The museum in the former Fellows Morton and Clayton warehouses sadly closed down several years ago, despite the board on the building. The building now houses bar and restaurant; the whole of this section of canalside has been transformed with several eating and drinking establishments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Nottingham_Canal%2C_Nottingham_-_geograph.org.uk_-_1588416.jpg",
      "title": "Dave Hitchborne / Nottingham Canal, Nottingham, via Wikimedia Commons",
      "caption": "The bridge is Carrington Street, which leads to the railway station, a few metres to the right. The buildings to the left are The Canal House pub (former Canal Museum) and Fellows, Morton & Clayton Ltd., a traditional style pub."
    }
  ],
  "distance_km": 13.0,
  "description": "Enjoy a walk or cycle along this pretty canal in Nottingham. The route runs along the Erewash Valley Trail from Langley Mill to the outskirts of Nottingham. It's a nice flat ride which is ideal for families. The route starts at Langley Mill and heads south to Cossall and Trowell. This area has now been declared as a nature reserve which attracts lots of dragonflies, damselflies and birdlife. On the Trowell section are the remains of Swansea bridge, one of the original stone bridges, which was built around 1793–95. From here you can see the original stone built lock keepers cottages. The route finishes very close to Wollaton Park where you can extend your outing. The large country park consists of an exquisite Elizabethan mansion surrounded by acres of parkland, woodland, lakes, formal gardens and the deer park. The video below shows the Erewash Valley Trail which includes this section along the Nottingham Canal.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "A must see on the canal is the unique Canalhouse pub in the city centre. It is famous for having a canal that extends into the Grade II listed building, complete with resident narrow boats. There's also a large covered beer garden situated by the canal side which enables people to sit outside no matter the weather. You can find it at 48-52 Canal Street, NG1 7EH Also of interest is the Fellows, Morton & Clayton housed in the former museum. The 19th century pub has nice outdoor seating next to the canal. It's also on Canal Street near to the Canalhouse pub."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For another easy waterside stroll near the city head a few miles east to the picturesque Gunthorpe. This lovely village includes a pretty lock, a rushing weir and a fine riverside hotel for post walk refreshment. Rolleston, Burton Joyce and Fiskerton with its million pound properties are just up the river from here as well. Head into the city centre and you could pick up the Beeston Canal and follow it west to the pretty Beeston Lock. The lovely Attenborough Nature Reserve can also be found at the end of the canal. On the north eastern side of the city there's the delightful Lambley Dumbles to visit. There's much to enjoy here with steep sided valleys, streams, orchards, waterfalls, ancient woodland and lots of interesting geology and flora to see. Lambley village is also worth a visit with two fine pubs to relax in after your exercise. Just next to here is the neighbouring settlement of Lowdham where there's a 13th century church and some fine walks through the valley of the Cocker Beck. For more walking ideas in the area see the Nottinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SAkEe2MoGg8",
  "district": "Amber Valley",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Access 26 Business Park, Derby Road, Aldercar and Langley Mill CP, Langley Mill, Amber Valley, Derbyshire, East Midlands, England, NG16 4AA, United Kingdom",
  "postcode": "NG16 4AA",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "woodland",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "park"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible",
    "play area"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}