{
  "objectID": "2c6884b809e93651240c9e055ca1135c",
  "created_at": "2024-12-18T22:56:01.309232+00:00",
  "ref": "hengistbury-head-walking-route",
  "title": "Hengistbury Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/be/Hengistbury_Head_-_geograph.org.uk_-_1048003.jpg",
  "nearby": [
    {
      "description": "Christchurch Harbour",
      "objectID": "8752182f29690fd1df755e404b4985ba",
      "ref": "christchurch-harbour-walking-route"
    },
    {
      "description": "Stanpit Marsh",
      "objectID": "25e329625a3096c098ae6ac2e0fd8249",
      "ref": "stanpit-marsh-walking-route"
    },
    {
      "description": "Bournemouth Coast Path",
      "objectID": "d50c66d416dab7c728178083d4565e12",
      "ref": "bournemouth-coast-path-walking-route"
    },
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/20A483124178071180257DD6006F2BD5/$FILE/Hengistbury Head.gpx",
  "_geoloc": {
    "lat": 50.7275534838,
    "lng": -1.7761617658
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Hengistbury_Head_-_geograph.org.uk_-_1048003.jpg",
      "title": "Nigel Mykura / Hengistbury Head",
      "caption": "View west along the top of Warren Hill towards the coast guard lookout and in the distance the Isle of Wight. This area is extremely popular with day trippers because of the views, beaches and nature reserves."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Hengistbury_Head_-_geograph.org.uk_-_1236146.jpg",
      "title": "Chris Gunns / Hengistbury Head",
      "caption": "View of the headland and the beach on a gorgeous spring day in 2009. The Isle of Wight and Needles visible in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Hengistbury_Head_-_geograph.org.uk_-_1737844.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Woodland, marsh and meadow are packed into the mile long Hengistbury Head, a wild and windswept promontory curling like a finger around Christchurch Harbour. It is a tiny world in itself, with a history of human activity spanning 11,000 years. The 118 ft summit of Warren Hill forms a broad plateau ending in sand-cliffs plunging to the sea. A constant wind from the sea keeps the clumps of ling, heather and gorse low-growing, and the turf is thin and patchy. But in the lee of the hill are woodlands, scrub and marshes bordering the harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/View_from_Hengistbury_Head_-_geograph.org.uk_-_10333.jpg",
      "title": "Stuart Buchan / View from Hengistbury Head",
      "caption": "View along Mudeford beach from the top of the headland. Some of the beach huts are as expensive as a full size house!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Tourist_Land_Train%2C_Hengistbury_head_-_geograph.org.uk_-_1048296.jpg",
      "title": "Nigel Mykura / Tourist Land Train, Hengistbury head",
      "caption": "Tourist Land Train. This vehicle pulls tired tourists to and from Hengistbury head and the car park at the end of the Broadway from Southbourne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Hengistbury_Head%2C_cliffs_-_geograph.org.uk_-_644385.jpg",
      "title": "Chris Downer / Hengistbury Head: cliffs",
      "caption": "The cliffs here are around 20m high. The coastguard lookout can be seen on the hilltop, while Bournemouth can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Beach_near_Hengistbury_Head_-_geograph.org.uk_-_1047999.jpg",
      "title": "Nigel Mykura / Beach near Hengistbury Head",
      "caption": "Beach near Hengistbury Head. Looking west along the beach from the southern end of the double dykes that were the defences of the prehistoric port area. In the foreground can be seen the gabions which have successfully reduced the erosion. Where there are no gabions the coast has receded much more"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Warren_Hill%2C_Hengistbury_Head_-_geograph.org.uk_-_1039113.jpg",
      "title": "Mike Faherty / Warren Hill, Hengistbury Head",
      "caption": "Warren Hill. The eastern corner of Warren Hill as seen from the southern end of Mudeford Spit. Sea-facing beach huts on the right."
    }
  ],
  "distance_km": 7.0,
  "description": "Follow the miles of walking trails in this stunning nature reserve on the Dorset coast. After a short climb to the summit of Hengistbury Head you will be rewarded with  fabulous views of the Isle of Wight, Mudeford Spit, Christchurch Harbour and Priory, the Purbeck Hills and Bournemouth Pier and beach. You can also walk along the lovely Mudeford Spit with its gorgeous beaches lined with pretty beach huts. The trails are on well defined gravel paths taking you through lovely heathland and sand dunes with views of freshwater ponds, reed beds and salt marshes. Over 300 bird species have been recorded in the area including Purple Heron, the Pink-footed Goose, the European Honey Buzzard, the Melodious Warbler and numerous Skylarks. There is also a wildlife pond where the country's rarest amphibian, the Natterjack Toad can be spotted. The Bournemouth Coast Path and the Stour Valley Way both run past Hengistbury Head so you could pick up either of these long distance trails to continue your walk. On the opposite side of Christchurch Harbour you can visit the lovely Stanpit Marsh Nature Reserve. The reserve is home to horses, foals, rabbits and a variety of wading birds. It also contains lagoons, reedbeeds and marshland with splendid views back towards Hengistbury Head and Christchurch Priory. You can reach the reserve by catching the ferry from Mudeford and then heading west for about a mile to Stanpit.",
  "video_url": "https://www.youtube.com/embed/pOAVuqyo2Ag",
  "postcode": "BH6 4LP",
  "district": "Bournemouth",
  "county": "Bournemouth, Christchurch and Poole",
  "region": "South West",
  "country": "England"
}