{
  "created_at": "2025-01-06T05:21:10.685986+00:00",
  "objectID": "2c730355290c16a7bd5978cfad46d1e8",
  "ref": "wansford-walking-route",
  "title": "Wansford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/24/Wansford_bridge_-_geograph.org.uk_-_1209325.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2c730355290c16a7bd5978cfad46d1e8.gpx",
  "_geoloc": {
    "lat": 52.5826032645,
    "lng": -0.4124837505
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Wansford_bridge_-_geograph.org.uk_-_1209325.jpg",
      "title": "Michael Trolove / Wansford bridge",
      "caption": "Wansford bridge. The village was bypassed in 1929, a new bridge was required to span the river Nene. This concrete structure was built to carry the Great North Road. Motorists now use this bridge for north bound traffic whilst a new structure carries the south bound carriageway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Narrowboat_on_the_River_Nene_near_Wansford_station_-_geograph.org.uk_-_1563496.jpg",
      "title": "Andy F / Narrowboat on the River Nene near Wansford station",
      "caption": "Narrowboat on the River Nene near Wansford station. This narrowboat is moored at a landing stage intended for boaters visiting Wansford station on the Nene Valley Railway. The station buildings can be seen through the trees (left centre of photo) and beyond the landing stage (right of photo)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/River_Nene_-_geograph.org.uk_-_528943.jpg",
      "title": "Richard Croft / River Nene",
      "caption": "River Nene. Looking south from Wansford Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Yarwell_Mill_from_the_Nene_Way_-_geograph.org.uk_-_1319624.jpg",
      "title": "Michael Trolove / Yarwell Mill from the Nene Way",
      "caption": "Yarwell Mill from the Nene Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Lock_gates_at_Yarwell_Mill_-_geograph.org.uk_-_1319711.jpg",
      "title": "Michael Trolove / Lock gates at Yarwell Mill",
      "caption": "Lock gates at Yarwell Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Nassington_-_geograph.org.uk_-_900268.jpg",
      "title": "Graham Taylor / Nassington",
      "caption": "Nassington. The upper fishpond at the Prebendal Manor House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Church_Street%2C_Nassington_%28geograph_4137001%29.jpg",
      "title": "JThomas / Church Street, Nassington",
      "caption": "Church Street, Nassington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Bedford_Purlieus_-_geograph.org.uk_-_1228194.jpg",
      "title": "Simon Huguet / Bedford Purlieus",
      "caption": "Bedford Purlieus. The ancient woodland is a National Nature Reserve managed by the Forestry Commission."
    }
  ],
  "distance_km": 13.0,
  "description": "This picturesque Cambridgeshire village sits in a nice location on the River Nene, near the border with Northamptonshire. There's woodland trails in a nearby National Nature Reserve and nice riverside paths to enjoy in this area. This circular walk from the village visits the River Nene, Yarwell, Nassington and the Bedford Purlieus National Nature Reserve. The walk starts in the village centre where you can pick up the Nene Way and follow the waymarked footpath south past Wansford Bridge to Yarwell where there's a mill, lock and weir on the river. The trail continues round to Nassington where you'll pass Nassington Manor before crossing the dismantled railway to the north of the village. The route then heads north along country lanes to visit the Bedford Purlieus National Nature Reserve where there are miles of woodland trails, bluebells, wildflowers and lots of wildlife to look out for. You then head east past the Old Sulehay Forest to return to Wansford.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to The Paper Mills for some post walk refreshment. The inn sits in a nice location overlooking the old bridge and includes a lovely garden area for warmer days. You can find them on London Road at postcode PE8 6JB for your sat navs. In Nassington there's the noteworthy Queens Head. The village inn dates back to the 17th century, and is constructed from local limestone. It features a spacious, beamed main bar complete with an open fire and a flagstone serving area that boasts a stone counter. The inn houses two dining areas, divided by a genuine fireplace and chimney breast. The menu is quite diverse, including steaks prepared in a Spanish charcoal oven. There's also a function room located towards the back. The rear of the inn opens up to an appealing garden, and boat moorings are available on the River Nene. Additionally, it offers nine en-suite bedrooms, designed in a courtyard style. You can find them at postcode PE8 6QB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk and The Paper Mills mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Continue south along the Nene Way and you could visit neighbouring Fotheringhay where there's an old castle motte to see in the attractive village. If you head east along the river you'll come to the lakes at Ferry Meadows Country Park in Peterborough. A few miles to the west there's some excellent mountain bike trails and walking routes to be found at Wakerley Woods and Fineshade Woods. Near here there's also the noteworthy Harringworth Welland Viaduct to admire. The Grade II listed viaduct is about a kilometre long, and was completed in 1878. It contains 82 arches and is notable as the longest masonry viaduct across a valley in Britain. Just to the east of Fineshade you'll find the pretty village of King's Cliffe where you can pick up the Kings Cliffe Railway Walk. The easy trail runs along a now disused railway line to the east of the village. King's Cliffe is also a pleasant place for a stroll with a Norman church, picturesque 17th century almshouses and nice views of the Willow Brook, a tributary of the River Nene. There's also a fine old 18th century pub for refreshments afterwards. Near here there's also Blatherwycke Lake to explore. There's some lovely waterside trails with lots of birdlife to see on the water at this scenic spot. For more walking ideas in the area see the Cambridgeshire Walks page."
    }
  ],
  "district": "Wansford",
  "county": "City of Peterborough",
  "region": "Cambridgeshire and Peterborough",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A47, Wansford, City of Peterborough, Cambridgeshire and Peterborough, England, PE8 6LG, United Kingdom",
  "postcode": "PE8 6LG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}