{
  "created_at": "2025-01-06T04:06:53.012290+00:00",
  "objectID": "2cc9a85fdda569b212bf7cb56821af0c",
  "ref": "kingsclere-walking-route",
  "title": "Kingsclere Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Kingsclere_Pond_-_geograph.org.uk_-_360892.jpg",
  "nearby": [
    {
      "description": "Watership Down",
      "objectID": "4e85221010fb6bee23d097fdb4dd5434",
      "ref": "watership-down-walking-route"
    },
    {
      "description": "Wayfarer's Walk",
      "objectID": "76ac4e5b6ada710f71e9eb6dd617b05e",
      "ref": "wayfarers-walk-walking-route"
    },
    {
      "description": "Brenda Parker Way",
      "objectID": "33c21cf7603e62ef05da9094fb6c6e34",
      "ref": "brenda-parker-way-walking-route"
    },
    {
      "description": "Greenham Common",
      "objectID": "4c927dc924ac38c4d88aabbf3acf2906",
      "ref": "greenham-common-walking-route"
    },
    {
      "description": "Overton",
      "objectID": "a1a24bc47dc6757e4e2e80e0de8c20d5",
      "ref": "overton-walking-route"
    },
    {
      "description": "Bowdown Woods",
      "objectID": "7e4fc4b236132f3a6b9728b27538038f",
      "ref": "bowdown-woods-walking-route"
    },
    {
      "description": "Beacon Hill",
      "objectID": "30c19b7b182fc66a0cc684e3f9918e81",
      "ref": "beacon-hill-newbury-walking-route"
    },
    {
      "description": "Ecchinswell",
      "objectID": "f6a9e071496335e1a3a248006677fc8b",
      "ref": "ecchinswell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2cc9a85fdda569b212bf7cb56821af0c.gpx",
  "_geoloc": {
    "lat": 51.3241042112,
    "lng": -1.2482733307
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Kingsclere_Pond_-_geograph.org.uk_-_360892.jpg",
      "title": "Graham Horn / Kingsclere Pond",
      "caption": "Kingsclere Village Pond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Church_in_Kingsclere_-_geograph.org.uk_-_4823.jpg",
      "title": "Pam Brophy / Church in Kingsclere",
      "caption": "Church in Kingsclere. The church is situated in the centre of the upper half of the grid square. It includes a filled in Norman doorway dating from the 12th century. The picture was taken from the east side of the church looking west (hence problems with the sun!). Kingsclere is an attractive village with many very old buildings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Trig_point%2C_Watership_Down_-_geograph.org.uk_-_305480.jpg",
      "title": "Andrew Smith / Trig point, Watership Down",
      "caption": "Trig point, Watership Down. Just inside the flat arable farmland that abuts the gallops. This view looks across to the wooded Sidown Hill, just beyond Beacon Hill, with Ladle Hill just in shot in mid distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Watership_Down_-_geograph.org.uk_-_16474.jpg",
      "title": "Kelvin Davies / Watership Down",
      "caption": "Racehorse gallops on top of Watership Down, looking West."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/The_Warren_and_White_Hill_-_geograph.org.uk_-_711994.jpg",
      "title": "David Collins / The Warren and White Hill",
      "caption": "The Warren and White Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/The_Hut_on_Cannon_Heath_Down_-_geograph.org.uk_-_361201.jpg",
      "title": "Graham Horn / The Hut on Cannon Heath Down",
      "caption": "The Hut on Cannon Heath Down Magnificent views"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Freemantle_Park_Down_and_Plantation_Hill_-_geograph.org.uk_-_173617.jpg",
      "title": "Andrew Smith / Freemantle Park Down and Plantation Hill",
      "caption": "Freemantle Park Down and Plantation Hill. Looking east from the end of Coronation Plantation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/The_Hannington_Transmitter_-_geograph.org.uk_-_711989.jpg/256px-The_Hannington_Transmitter_-_geograph.org.uk_-_711989.jpg",
      "title": "David Collins / The Hannington Transmitter",
      "caption": "The Hannington Transmitter, located just south of the village on Freemantle Park Down. A substantial area is fenced off, to allow for all the restraining wires to be grounded within the site. This is the transmitter that most people in this area will have their TV aerials pointed at. If you hear the aerial engineer refer to \"getting a sight of Hannington\" this is what he is talking about."
    }
  ],
  "distance_km": 11.0,
  "description": "This Hampshire based village is surrounded by beautiful countryside in all directions. There are lovely climbs to the Downs south of the village, while to the east there are woodland trails to try in Sandford Woods and Wolverton Common. The village also has an interesting history with many historic buildings and strong connections with horse racing. The Park House Stables has produced some famous racehorses over the years, with TV presenter and former jockey, Clare Balding now part of the team running the stables. This circular walk from the village climbs to one of the highlights of the area at Watership Down. The hill was made famous by Richard Adams' 1972 novel and the subsequent 1978 animated film. The route then goes on to explore Freemantle Down, just to the south of the village. The walk starts in the village centre and follows footpaths south west to climb to Watership Down. From this elevated position there are wonderful views over the surrounding countryside and the Sydmonton Court estate. The estate consists of a 16th century Tudor manor house and is home to the summer arts Sydmonton Festival. On the Down you can pick up the Wayfarer's Walk. This waymarked trail can be followed east to Canon Heath Down and Stubbington Down. Here you turn north east towards Freemantle Down and Cottington's Hill where there's the Hannington TV transmitter. The route then descends to the north to return to Kingsclere.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to The Crown for some well earned refreshments. The classic village pub includes a cosy interior with a log fire for the winter days. In warmer weather there's the outdoor area where you can sit and watch the world go by. They have a good menu and can be found at postcode RG20 5QU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route are ideal for fit dogs. The Crown pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles west of the village you'll find one of the highlights of the area at Highclere Castle. The house is famous as the location of period drama 'Downton Abbey'. It's surrounded by a 5000 acre estate with miles of good walking trails including the fine viewpoint on Beacon Hill. You could follow the Brenda Parker Way to the castle. The epic long distance footpath passes through the village and can be used to explore the surrounding villages and countryside on foot. Also to the west is the neighbouring village of Ecchinswell. It's a pretty place which includes a noteworthy pub with a particularly huge garden area. Head a few miles north and there's the expansive Greenham Common and adjacent Bowdown Woods to explore. This area of heathland is covered in heather and gorse and has nice wide footpaths to follow.  Head south along the Wayfarer's Walk and it will take you towards Deane Park and the village of Overton. The village is notable as the site of the source of the River Test. Just west of the village there's also the small town of Whitchurch to explore. The worthy town has a lovely mill trail visiting the historic Silk Mill and other old buildings along the River Test. Near here there's also St Mary Bourne with its rows of picturesque thatched cottages and views of the pretty Bourne Rivulet, a tributary of the River Test. For more walking ideas in the area see the Hampshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HANOxGlvY8o",
  "postcode": "RG20 5PJ",
  "district": "Basingstoke and Deane",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swan Street, Phaleron Cottages, Kingsclere, Basingstoke and Deane, Hampshire, England, RG20 5PJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical buildings",
    "viewpoint",
    "estate"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}