{
  "created_at": "2025-01-06T11:16:46.453661+00:00",
  "objectID": "2ce43ec7237ceff20961c5eb68d6819f",
  "ref": "arthurs-seat-easy-route",
  "title": "Arthur's Seat Easy Route Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Arthur_S_Seat_Edinburgh_%28215567135%29.jpeg/512px-Arthur_S_Seat_Edinburgh_%28215567135%29.jpeg?20180806222346",
  "nearby": [
    {
      "description": "Arthur's Seat",
      "objectID": "281baad9985593d3d43672657877c383",
      "ref": "arthurs-seat-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2ce43ec7237ceff20961c5eb68d6819f.gpx",
  "_geoloc": {
    "lat": 55.9449085105,
    "lng": -3.1528509944
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Arthur_S_Seat_Edinburgh_%28215567135%29.jpeg/512px-Arthur_S_Seat_Edinburgh_%28215567135%29.jpeg?20180806222346",
      "title": "Dominic Hauton, CC0, via Wikimedia Commons",
      "caption": "Arthur’s Seat is the main peak in Holyrood Park, rising 251 metres (823 feet) above sea level. It is the remnant of an extinct volcano, and its distinctive shape, with a broad, flat summit, has made it a notable feature of Edinburgh’s skyline. The summit provides panoramic views of the city and beyond, including the Firth of Forth, the Pentland Hills, and the Isle of May on clear days. The hill itself has a fascinating history. Archaeological evidence suggests that Arthur's Seat has been a site of human activity for thousands of years, with ancient Iron Age forts discovered on the slopes. It is thought that the name \"Arthur's Seat\" could be linked to the legendary King Arthur, though the exact origin of the name remains uncertain. The hill has also been a place of pilgrimage, religious ceremonies, and even royal hunts over the centuries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Gorse_on_Arthur%27s_Seat_-_geograph.org.uk_-_2881882.jpg?20211215085406",
      "title": "Gorse on Arthur's Seat by kim traynor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gorse on Arthur's Seat. As you ascend, the flora around you changes depending on your elevation. At lower levels, you’ll find grasses, gorse, and patches of heathland, with vibrant yellow gorse flowers in spring and early summer. As you climb higher, the vegetation becomes sparser, and the rocky terrain is home to hardy plants like lichen, moss, and some stunted grasses. In the spring and summer months, the hill comes alive with purple heather, which adds a touch of colour to the landscape. The fauna on the hill is diverse. Common sightings include red grouse, kestrels, and skylarks. The area also provides habitat for smaller creatures like rabbits and the occasional fox. In the quieter months, you might spot some deer in the surrounding areas of Holyrood Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/View_from_Arthur%27s_Seat_-_geograph.org.uk_-_2438683.jpg?20210804180335",
      "title": "View from Arthur's Seat by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The view from Arthur's Seat is one of the most rewarding aspects of the walk. From here you’ll have an incredible panoramic view of Edinburgh, with the Old Town and its medieval buildings contrasting with the Georgian architecture of the New Town. To the south, you can look across the green expanse of Holyrood Park, with Dunsapie Loch lying below you. On clear days, the Firth of Forth and its islands provide a stunning backdrop to the city, while the Pentland Hills to the south-west are easily visible. If you turn towards the east, you can spot the North Sea, and on a really clear day, the Isle of May is visible in the distance. The city skyline, dominated by Edinburgh Castle, the Scottish Parliament building, and the spires of various churches, makes for a striking contrast against the natural beauty of the surrounding hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Dunsapie_and_Dunsapie_Loch_-_geograph.org.uk_-_6969332.jpg/512px-Dunsapie_and_Dunsapie_Loch_-_geograph.org.uk_-_6969332.jpg?20241117012414",
      "title": "Dunsapie and Dunsapie Loch by Thomas Nugent, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dunsapie and Dunsapie Loch"
    }
  ],
  "distance_km": 1.2,
  "description": "This walk takes you up to Arthur's Seat from the Dunsapie Loch car park. It's the shortest route to the top at under a mile there and back. Your walk begins at Dunsapie Loch, a serene, small loch nestled at the base of Arthur’s Seat. The surrounding area is a tranquil space for wildlife, and it's common to spot birds like ducks and swans gliding across the water. The parking area is located to the south of the loch, where the path starts on the western side. From here, you'll follow a clearly marked trail that gently rises up the hillside, heading in a westerly direction towards the summit. The trail is straightforward and well-trodden, making it accessible for most walkers. The path is relatively short, winding its way up the slope and offering views as you rise higher. Along the way, you'll see various grassy patches, gorse bushes, and heather, typical of the Edinburgh hills. The ground can be a little rocky in places, so it's a good idea to wear sturdy footwear. The ascent is gradual, and although it's a bit of a climb, the path is not too steep, making it suitable for a leisurely walk.",
  "details": [],
  "county": null,
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Queen's Drive, Duddingston Village, Northfield/Willowbrae, City of Edinburgh, Alba / Scotland, EH16 5UT, United Kingdom",
  "postcode": "EH16 5UT",
  "district": "City of Edinburgh",
  "state": "Alba / Scotland"
}