{
  "created_at": "2025-01-06T04:08:37.352551+00:00",
  "objectID": "2ce78bd4a80f7f4211fb17b1f55cd7ae",
  "ref": "lulworth-cove-to-osmington-mills-coastal-walk-walking-route",
  "title": "Lulworth Cove to Osmington Mills Coastal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b0/West_Lulworth%2C_Lulworth_Cove_-_geograph.org.uk_-_532886.jpg",
  "nearby": [
    {
      "description": "Osmington White Horse",
      "objectID": "68dd451a6005d70868fb6e73ae29e092",
      "ref": "osmington-white-horse-walking-route"
    },
    {
      "description": "Winfrith Newburgh",
      "objectID": "6c814cd6b82dba041eeb0bfb7a346691",
      "ref": "winfrith-newburgh-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2ce78bd4a80f7f4211fb17b1f55cd7ae.gpx",
  "_geoloc": {
    "lat": 50.6202772182,
    "lng": -2.2543102844
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/West_Lulworth%2C_Lulworth_Cove_-_geograph.org.uk_-_532886.jpg",
      "title": "Chris Downer / West Lulworth: Lulworth Cove, via Wikimedia Commons",
      "caption": "West Lulworth, Lulworth Cove"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Durdle_Door_-_geograph.org.uk_-_375257.jpg",
      "title": "Michael Robinson / Durdle Door, via Wikimedia Commons",
      "caption": "Durdle Door"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/View_west_from_Swyre_Head_-_geograph.org.uk_-_31348.jpg",
      "title": "Bob Ford / View west from Swyre Head, via Wikimedia Commons",
      "caption": "View west from Swyre Head. Swalland farm on the left, Smedmore House on the right and Kimmeridge Bay in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Ringstead_Bay_-_geograph.org.uk_-_1531467.jpg",
      "title": "Nigel Mykura / Ringstead Bay, via Wikimedia Commons",
      "caption": "Ringstead Bay. View west from above White Nothe cliffs showing Ringstead Bay in the foreground with the village of Ringstead just beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Coast_at_Osmington_Mills_-_geograph.org.uk_-_905011.jpg",
      "title": "Nigel Mykura / Coast at Osmington Mills, via Wikimedia Commons",
      "caption": "Coast at Osmington Mills. View SE along the coast from the mouth of Osmington Mill stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/The_Smugglers_Inn%2C_Osmington_Mills_-_geograph.org.uk_-_222672.jpg",
      "title": "Jim Champion / The Smugglers Inn, Osmington Mills, via Wikimedia Commons",
      "caption": "The Smugglers Inn, Osmington Mills. This pub is now the main feature of Osmington Mills and in the summer it is heaving with tourists and holidaymakers from the nearby Osmington Mills Holidays site. The pub was originally called The Crown Inn, later the Picnic Inn. The present name is a reference to the role that the pub's past landlords played in smuggling. The South West coast path runs alongside the stream in front of the pub and up the steps on the right in the foreground."
    }
  ],
  "distance_km": 10.5,
  "description": "This walk follows a lovely section of the Jurassic Coast from Lulworth Cove to Osmington Mills. On the way you'll pass several highlights of the area including Durdle Door, Swyre Head and Ringstead Bay. The walk starts at the car park at Lulworth Cove and heads west past St Oswald's Bay along the waymarked South West Coast Path. After a short while you will come to the natural limestone arch of Durdle Door where you can descend to the little beach if you have time. After passing the arch the route continues to Swyre Head, the highest point in the Purbeck Hills. It's a great spot standing at an elevation of 208 m (682 ft) and commanding views as far as Dartmoor and the Isle of Portland near Weymouth. The Isle of Wight, Lulworth Cove, Poole Harbour and much of the Purbeck Hills are also visible on a clear day. The route then descends from the hill and continues to Ringstead Bay. It's another stunningly beautiful area with the cliffs and views at White Nothe particularly special. Soon after passing the bay you come into Osmington Mills where there's a pretty village with a nice pub for refreshments. If you'd like to extend your walk you could climb to the Osmington White Horse and enjoy more wonderful views.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the end of the walk head to the splendid Smuggler's Inn for some well earned refreshments. Situated on the cliff tops of the South West Coast Path, just outside the village of Osmington, the Smugglers Inn is a traditional English pub with stunning views overlooking the Isle of Portland. The pub also has an interesting history having been the headquarters of the French smuggler Pierre Latour and one of the main landing places for smuggled goods in the 17th century. Notably the Inn was originally built in the 13th century, with its own brewery at the rear. There's a lovely large garden area which is perfect for relaxing in when the weather is fine. You can fine the pub right on the coast at a postcode of DT3 6HF for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Lulworth you can can continue your walking at the Lulworth Range Walks. The military owned area includes the fascinating deserted village of Tyneham. The village was abandoned during the second world war when all the residents were told to leave so the area could be used for military training. Today you can enjoy a stroll around the ruined buildings and visit the associated museum. Head a couple of miles inland from Lulworth Cove and you could visit the historic Lulworth Castle. The castle dates back to the 17th Century and includes some beautiful grounds and gardens. Near here there's the Winfrith Newburgh Heath and Tadnoll Nature Reserves. The reserves include miles of peaceful heathland trails with lots of wildlife and a splendid viewpoint. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "postcode": "BH20 5RJ",
  "district": "West Lulworth",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lulworth Cove Heritage Centre, Main Road, West Lulworth, Dorset, England, BH20 5RJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "hill"
  ],
  "points_of_interest": [
    "viewpoints",
    "natural arches",
    "cliffs"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}