{
  "created_at": "2025-01-06T00:39:12.713429+00:00",
  "objectID": "2d0e5d76279d2821c7623efa873e4c8d",
  "ref": "purbeck-circular-walk-walking-route",
  "title": "Purbeck Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Beach_Huts_-_geograph.org.uk_-_599619.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2d0e5d76279d2821c7623efa873e4c8d.gpx",
  "_geoloc": {
    "lat": 50.6109491592,
    "lng": -1.957583048
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Beach_Huts_-_geograph.org.uk_-_599619.jpg",
      "title": "Sebastian Ballard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Beach Huts along the seafront in Swanage. It was midweek and May but there were still a few holiday makers to be seen having their lunch in the huts which are available to rent throughout the season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Ballard_Down_-_geograph.org.uk_-_767235.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ballard Down. On top of the Purbeck ridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Outer_bailey_wall_west_of_the_outer_gatehouse_corfe_castle.jpg/512px-Outer_bailey_wall_west_of_the_outer_gatehouse_corfe_castle.jpg",
      "title": "JimChampion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Corfe Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Worth_Matravers_-_Pond_-_panoramio.jpg/512px-Worth_Matravers_-_Pond_-_panoramio.jpg",
      "title": "PJMarriott [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Worth Matravers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Bridleway_up_Godlingston_Hill_-_geograph.org.uk_-_1026478.jpg",
      "title": "Jim Champion / Bridleway up Godlingston Hill",
      "caption": "Bridleway up Godlingston Hill. A bridleway climbs up the Purbeck Chalk Ridge from Ulwell, on the south side of Godlingston Hill. The Purbeck Way follows this route to Corfe Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Bridleway_on_Ailwood_Down_-_geograph.org.uk_-_1026360.jpg",
      "title": "Jim Champion / Bridleway on Ailwood Down",
      "caption": "Bridleway on Ailwood Down. Here the Bridleway is descending along the top of the Purbeck chalk ridge from Nine Barrow Down to Brenscombe Hill. The bridleway, which the Purbeck Way trail follows, passes through the National Trust-owned Ailwood Down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Bridleway_junction_on_Brenscombe_Hill_-_geograph.org.uk_-_1026333.jpg",
      "title": "Jim Champion / Bridleway junction on Brenscombe Hill",
      "caption": "Bridleway junction on Brenscombe Hill. The bridleway along the top of the Purbeck chalk ridge continues on into the distance - it is also the route of the Ballard Point-Corfe Castle branch of the Purbeck Way. To the right the bridleway descends through Brenscombe Little Wood to the Studland Road west of Rempstone Hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Rollington_Hill_-_geograph.org.uk_-_2024533.jpg",
      "title": "Rollington Hill by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rollington Hill"
    }
  ],
  "distance_km": 26.0,
  "description": "A long circular walk exploring the beautiful Isle of Purbeck in Dorset. The walk runs for just over 15 miles using sections of the Purbeck Way, South West Coast Path long distance footpaths. Starting on the front in Swanage the route climbs north along the coast path to Ballard Down. From here you can enjoy wonderful views across the Purbecks, Poole Harbour, Studland and the Isle of Wight. You can also pick up the Purbeck Way here and follow it west to Corfe Castle. It's a splendid elevated path with great views for the whole way. You'll pass Ulwell where you'll have to climb down some steep steps before ascending past Round Down and Godlingston Hill. As you approach Corfe Castle there's fabulous views down to the ruins of the 11th century structure. The castle has a fascinating history being partially demolished in 1646 by the Parliamentarians during the English Civil War. At the village you turn south to follow trails through the countryside to the village of Worth Matravers. It's a pretty spot with a delightful duck pond and a nice cafe for refreshments. From the village it is a short walk to the coast at Seacombe Cliff. Here you pick up the waymarked coast path and head east past Dancing Ledge to Anvil Point Durlston Country Park. In the park you can see the Anvil Point Lighthouse and a wide variety of flora and fauna, including 33 species of breeding butterfly, over 250 species of bird recorded, 500 wildflowers, 500 moths. After passing through the park the route then descends back into Swanage to finish on the seafront. To extend your walking on the Isle of Purbeck you could try the shorter Corfe Castle, Old Harry Rocks and Chapmans Pool walks.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Worth Matravers stop for refreshments at the excellent Square and Compass pub. The pub has a nice beer garden to sit out in during the summer months. It's also notable as a Grade II listed building, originally built in the 18th century as a pair of cottages before becoming a public house. The building includes a museum of fossils and other local artefacts and the pub is one of only nine nationally that has been included in every edition of CAMRA's Good Beer Guide."
    }
  ],
  "postcode": "BH19 1LB",
  "district": "Swanage",
  "county": "Dorset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}