{
  "created_at": "2025-01-06T00:34:53.493635+00:00",
  "objectID": "2d46880195c0d7833ef8f4fabe198fb2",
  "ref": "cranbrook-walking-route",
  "title": "Cranbrook Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_High_Weald_Landscape_Trail_leads_past_The_Park_-_geograph.org.uk_-_1501019.jpg",
  "nearby": [
    {
      "description": "Sissinghurst Castle",
      "objectID": "658f8790c646d28d413c2f654f1d6050",
      "ref": "sissinghurt-castle-walking-route"
    },
    {
      "description": "Bedgebury Forest",
      "objectID": "a2d58bd9826e0215d56b2b4976926319",
      "ref": "bedgebury-forest-walking-and-cycle-route"
    },
    {
      "description": "High Weald Landscape Trail",
      "objectID": "c7b8c1bca6fbd4e77e5b71e851dba4a5",
      "ref": "high-weald-landscape-trail-walking-route"
    },
    {
      "description": "Bewl Water",
      "objectID": "e016f27e7e61d59b93cae067b96b5347",
      "ref": "bewl-water-walking-and-cycle-route"
    },
    {
      "description": "Goudhurst",
      "objectID": "1e804d3a58bde6c6f4498179907c73a0",
      "ref": "goudhurst-walking-route"
    },
    {
      "description": "Hemsted Forest",
      "objectID": "b6c0be0a21f2b16880c5a42bc61990b5",
      "ref": "hemsted-forest-walking-route"
    },
    {
      "description": "Burwash",
      "objectID": "6033aee99bc610fe07a28c8f35f65a58",
      "ref": "burwash-walking-route"
    },
    {
      "description": "Lamberhurst",
      "objectID": "a487ca18954784289c7322aae08ed7a0",
      "ref": "lamberhurst-walking-route"
    },
    {
      "description": "Scotney Castle",
      "objectID": "6e932dac1985933614652a1a687702d3",
      "ref": "scotney-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2d46880195c0d7833ef8f4fabe198fb2.gpx",
  "_geoloc": {
    "lat": 51.096638391,
    "lng": 0.5354780988
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_High_Weald_Landscape_Trail_leads_past_The_Park_-_geograph.org.uk_-_1501019.jpg",
      "title": "David Anstiss / The High Weald Landscape Trail leads past The Park",
      "caption": "The High Weald Landscape Trail leads past The Park. The long distance path heads from Cranbrook past land around Oak Hill Manor. In the background it turns right (see other walkers) heading towards Baker's Cross."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Track_near_Oak_Hill_Manor_-_geograph.org.uk_-_1803474.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Track near Oak Hill Manor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Kissing_Gate_near_Well_Wood_-_geograph.org.uk_-_1501032.jpg",
      "title": "David Anstiss / Kissing Gate near Well Wood",
      "caption": "Kissing Gate near Well Wood. This gate is on a footpath from Waterloo Place, Cranbrook. It heads through Well Wood before dividing at this gate. A path heads right towards Sissinghurst village centre. Another path heads straight on to the A252 The Street, near Sissinghurst Court."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Gatehouse_Oast%2C_The_Street%2C_Sissinghurst%2C_Cranbrook%2C_Kent_-_geograph.org.uk_-_483649.jpg",
      "title": "Oast House Archive / Gatehouse Oast, The Street, Sissinghurst, Cranbrook, Kent",
      "caption": "Gatehouse Oast, The Street, Sissinghurst, Cranbrook. Single round kiln oast house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/The_Bull_Inn%2C_Sissinghurst_Road%2C_Sissinghurst%2C_Kent_-_geograph.org.uk_-_1479055.jpg",
      "title": "Oast House Archive / The Bull Inn, Sissinghurst Road, Sissinghurst, Kent",
      "caption": "The Bull Inn, Sissinghurst Road, Sissinghurst, Kent Of C16 hall house origin. Grade II listed. Now the Milk House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Stile_and_footpath_into_orchards_near_Sissinghurst_-_geograph.org.uk_-_293770.jpg",
      "title": "Jonathan Billinger / Stile and footpath into orchards near Sissinghurst",
      "caption": "Stile and footpath into orchards near Sissinghurst"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Sissinghurst_Castle_Gardens_-_geograph.org.uk_-_1276146.jpg",
      "title": "JThomas / Sissinghurst Castle Gardens",
      "caption": "Sissinghurst Castle Gardens. Famous gardens created by Vita Sackville-West."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Cranbrook_Windmill_-_geograph.org.uk_-_962238.jpg",
      "title": "Julian P Guffogg / Cranbrook Windmill",
      "caption": "Cranbrook Windmill. The Mill is in working order, and is open to the public."
    }
  ],
  "distance_km": 9.0,
  "description": "This pretty Kent based town is surrounded by some lovely High Weald countryside and several large areas of woodland. It's an interesting town to stroll around too with several medieval buildings, a church known as the 'Cathedral of the Weald' and a very photogenic working windmill. This walk from the Cranbrook visits one of the highlights of the area at the nearby Sissinghurst Castle. It's about a 3 mile walk from the town to the castle, passing through some attractive woodland and farmland on the way. The walk starts from the centre of the town centre where you can pick up the High Weald Landscape Trail. Follow the trail north east past The Park, Wisley Green, Hilly Wood and Buckhurst Farm and you will soon come to Sissinghurst village. It's a quaint little village with a picturesque collection of pretty white clapboard cottages and a local pub. The route then heads north and then east to arrive at Sissinghurst Castle. There's 460 acres of parkland, woodland and gardens to explore on a number of well laid out footpaths. After exploring the castle grounds the route returns to Cranbrook on the same paths. Back in the village you could pay a visit to the notable Cranbrook Windmill. The working mill was built in 1814 and is the tallest smock mill in the United Kingdom. You can climb the sails for wonderful views over the area and learn all about the heritage of the town inside. Also of interest is the Church of St Dunstan which is known as the ‘Cathedral of the Weald’. The church includes the clock mechanism was the prototype for London's Big Ben.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town there's Larkin's Alehouse to try. This excellent micropub has a fine range of ales and ciders to sample. It's a friendly, award winning place with a lovely garden to sit out in. You can find them on the High Street at postcode TN17 3EB. On the route you could stop off in Sissinghurst village and visit The Milk House. It's a historic pub of some note being set in a former 16th century hall house. There's a charming olde worlde interior with timber beams and a Tudor fireplace. They do excellent food including some particularly delicious pizzas. Outside there's a lovely large garden area to relax in on warmer days. You can find them in the village at a postcode of TN17 2JG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails are a nice one to try with your dog. Most of the Sissinghurst parkland is open to dogs though they should be kept on leads around the livestock. The two pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a few miles south west of the town you'll find the expansive Bedgebury Forest. The forest is a great place for walking and cycling with miles of good trails to try. It includes the stunning Bedgebury Pinetum. This recreational and conservational arboretum has 10,000 trees growing across 320 acres including the most complete collection of conifers on one site in the world. It's one of the highlights of the area with a picturesque lake to see as well. Just south of Sissinghurst there's also lots of good paths and bridleways in Hemsted Forest. Just to the west of forest there's another major local attraction at Bewl Water. The huge lake has a splendid waterside walking trail and there's also cycle hire available. Head to the neighbouring town of Tenterden and you could visit Smallhythe Place on the Tenterden Walk. This National Trust half-timbered house was built in the late 15th or early 16th century. It was the home of the Victorian actress Ellen Terry from 1899 to her death in the house in 1928. The house contains Terry's theatre collection, while the cottage grounds include her rose garden, orchard, nuttery and the working Barn Theatre. It's an interesting local place to visit and it's very nice to stroll around the gardens on a fine day. Head west along the High Weald trail and it will take you to Goudhurst. This elevated village commands fine views over the area and also includes a picturesque village pond, rows of ancient cottages and a noteworthy 14th century church.  A few miles to the north east there's the neighbouring village of Biddenden. It's a worthy place to visit with a picturesque village green, a fine 15th century pub and a photogenic High Street with a number of old Flemish weavers cottages to admire. Lamberhurst village includes two historic sites in the shape of Scotney Castle and Bayham Old Abbey ruins. There's also a fine 15th century pub in the pretty village. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/NwdvvTqZLlM",
  "postcode": "TN17 3EE",
  "district": "Tunbridge Wells",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pages, 29, High Street, Cranbrook & Sissinghurst, Cranbrook, Tunbridge Wells, Kent, England, TN17 3EE, United Kingdom",
  "state": "England"
}