{
  "created_at": "2025-01-06T01:37:55.807979+00:00",
  "objectID": "2d5209eab07018cb6622531208c1300e",
  "ref": "weaver-way-walking-route",
  "title": "River Weaver Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Weaver_Way%2C_Audlem_-_geograph.org.uk_-_966195.jpg/256px-Weaver_Way%2C_Audlem_-_geograph.org.uk_-_966195.jpg",
  "nearby": [
    {
      "description": "Nantwich",
      "objectID": "541407b70b694d90c2d45ed9b6dc76fb",
      "ref": "nantwich-walking-route"
    },
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Shropshire Union Canal",
      "objectID": "d286ea892666d94e0e1ac40b769ac8f3",
      "ref": "shropshire-union-canal-walking-route"
    },
    {
      "description": "Northwich",
      "objectID": "5efd8a4bf593b492564141c0f18b1449",
      "ref": "northwich-walking-route"
    },
    {
      "description": "Frodsham Hill",
      "objectID": "11121181ef36130e3f202089450c3c0d",
      "ref": "frodsham-hill-walking-route"
    },
    {
      "description": "Marbury Country Park",
      "objectID": "c3eb78ac07e6a1da9b885cc285175e92",
      "ref": "marbury-country-park-walking-and-cycle-route"
    },
    {
      "description": "Sandstone Trail",
      "objectID": "820c3e87805731081e451f661a9e79d4",
      "ref": "sandstone-trail-walking-route"
    },
    {
      "description": "Audlem",
      "objectID": "07c8de237761242bb9124600e37ada9e",
      "ref": "audlem-walking-route"
    },
    {
      "description": "Winsford",
      "objectID": "2b5825031438ff9d3e74569d4dd72955",
      "ref": "winsford-walking-route"
    },
    {
      "description": "Anderton Boat Lift",
      "objectID": "dd8432d454333bf20b1163ce71e79ce9",
      "ref": "anderton-boat-lift-walking-route"
    },
    {
      "description": "Whitegate Way",
      "objectID": "1abf3c8ffa2b081b61c06156f8f26b8b",
      "ref": "whitegate-way-walking-and-cycle-route"
    },
    {
      "description": "Nantwich Riverside Loop",
      "objectID": "4167c953c03db88d4eb9bf507fcea998",
      "ref": "nantwich-riverside-loop-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2d5209eab07018cb6622531208c1300e.gpx",
  "_geoloc": {
    "lat": 52.9751130045,
    "lng": -2.5094119972
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Weaver_Way%2C_Audlem_-_geograph.org.uk_-_966195.jpg/256px-Weaver_Way%2C_Audlem_-_geograph.org.uk_-_966195.jpg",
      "title": "Eirian Evans / Weaver Way, Audlem",
      "caption": "Weaver Way, Audlem."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Private_canal_moorings_at_Audlem%2C_Cheshire_-_geograph.org.uk_-_1601502.jpg/512px-Private_canal_moorings_at_Audlem%2C_Cheshire_-_geograph.org.uk_-_1601502.jpg",
      "title": "Roger Kidd / Private canal moorings at Audlem, Cheshire",
      "caption": "Private canal moorings at Audlem, Cheshire. Seen below Lock No 13 of the flight of fifteen. There are plenty of visitor moorings available on the towpath side of the canal in Audlem, but it can be a crowded and popular place in the summer. The Shropshire Union Canal was opened in 1835 and is 66.5 miles long. The engineer was Thomas Telford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Nantwich_Aqueduct%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_578526.jpg",
      "title": "Roger Kidd / Nantwich Aqueduct, Shropshire Union Canal, Cheshire",
      "caption": "Nantwich Aqueduct, Shropshire Union Canal, Cheshire. The canal is built on a long embankment as it skirts Nantwich. Here it crosses the A534 road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Gate_lodge_of_Dorfold_Hall%2C_near_Acton_-_geograph.org.uk_-_704926.jpg",
      "title": "Espresso Addict / Gate lodge of Dorfold Hall, near Acton",
      "caption": "Gate lodge of Dorfold Hall, near the canal at Acton, Nantwich. Grade-II-listed Victorian building in Jacobean style, in red brick with stone dressings. The lodge and gates date from 1862, when the grounds of Dorfold Hall were remodelled by Wilbraham Spencer Tollemache. The stone plaques bear the Tollemache diamond and cross emblem. The A534 (Chester Road) into Nantwich is on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/The_River_Weaver_at_Winsford_%281%29.jpg/256px-The_River_Weaver_at_Winsford_%281%29.jpg",
      "title": "Rept0n1x, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The River Weaver at Winsford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/The_locks%2C_Northwich_-_geograph.org.uk_-_21868.jpg",
      "title": "Lizzie / The locks, Northwich",
      "caption": "The locks, Northwich. The locks along the Weaver Navigation with the railway arches in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/River_Weaver_near_Frodsham_-_geograph.org.uk_-_1388226.jpg",
      "title": "David Quinn / River Weaver near Frodsham",
      "caption": "River Weaver near Frodsham. The Weaver is approximately 52miles long between Peckforton and Audlem to near Runcorn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/River_Weaver_near_Little_Leigh_-_geograph.org.uk_-_1396822.jpg",
      "title": "Sue Adair / River Weaver near Little Leigh",
      "caption": "River Weaver near Little Leigh"
    }
  ],
  "distance_km": 64.0,
  "description": "Follow the Weaver Way through Cheshire from Audlem to Frodsham on this delightful 40 mile walk. This route is ideal if you enjoy waterside walking, with long stretches along the Trent and Mersey Canal and Shropshire Union Canal as well as along the River Weaver Navigation. Watch out for a variety of wildlife along the way including March hares, Canada Geese and Kingfishers. Towns on the route include Winsford, Northwich and Nantwich .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a couple of good options for refreshment in Nantwich including the Nantwich Canal centre where there's the Waterside Cafe. The cafe is in a splendid location right next to the canal so you can enjoy your lunch outside and watch the boats go by. It's located on Chester Road at postcode CW5 8LB. The Leopard dates back to the 19th century pub and has a lovely beer garden to relax in on warmer days. You can find it in the town centre on London Road at a postcode of CW5 6LJ for your sat navs. The Ring o' Bells is located at the start/end of the route at Frodsham. The pub dates back 400 years and includes real log fires for colder days. Outside there's a lovely large garden if the sun is shining. They do a fine Sunday roast and are popular with walkers/cyclists on the Sandstone Trail which also starts in the town. You can find them at 2 Bellemonte Road with a postcode of WA6 6BS for your sat navs. The Shroppie Fly is in a great location next to the canal in Audlem at the start of the route. The pub was converted from a canal warehouse, built in 1916, which was once owned by the Liverpool & Birmingham Canal Company. The distinctive crane outside the pub came from the former Audlem station goods-yard, on the Nantwich-Market Drayton-Wellington branch of the Great Western, which closed in 1967. At the inn you can sit outside with a drink and watch the boats going through Audlem locks. You can find them at Audlem Wharf, Shropshire Street with a postcode of CW3 0DX for your sat navs. The Red Lion sits in a lovely spot next to the canalised section of the river at Winsford. The red brick pub dates from the 18th century and serves good quality food. If the weather is fine you can sit outside and enjoy your meal with views over the water. You can find them at 1 Wharton Road with a postcode of CW7 3AA for your sat navs. One of the highlights on the river is the splendid Anderton Boat Lift near Northwich. The device lifts boats 50 feet from the Weaver Navigation to the Trent and Mersey Canal. This 'Cathedral of the Canals' has been listed as one of the Seven Wonders of the British Waterways and won experience of the year 2019. Here you can enjoy a boat trip along the river which uses the lift on the way. There's also a visitor centre and cafe where you can enjoy refreshments with fine views of the lift."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Northwich you can enjoy a stroll around the lovely Marbury Country Park in Great Budworth. The park contains magnificent Lime avenues, an Arboretum and the delightful Budworth Mere. To the east there's Pickmere Lake and to the south there's the Anderton Nature Park and Carey Park.  At the end of the route there's the option of climbing to Frodsham Hill for fine views over the area. The popular Whitegate Way starts/finishes in Winsford. The shared cycling and walking trail follows a disused railway line north to Cuddington. A car park and the old station can be found at the Winsford end. The Nantwich Riverside Loop explores the river in the Cheshire market town. The waymarked trail explores the western side of the town additionally visiting the Shropshire Union Canal. Other highlights on the walk include the pretty Nantwich Lake, the 1803 Nantwich Bridge and the splendid 19th century Nantwich Aqueduct. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hIrxP9fcGBg",
  "district": null,
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bagley Lane, Coxbank, Audlem, Cheshire East, England, CW3 0DS, United Kingdom",
  "postcode": "CW3 0DS",
  "state": "England"
}