{
  "created_at": "2025-01-06T03:50:07.294939+00:00",
  "objectID": "2d61a4bb715468a803d0ebea2e261b67",
  "ref": "wye-valley-walk-walking-route",
  "title": "Wye Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Wye_Valley_Walk_-_geograph.org.uk_-_454828.jpg",
  "nearby": [
    {
      "description": "Tintern Abbey",
      "objectID": "cf211bde830017fdc4432815b9591546",
      "ref": "tintern-abbey-walking-route"
    },
    {
      "description": "Symonds Yat Rock",
      "objectID": "27ae1ef3a27248ae6e61b29c0bb7b12e",
      "ref": "symonds-yat-rock-walking-and-cycle-route"
    },
    {
      "description": "Plynlimon",
      "objectID": "14aa74519a703c04202351ea159d4968",
      "ref": "plynlimon-walking-route"
    },
    {
      "description": "Eagle's Nest",
      "objectID": "eeb2fbde9b88e6f25dc7f83c6939cec1",
      "ref": "eagles-nest-walking-route"
    },
    {
      "description": "Lancaut Walk",
      "objectID": "34de1315939fe600b13f293515b37bec",
      "ref": "lancaut-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2d61a4bb715468a803d0ebea2e261b67.gpx",
  "_geoloc": {
    "lat": 51.6459084054,
    "lng": -2.67566305
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Wye_Valley_Walk_-_geograph.org.uk_-_454828.jpg",
      "title": "Trevor Rickard / Wye Valley Walk",
      "caption": "Wye Valley Walk. The LDP heading north just after it leaves the old railway trackbed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Wye_Valley_Walk_-_geograph.org.uk_-_903165.jpg",
      "title": "Oliver Dixon / Wye Valley Walk",
      "caption": "The trail and Lon Las Cymru, the Welsh National Cycle Route (National Cycle Route 8) both follow the minor road on the west side of the Wye between Rhayader and Newbridge on Wye. For nearly 3 Km the road, although still technically a part of the public highway, is untarred."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Wye_Valley_Walk_-_geograph.org.uk_-_1415512.jpg",
      "title": "Colin Smith / Wye Valley Walk",
      "caption": "Trail map and stone from Plynlimon marking the walk as it passes Chepstow Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Wye_Valley_Walk_-_geograph.org.uk_-_903159.jpg",
      "title": "Oliver Dixon / Wye Valley Walk",
      "caption": "Waymarker on the trail just north of Newbridge on Wye. At this point, a bridleway branches off steeply up the hillside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Wye_Valley_Walk_-_geograph.org.uk_-_1220193.jpg",
      "title": "Pauline Eccles / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The path passes along a gated track with arable fields to the right and the Lugg flood lain to the left. Heading towards Mordiford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/River_Wye_from_the_Wye_Valley_Walk_-_geograph.org.uk_-_797625.jpg",
      "title": "Pauline Eccles / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "River Wye from the trail. After a long stretch with woodland on both sides, the south bank (Monmouthshire) becomes much more open. Taken from the Herefordshire side of the river. Photo taken just west of Symonds Yat near Little Doward."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Llandogo.jpg",
      "title": "Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Llandogo"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/View_from_the_Wyndcliffe_-_geograph.org.uk_-_1903478.jpg/512px-View_from_the_Wyndcliffe_-_geograph.org.uk_-_1903478.jpg",
      "title": "View from the Wyndcliffe by Gordon Hatton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from the Eagle's Nest at Wyndcliffe. Samuel Taylor Coleridge described the view as \"the whole world imaged in its vast circumference\". The view includes the farmland on the opposite bank of the Wye at Lancaut; the cliff face at Wintour's Leap; Chepstow Castle and the adjoining town; the mouth of the Wye at Beachley; the Severn estuary, Severn Bridge and Second Severn Crossing; and the Cotswold Hills beyond."
    }
  ],
  "distance_km": 222.0,
  "description": "This walk takes you through the beautiful Wye Valley in Gloucestershire, Herefordshire and Wales. The walk begins on the mouth of the River Wye at Chepstow Castle in Monmouthshire and follows the River Wye north to Monmouth, passing the fascinating ruins of Tintern Abbey on the way. You continue through Ross on Wye to Hereford and then onto Hay on Wye. You then return to Wales and head to Builth Wells, Newbridge and Rhayader before the final stretch takes you towards the source of the Wye on the slopes of Plynlimon mountain in the Cambrian Mountains of Powys. There's plenty of spectacular mountainous scenery as you pass through the Wye Valley AONB, with several waterside sections along the River Wye to enjoy. You'll also pass the mysterious King Arthur's Cave and the splendid Symonds Yat Rock where there are fine woodland trails and wonderful views over the Wye Valley gorge. The walk is well waymarked with a white disc featuring a leaping salmon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Rhayader you can visit the noteworthy Triangle Inn which dates from the 16th century. There’s a cosy restaurant offering a dog-friendly bar, a wood-burning stove, and an outdoor area with views of the River Wye. You can find the pub next to the river at postcode LD65AR. In Builth Wells the ancient Fountain Inn is worthy of investigation. The historic pub dates all the way back to the 14th century and includes an attractive garden area overlooking the river. It's a lovely place to relax after your exercise. You can find them on Broad Street at postcode LD2 3DT for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Red Kite feeding station is a lovely place to visit in Rhayader on the route. Hundreds of Red Kites feed at the 200 acre family-run working farm every day. It's a wonderful sight with breathtaking feats of aerial piracy the red kites compete with buzzards and ravens for choice pickings. Feeding takes place at 2pm GMT (this changes to 3pm when the clocks change at the end of March, and reverts to 2pm at the end of October when the clocks revert to GMT). There is also a coffee shop & gift shop, a picnic site, and farm trail. You can find the feeding station at Gigrin Farm, South Street with a postcode of LD6 5BL for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SjSFZx3_eDw",
  "postcode": "NP16 7LD",
  "district": "Tutshill",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}