{
  "created_at": "2025-01-06T00:55:25.891865+00:00",
  "objectID": "2d87caf5b0bd65ab4baa4bd0c91e88f1",
  "ref": "grantham-canal-walking-route",
  "title": "Grantham Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Grantham_Canal%2C_Harby_-_geograph.org.uk_-_54634.jpg",
  "nearby": [
    {
      "description": "Cotgrave Country Park",
      "objectID": "6b19e1655d03962f035817bb328b6c89",
      "ref": "cotgrave-country-park-walking-and-cycle-route"
    },
    {
      "description": "Denton Reservoir",
      "objectID": "95c6080dddfdd67bd736f7d6f07a160c",
      "ref": "denton-reservoir-walking-route"
    },
    {
      "description": "Woolsthorpe by Belvoir and Belvoir Castle",
      "objectID": "7e60efd9f5448855e00ffe751d365217",
      "ref": "woolsthorpe-by-belvoir-and-belvoir-castle-walking-route"
    },
    {
      "description": "Hickling",
      "objectID": "9f3a783c67ce13b3903b12c4a6762b2d",
      "ref": "hickling-walking-route"
    },
    {
      "description": "Belton House",
      "objectID": "e17647618a91005ef98cce11f2f6df8e",
      "ref": "belton-house-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2d87caf5b0bd65ab4baa4bd0c91e88f1.gpx",
  "_geoloc": {
    "lat": 52.9053600955,
    "lng": -0.6547901937
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Grantham_Canal%2C_Harby_-_geograph.org.uk_-_54634.jpg",
      "title": "Kate Jewell / Grantham Canal, Harby, via Wikimedia Commons",
      "caption": "Canal at Harby. Langar Bridge, No 43. Not a lot of headroom for prospective canal traffic. This bridge would have to be rebuilt if the canal was to become fully navigable again."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Woolsthorpe_Top_Lock%2C_Grantham_Canal_-_geograph.org.uk_-_136943.jpg",
      "title": "Martin Wilson / Woolsthorpe Top Lock, Grantham Canal, via Wikimedia Commons",
      "caption": "Woolsthorpe Top Lock. Topmost of three well-restored locks on the canal, currently cut off from the rest of the national system and with several locks converted to weirs and a lengthy dry section some miles to the west of this location. Cliff Wood behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Basin_on_the_Grantham_Canal_-_geograph.org.uk_-_748508.jpg",
      "title": "Kate Jewell / Basin on the Grantham Canal, via Wikimedia Commons",
      "caption": "Basin on the canal. Just east of the Polser Brook the canal widens out into a small basin. Its proximity to Cotgrave Place, now a country club and golf course, makes me wonder if there was once a small wharf here for the collection of \"night soil\", one of the cargoes carried along this canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Grantham_Canal_roundabout_-_geograph.org.uk_-_137285.jpg",
      "title": "Martin Wilson / Grantham Canal roundabout, via Wikimedia Commons",
      "caption": "Canal roundabout. Still with plenty of water in its channel, the canal is culverted under a new roundabout linking to an A1 slip-road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Bridge_32%2C_Clark%27s_Bridge_-_geograph.org.uk_-_944763.jpg",
      "title": "Mat Fascione / Bridge 32: Clark's Bridge",
      "caption": "Bridge 32: Clark's Bridge. The bridge and information board are located along the Grantham Canal, east of Hickling. The information board states: \"Clark's Bridge is typical of those on the Grantham. Built in the late 1700s from red handmade bricks, it probably had stone copings. The blue brick copings you see today were added later. The bridge's surface is grass, forming an access track to nearby fields. Permission to build the canal was probably dependent on this type of access bridge being included. Many bridge numbers on the canal are hand painted. Clark's Bridge also has a hand painted nameplate. Both features can be seen from the towpath.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Hickling_Basin_-_geograph.org.uk_-_2227721.jpg/512px-Hickling_Basin_-_geograph.org.uk_-_2227721.jpg",
      "title": "Hickling Basin by Alan Murray-Rust, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hickling Basin"
    }
  ],
  "distance_km": 52.0,
  "description": "A lovely peaceful walk alongside the Grantham Canal from Grantham to Nottingham. The walk takes you through through the glorious Vale of Belvoir and passes Woolsthorpe, Redmile, Harby, Hickling, Gamston and the delightful Cotgrave Country Park. Highlights on the route include the pretty Denton Reservoir just to the west of Grantham. It's a great place for wildlife with coot, moorhen, mallard, teal, pochard, heron, great crested grebe and kingfishers to look out for. Near here you can also visit the splendid Belvoir Castle which has lovely parkland, lakes and woodland surrounding the Grade I listed castle. You can create a nice circular walk around here by visiting the Woolsthorpe By Belvoir using the Viking Way footpath at Longmoor Bridge.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One nice idea is to stop off in the little Nottinghamshire village of Hickling and visit the canalside Plough Inn. The 18th century pub was originally built as a stop off for boats transporting goods up and down the canal. It's situated right opposite the canal wharf and has a cosy interior with an open fire. Outside there's a sunny courtyard and a bright sun terrace enhanced with beautiful palms. You can find them on Main Street at postcode LE14 3AH. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of Grantham you'll find one of the highlights of the area at the splendid Belton House. The National Trust owned property includes 1300 acres of parkland surrounding a fine country house. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4ZrCayptxyI",
  "postcode": "NG31 7QG",
  "district": "Grantham",
  "county": "Lincolnshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}