{
  "created_at": "2025-01-06T05:11:00.495063+00:00",
  "objectID": "2ebe6d22597311683a42787e9f2a00a5",
  "ref": "yeadon-tarn-walking-route",
  "title": "Yeadon Tarn Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Shoreline_of_Yeadon_Tarn_-_geograph.org.uk_-_661453.jpg",
  "nearby": [
    {
      "description": "Golden Acre Park",
      "objectID": "d27c64ca7932039e76dd8c3974f6df30",
      "ref": "golden-acre-park-walking-route"
    },
    {
      "description": "Leeds Country Way",
      "objectID": "48b7300950a203da6dd0f579ddb1aceb",
      "ref": "leeds-country-way-walking-route"
    },
    {
      "description": "Otley Chevin Country Park",
      "objectID": "e0ca252bcc6bb8fe1ff7c58abfaf5463",
      "ref": "otley-chevin-country-park-walking-and-cycle-route"
    },
    {
      "description": "Horsforth",
      "objectID": "04da0fbe38675e2911c8b8afd3b3c322",
      "ref": "horsforth-walking-route"
    },
    {
      "description": "Bramhope Circular Walk",
      "objectID": "92db58509fbf02bce01773b1ac141c54",
      "ref": "bramhope circular-walk-walking-route"
    },
    {
      "description": "Arthington Viaduct",
      "objectID": "bbe088a78a459023f196e957b3474685",
      "ref": "arthington-viaduct-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2ebe6d22597311683a42787e9f2a00a5.gpx",
  "_geoloc": {
    "lat": 53.8698805513,
    "lng": -1.6748177484
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Shoreline_of_Yeadon_Tarn_-_geograph.org.uk_-_661453.jpg",
      "title": "Dr Julian Paren [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Shoreline of Yeadon Tarn. Frost and ice were fast to disappear as the morning progressed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Yeadon_Tarn_bandstand_-_geograph.org.uk_-_381969.jpg",
      "title": "David Gowing / Yeadon Tarn bandstand",
      "caption": "A relatively new bandstand at Yeadon Tarn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Far_end_of_Yeadon_Tarn_-_geograph.org.uk_-_176990.jpg",
      "title": "Humphrey Bolton / Far end of Yeadon Tarn",
      "caption": "Footpath view at the far end of Yeadon Tarn. The tarn is quite near to the watershed, and appears to be fed by springs rather than a watercourse. The ground at the northern end is wet, with rushes amongst the grass and iris plants growing under the hawthorn behind the seat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Wildfowl_at_Yeadon_Tarn_-_geograph.org.uk_-_1113132.jpg",
      "title": "SMJ / Wildfowl at Yeadon Tarn",
      "caption": "Wildfowl at Yeadon Tarn. Most of the Tarn was frozen so lots of birds crowded into the corner where they were being fed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Yeadon_Tarn_on_an_autumnal_day_-_geograph.org.uk_-_1542620.jpg",
      "title": "Dr Julian Paren [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Yeadon Tarn on an autumnal day. A quiet scene interrupted by the sounds associated with the landings and departures of planes from Leeds-Bradford airport."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Yeadon_Dam_-_geograph.org.uk_-_825949.jpg",
      "title": "Dr Neil Clifton / Yeadon Dam",
      "caption": "Yeadon Dam. Its 'proper' name is Yeadon Tarn, but as Yeadon Dam is has been a popular place of resort for generations of local children and their families. Drained during WWII for fear that German bombers would use the reflection from it as a navigational aid if bombing the nearby (but very well camouflaged) AVRO aircraft factory, (it must have worked - the AVRO never took a hit!) there was rejoicing in the town when it was re-filled."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/White_Swan_Hotel%2C_Yeadon_%2829366577093%29.jpg/512px-White_Swan_Hotel%2C_Yeadon_%2829366577093%29.jpg",
      "title": "Tim Green from Bradford [CC BY (https://creativecommons.org/licenses/by/2.0)]",
      "caption": "White Swan Hotel - the ideal spot to enjoy a drink after your exercise"
    }
  ],
  "distance_km": 1.5,
  "description": "Enjoy an easy circular walk around this pretty lake in Leeds. There's a nice surfaced footpath running around the perimeter of the tarn for just under a mile. Look out for various water loving birds on the water. The Leeds Country Way long distance footpath runs through nearby Horsforth so you can pick this up to extend your walk. A public footpath runs from Yeadon past Horsforth Golf Club and Leeds Bradford Airport to Scotland where you can pick up the Leeds Country Way. It runs east to Golden Acre Park where there are more good walking trails in lovely surroundings.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you fancy a pub then the White Swan is a stones throw from the tarn. The main draw here is a fantastic decked beer garden where there are views to the cricket ground. It's the ideal place to relax and take in a spot of a cricket on a fine day. It's located on the south side of the tarn on the High Street at postcode LS19 7TA. Just south of the tarn you'll find the delightfully named Never Enough Thyme cafe. The friendly place has outdoor seating and a good menu to choose from. You can find it in Yeadon at 97 High St, with a postcode of LS19 7TA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The path around the tarn is a popular place for dog walking and you will probably see other owners on your outing. The White Swan pub is also dog friendly and will provide water for your thirsty friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Leeds Bradford International Airport is located immediately east of the tarn so look out for planes coming and going on your walk. Yeadon had a rail connection from Guiseley which opened in 1894 but the line was closed in 1964. It is now a nature path and most of its length can still be walked, from the Old Engine Fields, off Henshaw Lane down Guiseley retail park where it joined the Guiseley Branch Line. The line continued over Henshaw Lane where an old bridge can still be seen. Also look out for two notable buildings in the town. The town hall is a Grade II listed building built in a striking French Gothic style. There's also the historic Low Hall. It's Grade II listed and located on Gill Lane on the fringe of the town. A former 17th century farmhouse it was remodelled in the 19th century. About 2 miles north of the tarn you'll find the popular Otley Chevin Country Park. There's miles of excellent woodland trails and fine viewpoints to climb to here. In nearby nearby Horsforth you can try the Horsforth Walk. This starts in the large Horsforth Hall Park and takes you to the Leeds and Liverpool Canal, the wildlife rich Rodley Nature Reserve and the historic Kirkstall Abbey."
    }
  ],
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}