{
  "created_at": "2025-01-06T18:59:49.695012+00:00",
  "objectID": "2f1fdd02241643731249e0120c3478ac",
  "ref": "gort-river-walk",
  "title": "Gort River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Gort_River_looking_south%2C_Gort_-_geograph.org.uk_-_2777439.jpg/512px-Gort_River_looking_south%2C_Gort_-_geograph.org.uk_-_2777439.jpg?20211124202546",
  "nearby": [
    {
      "description": "Flaggy Shore",
      "objectID": "2e87d3b0c7a1bc39493c087f0c3c68de",
      "ref": "flaggy-shore-walking-route"
    },
    {
      "description": "Lough Bunny",
      "objectID": "7d769d84b14517aba5d97494d747a6e8",
      "ref": "lough-bunny-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2f1fdd02241643731249e0120c3478ac.gpx",
  "_geoloc": {
    "lat": 53.06561,
    "lng": -8.81708
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Gort_River_looking_south%2C_Gort_-_geograph.org.uk_-_2777439.jpg/512px-Gort_River_looking_south%2C_Gort_-_geograph.org.uk_-_2777439.jpg?20211124202546",
      "title": "Gort River looking south, Gort by P L Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gort River looking south, Gort. Irish: Gort Inse Guaire or An Gort. The name \"Guaire\" in Gort Inse Guaire refers to King Guaire Aidne mac Colmáin, a 7th-century King of Connacht, renowned for his generosity, which earned him the nickname \"Guaire the Generous.\" King Guaire was a significant historical figure in the region, and his legacy is reflected in various local landmarks and stories. Guaire is believed to have maintained royal residences in Gort, situated on a small island in the Gort river. Additionally, he is credited with constructing Dunguaire Castle, or \"Fort of Guaire,\" located in nearby Kinvara. The fort's name directly references Guaire, underscoring his influence in the area. Guaire's connection to St. Colman MacDuagh, his first cousin, further highlights his importance. Guaire is said to have granted St. Colman the land for the establishment of the Kilmacduagh monastery, which became a significant religious site. These historical ties contribute to the rich cultural and historical tapestry of the region, with King Guaire's legacy still remembered and celebrated today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Gort_River_looking_northeast%2C_Gort_-_geograph.org.uk_-_2777501.jpg/512px-Gort_River_looking_northeast%2C_Gort_-_geograph.org.uk_-_2777501.jpg?20211124203914",
      "title": "Gort River looking northeast, Gort by P L Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gort River looking northeast, Gort. There was a large flour mill built along the river in 1806, it was 4 stories tall, with a wooden wheel, and very active. It operated until 1966. It was sold to the Gort Co-operative Mart and destroyed in 1985. The river \"disappears\" underground several times between its source and Galway Bay. Gort is in a valley between the exposed limestone region of the Burren, and the peaty hills of the Slieve Aughty. Next to the river in Gort and adjacent to the original bridge, constructed in 1771, stands Bridge House. This house, believed to date back to around 1770, was the original residence of Lord Gort before he moved to Lough Cutra Castle. Over the years, Bridge House has undergone various additions and changes. In 1857, it became a convent for the Sisters of Mercy, serving as a religious residence and community center. The grounds also hosted a primary school, further integrating the property into the local community's fabric. The Sisters of Mercy continued their mission at Bridge House until 2022. Following the departure of the Sisters, the house took on a new role. As of 2022, Bridge House has been repurposed to accommodate Ukrainian refugees, providing them with a safe haven amid the ongoing conflict in their homeland. This transition reflects the ongoing adaptability and historical significance of the property within the Gort community."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Gort_-_Bridge_Street.jpg?20080523151959",
      "title": "Jonathan Billinger, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gort"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Looking_northwest_along_Georges_Street_to_the_railway_bridge%2C_Gort_-_geograph.org.uk_-_2775811.jpg/512px-Looking_northwest_along_Georges_Street_to_the_railway_bridge%2C_Gort_-_geograph.org.uk_-_2775811.jpg?20211124101607",
      "title": "Looking northwest along Georges Street to the railway bridge, Gort by P L Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking northwest along Georges Street to the railway bridge, Gort"
    }
  ],
  "distance_km": 3.0,
  "description": "This pleasant riverside walk takes you along the Gort River in the town of Gort in County Galway. The circular loop walk runs for about 3km along easy footpaths and country lanes around the historic town. On the way you can enjoy some fine views of the surrounding Galway countryside and look out for a variety of wildlife on the river. To continue your waterside walking around Gort head south west to visit Lough Bunny .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south west is the Lough Avalla Farm Loop. Another well trodden path it winds through the historic site of an ancient Celtic farm and briefly follows the picturesque shoreline of Lough Avalla. To the north west you can pick up the Ballyvaughan Wood Loop Walk. On the circular walk you can visit the wonderful Aillwee Cave system with its underground river and waterfall. Near here there's also Flaggy Shore. There's some wonderful geological features and fine views to Aughinish Island, Galway Bay, the surrounding mountains and the wider Atlantic Ocean."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lwVoLVdSDnM?si=AndFQbiJETk5l1ZR",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Gort River Walk, Gort, Loughrea Municipal District, County Galway, Connacht, H91 R5F9, Éire / Ireland",
  "postcode": "H91 R5F9",
  "district": "Gort",
  "county": "County Galway",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "views",
    "wildlife"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}