{
  "created_at": "2025-01-06T00:41:16.308697+00:00",
  "objectID": "2f68923b09d298914b749b55675c8d63",
  "ref": "bolderwood-deer-sanctuary-walking-route",
  "title": "Bolderwood Deer Sanctuary Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Deer_in_the_Bolderwood_Deer_Sanctuary_-_geograph.org.uk_-_333292.jpg",
  "nearby": [
    {
      "description": "Lyndhurst",
      "objectID": "6004e8b0ac8ca159efad3e2fed7d73fe",
      "ref": "lyndhurst-walking-route"
    },
    {
      "description": "Knightwood Oak",
      "objectID": "2e7f813af716643f3cd00f37b0871424",
      "ref": "knightwood-oak-walking-route"
    },
    {
      "description": "Furzey Gardens",
      "objectID": "a19083a5b087cb4ca77a06d9d41e99ca",
      "ref": "furzey-gardens-walking-route"
    },
    {
      "description": "Acres Down",
      "objectID": "b2b9888789d1f10cfda8211dc5acb2b7",
      "ref": "acres-down-walking-route"
    },
    {
      "description": "Fritham",
      "objectID": "1618e6bc4fb50f181976db6d09d30bfb",
      "ref": "fritham-walking-route"
    },
    {
      "description": "Frogham to Fritham Circular Walk",
      "objectID": "fb922606b779c86a40973f22a05f8aa8",
      "ref": "frogham-to-fritham-circular-walk-walking-route"
    },
    {
      "description": "Bramble Hill",
      "objectID": "722bea53b12925e3a579147381898b90",
      "ref": "bramble-hill-walking-route"
    },
    {
      "description": "Godshill Walk",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2f68923b09d298914b749b55675c8d63.gpx",
  "_geoloc": {
    "lat": 50.8767513359,
    "lng": -1.6590431416
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Deer_in_the_Bolderwood_Deer_Sanctuary_-_geograph.org.uk_-_333292.jpg",
      "title": "Gillian Moy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Deer spotted from the viewing area in the sanctuary during the autumn of 2006."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Deer_Lawn_in_Bolderwood_Grounds_-_geograph.org.uk_-_57104.jpg",
      "title": "Clive Perrin / Deer Lawn in Bolderwood Grounds",
      "caption": "Deer Lawn in Bolderwood Grounds. This is a small open area surrounded by woodland which is kept open to provide grazing for deer. New grass has been sown by the Volunteer Rangers of the New Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Entrance_to_Bolderwood_car_park%2C_New_Forest_-_geograph.org.uk_-_94215.jpg",
      "title": "Jim Champion / Entrance to Bolderwood car park, New Forest",
      "caption": "Entrance to Bolderwood car park. The tarmac road in the picture leads from Emery Down to Moyles Court on the western edge of the Forest. The short wooden posts (dragons' teeth) prevent cars from parking on the verge - this is a very busy forest car park in the summer, probably the busiest in the Forest. The long shadows in the foreground are cast by the low winter sun behind the tall redwoods planted on Bolderwood Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Bolderwood_Arboretum_Ornamental_Drive%2C_New_Forest_-_geograph.org.uk_-_32739.jpg",
      "title": "Jim Champion / Bolderwood Arboretum Ornamental Drive, New Forest",
      "caption": "Bolderwood Arboretum Ornamental Drive. This part of the ornamental drive is close to the Barrow Moor car park. The narrow drive winds its way through a variety of attractive broadleaved trees, screening the less attractive (but more practical) conifer plantations beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Pony_in_a_holly_holm%2C_Bolderwood%2C_New_Forest_-_geograph.org.uk_-_316592.jpg",
      "title": "Jim Champion / Pony in a holly holm, Bolderwood, New Forest",
      "caption": "Pony in a holly holm. This pony was grazing on the very wet lawn beneath a small clumps of holly trees. The Bolderwood car park is nearby - a parked car can be seen through the trees on the left. In the summer this triangular area between the car park and two roads is dry and a popular spot for picnics and ball games."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Bolderwood_cottage%2C_New_Forest_-_geograph.org.uk_-_94206.jpg",
      "title": "Jim Champion / Bolderwood cottage, New Forest",
      "caption": "Bolderwood cottage. Set within Bolderwood Grounds is this enclosed private land belonging to the cottage. The nearby Mark Ash wood was used as a \"Sherwood Forest\" location during the filming of \"Robin Hood: Prince of thieves\" in 1990, and this field was a base camp for the film crew."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Fallow_deer_on_the_edge_of_Bolderwood_Farm_-_geograph.org.uk_-_230847.jpg/256px-Fallow_deer_on_the_edge_of_Bolderwood_Farm_-_geograph.org.uk_-_230847.jpg",
      "title": "Jim Champion / Fallow deer on the edge of Bolderwood Farm",
      "caption": "Fallow deer on the edge of the farm. A pair of fallow deer looking back at the photographer having just retreated behind the fence of the farm - there was a calf with them too. They are probably used to being stared at by people since the northern part of the farm is a well-visited Deer Sanctuary. The three-wire fence is substantial enough to prevent access by commoners' ponies and cattle, whilst allowing the more nimble and slender deer to get in and out easily."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Road_to_Bolderwood_from_Slufters_Inclosure%2C_New_Forest_-_geograph.org.uk_-_267589.jpg",
      "title": "Jim Champion / Road to Bolderwood from Slufters Inclosure, New Forest",
      "caption": "Road to Bolderwood from Slufters. This road has just crossed Bratley Water in the valley and is leaving Slufters Inclosure. It climbs up the hill to pass beneath the A31(T) dual carriageway. It is the only road underpass beneath the trunk road between Cadnam in the east and Picket Post in the west, and is thus the only minor road that directly connects the northern part of the Forest to the larger southern part."
    }
  ],
  "distance_km": 2.0,
  "description": "This is a short walk in the New Forest taking you around the Bolderwood Deer Sanctuary. Here you will find a large herd of fallow deer with a viewing platform overlooking the meadow where the deer congregate. The deer are fed daily by the Forestry Commission keeper so it's highly likely you will see a large number of deer in the early afternoon. There is a good sized car park right next to the sanctuary and a number of graded walks taking you through the surrounding woodland. There is also a large lawn area, picnic tables and an information cabin. The sanctuary is located about 4 miles west of Lyndhurst and about 6 miles east of Ringwood. To extend your walking in the area you could follow our Lyndhurst Circular Walk and visit the Knightwood Oak. The tree is over 500 years old and the largest oak tree in the New Forest.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the Royal Oak in the nearby village of Fritham. The pub is popular with walkers and located just a few miles north of the sanctuary. Features include a partly-thatched roof and a nice big garden to relax in during the summer months. You can find it in the small village at postcode SO43 7HJ. The Frogham to Fritham Circular Walk can also be picked up here. It climbs to the the viewpoint on the Hampton Ridge before heading to the lovely Latchmore Brook and Hasley Hill Inclosure near Fordingbridge. Near Frogham you can pick up the Godshill Walk and enjoy the rhododendrons of the Godshill Inclosure before a climb to the Castle Hill viewpoint.  The Ashley Walk area is located just south of the Godshill Ridge too. It's another popular area to start a walk with its large car park and pleasant heathland trails. The Bramble Hill Walk can also be picked up in this area."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome here and there's some fine woodland trails for them to explore on in the surrounding area. The Royal Oak mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The sanctuary is surrounded by miles of lovely trails in the Bolderwood Arboretum. There are a number of waymarked trails to follow through this area which includes wonderful ornamental coniferous trees planted in 1860. The Arboretum was formally part of the extensive grounds of Bolderwood Lodge, a master keeper's residence from around 1732 until its demolition in 1833. Just head south from the sanctuary to explore this beautiful area. Also nearby is the village of Minstead, located a few miles north east of the sanctuary. The unspoilt village is well worth a visit with its pretty village green, thatched cottages, popular local pub and historic 13th century church. The Minstead Walk visits another scenic highlight at Furzey Gardens before heading to the Rufus Stone just to the north east of the gardens. This historical stone apparently marks the spot where King William II was fatally wounded with an arrow, during a royal hunting outing in the Forest, in the year 1100. The Acres Down Walk circular walk visits the site from the east. The walk starts from the nearby Acres Down car park and visits the pretty streams and woodland of the Highland Water Inclosure before heading to the sanctuary. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8VsJFpCwySk",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bolderwood Arboretum, Bolderwood Arboretum Ornamental Drive, Minstead, New Forest, Hampshire, England, SO43 7GQ, United Kingdom",
  "postcode": "SO43 7GQ",
  "district": "New Forest",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "viewing platform",
    "information cabin",
    "historical tree"
  ],
  "facilities": [
    "car park",
    "picnic tables",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}