{
  "created_at": "2025-01-06T04:20:18.506601+00:00",
  "objectID": "2f836d52cfc5a59ce322d77f15081604",
  "ref": "hole-of-horcum-walking-route",
  "title": "Hole of Horcum Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Hole_of_Horcum_-_geograph.org.uk_-_432017.jpg/512px-Hole_of_Horcum_-_geograph.org.uk_-_432017.jpg",
  "nearby": [
    {
      "description": "Pickering",
      "objectID": "8463cd586b92ae63a57a051352630d24",
      "ref": "pickering-walking-route"
    },
    {
      "description": "Levisham Circular Walk",
      "objectID": "b27e51151517f526e4dbcff73920db5e",
      "ref": "levisham-circular-walk-walking-route"
    },
    {
      "description": "Cropton Forest",
      "objectID": "0564e826f5ef162e992343a060dcd47b",
      "ref": "cropton-forest-walking-and-cycle-route"
    },
    {
      "description": "Dalby Forest",
      "objectID": "444fb3d84019bfb0cf1d3bee105c7dda",
      "ref": "dalby-forest-walking-and-cycle-route"
    },
    {
      "description": "Bridestones",
      "objectID": "0f0c1f783e1f5b696b30ecb53e4ae7ac",
      "ref": "bridestones-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2f836d52cfc5a59ce322d77f15081604.gpx",
  "_geoloc": {
    "lat": 54.3311711064,
    "lng": -0.6903834376
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Hole_of_Horcum_-_geograph.org.uk_-_432017.jpg/512px-Hole_of_Horcum_-_geograph.org.uk_-_432017.jpg",
      "title": "Jo Turner / Hole of Horcum, via Wikimedia Commons",
      "caption": "Hole of Horcum from view point and car park on A169"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/The_Hole_of_Horcum_-_geograph.org.uk_-_986956.jpg",
      "title": "Peter Church / The Hole of Horcum, via Wikimedia Commons",
      "caption": "The grazing land gives way to bracken and heather as the land rises. The col is the point where many paths cross, and a descent to Saltersgate is possible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Footpath_above_Horcum_-_geograph.org.uk_-_984975.jpg",
      "title": "Peter Church / Footpath above Horcum, via Wikimedia Commons",
      "caption": "Footpath above Horcum. For a long period access to the moorland at the Hole of Horcum was by foot alongside the A road. This new path has probably saved a few accidents. The land falls steeply to the left, through Horcum wood, and into the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Blakey_Topping._-_geograph.org.uk_-_117479.jpg",
      "title": "Steve Partridge / Blakey Topping., via Wikimedia Commons",
      "caption": "Blakey Topping. Legend has it that when the giant, Wade, scooped out the Hole of Horcum and threw the contents (at his wife?) they landed a mile and a half away and are now known as Blakey Topping."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Hole_of_Horcum_%28geograph_5499971%29.jpg",
      "title": "Tom Curtis / Hole of Horcum, via Wikimedia Commons",
      "caption": "Wonderful view of the site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/South_of_the_Hole_of_Horcum_-_geograph.org.uk_-_71014.jpg",
      "title": "Lis Burke / South of the Hole of Horcum, via Wikimedia Commons",
      "caption": "View south of the site. Looking northwards up the narrow valley towards the Hole of Horcum in the distance."
    }
  ],
  "distance_km": 8.0,
  "description": "Enjoy a circular walk around this beautiful natural amphitheatre in the North York Moors. The hollow is 400 ft deep and was created over thousands of years by a series of landslides caused by water pressure. The walk starts from the parking area by Horcum Wood and takes you across Levisham Moor to Dundale Griff and Horcum Slack before returning to the car park. You'll pass interesting Bronze Age barrows, rocky ravines, woodland, waterfalls and streams on your way through this lovely area. You can also see wild flowers and purple heather on the moor in the spring and summer. It's also a splendid area for wildlife - look out for deer, grouse, curlew, lapwing, merlin and golden plover. There is the possibility of a short diversion to Skelton Tower. A footpath leading west from Dundale Griff leads to this splendid beauty spot which commands great views over Newtondale. The Hole of Horcum is located near to the villages of Saltergate and Levisham. The walk could also be easily started from either of these locations. Our Levisham Circular Walk begins from Levisham Station on the North Yorkshire Moors Railway. You can catch the train from nearby Pickering as an alternative to coming by car. The area is located just north of the splendid Dalby Forest where you can enjoy miles of waymarked walking and cycling trails. Also nearby is the splendid Bridestones Nature Reserve with its ancient sandstone rocks, woodland and meadows. The long distance Tabular Hills Walk runs right past the site. The waymarked trail can be followed to Dalby Forest, Cropton Forest and the Bridestones.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "About 2 miles south of the car park you will come to the village of Lockton. Here you'll find the Loft Tea Rooms and Gallery. These delightful tea rooms are the ideal place to enjoy a cream tea after your walk. It's an Idyllic setting with the tea rooms surrounded by pretty gardens and attractive North York Moors countryside. The site includes a lovely gallery which showcases the work of local artists who have painted the beautiful surroundings. There's also Tag’s Bistro which offers a varied range of dining options and an evening menu. You can find the cafe in the village on Hudgin Lane with a postcode of YO18 7QA for you sat navs. In the village there's also a Youth Hostel and several holiday cottages if you need accommodation. Also nearby is Levisham where you'll find the 19th century Horseshoe Inn. It's in a lovely spot in the pretty village and includes a nice outdoor seating area if the weather is fine. The pub was featured in an article for The Telegraph's 'The 30 best winter pubs in Britain, for dog-lovers, walkers, foodies and more'. There's a good menu and a warm welcome at the this traditional country pub. You can find the pub at postcode YO18 7NL. They also have a sister pub in Lockton called the Fox and Rabbit. There's another splendid outdoor area with fine views of the countryside here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and the Horseshoe Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Skelton Tower is located on the western side of Levisham Moor and a worthwhile site to visit. The tower dates from 1830 and sits perched high above the moor in a dramatic and picturesque spot. There are great views over Goathland Moor and the steam trains of the North York Moors Railway below. It's a great spot to take some stunning photos. A little further west is the expansive Cropton Forest and the historic villages of Hutton-le-Hole and Lastingham, where you'll find the excellent Ryedale Folk Museum and the noteworthy 11th century St Mary's church respectively. For more walking ideas in the area see the North York Moors Walks page.. Just to the east there's the climb to the ancient standing stones and fine viewpoint at Blakey Topping. This circular walk starts from the Crosscliff car park and viewpoint at the northern end of Dalby Forest. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HZohxn_Trlk",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Saltergate, Whitby Road, Lockton, North Yorkshire, York and North Yorkshire, England, YO18 7NR, United Kingdom",
  "postcode": "YO18 7NR",
  "district": null,
  "state": "England"
}