{
  "created_at": "2025-01-06T04:56:44.958219+00:00",
  "objectID": "2fe9e09fafbbc1b6cc0741711d5eb902",
  "ref": "sandy-walking-route",
  "title": "Sandy Walks - The Lodge",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sandy_Warren%2C_RSPB_headquarters_and_Nature_Reaserve_-_geograph.org.uk_-_1512279.jpg",
  "nearby": [
    {
      "description": "Bedford to Sandy",
      "objectID": "b6f44bffc2ac4bde7874206488ef7be8",
      "ref": "bedford-to-sandy-walking-and-cycle-route"
    },
    {
      "description": "Priory Country Park",
      "objectID": "f86564af699910376357537c10166fcd",
      "ref": "priory-country-park-walking-and-cycle-route"
    },
    {
      "description": "Biggleswade",
      "objectID": "e345d2a6fc45772b359c5c7e0edac2c8",
      "ref": "biggleswade-walking-and-cycle-route"
    },
    {
      "description": "Kingfisher Way",
      "objectID": "20f1de8b99433f9ecf39c18261234586",
      "ref": "kingfisher-way-walking-route"
    },
    {
      "description": "Greensand Ridge Walk",
      "objectID": "2ff60013a3fe963adfb865232091765c",
      "ref": "greensand-ridge-walk-walking-route"
    },
    {
      "description": "Clopton Way",
      "objectID": "79db249e72f51be439466b5b0f6229c2",
      "ref": "clopton-way-walking-route"
    },
    {
      "description": "Baldock",
      "objectID": "092801b48d6901a60a64fc1a2ee41b7f",
      "ref": "baldock-walking-route"
    },
    {
      "description": "Wimpole Hall",
      "objectID": "1002f1d8d20de1e53d5276e056cb05c7",
      "ref": "wimpole-hall-walking-route"
    },
    {
      "description": "St Neots",
      "objectID": "16c48ff4ff3923e2b952bb9976eb0cef",
      "ref": "st-neots-walking-route"
    },
    {
      "description": "Ouse Valley Way",
      "objectID": "39cf3d478e1175c7bc7fe309108b8f74",
      "ref": "ouse-valley-way-walking-route"
    },
    {
      "description": "North Bedfordshire Heritage Trail",
      "objectID": "a45cf871ae8a4a8804d105132eef9220",
      "ref": "north-bedfordshire-heritage-trail-walking-route"
    },
    {
      "description": "Cambourne",
      "objectID": "631b3ead8e49de4e7f096bb3d20efbeb",
      "ref": "cambourne-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/2/2fe9e09fafbbc1b6cc0741711d5eb902.gpx",
  "_geoloc": {
    "lat": 52.1220418899,
    "lng": -0.2613511742
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sandy_Warren%2C_RSPB_headquarters_and_Nature_Reaserve_-_geograph.org.uk_-_1512279.jpg",
      "title": "nick macneill / Sandy Warren, RSPB headquarters and Nature Reaserve",
      "caption": "Sandy Warren. There are basically two walks around the RSPB reserve, one through gentle heathland, the other, more undulating through forest. On the latter, one passes these rocks which reminded me more of Surrey than Bedfordshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/New_Heathland_-_geograph.org.uk_-_1596340.jpg",
      "title": "Cameraman / New Heathland",
      "caption": "New Heathland. In 2005, work began to restore some areas of heathland. The aim is to attract species including Woodlark Lullula arborea, European Nightjar Caprimulgus europaeus, and Dartford Warbler Sylvia undata. Sandy Warren, part of the reserve, is designated a Site of Special Scientific Interest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/The_View_from_Meadow_Hide_-_geograph.org.uk_-_1596349.jpg",
      "title": "Cameraman / The View from Meadow Hide",
      "caption": "The View from Meadow Hide. The reserve includes areas of broadleaved and coniferous woodland, acid grassland and heathland. The area surrounding The Lodge was covered in heathland prior to the 19th century, when it was ploughed up for agriculture or planted with non-native conifer species for forestry. In 2005, work began to restore some areas of heathland. The aim is to attract species including Woodlark (Lullula arborea), European Nightjar (Caprimulgus europaeus), and Dartford Warbler (Sylvia undata). Sandy Warren, part of the reserve, is designated a Site of Special Scientific Interest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Swiss_Cottage%2C_Sandy_-_geograph.org.uk_-_1596332.jpg",
      "title": "Cameraman / Swiss Cottage, Sandy",
      "caption": "Swiss Cottage, Sandy. Around 1851, the 'Swiss Cottage' (which now serves as the reserve's visitor centre and shop) was built for Captain William Peel. When he died, the estate passed to his mother, and then to his younger brother Arthur Wellesley Peel, who built the large house known as 'Sandy Lodge'. Arthur Wellesley Peel was an MP and Speaker of the House of Commons. In 1934, the house was sold to Sir Malcolm Stewart and the formal gardens were established. The RSPB has had its UK headquarters at The Lodge since 1961."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Daffodils_in_the_grounds_of_The_Lodge%2C_Sandy_-_geograph.org.uk_-_388888.jpg",
      "title": "William Metcalfe / Daffodils in the grounds of The Lodge, Sandy",
      "caption": "Daffodils in the grounds of The Lodge. The Lodge sits on the Greensand Ridge, overlooking the River Ivel valley. The site has two Iron Age hill forts, built about 700 BC; the most impressive, on Galley Hill, is a univallate fort, with obvious banks and ditches. 'Sandy Warren' later became a valuable source of rabbits."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Gardens_at_The_Lodge_-_geograph.org.uk_-_66876.jpg",
      "title": "Katie / Gardens at The Lodge",
      "caption": "Gardens at The Lodge — in Bedfordshire. The Royal Society for the Protection of Birds' headquarters is at The Lodge, Sandy. The old swimming pool in the ornamental gardens has been converted for use as a large wildlife pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Woodland_at_The_Lodge_-_geograph.org.uk_-_1597706.jpg",
      "title": "Cameraman / Woodland at The Lodge",
      "caption": "Woodland at The Lodge. Typical woodland of the estate, mostly oak and birch with some fir and pine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Horses_by_Stratford_road_-_geograph.org.uk_-_191386.jpg",
      "title": "Oliver White / Horses by Stratford road",
      "caption": "Horses by Stratford road"
    }
  ],
  "distance_km": 3.2,
  "description": "This Bedfordshire based market town has some nice waterside trails along the River Ivel and a significant local nature reserve to explore. This circular walk visits The Lodge, an RSPB Nature Reserve at Sandy Warren. The reserve is the headquarters of the RSPB and located just to the south east of the town centre and train station. There's lovely woodland walking trails, attractive heathland, lots of wildlife and some beautiful gardens to see near the visitor centre. You can start the walk from the car park, off the Potton Road at the north eastern tip of the reserve. Then follow the trails south past Bunker's Hill to the Lodge. Here you'll find an excellent visitor centre where you can learn all about the flora and fauna at the site. Bird species to look out for on the walk include woodpeckers, hobby and nuthatch. There's also some lovely formal gardens to explore around the 19th century Swiss Cottage. To the south of the reserve you can pick up the Biggleswade Green Wheel. The shared walking and cycling trail explores the area using a section of the Kingfisher Way which runs along the River Ivel on the western side of the reserve. It visits one of the local riverside highlights at the historic Jordan's Mill which is well worth a visit. The Greensand Ridge Walk also passes just to the north of the reserve and provides an opportunity to extend your walk on a good waymarked footpath.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Sandy you could pick up the Bedford to Sandy Country Way. The shared walking and cycling trail follows a dismantled railway line to the nearby town. On the way it visits the nearby Priory Country Park where there's 360 acres of lakes, meadows, woodland and riverside paths along the River Great Ouse. You'll also pass the delightful village of Great Barford. There's nice river trails along the Ouse, an ancient arched bridge and a notable church with a 15th century tower to see here. A few miles to the east you can pick up the long distance Clopton Way in Potton Wood where there are peaceful woodland trails and lots of pretty bluebells in the spring. For more walking ideas in the area see the Bedfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iaj9-Wltyrw",
  "county": "Central Bedfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Potton Road, Potton, Sandy, Central Bedfordshire, England, SG19 2EB, United Kingdom",
  "postcode": "SG19 2EB",
  "district": "Sandy",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "garden"
  ],
  "points_of_interest": [
    "nature reserve",
    "visitor center",
    "historical sites",
    "gardens"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}