{
  "objectID": "f02ca03341a0943adda5952689e7fb54",
  "created_at": "2024-12-19T01:10:41.325713+00:00",
  "ref": "holmfirth-walking-route",
  "title": "Holmfirth Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Sid%27s_Cafe%2C_Holmfirth_-_geograph.org.uk_-_83734.jpg/256px-Sid%27s_Cafe%2C_Holmfirth_-_geograph.org.uk_-_83734.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/EBDBFEDCE911C0E5802580B4007A00E5/$FILE/Holmfirth.gpx",
  "_geoloc": {
    "lat": 53.5707396592,
    "lng": -1.7878038668
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Sid%27s_Cafe%2C_Holmfirth_-_geograph.org.uk_-_83734.jpg/256px-Sid%27s_Cafe%2C_Holmfirth_-_geograph.org.uk_-_83734.jpg",
      "title": "Nigel Homer [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Sid's Cafe, Holmfirth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/The_River_Holm_into_Hinchcliffe_Mill_-_geograph.org.uk_-_836317.jpg",
      "title": "Steve F [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The River Holm into the village of Hinchcliffe Mill. Part of the village was extensively used during the filming of \"Last Of The Summer Wine\" when for many years it was the location of the home of characters Wesley and Edie Pegden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/One_of_Holmfirth%27s_locations_for_%22Last_of_the_Summer_Wine%22_-_geograph.org.uk_-_346717.jpg",
      "title": "Tom Pennington / One of Holmfirth's locations for \"Last of the Summer Wine\"",
      "caption": "One of Holmfirth's locations for \"Last of the Summer Wine\". \nThe town's origins trace back to the 13th century, when it began to develop around a corn mill and a bridge. Over the course of three hundred years, Holmfirth experienced significant growth, particularly during the expansion of the cloth trade and the increased production of stone and slate from nearby quarries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/River_Holme_at_Holmfirth_-_geograph.org.uk_-_101295.jpg/256px-River_Holme_at_Holmfirth_-_geograph.org.uk_-_101295.jpg",
      "title": "Rob Taylor / River Holme at Holmfirth",
      "caption": "River Holme at Holmfirth. The film location of Last of the Summer Wine. Holmfirth was also famously the residence of Bamforth & Co Ltd, renowned for their humorous seaside postcards, although during the First World War era, they shifted to producing more serious postcards. The printing works located on Station Road has since been repurposed into residential flats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Norah_Batty%27s_Steps_-_geograph.org.uk_-_360607.jpg",
      "title": "Ian Russell / Norah Batty's Steps",
      "caption": "Norah Batty's steps as seen on TV's 'Last of the Summer Wine'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/All_aboard_for_Compo%27s_grave_-_geograph.org.uk_-_1096453.jpg",
      "title": "michael ely / All aboard for Compo's grave",
      "caption": "All aboard for Compo's grave. This old bus waits on Town Gate to take sightseers on a 45-minute tour of the famous spots seen in BBC's Last of the Summer Wine TV series. Amongst other attractions it visits Wesley Pegden's garage and Compo's last resting place. All for six quid."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/The_Monkey_%28formerly_The_Eastfield_PH%29_-_geograph.org.uk_-_888985.jpg",
      "title": "Wendy North / The Monkey (formerly The Eastfield PH)",
      "caption": "The Monkey (formerly The Eastfield PH) Made famous through appearances on `Last of the Summer Wine'though this pub is thirteen miles away from Holmfirth. When I came to live in the area the pub was still called The Eastfield, though its nick-name was `The Monkey'. The new owners changed the name (some years ago now)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/River_Holme_at_Holmfirth_-_geograph.org.uk_-_101295.jpg/256px-River_Holme_at_Holmfirth_-_geograph.org.uk_-_101295.jpg",
      "title": "Rob Taylor / River Holme at Holmfirth",
      "caption": "River Holme at Holmfirth"
    }
  ],
  "distance_km": 6.0,
  "description": "This circular walk explores the immediate area surrounding the town of Holmfirth in Yorkshire. The town is famous as the main location in the long running sitcom 'Last of the Summer Wine'. Viewers of the show will recognise the pretty streets and the beautiful surrounding countryside from the adventures of the main characters. It's quite a challenging walk as there are some steep climbs but you are rewarded with splendid views over the Holme Valley and Pennine Hills. You can start the walk from the town centre next to Victoria Park where there are car parks nearby. Then follow Cooper Lane and Hill Lane to the village of Upperthong. It's quite a steep climb but there's great views over the Holme Valley to enjoy on the way. Bill Owen, who played Compo in Last of the Summer Wine, is buried at the Upperthong parish church of St. John's. From Upperthong, the route heads through Hogley Green and Upper Stubbin before coming to Hinchcliffe Mill where you cross the River Holme. A nice waterside stroll follows before heading along the woodland trails in Malkinhouse Wood. You then follow country lanes along the Hills and Hamlets trail back into the town. There are many other walks around the Holmfirth area to try with the surrounding countryside criss crossed with various waymarked trails. You could further explore the area on the Holme Valley Circular Walk or the Holme Valley Hills and Hamlets Walk . These long distance trails take you on a tour of the hills, reserrvoirs and villages of the Kirklees and Huddersfield area. If you'd like to go even further afield then the Kirklees Way takes you through the Spen Valley and Colne Valley. Another good option is to head to the nearby Digley Reservoir and follow the waterside path around the lake. The reservoir is located just a few miles to the south west of the town, near Holmbridge.",
  "video_url": "https://www.youtube.com/embed/fZM-8CAMF-w",
  "postcode": "HD9 3HU",
  "district": "Holmfirth",
  "region": "Yorkshire and the Humber",
  "country": "England"
}