{
  "created_at": "2025-01-06T00:46:14.232539+00:00",
  "objectID": "f0350cc1f52366c4210e708214fe00ce",
  "ref": "rochdale-way-walking-route",
  "title": "Rochdale Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Rochdale_Way_-_geograph.org.uk_-_41772.jpg",
  "nearby": [
    {
      "description": "Greenbooth Reservoir",
      "objectID": "55dd3bae18c3fce6cc4251b9478ebcad",
      "ref": "greenbooth-reservoir-walking-route"
    },
    {
      "description": "Healey Dell",
      "objectID": "42a1b9692dc82d755af428beb2e70749",
      "ref": "healey-dell-walking-route"
    },
    {
      "description": "Tandle Hill Country Park",
      "objectID": "52803e6d641062f1c84de243a4473e44",
      "ref": "tandle-hill-country-park-walking-and-cycle-route"
    },
    {
      "description": "Ogden Reservoir and Piethorne Reservoir",
      "objectID": "d7385faea1a365c334930600c84e24c9",
      "ref": "ogden-reservoir-and-piethorne-reservoir-walking-route"
    },
    {
      "description": "Blackstone Edge",
      "objectID": "db8c8c2b6a455e57471df98fee6e8312",
      "ref": "blackstone-edge-walking-route"
    },
    {
      "description": "Owd Betts Ashworth Moor Reservoir",
      "objectID": "5c66c1c12cebd524d47e7ab556289b67",
      "ref": "owd-betts-ashworth-moor-reservoir-walking-route"
    },
    {
      "description": "Alkrington Woods",
      "objectID": "a9278f2234ed690baeb7150b8317f1b0",
      "ref": "alkrington-woods-walking-route"
    },
    {
      "description": "Oldham Way",
      "objectID": "5aeb40c8128d72cea5b1bb1992a0b91d",
      "ref": "oldham-way-walking-route"
    },
    {
      "description": "Crompton Circuit",
      "objectID": "f887f78e3df6552a028f32230c0d618b",
      "ref": "crompton-circuit-walking-route"
    },
    {
      "description": "Cheesden Valley",
      "objectID": "bcf32e5a21654e3c2083551b8d9e31f3",
      "ref": "cheesden-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f0350cc1f52366c4210e708214fe00ce.gpx",
  "_geoloc": {
    "lat": 53.6341482243,
    "lng": -2.0920611771
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Rochdale_Way_-_geograph.org.uk_-_41772.jpg",
      "title": "Dave Smethurst / Rochdale Way, via Wikimedia Commons",
      "caption": "This image was taken from SD 95488 13420 looking East along the Rochdale Way footpath, with Nicholas Pike to the left and Turf Hill to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Tandle_Hill_-_geograph.org.uk_-_9808.jpg",
      "title": "Richard Webb / Tandle Hill, via Wikimedia Commons",
      "caption": "Tandle Hill summit"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Cairn_on_Blackstone_Edge_-_geograph.org.uk_-_549529.jpg",
      "title": "Gordon Hatton / Cairn on Blackstone Edge, via Wikimedia Commons",
      "caption": "Cairn on Blackstone Edge. The cairn stands on the highest point of Blackstone Edge at 584m."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Sheep_on_the_Rochdale_Way_%28geograph_2969508%29.jpg",
      "title": "David Dixon / Sheep on the Rochdale Way, via Wikimedia Commons",
      "caption": "Sheep on the Rochdale Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Stile_on_the_Crompton_Circuit_-_geograph.org.uk_-_173123.jpg",
      "title": "michael ely / Stile on the Crompton Circuit",
      "caption": "Stile on the Crompton Circuit, a public walkway in Shaw and Crompton. This stile is adorned with three waymark discs. The one public footpath across the field is shared by the Rochdale Way, the Oldham Way and the Crompton Cicuit. View SE overlooking Shaw."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Pit_Lane%2C_Royton_-_geograph.org.uk_-_181123.jpg",
      "title": "michael ely / Pit Lane, Royton",
      "caption": "Pit Lane, Royton, Greater Manchester, England. View NE towards Burnedge from Gravel Hole. A capped coalmine shaft is about 300 metres down the track. The Track here forms part of the Rochdale Way circular walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Capped_Mineshaft_-_geograph.org.uk_-_181122.jpg",
      "title": "michael ely / Capped Mineshaft",
      "caption": "Capped Mineshaft. Situated on Pit Lane, part of the Way, a muddy track between Rochdale Road, Burnedge and Castleton Road, Gravel Hole. Small scale coal mining was the industry around here in the 19th century evidenced by the name \"Pit Lane\" and the \"Colliers Return\" pub nearby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/River_Beal%2C_Newhey_-_geograph.org.uk_-_341452.jpg",
      "title": "michael ely / River Beal, Newhey",
      "caption": "River Beal, Newhey. Looking south from the bridge at the end of Bentgate Street. The rear gardens of houses on Whitebeam Close have been extended onto the river bank. The houses on the east bank are in Rochdale whilst the grazing land on the west bank is in Oldham. The ridge on the skyline carries the Rochdale Way, the Oldham Way and the Crompton Circuit footpaths."
    }
  ],
  "distance_km": 72.0,
  "description": "A fabulous circular walk around Rochdale which visits a series of lovely reservoirs and includes a section along the River Roch. The walk visits Blackstone Edge, Healey Dell, Knowl Hill, Ashworth Moor Reservoir, Greenbooth Reservoir and the Ashworth Valley where there's nice trails along the Naden Brook and the Cheesden Brook. Other highlights include Tandle Hill Country Park, Alkrington Woods, Queens Park and the Ogden and Piethorne Reservoirs in the Piethorne Valley. There are several challenging climbs but with the reward of splendid views of the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Tandle Hill Country Park there's an on site cafe where you can stop for refreshments on the walk. There's picnic tables as well where you can sit outside on warmer days.Just to the north of the viewpoint you'll find The Tanhill Tavern. The friendly pub has good menu and can be found at 14 Thornham Ln with a postcode of M24 2SD for your sat navs. Just head north from the summit and you will find Thornham Road and the pub at the bottom of the hill. At Blackstone Edge there's a couple of fantastic pubs which demand some investigation. The White House is located right next to Blackstone Edge Reservoir and an inn of some note. The remote pub is in a fabulous location in an elevated position on the Halifax Road with panoramic views of the surrounding moors and Hollingworth Lake far below. It also has a wonderful history being originally an old coaching house dating from 1671. It is situated 1,300 feet above sea level and includes an outdoor seating area where you can relax on warmer days. The pub has an extensive menu and a nice cosy interior. You can find it at postcode OL15 0LG for your sat navs. Just up the road is the Moorcock Inn, located at the foot of the Pennines in Littleborough. There's more great countryside views from the garden area with home-made food and fine real ales on tap. It's also located on the Halifax Road at postcode OL15 0LD. On Ashworth Moor you'll pass the noteworthy Owd Betts. This traditional country pub dates all the way back to 1796. They have a good menu and a fine outdoor area with lovely views over the surrounding moors. It's a great place to relax with a drink on the route. You can find the pub right next to Ashworth Moor Reservoir on Edenfield Rd with a postcode of OL12 7TY for your sat navs. The inn is also dog friendly if you are with your canine friend.  Pictured above Owd Betts and the views from the pub. This stone building was built overlooking the Cheeseden Valley in 1796 by Richard and Mary Ashworth, probably as a farmhouse. By the time that the building passed to their son, Richard, and his wife, Betty, in the mid 1800s it had become an inn named the 'Hare and Hounds.\u0092 Following the death of her husband Betty continued to run the inn alone and it was probably during this period that it became affectionately known as \u0091Owd Betts.\u0092 In 1893 Betty too passed away at the age of 93, but the pub continued to be known as \u0091Owd Betts.\u0092 However, it was not until the 1950s that, in deference to the grand lady, the name of the pub was officially changed from the 'Hare and Hounds\u0092 to that by which it is known today, \u0091Owd Betts.\u0092"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Around Middleton, at the southern end of the route, its worth taking a small detour to visit Heaton Park in Prestwich. The park is notable as the largest park in Manchester and the largest municipal park in Europe. Features include a boating lake, an animal farm, woodlands and ornamental gardens. You can find the park about a mile west of the trail on the western side of Middleton near to Alkrington Woods. The route also links up with the Oldham Way and the Crompton Circuit, two more long distance trails which can be used to further explore the area."
    }
  ],
  "district": "Littleborough",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}