{
  "created_at": "2025-01-06T00:19:42.437393+00:00",
  "objectID": "f0719cddb879d553aab2e2db9756cd57",
  "ref": "topsham-goat-walk-walking-route",
  "title": "Topsham Goat Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/13/Topsham_quay_and_the_Lighter_Inn_-_geograph.org.uk_-_136915.jpg",
  "nearby": [
    {
      "description": "Exe Estuary Trail",
      "objectID": "5c2d93304647c7002c0f1c2912b04c2d",
      "ref": "exe-estuary-trail-cycle-route"
    },
    {
      "description": "Exmouth to Lympstone Walk",
      "objectID": "03ecfc58bd4216b322e81438eb769432",
      "ref": "exmouth-to-lympstone-walk-walking-route"
    },
    {
      "description": "Darts Farm",
      "objectID": "718188abf2bc1a7bf29e4b9c1d8842f9",
      "ref": "darts-farm-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f0719cddb879d553aab2e2db9756cd57.gpx",
  "_geoloc": {
    "lat": 50.6839040169,
    "lng": -3.4676560493
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Topsham_quay_and_the_Lighter_Inn_-_geograph.org.uk_-_136915.jpg",
      "title": "Martin Southwood / Topsham quay and the Lighter Inn, via Wikimedia Commons",
      "caption": "Topsham quay and the Lighter Inn. Note the old \"Kings Beam\" to the left of the blue hulled boat, in front of the Inn. This was the weighing beam for Customs purposes. Her Majesty's Customs address to this day is still Kingsbeam House, London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Ferry_Road_from_Topsham_Quay_-_geograph.org.uk_-_265178.jpg",
      "title": "Derek Harper / Ferry Road from Topsham Quay, via Wikimedia Commons",
      "caption": "Ferry Road from Topsham Quay. Looking away from the River Exe to the point where Ferry Road heads away from the bottom of Fore Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Topsham_from_Goat_Walk_-_geograph.org.uk_-_1437446.jpg",
      "title": "Chris Allen / Topsham from Goat Walk, via Wikimedia Commons",
      "caption": "Topsham from Goat Walk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Goat_Walk%2C_Topsham_-_geograph.org.uk_-_1313999.jpg",
      "title": "Robin Drayton / Goat Walk, Topsham, via Wikimedia Commons",
      "caption": "Goat Walk, Topsham. These benches give a not too comfortable place to sit and enjoy great views across the River Exe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Cyclamen_by_the_Goat_Walk%2C_Topsham_-_geograph.org.uk_-_264757.jpg",
      "title": "Derek Harper / Cyclamen by the Goat Walk, Topsham, via Wikimedia Commons",
      "caption": "Cyclamen by the Goat Walk, Topsham. In a narrow belt of woodland that runs beside the Goat Walk between the Strand and Riversmeet House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Bowling_Green_Lane%2C_Topsham_-_geograph.org.uk_-_462586.jpg",
      "title": "Ray Girvan / Bowling Green Lane, Topsham, via Wikimedia Commons",
      "caption": "Bowling Green Lane. Bowling Green Lane is a small road that skirts the edge of the Bowling Green Marsh RSPB bird sanctuary at the outlet of the River Clyst. It's generally quiet and popular for leisure walks as it only has vehicular access at one end; the other, at Riversmeet House, gives pedestrian access to Topsham via the Goat Walk footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Bowling_Green_Marsh_-_geograph.org.uk_-_264749.jpg",
      "title": "Derek Harper / Bowling Green Marsh, via Wikimedia Commons",
      "caption": "Bowling Green Marsh taken from the bird hide. The submerged areas follow the lines of drains across the River Clyst flood plain. In the background, the Exeter-Exmouth railway line crosses the river. Beyond, the ground rises to Ebford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Bowling_Green_Marsh_Nature_Reserve_%281%29_-_geograph.org.uk_-_1312599.jpg",
      "title": "Robin Drayton / Bowling Green Marsh Nature Reserve [1], via Wikimedia Commons",
      "caption": "Bowling Green Marsh Nature Reserve. The entrance to the reserve which has been in the care of the RSPB since 1989."
    }
  ],
  "distance_km": 3.2,
  "description": "This lovely circular walk around Topsham visits the popular Goat Walk and the deligthful Bowling Green Marsh Nature Reserve. It's a very pretty area with views of the Exe Estuary and some excellent bird watching opportunites. The walk starts at Topsham Quay and heads south along the river to the Topsham Museum. The noteworthy museum is located in one of a set of 17th century buildings looking out over the Exe Estuary. It consists of furnished period rooms, displays of the local history of the town and memorabilia of Vivien Leigh, the film star. Soon after you pass the museum you come to the start of the Goat Walk. The narrow path runs along the river with a number of pretty cottages and fine views across the estuary. There's several benches along the way so you can relax and enjoy the views. At Riversmeet House you turn east to enter the RSPB Bowling Green Marsh Nature Reserve which sits at the confluence of the River Exe and the River Clyst. In the reserve there are some nice trails to follow with birds such as avocets, lapwing and little egrets to look out for on the way. The site includes a bird hide on the marshes and a viewing platform, reached by steps. The walk follows Bowling Green Road through the reserve towards the Clyst where you can follow Monmouth Street back to the Quay. After your walk you can enjoy refreshments at the quayside Lighter Inn. There's a nice outdoor seating area where you can soak up the atmosphere of the quay in the summer months. The Exe Estuary Trail passes through Topsham so you could pick up this excellent shared cycle and walking path to continue your walk. Heading south will take you to Exton and the village of Lympstone. It's another attractive riverside village which includes an Italianate riverfront brick clock tower built around 1885. If you head north you'll soon come into the city of Exeter.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the eastern side of Topsham you could pay a visit to the splendid Darts Farm. The popular attraction includes a Sculpture Trail, a maize maze, a Farm Walk, a Nature Trail, a Bird Hide and a variety of animals."
    }
  ],
  "video_url": "https://www.youtube.com/embed/t7N9loHAc7w",
  "postcode": "EX3 0JP",
  "district": "Exeter",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Birthplace of W Follett, Ferry Road, Topsham Lock Cottage, Topsham, Exeter, Devon, England, EX3 0JP, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland",
    "urban"
  ],
  "points_of_interest": [
    "museum",
    "nature reserve",
    "riverfront"
  ],
  "facilities": [
    "car park",
    "outdoor seating",
    "bird hide",
    "viewing platform"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "bird watching"
  ]
}