{
  "objectID": "f07bab2fbacd3897d5e8acd1d83d5852",
  "created_at": "2024-12-21T21:12:07.596191+00:00",
  "ref": "oxford-island-walking-route",
  "title": "Oxford Island - Lough Neagh Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/12/Autumn_at_the_Discovery_Centre%2C_Oxford_Island_-_geograph.org.uk_-_1499713.jpg",
  "nearby": [
    {
      "description": "Peatlands Park",
      "objectID": "e49ede809221764384136e7a317bffe6",
      "ref": "peatlands-park-walking-route"
    },
    {
      "description": "Brantry Lough",
      "objectID": "4dadeddf7ee0a242829d3aee10fc9715",
      "ref": "brantry-lough-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f07bab2fbacd3897d5e8acd1d83d5852.gpx",
  "_geoloc": {
    "lat": 54.4961725111,
    "lng": -6.382445096
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Autumn_at_the_Discovery_Centre%2C_Oxford_Island_-_geograph.org.uk_-_1499713.jpg",
      "title": "P Flannagan / Autumn at the Discovery Centre, Oxford Island",
      "caption": "Autumn at the Discovery Centre, Oxford Island. The Discovery Centre, built in 1993, provides a cafe area with beautiful panoramic views across Lough Neagh and tells the Lough's history and wildlife through an extensive education programme. It has a tourist information point, gift shop and walking guides are available at reception. Oxford Island isn't an island. It is actually a peninsula of woodland, wildflower meadows, reedbeds and wildlife ponds that juts into the south-east corner of Lough Neagh and is a National Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/The_Starting_Battery_Oxford_Island_Craigavon_-_geograph.org.uk_-_1005628.jpg",
      "title": "P Flannagan / The Starting Battery Oxford Island Craigavon",
      "caption": "The Starting Battery Oxford Island Craigavon.  This structure constructed at the end of a short causeway is called \"The Starting Battery\". The Lough Neagh Sailing Club use it to start their boat races. From this point the boats line up with a marker on the far shore thus forming a start line for the races."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Jet_Ski_at_Island_Point%2C_Oxford_Island_-_geograph.org.uk_-_1004430.jpg",
      "title": "P Flannagan / Jet Ski at Island Point, Oxford Island",
      "caption": "Jet Ski at Island Point. A very popular hobby on Lough Neagh. Under the Craigavon new city plans, Oxford Island was acquired as a site for public recreation. The Lough Neagh Sailing Club was moved from its former centre at Kinnego harbour to Oxford Island and plans were drawn up for a major country park type development on the remainder of the Island. This included the leaving of the portion of the Island nearest to Closet Bay as a nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Lough_Neagh_at_Oxford_Island_-_geograph.org.uk_-_890850.jpg",
      "title": "P Flannagan / Lough Neagh at Oxford Island",
      "caption": "Lough Neagh at Oxford Island where there are many facilities and attractions. These include Craft shop, Restaurant, Kinnego Marina, Children's play area and paddling pool, Bird watching hides, Nature trails and walks, Picnic and barbecue areas, Activities for organised groups, Fishing stands, Artspace and Museum Services and events organised through the year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Oxford_Island%27s_Reedbeds_-_geograph.org.uk_-_748158.jpg",
      "title": "P Flannagan / Oxford Island's Reedbeds",
      "caption": "Reedbeds. The reedbeds in this National Nature Reserve can be made up of a range of tall grasses that prefer to grow in sheltered shallow water. Birds such as Coots, Little Grebe and various Ducks build a floating nest among the reedbeds, which provide an excellent hiding place during the vulnerable period after the young are hatched. The recent stormy weather has caused some damage to the reeds but the birds will use this supply to build their nests."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Woodland_Management_at_Oxford_Island_1_-_geograph.org.uk_-_748622.jpg",
      "title": "P Flannagan / Woodland Management at Oxford Island 1",
      "caption": "Woodland Management. The willow trees in this area have been coppiced. The stems of the willow will regrow and produce new shoots in the coming months. Coppicing of willow took place in many areas around Lough Neagh in the past and the new shoots produced in the following years were used for basket making. Wood removed from coppiced woodlands was also used for fire wood and on a larger scale for making charcoal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Kinnego_Marina_-_geograph.org.uk_-_502745.jpg",
      "title": "P Flannagan / Kinnego Marina",
      "caption": "Kinnego Marina. Situated on Lough Neagh beside Oxford Island National Nature Reserve, Kinnego Marina is the largest marina on the Lough. It boasts a range of associated amenities on site including skippered services, quality instruction in sailing and powerboating. The site offers 190 fully sheltered berths with deep and shallow water access for vessels drawing less than 1.55 metres. There are also 10 moorings. Secured summer and winter storage is provided for 60 boats within the park on-site. From Kinnego Marina, access to the North Atlantic can be obtained via Lower Bann navigation channel at Coleraine. Kinnego Marina is recognised as a leader in Northern Ireland in the provision of specialist Royal Yachting Association courses"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Loughside_Wildlife_Garden_-_geograph.org.uk_-_890856.jpg",
      "title": "P Flannagan / Loughside Wildlife Garden",
      "caption": "Loughside Wildlife Garden"
    }
  ],
  "distance_km": 2.0,
  "description": "Visit this beautiful nature reserve on the shores of Lough Neagh on this easy circular walk. There's 282 acres (113 hectares) to explore on a series of good footpaths and walking trails. Habitats in the reserve include reed beds, open water, species rich wet grassland, wildlife ponds and wildflower meadows. There's lots of wildlife to look out including a variety of butterflies and birds such as Lapwing, Curlew and Goldeneye. You can also have a stroll along the pretty Kinnego Marina and enjoy wonderful views over Lough Neagh. National Cycle Network route 9 runs right to the reserve so it's easy to visit by bike. The Loughshore Trail which runs right around the Lough also passes Oxford Island on the way. To extend your walking in the area you could visit the nearby Peatlands Park. Here you'll find miles of trails taking you to peatlands, orchards, woodland, boardwalks and two nature reserves. Just to the west is Marghery country park where there are another 3 miles of woodland walking trails with more great views over Lough Neagh.",
  "video_url": "https://www.youtube.com/embed/3DfkFXutGqo"
}