{
  "created_at": "2025-01-06T03:39:02.061813+00:00",
  "objectID": "f0829496f357fb12afcc87895cfdef32",
  "ref": "trebah-garden-walking-route",
  "title": "Trebah Garden Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Trebah_gardens_-_geograph.org.uk_-_746642.jpg",
  "nearby": [
    {
      "description": "Helford River Walk",
      "objectID": "6e6c4ea59a478424c0d524f02ccf3794",
      "ref": "helford-river-walk-walking-route"
    },
    {
      "description": "Glendurgan Garden",
      "objectID": "731aa350890c548008771fd68e22e493",
      "ref": "glendurgan-garden-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f0829496f357fb12afcc87895cfdef32.gpx",
  "_geoloc": {
    "lat": 50.1058273445,
    "lng": -5.1214903041
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Trebah_gardens_-_geograph.org.uk_-_746642.jpg",
      "title": "Dr Duncan Pepper / Trebah gardens",
      "caption": "Trebah gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Trebah_Gardens_-_geograph.org.uk_-_823362.jpg",
      "title": "Christopher Hill / Trebah Gardens",
      "caption": "A view up the hill at Trebah Gardens, from the bottom at the far side of the lake, up towards the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Polgwidden_Cove_-_geograph.org.uk_-_746650.jpg",
      "title": "Dr Duncan Pepper / Polgwidden Cove",
      "caption": "Polgwidden Cove. The view East from the foot of Trebah gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Beach_at_Trebah_-_geograph.org.uk_-_1266750.jpg",
      "title": "Trevor Harris / Beach at Trebah",
      "caption": "This beach is private, belonging to Trebah Gardens. At this point the public coastal footpath is contained behind the grass-topped wall seen here. It is hard to believe that thousands of American troops embarked here to take part in the D-Day Landings."
    }
  ],
  "distance_km": 1.5,
  "description": "Follow over 4 miles of walking paths in these stunning Cornish gardens. There are 26 acres of sub-tropical gardens to explore and a secluded private beach on the banks of the River Helford. Highlights include the stunning Water Garden built around a natural spring that flows downhill through a series of pools, over steep cascades and surrounded with a lush planting scheme. There's also the beautiful Hydrangea Valley leading to the tranquil Mallard Pond with its pretty bridge. The beach is also a delight with views of the River Helford and out to sea. You can enjoy refreshment in the pretty Boathouse Cafe by the beach. If you would like to continue your walk you could head to the adjacent Glendurgan Garden where you will find more beautiful gardens and a wonderful maze. The South West Coast Path also runs past the site so you could pick up the trail and head north east to Falmouth. From Helford Passage you can catch the ferry to the southern side of the river and try our circular Helford River Walk. There's great views over the beautiful estuary, pretty creeks, lovely beaches and nice villages with historic churches to see here.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Boathouse Beach Cafe for some refreshments on the walk. It is situated on Trebah's stunning private beach, where the garden meets the Helford River."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The gardens and beach are a lovely place for a dog walk. There's also designated dog tables in the Trebah Kitchen. Dogs are also welcome on the garden terrace and in the picnic area. You'll find water bowls at the visitor centre too. Please keep them on leads though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east you can pick up the Falmouth to Swanpool and Maenporth Walk and visit the beautiful Maenporth. There's a lovely beach and wonderful scenic cove to enjoy here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/6tC_vgSUdmI",
  "postcode": "TR11 5JZ",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Trebah Garden, Helford Passage, Trebah, Mawnan, Falmouth, Cornwall, England, TR11 5JZ, United Kingdom",
  "district": "Falmouth",
  "state": "England"
}