{
  "created_at": "2025-01-06T05:21:37.098718+00:00",
  "objectID": "f0ef28d29d86a176e5efeb9cafd2af61",
  "ref": "musselburgh-walking-route",
  "title": "Musselburgh Beach and River Esk Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Arthur%27s_Seat%2C_Edinburgh._-_geograph.org.uk_-_662377.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f0ef28d29d86a176e5efeb9cafd2af61.gpx",
  "_geoloc": {
    "lat": 55.9451766452,
    "lng": -3.0657153917
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Arthur%27s_Seat%2C_Edinburgh._-_geograph.org.uk_-_662377.jpg",
      "title": "james denham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Arthur's Seat, Edinburgh. A view from Musselburgh beach overlooking Fisherrow Harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/River_Esk%2C_Musselburgh_-_geograph.org.uk_-_552492.jpg",
      "title": "M J Richardson / River Esk, Musselburgh",
      "caption": "River Esk, Musselburgh. The river, approaching the last road bridge to cross it before entering the sea, and colourful bedding. It is shallow, and the stony bed provides good perching for the gulls"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Fisherrow_Harbour_at_Musselburgh._-_geograph.org.uk_-_975638.jpg",
      "title": "james denham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Fisherrow Harbour. The tide was out on that day and the harbour was full of 'beached' pleasure craft. It's good the harbour is still functional but this was a proud and busy fishing port."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Musselburgh_-_geograph.org.uk_-_663115.jpg",
      "title": "james denham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Beach view. Looking east with the chimneys of Cockenzie Power Station in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/River_Esk_at_Musselburgh_-_geograph.org.uk_-_1064239.jpg",
      "title": "M J Richardson / River Esk at Musselburgh",
      "caption": "River Esk at Musselburgh. With resting gulls, oystercatchers and other waders on the water line, and Arthur's Seat and Salisbury Crags in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/The_last_weir_on_the_Esk%2C_at_Musselburgh_-_geograph.org.uk_-_1064284.jpg",
      "title": "M J Richardson / The last weir on the Esk, at Musselburgh",
      "caption": "The last weir on the Esk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/The_River_Esk_at_Haugh_Park_-_geograph.org.uk_-_1178934.jpg",
      "title": "M J Richardson / The River Esk at Haugh Park",
      "caption": "The River Esk at Haugh Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Footbridge_over_the_River_Esk_-_geograph.org.uk_-_1121888.jpg",
      "title": "M J Richardson / Footbridge over the River Esk",
      "caption": "Footbridge over the River Esk Not elegant, but functional, leading from the Penicuik to Musselburgh path along the River Esk between Inveresk and Whitecraig. Take the path across the river and you will get to Monktonhall."
    }
  ],
  "distance_km": 11.2,
  "description": "This historic market town lies just to the east of the city of Edinburgh in East Lothian. It's a lovely place to come for a walk with coastal paths along the Firth of Forth and riverside trails along the Esk to enjoy. This walk takes you along the beach before picking up a riverside path along the River Esk. The walk starts at the harbour and the pier and follows a shared cycling and walking path east along Fisherrow Beach. You'll come to the point where the river meets with the sea at the eastern end of the sands. Here you turn south and follow the river through the town to Eskview where you pick up the Penicuik to Musselburgh footway and cycleway. You can follow this south past Inveresk to Whitecraig and enjoy refreshment here before returning on the same paths. This final section passes the lovely Inveresk Gardens which is run by the National Trust for Scotland. To extend the walk continue west to Portobello where you can try the Edinburgh Coastal Beach Walk. There's a popular 2 mile stretch of sandy beach with some fine Georgian architecture, Ice cream parlours, arcades, beach-side cafes and bars.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Staggs is a good choice for some post walk refreshment. They have a good selection of ales and a garden area for warmer days. The friendly pub has been run by the same family since 1858. You can find them on the High Street at postcode EH21 6JE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The beach and river trails make for a fine dog walk. The Staggs mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The epic John Muir Way starts in the town at Fisherrow. The first leg will take you to nearby Cockenzie. Just to the south there's the splendid Dalkeith Country Park where there's miles of fine trails with lots of wildlife to see. For cyclists National Cycle routes 1 and 76 past through the area. You can follow the signed trails towards Edinburgh or Dunbar. Just to the south there's the historic Carberry Hill and Tower to explore. There's a fine woodland walk here with excellent views over Edinburgh and the Firth of Forth. It's also of historic interest as the place where Mary Queen of Scots surrendered to the Confederate Lords in 1567. For more walking ideas in the area see the Edinburgh Walks and Pentland Hills Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Oq8hxwG8R_o",
  "postcode": "EH21 6EL",
  "district": "Musselburgh",
  "county": "East Lothian",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Promenade, Eskview, Fisherrow, Musselburgh, East Lothian, Alba / Scotland, EH21 6EL, United Kingdom",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "dog friendly",
    "visitor center",
    "play area",
    "cafe"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}