{
  "created_at": "2025-01-05T23:43:14.527355+00:00",
  "objectID": "f11cf2c7c69af18db1f404a1c61b5ad1",
  "ref": "frampton-marsh-walking-route",
  "title": "Frampton Marsh - The Wash Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Frampton_Marsh_-_geograph.org.uk_-_431800.jpg",
  "nearby": [
    {
      "description": "Boston",
      "objectID": "f2a6262b5ff836b18f9e465279f4d742",
      "ref": "boston-walking-route"
    },
    {
      "description": "Macmillan Way",
      "objectID": "cf3f4a199da30cc9ae551d49d13ec8f4",
      "ref": "macmillan-way-walking-route"
    },
    {
      "description": "Freiston Shore",
      "objectID": "cb71da53f3d5fc84525c7ebdf9878d1f",
      "ref": "freiston-shore-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f11cf2c7c69af18db1f404a1c61b5ad1.gpx",
  "_geoloc": {
    "lat": 52.932308661,
    "lng": 0.0168727618
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Frampton_Marsh_-_geograph.org.uk_-_431800.jpg",
      "title": "Graham Horn / Frampton Marsh, via Wikimedia Commons",
      "caption": "Frampton Marsh. Looking east from the sea bank one sees extensive salt marshes, part of the Frampton Marsh Nature Reserve. One of the most important estuaries for birds in Britain, this marsh covers 900 acres. Next stop The Netherlands or Denmark."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Grazing_on_Frampton_Marsh_-_geograph.org.uk_-_1432540.jpg",
      "title": "Ian Paterson / Grazing on Frampton Marsh, via Wikimedia Commons",
      "caption": "Grazing on Frampton Marsh. Cattle enjoying a feed on Frampton Marsh. Note the clump of trees in the background which shelter the car park at the end of the road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Marsh_Harrier_at_Frampton_Marsh_-_geograph.org.uk_-_1432409.jpg",
      "title": "Ian Paterson / Marsh Harrier at Frampton Marsh, via Wikimedia Commons",
      "caption": "Marsh Harrier at Frampton Marsh. Perched on top of a fence post alongside one of the many creeks, this large bird swooped round and round looking for prey later on."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Sluice%2C_Frampton_marsh_-_geograph.org.uk_-_1206483.jpg",
      "title": "Michael Trolove / Sluice, Frampton marsh, via Wikimedia Commons",
      "caption": "Sluice, Frampton marsh. Water levels are fundamental to wetland bird habitats. Here a simple overflow sluice maintains the steady level near the sea wall on Frampton Marsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Gate_on_top_of_the_sea_wall%2C_Frampton_Marsh_-_geograph.org.uk_-_1206553.jpg",
      "title": "Michael Trolove / Gate on top of the sea wall, Frampton Marsh, via Wikimedia Commons",
      "caption": "Gate on top of the sea wall, Frampton Marsh. A footpath and bridleway run along the top of the sea wall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Avocet_in_flight_at_Frampton_Marsh_-_geograph.org.uk_-_1432309.jpg",
      "title": "Ian Paterson / Avocet in flight at Frampton Marsh, via Wikimedia Commons",
      "caption": "Avocet in flight at Frampton Marsh. The avocet is the symbol of the RSPB who manage the reserve here, so it was a privilege to have a fly past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Bird_Hide%2C_Frampton_Marsh_-_geograph.org.uk_-_1206423.jpg",
      "title": "Michael Trolove / Bird Hide, Frampton Marsh, via Wikimedia Commons",
      "caption": "A wet land habitat has been created by excavating shallow pools and managing the water levels. Bird hides and a visitor centre are all under construction to make the visitor experience a memorable one."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Sea_bank_on_Frampton_Marsh_-_geograph.org.uk_-_1432531.jpg",
      "title": "Ian Paterson / Sea bank on Frampton Marsh, via Wikimedia Commons",
      "caption": "Sea bank on the marsh. Looking north-east along the Macmillan Way long distance footpath which follows the sea bank here."
    }
  ],
  "distance_km": 9.0,
  "description": "Visit this splendid RSPB nature reserve on the Wash on this circular walk near Boston. There are miles of good footpaths taking you to reedbed, saltmarsh, tidal mudflats, freshwater scrapes and grassland. There are good facilites with a visitor centre and a number of bird hides where you can look out for a wide variety of coastal birds. These include Avocet, Hen Harrier and Lapwing. The Macmillan Way long distance footpath runs through the reserve so it's easy to extend your walking in the area. If you head west you can enjoy a waterside walk along the River Welland to Fosdyke Bridge. You could also follow the Macmillan Way from Boston to reach the site. The waterside footpath runs along The Haven river from the town centre to The Wash. If you'd like to visit the reserve by bike then you can follow National Cycle Network route 1 from Boston. It runs on country lanes to Sandholme near the reserve.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you could pick up the Boston Walk which explores the area to the south of the town. You'll follow riverside paths along the Haven which could be extend to reach the reserve. The town is notable for St Botolph's church which is the largest parish church in England. The tower of the church is visible for many miles over the flat scenery of Lincolnshire and is known as \"Boston Stump\". The walk includes a visit to a 700 year old riverside pub near the church. Also on the Wash is the RSPB's Freiston Shore where there's a nice trail along the sea wall to try. To the south is the Peter Scott Walk which travels along a Norfolk section of the Wash. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/JUCjHLt60fY",
  "postcode": "PE20 1AY",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sea Bank, Roads Farm, Frampton CP, Boston, Lincolnshire, England, PE20 1AY, United Kingdom",
  "district": "Boston",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "mudflats",
    "reedbed",
    "saltmarsh"
  ],
  "points_of_interest": [
    "visitor center",
    "bird hides"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}