{
  "created_at": "2025-01-06T02:46:06.181184+00:00",
  "objectID": "f17d5b7e6942c0b09a32ae9ec972b920",
  "ref": "manifold-way-walking-and-cycle-route",
  "title": "Manifold Way Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Butterton%2C_the_Manifold_Valley_-_geograph.org.uk_-_524138.jpg",
  "nearby": [
    {
      "description": "Thor's Cave",
      "objectID": "e04c89a678508298389e68048d990140",
      "ref": "thors-cave-walking-route"
    },
    {
      "description": "Wetton",
      "objectID": "6cd18be4b012ce6b0972fa0fd651f0e3",
      "ref": "wetton-walking-route"
    },
    {
      "description": "Hulme End",
      "objectID": "d29a030414646ed3c35c8da7b33531dc",
      "ref": "hulme-end-walking-route"
    },
    {
      "description": "Butterton",
      "objectID": "63760b0dfc14e1c776de46a0e1c2be44",
      "ref": "butterton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f17d5b7e6942c0b09a32ae9ec972b920.gpx",
  "_geoloc": {
    "lat": 53.131197573,
    "lng": -1.8468006925
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Butterton%2C_the_Manifold_Valley_-_geograph.org.uk_-_524138.jpg",
      "title": "Mike Harris / Butterton, the Manifold Valley",
      "caption": "The Manifold Valley Butterton, view south along the Manifold Valley and the Manifold Way. The latter is a medium-distance trail (pedestrian and cycleway) on the course of the disused Leek and Manifold Valley light railway. The accessible part of the trail runs for 8-9 miles from Hulme End in the north along the Manifold Valley via Wetton Mill to Waterhouses in the south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Manifold_Way%2C_walking_south_from_Hulme_End_-_geograph.org.uk_-_1453083.jpg",
      "title": "Peter Barr / Manifold Way; walking south from Hulme End",
      "caption": "Manifold Way, walking south from Hulme End. The Manifold Way was opened in July 1937 by Staffordshire County Council, following the transfer of the trackbed by the LMS. Fully tarmacked and featuring a gentle downhill slope from north to south, the path is well-suited for wheelchair users, prams, and similar equipment. Along a stretch of approximately 1.5 miles (2.4 km) near Wetton Mill, the original railway route is shared with motor traffic, as a minor unclassified road has been diverted along its path. This segment includes Swainsley Tunnel. However, the designated Manifold Trail follows the eastern bank of the river for the most part, avoiding the on-road section."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Cafe_at_Wetton_Mill_-_geograph.org.uk_-_1408817.jpg",
      "title": "Row17 / Cafe at Wetton Mill",
      "caption": "Cafe at Wetton Mill. The mill was a water mill for grinding corn, and the remains of a mill stream, along with a grindstone, may still be seen here. The mill is long since disused, but the Tea Room is popular with tourists. There were ten stations and halts along the line, most with waiting rooms and sidings, although they were small. Today, the sites of these halts are visible, along with evidence of loading platforms, particularly at Ecton, where the dairy industry provided significant business for the railway. Ecton Hill features the remains of a 4,000-year-old copper mine, while the caves at Beeston Tor have revealed Neolithic and Bronze Age artifacts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Beeston_Tor_-_geograph.org.uk_-_63151.jpg",
      "title": "Cathy Cox / Beeston Tor",
      "caption": "Beeston Tor. View looking east from the Manifold Way towards Beeston Tor, a limestone cliff popular with climbers. The tor overlooks the confluence of the River Hamps with the River Manifold. Throughout the Manifold Way, the rivers are never far away, with numerous small bridges crossing them. However, during the summer months, the River Manifold disappears down a swallet or sinkhole near Wetton Mill, only to reappear some distance away at Ilam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Manifold_Way_-_geograph.org.uk_-_1999387.jpg",
      "title": "Manifold Way by Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cyclists on the trail. Unlike neighbouring walkways and cycle paths like the Tissington Trail and the High Peak Trail, which traverse elevated areas of the Peak District, the Manifold Way follows the valleys and offers more shelter. The route boasts picturesque scenery, and tourism was a key factor in the original construction of the railway. Bikes can be hired at Waterhouses, situated at the southern end of the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Thor%27s_cave.jpg",
      "title": "No machine-readable author provided. Espresso Addict assumed (based on copyright claims)., CC BY-SA 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>, via Wikimedia Commons",
      "caption": "Thor's cave. Reached by an easy stepped path from the Manifold Way, the cave is a popular tourist spot, with views over the Manifold Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Manifold_Way_-_geograph.org.uk_-_1999398.jpg",
      "title": "Manifold Way by Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Two Walkers on a tree lined section. The Manifold Way doesn't pass through major population centres; it was once described by a railway worker as a line that started and ended in the middle of nowhere. Although the railway served villages and hamlets along its route, most were situated about a mile above the valley, contributing to the railway's eventual closure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/The_Manifold_Valley_-_geograph.org.uk_-_72478.jpg",
      "title": "Cathy Cox / The Manifold Valley",
      "caption": "The Manifold Valley viewed from the mouth of Thor's Cave. Ossoms Hill is on the left and the Manifold Way which follows the track-bed of the Leek & Manifold Valley Light Railway, which ran for 30 years from 1904 to 1934, can be seen snaking its way through the valley bottom."
    }
  ],
  "distance_km": 13.0,
  "description": "Follow the River Manifold and the River Hamps through the Manifold Valley on this splendid shared walking and cycling path through the Peak District. The path runs from Waterhouses to Hulme End along a former railway line with beauitful Peak District Scenery to enjoy. The route passes Beeston Tor, Wetton Mill and the wonderful Thor's Cave which is well worth exploring. Inside you will find fascinating rock formations and mineral colours with splendid views over the Manifold Valley. At the southern end of the route in Waterhouses you will find the Manifold Cycle Centre where you can hire bikes for your outing. At the start/end point at Hulme End there's a cafe for refreshments and the Manifold Valley visitor centre where you'll find a wealth of information about the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Wetton Mill Tea Rooms are a nice place for a pit stop on the walk. You can sit outside next to the river and enjoy a delicious meal or snack. You can find them at Dale farm with postcode DE6 2AG. Near Hulme End there's also the Manifold Inn. The 200 year old coaching inn sits in a lovely spot in its own grounds on the banks of the Manifold River, opposite The Old Toll House which used to serve the turnpike and river ford. Near here there's also the visitor centre for the valley and a car park and cafe at Hulme End."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aGXP8kqyxnU",
  "postcode": "SK17 0EZ",
  "district": "Staffordshire Moorlands",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "East View, B5054, Fawfieldhead, Hulme End, Staffordshire Moorlands, Staffordshire, England, SK17 0EZ, United Kingdom",
  "state": "England"
}