{
  "created_at": "2025-01-06T01:58:50.331957+00:00",
  "objectID": "f198043cfbac7fc331c322bb19d35433",
  "ref": "hyde-park-walking-and-cycle-route",
  "title": "Hyde Park Walks and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Hyde_Park_-_geograph.org.uk_-_1574373.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f198043cfbac7fc331c322bb19d35433.gpx",
  "_geoloc": {
    "lat": 51.5036121874,
    "lng": -0.1532597908
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Hyde_Park_-_geograph.org.uk_-_1574373.jpg",
      "title": "Paul Gillett / Hyde Park, via Wikimedia Commons",
      "caption": "Near to the Broad Walk on the East side of the Park, the fallen leaves make a carpet on this November afternoon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Statue_of_Achilles%2C_Hyde_Park_%28geograph_5802467%29.jpg",
      "title": "Malc McDonald / Statue of Achilles, Hyde Park, via Wikimedia Commons",
      "caption": "Statue of Achilles, Hyde Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Hyde_Park_-_geograph.org.uk_-_1544533.jpg",
      "title": "Gerald England / Hyde Park, via Wikimedia Commons",
      "caption": "Exercise poles in the wooded area of Hyde Park. The ground is littered with fallen leaves."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Hyde_Park_-_geograph.org.uk_-_1465023.jpg/256px-Hyde_Park_-_geograph.org.uk_-_1465023.jpg",
      "title": "Martin Addison / Hyde Park, via Wikimedia Commons",
      "caption": "Converging footpaths seen through the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Entering_Hyde_Park_-_geograph.org.uk_-_1741542.jpg",
      "title": "DS Pugh / Entering Hyde Park, via Wikimedia Commons",
      "caption": "Winter scene. One of the paths in Hyde Park closest to Buckingham Palace."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Bridleway_in_Hyde_Park_-_geograph.org.uk_-_654518.jpg",
      "title": "Oxyman / Bridleway in Hyde Park, via Wikimedia Commons",
      "caption": "North Carriage Drive, Bridleway in Hyde Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/The_Dell%2C_Hyde_Park_-_geograph.org.uk_-_746127.jpg",
      "title": "pam fray / The Dell, Hyde Park, via Wikimedia Commons",
      "caption": "The Dell, Hyde Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Hyde_Park_1_-_geograph.org.uk_-_14785.jpg",
      "title": "Claire Ward / Hyde Park 1, via Wikimedia Commons",
      "caption": "Taken from the middle of the grid square. Looking towards the Bayswater Road."
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy a walk or cycle around this famous London Park. There is a cycle path running up from Hyde Park Corner through the park and along the Serpentine Lake. You can cross the Serpentine Bridge and return on the other side of the lake for a nice easy circular cycle ride. The cycle path also extends to Kensington Gardens, passing the Serpentine Gallery and Kensington Palace before finishing at the Diana Memorial Garden near Queensway tube station. Cycle Superhighway 3 can also be used to extend your ride. The popular trail runs from nearby Lancaster Gate to Greatfields Park in Barking, passing several of the city's highlights on the way. Walkers can enjoy miles of footpaths taking you through Hyde Park to Kensington gardens where you can visit the Diana, Princess of Wales Memorial Fountain and Kensington Palace. There's 350 acres to explore with a rose garden, Italian garden, statues, fountains and the Round Pond. Other features include Speakers' Corner where you can listen to public debates and the ornate Albert Memorial in Kensington Gardens. To extend your walking in the area you can head east along the The Diana Princess of Wales Memorial Walk and visit Green Park and the splendid St James's Park. The waymarked 60km Jubilee Greenway also passes through the park. The he circular trail takes you on a tour of London, visiting several of the capital's best parks. Cyclists could head south along London Cycle Route 5 to Belgravia and the River Thames where you will find Battersea Park on the other side of Chelsea Bridge. You can virtually explore the park using the google street view link below!",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Lido Cafe is a great place to enjoy some refreshments after your excercise. There's a nice outdoor seating area where you can relax and enjoy a snack while enjoying views over the lovely Serpentine Lake. The cafe is located on the south side of the Serpentine, near the Diana Princess of Wales Memorial Fountain."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great place for dog walking although there are some places where they are not allowed or should be kept on a lead. These are clearly indicated within each park and are usually ecologically sensitive sites, children's play areas, restaurants, cafes and some sports areas."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just west of Kensington Gardens there's Holland Park to explore. The historic park was formerly the grounds of a Jacobean mansion called Holland House. It's well worth a visit with beautiful gardens, wildlife rich woodland, a stunning Japanese garden with waterfalls and a nice cafe for refreshments. For more walking ideas in the area see the Greater London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/H1cFtiFmkm8",
  "postcode": "SW1X 7TA",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rotten Row, Belgravia, London, Greater London, England, SW1X 7TA, United Kingdom",
  "state": "England"
}