{
  "created_at": "2025-01-06T05:10:15.937556+00:00",
  "objectID": "f1b35618d8e5765411b4680143295816",
  "ref": "stockton-on-tees-walking-route",
  "title": "Walks in Stockton on Tees Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Victoria_Bridge%2C_Stockton-on-Tees_-_geograph.org.uk_-_258094.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f1b35618d8e5765411b4680143295816.gpx",
  "_geoloc": {
    "lat": 54.5993216565,
    "lng": -1.2999140171
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Victoria_Bridge%2C_Stockton-on-Tees_-_geograph.org.uk_-_258094.jpg",
      "title": "Mick Garratt / Victoria Bridge, Stockton-on-Tees",
      "caption": "Victoria Bridge, Stockton-on-Tees. Opened on the 20 June 1887, the new bridge spanning the Tees was so named in commemoration of the 50th anniversary of the reign of Queen Victoria."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Castlegate_Quay_%2C_Stockton-on-Tees_-_geograph.org.uk_-_260354.jpg/256px-Castlegate_Quay_%2C_Stockton-on-Tees_-_geograph.org.uk_-_260354.jpg",
      "title": "Hugh Mortimer / Castlegate Quay : Stockton-on-Tees",
      "caption": "Castlegate Quay, Stockton-on-Tees. HM Bark Endeavour, moored at Castlegate Quay. This is a full size replica of the ship Captain Cook used in his first voyage of discovery to Australia. (launched in 1993)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Cycle_path%2C_Stockton-on-Tees_-_geograph.org.uk_-_167510.jpg",
      "title": "Oliver Dixon / Cycle path, Stockton-on-Tees",
      "caption": "Cycle path, Stockton-on-Tees. Straight as an arrow this cycle path runs along the line of an old railway, which is a southern extension of the Castle Eden Walkway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Stockton_on_Tees.jpg",
      "title": "Mick Garratt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Shambles, High Street, Stockton on Tees, Great Britain. The single storey building occupying the centre of the High Street is The Shambles. It dates from 1825 and replaced an earlier building. Traditionally it was where the butchers' shops were located next to the outdoor market."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Bridge_Over_Billingham_Beck_-_geograph.org.uk_-_101890.jpg",
      "title": "Mick Garratt / Bridge Over Billingham Beck",
      "caption": "Bridge Over Billingham Beck. Another view of Billingham Beck; this time looking upstream from the other side of the tunnel/bridge under the railway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Pond_near_Visitors%27_Centre_-_geograph.org.uk_-_1751774.jpg/512px-Pond_near_Visitors%27_Centre_-_geograph.org.uk_-_1751774.jpg",
      "title": "Philip Barker / Pond near Visitors' Centre",
      "caption": "Pond near Visitors' Centre. This photograph shows a view of the pond near the Visitors' Centre in Billingham Beck Valley Country Park. The picture was taken looking in a northerly direction towards Wolviston."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Layered_Hedge_and_Meadow%2C_Billingham_Beck_Valley_Country_Park_-_geograph.org.uk_-_16792.jpg",
      "title": "Mick Garratt / Layered Hedge and Meadow, Billingham Beck Valley Country Park",
      "caption": "Layered Hedge and Wildflower Meadow, Billingham Beck Valley Country Park. Locally better known as Billingham Bottoms the park contains an \"Ecology Park\" which was created on a former industrial tip and provides a variety of habitats for educational purposes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Visitor_Centre_Billingham_Beck_Valley_Country_Park_-_geograph.org.uk_-_1619472.jpg",
      "title": "peter robinson / Visitor Centre Billingham Beck Valley Country Park",
      "caption": "Visitor Centre Billingham Beck Valley Country Park"
    }
  ],
  "distance_km": 2.8,
  "description": "This market town in County Durham has some nice riverside trails, local country parks, nature reserves and woodland areas to explore on foot. It's located on the River Tees near to the towns of Darlington, Hartlepool and Middlesbrough. Stockton is notable for having the broadest High Street in England and an old market place with a 18th century Town Hall and Market Cross. This short walk in the town visits the pretty Billingham Beck Valley Country Park on the north eastern side of the town. You can start the walk from the visitor centre car park and pick up the footpaths taking you to wildflower meadows, reed-beds, ponds, marsh and woodland. It's a great place for wildlife with birds such as grey heron, kingfisher, snipe, sedge warbler, coot and moorhen attracted to the wetland areas. To continue your walking around the town head south and visit the Tees Barrage. Here you can also pick up the riverside Teesdale Way, a waymarked long distance walking trail. For a sample walk in the town centre see the video below. This visits some of the historical and architectural highlights of the town. At the start you can see the Stockton Flyer, a popular art installation in the town centre. People gather round to watch the sculpture rise from within a stone plinth at 1 p.m. every day. It moves emits smokes, and sounds a whistle. The piece is a stylised depiction of the Locomotion No. 1, which first arrived in Stockton in 1825, and, as part of the Stockton and Darlington Railway had a large impact on the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Station Hotel is located a short walk from the park. The friendly pub serves good food and can be found at 172 Station Road, TS23 2RH. Head into Hartburn on the western side of town and you could pay a visit to The Masham. The village pub does a great Sunday roast which you can enjoy in their garden area on warmer days. You can find them at postcode TS18 5DR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails in the park are ideal for dog walking so you'll probably bump into other owners on your visit. The Masham mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles north west and you could visit the neighbouring town of Sedgefield. The settlement has a nice village feel with a number of photogenic eighteenth century houses surrounding a pretty green. There is also a fine medieval church with a noteworthy tower to see. For more walking ideas in the area see the County Durham Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/uATd14T1NuM",
  "district": "Billingham",
  "county": "Stockton-on-Tees",
  "region": "Tees Valley",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wolviston Road, Billingham Green, Billingham, Stockton-on-Tees, Tees Valley, England, TS23 1PT, United Kingdom",
  "postcode": "TS23 1PT",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "marsh",
    "reed-beds"
  ],
  "points_of_interest": [
    "historical sites",
    "wildflower meadows",
    "architectural highlights"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "waymarked trail"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}