{
  "created_at": "2025-01-06T03:06:06.540798+00:00",
  "objectID": "f22b929f96f41c63ab8edbce84785b59",
  "ref": "bridgend-circular-walk-walking-route",
  "title": "Bridgend Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/09/Stepping_Stones_on_River_Ogmore%2C_Ogmore_Castle%2C_Ogmore%2C_near_Bridgend%2C_Wales_-_geograph.org.uk_-_88693.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f22b929f96f41c63ab8edbce84785b59.gpx",
  "_geoloc": {
    "lat": 51.4803792516,
    "lng": -3.6125444193
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Stepping_Stones_on_River_Ogmore%2C_Ogmore_Castle%2C_Ogmore%2C_near_Bridgend%2C_Wales_-_geograph.org.uk_-_88693.jpg",
      "title": "John Goodall / Stepping Stones on River Ogmore, Ogmore Castle, Ogmore, near Bridgend, Wales",
      "caption": "Ogmore Castle - route start. This Grade I listed ruin is located near the village of Ogmore-by-Sea, just south of Bridgend. Ogmore was one of three castles built in the area in the early 12th century, the others being Coity Castle and Newcastle Castle. Pictured here are a popular set of stepping stones across the river which are a Scheduled Ancient Monument."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Pant_St_Brides_-_%5E%5E%5E_Farm_-_geograph.org.uk_-_286426.jpg",
      "title": "Tony Hodge / Pant St Brides - ??? Farm",
      "caption": "Pant St Brides"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Coychurch_Common_-_geograph.org.uk_-_339080.jpg",
      "title": "kenneth rees / Coychurch Common",
      "caption": "Coychurch Common. The route passes this common and stream just east of Bridgend."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Main_Road_Coychurch_-_geograph.org.uk_-_339658.jpg",
      "title": "kenneth rees / Main Road Coychurch",
      "caption": "Main Road Coychurch"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Coity_Castle%2C_Bridgend_%28geograph_1689628%29.jpg",
      "title": "Jaggery / Coity Castle, Bridgend",
      "caption": "Coity Castle, Bridgend"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/River_Ogwr_in_Bridgend_-_geograph.org.uk_-_1548047.jpg",
      "title": "Lee Ralph / River Ogwr in Bridgend",
      "caption": "River Ogwr in the town."
    }
  ],
  "distance_km": 32.0,
  "description": "Starting at Ogmore Castle on the River Ogwr, follow this relativley flat route around the town of Bridgend, South Wales. To the south of the town you pass through the picturesque villages of Ogmore by Sea and Merthyr Mawr. Here you'll pass close to the lovely Merthyr Mawr Sand Dunes which are worth a short detour from the route. The National Nature Reserve is one of the area's highlights and includes the 'Big Dipper', the highest dune in Wales. There's also the option of picking up the Wales Coast Path here and following it towards Porthcawl on our Porthcawl Coastal Walk. To the north of the town you can visit Bryngarw Country Park. There's great walking trails here taking you to woodland, gardens, and an ornamental lake. Here you can also pick up the Garw Valley Railway Path. The shared cycling and walking path starts in the park and heads north along a disused railway line to Blaengarw alond the River Garw.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Watermill is a notable pub located on the river Ewenny in Ogmore village. There's a lovely outdoor seating area with views of the picturesque countryside surrounding the pub. It's a great place to relax on summer days and watch the horses graze in the adjacent field. Indoors there's an attractive interior with a cosy atmophere. There's a very good menu and the pub is also very dog friendly. You can find it on the Ogmore Road at a postcode of CF32 0QP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails on the route make for a fine dog walk. The Watermill mentioned above is also very dog friendly with biscuits available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Porthcawl you can visit the lovely Kenfig Nature Reserve where there's lots of wildlife, sand dunes and the Kenfig Pool, Glamorgan's largest lake. The pleasant walk along Aberavon Sands in Port Talbot is just west of here. Also nearby is the attractive market town of Cowbridge. Here you can visit the Physic Garden and a pleasant riverside park along the River Thaw."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iUyThFodwjw",
  "county": "Bro Morgannwg - the Vale of Glamorgan",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}