{
  "objectID": "f2553b110836dbf911389e7f449508c4",
  "created_at": "2024-12-18T09:27:11.530047+00:00",
  "ref": "braintree-walking-route",
  "title": "Braintree Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Bocking_Blackwater_10.jpg/256px-Bocking_Blackwater_10.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/CAA3F1195223C5F7862585720079A345/$FILE/Braintree.gpx",
  "_geoloc": {
    "lat": 51.8857539055,
    "lng": 0.5618249295
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Bocking_Blackwater_10.jpg/256px-Bocking_Blackwater_10.jpg",
      "title": "Dudley Miles / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Bocking Blackwater is a Local Nature Reserve on the banks of the River Blackwater in Braintree Essex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Bocking_Blackwater_17.jpg/256px-Bocking_Blackwater_17.jpg",
      "title": "Dudley Miles / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "View of the river, grassland and trees in the reserve. Taken in the spring of 2016"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/War_Memorial%2C_Public_Gardens%2C_Bocking_End%2C_Braintree%2C_Essex_-_geograph.org.uk_-_1411125.jpg/512px-War_Memorial%2C_Public_Gardens%2C_Bocking_End%2C_Braintree%2C_Essex_-_geograph.org.uk_-_1411125.jpg",
      "title": "Trevor Wright / War Memorial, Public Gardens, Bocking End, Braintree, Essex",
      "caption": "War Memorial, Public Gardens, Bocking End, Braintree, Essex. UK National Inventory of War Memorials No.22070. The gardens are located a short stroll to the south east of the reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Bocking_Windmill%2C_Church_Street%2C_Bocking%2C_Braintree_-_geograph.org.uk_-_57800.jpg",
      "title": "Brenda Howard / Bocking Windmill, Church Street, Bocking, Braintree",
      "caption": "The Grade II listed Bocking Windmill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Bocking_Bradfordstreet_Mill%2C_Bocking%2C_Braintree_-_geograph.org.uk_-_60598.jpg",
      "title": "Brenda Howard / Bocking Bradfordstreet Mill, Bocking, Braintree",
      "caption": "Bocking Bradfordstreet Mill. Most recently used for making pellets and cubes for animal feed but no longer water powered. It is at this point that the road changes from Bradford Street, to Broad Road, and the river changes its name from Blackwater to Pant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Braintree_District_Museum%2C_Manor_Street%2C_Braintree_-_geograph.org.uk_-_59717.jpg",
      "title": "Brenda Howard / Braintree District Museum, Manor Street, Braintree",
      "caption": "Braintree District Museum, Manor Street. This building was formerly a Victorian School, one of the many buildings given to the town by the Courtauld family, famous for bringing the textile industry to Braintree in the early 19th century. As a museum, it now tells the history of the area's textile and engineering heritage. The museum is a worthy place to visit after your walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Braintree_Town_Hall_Centre%2C_Fairfield_Road%2C_Braintree_-_geograph.org.uk_-_59709.jpg",
      "title": "Brenda Howard / Braintree Town Hall Centre, Fairfield Road, Braintree",
      "caption": "Braintree Town Hall Centre, Fairfield Road. Given as a gift to the town by the Courtauld family, this Grade II* listed building with its rich wood-panelled interior, houses the Tourist Information Centre and Art Gallery."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Post_Office%2C_Bocking_Churchstreet%2C_Braintree_-_geograph.org.uk_-_56963.jpg",
      "title": "Brenda Howard / Post Office, Bocking Churchstreet, Braintree",
      "caption": "Post Office, Bocking Churchstreet. Small, well used rural Post Office."
    }
  ],
  "distance_km": 8.8,
  "description": "The Essex town of Braintree has some nice walking trails along the River Brain and River Blackwater which run through the town. There's also some pretty public parks and a larger country park to visit in the town. This circular walk in the town visits the Bocking Nature Reserve on the River Blackwater, Doreward's Hall and the ancient windmill at Bocking Churchstreet. The nature reserve is located just to the north of the train station and town centre. There's some nice footpaths along the river with lots of flora and fauna to look out for on the way. Habitats include wildflower meadows, grassland, scrub, and wetland. There's also some adjacent woodland areas and a wooden board walk and play sculpture on site. After exploring the reserve you then follow other footpaths up to the village of Bocking Churchstreet, located just to the north of Braintree. On the way you'll pass the 16th century Doreward's Hall and the Bocking Windmill . The Grade II listed structure was built in 1721 and consists of five floors with a fascinating history. They have open days where knowledgeable guides will explain the workings of the windmill from the very top to the bottom. There are also a number of computer presentations which include a photographic tour. After admiring the windmill you turn south to follow paths to Thistley Green. Other paths then take you back to the river where you can enjoy a final riverside stroll back to the start point of the walk.",
  "postcode": "CM7 9JZ",
  "district": "Braintree",
  "county": "Essex",
  "region": "Eastern",
  "country": "England"
}