{
  "created_at": "2025-01-06T00:56:31.714048+00:00",
  "objectID": "f2a6262b5ff836b18f9e465279f4d742",
  "ref": "boston-walking-route",
  "title": "Walk around Boston Lincolnshire Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d4/The_Haven%2C_Boston_-_geograph.org.uk_-_709138.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f2a6262b5ff836b18f9e465279f4d742.gpx",
  "_geoloc": {
    "lat": 52.9743938795,
    "lng": -0.0235479567
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/The_Haven%2C_Boston_-_geograph.org.uk_-_709138.jpg",
      "title": "Dave Hitchborne / The Haven, Boston",
      "caption": "The Haven, Boston. A general view of the tidal Haven, looking up river. There are plans to build a tidal barrage near the Black Sluice so as to reduce the incidence of flooding in the town and to manage boat access between the River Witham and the South Forty-foot drain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Riverside_Quay%2C_Boston_-_geograph.org.uk_-_675857.jpg",
      "title": "Dave Hitchborne / Riverside Quay, Boston",
      "caption": "Riverside Quay, Boston. To the left is the quay and Boston docks. The waterway is the River Witham, also known as The Haven."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/River_Haven_-_geograph.org.uk_-_430071.jpg",
      "title": "Graham Horn / River Haven",
      "caption": "River Haven. As the River Haven heads towards the Wash, it becomes more rural, leaving the Post of Boston behind. The sea wall on both sides is a few metres above the river, sometimes close to its bank and sometimes drifting inland. The Macmillan Way (290-mile coast to coast route from Lincolnshire to Dorset) follows this bank for several miles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Swing_Bridge%2C_Boston_-_geograph.org.uk_-_694455.jpg",
      "title": "Dave Hitchborne / Swing Bridge, Boston",
      "caption": "Swing Bridge, Boston. This railway bridge connects the docks with the main line. Photographed from the Macmillan Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/River_Haven_sea_bank_-_geograph.org.uk_-_429883.jpg",
      "title": "Graham Horn / River Haven sea bank",
      "caption": "River Haven sea bank. The River Haven flows through the Port of Boston. Here, shortly after high tide, it can be seen to be much higher than the surrounding land, protected by substantial sea banks, this being on the south of the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Two_churches_-_geograph.org.uk_-_430079.jpg",
      "title": "Graham Horn / Two churches",
      "caption": "Two churches. From the sea wall on the south side of the River Haven south-east of Boston. Two churches can be seen. To the right, Skirbeck Church on the north side of the Haven. To the left below the pylons, Boston Stump (St Botolphs, Boston) in the centre of Boston; a landmark for miles around. In the foreground the flood plain of the River Haven can be seen, contained by the sea bank to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Across_the_Haven_-_geograph.org.uk_-_430095.jpg",
      "title": "Graham Horn / Across the Haven",
      "caption": "Across the Haven. Where the southern sea bank turns inland away from the Haven marshy areas are left. On the north bank of the river opposite the sea bank runs adjacent to the river, with industrial units behind it. The 1:25K map marks the small bank close to the camera then where it turns right at right angles. This location is also on the meridian line, 0 degrees, directly north of Greenwich."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/%22Boston_Stump%22_-_geograph.org.uk_-_3978.jpg",
      "title": "Martin Clark / \"Boston Stump\"",
      "caption": "\"Boston Stump\". The tower of St Botolph's Church, Boston, is visible for many miles over the flat scenery of Lincolnshire and is known as \"Boston Stump\". Looking south east from the visitor moorings on the River Witham. The church is notable as the largest parish church in England. Its tower is 266 feet high and can be seen for miles around."
    }
  ],
  "distance_km": 9.0,
  "description": "This market town in Lincolnshire has some nice riverside trails and a local nature reserve to visit. It's in a notable location on the edge of the Wash where Norfolk meets Lincolnshire. In the town there's some interesting old buildings including the 14th century Guildhall, Maud Foster windmill (1819) and the impressive St Botolph’s Church. This walk explores the quays and docks to the south of the town, following a footpath along The Haven river. The walk starts in the town centre where you can pick up the Macmillan Way and follow the waymarked footpath south past the Quay, the Swing Bridge and the docks. The trail then takes you along The Haven to Slippery Gow where you can pick up alternative paths to the west of the river. These will take you north before rejoining the river and following it back into the town centre. You can extend the walk by heading north along the River Witham towards Anton's Gowt.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town Goodbarns Yard is a good choice for some post walk refreshments. They have a good menu and a lovely large garden area right next to the river. The pub also has some history, dating back over 700 years with some interesting old town photos on the walls. You can find them just east of the train station on a cobbled medieval street, near to St Botolphs church. The address is 8 Wormgate with a postcode of PE21 6NP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The riverside path is a nice one to try with your dog. Goodbarns Yard mentioned above is also dog friendly in the garden area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue south along the Macmillan Way it will take you to the Frampton Marsh Nature Reserve. The reserve is located on The Wash and includes reedbed, saltmarsh, tidal mudflats, freshwater scrapes and grassland. There's also the RSPB's Freiston Shore to visit in this area. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mvQZqK93obk",
  "district": "Boston",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Buoy Yard, South End, Haven Village, Trinity, Boston, Lincolnshire, England, PE21 1ZZ, United Kingdom",
  "postcode": "PE21 1ZZ",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "footpath"
  ],
  "points_of_interest": [
    "historical buildings",
    "river"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}