{
  "created_at": "2025-01-06T01:02:26.103652+00:00",
  "objectID": "f312dc3de426e5ef5c4b568e53ee7437",
  "ref": "rendlesham-forest-walking-and-cycle-route",
  "title": "Rendlesham Forest Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Supposed_UFO_landing_site_-_Rendlesham_Forest_-_geograph.org.uk_-_263104.jpg",
  "nearby": [
    {
      "description": "Tunstall Forest",
      "objectID": "4014c6f69680790b811289c26991c91d",
      "ref": "tunstall-forest-walking-and-cycle-route"
    },
    {
      "description": "Suffolk Coast Path",
      "objectID": "0e29c3db92e53d17066c601df86904be",
      "ref": "suffolk-coast-path-walking-route"
    },
    {
      "description": "Orford Ness",
      "objectID": "d29ab9e294a7b037db4219c4c227d782",
      "ref": "orford-ness-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f312dc3de426e5ef5c4b568e53ee7437.gpx",
  "_geoloc": {
    "lat": 52.0837937136,
    "lng": 1.4335228046
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Supposed_UFO_landing_site_-_Rendlesham_Forest_-_geograph.org.uk_-_263104.jpg",
      "title": "Simon Leatherdale / Supposed UFO landing site - Rendlesham Forest, via Wikimedia Commons",
      "caption": "View of the supposed UFO landing site. In the last days of 1980 UFOs reputedly landed in the eastern edge of Rendlesham Forest - Right, middle distance in this view (the trees are Corsican Pine)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Fallen_tree%2C_Rendlesham_forest_-_geograph.org.uk_-_1229543.jpg",
      "title": "John Goldsmith / Fallen tree, Rendlesham forest, via Wikimedia Commons",
      "caption": "This tree evidently fell long ago, but enough roots stayed in the ground for it to live and many of the branches have turned round to grow back upwards. The footpath through the woods is on the right. The valley to the left has a stream and is probably quite waterlogged, as little grows there."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/RAF_Woodbridge_-_amidst_Rendlesham_Forest_-_geograph.org.uk_-_397829.jpg",
      "title": "Simon Leatherdale / RAF Woodbridge - amidst Rendlesham Forest, via Wikimedia Commons",
      "caption": "RAF Woodbridge - amidst the forest. The perimeter fence of the former USAAF base showing hardened shelters on the left and the Corsican pine plantations of the Forestry Commission's Rendlesham Forest on the right. The base was cut out of the forest in WWII, perhaps yet to return to it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Rendlesham_Forest_-_geograph.org.uk_-_1303291.jpg",
      "title": "Keith Evans / Rendlesham Forest, via Wikimedia Commons",
      "caption": "Track looking west in the forest near to Capel St.Andrew"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Red_crag_pit_in_Rendlesham_Forest_-_geograph.org.uk_-_258268.jpg",
      "title": "Simon Leatherdale / Red crag pit in Rendlesham Forest, via Wikimedia Commons",
      "caption": "Red crag pit in the forest. Marine deposits of Red Crag are clearly seen in this recently cut face, now being used by Sand Martin colony."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Pond%2C_Rendlsham_Forest_-_geograph.org.uk_-_911599.jpg",
      "title": "Simon Peck / Pond, Rendlsham Forest, via Wikimedia Commons",
      "caption": "Pond, with a boardwalk across it. This pond has been created by damming the Tangham, a small stream that drains Rendlesham Forest. Several other small ponds have been created as wildlife havens."
    }
  ],
  "distance_km": 8.0,
  "description": "Rendlesham Forest is probably most famous for reported UFO sightings in 1980 but it is also a great place for cycling and walking. Cyclists can enjoy two easy, family cycle routes on flat well defined paths and quiet country lanes. For walkers there are also two way-marked trails of differing lengths. Both are an easy stroll suitable for all abilties. There is also a UFO trail which takes you to some of the areas connected to the UFO sighting in December 1980. The circular route below starts at the car park/visitor centre and takes you through forest on trails and quiet roads. The route is suitable for cyclists and walkers but the latter could take the woodland paths adjacent to the section along the road. The forest also has a bike park with two challenging one-way rides. This is located near the car park. Rendlesham is located just a few miles east of Woodbridge. If you would like to continue your walking in the area then you could pick up the Suffolk Coast Path. It runs along the Butley River through Boyton Marshes to the River Ore and the coast. Also nearby is the wonderful Orford Ness Nature Reserve. The national trust owned reserve is located on a remote shingle spit by the River Ore and can be accessed by catching the National Trust ferry from Orford Quay. Also nearby is Tunstall Forest where you can try the excellent 10 mile red graded single-track mountain bike trail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk we recommend heading west of the forest to the little village of Bromeswell, just outside Woodbridge. Here you will find the splendid Unruly Pig public house. The interesting 16th century Suffolk Inn has cosy log burners, original oak beams and an eclectic mixture of pop and quirky art. There's also a lovely outside decked area and garden to relax in on warmer days. The food is of a high quality with the head chef voted Britain’s “Best Pub Restaurant Chef “ for 2019/20. You can find the pub on Orford Road, Bromeswell, with a postcode of IP12 2PU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As of time of writing there have been incidents of dogs becoming sick after walking in the forest. There are signs to that effect in the woods."
    }
  ],
  "postcode": "IP12 3LE",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Little Scotland, Boyton, East Suffolk, Suffolk, England, IP12 3LE, United Kingdom",
  "district": "East Suffolk",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "road"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "bike park",
    "ferry"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}