{
  "objectID": "f3249f8567e57792017b386bced05a94",
  "created_at": "2024-12-18T06:43:05.242918+00:00",
  "ref": "fingle-woods-walking-route",
  "title": "Fingle Bridge and Woods Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/48/Fingle_Bridge_-_geograph.org.uk_-_1403360.jpg",
  "nearby": [
    {
      "description": "River Teign Walk",
      "objectID": "3e369c17bf5ffe62945735163bfd167f",
      "ref": "river-teign-walk-walking-route"
    },
    {
      "description": "Castle Drogo",
      "objectID": "f6c966e23c25bf8f635b039f2fb63eea",
      "ref": "castle-drogo-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Fingle Bridge to Clifford and Steps Bridge Walk",
      "objectID": "a3a55bc6c2559235738919bd3ec94852",
      "ref": "fingle-bridge-to-clifford-and-steps-bridge-walk-walking-route"
    },
    {
      "description": "Scorhill Stone Circle",
      "objectID": "8fe91fd19baadf3701a0c727c44b575b",
      "ref": "scorhill-stone-circle-walking-route"
    },
    {
      "description": "Dunsford Daffodil Circular Walk",
      "objectID": "4792bf4403f6d505df813f245561af41",
      "ref": "dunsford-daffodil-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f3249f8567e57792017b386bced05a94.gpx",
  "_geoloc": {
    "lat": 50.6950512064,
    "lng": -3.780854007
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Fingle_Bridge_-_geograph.org.uk_-_1403360.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Fingle Bridge is a narrow road bridge over the River Teign. It dates from between the 16th and 17th century. The packhorse bridge is Grade II listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/River_Teign_near_Fingle_Bridge_-_geograph.org.uk_-_438265.jpg",
      "title": "Nigel Cox / River Teign near Fingle Bridge, via Wikimedia Commons",
      "caption": "River Teign near Fingle Bridge Well, about 500 metres upstream of the bridge. Hannicombe Wood can be seen on the right of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/The_Teign_Valley_looking_west_from_Wooston_hillfort._-_geograph.org.uk_-_489413.jpg",
      "title": "Tim Hampson / The Teign Valley looking west from Wooston hillfort.",
      "caption": "The Teign Valley looking west from Wooston hillfort. From the elevated position of the fort there are commanding views to the Teign Gorge and towards Dartmoor. The hill also surrounded by pretty heather in the late summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Track%2C_Hore_Wood_-_geograph.org.uk_-_1478208.jpg",
      "title": "Derek Harper / Track, Hore Wood",
      "caption": "Track, Hore Wood one of several woods surrounding the bridge. A grassy track through woods on the slopes of the Teign gorge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Charles_Wood_-_geograph.org.uk_-_1478247.jpg/256px-Charles_Wood_-_geograph.org.uk_-_1478247.jpg",
      "title": "Derek Harper / Charles Wood",
      "caption": "Charles Wood, located just south of the bridge. Mature trees edge a clearing on the wood's steep slopes on the southern side of the Teign gorge. This is National Trust land. Across the valley in the background rises Prestonbury Common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/The_Teign_gorge_from_Cranbrook_castle_-_Devon_-_geograph.org.uk_-_69827.jpg",
      "title": "Fiona Avis / The Teign gorge from Cranbrook castle - Devon",
      "caption": "The Teign gorge from Cranbrook castle. The bracken covered slopes run steeply down to the river. You can climb to the castle just off the route, to the south of the bridge and Charles Wood.  The castle dates from the Iron Age Hill period and makes a nice extension to the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/River_Teign%2C_Fingle_Bridge_-_geograph.org.uk_-_438994.jpg",
      "title": "Nigel Cox / River Teign: Fingle Bridge",
      "caption": "There has probably been a crossing point over the River Teign here since time immemorial as it is on the route that links Moretonhampstead with Drewsteignton and the north side of the river. The old narrow packhorse bridge with its triangular refuges has certainly been in existence since the 17th century. This is the upstream face viewed looking downstream with the roof of The Fingle Bridge Inn just visible over the top of the bridge parapet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Drewsteignton%2C_The_Fingle_Bridge_Inn_-_geograph.org.uk_-_438916.jpg",
      "title": "Nigel Cox / Drewsteignton: The Fingle Bridge Inn",
      "caption": "Drewsteignton: The Fingle Bridge Inn. In late Victorian times the many visitors to Fingle Bridge over the River Teign were catered for by a tea room in the corn mill. When the corn mill burnt down in 1894, the owner of the cottage nearest the bridge took over the business, and provided a tea shelter. This gradually metamorphosed into a tea room, then a cafe, then The Anglers Rest Public House, and finally today's Fingle Bridge Inn. This view was taken from the bridge on a very wet mid-week afternoon."
    }
  ],
  "distance_km": 6.0,
  "description": "Explore the delightful woods around Fingle Bridge and visit the Iron Age Hill Fort of Wooston Castle on this woodland walk in Dartmoor. The area is actually made up of a series of woods including Charles Wood, Hore Wood, Butterdon Ball Wood and Houndsmoor Wood. It covers over 400 acres with waymarked trails and lots of wildlife to look out for. From the high points there are wonderful views over Dartmoor and the option of continuing your walk through the Teign Gorge towards Castle Drogo. This circular walk starts at the Fingle Bridge car park and takes you along the River Teign which runs through the northern part of the woods. It's a lovely riverside path with the peaceful river surrounded by pretty bluebells and attractive woodland. The path then climbs to Wooston Castle which overlooks the Teign Valley. You then descend the hill fort and return to the car park on other trails in the southern section of the woods. It's easy to extend your walk by heading west along the river and visiting Castle Drogo. You can pick up the fantastic Hunters Path and enjoy fabulous views across Dartmoor before exploring the wider estate of the country house of Castle Drogo. You could also head east along the river on our Fingle Bridge to Clifford and Steps Bridge Walk. This walk visits the nearby Dunsford Nature Reserve where there are daffodils, bluebells, woodland glades and many different types of butterfly to look out for in the summer months. The Dartmoor Way also starts at Fingle Bridge so you can follow this along the Teign towards Chagford to further stretch your legs.",
  "video_url": "https://www.youtube.com/embed/s2SXUTmL6q8",
  "postcode": "EX6 6PW",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}