{
  "created_at": "2025-01-06T00:28:31.194457+00:00",
  "objectID": "f3302cfd2e62f1df5fe4053fa88503fc",
  "ref": "south-dorset-ridgeway-walking-route",
  "title": "South Dorset Ridgeway Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Round_barrows_on_the_Dorset_Ridgeway_-_geograph.org.uk_-_297723.jpg",
  "nearby": [
    {
      "description": "Abbotsbury Castle",
      "objectID": "a69aca7abcb3e7b9a2ca380a0b637de0",
      "ref": "abbotsbury-castle-walking-route"
    },
    {
      "description": "Osmington White Horse",
      "objectID": "68dd451a6005d70868fb6e73ae29e092",
      "ref": "osmington-white-horse-walking-route"
    },
    {
      "description": "Ringstead Bay",
      "objectID": "5f7adee5aa622a01a7e5be1676090941",
      "ref": "ringstead-bay-walking-route"
    },
    {
      "description": "Chesil Beach",
      "objectID": "10ea707afab28ce67f098301c9ba89b9",
      "ref": "chesil-beach-walking-route"
    },
    {
      "description": "Hardy Monument",
      "objectID": "3f577f18db95a76774e71d703caa64fe",
      "ref": "hardy-monument-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f3302cfd2e62f1df5fe4053fa88503fc.gpx",
  "_geoloc": {
    "lat": 50.6758841,
    "lng": -2.6649948
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Round_barrows_on_the_Dorset_Ridgeway_-_geograph.org.uk_-_297723.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Round barrows on the Dorset Ridgeway. A short distance to the east of the Hardy Monument, these two prominent bronze-age round barrows sit on the brow of the chalk ridge. The path on the left of the photo is the \"inland South West coast path\" and also the \"Jubilee Trail\", which coincide for a few hundred metres."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Osmington_White_Horse_%28Weymouth%29.JPG/512px-Osmington_White_Horse_%28Weymouth%29.JPG",
      "title": "By Poliphilo (Own work) [CC0], via Wikimedia Commons",
      "caption": "Osmington White Horse (Weymouth)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/The_Hardy_Monument_-_geograph.org.uk_-_22836.jpg",
      "title": "Bob Tinley [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Hardy Monument. This monument was built to commemorate Vice-Admiral Sir Thomas Masterson Hardy, Flag-Captain of HMS Victory at the Battle of Trafalgar. If you've got a good imagination it looks like an upended telescope."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/The_Smugglers_Inn%2C_Osmington_Mills_-_geograph.org.uk_-_222672.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Smugglers Inn, Osmington Mills. This pub is now the main feature of Osmington Mills and in the summer it is heaving with tourists and holidaymakers from the nearby Osmington Mills Holidays site. The pub was originally called The Crown Inn, later the Picnic Inn. The present name is a reference to the role that the pub's past landlords played in smuggling. The South West coast path runs alongside the stream in front of the pub and up the steps on the right in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/View_along_the_Ridgeway_towards_Bronkham_Hill_-_geograph.org.uk_-_297726.jpg",
      "title": "Jim Champion / View along the Ridgeway towards Bronkham Hill",
      "caption": "View along the Ridgeway towards Bronkham Hill. Looking southeast along the Dorset Ridgeway towards the part known as Bronkham Hill. This part of the Ridgeway is densely populated with bronze-age round barrows, some of which can be seen in the distance. The path on the right (between the fences) is the inland South West coast path which eventually re-joins the coastline at Osmington Mills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Round_barrow_between_Upton_and_South_Down_car_park_-_geograph.org.uk_-_267032.jpg",
      "title": "Jim Champion / Round barrow between Upton and South Down car park",
      "caption": "Round barrow between Upton and South Down car park. This round barrow is in a field alongside the lane from Upton to the National Trust's South Down car park, just east of the junction with the toll road down to Ringstead beach. The hills in the distance are part of the south Dorset ridgeway, and I think the rounded hill left of centre is Chalbury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Track_up_to_Abbotsbury_Castle_and_South_Dorset_Ridgeway_-_geograph.org.uk_-_4013326.jpg",
      "title": "Track up to Abbotsbury Castle and South Dorset Ridgeway by Maurice D Budden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Track up to Abbotsbury Castle and South Dorset Ridgeway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/View_southwest_from_Duddle_Heath_-_geograph.org.uk_-_396422.jpg",
      "title": "Jim Champion / View southwest from Duddle Heath",
      "caption": "View southwest from Duddle Heath near the trail. In the foreground is the edge of the upper terrace of Duddle Heath, which has recently been cleared of scrub and some trees. Across the valley is Pine Lodge Farm and a \"Zorb Riding\" centre. A few moments earlier a large plastic sphere with one or two people inside was pushed down the grassy slope. In the far distance are the hills of the south Dorset ridgeway."
    }
  ],
  "distance_km": 27.0,
  "description": "Enjoy wonderful views of the Jurassic Coast on this walk along the South Dorset Ridgeway. The route runs along the South West Coast Path from West Bexington to Osmington Mills with some beautiful scenery to enjoy. The area is also historically significant with several Bronze Age round barrows and Iron Age hill forts to look out for on the way. The immediate area contains about 500 archaeological monuments, nearly all of them several thousand years old. It's quite a challenging walk with several climbs, reaching a maximum height of nearly 800ft. From the elevated position of the path there are splendid coastal views to enjoy for most of the route. The walk starts in the village of West Bexington on the Dorset coast near Chesil Beach. You then climb away from the coast to the Hardy Monument, passing Abbotsbury Castle Iron Age Hill Fort and the Hell Stone neolithic dolmen on Portesham Hill. The Hardy monument was built in 1844 in memory of Vice-Admiral Sir Thomas Masterman Hardy, Flag Captain of HMS Victory at the Battle of Trafalgar. It sits on Black Down and commands fine views to the coast. The path continues east, descending towards the village of Bincombe across Bincombe Down. Soon after you come to Chalbury Hill Fort and the Osmington White Horse. The distinctive figure is one of the highlights of the walk. It dates from the early 19th century and represents King George III riding his horse. From the white horse you descend to the village of Osmington. It's an interesting place with a church dating from the 12th century and dwellings dating back to the 16th century. The final section of the walk takes you from Osmington to the little hamlet of Osmington Mills on the coast. There's nice views of Osmington Bay as you finish your walk. If you wanted to extend your walk you could continue east along the coast and visit the beautiful Ringstead Bay .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Osmington Mills you'll find the noteworthy Smuggler's Inn. Situated on the cliff tops of the South West Coast Path, just outside the village of Osmington, the Smugglers Inn is a traditional English pub with stunning views overlooking the Isle of Portland. The pub also has an interesting history having been the headquarters of the French smuggler Pierre Latour and one of the main landing places for smuggled goods in the 17th century. Notably the Inn was originally built in the 13th century, with its own brewery at the rear. There's a lovely large garden area which is perfect for relaxing in when the weather is fine. You can fine the pub right on the coast at a postcode of DT3 6HF for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/0YdstajQmyY",
  "district": "West Bexington",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Puncknowle, West Bexington, Dorset, England, DT2 9DG, United Kingdom",
  "postcode": "DT2 9DG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "hill"
  ],
  "points_of_interest": [
    "archaeological sites",
    "historical monuments",
    "monuments"
  ],
  "facilities": [
    "church",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}