{
  "objectID": "f36a1844169e9a06ef3ab11275f00a14",
  "created_at": "2024-12-19T23:28:53.951548+00:00",
  "ref": "iken-walks",
  "title": "Iken Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/11/Cliff_Reach%2C_River_Alde_-_geograph.org.uk_-_666253.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f36a1844169e9a06ef3ab11275f00a14.gpx",
  "_geoloc": {
    "lat": 52.1521032383,
    "lng": 1.5059357717
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Cliff_Reach%2C_River_Alde_-_geograph.org.uk_-_666253.jpg",
      "title": "Bob Jones / Cliff Reach, River Alde",
      "caption": "Cliff Reach, River Alde. Looking across Cliff Reach from Iken Cliff. Iken church can be seen in the distance. Iken Cliff served as a commercial hub for the shipping of coal and wheat in the days before railroads, and there was a bar close to the water. Wheelbarrows were used to transport goods as flat barges used to sit on the mud at low tide. After World War II, the last remaining heathland around Iken Cliff was ploughed under."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Jetty_on_the_Alde_-_geograph.org.uk_-_3684658.jpg/512px-Jetty_on_the_Alde_-_geograph.org.uk_-_3684658.jpg",
      "title": "Jetty on the Alde by Mark Percy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Jetty on the Alde. The church can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Church_Lane_south_of_The_Anchorage_-_geograph.org.uk_-_3559525.jpg/512px-Church_Lane_south_of_The_Anchorage_-_geograph.org.uk_-_3559525.jpg",
      "title": "Church Lane south of The Anchorage by Stuart Logan, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Church Lane south of The Anchorage. The old Sudbourne Hall Estate included Iken. It was mainly made up of tenant farms and worker cottages. The area was valued more by the estate's owners for shooting than for farming, so a decoy pond was constructed at Iken in the eighteenth century. Iken has remained a \"close\" village ever since the Estate was divided up; very few brand-new homes have been constructed, and no council houses have ever been built."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/St_Botolph%27s_Church%2C_Iken_-_geograph.org.uk_-_66703.jpg",
      "title": "Dennis Jackson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Botolph's Church, Iken. The Anglo-Saxon Chronicle records that in AD 654 'Botwulf began to build the minster at Icanho'. Better known now as St Botolph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Decoy_Cottage%2C_Iken_-_geograph.org.uk_-_185024.jpg",
      "title": "Oliver Dixon / Decoy Cottage, Iken",
      "caption": "Decoy Cottage, Iken"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Bull_with_a_view_-_geograph.org.uk_-_3089745.jpg/512px-Bull_with_a_view_-_geograph.org.uk_-_3089745.jpg",
      "title": "Bull with a view by Matthew Hatton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bull with a view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Barge_and_horse%2C_River_Alde_-_geograph.org.uk_-_1994568.jpg/512px-Barge_and_horse%2C_River_Alde_-_geograph.org.uk_-_1994568.jpg",
      "title": "Barge and horse, River Alde by John Goldsmith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barge and horse, River Alde. The population of the village steadily decreased to around 100 from a peak of 380 in 1840. In preparation for the D-Day landings in June 1944, the majority of Iken and the nearby village of Sudbourne were used as battle training grounds during World War II. After the war was over, they relocated and eventually returned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Gate_opposite_Iken_Hall_-_geograph.org.uk_-_3386818.jpg",
      "title": "Gate opposite Iken Hall by DS Pugh, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gate opposite Iken Hall.  Iken Hall, then the residence of Margery Spring Rice, one of the pioneers of the Aldeburgh Festival, served as the setting for Benjamin Britten's opera The Little Sweep. Britten participated in an unsuccessful campaign to maintain a footpath along the Alde to Iken Church when he still resided in Snape."
    }
  ],
  "distance_km": 3.5,
  "description": "This walk explores the area around the Suffolk village of Iken. The village is in a lovely spot for a stroll with nice trails along the beautiful Snape Maltings and into the nearby Tunstall Forest. This walk starts at the Iken Cliff car park just to the south of Snape village. Here you can pick up a footpath heading east along the Maltings on the River Alde. It will take you past Iken Hall to the noteworthy St Botolph’s Church. It's a lovely church to investigate with a part thatched roof and an ancient nave dating back to the 12th century. In February there's also pretty snowdrops in the churchyard with fine views of the river. The estuary is a great place for bird watching so keep your eyes peeled for a variety of waders as you make you way along the path. The Suffolk Coast Path passes through the village so can be used to further explore the area.",
  "video_url": "https://www.youtube.com/embed/X6k0CzbAp_0",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England"
}