{
  "created_at": "2025-01-06T00:21:22.054481+00:00",
  "objectID": "f380a823d1c0c7238f36f8c55eb60af5",
  "ref": "ashbourne-to-dovedale-circular-walk-walking-route",
  "title": "Ashbourne to Dovedale Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Mappleton_village_-_geograph.org.uk_-_947755.jpg",
  "nearby": [
    {
      "description": "Thorpe Cloud",
      "objectID": "844ac9c53b13e8c408f239fc9406dc36",
      "ref": "thorpe-cloud-walking-route"
    },
    {
      "description": "Dovedale",
      "objectID": "50e38112ac3721d9d1fe24f250d83231",
      "ref": "dovedale-walking-route"
    },
    {
      "description": "Dovedale Circular Walk",
      "objectID": "25f7d47f743822ba575c7d402a7b9d0b",
      "ref": "dovedale-circular-walk-walking-route"
    },
    {
      "description": "Tissington Trail",
      "objectID": "b6e428f335e074a550ea488db65c3cd6",
      "ref": "tissington-trail-walking-and-cycle-route"
    },
    {
      "description": "Fenny Bentley",
      "objectID": "773d30aca25a61c0c899f9ab87d36b70",
      "ref": "fenny-bentley-walking-route"
    },
    {
      "description": "Parwich",
      "objectID": "46119e1f2e44181301b63d04f17a3c50",
      "ref": "parwich-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f380a823d1c0c7238f36f8c55eb60af5.gpx",
  "_geoloc": {
    "lat": 53.0182614581,
    "lng": -1.7369631942
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Mappleton_village_-_geograph.org.uk_-_947755.jpg",
      "title": "James Allan / Mappleton village",
      "caption": "Mappleton village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/View_east_from_Tissington_Trail_-_geograph.org.uk_-_944083.jpg",
      "title": "James Allan / View east from Tissington Trail",
      "caption": "View east from Tissington Trail. Looking across towards the A515 north of Ashbourne."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Stepping_stones_on_the_Dove_150205_0443d44b.jpg",
      "title": "John Darch / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Stepping stones on the Dove in Dovedale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Below_Thorpe_Cloud_-_geograph.org.uk_-_1339836.jpg",
      "title": "Colin Smith / Below Thorpe Cloud",
      "caption": "Below Thorpe Cloud. Busy footpath alongside the River Dove. To the left of the hill is Lin Dale."
    }
  ],
  "distance_km": 13.0,
  "description": "This circular walk takes you from the popular town of Ashbourne to the beautiful Dovedale in the Peak District. You'll also visit the wonderful viewpoint at Thorpe Cloud. The route runs for just over 8 miles with a moderate climb on the way. The walk starts just to the north of the town where you can pick up the Tissington Trail. Follow the waymarked path north before branching off to the north west towards Mapleton. Here you can follow another footpath heading north along the River Dove towards Thorpe and then on into Dovedale. The route takes you up to the iconic stepping stones where you'll likely see plenty of other walkers on a fine day. The stones were first set down in the 19th century for Victorian tourists to cross the river. The route then turns around to climb Thorpe Cloud, the small hill which overlooks the river here. After taking in the views from the hill summit you then descend to Lin Dale, picking up a path to take you back into Thorpe village. Here you can pick up the Tissington Trail again and follow the waymarked path back to Ashbourne.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off at The Old Dog in Thorpe village. The charming old pub does good food and has a nice courtyard to sit out on warmer days. You can find the pub on Spend Lane with a postcode of DE6 2AT for your sat navs. Back in Ashbourne The George and Dragon is a good choice for some post walk refreshments. They do great food and also have a lovely beer garden to relax in on warmer days. It's situated on the market place in the town at a postcode of DE6 1EU for your sat navs. The pub is also dog friendly if you have your pet with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative route around the area try the Dovedale Circular Walk which starts from the village of Tissington and also visits Milldale. You could also try the you along the Ashbourne Walk which follows the Bonnie Prince Charlie Walk to the delightful village of Osmaston and the adjacent Osmaston Park. The circular Fenny Bentley Walk also visits Thorpe Cloud from the pretty village to the east. The village is worthy of exploration with the pretty Bentley Brook, a 14th century church and a fine inn with particularly lovely gardens to see. The route also visits the 17th-century Jacobean mansion house at Tissington Hall. The delightful village of Parwich lies just a few miles to the east of Dovedale. There's a pretty village green, old limestone cottages and a pub dating back to the 1600s. You can reach the village on the Limestone Way from Thorpe."
    }
  ],
  "postcode": "DE6 1FD",
  "district": "Ashbourne",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}