{
  "created_at": "2025-01-06T03:09:10.320323+00:00",
  "objectID": "f4711aec0d4a10d375eef5cf9110cdd5",
  "ref": "hound-tor-walking-route",
  "title": "Hound Tor Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Hound_Tor_-_geograph.org.uk_-_860825.jpg",
  "nearby": [
    {
      "description": "Haytor",
      "objectID": "b7aa28f3e2f1d56eebca9739303d8919",
      "ref": "haytor-walking-route"
    },
    {
      "description": "Templer Way",
      "objectID": "640b68dab463d39f883605971fdb2ede",
      "ref": "templer-way-walking-route"
    },
    {
      "description": "Bovey Tracey",
      "objectID": "d1a3ed5d0220e272b738d2620ec87c5c",
      "ref": "bovey-tracey-walking-route"
    },
    {
      "description": "Bovey Castle",
      "objectID": "24eb1b030ca1c2cc5a042250f71d422b",
      "ref": "bovey-castle-walking-route"
    },
    {
      "description": "Manaton",
      "objectID": "8d095eb189a9262697f042284bf9a193",
      "ref": "manaton-walking-route"
    },
    {
      "description": "Buckland Beacon",
      "objectID": "9fccf7b06873c2662891c9d23a085cc9",
      "ref": "buckland-beacon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f4711aec0d4a10d375eef5cf9110cdd5.gpx",
  "_geoloc": {
    "lat": 50.5815424174,
    "lng": -3.7444705913
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Hound_Tor_-_geograph.org.uk_-_860825.jpg",
      "title": "Derek Harper / Hound Tor",
      "caption": "This set of rock piles is at the southwest corner of the tor. The distant ridge is Hamel Down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Hound_Tor_-_geograph.org.uk_-_943425.jpg",
      "title": "Mike White / Hound Tor",
      "caption": "Some tors are avenue tors, being divided into two distinct parts (Hay Tor and Honeybag Tor are examples) but Hound Tor is divided into three, the stepped gray superstructure making it look like a warship."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Hound_Tor_-_geograph.org.uk_-_1232810.jpg",
      "title": "Derek Harper / Hound Tor",
      "caption": "From this angle, taken a little way into the moorland from Swallerton Gate, the tor falls into three main stacks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Hound_Tor_-_geograph.org.uk_-_860815.jpg/256px-Hound_Tor_-_geograph.org.uk_-_860815.jpg",
      "title": "Derek Harper / Hound Tor",
      "caption": "The tor has plenty of attractive rock piles to explore. Even though the alignment of many of them trends NNW-SSE, as here, there is a clear avenue (a frequent feature of tors) between the two main parts of the tor which is aligned east-west. These dramatic rocks are on the southern side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Abandoned_medieval_village_below_Hound_Tor_-_geograph.org.uk_-_21906.jpg",
      "title": "Tom Pullman / Abandoned medieval village below Hound Tor",
      "caption": "Abandoned medieval village below Hound Tor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Towards_Little_Hound_Tor_-_geograph.org.uk_-_1499113.jpg",
      "title": "Guy Wareham / Towards Little Hound Tor",
      "caption": "The path from Cosdon Hill to the Hound Tors, on a misty day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Dartmoor%2C_Hound_Tor_deserted_medieval_village_-_geograph.org.uk_-_435564.jpg",
      "title": "Nigel Cox / Dartmoor: Hound Tor deserted medieval village",
      "caption": "Another view of the deserted medieval village. With Hound Tor in the background, this is a grouping of some three or four 13th century farmsteads on land originally farmed in the Bronze Age. The farmsteads were probably abandoned around the 14th or 15th centuries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Manaton%2C_Hound_Tor_-_close_up_-_geograph.org.uk_-_861422.jpg",
      "title": "Martin Bodman / Manaton: Hound Tor - close up",
      "caption": "Manaton: Hound Tor - close up Seen from the path leading to the deserted Houndtor medieval settlement"
    }
  ],
  "distance_km": 8.5,
  "description": "Hound Tor is considered one of the best view points in the Dartmoor National Park. It's a lovely walk to the 414 m (1,358 ft) summit with the landscape thought to have inspired 'The Hound of the Baskervilles'. The walk starts from the Haytor Vale visitor centre where parking is available. You then head to Haytor Rocks which is one of the most popular natural beauty spots in Dartmoor National Park. From here there are excellent views of the coastline, the Teign Estuary and across Dartmoor. The route then picks up the Haytor Granite Tramway to take you to Holwell Tor and then onto Hound Tor, crossing the pretty Beck Brook on the way. Near the summit you will pass the fascinating remains of a deserted medieval village. It includes several buildings dating from the 13th century including longhouses, smaller houses and barns. From the summit of Hound Tor you descend to Smallacombe Rocks and cross Haytor Down before returning to Haytor Vale. To continue your walking in the area try our Haytor Circular Walk which starts from the same car park. The loop climbs to Black Hill before exploring the lovely woodland trails in Yarner Woods just to the east of Hound Tor.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Haytor Vale and there's some nice options for post walk refreshments. For example you can visit the Rock Inn, an impressive 18th century former coaching inn. The inn has a lot of character with a cosy interior and a nice sunny beer garden to relax in on warmer days. There's a very good menu and an on-site restaurant featuring local meat, game and fish. The Rock also has a free car park and is dog friendly with a separate dining area where you can eat with your dog. They provide good quality accommodation too, if you need to stay over. It's a popular place for walkers to go after climbing Hound Tor and Haytor being located just a short distance from both. Postcode for your sat navs is TQ13 9XP. Just to the north there's the worthy village of North Bovey where you'll find a 14th century church, the fine Bovey Castle Hotel and some pleasant views of the River Bovey. There's also The Ring of Bells, an historic thatched pub dating back to the 13th century. They have a lovely large garden area with views of the surrounding moorland. There's also a charming old interior with a 15th-century arched door frame, oak doors, low ceilings with beams, open fireplaces and a grandfather clock built into a wall. They serve good food and a fine selection of ales. You can find them at postcode TQ13 8RB for your sat navs. The inn is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Templer Way long distance footpath starts near the tor. The waymarked trail is a great way to further explore the area on foot. Follow it east and it will take you past Yarner Woods into Bovey Tracey. To the south west there's the worthy climb to Buckland Beacon. The beacon is well known for its Ten Commandments Stones and its excellent views over the Dart Valley."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BBUhROg4MDo",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}