{
  "created_at": "2025-01-06T08:28:49.430708+00:00",
  "objectID": "f50688cd3eeb5ea1ca8f2573f3ec3d51",
  "ref": "barton-on-sea-walking-route",
  "title": "Barton on Sea Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Barton_on_Sea_golf_course_-_geograph.org.uk_-_1427053.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f50688cd3eeb5ea1ca8f2573f3ec3d51.gpx",
  "_geoloc": {
    "lat": 50.7374648035,
    "lng": -1.6544200957
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Barton_on_Sea_golf_course_-_geograph.org.uk_-_1427053.jpg",
      "title": "Jim Champion / Barton on Sea golf course",
      "caption": "Barton on Sea golf course. Looking down on a small part of Barton on Sea golf course from a public footpath to Beacon Cliff from Barton Common. The trench in the valley (marked by pairs of red posts) is Beckton Bunny, which reaches the beach via a small chine to the south-east of here. The bungalows with hipped roofs are on Willow Walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Cliff-top_path%2C_Hordle_Cliff_-_geograph.org.uk_-_1430889.jpg",
      "title": "Jim Champion / Cliff-top path, Hordle Cliff",
      "caption": "Cliff-top path, Hordle Cliff. The path along the cliff-top leads to Milford on Sea, seen here in the distance. The chap with the helmet and large backpack is a paraglider, headed in the direction of Barton on Sea (presumably with the intent of paragliding with the many others there). In the far distance are the hills of the Isle of Wight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Concrete_pillar_in_the_cliffs_-_geograph.org.uk_-_1427070.jpg",
      "title": "Jim Champion / Concrete pillar in the cliffs",
      "caption": "Concrete pillar in the cliffs. This feature is in the cliff to the east of Becton Bunny Chine, in the western side of the promontory where the Barton sewage outfall once fell. Water is pouring from a small pipe on the left, presumably this is what has created a large 'bite' out of the cliffs at this spot. I have no idea about the origin of the concrete pillar on the right - at a guess it could be something to with checking the erosion of this part of the cliff?"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Promontory_at_the_west_end_of_Beacon_Cliff_-_geograph.org.uk_-_1430921.jpg",
      "title": "Jim Champion / Promontory at the west end of Beacon Cliff",
      "caption": "Promontory at the west end of Beacon Cliff. This small promotory to the west of Becton Bunny was formerly the site of a sewage outfall from Barton on Sea. As such it has rock armour at its base to slow the rate of erosion. Part of a shipping container is on the beach, presumably one from the wreck of the Napoli in Branscombe Bay, Devon. The cliff in the foreground (western end of Beacon Cliff) is being actively eroded - it lacks rock armour at its foot and the beach is starved of shingle by the breakwaters further round Christchurch Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Coastline_east_of_Barton_on_Sea_-_geograph.org.uk_-_1427079.jpg",
      "title": "Jim Champion / Coastline east of Barton on Sea",
      "caption": "Coastline east of Barton on Sea. In the foreground the cliff is broken by the lower end of Becton Bunny chine, coming in obliquely from the right. Beyond that are the taller cliffs at the east end of Barton-on-Sea, with rock armour at their base and the start of the groynes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Becton_Bunny_chine_-_geograph.org.uk_-_1427061.jpg",
      "title": "Jim Champion / Becton Bunny chine",
      "caption": "Becton Bunny chine. The stream called Becton Bunny (to the right) reaches the beach obliquely via this chine. The footpath from Barton Common to the clifftop continues on to the left, and it is possible on foot to get down to the beach through the chine. The rock groyne on the beach protected the promontory where Barton's sewage outfall used to be. On the far side of the Solent is the Isle of Wight, the coloured sand cliffs at Alum Bay can just be made out through the haze on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/New_cliff-top_path_at_Milford_on_Sea%2C_no_cycling_please_-_geograph.org.uk_-_1430870.jpg/256px-New_cliff-top_path_at_Milford_on_Sea%2C_no_cycling_please_-_geograph.org.uk_-_1430870.jpg",
      "title": "Jim Champion / New cliff-top path at Milford on Sea: no cycling please",
      "caption": "New cliff-top path at Milford on Sea: no cycling please. This fairly new path leads along the cliff-top towards the western car park and facilities at Milford on Sea. The hand-rail at the top of steps down to the beach can be seen on the right, along from the green bin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Remains_of_anti-tank_defences%2C_Taddiford_Gap_-_geograph.org.uk_-_1430904.jpg",
      "title": "Jim Champion / Remains of anti-tank defences, Taddiford Gap",
      "caption": "Remains of anti-tank defences, Taddiford Gap. Taddiford Gap is the only point between Milford on Sea and Becton Bunny (at Barton on Sea) where the beach can be reached on foot. During the Second World War the gap was 'plugged' with the concrete obstacles commonly known as 'dragons teeth'. This stretch of coastline is actively eroding and about ten years ago the last remaining concrete obstacles started to succumb to the slumping cliff. In the distance is the western end of the Isle of Wight and the chalk stacks of the Needles."
    }
  ],
  "distance_km": 5.0,
  "description": "This Hampshire based coastal village has some lovely trails along a cliff top path and a geologically significant beach to visit. It's also part of the wider New Forest where there are numerous walking options. This walk takes you along the coast path to neighbouring Milford Haven, just to the east. Along the way there's lovely views over Christchurch Bay to the Isle of Wight. The walk starts on the eastern side of the village where you can pick up a coast footpath heading through the golf course. It's a nice cliff top trail taking you through Beckton Bunny to Hordle Cliff. A good surfaced path will then take you into Milford on Sea where there are good cafes and pubs for refreshment. The walk can be extended by picking up the Solent Way here and following it to Keyhaven Marshes and Hurst Castle Spit .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east along the coast path and you could visit Highcliffe Castle, the Steamer Point Nature Reserve and Christchurch Harbour. Just to the north is neighbouring New Milton where there's a train station and some pleasant waterside trails around the Ballard Water Meadows. You're also very close to the Wilverley Plain area of the New Forest here. For more walking ideas in the area see the Hampshire Walks and the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/pqA0NFzRNLk",
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Becton Lane, Old Milton, New Milton, Barton on Sea, New Forest, Hampshire, England, BH25 7TL, United Kingdom",
  "postcode": "BH25 7TL",
  "state": "England"
}