{
  "created_at": "2025-01-06T07:57:10.815160+00:00",
  "objectID": "f519f7bf6a48449a4a10db358dce5833",
  "ref": "blorenge-walking-route",
  "title": "Blorenge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/34/Path_to_Blorenge_-_geograph.org.uk_-_492266.jpg",
  "nearby": [
    {
      "description": "Usk Valley Walk",
      "objectID": "516639029b8c898abe47b5c9acc02634",
      "ref": "usk-valley-walk-walking-route"
    },
    {
      "description": "Sugarloaf Mountain",
      "objectID": "8c84a2c5b79e42a171d638e2fa88ab46",
      "ref": "sugarloaf-mountain-walking-route"
    },
    {
      "description": "Skirrid Fawr",
      "objectID": "be77af88189b430cb27d68aa41deed7b",
      "ref": "skirrid-fawr-walking-route"
    },
    {
      "description": "Pontypool",
      "objectID": "68c1df86926be190277ab87a25a73a93",
      "ref": "pontypool-walking-route"
    },
    {
      "description": "Clydach Gorge",
      "objectID": "a941745636af68aa2a57382f5d1e8a0b",
      "ref": "clydach-gorge-walking-route"
    },
    {
      "description": "Goytre Wharf",
      "objectID": "a3ca2d49b4d68dc3a957c610ebdad343",
      "ref": "goytre-wharf-walking-route"
    },
    {
      "description": "Gilwern",
      "objectID": "7b00d52f1b2a6ddf63cddedd422c2c9a",
      "ref": "gilwern-walking-route"
    },
    {
      "description": "Llanfoist Canal Walk",
      "objectID": "308f970855a9b8d1765bf97edd14f31e",
      "ref": "llanfoist-canal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f519f7bf6a48449a4a10db358dce5833.gpx",
  "_geoloc": {
    "lat": 51.7907396286,
    "lng": -3.0826136322
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Path_to_Blorenge_-_geograph.org.uk_-_492266.jpg",
      "title": "David Luther Thomas / Path to Blorenge",
      "caption": "Path to Blorenge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Blorenge_-_geograph.org.uk_-_43232.jpg",
      "title": "Philip Halling / Blorenge",
      "caption": "Blorenge and the Usk valley near Abergavenny, viewed from where the footpath enters Caer Wood on the southern slopes of Ysgyryd (Skirrid) Fawr"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Lawns_and_the_Blorenge_-_geograph.org.uk_-_1773939.jpg/512px-Lawns_and_the_Blorenge_-_geograph.org.uk_-_1773939.jpg",
      "title": "David Roberts / Lawns and the Blorenge",
      "caption": "Lawns and the Blorenge. Trees frame lawns dotted with daisies in Linda Vista Gardens. The Blorenge mountain makes a scenic background. Keywords: grass, clouds, landscape, scenery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Footpath_leading_to_the_Punchbowl%2C_Blorenge_-_geograph.org.uk_-_1086521.jpg",
      "title": "Claire Seyler / Footpath leading to the Punchbowl, Blorenge",
      "caption": "Footpath leading to the Punchbowl, on Blorenge. The path bends to the left and descends steeply down to the Punchbowl"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/The_very_edge_of_the_Blorenge_-_geograph.org.uk_-_158132.jpg",
      "title": "Ros Hallett / The very edge of the Blorenge",
      "caption": "The very edge of the Blorenge. The humps and bumps at the edge of the Blorenge are the remains of intense industrial activity from 100 years ago. The view can be spectacular, Skirrid visible middle distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Summit_cairn_on_Blorenge_-_geograph.org.uk_-_284902.jpg",
      "title": "Jonathan Billinger / Summit cairn on Blorenge",
      "caption": "Summit cairn on Blorenge. The distinctive top of the Sugar Loaf is in the middle distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Keeper%27s_Pond_-_geograph.org.uk_-_1369687.jpg",
      "title": "Trevor Rickard / Keeper's Pond",
      "caption": "View north-east across the Keeper's Pond to the west of the mountain. It appears suspended in mid-air but drains steeply down the valley from the far end. At 475m above sea level, it provides great views across the Usk Valley towards the cone of the Sugarloaf Mountain on the other side. The pond was built around 1824 to provide water for the Garn Ddyrys Forge near Govilon in the valley below. It is probably known by this name as it was near the house of the Earl of Abergavenny's gamekeeper. Its Welsh name of Pen-ffordd-goch, translates as 'head of the red road', probably a reference to the red sandstone which was used in the construction of the mountain road to Govilon."
    }
  ],
  "distance_km": 12.0,
  "description": "This challenging walk takes you around this prominent hill in the southeastern corner of the Brecon Beacons National Park. The hill is located near Abergavenny and rises to a height of 561 m (1,841 ft). This popular walk starts at the car park next to Keeper's pond and follows footpaths across the hill before climbing to the summit. There are fabulous views of the Usk Valley, Sugarloaf Mountain and Skirrid Fawr. You'll also pass through the Punchbowl on the eastern side of the hill. This delightful area has a large pond and woodland which attracts a wide variety wildlife. If you're interested in more hill climbing in the area then Sugarloaf Mountain and Skirrid Fawr are also easily reachable from Abergavenny.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Blaenavon and you could reward yourself with post walk refreshments at the splendid The Butterflies Bar and Kitchen. The historic gastropub dates all the way back to 1832 and has a delightful interior. The food is of a high quality with steaks that are renowned in the area. They have even won an award for “best steaks and grills” in South East Wales. There are two restaurant areas including a lovely Garden Room with views onto the courtyard and the large walled garden. The Cwtch room is part of the original 19th century pub and includes a cosy fire and log burner. You can find them in the town centre at 31 Old Queen Street with a postcode of NP4 9PN."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the western slopes of the mountain you'll find the delightful Keepers Pond. The small lake is a popular place for easy walks, wild swimming and picnics. It's a nice place to rest and relax after your climb. The hill can also be climbed from nearby Blaenavon by following footpaths north from the town. You can explore the town on the circular Blaenavon Walk. The area is a UNESCO World Heritage Site which includes a fascinating industrial museum and a wonderful heritage steam railway. You could catch the railway south and visit Pontypool where there's the extensive Pontypool Park to visit. You can also pick up the Monmouthshire and Brecon Canal here and follow it to the popular Goytre Wharf. Just to the west you'll find the splendid Clydach Gorge. The scenic steep-sided valley is where the River Clydach flows to the River Usk. Near here there's also the pretty Gilwern Wharf where there's some lovely scenery and a fine canalside pub. The epic Cambrian Way passes over the mountain. The long distance waymarked route starts from the city of Cardiff and runs for nearly 300 miles through the Brecon Beacons, the Cambrian Mountains and Snowdonia before finishing on the North Wales coast at Conwy. For more walking ideas in the area see the Brecon Beacons Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/thSCEtkypZI",
  "county": "Monmouthshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Blaenavon Road, Llanfoist Fawr, Govilon, Monmouthshire, Cymru / Wales, NP7 9RY, United Kingdom",
  "postcode": "NP7 9RY",
  "district": "Govilon",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}