{
  "created_at": "2025-01-06T04:56:12.238587+00:00",
  "objectID": "f5f02b4b8e24938b1c37c524f487d0d0",
  "ref": "lyme-park-walking-route",
  "title": "Lyme Park Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/67/Lyme_Park_-_geograph.org.uk_-_809322.jpg",
  "nearby": [
    {
      "description": "Gritstone Trail",
      "objectID": "928e56c6a6c868355ef1a26f5e709aad",
      "ref": "gritstone-trail-walking-route"
    },
    {
      "description": "North Cheshire Way",
      "objectID": "3e817a2dbeb8d7781d65f9026f076590",
      "ref": "north-cheshire-way-walking-route"
    },
    {
      "description": "Bollington",
      "objectID": "743acbe36fa62495be1e0df211682952",
      "ref": "bollington-walking-route"
    },
    {
      "description": "Disley",
      "objectID": "dd3dda60ee5bb53be795299fe3d2ac87",
      "ref": "disley-walking-route"
    },
    {
      "description": "Macclesfield Canal",
      "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
      "ref": "macclesfield-canal-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f5f02b4b8e24938b1c37c524f487d0d0.gpx",
  "_geoloc": {
    "lat": 53.3540688184,
    "lng": -2.0522797267
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Lyme_Park_-_geograph.org.uk_-_809322.jpg",
      "title": "Gerald England / Lyme Park, via Wikimedia Commons",
      "caption": "Lyme Park gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Hase_Bank_Wood%2C_Lyme_Park_-_geograph.org.uk_-_52380.jpg",
      "title": "Alan Fleming / Hase Bank Wood, Lyme Park, via Wikimedia Commons",
      "caption": "Path through the valley at Hase Bank Wood in Lyme Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Lakeside_in_spring_at_Lyme_Park_-_geograph.org.uk_-_1248934.jpg",
      "title": "Raymond Knapman / Lakeside in spring at Lyme Park, via Wikimedia Commons",
      "caption": "Lakeside in spring at Lyme Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/The_Lantern%2C_Lyme_Park_-_geograph.org.uk_-_1082383.jpg",
      "title": "John Darch / The Lantern, Lyme Park, via Wikimedia Commons",
      "caption": "Fine view from The Lantern folly"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Pool_and_overhanging_tree_in_Lyme_Park_-_geograph.org.uk_-_1742734.jpg",
      "title": "Peter Barr / Pool and overhanging tree in Lyme Park, via Wikimedia Commons",
      "caption": "Pool and overhanging tree in the park. On the centre horizon can just be seen The Cage, which has been a hunting lodge, park-keeper's house, and a lock-up for prisoners.It is a Grade 2* Listed building, constructed in sandstone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Lyme_Park_old_mill_-_geograph.org.uk_-_536398.jpg",
      "title": "Gethin Evans / Lyme Park old mill, via Wikimedia Commons",
      "caption": "The old mill on the Lyme Park estate with the northern edge of the mill pond in the foreground. Part of the building now houses a coffee shop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Orangery%2C_Lyme_Park.jpg/512px-Orangery%2C_Lyme_Park.jpg",
      "title": "Graham Hogg / Orangery, Lyme Hall, Cheshire, via Wikimedia Commons",
      "caption": "Orangery, Lyme Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/The_Cage_Lyme_park.jpg",
      "title": "Stephen G Taylor [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Cage. This building is perched on a hill in the park. It was originally built around 1580 as a hunting lodge where the ladies of the estate could watch the hunt. At night it was used as a banqueting hall. It overlooks the nearby moors and 1,300 acres of park land. In later years it was used as a game keeper's residence and as a jail for poachers."
    }
  ],
  "distance_km": 8.5,
  "description": "This is a circular walk through the splendid Lyme Park in Disley, Cheshire. Here you can explore the 1,300 acre estate with its resident deer and enjoy fabulous views of the Peak District. There are also tranquil lakes, peaceful woodland walks and an Edwardian rose garden to enjoy. The park may look familiar as it was used for the BBC production of 'Pride and Prejudice'. The walk begins at the park gate near Disley train station, before exploring the most attractive areas of the park and returning to the start point. The Gritstone Trail long distance path passes through the park so you could pick this up to extend your walk. Heading south will take you towards Bollington via Sponds Hill. Additionally the North Cheshire Way passes through Lyme Park, so you could pick this up and head west towards the village of Adlington, passing the Macclesfield Canal on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Mill houses a fine cafe run by the National Trust. There's lots of tables next to the lake to sit outside on a sunny day. If you fancy a pub lunch then you could head into Disley where there's a few decent pubs. The White Lion has an excellent selection of real ales and some delicious home made pies to try. You can find them at postcode SK12 2HA for your sat navs. There's also the noteworthy Rams Head Inn. This historic building was built by the Legh family in c.1640, though the current exterior was built around 1840. It was formerly a lodge belonging to the Lyme Park estate. They have a lovely garden area where you can sit outside on warmer days. The pub can be found at postcode SK12 2AE."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great place for a dog walk and you will probably see plenty of other owners on your outing. Please keep them on a close lead in busy areas and near livestock."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Disley train station is located on the northern fringes of the park so you can easily visit by public transport. You can catch trains to Disley from Manchester, Stockport and Buxton. From the station follow the waymarked Gritstone Trail from the station to the park. The circular Disley Walk starts from there and additionally visits the Macclesfield Canal. Just to the west of the park you will find the Adlington Basin and adjacent Lyme House Marina on the Macclesfield Canal. There's benches here where you can sit and watch the boats cruise down the canal.  Pictured above, the Adlinton Basin on the Macclesfield Canal which runs just to the west of the park. The former Adlington Colliery Basin on the canal is now a thriving marina with nearby cafe and restaurant. It's a nice place to visit after exploring the park if you have time. Just south of the park is the town of Bollington where you could enjoy a climb to White Nancy. Here you will find an unusual folly in the shape of a small domed sugar loaf and thought to have been built in 1817 by Colonel Gaskell as a monument to the Battle of Waterloo. It's located about 3 miles south of the park and a worthy extension to your outing. Also to the south is the circular Pott Shrigley Walk which will take you around the old Shrigley Hall to the surrounding moors."
    }
  ],
  "video_url": "https://www.youtube.com/embed/MZrWJ1eI9a4",
  "postcode": "SK12 2LY",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Red Lane, Disley, Cheshire East, England, SK12 2LY, United Kingdom",
  "district": "Disley",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}