{
  "created_at": "2025-01-06T01:32:08.127048+00:00",
  "objectID": "f647803338e90f9db0b8bd3d55fd4abc",
  "ref": "broadwater-warren-walking-route",
  "title": "Broadwater Warren Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Broadwater_Warren_-_geograph.org.uk_-_267764.jpg",
  "nearby": [
    {
      "description": "Tunbridge Wells Common",
      "objectID": "823a886e99654ca79c4a994372f0d962",
      "ref": "tunbridge-wells-common-walking-route"
    },
    {
      "description": "Tunbridge Wells Circular Walk",
      "objectID": "1db0e33a856754a8ca407d4a44a2efd7",
      "ref": "tunbridge-wells-circular-walk-walking-route"
    },
    {
      "description": "Eridge Rocks",
      "objectID": "9a9d78e215495b534cc00f0c9b0add7a",
      "ref": "eridge-rocks-walking-route"
    },
    {
      "description": "High Rocks",
      "objectID": "e266cb9d34b62fafa8a61f95e9dc2906",
      "ref": "high-rocks-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f647803338e90f9db0b8bd3d55fd4abc.gpx",
  "_geoloc": {
    "lat": 51.1133583145,
    "lng": 0.2188978942
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Broadwater_Warren_-_geograph.org.uk_-_267764.jpg",
      "title": "Andrew Howey / Broadwater Warren, via Wikimedia Commons",
      "caption": "A path through Broadwater Warren, near Tunbridge Wells, with the sandstone ridge at Langton Green in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Broadwater_Warren_-_geograph.org.uk_-_267767.jpg",
      "title": "Andrew Howey / Broadwater Warren, via Wikimedia Commons",
      "caption": "Broadwater Warren Path junction"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Car_park%2C_Broadwater_Warren_-_geograph.org.uk_-_2268960.jpg",
      "title": "Car park, Broadwater Warren by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A view of the good sized car park at the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Boardwalk%2C_Broadwater_Warren_Nature_Reserve_-_geograph.org.uk_-_2265972.jpg",
      "title": "Boardwalk, Broadwater Warren Nature Reserve by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Boardwalk, Broadwater Warren Nature Reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Broadwater_Warren_Nature_Reserve%2C_cleared_area_-_geograph.org.uk_-_2265039.jpg",
      "title": "Broadwater Warren Nature Reserve: cleared area by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cleared area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Between_the_conifers_and_deciduous_trees%2C_Broadwater_Warren_-_geograph.org.uk_-_2270517.jpg",
      "title": "Between the conifers and deciduous trees, Broadwater Warren by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Between the conifers and deciduous trees, Broadwater Warren"
    }
  ],
  "distance_km": 3.0,
  "description": "This delightful RSPB nature reserve in Tunbridge Wells has a nice nature trail and an all ability path to try. You can pick up the walking trails at the car park at Broadwater Forest Lane. The waymarked trail guides you through the reserve's woodland, wetland and open heath with lots of wildlife to look out for on the way. This includes nightjars, dormice and dragonflies around the pond. There's also a section along a boardwalk which takes you through an area of wet woodland. Just to the south of the reserve you will find Eridge Rocks Nature Reserve. It's well worth extending your walk here. You'll find a series of large boulders, woodland trails and a wide variety of interesting plant species. The Tunbridge Wells Circular Walk also passes the southern edge of the site. You can pick this up to explore the countryside surrounding the town. Tunbridge Wells Common is also nearby with its sandstone outcrops, heathland and nice woodland trails. The reserve is located just to the south west of Tunbridge Wells. You can reach it by bike by following National Cycle Route 18 from the town centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Barn pub in Tunbridge Wells is an establishment of some note. It has an interesting history having been reconstructed from a centuries old Elizabethan Barn which was originally built in a nearby Kent village and re-erected on its present site. Recreated in the original Kentish style with oak beams and columns throughout it has an interior full of character. Outside there is a delightful award winning courtyard garden. Heated for cooler days and beautifully illuminated at night, it's really very pretty and a lovely place to relax with refreshments after your exercise. You can find the pub in the town centre at 1 Lonsdale Gardens, Mount Pleasant Road with a postcode of TN1 1NU for your sat navs. Head south from the reserve and you can visit the Nevill Crest and Gun at Eridge Green. It's a pub of some note being housed in a building with over 500 years of history. The unusually named inn is named after the crest of the Nevill family, the Earls of Abergavenny, on whose estate the pub was built: it is their monogram that adorns the building and many others in the surrounding area. The 'Gun' part of the name arose from a forge on the estate which produced cannons and cannon balls for the Nevilles: at one time an ancient cannon, made of strips of metal held together with hoops, was fired on fair days or days of celebration, and it is this that is referred to in the name. Many of the local villagers would have been employed in the forge. The pub has a splendid interior with atmospheric, beamed rooms and roaring fires along with a lighter garden room. Outside there's a large garden area where you can relax on finer days.   Pictured above: The Nevill Crest and Gun pub. An ideal pit stop on the walk. It's also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just west of Tunbridge Wells there's the High Rocks National Monument. It's a fantastic spot with a series of huge sandstone rocks and some lovely wooded areas to explore. There's also a picnic area and a great pub to visit here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_aNe1xoYBx8",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Broadwater Forest Lane, South Farm, Frant, Wealden, East Sussex, England, TN3 9LU, United Kingdom",
  "postcode": "TN3 9LU",
  "district": "Wealden",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "wetland"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "nature trails"
  ],
  "facilities": [
    "car park",
    "boardwalk",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}