{
  "created_at": "2025-01-06T04:18:40.370937+00:00",
  "objectID": "f69ffccaf926b2bbfa4b17aed1fcadc5",
  "ref": "malham-cove-walking-route",
  "title": "Malham Cove Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Malham_Cove_-_geograph.org.uk_-_872163.jpg",
  "nearby": [
    {
      "description": "Malham Tarn Estate",
      "objectID": "0e1b77883047f9f0f66863ff12a65c1c",
      "ref": "malham-tarn-estate-walking-and-cycle-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Gordale Scar",
      "objectID": "0407e97afd5906284ebb2f41c2627d75",
      "ref": "gordale-scar-walking-route"
    },
    {
      "description": "Janet's Foss",
      "objectID": "cfe2a1b11e3b61c7a09473e22818dbfa",
      "ref": "janets-foss-walking-route"
    },
    {
      "description": "Fountains Fell",
      "objectID": "39ac625fcf4a40d377d9910345cf2da2",
      "ref": "fountains-fell-walking-route"
    },
    {
      "description": "Settle to Malham Cove",
      "objectID": "58a2751ae552fbe1da737dd5dd581b00",
      "ref": "settle-to-malham-cove-walking-route"
    },
    {
      "description": "Giggleswick",
      "objectID": "966e1991f6aaa7e4aa3c66074c4d192c",
      "ref": "giggleswick-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f69ffccaf926b2bbfa4b17aed1fcadc5.gpx",
  "_geoloc": {
    "lat": 54.0603127794,
    "lng": -2.1528861936
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Malham_Cove_-_geograph.org.uk_-_872163.jpg",
      "title": "Slbs / Malham Cove",
      "caption": "Malham Cove. Malham Beck emerges from its underground course here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Footpath_to_Malham_Cove_-_geograph.org.uk_-_447399.jpg",
      "title": "Chris Gunns / Footpath to Malham Cove",
      "caption": "View of the footpath into the cove."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Escarpment_at_Malham_Cove_-_geograph.org.uk_-_1447159.jpg",
      "title": "Mike Green / Escarpment at Malham Cove",
      "caption": "Escarpment at the Cove. This view is of the Southern end of the escarpment, seen from the centre of the limestone pavement area at the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Limestone_pavements_at_Malham_Cove_-_geograph.org.uk_-_102247.jpg",
      "title": "Vivienne Smith / Limestone pavements at Malham Cove",
      "caption": "Limestone pavements at the site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/View_from_top_of_Malham_Cove_-_geograph.org.uk_-_35369.jpg",
      "title": "Martin Rankin / View from top of Malham Cove",
      "caption": "View from top of the Cove. Looking out along Malham Beck towards Malham (centre, middle distance)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Malham_Cove%2C_Information_Board_-_geograph.org.uk_-_641826.jpg",
      "title": "Terry Johnson / Malham Cove, Information Board",
      "caption": "Information Board. On the board you can see a quote from lecturer Adam Walker (1730-1821) who wrote that the \"beautiful rock is like the age-tinted wall of a prodigious castle, the stone is very white and from the ledges hang various shrubs and vegetables, which with the tints given it by the bog water gives us a variety that I never before saw\". The board also details how a huge waterfall once poured over the top of the cove as massive glacier mellted on the land above it. Recent excavations show the cove may have formed 50000 years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Climbers_on_the_face_of_Malham_Cove_-_geograph.org.uk_-_310536.jpg/512px-Climbers_on_the_face_of_Malham_Cove_-_geograph.org.uk_-_310536.jpg",
      "title": "Ian Greig / Climbers on the face of Malham Cove",
      "caption": "Climbers on the face of the cove."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Malham_Beck_below_Malham_Cove_-_geograph.org.uk_-_559781.jpg",
      "title": "Alexander P Kapp / Malham Beck below Malham Cove",
      "caption": "Malham Beck below the cove."
    }
  ],
  "distance_km": 14.0,
  "description": "This super walk visits two well known beauty spots in the Yorkshire Dales. The hike to the cove and tarn is one of the most popular walks in Yorkshire. The cove was exposed to a global audience when featured in the flim 'Harry Potter and the Deathly Hallows (Part 1)'. It was used as the hideout for Harry and Hermione when they fled there to avoid capture. It begins at the village of Malham and follows the Pennine Way to the stunning Malham Cove. The cove is a huge curved cliff formation of limestone rock with a vertical cliff face of about 260 feet high. It was formed by a waterfall carrying meltwater from glaciers at the end of the last Ice Age more than 12,000 years ago. There are also fabulous views across the Yorkshire Dales from the high point. From the cove you continue to climb towards the beautiful Malham Tarn. The tarn is owned by the National Trust and is also a designated nature reserve. The circular walk takes you around the tarn on footpaths and country lanes before returning to Malham village on the Pennine Way. An alternative route takes you to the tarn via the spectacular Gordale Scar where you will find two waterfalls and overhanging limestone cliffs over 100 metres high. The geologically fascinating area also includes the lovely Janet's Foss waterfall where you can enjoy a walk along a pretty beck and through garlic scented woodland. To extend the walk you can continue north along the Pennine Way and visit Fountains Fell and and Fountains Fell Tarn. The cove is located about 6 miles east of the town of Settle. You could reach the site by following our Settle to Malham Cove Walk which starts from the train station.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Malham village head to The Lister Arms for some post walk refreshments. They do excellent home cooked food and have award-winning cask ales as well. The Lister home made pies are of particular note! They also have a lovely garden area to sit out in on warmer days. You can find them in a fine spot, just across from the village green at a postcode of BD23 4DB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The walk to the cove and the tarn is a fine one to do with your dog. You'll likely see plenty of other dog walkers during the warmer months. However, the limestone pavement at the top of the cove is not so good though as it can be a bit slippy. The Lister Arms pub mentioned above is very dog friendly in the bar area. They even make their own doggy biscuit treats!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Malham National Park Centre is a great place to visit for more information on this wonderful area. They have displays about the area, guide books, maps leaflets and a team of knowledgeable staff to advise you. You can also find out about watching the Peregrine Falcons that regularly nest at the Cove. You can find them at Chapel Gate in Malham village at postcode BD23 4DA for your sat navs. They also have a decent sized car park which acts as a great start point for many walks in the area. Just to the east there's some nice trails around Winterburn Reservoir. The reservoir is a little of the beaten track so a nice place for a peaceful walk. The Dales High Way passes Malham and could be followed to the lake as an extension to your outing. The long distance waymarked trail explores many of the highlights of the Dales, running from Saltaire to Appleby-in-Westmorland for a distance of approximately 90 miles. For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/J93LMr9deSc",
  "district": "Skipton",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Old Barn Cafe, Chapel Gate, Skipton, North Yorkshire, York and North Yorkshire, England, BD23 4DA, United Kingdom",
  "postcode": "BD23 4DA",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "limestone"
  ],
  "points_of_interest": [
    "waterfalls",
    "cliff formation",
    "nature reserve"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}