{
  "created_at": "2025-01-06T01:10:24.846399+00:00",
  "objectID": "f6b8024033c64b8164b85712621b4eea",
  "ref": "fordingbridge-walking-route",
  "title": "Fordingbridge River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/River_Avon_and_bridge_at_Fordingbridge.JPG/512px-River_Avon_and_bridge_at_Fordingbridge.JPG",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f6b8024033c64b8164b85712621b4eea.gpx",
  "_geoloc": {
    "lat": 50.9273070775,
    "lng": -1.7901827402
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/River_Avon_and_bridge_at_Fordingbridge.JPG/512px-River_Avon_and_bridge_at_Fordingbridge.JPG",
      "title": "(Wellington) [Public domain], via Wikimedia Commons",
      "caption": "The bridge over the Avon at Fordingbridge. The historic bridge is 40 metres long and consists of seven stone arches. As such it is one of just two bridges with seven arches in the UK. It's also known as \"The Great Bridge\" and dates from the medieval period. The town takes its name from the bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/High_Street%2C_Fordingbridge_-_geograph.org.uk_-_61292.jpg",
      "title": "Clive Perrin / High Street, Fordingbridge, via Wikimedia Commons",
      "caption": "High Street, Fordingbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Bickton_-_View_towards_Fordingbridge_-_geograph.org.uk_-_1012383.jpg",
      "title": "Dave Bevis / Bickton - View towards Fordingbridge, via Wikimedia Commons",
      "caption": "Bickton - View towards Fordingbridge. The River Avon is in the foreground. The tower of St Mary's Church, can be seen in the middle distance. The church dates from 12th–13th century with restorations taking place in the 19th century. The churchyard has a monument to the safe building family \"Chubb\", and also a memorial to the last British man killed in a duel in England, James Alexander Seton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Magnolia_by_River_Avon%2C_Fordingbridge_-_geograph.org.uk_-_385545.jpg",
      "title": "Simon Barnes / Magnolia by River Avon, Fordingbridge, via Wikimedia Commons",
      "caption": "Magnolia by River Avon, Fordingbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Bickton_Mill_-_geograph.org.uk_-_1336105.jpg",
      "title": "Adrian King / Bickton Mill, via Wikimedia Commons",
      "caption": "Bickton Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Fishermen%27s_hut_-_geograph.org.uk_-_781254.jpg",
      "title": "Barry Deakin / Fishermen's hut, via Wikimedia Commons",
      "caption": "A relatively upmarket fishermen's hut beside the Avon near Bickton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Ibsley_bridge_River_Avon_Hampshire_-_geograph.org.uk_-_158536.jpg",
      "title": "Clive Perrin / Ibsley bridge River Avon Hampshire, via Wikimedia Commons",
      "caption": "Ibsley bridge River Avon Hampshire. Re built from the foundations with two additional spans, by the County Council 1930."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/River_Avon_near_Ibsley_-_geograph.org.uk_-_1281474.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Avon near Ibsley. The River Avon rises in the Vale of Pewsey and flows through Wiltshire, Hampshire and Dorset to the sea at Christchurch. The river and its tributaries form one of the most diverse chalk stream systems in England."
    }
  ],
  "distance_km": 6.5,
  "description": "This walk follows a section of the Avon Valley Path from the Hampshire town of Fordingbridge to Ibsley. It's about a 4 mile walk on a good waymarked path, with some waterside sections and fine views of the surrounding countryside on the way. The walk starts on the old bridge in Fordingbridge which spans the River Avon. The impressive old bridge is 40 metres long and consists of seven stone arches. From here you can pick up the waymarked footpath and follow it south to St Mary's Church which dates from the 12th century. The route continues past Bickton and Harbridge Farm where you turn east to cross the river and finish in the village of Ibsley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The George is located in a fine spot for some post walk refreshments. The 18th Century pub is set on the banks of the River Avon overlooking \"The Great Bridge\". It is the town's oldest surviving inn, having been situated on this prime riverside site since at least 1593. You can sit outside in the garden area and enjoy fine views over the river with your meal. If the weather is good it's the perfect spot to relax and take in the surroundings. They do excellent food and can be found at 14 Bridge Street with a postcode of SP6 1AH for your sat navs. At the other end of the route in Ibsley there's another noteworthy old pub to investigate. The Old Beams Inn dates all the way back to the 11th century and includes a picturesque thatched roof. The gastropub also includes front and rear gardens with a raised wooden terrace. Inside is cosy and comfortable with a log fire for the winter months. They are located very close to the river at Salisbury Road with a postcode of BH24 3PP."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trails make for a fine dog walk. The George and the Old Beams mentioned above are also dog friendly. The latter will even provide water bowls and doggy treats for your thirsty/hungry friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Fordingbridge you could cross to the eastern side of the river and visit the recreation ground. There's some nice trails here with more lovely river views. See the video below for more information.The town is near to the New Forest where there's some excellent walking opportunities. You could head to the nearby Latchmore Brook and Hasley Hill Inclosure. The brook and surrounding countryside are an idyllic area, often surrounded by horses, ponies and deer. The lovely Cadman's Pool and Martin Down Nature Reserve are also near the town and well worth a visit. Just to the south you can pick up the Frogham to Fritham Circular Walk in the neighbouring village of Frogham. The trail will take you up to the splendid viewpoint at Hamtpn Ridge before visiting the delightful village of Fritham. Near here you could visit Bramble Hill where you could enjoy a lovely cream tea in the delightful gardens of the Bramble Hill Hotel. Just to the south west is the neighbouring town of Verwood. Here you can enjoy a walk around Verwood Forest, the Cranborne Common Nature Reserve and the Stephen's Castle Nature Reserve where there's a lovely viewpoint. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/296MFIMXZ0M",
  "postcode": "SP6 1AS",
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Created by You, 5, High Street, Horseport, Fordingbridge, New Forest, Hampshire, England, SP6 1AS, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "path",
    "riverside"
  ],
  "points_of_interest": [
    "church",
    "farms"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}