{
  "created_at": "2025-01-05T23:41:13.149009+00:00",
  "objectID": "f6c966e23c25bf8f635b039f2fb63eea",
  "ref": "castle-drogo-walking-route",
  "title": "Castle Drogo Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Castle_Drogo_-_geograph.org.uk_-_552519.jpg",
  "nearby": [
    {
      "description": "Fingle Woods",
      "objectID": "f3249f8567e57792017b386bced05a94",
      "ref": "fingle-woods-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "River Teign Walk",
      "objectID": "3e369c17bf5ffe62945735163bfd167f",
      "ref": "river-teign-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f6c966e23c25bf8f635b039f2fb63eea.gpx",
  "_geoloc": {
    "lat": 50.6980098289,
    "lng": -3.8063127209
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Castle_Drogo_-_geograph.org.uk_-_552519.jpg",
      "title": "David Stowell / Castle Drogo, via Wikimedia Commons",
      "caption": "Castle Drogo. Sometimes referred to as \"the last castle built in England\", it was constructed for Julius Drewe, the founder of that once famous high street chain of Home and Colonial Stores. The building is now managed by the National trust and unfortunately some of the construction of the Sir Edwards Lutyens design is now in need of repair, hence the tent and temporary building to the right of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Castle_Drogo_-_geograph.org.uk_-_1355450.jpg/256px-Castle_Drogo_-_geograph.org.uk_-_1355450.jpg",
      "title": "Derek Harper / Castle Drogo, via Wikimedia Commons",
      "caption": "Granite steps lead down to a courtyard on the southwest side of the castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Shed_at_Castle_Drogo_-_geograph.org.uk_-_1355458.jpg/256px-Shed_at_Castle_Drogo_-_geograph.org.uk_-_1355458.jpg",
      "title": "Derek Harper / Shed at Castle Drogo, via Wikimedia Commons",
      "caption": "Shed at Castle Drogo. Recent works at the National Trust property meant that the car park buildings were out of action until recently, so temporary buildings were erected across the lawn from the castle to act as shop, information centre and plant sales centre. This is one of them."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Gardens_at_Castle_Drogo_-_geograph.org.uk_-_920223.jpg",
      "title": "Sarah Charlesworth / Gardens at Castle Drogo, via Wikimedia Commons",
      "caption": "Gardens at Castle Drogo"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/National_Trust_Visitor_Centre%2C_Castle_Drogo_-_geograph.org.uk_-_1764925.jpg/512px-National_Trust_Visitor_Centre%2C_Castle_Drogo_-_geograph.org.uk_-_1764925.jpg",
      "title": "Roger Cornfoot / National Trust Visitor Centre, Castle Drogo, via Wikimedia Commons",
      "caption": "National Trust Visitor Centre, Castle Drogo"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/On_the_Hunter%27s_Path_-_geograph.org.uk_-_1243487.jpg",
      "title": "Derek Harper / On the Hunter's Path, via Wikimedia Commons",
      "caption": "On the Hunter's Path. The Hunter's Path runs along the northern crest of the Teign gorge between Castle Drogo (in fact, to its west) to Fingle Bridge. Here it is following Drewsteignton Bridleway 13."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Drewsteignton%2C_Hunter%27s_Path_-_geograph.org.uk_-_1070769.jpg",
      "title": "Martin Bodman / Drewsteignton: Hunter’s Path, via Wikimedia Commons",
      "caption": "Drewsteignton, Hunter's Path. Looking north-north-west on a bridleway on the National Trust\u0092s Castle Drogo estate, near Hunter\u0092s Tor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Fingle_Bridge_-_geograph.org.uk_-_1403360.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Fingle Bridge is a narrow road bridge over the River Teign. It dates from between the 16th and 17th century. The bridge is Grade II listed."
    }
  ],
  "distance_km": 6.0,
  "description": "Explore the delightful gardens and wider estate surrounding this country house in Drewsteignton, Devon. This is one of the classic circular walks in Dartmoor taking you from Castle Drogo to Fingle Bridge along the wonderful Hunters Path. There are fabulous views down the Teign gorge and across Dartmoor on this elevated path. At Fingle Bridge you cross a 16th/17th century packhorse bridge and pick up the River Teign Walk following a splendid waterside path through oak woodland. Lots of little beaches give you the opportunity for a waterside picnic or a little paddle. It's great for wildlife too- look out for salmon and brown trout jumping up the weirs when the river is in spate (high water). Kingfishers and woodpeckers are other visitors to this beautiful area. Other features on the walk include Hunter's Tor, Sharp Tor, Piddledown Common and Drewston Woods. The area is managed by the National Trust and the route makes use of the Dartmoor Way so the footpaths are generally good. If you head east from Fingle Bridge you can explore the extensive Fingle Woods. It consists of 420 acres of woodland with waymarked trails and the Iron Age Hillfort of Wooston Castle.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Castle has a great National Trust visitor centre with a nice cafe. There's plenty of tables outside with great views of the grounds. It's a nice place to relax with a snack on a fine day. The Fingle Bridge Inn is in a great location right next to the river. You can sit outside in the large garden area which overlooks the woods and the river, which is just a few feet away from the tables. On a fine day it's the perfect place to relax with a cream tea after your exercise. Inside there's a cosy interior with a stone hearth and wood ceiling beams. You can find the inn right next to the old bridge at postcode EX6 6PW for your sat navs. Fingle Bridge is one of the highlights on the walk dating from between the 16th and 17th century. The bridge is Grade II listed."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just half a mile west of the castle is the delightful Stone Lane Gardens. Here you'll find botanical gardens and an arboretum with many different types of trees and a series of lovely wooden sculptures. It's a tranquil place to go for a stroll and another of the area's worthy attractions. You can find the gardens about 1 mile due west of Drewseignton or about half a mile north west of the castle. The postcode is TQ13 8JU for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/94YErN2GvEQ ",
  "postcode": "EX6 6PB",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hunter's Path, Drewsteignton, West Devon, Devon, England, EX6 6PB, United Kingdom",
  "district": "West Devon",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "moorland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "bird watching"
  ]
}