{
  "created_at": "2025-01-05T22:31:05.413445+00:00",
  "objectID": "f6e255ae183523fbf78446935adfcce4",
  "ref": "dornoch-to-embo-walking-route",
  "title": "Dornoch to Embo Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Dornoch_Sands_%282%29_-_geograph.org.uk_-_5793584.jpg/512px-Dornoch_Sands_%282%29_-_geograph.org.uk_-_5793584.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f6e255ae183523fbf78446935adfcce4.gpx",
  "_geoloc": {
    "lat": 57.8798909079,
    "lng": -4.02794546
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Dornoch_Sands_%282%29_-_geograph.org.uk_-_5793584.jpg/512px-Dornoch_Sands_%282%29_-_geograph.org.uk_-_5793584.jpg",
      "title": "Dornoch Sands (2) by Chris Heaton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dornoch Sands. The name 'Dornoch' originates from the Gaelic term for 'pebbly place', indicating the presence of fist-sized pebbles (dorn) that could be used as weapons. Archaeological excavations conducted during the development of a new business park in 1997 unveiled a building, evidence of ironworking, and a portion of a whale dating back to the 8th to 11th centuries AD. Archaeologists inferred that these findings represent an industrial area on the outskirts of a settlement, suggesting the existence of a settlement in Dornoch since at least the 8th century. However, the earliest direct mention of a settlement in Dornoch dates back to the early 12th century when David I, noted in the Dunfermline Abbey register, instructs Rognvald, the Earl of Orkney, to show respect to the monks at Dornoch. Dornoch boasts the thirteenth-century Dornoch Cathedral, the Old Town Jail, and the former Bishop's Palace, which has been transformed into the renowned Dornoch Castle Hotel. Additionally, it is home to the esteemed Royal Dornoch Golf Club, recognised as the 5th best golf course outside the United States in 2005 by Golf Digest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/On_the_John_O%27Groats_Trail%2C_looking_south_towards_Dornoch_-_geograph.org.uk_-_5824686.jpg/512px-On_the_John_O%27Groats_Trail%2C_looking_south_towards_Dornoch_-_geograph.org.uk_-_5824686.jpg",
      "title": "On the John O'Groats Trail, looking south towards Dornoch by Tim Heaton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On the John O'Groats Trail, looking south towards Dornoch. The village enjoys a notably sunny climate owing to its sheltered location and boasts miles of golden sand beaches. The beach extends from Dornoch Point, passing Embo beach, to the mouth of Loch Fleet National Nature Reserve. Adjacent to the beach lies a Site of Special Scientific Interest, home to nesting birds, flora, and fauna."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Doors_And_Windows_-_panoramio.jpg/512px-Doors_And_Windows_-_panoramio.jpg",
      "title": "Dg-505, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Dornoch village. The village is noteworthy as the last place a witch was burnt in Scotland. Her name was reported as Janet Horne; she was tried and sentenced to death in 1727. A stone, known as the Witch's Stone, commemorates her demise, bearing the inscription of the year 1722. The golf course designer Donald Ross commenced his career as a greenkeeper on the Royal Dornoch links. Adjacent to the golf course lies the award-winning blue flag beach. Dornoch was previously linked to the main railway network at The Mound by a light railway. The railway commenced operations on 2 June 1902. Stations along the line included Dornoch, Embo, Skelbo, Cambusavie Halt, and The Mound Junction. These stations ceased operations on 13 June 1960. Margaret C. Davidson, a Modern Languages teacher at Dornoch Academy, led the National Union of Women's Suffrage Societies in the burgh from 1913. She volunteered as a nurse in the Scottish Women's Hospitals in France during World War One and subsequently returned to teach and serve as a Girl Guide leader in 1931. On 21 December 2000, the pop star Madonna had her son Rocco christened in Dornoch Cathedral, the day prior to her wedding to Guy Ritchie at the nearby Skibo Castle. Dornoch was granted Fairtrade Town status on 13 January 2005. The Burghfield House Campus of the University of the Highlands and Islands in Dornoch serves as the base for the Centre for History, offering undergraduate and postgraduate history degrees to students across the UHI network and worldwide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Embo_Pier_-_geograph.org.uk_-_3451288.jpg",
      "title": "Embo Pier by Donald H Bain, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Embo Pier. Embo is a quaint village situated near the historic town of Dornoch on the Moray Firth in the county of Sutherland, within the Scottish Highlands, approximately an hour's drive north from Inverness. Embo boasts miles of stunning golden sandy beaches, which have often been rated as excellent. Additionally, it is home to Grannie's Heilan' Hame Holiday Park, offering family holidays in the scenic Highlands. Embo is conveniently located within walking distance to the Loch Fleet National Nature Reserve, where visitors have the opportunity to observe various wildlife species, including ospreys, otters, and more. With its picturesque beaches and abundant wildlife, Embo provides an ideal holiday destination for families seeking outdoor adventures and relaxation alike."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Embo_Links_and_the_north_end_of_Royal_Dornoch_Golf_Course_-_geograph.org.uk_-_4093723.jpg/512px-Embo_Links_and_the_north_end_of_Royal_Dornoch_Golf_Course_-_geograph.org.uk_-_4093723.jpg",
      "title": "Embo Links and the north end of Royal Dornoch Golf Course by Mike Pennington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Embo Links and the north end of Royal Dornoch Golf Course. Coul Links, an area of sand dunes protected as part of a Site of Special Scientific Interest (SSSI), lies to the north of the village. As of February 2019, a company led by American Todd Warnock is proposing to build a golf course on the links; the Scottish Government has referred the proposal to a planning inquiry, which will determine whether the development is to be permitted."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Embo%2C_the_post_office_-_geograph.org.uk_-_2529532.jpg",
      "title": "Embo: the post office by Chris Downer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Embo, the post office. On 16 July 1988, Embo declared independence from the rest of the United Kingdom for one day. The prime minister was Mr. Donald Ward. This was undertaken to raise funds for converting the unused primary school in the village into a community centre. The village introduced its own currency, known as the Cuddie, with an exchange rate of two Cuddies to the pound. Cuddies were accepted at the local public house, Grannies Heilan' Hame, in exchange for a measure of Clynelish Malt Whisky. The distillery owners in nearby Brora sponsored the bid for independence by issuing a commemorative label on 50 cases of Clynelish Malt Whisky – \"The Spirit of Free Embo\". The Battle of Embo occurred in 1245 between Scots and Vikings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Dornoch_Cathedral_-_geograph.org.uk_-_2855329.jpg/512px-Dornoch_Cathedral_-_geograph.org.uk_-_2855329.jpg",
      "title": "Dornoch Cathedral by Julian Paren, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dornoch Cathedral. he cathedral's churchyard is adjoined by Dornoch Castle, the somewhat reconstructed remains of the medieval palace of the Bishops of Caithness. It was formerly a Catholic Cathedral. The cathedral was dedicated to its founder, St. Gilbert and was built in 1224, in the reign of King Alexander II (1214–49) and the episcopate of Gilbert de Moravia (died 1245) (later Saint Gilbert of Dornoch) as the cathedral church of the diocese of Caithness (moved to Dornoch from Halkirk). William de Moravia (later Sutherland), 1st Earl of Sutherland, was buried in the cathedral in 1248. In 1570, the cathedral was burnt down by the Mackays of Strathnaver during local feuding. Full renovations were not carried out until 1835–37, by the architect William Burn, funded by Elizabeth the Countess of Sutherland at a cost of £15,000 (equivalent to £1,450,000 in 2021). Among the renovations carried out, the ruined but still largely intact aisled medieval nave was demolished and a new narrow nave without pillars built on its site. In the 17th century, Dornoch ceased to be the seat of the Bishops of Caithness due to the abolition of the episcopate in the Church of Scotland, but the name has remained due to this historical association. On 30 September 1866, the Duke and Duchess of Sutherland were present to welcome the Prince and Princess of Wales, and the Duke of Edinburgh, who attended the morning service. The interior was reordered between 1924 and 1926 by Rev. Charles Donald Bentinck, with the removal of Victorian plasterwork to reveal the stonework (although the medieval church would have been plastered throughout). The site of the medieval high altar was raised and converted into a burial area for the Sutherland family, who introduced large marble memorials."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Dornoch_Castle.jpg",
      "title": "Tom Pennington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dornoch Castle. Dornoch Castle was built around 1500 as the home of the bishops of Caithness. Bishop Robert Stewart gifted the castle to John Gordon, 11th Earl of Sutherland in 1557. In 1570 the castle was set alight in a feud between the McKays and Murrays. The rebuilding which followed included the addition of the upper part of the tower. The castle decayed during the 18th century, but was restored in 1813–1814 to serve as a school and jail. In 1859-60 it became a court house, and was made the headquarters of the Sheriff of Sutherland with extensive remodelling by William Fowler. Further alterations were made around 1880, including the heightening of the south-west block, and the addition of a three-storey east tower. Following the restoration the castle became a hunting lodge for visiting sportsmen. In 1947 it became a hotel. The Dornoch Castle Hotel has 24 rooms, including suites, and garden rooms, which were built in the 1970s. In addition, there are several personalized rooms and a restaurant. The castle is a category B listed building. The Castle is believed to have been haunted by the ghost of Andrew McCornish who was hanged for sheep stealing. The building passed into private hands in 1922, and became a hotel in 1947. It is now the Dornoch Castle Hotel."
    }
  ],
  "distance_km": 5.0,
  "description": "This walk follows a popular section of the John O' Groats Trail from Dornoch To Embo on the Sutherland coast. The walk runs for about 3 miles along a fairly flat path with nice beaches and lovely views over the Dornoch Firth and the Dornoch Links golf course. If you continue north you could enjoy some fine, waterside trails along Loch Fleet or try the climb to Ben Bhraggie. Please scroll down for the full list of walks near and around Dornoch and Embo. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Continue north along the John O' Groats trail and you could visit Brora and Golspie. Here you could visit the historic Dunrobin Castle. The 14th century castle has a fascinating history and some beautiful gardens to explore."
    }
  ],
  "video_url": "https://www.youtube.com/embed/K6MgA5i6Rv0?si=TGvkbbiL3YJzSI6m",
  "district": "Dornoch",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Square, Dornoch, Highland, Alba / Scotland, IV25 3SD, United Kingdom",
  "postcode": "IV25 3SD",
  "state": "Alba / Scotland"
}