{
  "created_at": "2025-01-06T00:18:33.297285+00:00",
  "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
  "ref": "macclesfield-canal-walking-route",
  "title": "Macclesfield Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Top_Locks%2C_Marple_-_geograph.org.uk_-_717882.jpg",
  "nearby": [
    {
      "description": "Bosley Cloud",
      "objectID": "aa614a8a6c25a01b2ea54fb66a17eeec",
      "ref": "bosley-cloud-walking-route"
    },
    {
      "description": "Bosley Reservoir",
      "objectID": "5339bd93baade947fcbe4f5479f3e438",
      "ref": "bosley-reservoir-walking-route"
    },
    {
      "description": "Astbury Mere Country Park",
      "objectID": "de7a9a96a3c115c92018c8e17b477e6e",
      "ref": "astbury-mere-country-park-walking-route"
    },
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Macclesfield to Marple - Middlewood Way",
      "objectID": "d53ffb59f5df794ccfb70a7400a772a8",
      "ref": "macclesfield-to-marple---middlewood-way-walking-and-cycle-route"
    },
    {
      "description": "Cheshire Ring Canal Walk",
      "objectID": "6d0d01f6477b5bcb587aea1c97814016",
      "ref": "cheshire-ring-canal-walk-walking-route"
    },
    {
      "description": "Peak Forest Canal",
      "objectID": "58bd76853a36b9a324b3b4952d4ee4a5",
      "ref": "peak-forest-canal-walking-route"
    },
    {
      "description": "Marple Canal Locks",
      "objectID": "32c9655c3df13780c53192d965572722",
      "ref": "marple-canal-locks-walking-route"
    },
    {
      "description": "Poynton",
      "objectID": "b6573ce55ee6388279d14374c30952a6",
      "ref": "poynton-walking-route"
    },
    {
      "description": "White Nancy",
      "objectID": "ba7ae58ed476b1a8c7ca82c9e1dbcbe6",
      "ref": "white-nancy-walking-route"
    },
    {
      "description": "Disley",
      "objectID": "dd3dda60ee5bb53be795299fe3d2ac87",
      "ref": "disley-walking-route"
    },
    {
      "description": "Sutton Reservoir and Danes Moss",
      "objectID": "3e4d70d0d37f19f6f7722dabba5d8757",
      "ref": "sutton-reservoir-and-danes-moss-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f6f2ea4897414d4bfee5e1c7747a748f.gpx",
  "_geoloc": {
    "lat": 53.4000656069,
    "lng": -2.0591058501
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Top_Locks%2C_Marple_-_geograph.org.uk_-_717882.jpg",
      "title": "Peter Fuller / Top Locks, Marple, via Wikimedia Commons",
      "caption": "Top Locks, Marple Top Lock (lock 16) Marple is at the junction of the Macclesfield and Peak Forest Canals. The flight of 16 locks with an average drop of almost 4 metres each are some of the deepest in the country. The canal operated without locks for many years a ropeway taken goods down roughly where the canal towpath is today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Adlington_Basin_-_geograph.org.uk_-_61231.jpg",
      "title": "David Kitching / Adlington Basin, via Wikimedia Commons",
      "caption": "Adlington Basin. The former Adlington Colliery Basin on the Macclesfield Canal is now a thriving marina with nearby cafe and restaurant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Bosley_Locks_10_and_11%2C_Macclesfield_Canal%2C_Cheshire_-_geograph.org.uk_-_550313.jpg",
      "title": "Roger Kidd / Bosley Locks 10 and 11, Macclesfield Canal, Cheshire, via Wikimedia Commons",
      "caption": "Bosley Locks 10 and 11, Macclesfield Canal, Cheshire Lock 10 is viewed across the pound from Lock 11."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Below_Bosley_Locks%2C_Macclesfield_Canal_-_geograph.org.uk_-_440961.jpg",
      "title": "Maurice Pullin [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Below Bosley Locks. The bottom lock can just be seen to the left. The transmitter on Sutton Common (or Croker Hill) is over 3km away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Bridges_over_the_Macclesfield_Canal_-_geograph.org.uk_-_396164.jpg",
      "title": "Jerry Evans / Bridges over the Macclesfield Canal, via Wikimedia Commons",
      "caption": "Bridges over the Canal. This fine sequence of four stone bridges crosses the Macclesfield Canal on the approach to Buglawton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Cruising_the_Macclesfield_canal_-_geograph.org.uk_-_1527434.jpg",
      "title": "Galatas / Cruising the Macclesfield canal, via Wikimedia Commons",
      "caption": "Cruising along the canal. Entering Red Bull basin having just passed over the Trent and Mersey canal via the aqueduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Evening_Reflections_on_the_Macclesfield_Canal_-_geograph.org.uk_-_551909.jpg",
      "title": "Roger Kidd / Evening Reflections on the Macclesfield Canal, via Wikimedia Commons",
      "caption": "Evening Reflections on the canal approaching Lyme Green, south of Macclesfield. Taken on a calm summer's evening at around six o'clock (BST)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Macclesfield_Canal%2C_Hurdsfield_-_geograph.org.uk_-_261301.jpg",
      "title": "michael ely / Macclesfield Canal, Hurdsfield, via Wikimedia Commons",
      "caption": "Hurdsfield. Looking south from near where the canal goes under Rainow Road."
    }
  ],
  "distance_km": 42.0,
  "description": "Follow the towpath of the Macclesfield Canal from Marple to Kidsgrove on this waterside walk in Cheshire. Along the way there's lots of interesting lock structures, old bridges, pretty villages, nice pubs and great views of the surrounding Cheshire countryside. The 27 mile canal runs from Marple in Greater Manchester to Kidsgrove in Staffordshire, where it links with the Trent and Mersey Canal. You start of at Marple Canal Locks near to Marple train station. It's a wonderful start to the walk with the fascinating flight of sixteen locks a truly impressive sight. The canal then heads south through the town before branching off to the south west while the adjacent Peak Forest Canal branches off to the south east towards Disley. The canal continues south towards Middlewood and Bollington, before entering Macclesfield itself. After passing through the eastern edge of the town you head out into the countryside again, passing Bosley Locks before coming to Congleton. The Bosley locks are one of the highlights of the route with an impressive flight of twelve canal locks. The final section runs from Congleton to Kidsgrove where the canal links with the Trent and Mersey Canal. The canal is one section of the Cheshire Ring Canal Walk which follows six historic canals through Cheshire, Greater Manchester and Staffordshire. Along the route of the canal there's plenty of opportunities to make short detours and visit some of the area's attractions. For example, around Congleton you can visit the lovely Astbury Mere Country Park and enjoy a waterside walk around the pretty lake. Around Bosley you will find Bosley Reservoir and the climb to Bosley Cloud. Also of interest is the Middlewood Way. The cycling and walking trail runs parallel to the canal from Macclesfield to Marple.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ring O' Bells is a good choice for some refreshments on the route. Located in Marple the 200 year old pub boasts a large award winning beer terrace/garden overlooking the canal. It's a great place to relax and enjoy a drink in the summer when there are weekly brass band concerts. The friendly pub is located right next to the canal at 130 Church Lane with a postcode of SK6 7AY. At Gurnett Ye Olde Kings Head is worthy of some investigation. The historic pub dates from 1695 and used to be a Smithy. It's conveniently located right next to the canal on Byrons Lane at postcode SK11 0HD.  The Puss in Boots is also right next to the canal in Macclesfield. There's tables right next to the water and a good menu. It's at postcode SK10 1NF. The Miner's Arms is located a couple of minutes walk from the Adlington Basin on the canal. As such it makes for a good pit stop on the route. The classic old country pub does good food and has a nice large beer garden to sit out and relax in on warmer days. There's a cosy fire indoors, a good sized car park and it's also dog friendly. You can find the pub on Wood Lane North, just south east of Poynton at a postcode of SK10 4PF for your sat navs. In Marple Bridge The Midland is worthy of consideration. The pub is in a lovely spot overlooking the River Goyt in the heart of the village. You can sit outside on the balcony and enjoy a meal with a view over the water. They're located close to the train station at 26 Brabyns Brow, SK6 5DT."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At Bollington you could consider leaving the canal and making a short detour up to White Nancy. There's an unusual folly here with fabulous views over the Cheshire Plain and Wales. It makes for a nice little addition to your walk if you have time. Around Kidsgrove you could leave the canal to visit Mow Cop. Here you'll find Mow Cop Castle, an 18th century folly regarded as one of the landmarks of the area. From the elevated position of the castle there are splendid views over the canal and the surrounding countryside. You can reach the viewpoint by leaving the canal at Scholar Green and heading east along the Gritstone Trail. Just to the west of the canal at this point there's also Rode Hall. The Georgian country house is surrounded by beautiful parkland and gardens and is just a short walk from the canal. Just south of Macclesfield the canal passes Sutton Reservoir and Danes Moss Nature Reserve. The reservoir is a nice place for a waterside stroll while the reserve has some pleasant boardwalks taking you over lowland raised bog. It's an interesting area with some rare flora and fauna to see. The canal passes right next to the reserve so it's easy to take a small detour to see what's there. In this same area there's also the worthy village of Gawsworth. The village includes three noteworthy historic buildings including the 15th century Gawsworth Hall. The house and grounds of the historic Tudor house are well worth exploring."
    }
  ],
  "postcode": "SK6 7DA",
  "district": "Marple",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brabyns Tennis Club, Brabyns Brow, Marple, Stockport, Greater Manchester, England, SK6 7DA, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "countryside",
    "rural"
  ],
  "points_of_interest": [
    "historic locks",
    "bridges",
    "villages",
    "countryside views"
  ],
  "facilities": [
    "pub",
    "visitor center",
    "car park",
    "country park",
    "reservoir"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}