{
  "created_at": "2025-01-06T08:10:50.819311+00:00",
  "objectID": "f760da5caaca6e86e3a0c9da50406fdc",
  "ref": "st-govans-chapel-walking-route",
  "title": "St Govan's Chapel Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/St._Govan%27s_Head%2C_chapel_-_geograph.org.uk_-_469507.jpg",
  "nearby": [
    {
      "description": "Stackpole Estate",
      "objectID": "7eef735451490804669ebaaaf8442142",
      "ref": "stackpole-estate-walking-route"
    },
    {
      "description": "Freshwater West",
      "objectID": "41d68244ddc861dacf0570cd704aa129",
      "ref": "freshwater-west-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f760da5caaca6e86e3a0c9da50406fdc.gpx",
  "_geoloc": {
    "lat": 51.6147658713,
    "lng": -4.9376836476
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/St._Govan%27s_Head%2C_chapel_-_geograph.org.uk_-_469507.jpg",
      "title": "Chris Downer / St. Govan’s Head: chapel",
      "caption": "St. Govan\u0092s Head: chapel. It is said that one cannot count the steps on the way down, and on the way back, and reach the same total each time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Cliffs_east_of_St_Govan%27s_Chapel_-_geograph.org.uk_-_1581582.jpg",
      "title": "Sid Howells / Cliffs east of St Govan's Chapel",
      "caption": "Cliffs east of St Govan's Chapel. Storm waves breaking against 30m high limestone cliffs. Wave heights of up to 6.6m were measured at the nearby NDBC. The coastal plateau is a late Cretaceous / early Tertiary marine erosion surface, exposed through tectonic uplift and eustatic (climate-influenced)lowering of sea level. The limestone beds dip south at approximately 15 degrees and are of variable thickness. The Carboniferous Limestone sequence in the Bosherston area is the thickest in Wales, in total around 1500m of strata (more than the height of Ben Nevis, if you could see it all in one place). The beds are cut by sub-vertical fractures (joints). The outer edge of the headland above the larger wave will probably fall away fairly soon, along a wide fissure that is clearly visible from several hundred metres way. This fissure has been opening along a master joint that extends through the limestone beds, and toppling failure is likely to occur."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/St_Govan%27s_Head_-_geograph.org.uk_-_177075.jpg",
      "title": "Peter Standing / St Govan's Head",
      "caption": "St Govan's Head. Two rock climbing parties can be seen in the central section of these steep cliffs whilst the yellow area just left of the head is an area of fresh rock fall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Blowhole_at_Bosherston_Mere_-_geograph.org.uk_-_1581454.jpg",
      "title": "Sid Howells / Blowhole at Bosherston Mere",
      "caption": "Blowhole at Bosherston Mere. The photo shows a particularly good example of a blowhole (gloup) at the top of a 35m high headland on the west side of Huntsman's Leap, near St Govan's Chapel. If high tide coincides with large waves the blow hole shoots a column of seawater and spray up to 20m above the limestone plateau - people standing to right of blowhole provide scale. The noise of the blast of seawater can sometimes be heard in Bosherston Village, 2km away from the blowhole, and the experience is similar to viewing a geyser. Please note that this is a potentially hazardous location (particularly in stormy weather when sudden gusts of wind could blow you over). Nearby cliff edges are undercut, and the sides of the blowhole or the roof of any unseen cave shaft could collapse. The feature lies within Range East (part of the MOD's Castlemartin Ranges) and this section of the Pembrokeshire Coast Path is closed when firing is in progress."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/View_into_chasm_known_as_Huntsman_Leap_-_geograph.org.uk_-_2154831.jpg/512px-View_into_chasm_known_as_Huntsman_Leap_-_geograph.org.uk_-_2154831.jpg",
      "title": "Colin Park / View into chasm known as Huntsman Leap",
      "caption": "View into chasm known as Huntsman Leap"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Coastal_inlet_near_St._Govan%27s_Chapel%2C_South_Pembs_-_geograph.org.uk_-_3448896.jpg",
      "title": "Coastal inlet near St. Govan's Chapel, South Pembs by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Coastal inlet near St. Govan's Chapel, South Pembs"
    }
  ],
  "distance_km": 6.0,
  "description": "This fascinating 13th century chapel is situated by the side of a spectacular limestone cliff on the Pembrokeshire Coast. This circular walk takes you from the delightful village of Bosherton to the coastal chapel, passing through the beautiful Stackpole Estate on the way. The walk starts in Bosherton with its fine pub, pretty cottages and 13th century Norman church. You then follow a nice country lane through the countryside to the coast where you can climb down the 52 stone steps to the little chapel. There's a doorway into the chapel on the north side, where you will find low stone benches and an empty bell-cote in a single chamber. The view out of the window towards the sea is wonderful. After leaving the chapel and climbing back up the steps you continue to St Govan's Head for more great coastal views. Look out for a variety of seabirds, including guillemots, razorbills and kittiwakes. The next section takes you from St Govan's Head to the sand dunes at Broad Haven. You then pass along the lovely Stackpole Lily Ponds where you can look out for waterlilies in the summer and wildlife which includes the resident otters. The final waterside section along the ponds leads you back into Bosherton.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Bosherston head to the St. Govan's Country Inn for some post walk refreshments. The classic village pub has a cosy interior with exposed beams, horse brasses and a large stone fireplace with log burner. There also a few tables outside if the weather is good. They do fine home cooked food and have a good selection of ales too. You can find them at postcode SA71 5DN for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Bosherston to Barafundle Bay Walk also starts from the car park in the little village. It will take you to the award winning beach at Barafundle before heading to St Govan's Chapel. Head west and you can visit Freshwater West where there's a lovely beach with sand dunes and rock pools. There's also a fine circular walk around Angle Bay and the village of Angle starting from here. For more walking ideas in the area see the Pembrokeshire Coast Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ySo2d8TwZm8",
  "district": "Bosherston",
  "county": "Sir Benfro - Pembrokeshire",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}