{
  "objectID": "f782202b6b8c18bc5572d539112b569b",
  "created_at": "2024-12-18T16:23:56.726248+00:00",
  "ref": "bollin-valley-way-walking-route",
  "title": "River Bollin Valley Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/36/Mobberley-Wilmslow_-_Bollin_valley_-_geograph.org.uk_-_255557.jpg",
  "nearby": [
    {
      "description": "Dunham Massey",
      "objectID": "06a571309144a1e4656740de8f8538c6",
      "ref": "dunham-massey-walking-route"
    },
    {
      "description": "Macclesfield Canal",
      "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
      "ref": "macclesfield-canal-walking-route"
    },
    {
      "description": "Styal Country Park",
      "objectID": "f4527767dbde93119c5270f9aa0ef3bc",
      "ref": "styal-country-park-walking-route"
    },
    {
      "description": "Prestbury",
      "objectID": "99c78399141216bcf4f89fda63862850",
      "ref": "prestbury-walking-route"
    },
    {
      "description": "Mottram Hall",
      "objectID": "ac3691a68638c1bb1e41b501dd7a9e3e",
      "ref": "mottram-hall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f782202b6b8c18bc5572d539112b569b.gpx",
  "_geoloc": {
    "lat": 53.2682884019,
    "lng": -2.1300993394
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Mobberley-Wilmslow_-_Bollin_valley_-_geograph.org.uk_-_255557.jpg",
      "title": "Mike Harris / Mobberley/Wilmslow - Bollin valley",
      "caption": "Bollin valley Mobberley/Wilmslow: the valley of the River Bollin, seen from the bridge on the North Cheshire Way beside the tunnel carrying the trail under runway 2 of Manchester airport. Along the riverbanks, you’ll find a mix of alder, willow, and ash trees, which help stabilise the soil and provide shade to the river. Wetlands and floodplain meadows feature plants like meadowsweet, yellow flag iris, and marsh marigold, which thrive in damp conditions. During spring and summer, woodland sections of the trail are carpeted with bluebells, wild garlic, and primroses, while hedgerows are adorned with hawthorn and blackthorn blossom. Wildflowers such as cow parsley, red campion, and dog violet can also be seen alongside the path, supporting pollinators."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/The_Bollin_Valley_Way_%28Footpath%29_-_geograph.org.uk_-_92149.jpg",
      "title": "Ian Warburton / The Bollin Valley Way (Footpath)",
      "caption": "Looking NE, this section of the footpath starts just east of the Holiday Inn, on the A538."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Wilmslow_%28Styal%29_-_Bollin_Valley_-_geograph.org.uk_-_255567.jpg",
      "title": "Mike Harris / Wilmslow (Styal) - Bollin Valley",
      "caption": "Wilmslow (Styal Country Park) - River Bollin seen from near Kingfisher Bridge (visible just ahead) on the North Cheshire Way in Styal Woods. The River Bollin and its surrounding habitats attract a variety of wildlife. The river itself is home to brown trout, grayling, and dipper birds, which can often be seen bobbing along the river’s edge. Kingfishers are another highlight, their flashes of blue visible as they dart over the water hunting for fish. Mammals like otters and water voles may occasionally be spotted in quieter sections, while the woodlands provide shelter for badgers, foxes, and various species of bats. Birdlife is abundant, with buzzards, woodpeckers, and nuthatches commonly seen or heard in the trees. Insects such as dragonflies, damselflies, and butterflies like peacock and comma are active near the water and wildflower meadows during warmer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Bollin_Valley_Fields_-_geograph.org.uk_-_1184537.jpg",
      "title": "Whatlep, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Fields Verdant Cheshire countryside, just across the county boundary from Greater Manchester."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/River_Bollin_-_geograph.org.uk_-_77956.jpg",
      "title": "Roger May / River Bollin",
      "caption": "River Bollin. The point at which the Bollin Valley Way footpath crosses the road at Mill Farm, whilst the river passes under Mottram Bridge on its way through the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/River_Bollin_-_Bridgewater_Canal_Aqueduct.jpg/512px-River_Bollin_-_Bridgewater_Canal_Aqueduct.jpg",
      "title": "Richard Cooke / River Bollin/Bridgewater Canal Aqueduct",
      "caption": "Photograph of the aqueduct carrying the Bridgewater Canal over the River Bollin, Dunham Massey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Glaze_Brook_enters_the_Manchester_Ship_Canal_-_geograph.org.uk_-_33232.jpg",
      "title": "Keith Williamson / Glaze Brook enters the Manchester Ship Canal",
      "caption": "Glaze Brook enters the Manchester Ship Canal. Here, on the border between Cheshire and Salford, the Manchester Ship Canal receives the waters of Glaze Brook (also known as the River Glaze). The Glaze drains a substantial area of mossland hereabouts and was the boundary between the ancient Lancashire Hundreds of West Derby and Salford. This latter fact is recorded on the wall of a bridge near here that carries the A57 road over the Glaze, but as the wall is made of sandstone the lettering is wearing away.This part of the Ship Canal is a canalised section of the River Mersey. The Mersey joined the canal a little way upstream of this point (to the left) and will leave the canal a little further downstream, close to where the River Bollin joins the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Weir_on_River_Bollin_above_Vardon_Bridge%2C_Wilmslow_-_geograph.org.uk_-_105614.jpg",
      "title": "Pete Taylor / Weir on River Bollin above Vardon Bridge, Wilmslow",
      "caption": "Weir on River Bollin above Vardon Bridge, Wilmslow"
    }
  ],
  "distance_km": 40.0,
  "description": "Follow the River Bollin from Macclesfield to Partington on this delightful waterside walk through Greater Manchester and Cheshire. The walk starts at the Macclesfield Riverside Park and follows the river through Prestbury, Wilmslow, Hale and Bowdon to Partington on the Manchester Ship Canal. On the route you will pass the 18th century Grade II listed Mottram Hall and National Trust owned Dunham Massey. This Georgian House is set in a magnificent 121-hectare (300-acre) deer park and boasts Britain's largest winter garden. As well as the River Bollin there are also views of the Bridgwater Canal and a short final section along the Manchester Ship Canal into Partington.",
  "video_url": "https://www.youtube.com/embed/Ssm-oS3hJ20",
  "postcode": "SK10 2SL",
  "district": "Macclesfield",
  "county": "Cheshire East",
  "region": "North West",
  "country": "England"
}