{
  "created_at": "2025-01-06T02:08:23.158438+00:00",
  "objectID": "f79c5f16cea4a71ce5c530d2774545bf",
  "ref": "nidd-gorge-walking-route",
  "title": "Nidd Gorge Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Nidd_Gorge_Viaduct_-_geograph.org.uk_-_234724_%28cropped%29.jpg",
  "nearby": [
    {
      "description": "Knaresborough Round",
      "objectID": "e8c509187fc471e5f9e9dea116080a78",
      "ref": "knaresborough-round-walking-route"
    },
    {
      "description": "Beryl Burton Cycleway",
      "objectID": "fa0600e1580d49f20c09cdcf080136b8",
      "ref": "beryl-burton-cycleway-walking-and-cycle-route"
    },
    {
      "description": "Harrogate Ringway",
      "objectID": "3275bc6154901552601730d06dfaafeb",
      "ref": "harrogate-ringway-walking-route"
    },
    {
      "description": "Knaresborough River Walk",
      "objectID": "24b7650403fe79d82675fe579373b62f",
      "ref": "knaresborough-river-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f79c5f16cea4a71ce5c530d2774545bf.gpx",
  "_geoloc": {
    "lat": 54.0093153112,
    "lng": -1.475181575
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Nidd_Gorge_Viaduct_-_geograph.org.uk_-_234724_%28cropped%29.jpg",
      "title": "manonabike [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Nidd Gorge Viaduct on the former Harrogate to Ripon railway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Weir_on_the_Nidd_-_geograph.org.uk_-_234208.jpg",
      "title": "DS Pugh / Weir on the Nidd, via Wikimedia Commons",
      "caption": "Weir on the Nidd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/River_Nidd_near_Knaresborough_-_geograph.org.uk_-_28589.jpg",
      "title": "Dave Berkeley / River Nidd near Knaresborough, via Wikimedia Commons",
      "caption": "River Nidd near Knaresborough"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Weir_in_Nidd_Gorge_-_geograph.org.uk_-_1422723.jpg",
      "title": "Tony Wells / Weir in Nidd Gorge, via Wikimedia Commons",
      "caption": "Rushing weir with pretty cottage behind"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_Gardeners_Arms%2C_Old_Bilton_%28geograph_2457052%29.jpg",
      "title": "Ian S / The Gardeners Arms, Old Bilton, via Wikimedia Commons",
      "caption": "The Gardeners Arms, Old Bilton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Old_stocks%2C_Bilton_village_green.jpg/512px-Old_stocks%2C_Bilton_village_green.jpg",
      "title": "G-13114 [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Old stocks, Bilton village green. The George Pub in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Knaresborough_Castle_-_geograph.org.uk_-_98041.jpg",
      "title": "RichTea [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Knaresborough Castle seen through an arch of the railway bridge, from a rowing boat on the River Nidd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Bowling_green%2C_Knaresborough_Castle_-_geograph.org.uk_-_1398009.jpg",
      "title": "wfmillar / Bowling green, Knaresborough Castle, via Wikimedia Commons",
      "caption": "Bowling green, Knaresborough Castle"
    }
  ],
  "distance_km": 11.0,
  "description": "Explore this beautiful river gorge on this waterside walk in Knaresborough. This circular walk takes you through the wooded gorge before crossing the Nidd Viaduct and returning to Knaresborough through the countryside around Old Bilton. It makes use of the Harrogate Ringway long distance path for part of the route. The walk starts in Knaresborough at the Conyngham Hall car park near the town centre and train station. You then head along Harrogate Road and High Bond End Road before turning down Lands Lane towards the river. The trail then weaves its way through the ancient woodland to Viaduct Wood and the Nidd Viaduct. Look out for a variety wildlife such as tawny owl, roe deer, woodpeckers and herons on the water. You then cross the Nidd Viaduct and head through the village of Old Bilton. The final section takes you through the countryside along Bilton Lane to the finish point back at the car park. Although this route is designed for walkers the section from the village of Old Bilton to Knaresborough follows the Beryl Burton Cycleway so cyclists can enjoy a nice traffic free path in the area too. The Knaresborough Round passes through the gorge so you could pick up this 20 mile circular trail to extend your walk. There's also the shorter Knaresborough River Walk which starts from the nearby 12th century Knaresborough Castle and explores the pretty grounds of Conyngham Hall.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the little village of Old Bilton you could stop for some refreshments at the Gardeners Arms. The classic old pub has some features like wainscotting, stone flags, and stone fireplaces still remaining. There's also a nice large garden area to sit out in when the weather is fine. You can find the pub on Bilton Lane with a postcode of HG1 4DH for your sat navs. Just north of the gorge you'll find the little village of Scotton. Here you can pay a visit to the noteworthy Guy Fawkes Arms. Originally constructed in the 17th century, the pub takes its name from Guy Fawkes who used to live in the village. They do excellent food and can be found on the Main Street at postcode HG5 9HU."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The gorge is a fine place for a dog walk and there is also the opportunity for a paddle in the quieter parts of the river. The Guy Fawkes Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you have time after your walk we recommend strolling south along the river and visiting the splendid Knaresborough Castle. The 12th century castle sits in a fine location, next to the river, just south of the train station. For a fee you can explore the interior of the castle and visit the interesting museum which details the history of the castle. The grounds include pretty gardens, attractive lawns, a bowling green and a putting green are free to access. From the castle's elevated position there are also fine views over the surrounding area. You could also head east along the Knaresborough Round to visit the worthy village of Goldsborough. Here you can explore the beautiful landscaped gardens at the 16th century Goldsborough Hall. For more walking ideas in the area see the Nidderdale Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sNZ7ObdG6b4",
  "postcode": "HG5 9AX",
  "district": "Knaresborough",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}