{
  "objectID": "f7d1988c82eb27184c444a63060fd9d6",
  "created_at": "2024-12-18T12:18:01.889768+00:00",
  "ref": "hindhead-walking-route",
  "title": "Hindhead Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Surrey_Hills_-_geograph.org.uk_-_1173566.jpg/256px-Surrey_Hills_-_geograph.org.uk_-_1173566.jpg",
  "nearby": [
    {
      "description": "Devil's Punch Bowl",
      "objectID": "877f31f2fb0e7126f1419866653789ab",
      "ref": "devils-punch-bowl-walking-and-cycle-route"
    },
    {
      "description": "Waggoners Wells",
      "objectID": "2ccdc77999bd3cfd732c4dfc80fed037",
      "ref": "waggoners-wells-walking-route"
    },
    {
      "description": "Ludshott Common",
      "objectID": "d5a4df14460cbc5245994a1ffd4bbaa1",
      "ref": "ludshott-common-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/A7B6006074A38F008625864C00740606/$FILE/Hindhead.gpx",
  "_geoloc": {
    "lat": 51.1135438594,
    "lng": -0.7295730819
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Surrey_Hills_-_geograph.org.uk_-_1173566.jpg/256px-Surrey_Hills_-_geograph.org.uk_-_1173566.jpg",
      "title": "Shazz / Surrey Hills",
      "caption": "Surrey Hills. The Surrey Hills logo on a totem pole by the National Trust café at the Devil's Punch Bowl."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Steps_down_to_the_Sailor%27s_Stone_-_geograph.org.uk_-_818762.jpg",
      "title": "Basher Eyre / Steps down to the Sailor's Stone",
      "caption": "Steps down to the Sailor's Stone.  In 1786, a sailor travelling from London to Portsmouth docks was brutally murdered by three individuals he had befriended in a local pub in Thursley. Following this tragic event, the Sailor’s Stone was erected to mark the spot where the sailor lost his life. The three highwaymen responsible for the crime were subsequently tried and hanged on Gibbet Hill, close to the scene of the murder, as a deterrent to other potential criminals. Following the executions, various fears and superstitions emerged surrounding Gibbet Hill. In 1851, Sir William Erle, an English lawyer, judge, and Whig politician, funded the installation of a Celtic cross on Gibbet Hill to dispel these fears and uplift the local community. The Celtic cross has since been designated as a Grade II listed monument by English Heritage. To delve into the area's grim history, one can take a walk along the Old Portsmouth Road around the Devil’s Punch Bowl, where both the Celtic cross and the Sailor’s Stone with its inscription can be found."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/The_Gibbet_Stone%2C_on_Gibbet_Hill%2C_Hindhead.jpg/256px-The_Gibbet_Stone%2C_on_Gibbet_Hill%2C_Hindhead.jpg",
      "title": "Rebekah Day, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "The Gibbet Stone, on Gibbet Hill, Hindhead. The Celtic Cross is all that remains as a monument to the Gibbet, an iron cage where hanged criminals were kept, that once stood on Gibbet Hill in Hindhead, Surrey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Cycling_on_Gibbet_Hill_-_geograph.org.uk_-_684160.jpg",
      "title": "Colin Smith / Cycling on Gibbet Hill",
      "caption": "Cycling on Gibbet Hill. The old track is being resurfaced, perhaps to take traffic to the viewpoint over the A3 Tunnel North Portal. the verges will need some more work too."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Temple_%28rems_of%29_-_geograph.org.uk_-_5671251.jpg/512px-Temple_%28rems_of%29_-_geograph.org.uk_-_5671251.jpg",
      "title": "Temple (rems of) by Des Blenkinsopp, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Temple of the Four Winds (rems of). The structure known as the Temple of the Four Winds was constructed circa 1910 by Viscount Pirrie, a prominent Irish shipbuilder and entrepreneur. Situated within the Viscount's Witley Park estate, this area once housed a deer park, where elaborate picnics were frequently hosted at the lodge for his hunting companions. Viscount Pirrie took pleasure in surveying his estate from this vantage point and appreciating the expansive vistas. Regrettably, over time, the lodge fell into disrepair and was subjected to vandalism in 1959. By 1966, it posed a hazard and had to be dismantled, leaving only the stone base intact. Nevertheless, with assistance from the Black Down & Hindhead Supporters, the vegetation surrounding the old lodge has been cleared, once again revealing splendid views. Take a hike up to Hurt Hill to witness the ongoing restoration efforts, aimed at eventually reinstating the stone plinth to its former grandeur."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/In_Hurthill_Copse_-_geograph.org.uk_-_683153.jpg",
      "title": "Colin Smith / In Hurthill Copse",
      "caption": "In Hurthill Copse. You can hardly see the wood for the trees here - hundreds of deciduous tree trunks. Hurt is an old Surrey word for whorts (whortleberries)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Pretty_garden_at_Coombswell_-_geograph.org.uk_-_1173898.jpg",
      "title": "Shazz / Pretty garden at Coombswell",
      "caption": "Pretty garden at Coombswell, Haslemere in the style of nearby Munstead House, the garden of which is listed under the national statutory protection scheme for being designed and written about widely by its early 20th century owner, leading garden builder and designer, Gertrude Jekyll. The house itself was designed by Edwin Lutyens and together they re-invigorated a love of the natural world and natural methods of construction respectively, as major figures in the Arts and Crafts movement/campaign."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Wide_valley_at_Hindhead_Common_-_geograph.org.uk_-_1562436.jpg",
      "title": "don cload / Wide valley at Hindhead Common",
      "caption": "Wide valley at Hindhead Common. This part of the common has few trees but is covered with heather and short grass. Sir Arthur Conan Doyle, the author renowned for creating Sherlock Holmes, resided at Undershaw in Hindhead from 1897 to 1907. During his time there, Sir Arthur often strolled on the Commons, and he was actively involved in the initial Hindhead Commons committee alongside Sir Robert Hunter and others. Legend has it that Conan Doyle drew inspiration from Hindhead for his famous novel 'The Hound of the Baskervilles'."
    }
  ],
  "distance_km": 6.0,
  "description": "Hindhead is the highest village in Surrey and a great place to start a walk. There's miles of woodland and heathland trails across the National Trust's Hindhead Common. The area includes hill climbs, wildlife, ponds and the popular Devil's Punch Bowl. This circular walk from Hindhead explores Hindhead Common, Gibbet Hill and the southern part of the woods. You can start the walk from the National Trust car park on the common and follow footpaths east up to Gibbet Hill where there are excellent views to enjoy. On the way you'll pass the Sailor's memorial stone which has an interesting history attached to it. See the video below for more details. The route then descends into the Hurthill Copse before following bridleways south west. The route then turns north towards the Tyndalls Estate and the car park.",
  "video_url": "https://www.youtube.com/embed/vJaaBYBCoww",
  "postcode": "GU26 6AG",
  "district": "Hindhead",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}