{
  "objectID": "f7f671cf68a772945c580a3901d631a6",
  "created_at": "2024-12-18T14:54:16.608354+00:00",
  "ref": "test-way-walking-route",
  "title": "Test Way Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/63/River_Test_in_summer_-_geograph.org.uk_-_537144.jpg",
  "nearby": [
    {
      "description": "Danebury Hill Fort",
      "objectID": "0872dbcdf132f788db3bdad1e7846239",
      "ref": "danebury-hill-fort-walking-route"
    },
    {
      "description": "Walbury Hill",
      "objectID": "00a3a023c99baeef1c7d31e297f3ce14",
      "ref": "walbury-hill-walking-route"
    },
    {
      "description": "Testwood Lakes",
      "objectID": "03dd6786cf23df5f47f69fc78f5b970b",
      "ref": "testwood-lakes-walking-route"
    },
    {
      "description": "Mottisfont Abbey",
      "objectID": "22700f0dcb372258b5a0f4394243bf1f",
      "ref": "mottisfont-abbey-walking-and-cycle-route"
    },
    {
      "description": "Harewood Forest",
      "objectID": "c5d680fcb4e8486f3dbcc8e5e8e6d33a",
      "ref": "harewood-forest-walking-route"
    },
    {
      "description": "Romsey Canal",
      "objectID": "63f4bbc7728f16824b68f53a40549ab5",
      "ref": "romsey-canal-walking-route"
    },
    {
      "description": "Overton",
      "objectID": "a1a24bc47dc6757e4e2e80e0de8c20d5",
      "ref": "overton-walking-route"
    },
    {
      "description": "St Mary Bourne",
      "objectID": "c6a6a00dde8e7120914086e4a2ef1360",
      "ref": "st-mary-bourne-walking-route"
    },
    {
      "description": "Totton",
      "objectID": "ab82575c515dcef66cdff1d73df14cd4",
      "ref": "totton-walking-route"
    },
    {
      "description": "Inkpen",
      "objectID": "8e0242a41276b78e4d059bee461837cc",
      "ref": "inkpen-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/88D1F3767FD9470980257819005544E6/$FILE/Test Way.gpx",
  "_geoloc": {
    "lat": 50.9123529198,
    "lng": -1.4801644343
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/River_Test_in_summer_-_geograph.org.uk_-_537144.jpg",
      "title": "Jim Champion / River Test in summer",
      "caption": "River Test in summer. View upstream from a bridge that crosses the River Test, just to the west of Longbridge Farm, about 3 miles north of Totton. The Test Way footpath crosses this bridge. The banks of the river here are used for private fishing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Signpost_at_a_junction_on_the_Test_Way_-_geograph.org.uk_-_539735.jpg",
      "title": "Jim Champion / Signpost at a junction on the Test Way",
      "caption": "Signpost at a junction on the trail. From this point northwards the trail follows this track, as far as the A3090 road west of Romsey. The track leads off to the right towards the bridge over the Test near Longbridge Farm, and it is not a right of way. The Test Way footpath takes a longer route to the same bridge, along public rights of way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Test_Way_footpath_near_Town_Copse_-_geograph.org.uk_-_539720.jpg",
      "title": "Jim Champion / Test Way footpath near Town Copse",
      "caption": "A view of the footpath near Town Copse, just south of Romsey. The footpath follows the course of this farm track, seen here between Town Copse (off to the left) and the River Test (off to the right). The path leads to the A3090 road at the foot of Pauncefoot Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Test_Way_footpath_heading_south_from_Stockbridge_-_geograph.org.uk_-_213569.jpg",
      "title": "Jim Champion / Test Way footpath heading south from Stockbridge",
      "caption": "Heading south from Stockbridge. The trail runs along the course of the disused railway line for many miles. The path isn't right alongside the river as you might expect, but it does follow the Test Valley. The riverside itself is all privately owned around Stockbridge, and people pay huge amounts of money for the fishing rights."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Stile_on_the_Test_Way%2C_Ridge_Lane_-_geograph.org.uk_-_591739.jpg/256px-Stile_on_the_Test_Way%2C_Ridge_Lane_-_geograph.org.uk_-_591739.jpg",
      "title": "Jim Champion / Stile on the Test Way, Ridge Lane",
      "caption": "Stile and waymarker, Ridge Lane. Here the footpath leaves the road and heads off along the left edge of this field, headed towards the bridge at Romsey. The River Test itself is about a kilometre to the east, passing through the Broadlands Estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Boardwalk_on_the_Test_Way%2C_Nursling_-_geograph.org.uk_-_344589.jpg/256px-Boardwalk_on_the_Test_Way%2C_Nursling_-_geograph.org.uk_-_344589.jpg",
      "title": "Jim Champion / Boardwalk on the Test Way, Nursling",
      "caption": "Boardwalk at Nursling. This is a part of the footpath leading to Mill Lane, Nursling, with the river across the field to the left. At this very wet time of year the path is incredibly muddy and only this short section has a raised boardwalk to keep you out of the mud/water. There is an overflowing stream to the right of the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Official_diversion_of_the_Test_Way%2C_near_Forton_-_geograph.org.uk_-_147538.jpg/256px-Official_diversion_of_the_Test_Way%2C_near_Forton_-_geograph.org.uk_-_147538.jpg",
      "title": "Jim Champion / Official diversion of the Test Way, near Forton",
      "caption": "Official diversion, near Forton. The footpath used to follow the northwest bank of the river as you walked southwest from Forton, which involved a dangerous dash across the A303 dual carriageway. It has been \"officially diverted\" over the flyover (where the communications mast is on the left of the photo), presumably for safety reasons. The route of the public footpath through this field of young wheat shows up nicely."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Storage_tanks_at_Pachington_Piggery%2C_Harewood_Forest_-_geograph.org.uk_-_147540.jpg",
      "title": "Jim Champion / Storage tanks at Pachington Piggery, Harewood Forest",
      "caption": "Storage tanks at Pachington Piggery, Harewood Forest. The piggery at Pachington is hidden amongst the trees of Harewood Forest, west of the old Longparish Station. These storage tanks are on a bank next to one of the concrete tracks that were laid in the Second World War when the forest was used to store munitions. The trail follows this route through the south of Harewood Forest."
    }
  ],
  "distance_km": 73.0,
  "description": "Travel through the Test Valley on this 45 mile walk through Hampshire and Berkshire. The route starts Eling Tide Mile near Totton heading north towards the Lower Test Nature Reserve and Romsey along the river. Here the river runs parallel to the old Andover Canal which you can explore on the Romsey Canal Walk. The route continues through Kimbridge and then onto the impressive National Trust owned Mottisfont Abbey. This 13th century Augustinian priory is surrounded by glorious grounds and is a major highlight on the trail. In this area you will also pick up the path along the old Sprat And Winkle Line railway which closed in 1964. This section is also suitable for cyclists. The path continues through Stockbridge, Wherwell and the pretty village of St Mary Bourne with its delightful thatched houses. This section also passes Harewood Forest and Danebury Hill Fort near Stockbridge. It's worth taking a a short detour to climb the hill and enjoy some splendid views over the Test Valley. The final section is a gradual climb through Hurtsbourne Tarrant and Linkenholt towards Inkpen Beacon and Walbury Hill in Berkshire where the trail finishes. At 297 m (974 ft) Walbury Hill is the highest point in Berkshire and South East England. At the summit you can enjoy great views over the county and explore the Iron Age Hill fort of Walbury Camp.",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}