{
  "created_at": "2025-01-06T02:24:43.858838+00:00",
  "objectID": "f821ea6079cb2e1d6338cb55558f00d0",
  "ref": "lickey-hills-country-park-walking-route",
  "title": "Lickey Hills Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Carpark%2C_Lickey_Hills_-_geograph.org.uk_-_1200967.jpg",
  "nearby": [
    {
      "description": "Chaddesley Wood",
      "objectID": "e21d76a14af59f1e5e2f1b2d87f771f3",
      "ref": "chaddesley-wood-walking-route"
    },
    {
      "description": "North Worcestershire Path",
      "objectID": "3ba181e4b3ed581e600a12f6dea8b88f",
      "ref": "north-worcestershire-path-walking-route"
    },
    {
      "description": "Waseley Hills Country Park",
      "objectID": "b90ce2beb28334df7389139c06d35e15",
      "ref": "waseley-hills-country-park-walking-route"
    },
    {
      "description": "Bittell Reservoirs",
      "objectID": "8b6c87629cfc2283986717ec9085e67a",
      "ref": "bittell-reservoirs-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f821ea6079cb2e1d6338cb55558f00d0.gpx",
  "_geoloc": {
    "lat": 52.3816157829,
    "lng": -2.0225827225
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Carpark%2C_Lickey_Hills_-_geograph.org.uk_-_1200967.jpg",
      "title": "Richard Webb / Carpark, Lickey Hills",
      "caption": "Lickey Hills Car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Below_the_visitor_centre%2C_Lickey_Hills_-_geograph.org.uk_-_1168698.jpg",
      "title": "Richard Webb / Below the visitor centre, Lickey Hills",
      "caption": "Below the visitor centre. A lawn leading to the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Bench_on_Beacon_Hill%2C_Lickey_Hills_Country_Park_-_geograph.org.uk_-_778421.jpg",
      "title": "Row17 / Bench on Beacon Hill, Lickey Hills Country Park",
      "caption": "Bench on Beacon Hill. In the middle distance is Rubery & on the horizon it's Birmingham city centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Junction_of_tracks%2C_Lickey_Hills_Country_Park_-_geograph.org.uk_-_127418.jpg",
      "title": "Phil Champion / Junction of tracks, Lickey Hills Country Park",
      "caption": "Junction of tracks, Lickey Hills Country Park. The track running to the left is the bridleway to Kendal End. The track ahead leads towards Barnt Green. Behind the photographer, this bridleway continues north to the Visitors Centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Rednal_Hill_-_geograph.org.uk_-_127465.jpg",
      "title": "Phil Champion / Rednal Hill",
      "caption": "Rednal Hill. Rednal Hill was presented to the City of Birmingham in 1888 by the Birmingham Association for the Preservation of Open Spaces. Together with land donated by the Cadbury family it forms the Lickey Hills Country Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Lickey_Hills.jpg",
      "title": "Phil Champion, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from Bilberry Hill towards Beacon Hill. Bilberry Hill is another of the viewpoints in the park. Together with its neighbours the hill is composed of Lickey Quartzite, one of the oldest rocks in the region. The Lickey Hills include some of the largest areas of bilberry and heather in the county. The hill in the distance is Beacon Hill. The open area in between is a golf course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Warren_Lane_%28bridleway%29%2C_Kendal_End_-_geograph.org.uk_-_127407.jpg",
      "title": "Phil Champion / Warren Lane (bridleway), Kendal End",
      "caption": "Warren Lane (bridleway), Kendal End. This bridleway skirts the southern end of Cofton Hill at the Country Park. The photo was taken from the junction with the B4120, looking south-west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Toposcope%2C_Beacon_Hill_-_geograph.org.uk_-_127512.jpg",
      "title": "Phil Champion / Toposcope, Beacon Hill",
      "caption": "Toposcope, Beacon Hill. The toposcope on Beacon Hill was constructed in 1923 after Beacon Hill was donated to the City of Birmingham by the Cadbury family. The toposcope was restored in 1988. From this viewpoint on a good day 13 old counties can be seen. At 298m, this is the highest point west of the Urals in northern Russia."
    }
  ],
  "distance_km": 5.5,
  "description": "Explore 524 acres of country park at Lickey Hills near Birmingham. There are a number of woodland trails to follow and a climb up Beacon Hill with fabulous views of the surrounding countryside. Also look out for deer, badgers and a variety of birdlife as you go. The park has an excellent visitor centre with an exhibition, leaflets and information on nature trails and guided walks. The park is very popular, particularly in springtime when the woodland is covered in an impressive display of bluebells. If you would like to continue your walk you could follow the North Worcestershire Path towards the nearby Waseley Hills Country Park or the Bittell Reservoirs in the other direction. The Barnt Green Circular Walk visits the park and the reservoirs and can be started from the visitor centre. At the Lower Bittell reservoir you can also pick up the Worcester and Birmingham Canal and enjoy a waterside walk to the splendid Tardebigge Locks. If you were to head a few miles to the south west you could visit the lovely Chaddesley Wood National Nature Reserve. The reserve has some nice woodland trails with a wide variety of flora and fauna to look out for. Lickey Hills is located on the south west tip of Birmingham near to Bromsgrove .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a good on site cafe selling a range of meals and snacks. There's indoor and outdoor seating with nice views over the park. If you fancy a pub lunch then you could head to the Barnt Green Inn, located on the southern fringes of the park. They serve high quality Modern British cuisine with Mediterranean influences. Outside there's a lovely large garden area to relax in on warmer days. You can find them at 22 Kendal End Road with a postcode of B45 8PZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland are ideal for dog walking so expect to see other owners on your visit. There are some busy roads surrounding the park so please be aware of that to keep your dog safe. The Barnt Green Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Alvechurch Walk visits the park from the nearby village. It takes you along the canal to the Bittell Reservoirs before climbing up to the park. It's a nice way of visiting the hills by public transport as there is a train station in Alvechurch. The historic settlement is a nice place for a stroll too with a 13th century church, several medieval half-timbered buildings and a rather fine canalside pub. For more walking ideas in the area see the Worcestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jVSXGODiXMg",
  "postcode": "B45 9QL",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beacon Hill, Lickey and Blackwell CP, Rubery, Bromsgrove, Worcestershire, England, B45 9QL, United Kingdom",
  "district": "Bromsgrove",
  "state": "England"
}