{
  "created_at": "2025-01-06T03:18:57.226358+00:00",
  "objectID": "f86221f80a34cb6b3a2369c67ba56731",
  "ref": "mickleton-walking-route",
  "title": "Mickleton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Mickleton_-_geograph.org.uk_-_36110.jpg",
  "nearby": [
    {
      "description": "Heart of England Way",
      "objectID": "9684dc380b519a397ae0770340d7f076",
      "ref": "heart-of-england-way-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Hidcote Manor Garden",
      "objectID": "919b09c1516facda129c8b539dc13093",
      "ref": "hidcote-manor-garden-walking-route"
    },
    {
      "description": "Chipping Campden to Dover's Hill",
      "objectID": "152731105f90384a0f1e77cdb26cd30b",
      "ref": "chipping-campden-to-dovers-hill-walking-route"
    },
    {
      "description": "Ebrington and the Foxcote Estate",
      "objectID": "0a2ea75bc0d975ce955c7780c7cd63d6",
      "ref": "ebrington-and-the-foxcote-estate-walking-route"
    },
    {
      "description": "Upper Quinton",
      "objectID": "a2af82183d8edf72af68fe9ee96aaaa9",
      "ref": "upper-quinton-walking-route"
    },
    {
      "description": "Honeybourne",
      "objectID": "04baeb7c6e9bb532020b429f61e798ab",
      "ref": "honeybourne-walking-route"
    },
    {
      "description": "Bretforton",
      "objectID": "753cb2c6b28288131135abd485dd25c4",
      "ref": "bretforton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f86221f80a34cb6b3a2369c67ba56731.gpx",
  "_geoloc": {
    "lat": 52.0924812055,
    "lng": -1.7659386635
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Mickleton_-_geograph.org.uk_-_36110.jpg",
      "title": "David Stowell / Mickleton",
      "caption": "Mickleton. A fine example of a Cotswold stone houses in the main street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Kiftsgate_Court_-_geograph.org.uk_-_180676.jpg",
      "title": "David Stowell / Kiftsgate Court",
      "caption": "Kiftsgate Court 1. The gateway and lodge at the entrance to the court."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Kiftsgate_Court_-_geograph.org.uk_-_915420.jpg",
      "title": "Iain Crump / Kiftsgate Court",
      "caption": "Kiftsgate Court 2. View from the Summerhouse on the lower terrace"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Pool%2C_Hidcote_Manor_gardens_-_geograph.org.uk_-_1558051.jpg",
      "title": "G E Jeal / Pool, Hidcote Manor gardens",
      "caption": "Pool, Hidcote Manor gardens. Hidcote Manor gardens were the lifetime creation of Lawrence Johnston who spent 41 years from 1907 creating several garden 'rooms' in the 'Arts and Crafts' style out of the fields surrounding the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Chipping_Campden_-_geograph.org.uk_-_34760.jpg",
      "title": "David Stowell / Chipping Campden",
      "caption": "Chipping Campden. The old market hall, a well known Cotswold landmark."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Toposcope%2C_Dover%27s_Hill%2C_near_Chipping_Camden_-_geograph.org.uk_-_231433.jpg",
      "title": "Katy Walters / Toposcope, Dover's Hill, near Chipping Camden",
      "caption": "Toposcope, Dover's Hill, near Chipping Camden. Gloucestershire, Worcestershire and Warwickshire are visible from this point. Dover's Hill was the location for the so-called Olympicks or Cotswold Games, first held in 1612, revived in the 20th century, and still going today"
    }
  ],
  "distance_km": 9.2,
  "description": "This pretty Cotswolds village is the northernmost village in the county of Gloucestershire. It's a great area for walkers with several waymarked trails running through the area. There's also some delightful gardens and excellent views from the hills surrounding the village. This walk from the village visits some of the higlights of the area using three waymarked walking trails. You'll follow sections of the Heart of England Way, the Monarch's Way and the Cotswold Way to visit the delightful Kiftsgate Gardens, Hidcote Manor Garden and the town of Chipping Campden where you can enjoy a climb to the fine viewpoint at Dover's Hill. The walk starts in the village where you can pick up the Heart of England Way and follow it south east to Hidcote Manor Garden. These gorgeous gardens contain a number of beautifully designed outdoor 'rooms'. Highlights include the kitchen garden, plant house, herbaceous borders and the orchard. You'll also pass Kiftsgate Court on this opening section. The gardens, famed for its roses, are the creation of three generations of women gardeners. There are public footpaths that pass both gardens but a fee is required to gain access. From Hidcote you continue to the south west towards Mickleton Hills Farm and Chipping Campden. This attractive market town has a particularly interesting High Street, with a series of buildings dating from the 14th century to the 17th century. It's a popular tourist destination because of its location, history and fine selection of inns and restaurants. After passing west through the town you turn north along the Cotwolds Way to climb to Dover's Hill. The hill is a high point on the limestone escarpment that effectively forms the northern edge of the Cotswolds. There is a spectacular view northwards across the Avon valley from here. After taking in the views the route returns to Mickleton on the same paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the King's Arms for some post walk refreshments. This inn dates back to 1735 and includes a particularly lovely garden area where you can relax on warmer days. You can find the pub on the High Street at postcode GL55 6RT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and the King's Arms pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south east of Mickleton you'll find more good trails at Ebrington and the Foxcote Estate. The estate includes pretty streams, woodland and a lake with deer to look out for on the way. You can also pick up the long distance North Cotswold Diamond Way here. Less than a mile to the south of nearby Chipping Campden there's the neighbouring village of Broad Campden where you'll find the 18th century pub known as the 'local' of Father Brown, the crime-solving priest who stars in the BBC drama filmed in the Cotswolds. The circular Upper Quinton Walk visits Mickleton from the neighbouring village to the north. The sister village of Lower Quinton includes a noteworthy 16th century pub once owned by Henry VIII. Just to the west is neighbouring Honeybourne where you will find many historical buildings including a noteworthy thatched pub which dates to the 13th century. The circular walk from the village visits Bretforton where there's an unusual National Trust run pub dating from the medieval period."
    }
  ],
  "postcode": "GL55 6SL",
  "district": "Cotswold",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mickleton, Cotswold, Gloucestershire, England, GL55 6SL, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "pasture"
  ],
  "points_of_interest": [
    "garden",
    "viewpoint",
    "town"
  ],
  "facilities": [
    "visitor center",
    "restaurant",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}