{
  "created_at": "2025-01-06T03:54:41.601634+00:00",
  "objectID": "f8d69dc3597051a5ca84943d3e79537b",
  "ref": "rugby-walking-route",
  "title": "Circular Walk Around Rugby Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Oxford_Canal_near_Rugby%2C_Warwickshire_-_geograph.org.uk_-_988913.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f8d69dc3597051a5ca84943d3e79537b.gpx",
  "_geoloc": {
    "lat": 52.3796212976,
    "lng": -1.2501025488
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Oxford_Canal_near_Rugby%2C_Warwickshire_-_geograph.org.uk_-_988913.jpg",
      "title": "Roger Kidd / Oxford Canal near Rugby, Warwickshire, via Wikimedia Commons",
      "caption": "Oxford Canal near Rugby, Warwickshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Hillmorton_Locks%2C_Rugby%2C_Warwickshire_-_geograph.org.uk_-_987678.jpg",
      "title": "Roger Kidd / Hillmorton Locks, Rugby, Warwickshire, via Wikimedia Commons",
      "caption": "Hillmorton Locks, Rugby, Warwickshire The flight of locks at Hillmorton consists of three pairs, the bottom pair (here) numbered 2 and 3, then up to Nos 4 and 5, with No 6 and No 7 being the toplock pairing. This is because of the stop lock at Hawkesbury, about sixteen miles away being allocated number one on this, the North Oxford Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Hillmorton_Top_Locks%2C_Oxford_Canal%2C_Warwickshire_-_geograph.org.uk_-_987658.jpg",
      "title": "Roger Kidd / Hillmorton Top Locks, Oxford Canal, Warwickshire, via Wikimedia Commons",
      "caption": "Hillmorton Top Locks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Bridge_No_77_and_the_Barby_Straight%2C_Northamptonshire_-_geograph.org.uk_-_969870.jpg",
      "title": "Roger Kidd / Bridge No 77 and the Barby Straight, Northamptonshire, via Wikimedia Commons",
      "caption": "Oxford Canal Bridge 77 on the Barby Straight, Northamptonshire. The Barby Straight is a 1-mile part of the 1820s modernisation of the canal. It carries a farm track and public footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Rugby_-_Rugby_Wharf_-_geograph.org.uk_-_76878.jpg",
      "title": "Ian Rob / Rugby - Rugby Wharf, via Wikimedia Commons",
      "caption": "The junction of the Rugby Wharf Arm with the main line of the Oxford Canal at Rugby, Warwickshire. The cast-iron footbridge carries the towpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Oxford_Canal_east_of_Rugby%2C_Warwickshire_-_geograph.org.uk_-_988082.jpg",
      "title": "Roger Kidd / Oxford Canal east of Rugby, Warwickshire, via Wikimedia Commons",
      "caption": "Oxford Canal east of Rugby, Warwickshire. Here we are approaching Bridge No 68, a typical brick built structure allowing the farmers to have access to fields on both sides of the canal. The Oxford Canal was authorised as early as 1769, and James Brindley devised a meandering course hugging contours wherever possible. He died in 1772, and Samuel Simcock completed the task, but by the late 1820s, a considerable straightening of the course was engineered which cut many miles from the length of the canal."
    }
  ],
  "distance_km": 16.0,
  "description": "This circular walk takes you around the Warwickshire town of Rugby, taking in the Oxford Canal and the Great Central Walk Nature Reserve. Starting at the train station you head north east to pick up the canal. You then follow the towpath south toward Hillmorton where you'll pass the impressive Hillmorton Locks. It's a very picturesque area with a series of locks and nice views of the surrounding countryside. The route continues along the Barby Straight to Wood Bridge. Just after passing the bridge you leave the canal to follow Onley Lane to the trackbed of a dismantled railway line known as the Great Central Walk. The trail is also a nature reserve with wildlife including a variety of butterflies and birds to see along the path. Follow the trail north and it will take you back into the centre of Rugby and then onto the train station where the route finishes. To continue your walking around Rugby head south west of the town to Draycote Water. The large lake has some nice waterside footpaths to try. The long distance Shakespeare's Avon Way also passes through the town. The waymarked footpath follows the River Avon from its source near Naseby to its confluence with the Severn at Tewkesbury .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the south of the town there's the worthy village of Napton on the Hill. Here you'll find a 12th century church and nice walks along Napton Reservoir and the Oxford Canal Walk. There's also a fine canalside pub for rest and refreshment after your exercise. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "postcode": "CV21 1AA",
  "district": "Rugby",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mill Road, Brownsover, Rugby, Warwickshire, England, CV21 1AA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "rural"
  ],
  "points_of_interest": [
    "nature reserve",
    "locks",
    "countryside views"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}