{
  "created_at": "2025-01-06T02:56:54.327513+00:00",
  "objectID": "f8f2ca2feb982190634ccdea4783b576",
  "ref": "great-whernside-walking-route",
  "title": "Great Whernside Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Kettlewell_-_geograph.org.uk_-_421632.jpg",
  "nearby": [
    {
      "description": "Dales Way",
      "objectID": "605d1dad48e02d248ecb985988bc777c",
      "ref": "dales-way-walking-route"
    },
    {
      "description": "Grassington",
      "objectID": "9b0ebc708d7f6edf19dcccfd0a0f336d",
      "ref": "grassington-walking-route"
    },
    {
      "description": "Buckden Pike",
      "objectID": "b81550203a12512733f3fc4e818f7155",
      "ref": "buckden-pike-walking-route"
    },
    {
      "description": "Circular Walk around Kettlewell",
      "objectID": "8030b8aac5ea90b4f74d7bd5614c393b",
      "ref": "circular-walk-around-kettlewell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f8f2ca2feb982190634ccdea4783b576.gpx",
  "_geoloc": {
    "lat": 54.1471301232,
    "lng": -2.0432888418
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Kettlewell_-_geograph.org.uk_-_421632.jpg",
      "title": "John Illingworth / Kettlewell",
      "caption": "Kettlewell - route start. Seen from the path to Starbotton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Parting_of_the_ways_-_geograph.org.uk_-_1387264.jpg",
      "title": "David Pickersgill / Parting of the ways",
      "caption": "Parting of the ways. Three-way footpath junction north-east of Kettlewell. The track bearing left between the walls leads onto the slopes of Great Whernside, while the fingerpost visible right of centre beneath the tree points to two paths: one to Hag Dyke hostel (meeting the aforementioned track there) and another up Hag Dyke Gill to Providence Pot. The track forking to the right leads into Fold Farm's camping field, a delightfully away-from-it-all place to pitch your tent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Great_Whernside_-_geograph.org.uk_-_1194310.jpg",
      "title": "roger nightingale / Great Whernside",
      "caption": "View from the trig point at Great Whernside looking towards Hawkswick and Arncliffe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Paths_towards_Great_Whernside_-_geograph.org.uk_-_1344055.jpg",
      "title": "DS Pugh / Paths towards Great Whernside",
      "caption": "Paths towards Great Whernside. Paths leading off the Kettlewell to Middleham road towards the reservoirs of Angram and Scar House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/The_path_above_Hag_Dyke_-_geograph.org.uk_-_1413058.jpg",
      "title": "Ian Greig / The path above Hag Dyke",
      "caption": "The path above Hag Dyke"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Hag_Dyke_-_geograph.org.uk_-_1413051.jpg",
      "title": "Ian Greig / Hag Dyke",
      "caption": "Hag Dyke. An abandoned farm house was taken over by the Scouts in 1947. It now boasts solar and wind power, radiators in every bedroom and a large dining room."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Boulders_on_the_western_slope_of_Great_Whernside_-_geograph.org.uk_-_789278.jpg",
      "title": "Stephen Craven / Boulders on the western slope of Great Whernside",
      "caption": "Boulders on the western slope of Great Whernside. This scene on a west-facing slope is seen at its best in the low sunlight of a November afternoon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Blue_Bell_Inn%2C_Kettlewell_-_geograph.org.uk_-_484095.jpg",
      "title": "al partington / Blue Bell Inn, Kettlewell",
      "caption": "Blue Bell Inn, Kettlewell. Established 1680. Now part of the Skipton brewery's, Copper Dragon, burgeoning empire."
    }
  ],
  "distance_km": 6.5,
  "description": "Climb to this prominent fell on this walk from Kettlewell to Great Whernside in North Yorkshire. Great Whernside forms the watershed between Wharfedale and Nidderdale, and is on the boundary between the Yorkshire Dales National Park and Nidderdale Area of Outstanding Natural Beauty. You can ascend to the 704 m (2,310 ft) summit from the village of Kettlewell. It's about a 2.5 mile climb and considered by many to be one of the best in the Yorkshire Dales. From the summit there are wonderful views of Pen y ghent, Ingleborough, Whernside, Pendle Hill and the Lake Distirct Mountains. This route climbs to the summit directly from Kettlewell, following a footpath to Hag Dike and then on to the summit. You can turn it into a longer circular route by continuing north from the summit to Blackfell Top and Black Dike and then descending to Starbotton Road. See our Circular Walk around Kettlewell for more details. Kettlewell is a pretty little village with a car park where you can start the walk. After your walk there's good pubs and cafes where you can refresh yourself after your exercise. There's lots of good options for extending your walking in the Kettlewell area. The Dales Way runs through the village so you could pick up the long distance path and head south to the market town of Grassington. Here you can enjoy riverside paths along the River Wharfe and a visit to the pretty Linton Falls. Just to the north is the village of Buckden where you can climb to Buckden Pike .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Kettlwell village you could enjoy a bite to eat at The King's Head. It's a pub of some note being ranked by The Sunday Times in the top 10 pubs in The Ultimate 100 British Hotels, as well as named in the Sunday Times Top 50 affordable hotels in the U.K. They do excellent homemade food and have a nice outdoor area for warmer weather. You can find them at The Green with postcode BD23 5RD for your sat navs. They also have a sister pub called The Blue Bell Inn which is dog friendly and can be found on Middle Lane at postcode BD23 5QX."
    }
  ],
  "video_url": "https://www.youtube.com/embed/6nh4ljsMcuY",
  "postcode": "BD23 5RJ",
  "district": "Kettlewell",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}