{
  "created_at": "2025-01-06T05:10:48.884528+00:00",
  "objectID": "f924de3ebb24a46ea818440ea0eb96bb",
  "ref": "lechlade-river-circular-walk-walking-route",
  "title": "Lechlade River Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Dock_and_Pub%2C_Lechlade_-_geograph.org.uk_-_333649.jpg",
  "nearby": [
    {
      "description": "Cricklade Circular Walk",
      "objectID": "5585e61c8a3a1a1aeba485c8d19da488",
      "ref": "cricklade-circular-walk-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Buscot Park",
      "objectID": "981212a09debd69222ded43f648b4cc8",
      "ref": "buscot-park-walking-route"
    },
    {
      "description": "Cotswold Canals",
      "objectID": "038846413153fa8c0050735366069bc7",
      "ref": "cotswold-canals-walking-route"
    },
    {
      "description": "Faringdon Circular Walk",
      "objectID": "a1f12685479bb6e07496eb69f9ef38ab",
      "ref": "faringdon-circular-walk-walking-route"
    },
    {
      "description": "Fairford",
      "objectID": "0fe72d5f3607ffa7138b22629754e9f1",
      "ref": "fairford-walking-route"
    },
    {
      "description": "Carterton",
      "objectID": "dd2f35cf25000c7e0aeaed98976c38d3",
      "ref": "carterton-walking-route"
    },
    {
      "description": "Eastleach",
      "objectID": "96ef057d8655ba756dd8c6a2e836b9cb",
      "ref": "eastleach-walking-route"
    },
    {
      "description": "Southrop",
      "objectID": "fbb308c5a0e2908a1faf66bfc0ed9d63",
      "ref": "southrop-walking-route"
    },
    {
      "description": "Lechlade To Kelmscott",
      "objectID": "1cb45c00b4caea14776746e91b980029",
      "ref": "lechlade-to-kelmscott-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f924de3ebb24a46ea818440ea0eb96bb.gpx",
  "_geoloc": {
    "lat": 51.6939068413,
    "lng": -1.6918991745
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Dock_and_Pub%2C_Lechlade_-_geograph.org.uk_-_333649.jpg",
      "title": "RichTea [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dock and Pub, Lechlade. Just beside Ha'penny Bridge and Thames Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Halfpenny_Bridge%2C_Lechlade.jpg",
      "title": "Martin Clark [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Halfpenny Bridge, Lechlade. The bridge and its toll house are a Grade II listed building. It marks the start of the navigable Thames and dates to 1792. It was called the Halfpenny bridge because that was the toll charged for pedestrians to cross it, until the toll was done away with in 1839."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Eastern_entrance%2C_Lechlade_Riverside_Marina_-_geograph.org.uk_-_333639.jpg",
      "title": "RichTea [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Eastern entrance, Lechlade Riverside Marina. Looking across the Thames from Riverside Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/River_Thames_at_Lechlade_-_geograph.org.uk_-_1690216.jpg",
      "title": "Chris Gunns [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Thames at Lechlade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/The_Thames_Path_-_Confluence_of_rivers_Thames_%5E_Coln_-_geograph.org.uk_-_2498630.jpg",
      "title": "The Thames Path - Confluence of rivers Thames & Coln by Row17, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Confluence of rivers Thames & Coln south west of the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/St_John_the_Baptist_Inglesham_-_geograph.org.uk_-_774453.jpg",
      "title": "Rod Allday / St John the Baptist Inglesham",
      "caption": "St John the Baptist Inglesham. Located south of the town at the south western tip of the circular walk. The ancient church has Anglo-Saxon origins but most of the current structure was built around 1205. The church stands above the water meadows next to the confluence of the River Thames, River Coln and the Thames and Severn Canal. It is a Grade I listed building with some fascinating history including Anglo-Saxon carvings on one wall, to medieval wall paintings on another."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Looking_north_on_the_Lynt_Bridge_in_Buscot_Wick_-_geograph.org.uk_-_1562760.jpg",
      "title": "andrew auger / Looking north on the Lynt Bridge in Buscot Wick",
      "caption": "Looking north on the Lynt Bridge in Buscot Wick. The River Cole is pictured here. The river is a tributary of the River Thames which flows through Wiltshire and Oxfordshire, forming part of the border between the two counties."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/St._Mary%27s_Church%2C_Buscot_-_geograph.org.uk_-_341334.jpg",
      "title": "Geoff Pick / St. Mary's Church, Buscot",
      "caption": "St. Mary's Church, Buscot. The Church of England parish church of Saint Mary was built in about 1200. The bell tower has a ring of four bells, the oldest of which was cast at Bristol in about 1399. It's another historic building to investigate on the walk."
    }
  ],
  "distance_km": 7.5,
  "description": "This lovely circular walk takes you along the River Thames and through the countryside surrounding this pretty town in Gloucestershire. You'll visit the nearby villages of Inglesham and Buscot and enjoy nice views of the surrounding Gloucestershire and Oxfordshire countryside. The riverside town is a very attractive tourist destination and popular with boaters and walkers. Boats of different types can be hired from here, from rowing boats to river cruisers. The town also includes St Lawrence's parish church. Here you will find a path through the churchyard named Shelley's Walk, after the poet Percy Bysshe Shelley who composed 'A Summer Evening Churchyard' here. The walk starts in the town centre and picks up the Thames Path to take you along the river to the little village of Inglesham. Here you will find the Grade I listed parish church of St. John the Baptist which dates from the 13th century. Around here the route leaves the river and follows a country lane east towards Buscot Wick and Buscot. This pretty Oxfordshire village includes a village hall, tea shop and many National Trust owned properties. There is also a church dating from 1200 which includes lovely stained glass windows and a bell cast at Bristol in about 1399. In the summer months you can visit Buscot Park where you will find delightful grounds and gardens surrounding a fine 18th-century mansion. At Buscot Lock you pick up the riverside path, heading west back into Lechlade. This section passes St John's Bridge and St John's Lock, where there is a 19th century statue of Old Father Thames outside the lock house. There's also nice views of the River Leach in this area. To extend your walking in the area you can head west from the town and visit the Fairford /Lechlade section of the Cotswold Water Park. Here you can enjoy nice footpaths along a series of lakes. If you follow the Thames Path south west you can visit Cricklade. The town of Faringdon is also located nearby. Here you can enjoy a climb to Faringdon Folly for great views over the area. The Cotswold Canals long distance trail also starts from the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Riverside pub has a lovely lawned garden area right next to the river. You can enjoy a delicious meal with a view of swans and ducks on the water. The pub is located just west of Halfpenny Bridge at a postcode of GL7 3AQ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east along the river and you could visit Kelmscott on the Lechlade To Kelmscott Walk. It's an interesting part of the thames with the 13th century St. Mary's Church at Buscot and the statue of Old Father Thames at St John's Lock. At the end of the route you can also visit the 16th century Kelmscott Manor with its history, architecture and lovely grounds. Just to the south you can visit the neighbouring village of Bampton and enjoy another fine riverside walk along the Thames at Tadpole Bridge. The walk will take you east to the 13th century bridge at Newbridge. To the east there's Eastleach where you can enjoy two noteworthy Norman churches and an ancient stone slab clapper footbridge over the River Leach. It's another picture postcard place known for its numerous historic buildings and a colourful display of daffodils in the spring. Lovely Southrop can also be visited in this area. For more walking ideas in the area see the Oxfordshire Walks and Cotswolds Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ImtbjPJXEzg",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "High Street, Lechlade, Cotswold, Gloucestershire, England, GL7 3AD, United Kingdom",
  "postcode": "GL7 3AD",
  "district": "Cotswold",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "countryside",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "villages",
    "gardens",
    "views"
  ],
  "facilities": [
    "visitor center",
    "church",
    "tea shop",
    "car park",
    "boat hire"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}