{
  "created_at": "2025-01-06T04:47:51.024337+00:00",
  "objectID": "f93907899b910124b0a161321069298e",
  "ref": "totteridge-walking-route",
  "title": "Totteridge Walks - Darlands Nature Reserve Circular",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Totteridge_War_Memorial_%28geograph_5147223%29.jpg/512px-Totteridge_War_Memorial_%28geograph_5147223%29.jpg",
  "nearby": [
    {
      "description": "Dollis Valley Green Walk",
      "objectID": "cb6a7287ea281d933efef82ab4608634",
      "ref": "dollis-valley-green-walk-walking-route"
    },
    {
      "description": "Scratchwood and Moat Mount Open Space",
      "objectID": "c33bad5e196d28ec0d7a45db42513dc2",
      "ref": "scratchwood-and-moat-mount-open-space-walking-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Aldenham Country Park",
      "objectID": "5005f5a89830a9c2f9851c8c480f75cf",
      "ref": "aldenham-country-park-walking-and-cycle-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Pymmes Brook Trail",
      "objectID": "8aaaa3816e9e2b329c3b5a53049d1e2a",
      "ref": "pymmes-brook-trail-walking-route"
    },
    {
      "description": "London Colney",
      "objectID": "34eb2d21cd1e621585e8a8d6b91d63d6",
      "ref": "london-colney-walking-route"
    },
    {
      "description": "Mill Hill",
      "objectID": "4dfe07ef862b5309ebb1f1f9785aeb4b",
      "ref": "mill-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f93907899b910124b0a161321069298e.gpx",
  "_geoloc": {
    "lat": 51.6321613205,
    "lng": -0.201290411
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Totteridge_War_Memorial_%28geograph_5147223%29.jpg/512px-Totteridge_War_Memorial_%28geograph_5147223%29.jpg",
      "title": "Marathon / Totteridge War Memorial",
      "caption": "Totteridge War Memorial"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Totteridge_Village_-_geograph.org.uk_-_1464427.jpg/256px-Totteridge_Village_-_geograph.org.uk_-_1464427.jpg",
      "title": "Martin Addison / Totteridge Village",
      "caption": "Totteridge Village. House on a private side road to the east of the green, seen from Totteridge Green."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/New_footbridge_at_Darlands_Lake_-_geograph.org.uk_-_357229.jpg",
      "title": "Tony Jones / New footbridge at Darlands Lake",
      "caption": "New footbridge at Darlands Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Darlands_Nature_Reserve_-_geograph.org.uk_-_732895.jpg",
      "title": "Terry Burgess / Darlands Nature Reserve",
      "caption": "Darlands Nature Reserve. Barnet's best-kept secret as there are no signs to it from Totteridge Lane. Darland's Lake was created as an ornamental lake by damming Folly Brook. It's very shallow, with extensive reed beds, and the reserve also includes woodland. It has a diverse range of breeding birds and eighteen species of mammal have been recorded, including stoat and weasel. It's also of value for grass snakes, amphibians, fungi and invertebrates."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Totteridge_Green_-_geograph.org.uk_-_960876.jpg",
      "title": "Nigel Cox / Totteridge Green",
      "caption": "Totteridge Green. Viewed looking towards the A5109 Totteridge Village road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Cricket%2C_Totteridge_Village_-_geograph.org.uk_-_1464437.jpg",
      "title": "Martin Addison / Cricket, Totteridge Village",
      "caption": "Cricket, Totteridge Village. The batsman hooks at a bouncer. The cricket ground is sited on the side of the Dollis Valley and has a pronounced slope towards the southeast corner - definitely not a level playing field! In the distance the mast of Alexandra Palace can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Paths_Cross_-_geograph.org.uk_-_387447.jpg",
      "title": "Martin Addison / Paths Cross",
      "caption": "Paths Cross. Looking along the Dollis Valley Green Walk as it is crossed by a footpath from Totteridge to Chipping Barnet. The bridge on the right carries the path towards Totteridge across Dollis Brook."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/The_Orange_Tree%2C_Totteridge_Village_-_geograph.org.uk_-_1464455.jpg",
      "title": "Martin Addison / The Orange Tree, Totteridge Village",
      "caption": "The Orange Tree, Totteridge Village. Seen from the bus stop opposite. A popular location for lunch and parking is always at a premium here."
    }
  ],
  "distance_km": 6.0,
  "description": "Totteridge is a lovely little village to visit on the outskirts of London in the borough of Barnet. It has a rural feel with a pretty village green, a cricket pitch, some pleasant local countryside and a nearby nature reserve to visit. This circular walk from the village takes you to the Darland's Lake Nature Reserve before heading to Totteridge Common and the Dollis Brook for more waterside trails. The walk starts on the edge of the village where you can pick up footpaths heading south west onto the Darland's Lake Nature Reserve. At the southern end of the reserve there's a small lake with a circular footpath running around the perimeter. The reserve is a little off the beaten track so tends to be a quite a quiet place for a stroll. It's good for flora and fauna with a colony of fritillaries and various birds to see on the lake. After exploring the reserve you head north past Totteridge Common and Totteridge park to meet up with the Dollis Valley Green Walk. You can follow this waymarked footpath east along the Dollis Brook before turning south to return to Totteridge. The brookside trail is another easy path with more wildlife spotting opportunities.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Orange Tree is a good choice for some post walk refreshments in the village. It's in a lovely spot right next to the village pond where you can watch the birds on the water. There's an elegant interior and outdoor seating if the weather is good. You can find them at a postcode of N20 8NX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine dog walk. The Orange Tree mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend the walk you could head west along the Dollis Valley Walk to visit Scratchwood and Moat Mount Open Space. These two parks sit side by side on the outskirts of Elstree and Borehamwood. There's some nice woodland trails, ponds and lots of wildlife to see here. You could pick up the epic London Loop here too and follow it west to Aldenham Country Park where there's a large lake and good facilities. A few miles north there's the village of Shenley to explore. Here you can try the circular Shenley Walk which visits the training grounds of Arsenal F.C and Watford F.C before heading to the village of London Colney where you can enjoy lovely river walks along the River Colne. The walk also visits the noteworthy de Havilland Aircraft Museum. The museum is one of the highlights of the area and a must see for aircraft enthusiasts. The village of Ridge is also located near here. The settlement has a fine local pub with a particularly huge countryside garden area. To the east you can pick up the Pymmes Brook Trail. It's a similar walk to the Dollis Valley one, running along a pretty little brook which is one of the tributaries of the River Lea. For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/WmN6JDt2ypI",
  "postcode": "N20 8PP",
  "district": "London",
  "county": "Greater London",
  "region": "London",
  "country": "England",
  "gazetteer_found": true
}