{
  "created_at": "2025-01-06T03:24:09.193190+00:00",
  "objectID": "f93a086a792d010856732a006f59e177",
  "ref": "hastings-country-park-walking-and-cycle-route",
  "title": "Hastings Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2d/The_way_ahead_in_Hastings_Country_Park_-_geograph.org.uk_-_1091612.jpg",
  "nearby": [
    {
      "description": "Eastbourne to Hastings Walk",
      "objectID": "2555700e61a31255860dbe68880aea85",
      "ref": "eastbourne-to-hastings-walk-walking-route"
    },
    {
      "description": "Rye to Hastings",
      "objectID": "82608d56a3b56c3ba9ce5b6522e9638a",
      "ref": "rye-to-hastings-walking-route"
    },
    {
      "description": "Hastings Circular Walk",
      "objectID": "5d3cab92a0ba18e8c3d6cc8c44c39708",
      "ref": "hastings-circular-walk-walking-route"
    },
    {
      "description": "Fairlight",
      "objectID": "36c8869dfc6cbdd131c91cd0ed2186ad",
      "ref": "fairlight-walking-route"
    },
    {
      "description": "Royal Military Canal Path",
      "objectID": "23ec92ee4698b0dd917d6b4b50ec3444",
      "ref": "royal-military-canal-path-walking-route"
    },
    {
      "description": "Combe Valley Greenway",
      "objectID": "1b9965af3a2f1beeb38c231cbe246432",
      "ref": "combe-valley-greenway-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f93a086a792d010856732a006f59e177.gpx",
  "_geoloc": {
    "lat": 50.8643501726,
    "lng": 0.6126256385
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/The_way_ahead_in_Hastings_Country_Park_-_geograph.org.uk_-_1091612.jpg",
      "title": "Shazz / The way ahead in Hastings Country Park",
      "caption": "The way ahead in Hastings Country Park. This was taken on the Sussex Coastline Walk in the summer of 2006"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Hastings_Country_Park_-_geograph.org.uk_-_1010809.jpg",
      "title": "Oast House Archive / Hastings Country Park",
      "caption": "Vegetation and sea view in the park in Autumn 2007"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Hastings_countrypark_2.JPG/512px-Hastings_countrypark_2.JPG",
      "title": "Stefan Noble [CC BY-SA (https://creativecommons.org/licenses/by-sa/1.0)]",
      "caption": "Ecclesbourne Glen"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Hastings_countrypark_glen.JPG/512px-Hastings_countrypark_glen.JPG",
      "title": "Stefan Noble [Public domain]",
      "caption": "Looking East to Ecclescombe Glen"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Coastguard_Lookout%2C_Fire_Hills_-_geograph.org.uk_-_423798.jpg",
      "title": "Simon Carey / Coastguard Lookout, Fire Hills",
      "caption": "Coastguard Lookout, Fire Hills, near Fairlight towards the eastern side of the park. The highest peak of the Fire Hills has long been a vantage point to scan the open sea, the 19th century former coastguard cottages are out of view to the right of the current lookout. The highest point in Hastings, now named North's Seat, is at the top of Fairlight Down in Hastings Country Park. The spot is named after Frederick North (MP) who represented the town during the 19th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Footpath_to_Fairlight_Cove_-_geograph.org.uk_-_1091621.jpg",
      "title": "Shazz / Footpath to Fairlight Cove",
      "caption": "Footpath to Fairlight Cove. This was taken on the Sussex Coastline Walk. In the distance is the cliff at Fire Hills. The cove has suffered from coastal erosion and landslip at Rockmead Road and Sea Road. A number of houses there are very close to the sea edge, and properties on those roads suffered through demolition and abandonment of a number of homes."
    }
  ],
  "distance_km": 5.0,
  "description": "Enjoy over 600 acres of beautiful parkland and coast on this circular route in Hastings. The park is located in the High Weald Area of Outstanding Natural Beauty, most of the park has been designated a Special Area of Conservation and a Local Nature Reserve. Peregrines, black redstarts and fulmars can be seen on the coastal cliffs, while Dartford warblers, stonechats and yellowhammers can be seen on the gorse covered hills. The route below is most suitable for walkers but National Cycle Network route 2 also runs through the park and is a short cycle from Hastings. See the Eastbourne to Rye Cycle Route for more details. To extend your walking in the area you could pick up the Rye to Hastings Walk and visit the beautiful Rye Harbour Nature Reserve. You could also try our longer Hastings Circular Walk which visits the park and starts from the harbour in the town. The Eastbourne to Hastings Walk is another good, long distance option.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Coastguards Tea Rooms for some refreshments after your exercise. There's a new conservatory with a beautiful coastal view with France visible on a clear day. The Tearoom seats 50 people inside and they have additional seating for 30 outside. It's a great place to relax and enjoy a cake when the weather is good. They also have a nice shop with gifts, paintings and arts and crafts. You can find them a short distance from the car park on Coastguards Lane with a postcode of TN35 4AB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The expansive park has miles of trails great for a dog walk. You'll probably see plenty of other owners with their pets on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the eastern end of the park there's Fairlight and the splendid Fire Hills to explore. There's some particularly good cliff top walking to enjoy in this area. You can also pick up the Royal Military Canal Path near here and follow it to Winchelsea where you will find many interesting medieval buildings.  Just west of Hastings you could visit St. Leonards Gardens where there's some lovely footpaths, an ornamental pond, herbaceous plants, shrubs, bulbs, formal flower beds and trees. There's also some interesting architecture with villas surrounding the gardens, in Regency Gothic and cottage styles. It's a very pleasant place for a stroll and can be found at postcode TN38 0HQ. On the western side of Hastings you can pick up the Combe Valley Greenway. This shared cycle and walking route will take you through the lovely Combe Valley Countryside Park where you will find reedbed, fen, riverside paths, countryside trails, a nature reserve and a wide variety of wildlife. For more walking ideas in the area see the Sussex Walks and the High Weald Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GcRt2xcG0D8",
  "postcode": "TN35 5HD",
  "district": "Hastings",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Retreat, Barley Lane, Clive Vale, Hastings, East Sussex, England, TN35 5HD, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "hill"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}