{
  "created_at": "2025-01-05T23:33:25.251554+00:00",
  "objectID": "f96ddfb12cac025a8fd15c17e98ff235",
  "ref": "heaton-park-walking-and-cycle-route",
  "title": "Heaton Park Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/39/Heaton_Park%2C_Manchester_-_geograph.org.uk_-_3247.jpg",
  "nearby": [
    {
      "description": "Alkrington Woods",
      "objectID": "a9278f2234ed690baeb7150b8317f1b0",
      "ref": "alkrington-woods-walking-route"
    },
    {
      "description": "Rochdale Way",
      "objectID": "f0350cc1f52366c4210e708214fe00ce",
      "ref": "rochdale-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f96ddfb12cac025a8fd15c17e98ff235.gpx",
  "_geoloc": {
    "lat": 53.5366819105,
    "lng": -2.2435607329
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Heaton_Park%2C_Manchester_-_geograph.org.uk_-_3247.jpg",
      "title": "Keith Williamson / Heaton Park, Manchester",
      "caption": "Heaton Park, Manchester. This park is one of the largest municipal parks in Europe and occupies 25% of the green space in Manchester. The photograph shows the boating lake and was taken from SD 830 036"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/The_Pavilion%2C_Heaton_Park_-_geograph.org.uk_-_75171.jpg",
      "title": "Alan Fearon / The Pavilion, Heaton Park",
      "caption": "The Pavilion, Heaton Park. This must be one the grandest pavilions of any bowls club!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Ha-Ha_-_geograph.org.uk_-_63626.jpg",
      "title": "Keith Williamson / Ha-Ha",
      "caption": "The Ha-Ha. A ha-ha incorporates a sunken wall and a ditch. This one is located in front of Heaton Hall in Heaton Park, Manchester. Its purpose is to deny grazing animals access to ornamental land in front of the house, without interfering with the view from the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Smithy_Lodge_-_geograph.org.uk_-_62684.jpg",
      "title": "Keith Williamson / Smithy Lodge",
      "caption": "Smithy Lodge. Situated by the Middleton Road entrance to Heaton Park, Manchester. Called Smithy Lodge because a blacksmith's workshop was situated close by when it was built. Built in the 1770s for the Egerton family, owners of Heaton Hall at that time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Heaton_Park_-_geograph.org.uk_-_62688.jpg",
      "title": "Keith Williamson / Heaton Park",
      "caption": "Looking south into Heaton Park from near the Middleton Road entrance in Higher Blackley, Manchester. Car park of Heaton Park Golf Club on left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Papal_Monument%2C_Heaton_Park%2C_Manchester_-_geograph.org.uk_-_3266.jpg",
      "title": "Keith Williamson / Papal Monument, Heaton Park, Manchester",
      "caption": "Papal Monument. On the 31st May 1982 Pope John Paul the Second celebrated Mass here. This stone commemorates the event. Over 200,000 people were present around this spot on that day. His Holiness also planted a tree near this spot. It has come to light, however, that at some time between that day and the death of the Pope in April 2005 this tree has been stolen and its whereabouts are unknown!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Haweswater_Aqueduct_-_geograph.org.uk_-_63582.jpg",
      "title": "Keith Williamson / Haweswater Aqueduct",
      "caption": "Haweswater Aqueduct on the northern side of the park, by the reservoir. The aqueduct from Haweswater, in the Lake District, to Manchester terminates here at Heaton Park Reservoir. The aqueduct is 82 miles long, was finished in 1955 and carries up to 100 million gallons per day under gravity induced flow. The bas relief on the wall of this building depicts the pipeline. The plaques below the relief detail significant facts concerning its planning and construction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/The_Temple_-_geograph.org.uk_-_63633.jpg",
      "title": "Keith Williamson / The Temple",
      "caption": "The Temple. Built as an eye-catching feature the Temple commands stunning views of the park and the surrounding region. It may have been used as an observatory by the first owner of Heaton Hall, Sir Thomas Egerton (c1772)."
    }
  ],
  "distance_km": 5.0,
  "description": "Enjoying cycling and walking in this huge park in Prestwich, Manchester. Heaton Park is the largest park in Manchester and the largest municipal park in Europe, covering an area of over 600 acres. Attractions in the park include the 18th century Heaton Hall, an 18-hole golf course with driving range, a boating lake, an animal farm, woodlands, ornamental gardens, an observatory and a tram system. To extend your walking in the area head a couple of miles east to Middleton where you can explore Alkrington Woods. The nature reserve has some fine trails along the River Irk and a number of small lakes. You can also pick up the Rochdale Way long distance footpath here.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There are a number of cafes dotted around the park where you can stop for refreshments."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails in the park are ideal for dog walking. You are asked to keep them on leads in the Western pleasure ground and around the cafes."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a few miles to the north east you'll find Tandle Hill Country Park. There's some excellent views over the Manchester Plain and the Pennine Hills from this elevated park. The long distance Oldham Way can also be picked up here. Just a couple of miles to the south east there's the noteworthy Boggart Hole Clough. This attractive park includes some impressive steep ravines, a boating lake, a visitor centre, bike hire and good surfaced paths for cyclists."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Bloi0wXHiHM",
  "postcode": "M9 0QZ",
  "district": "Manchester",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Middleton Road, Higher Blackley, Manchester, Greater Manchester, England, M9 0QZ, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "gardens",
    "golf course"
  ],
  "facilities": [
    "car park",
    "animal farm",
    "boating lake",
    "tram system",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}