{
  "created_at": "2025-01-06T04:58:14.161692+00:00",
  "objectID": "f99b43897564868d28aedf06537bc686",
  "ref": "limestone-link---cumbria-walking-route",
  "title": "Limestone Link - Cumbria Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/39/Start_of_the_footpath_across_Hutton_Roof_Crags_-_geograph.org.uk_-_49622.jpg",
  "nearby": [
    {
      "description": "Hutton Roof Crags and Farleton Fell",
      "objectID": "45c8071e530c3a3176f84d07f693dee8",
      "ref": "hutton-roof-crags-and-farleton-fell-walking-route"
    },
    {
      "description": "Cumbria Coastal Way",
      "objectID": "2fcd19e1d9c4bc3c8a117c9c237af3f5",
      "ref": "cumbria-coastal-way-walking-route"
    },
    {
      "description": "Leighton Moss Nature Reserve",
      "objectID": "7986ac6ca3854fbdbc5056fe75854487",
      "ref": "leighton-moss-nature-reserve-walking-route"
    },
    {
      "description": "Arnside Knott",
      "objectID": "7d4dd8195b8808d1867d338e8bed61f5",
      "ref": "arnside-knott-walking-route"
    },
    {
      "description": "Kirkby Lonsdale",
      "objectID": "220c02875939bf7e0816504c860107e5",
      "ref": "kirkby-lonsdale-walking-route"
    },
    {
      "description": "Beetham Fairy Steps",
      "objectID": "147c228910f832ca30e1f0c0b8986f0f",
      "ref": "beetham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f99b43897564868d28aedf06537bc686.gpx",
  "_geoloc": {
    "lat": 54.1976229696,
    "lng": -2.8227365635
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Start_of_the_footpath_across_Hutton_Roof_Crags_-_geograph.org.uk_-_49622.jpg",
      "title": "David Gruar / Start of the footpath across Hutton Roof Crags",
      "caption": "Start of the footpath across Hutton Roof Crags. The Limestone Link, a 13-mile walk from Arnside to Kirkby Lonsdale, crosses the road here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Limestone_Link_Bridleway_-_geograph.org.uk_-_2866622.jpg/512px-Limestone_Link_Bridleway_-_geograph.org.uk_-_2866622.jpg",
      "title": "Limestone Link Bridleway by M J Richardson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Limestone Link Bridleway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Pond_near_the_Limestone_Link%2C_Hutton_Roof_-_geograph.org.uk_-_2252205.jpg",
      "title": "Pond near the Limestone Link, Hutton Roof by Karl and Ali, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pond near the Limestone Link, Hutton Roof"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Railway_footbridge_near_Holme_-_geograph.org.uk_-_76328.jpg",
      "title": "David Gruar / Railway footbridge near Holme",
      "caption": "Railway footbridge near Holme. Built in the late 1990s, this bridge carries the Limestone Link, a popular walk from Arnside to Kirkby Lonsdale, over the West Coast Main Line. Before it was built walkers had to take their chances at a level crossing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/The_Limestone_Link_-_geograph.org.uk_-_4159942.jpg?20221220050519",
      "title": "The Limestone Link by Ian Taylor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Near Hutton Roof in late summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Fairy_Steps_in_Underlaid_Wood_South_Lakeland_-_geograph.org.uk_-_2305770.jpg/256px-Fairy_Steps_in_Underlaid_Wood_South_Lakeland_-_geograph.org.uk_-_2305770.jpg?20210709164955",
      "title": "Fairy Steps in Underlaid Wood South Lakeland by peter robinson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Fairy Steps in Underlaid Wood South Lakeland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Clawthorpe_Fell_-_geograph.org.uk_-_356379.jpg?20110102184637",
      "title": "Geoff Kowalczyk / Clawthorpe Fell",
      "caption": "Clawthorpe Fell. Clawthorpe Fell, designated as a National Nature Reserve in 1976, is a unique area characterised by its quarried limestone pavement. Located in Cumbria, this reserve is currently managed by the Cumbria Wildlife Trust since 2021, under the ownership of Aggregate Industries. The reserve is divided into two distinct parts: the accessible mainland section and an island located within an active quarry, which is closed to public access. The mainland section is noted for its exposed limestone pavement, a habitat that has become a sanctuary for rare plants such as the dark-red helleborine and bird's-foot sedge. Over time, this area has also developed into a thriving environment for various butterfly and moth species, enhancing its ecological value."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Limestone_pavement%2C_Clawthorpe_Fell_-_geograph.org.uk_-_95177.jpg?20100130231606",
      "title": "David Gruar / Limestone pavement, Clawthorpe Fell",
      "caption": "Limestone pavement, Clawthorpe Fell. An extensive area of limestone pavement covered with stunted ash trees. The island within the nearby quarry, though inaccessible to the public, is equally rich in biodiversity. It hosts a range of specialised habitats, with juniper and various ferns growing among the intact limestone pavement. This area provides a rare glimpse into the ancient geological formations that have been exposed by the quarrying activities. Seasonal highlights include the sighting of peregrines soaring above the quarry and the melodic calls of willow warblers in the woodland adjacent to the limestone pavement during spring and summer. Additionally, summer visitors might spot grayling, wall, and small heath butterflies fluttering across the limestone, contributing to the reserve's vibrant biodiversity. This blend of historical quarrying and natural conservation has created a distinctive environment at Clawthorpe Fell, making it a vital refuge for both flora and fauna."
    }
  ],
  "distance_km": 20.0,
  "description": "This walk crosses the Limestone Hills from Arnside to Kirkby Lonsdale in Cumbria. You start in Arnside and head east to Holme through Underlaid Wood. You then pass over the rocky fells at Holmepark and Clawthorpe with views of Newbiggin and Hutton Roof Crags and Farleton Fell as you go. The walk comes to an end just outside Kirkby Lonsdale. See the photos below for details of the flora and fauna you can see at the Clawthorpe Fell Nature Reserve. The reserve is just south of the route near Holme and well worth exploring.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the end of the walk head to the Snooty Fox in Kirkby for some post walk refreshments. The classic old pub dates from the 17th century and has an excellent menu. There's also a nice beer garden to relax in on warmer days. You can find it in the attractive market town on Main Street with a postcode of LA6 2AH for your sat navs. At the other end in Arnside the The Albion is a good choice with lovely views across the Kent Estuary from the waterfront pub. There's a nice outdoor seating area where you can sit and take in views of Lakeland hills. You may also catch the Arnside Bore if you are there at the right time. The bore occurs at high tides, especially spring tides, where the incoming tide of Morecambe Bay narrows into the river estuary. You can find the pub at 36 The Promenade with a postcode of LA5 0HA for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Arnside Knott you will find the atmospheric ruins of Arnside Tower. The late-medieval tower house (or Pele tower) was built in the second half of the 15th century. It's a Scheduled Monument and Grade II* listed building and makes for a striking photo. In Arnside you will also find the delightful Ashmeadow Woodlands. There's some lovely footpaths here with lots of birdlife to enjoy. The woods can be accessed from the end of the Promenade or walk along the first bit of the coast path and access the woodland from the opening near the coastguard station. On the route look out for the geological highlight at Beetham's Fairy Steps. Here you will find an unusual natural limestone staircase which you can climb for more excellent views. The little village of Beetham is also well worth exploring with its 14th century ruined manor house and a particularly lovely garden centre."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aueR4YtyRjs?si=FSCToWIPRZZEhupL",
  "postcode": "LA5 0HZ",
  "district": "Arnside",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Black Dyke Road, Arnside, Westmorland and Furness, England, LA5 0HZ, United Kingdom",
  "state": "England"
}