{
  "objectID": "f9ab6c82b2b3b4a2d556b2a058267c61",
  "created_at": "2024-12-18T11:23:59.781794+00:00",
  "ref": "leek-walking-route",
  "title": "Walk around Leek Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Horse_Bridge_on_the_Leek_Arm_of_the_Caldon_Canal_-_geograph.org.uk_-_438192.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f9ab6c82b2b3b4a2d556b2a058267c61.gpx",
  "_geoloc": {
    "lat": 53.0935345579,
    "lng": -2.0364315639
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Horse_Bridge_on_the_Leek_Arm_of_the_Caldon_Canal_-_geograph.org.uk_-_438192.jpg",
      "title": "Jerry Evans / Horse Bridge on the Leek Arm of the Caldon Canal, via Wikimedia Commons",
      "caption": "Horse Bridge on the Leek Arm of the Caldon Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Footbridge_in_Ladderedge_Country_park_-_geograph.org.uk_-_452278.jpg",
      "title": "Neil Lewin / Footbridge in Ladderedge Country park, via Wikimedia Commons",
      "caption": "Footbridge in Ladderedge Country park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Railway_bridge_over_River_Churnet%2C_Leek%2C_North_Staffs._-_geograph.org.uk_-_64874.jpg",
      "title": "Ralph Rawlinson / Railway bridge over River Churnet, Leek, North Staffs., via Wikimedia Commons",
      "caption": "Railway bridge over River Churnet, Leek, North Staffs. North of Leek a path follows the trackbed of the disused North Staffs Railway for five miles as far as the River Dane. This is the bridge over the River Churnet outside Leek."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Abbey_Green.JPG/512px-Abbey_Green.JPG",
      "title": "AtticTapestry [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Abbey Green, a short distance north of Leek. Looking south along the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Tittesworth_Reservoir_-_geograph.org.uk_-_672.jpg",
      "title": "Paul Ashwin / Tittesworth Reservoir, via Wikimedia Commons",
      "caption": "Tittesworth Reservoir. North of Leek just off the A53 is a reservoir that provides water for the population of Stoke-on-Trent and the surrounding areas"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Leek_churchyard_2.jpg/512px-Leek_churchyard_2.jpg",
      "title": "Poliphilo [CC0], via Wikimedia Commons",
      "caption": "Churchyard of St Edward the Confessor, Leek"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Leek_-_geograph.org.uk_-_275579.jpg",
      "title": "www fotodiscs4u co uk / Leek",
      "caption": "Clock tower in the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Mosaic_in_the_Trestle_Market_-_geograph.org.uk_-_949676.jpg/512px-Mosaic_in_the_Trestle_Market_-_geograph.org.uk_-_949676.jpg",
      "title": "Penny Mayes / Mosaic in the Trestle Market",
      "caption": "Mosaic in the Trestle Market. This mosaic was produced to mark the 800th anniversary of Leek's charter market. It was designed by local people and made from reclaimed tile fragments. Briefly, the centre-piece represents King John surrounded by acorns and oak leaves. In the 16 segments around the edge are shown the dates, the ancient market cross, rams heads, cattle, chickens, the Saxon cross, churches, monastery, architecture, watermills, canals, railways, embroidery, silk & mills and market stalls today."
    }
  ],
  "distance_km": 20.5,
  "description": "This town in the Staffordshire Peak District has lots of good options for walkers. There's a canal, reservoirs, parks, hill climbs and a number of good waymarked trails to try. This circular walk visits some of the highlights of the area including the Caldon Canal, the River Churnet, Ladderedge Country Park and Tittesworth Reservoir. The route makes use of the waymarked Staffordshire Moorlands Walks for the duration and includes some woodland sections and moderate hill climbs. The walk starts in Leek on the Caldon Canal in Barnfields, just to the south of the town centre. There is a public car park and an aqueduct here. You can pick up the waymarked trail and follow it west to Ladderedge Park. There's 70 acres of wetland, meadows and woodlands with lovely views over the Churnet Valley here. After exploring the park the route bends round to the north, passing through woodland running along the River Churnet. The route then bends round to the east passing Bridge End, Abbey Green and Abbey Wood before coming to Tittesworth Reservoir. The attractive reservoir includes a cafe, an interactive exhibition, and picnic areas where you could stop for refreshments. Follow the trail right round the reservoir and it will lead you past Meerbrook and Blackshaw Moor before coming to Haregate on the outskirts of Leek. The trail then heads along Mount Road to Lowe Hill before turning west through Ballington Wood and returning to the canal. Near to the end of Tittesworth you will find one of the best walks in the Peak District at The Roaches. It runs along an elevated rocky ridge, with fascinating rock formations and wonderful views of the surrounding countrsyide and the reservoir below. Near here there's also the climb to Hen Cloud where there are more great views.",
  "postcode": "ST13 5RJ",
  "district": "Leek",
  "county": "Staffordshire",
  "region": "West Midlands",
  "country": "England"
}