{
  "created_at": "2025-01-06T02:43:41.024820+00:00",
  "objectID": "f9aee19e2c9679512e43ad6c7631ecd6",
  "ref": "ingleton-falls-walking-route",
  "title": "Ingleton Falls Walk With Trail Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Ingleton_Falls_in_Flood_-_geograph.org.uk_-_107883.jpg",
  "nearby": [
    {
      "description": "Richmond Way",
      "objectID": "6b4af621233be937084ef78d850242f1",
      "ref": "richmond-way-walking-route"
    },
    {
      "description": "Clapham Yorkshire",
      "objectID": "be59991f7ef1bc136f0a81fbc0d7eeaa",
      "ref": "clapham-yorkshire-walking-route"
    },
    {
      "description": "Gragareth",
      "objectID": "032b4d62fc1380d3f50b95e9c6d44709",
      "ref": "gragareth-walking-route"
    },
    {
      "description": "Yordas Cave",
      "objectID": "64d42b12dd775b4f294d1ff087753e14",
      "ref": "yordas-cave-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f9aee19e2c9679512e43ad6c7631ecd6.gpx",
  "_geoloc": {
    "lat": 54.1563955586,
    "lng": -2.4709829319
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Ingleton_Falls_in_Flood_-_geograph.org.uk_-_107883.jpg",
      "title": "Bob Jenkins / Ingleton Falls in Flood",
      "caption": "Ingleton Falls in Flood. River Twiss, looking towards Pecca Falls. The creation of the trail can be traced back to the late 19th century, sparked by public interest following articles in local newspapers like the Lancaster Guardian. The natural beauty of the Ingleton area, previously hidden, became accessible with the development of a designated trail. This project involved building paths and bridges to allow for easier access, and the trail was officially opened to the public on Good Friday, 11 April 1885. The presence of Ingleton railway station played a crucial role in the trail's early popularity, as it attracted tourists from larger nearby cities such as Bradford, Manchester, and Leeds, offering a convenient and scenic getaway ."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Beezley_Falls%2C_River_Doe%2C_Ingleton_-_geograph.org.uk_-_830368.jpg",
      "title": "Dr Neil Clifton / Beezley Falls, River Doe, Ingleton",
      "caption": "Beezley Falls, River Doe, Ingleton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Pecca_Falls%2C_on_the_River_Twiss%2C_Ingleton_-_geograph.org.uk_-_830344.jpg",
      "title": "Dr Neil Clifton / Pecca Falls, on the River Twiss, Ingleton",
      "caption": "Pecca Falls, on the River Twiss, Ingleton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Snow_Force%2C_River_Doe%2C_Ingleton_-_geograph.org.uk_-_831479.jpg",
      "title": "Dr Neil Clifton / Snow Force, River Doe, Ingleton",
      "caption": "Snow Force, River Doe, Ingleton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Thornton_Force_-_geograph.org.uk_-_1751086.jpg",
      "title": "Elliott Simpson / Thornton Force",
      "caption": "Thornton Force. The artist J. M. W. Turner was a regular visitor to the area. His sketch of Thornton Force in 1816 is currently part of the Tate collection. The drop of Thornton Force is about 14 metres (46 ft)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Masons_Arms%2C_Ingleton_-_geograph.org.uk_-_889390.jpg",
      "title": "Alexander P Kapp / Masons Arms, Ingleton",
      "caption": "A view of the Masons Arms pub in Ingleton village. A fine place for some post walk refreshments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Ingleton_Waterfalls_shop_and_cafe._-_geograph.org.uk_-_882498.jpg",
      "title": "John Firth / Ingleton Waterfalls shop and cafe.",
      "caption": "View of the on site shop and cafe at the start of the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Foot_bridge_over_river_above_Thornton_Force_-_geograph.org.uk_-_1421582.jpg",
      "title": "Mike Green / Foot bridge over river above Thornton Force",
      "caption": "Foot bridge over river above Thornton Force"
    }
  ],
  "distance_km": 7.2,
  "description": "One of the loveliest walks in England, this circular trail visits a series of beautiful waterfalls in Ingleton in the Yorkshire Dales. The walk runs for a distance of roughly 4.5 miles, with some moderate climbing on the way. The walk starts at the car park in Ingleton and follows the River Twiss through the woodland of Swilla Glen. You then cross the river at Manor Bridge and soon come to Pecca Falls. These falls consist of five main waterfalls dropping 30 metres over sandstone and slate into deep plunge pools. You then climb to Hollybush Spout, before coming to the spectacular Thornton Force. Here you will find a viewing area where you can watch the river plunge 14 metres over a cliff of limestone. From Thornton Force you head to Ravenray Bridge where you cross the river and begin the return leg. This starts by following Twisleton Lane to Twisleton Hall and Beezley Farm. Here you pick up the River Doe to Beezley Falls and Triple Spout – three beautiful waterfalls all side by side. You continue south along the river passing Rival Falls, and Baxengyhll Gorge where there is a viewing platform with fabulous views of the river and Snow Falls. The final section takes you into the pretty village of Ingleton and then on to the finish point at the car park. The Richmond Way long distance walk passes through Ingleton so you could pick this up to continue your walking in the area. You could also head east and visit the village of Clapham where there's a lovely walk along the Clapham Beck to the fascinating Ingleborough Show Cave.",
  "details": [
    {
      "subtitle": "FAQs",
      "content": "How long is the walk? - The walk should take between 2 and 2.5 hoursWhat are the prices? - Adult (16 years & over) – £10.00 Child (under 16 years) – £5.00"
    },
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to Masons Freehouse, a family run pub with a great selection of real ales, fine lagers and wines, along with good home cooked food. You can find it on New Rd at Postcode LA6 3HL. They also provide good quality accommodation if you need to stay over. There's also the Old Post Office on the High Street in Ingleton village which has a fantastic range of unusual gins to try (Postcode: LA6 3AA). There's also the conveniently located Falls Cafe near the start of the trail. There's a good range of meals and snacks with some outdoor seating as well."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are allowed on the path but please keep them on a lead when near farmland with sheep/cattle. The Masons Arms pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east towards Clapham and you can access another two of the walking highlights of the area. The climb to the popular Ingleborough Mountain is quite challenging but you are rewarded with magnificent views over the Yorkshire Dales. Also nearby are the Norber Erratics. Here you'll find a set of glacial erratic boulders which were probably deposited by melting ice sheets at the end of the last ice age, around 12,000 years ago. Just to the south you'll find the neighbouring village of Bentham. Here you can enjoy an easy circular walk along the River Wenning and visit a fine old pub dating back to 1625. The climb to Gragareth starts in the car park in the village. The circular walk will take you up to Gragareth Mountain, the second highest mountain in Lancashire. The route also passes the noteworthy Yordas Cave. You can explore inside the cave which includes a large main chamber with a waterfall and a stream running through it."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1AhU1slyF_w",
  "district": "Ingleton",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Broadwood Car Park, Oddies Lane, Scar End, Ingleton, North Yorkshire, York and North Yorkshire, England, LA6 3JJ, United Kingdom",
  "postcode": "LA6 3JJ",
  "state": "England"
}