{
  "created_at": "2025-01-05T23:24:38.863030+00:00",
  "objectID": "f9f74d00bea39fef2bc996fd0c85a4a0",
  "ref": "elterwater-walking-route",
  "title": "Elterwater Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Elterwater_-_geograph.org.uk_-_989562.jpg",
  "nearby": [
    {
      "description": "Dungeon Ghyll",
      "objectID": "e47d02a88263c3c258c3d54675572086",
      "ref": "dungeon-ghyll-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Colwith Force",
      "objectID": "60d4c36d2decf12daef27d50af9869cb",
      "ref": "colwith-force-walking-route"
    },
    {
      "description": "Loughrigg Fell",
      "objectID": "0ec83dd2b014575dc5b96cde09bc32f9",
      "ref": "loughrigg-fell-walking-route"
    },
    {
      "description": "Loughrigg Tarn",
      "objectID": "aac2d4c59dde455b5eed87e9333649e9",
      "ref": "loughrigg-tarn-walking-route"
    },
    {
      "description": "Cathedral Cavern",
      "objectID": "6c52beb4df0c2cf9670645ed0da32da8",
      "ref": "cathedral-cavern-walking-route"
    },
    {
      "description": "Chapel Stile",
      "objectID": "4e2d3c8b0469dff31e752755c0da3eca",
      "ref": "chapel-stile-walking-route"
    },
    {
      "description": "Langdale Pikes",
      "objectID": "e13b02cbeda30e31600a89d9170e0f47",
      "ref": "langdale-pikes-walking-route"
    },
    {
      "description": "Silver How",
      "objectID": "ea75bdb0f6a91fd78477da1d14ae7bba",
      "ref": "silver-how-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/f9f74d00bea39fef2bc996fd0c85a4a0.gpx",
  "_geoloc": {
    "lat": 54.433768653,
    "lng": -3.0377423334
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Elterwater_-_geograph.org.uk_-_989562.jpg",
      "title": "Sarah Charlesworth / Elterwater",
      "caption": "Elterwater view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Elterwater_Bridge_-_geograph.org.uk_-_2056559.jpg/512px-Elterwater_Bridge_-_geograph.org.uk_-_2056559.jpg",
      "title": "Elterwater Bridge by Peter S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Elterwater Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Elterwater_and_the_Langdale_Pikes_-_geograph.org.uk_-_1533215.jpg",
      "title": "Peter Smyly, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Elterwater and the Langdale Pikes. A walk through Rob Rash woods from the village passes the lake. The view of the lake is largely obscured by trees until the path emerges from the woods and this striking view opens out to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Where_the_Brathay_leaves_Elterwater_-_geograph.org.uk_-_370768.jpg",
      "title": "DS Pugh / Where the Brathay leaves Elterwater",
      "caption": "Where the Brathay leaves Elterwater. The lake feeds the Brathay at this point as the water continues its course to Windermere."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/River_Brathay_-_geograph.org.uk_-_1735981.jpg",
      "title": "Michael Graham / River Brathay",
      "caption": "River Brathay Near where it leaves Elter Water. Brathay means 'broad river' there are similar river names in Iceland and The Faeroes. Recorded as 'Braitha' in the year 1157.(Whaley 2006)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/River_Brathay_above_Skelwith_Bridge_-_geograph.org.uk_-_1041747.jpg",
      "title": "Tom Richardson / River Brathay above Skelwith Bridge",
      "caption": "River Brathay above Skelwith Bridge"
    }
  ],
  "distance_km": 5.0,
  "description": "This is a particularly lovely riverside walk to Elter Water Lake and Skelwith Bridge from the village of Elterwater. There is a nice surfaced path running from the village to the lake along the Great Langdale Beck and the River Brathay. It's a popular walk with the tranquil river one of the most pleasant areas of Great Langdale. There is also something particularly peaceful about the lake which is many people's favourite. The walk includes a woodland section by the lake before a visit to the wonderful Skelwith Force Waterfall at Skelwith Bridge. The falls are not particulary high at around 16ft but they are a wonderful sight after a lot of rainfall. There is a good viewing platform where you can get very close up to the falls. Just after the falls you come to the excellent riverside cafe which is a perfect spot to refresh yourself before the return leg. It's a nice easy walk with splendid views of the surrounding fells including the Langdale Pikes. There are more great Elterwater walks to try if you'd like to extend your exercise. You could visit the splendid Colwith Force Waterfall or climb to Loughrigg Fell and Loughrigg Tarn. From Loughrigg Fell there are splendid views over Rydal Water and Grasmere Lake. If you head west from the village of Elterwater you can follow the Cumbria Way along the Great Langdale Beck to Dungeon Ghyll. Here you can climb alongside the waterfall on a series of stone steps to Stickle Tarn. The unusual Cathedral Cavern is about a 2 mile hike from the village. The striking quarry complex includes a series of tunnels where you can visit the 40ft high chamber known as 'The Cathedral'.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Britannia Inn in Elterwater is a pub of some note with an interesting history. It was built approximately 500 years ago as a gentleman's farm house and then converted to an Inn sometime during the 19th century. There's a cosy open fire for winter days and a nice beer garden for fine summer days. It's located in a very spot in the little village with a postcode of LA22 9HP. At Skelwith Bridge you can enjoy refreshments at the lovely Chesters by the River cafe. Here you'll find a nice riverside deck where you can sit outside and enjoy lunch on finer days. There's delicious salads, specials, cakes and a shop where you can buy souvenirs. You can find it at postcode LA22 9NW for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west you will find the neighbouring village of Chapel Stile. The little village includes a 19th century church, a decent old pub and a number of stone cottages built from the surrounding slate quarries which are a prominent feature of this area. The climb to the Langdale Pikes is a popular one to do in this area. ust to the north there's the climb to Silver How from Grasmere. The walk also visits the National Trust owned Allan Bank, the former home of William Wordsworth. You could start the climb from Elterwater too as it is only just over a mile to the north of the village. For more walking ideas in the area see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/VNxWR1qA_K8",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}