{
  "created_at": "2025-01-06T04:55:30.549831+00:00",
  "objectID": "fa1d10090cc2e9b43b24f3267934f9cc",
  "ref": "charing-walking-route",
  "title": "Charing Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Charing_Windmill_-_geograph.org.uk_-_1266297.jpg/256px-Charing_Windmill_-_geograph.org.uk_-_1266297.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fa1d10090cc2e9b43b24f3267934f9cc.gpx",
  "_geoloc": {
    "lat": 51.2153408375,
    "lng": 0.7994602415
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Charing_Windmill_-_geograph.org.uk_-_1266297.jpg/256px-Charing_Windmill_-_geograph.org.uk_-_1266297.jpg",
      "title": "Paul / Charing Windmill",
      "caption": "Charing Windmill. Perched on the top of the North Downs"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/St_Peter%27s_Church%2C_Market_Place%2C_Charing%2C_Kent_-_geograph.org.uk_-_1393920.jpg",
      "title": "Oast House Archive / St Peter's Church, Market Place, Charing, Kent",
      "caption": "St Peter's Church, Market Place, Charing, Kent Grade I listed. The church's west tower was built in the 14th century, though most of the rest of the building was reconstructed following a catastrophic fire in the 16th century. The church contains a number of memorials to the Dering family, a branch of the Dering family of Surrenden Dering, Pluckley, Kent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Charing_Village_Centre_-_geograph.org.uk_-_251588.jpg",
      "title": "Colin Smith / Charing Village Centre",
      "caption": "Charing Village Centre. The lane, Pilgrims Court, is redolent of supposed passing traffic on the \"Pilgrims Way\" to Canterbury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Half-timbered_Cottage%2C_Charing_-_geograph.org.uk_-_251582.jpg",
      "title": "Colin Smith / Half-timbered Cottage, Charing",
      "caption": "Half-timbered Cottage. This mediaeval house is in the village's main street, The High."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Kissing_Gate_to_Charing_Alderbed_Meadow_-_geograph.org.uk_-_1326057.jpg",
      "title": "David Anstiss / Kissing Gate to Charing Alderbed Meadow",
      "caption": "Kissing Gate to Charing Alderbed Meadow. On the eastern side of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/The_Mill_House%2C_Westwell_-_geograph.org.uk_-_1502087.jpg",
      "title": "Oast House Archive / The Mill House, Westwell",
      "caption": "The Mill House, Westwell. To the left of the weatherboarded section is the stream and water wheel. Grade II listed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/North_Downs_Way_between_Charing_-_Westwell_-_geograph.org.uk_-_385438.jpg",
      "title": "David Kemp / North Downs Way between Charing - Westwell",
      "caption": "North Downs Way between Charing - Westwell. The North Downs Way is the track on the right. It runs through woods along the North Downs escarpment"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Archbishop%27s_Palace%2C_Charing%2C_Dec_2020.jpg/512px-Archbishop%27s_Palace%2C_Charing%2C_Dec_2020.jpg",
      "title": "Poliphilo, CC0, via Wikimedia Commons",
      "caption": "Archbishop's Palace, Charing. An important heritage site dating back to the eighth century, and one of the earliest to be owned by the see of Canterbury. The current palace dates back to the late thirteenth century with later additions and rebuilding, notably under Archbishop John Morton in the late fifteenth century who 'made great building at Charing'"
    }
  ],
  "distance_km": 11.0,
  "description": "This circular walk explores the countryside around the Kent village of Charing. The historic settlement is a fine place to start a walk with lots of trails taking you into the surrounding countryside of the Kent Downs. The village itself is also very interesting with an old windmill, a 14th century church and the 13th century Archbishop's Palace to see. The walk starts in the village where you can pick up the North Downs Way and follow the waymarked footpath south east past Dencher Wood and the woodland around Westwell Downs. You then come to Dunn Street where you turn south to visit the neighbouring village of Westwell. There's a picturesque old mill here with a waterwheel and pretty mill pond. The route then heads west along Westwell Lane where you could take a detour south to visit the nearby Hothfield Common. There's some nice trails here including the Greensand Way which runs through the area. This walk continues west past Lacton Manor before passing the remains of the Archbishop's Palace. The ancient site is said to contain the stone on which John the Baptist was beheaded. From here it is a short walk to return to Charing where the walk finishes by visiting the picturesque old windmill to the north of the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Waggon and Horses is a great choice for some post walk refreshment. They serve high quality dishes which you can enjoy in the lovely large garden area. You can find them on Faversham Rd, TN27 0NR."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails make for a fine dog walk. The Waggon and Horses pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At Westwell you could continue along the North Downs Way to Eastwell Park where there's a pretty lake and the remains of the old St Mary's Church to see. The village is also on the epic Pilgrims Way. Head west and you could visit the neighbouring village of Lenham. The worthy settlement includes a pretty square and a historic high street with a number of listed buildings. There's also a Grade I listed Tithe Barn, an early 1600s pub and a notable 14th century church to investigate. For more walking ideas in the area see the Kent Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_w5M4wL5PrA",
  "postcode": "TN27 0JS",
  "district": "Ashford",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pilgrims Way, Charing, Ashford, Kent, England, TN27 0JS, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "historic"
  ],
  "points_of_interest": [
    "windmill",
    "church",
    "palace",
    "common"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}