{
  "objectID": "fa7c642fb2f2afd87e863558f4708665",
  "created_at": "2024-12-18T15:45:34.768531+00:00",
  "ref": "coed-morgannwg-way-walking-route",
  "title": "Coed Morgannwg Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Above_Merthyr_tunnel_-_geograph.org.uk_-_994826.jpg",
  "nearby": [
    {
      "description": "Dare Valley Country Park",
      "objectID": "04f5e7253838075e9ff5f8d704552faa",
      "ref": "dare-valley-country-park-walking-and-cycle-route"
    },
    {
      "description": "Margam Country Park",
      "objectID": "0df63e29ff5a46dbd953a8b75eb0f7ca",
      "ref": "margam-country-park-walking-and-cycle-route"
    },
    {
      "description": "Afan Forest Park Country Park",
      "objectID": "d3198350da7fb9b053600f945943780a",
      "ref": "afan-forest-park-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/49080A049843E21D80257ACF0058E1FF/$FILE/Coed Morgannwg Way.gpx",
  "_geoloc": {
    "lat": 51.7211685487,
    "lng": -3.3748690464
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Above_Merthyr_tunnel_-_geograph.org.uk_-_994826.jpg",
      "title": "Graham Horn / Above Merthyr tunnel",
      "caption": "Above Merthyr tunnel. A forest road contours through forestry above Merthyr tunnel. This view north-east towards Merthyr in the distance is down an incline towards a quarry. It appears there may have been an inclined plane here before the tunnel was built."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Descent_to_Aberdare_-_geograph.org.uk_-_1016404.jpg",
      "title": "Graham Horn / Descent to Aberdare",
      "caption": "Descent to Aberdare. The Coed Morgannwg Way takes this gently descending path across the moors, cutting across the north-west corner of this square, which is mainly moorland. Aberdare is still out of sight in the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/From_Tarren_y_Bwllfa_-_geograph.org.uk_-_1018035.jpg",
      "title": "Graham Horn / From Tarren y Bwllfa",
      "caption": "From Tarren y Bwllfa. From the trail above the Tarren y Bwllfa crag, you get this fine view down Cwm Dar. Don't walk this direction though; the crags are just beyond the tussocky grass in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Pont_Lluest-wen_-_geograph.org.uk_-_1288675.jpg",
      "title": "Nigel Davies / Pont Lluest-wen",
      "caption": "Pont Lluest-wen over the Afon Rhondda Fach. The view from upstream. The bridge is now blocked to vehicles by large boulders but it still forms part of the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Towards_Cwm_Dar_-_geograph.org.uk_-_1018042.jpg",
      "title": "Graham Horn / Towards Cwm Dar",
      "caption": "Towards Cwm Dar. The immediate locality is sheep grazing moorland before dropping steeper towards Cwm Dar. The higher of its two small reservoirs can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Towards_Garn_Wen_-_geograph.org.uk_-_1016400.jpg",
      "title": "Graham Horn / Towards Garn Wen",
      "caption": "Towards Garn Wen. The double line of telegraph poles is clearly shown on the 1:25K map, making directly for a gap in the forestry at Garn Wen. This moorland and the forest on the left are all in the square. It is taken from the track of the Coed Morgannwg Way crossing the moors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Track%2C_Cwm_Philip_-_geograph.org.uk_-_1074153.jpg",
      "title": "eswales / Track, Cwm Philip",
      "caption": "Track, Cwm Philip Track in Margam Country Park striking out into Cwm Philip having left the area immediately surrounding Margam Castle. The track forms a small part of two long distance routes beginning here in Margam : the 57 km Coed Morgannwg Way which ends at Gethin Country Park near Merthyr Tydfil, and the 103 km St Illtyd's Walk ending at Pembrey Country Park in Carmarthenshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/View_toward_Coed_Morgannwg_Way_-_Mynydd_Blaen-nant-du_-_geograph.org.uk_-_1504348.jpg",
      "title": "Mick Lobb / View toward Coed Morgannwg Way - Mynydd Blaen-nant-du",
      "caption": "Mynydd Blaen-nant-du. Deforested peak of the mountain."
    }
  ],
  "distance_km": 58.0,
  "description": "This walk runs  from Merthyr Tydfil to Margam, through the four forests of Coed Morgannwg, the Cynon Valley and the Dare Valley. The walk starts at the Gethin Woodland Park in Merthyr Tydfil and heads west to Aberdare and the lovely Dare Valley Country Park with 500 acres of woodlands, pasture and moorland mountainside. You continue west passing Lluest Wen Reservoir before ascending Craig y Llyn mountain - the highest point in Glamorgan and in the South Wales Valleys. The views are wonderful with the lakes Llyn Fawr and Llyn Fawr at the base of the mountain. The route the descends through more woodland to Abercregan and then across the River Avan to the Afan Argoed Country Park. The final section takes you past Bryn and Mynydd Margam to the finish point at the splendid Margam Country Park. The attraction includes the magnificent Margam Castle, an 18th Century Orangery with ornamental gardens and the Deer Park, all set within 1000 acres of beautiful countryside. The walk is waymarked with a white footprint logo.",
  "video_url": "https://www.youtube.com/embed/A-c-BiqrMUc",
  "postcode": "CF48 1YZ",
  "county": "Merthyr Tudful - Merthyr Tydfil",
  "region": "Wales",
  "country": "Wales"
}