{
  "created_at": "2025-01-06T01:20:00.277466+00:00",
  "objectID": "fae9843b762a57748132fc749ebdb43c",
  "ref": "withens-clough-reservoir-walking-route",
  "title": "Withens Clough Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Looking_back_towards_Withins_Clough_Reservoir_-_geograph.org.uk_-_365769.jpg",
  "nearby": [
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Calderdale Way",
      "objectID": "96f0b565a2bbeec9d6d8b9b6775d477b",
      "ref": "calderdale-way-walking-route"
    },
    {
      "description": "Stoodley Pike",
      "objectID": "6f7a2d1454d650669c7764b76cf74ef1",
      "ref": "stoodley-pike-walking-route"
    },
    {
      "description": "Hebden Bridge",
      "objectID": "032b62035ea618e8df9cc2f5e8bb5791",
      "ref": "hebden-bridge-walking-route"
    },
    {
      "description": "Cragg Vale",
      "objectID": "0e73bc353be0902458aaf3b25baabf13",
      "ref": "cragg-vale-walking-route"
    },
    {
      "description": "Mytholmroyd",
      "objectID": "c8f70c1aca66efc31aa9fcf15890966f",
      "ref": "mytholmroyd-walking-route"
    },
    {
      "description": "Gaddings Dam",
      "objectID": "fdd7b41726f431ae74214eac1553de0a",
      "ref": "gaddings-dam-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fae9843b762a57748132fc749ebdb43c.gpx",
  "_geoloc": {
    "lat": 53.7058844954,
    "lng": -2.0212102066
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Looking_back_towards_Withins_Clough_Reservoir_-_geograph.org.uk_-_365769.jpg",
      "title": "Nigel Homer / Looking back towards Withins Clough Reservoir, via Wikimedia Commons",
      "caption": "Looking back towards Withen Clough Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Car_park_below_Withens_Clough_Reservoir_-_geograph.org.uk_-_785105.jpg",
      "title": "michael ely / Car park below Withens Clough Reservoir, via Wikimedia Commons",
      "caption": "Car park below Withens Clough Reservoir. Looking up Withens Lane from the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Buildings_Next_to_Withens_Clough_Reservoir._-_geograph.org.uk_-_502525.jpg",
      "title": "Steve Partridge / Buildings Next to Withens Clough Reservoir., via Wikimedia Commons",
      "caption": "Buildings Next to Withens Clough Reservoir. Originally these buildings were those of the dam keeper. Now a private residence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Withens_Moor_and_Withen_Clough_Reservoir_-_geograph.org.uk_-_336514.jpg",
      "title": "Phil Champion / Withens Moor and Withen Clough Reservoir, via Wikimedia Commons",
      "caption": "Withens Moor and Withen Clough Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Withens_Clough_-_geograph.org.uk_-_620091.jpg",
      "title": "michael ely / Withens Clough, via Wikimedia Commons",
      "caption": "The valley has been dammed here to form Withens Clough Reservoir. The dam wall can be seen on the skyline. Withens Clough is a tributary of Cragg Brook which, in turn, has its confluence with the River Calder in Mytholmroyd."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Withens_Clough%2C_Cragg_Vale_-_geograph.org.uk_-_388719.jpg/256px-Withens_Clough%2C_Cragg_Vale_-_geograph.org.uk_-_388719.jpg",
      "title": "Paul Glazzard / Withens Clough, Cragg Vale, via Wikimedia Commons",
      "caption": "Cragg Vale. Looking southwest along the beck at the northwest corner of Round Hill Wood, east of the Tenter Hill bridge. The beck running down from Withens Clough Reservoir joins with Cragg Brook just east of here at Marshaw Bridge."
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy an easy circular walk around this attractive reservoir in the south Pennines. There is a good footpath running around the perimeter of the water with great views of the pretty countryside of Withens Clough and the Stoodley Pike Monument. There is a parking area just to the east of the reservoir. Park here and then follow the Calderdale Way to the reservoir. The walk can be extended by following the Pennine Way to Stoodley Pike. Here you will find the Stoodley Pike monument, built in 1856 at the end of the Crimean War. You can climb the stairs of the monument to a viewing platform and enjoy wonderful views over Calderdale. You could also follow the Pennine Way south west and visit the nearby Warland Reservoir and White Holme Reservoir. The reservoir is located near to the towns of Todmorden and Hebden Bridge, a mile to the west of Cragg Vale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head east to The Hinchliffe Arms pub for some post walk refreshments. There's great food and a nice outdoor seating area to relax in at this walker/cyclist friendly pub. You can find it on Church Bank Ln, Cragg Vale, HX7 5TA. Also nearby is the Top Brink. The traditional original pub includes stone features, beamed ceilings, brassware & pottery, and a light airy large conservatory to the front with panoramic views. Outside there are several outside eating areas, including a large decked area and a lovely garden area with pretty flower baskets. It's a great place to relax and enjoy the countryside views with your meal. You can find the pub at Lumbutts just a short distance to the west of the reservoir. Postcode is OL14 6JB for your sat navs. Just to the east there's the The Hinchliffe Arms in Cragg Vale. They do really excellent food and also have outside seating and an outside veranda. The inn can be found at Church Bank Lane with a postcode of HX7 5TA for your sat navs. There is ample parking at the pub too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east of the reservoir and you could pay a visit to the interesting little village of Cragg Vale. It's known for The Cragg Vale Coiners, a band of counterfeiters that produced fake gold coins in the late 18th century to supplement small incomes from weaving. Just to the north you'll find Bell House Moor where the house of the leader of the Cragg Vale coiners can be seen. The Cragg Vale Walk starts from the village and visits the reservoir before climbing to the viewpoint at Turley Holes Edge. Just to the west you'll find the pretty Gaddings Dam. The small reservoir is notable for having the highest beach in Britain. For more walking ideas in the area see the South Pennines Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/R0jSui6wnh8",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Withens Clough Car Park, Rudd Lane, Hebden Royd, Cragg Vale, Calderdale, West Yorkshire, England, HX7 5TD, United Kingdom",
  "postcode": "HX7 5TD",
  "district": "Calderdale",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "viewpoints",
    "monuments",
    "countryside"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}