{
  "created_at": "2025-01-06T02:09:06.149823+00:00",
  "objectID": "fb653c91bbf118bf2b0443d99cea9ad4",
  "ref": "farthing-downs-walking-and-cycle-route",
  "title": "Farthing Downs Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Beeches%2C_Farthing_Downs%2C_Coulsdon_-_geograph.org.uk_-_1551658.jpg",
  "nearby": [
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Coulsdon South Circular Walk",
      "objectID": "95e7bce3414690121763e97fdf4550bb",
      "ref": "coulsdon-south-circular-walk-walking-route"
    },
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Happy Valley",
      "objectID": "2dc3ed4caab699a82b54afb81195c2e8",
      "ref": "happy-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fb653c91bbf118bf2b0443d99cea9ad4.gpx",
  "_geoloc": {
    "lat": 51.2985531157,
    "lng": -0.1346041431
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Beeches%2C_Farthing_Downs%2C_Coulsdon_-_geograph.org.uk_-_1551658.jpg",
      "title": "Dr Neil Clifton / Beeches, Farthing Downs, Coulsdon, via Wikimedia Commons",
      "caption": "Beeches, Farthing Downs, Coulsdon. This photograph shows that the oldest 'replacement' tree (left) is by now almost as tall as the sole surviving original (right)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/View_From_Farthing_Downs%2C_Surrey_-_geograph.org.uk_-_1387691.jpg",
      "title": "Peter Trimming / View From Farthing Downs, Surrey, via Wikimedia Commons",
      "caption": "View From Farthing Downs, Surrey. Looking towards the north. In the middle distance, roof tops at Coulsdon can be seen. In the far distance are the offices in the City of London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Young_beeches%2C_Farthing_Downs%2C_Coulsdon_-_geograph.org.uk_-_1551654.jpg",
      "title": "Dr Neil Clifton / Young beeches, Farthing Downs, Coulsdon, via Wikimedia Commons",
      "caption": "oung beeches, Farthing Downs, Coulsdon. In an attempt to restore the seven beech trees which once stood together at the highest point of Farthing Downs, beeches have been planted to replace the trees that have gone. The youngest two, seen here, have been fenced around with animal guards, as the Downs are grazed by sheep and cattle, but sadly the very youngest tree, (nearest the camera) has had its fencing vandalised and the young tree inside is not doing well. No 6 is fine as are the other four replacements 2-5, while the oldest tree is the sole survivor of the originals. In the photograph, the buildings on the horizon are the remains of Cane Hill Hospital (formerly Lunatic Asylum)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Happy_Valley%2C_Farthing_Downs%2C_Coulsdon_%2CSurrey_-_geograph.org.uk_-_868141.jpg",
      "title": "Dr Neil Clifton / Happy Valley, Farthing Downs, Coulsdon ,Surrey, via Wikimedia Commons",
      "caption": "Happy Valley, Farthing Downs, Coulsdon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Beeches_of_Farthing_Downs_-_geograph.org.uk_-_868178.jpg",
      "title": "Dr Neil Clifton / Beeches of Farthing Downs, via Wikimedia Commons",
      "caption": "Beeches of Farthing Downs Originally there were seven beeches here. Over the years they were gradually reduced to just two, and known for many years as the 'Twin Beeches'. Then in the 1990s one was destroyed by fire, so the decision was made to restore them to seven."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Afternoon_sun_on_Farthing_Downs_-_geograph.org.uk_-_1654306.jpg/512px-Afternoon_sun_on_Farthing_Downs_-_geograph.org.uk_-_1654306.jpg",
      "title": "Peter Trimming / Afternoon sun on Farthing Downs, via Wikimedia Commons",
      "caption": "Afternoon sun on Farthing Downs. The late afternoon sun drops behind the woods, near Netherne-on-the-Hill, Surrey. The temperature, at freezing point (or lower), was dropping too."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Winter_on_Farthing_Downs_-_geograph.org.uk_-_1655480.jpg/512px-Winter_on_Farthing_Downs_-_geograph.org.uk_-_1655480.jpg",
      "title": "Peter Trimming / Winter on Farthing Downs, via Wikimedia Commons",
      "caption": "Looking from the top of Farthing Downs, in the direction of Hooley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Footpath_-_geograph.org.uk_-_26039.jpg",
      "title": "Hywel Williams / Footpath, via Wikimedia Commons",
      "caption": "This footpath on Farthing Downs runs through an area of many tumuli."
    }
  ],
  "distance_km": 2.5,
  "description": "This large area of chalk grassland is located near Coulsdon in south London. It is crossed with various walking trails and bisected by National Cycle Route 20. The area is surrounded by attractive woodland and countryside. As such it's a nice place to go for a short cycle or walk in a large open space in south London. You can start the route from the car park at the southern end of the downs. Use the street view link below to virtually explore the downs from here! The whole of this route is designed for walkers but you can cycle through the area on Ditches Lane which runs through the centre of the site. The London Loop runs over the downs so there is scope for extending your walk on this long distance trail. You could head to the nearby Happy Valley Park where you will find Devilsden Wood and more chalk grassland with interesting flora such as the rare man orchid and round-headed rampion. Just beyond Happy Valley you will find Coulsdon Common which has some nice woodland walking trails to try. Our Coulsdon South Circular Walk starts from the nearby train station and visits the Downs, Couldson Common and Tollsworth Manor. It makes use of the North Downs Way which runs just to the south of Farthing Downs and is another good option for continuing your walking in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you follow the London Loop south east from the Downs you could visit Coulsdon Common where you'll find The Fox. Although most accounts of the pub's history come from the Victorian era, the Fox alehouse has been recorded at the same site on Coulsdon Common from as far back as 1720. You can soak up the sun in the beer garden, with plenty of seating, shaded tables and outdoor dining available. It's dog friendly with water and treats available too! You can find the pub next to the common at postcode CR3 5QS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The Downs are a popular spot for dog walking and you will probably see several other owners on your walk."
    }
  ],
  "video_url": "https://www.youtube.com/embed/neRMTe-nqJE",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ditches Lane, London Borough of Croydon, London, Greater London, England, CR5 1DF, United Kingdom",
  "postcode": "CR5 1DF",
  "district": "London",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature trails",
    "long distance trail"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}