{
  "objectID": "fb922606b779c86a40973f22a05f8aa8",
  "created_at": "2024-12-19T17:43:58.979323+00:00",
  "ref": "frogham-to-fritham-circular-walk-walking-route",
  "title": "Frogham to Fritham Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Abbots_Well_-_geograph.org.uk_-_2574954.jpg/512px-Abbots_Well_-_geograph.org.uk_-_2574954.jpg",
  "nearby": [
    {
      "description": "Fritham",
      "objectID": "1618e6bc4fb50f181976db6d09d30bfb",
      "ref": "fritham-walking-route"
    },
    {
      "description": "Latchmore Brook and Hasley Hill Inclosure",
      "objectID": "1a5304aea5b8925dffc8e0cbea306d3b",
      "ref": "latchmore-brook-and-hasley-hill-inclosure-walking-route"
    },
    {
      "description": "Fordingbridge",
      "objectID": "f6b8024033c64b8164b85712621b4eea",
      "ref": "fordingbridge-walking-route"
    },
    {
      "description": "Bramble Hill",
      "objectID": "722bea53b12925e3a579147381898b90",
      "ref": "bramble-hill-walking-route"
    },
    {
      "description": "Cadman's Pool",
      "objectID": "74ac829c1a2c74cf0a1f8e00f8123108",
      "ref": "cadmans-pool-walking-route"
    },
    {
      "description": "Bolderwood Deer Sanctuary",
      "objectID": "2f68923b09d298914b749b55675c8d63",
      "ref": "bolderwood-deer-sanctuary-walking-route"
    },
    {
      "description": "Godshill",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    },
    {
      "description": "Ashley Walk",
      "objectID": "b1a21754a420ef3adbe8adb4fd8b6500",
      "ref": "ashley-walk-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/24AF8B70BC9F88ED8625878B004B04F8/$FILE/Frogham to Fritham Circular Walk.gpx",
  "_geoloc": {
    "lat": 50.9148149517,
    "lng": -1.7485953302
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Abbots_Well_-_geograph.org.uk_-_2574954.jpg/512px-Abbots_Well_-_geograph.org.uk_-_2574954.jpg",
      "title": "Abbots Well by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Abbots Well"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Grazing_ponies_on_Hampton_Ridge%2C_New_Forest_-_geograph.org.uk_-_477417.jpg",
      "title": "Jim Champion / Grazing ponies on Hampton Ridge, New Forest",
      "caption": "Grazing ponies on Hampton Ridge. Heads down amongst the bracken on this northern side of Hampton Ridge, these ponies are doing what they spend most of their lives doing. Beyond is Long Bottom and the western end of Pitts Wood Inclosure, with Godshill Ridge beyond that. The heavy clouds brought rain a short time later."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Wet_cyclist_heading_for_Frogham%2C_Hampton_Ridge%2C_New_Forest_-_geograph.org.uk_-_478210.jpg",
      "title": "Jim Champion / Wet cyclist heading for Frogham, Hampton Ridge, New Forest",
      "caption": "Cyclist heading for Frogham, Hampton Ridge. From Ashley Cross this gravel off-road cycle track leads along Hampton Ridge to Frogham on the western edge of the Forest heathland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Path_on_Hampton_Ridge%2C_New_Forest_-_geograph.org.uk_-_477426.jpg/256px-Path_on_Hampton_Ridge%2C_New_Forest_-_geograph.org.uk_-_477426.jpg",
      "title": "Jim Champion / Path on Hampton Ridge, New Forest",
      "caption": "Path on Hampton Ridge. The thin acid heathland soil has been worn through to the bleached gravel stones beneath. The pink flowers are on bell heather, which grows amongst the common heather on the freely draining soil. In the distance, towards the left, are the trees on the southern edge of Pitts Wood Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Thompson%27s_Castle_from_Hampton_Ridge%2C_New_Forest_-_geograph.org.uk_-_158349.jpg",
      "title": "Jim Champion / Thompson's Castle from Hampton Ridge, New Forest",
      "caption": "A view of Thompson's Castle from the elevated position of Hampton Ridge. Thompson's Castle (in the foreground) is a spur projecting southwards from Hampton Ridge. In the distance are the green fields of Ogden's Farm on the western edge of the Forest. The well worn path leads down from the Castle to Latchmore Bottom. This is another New Forest placename that features the word \"castle\" which has nothing to do with a defensive compound (like Lucas Castle in SU2410)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Oak_trees_in_the_Amberwood_Inclosure%2C_New_Forest_-_geograph.org.uk_-_81065.jpg",
      "title": "Jim Champion / Oak trees in the Amberwood Inclosure, New Forest",
      "caption": "Oak trees in the Amberwood Inclosure. Late afternoon in autumn, the oaks in the Amberwood Inclosure are losing their leaves and the bracken is dying back in the cold weather. For some reason the inclosure is divided into two parts by a fence - the gate in this photo connects one part to the other."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Pony_grazing_on_Fritham_Plain%2C_New_Forest_-_geograph.org.uk_-_81109.jpg",
      "title": "Jim Champion / Pony grazing on Fritham Plain, New Forest",
      "caption": "Pony grazing on Fritham Plain. This pony was grazing alongside the gravelled track from Fritham to Holly Hatch Cottage. The heathland on this high plateau is showing its autumn colours and the pony blends in nicely in the afternoon sunshine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Ponies_grazing_at_Latchmore_Shade%2C_New_Forest_-_geograph.org.uk_-_156938.jpg",
      "title": "Jim Champion / Ponies grazing at Latchmore Shade, New Forest",
      "caption": "Ponies grazing at Latchmore Shade. This view is looking upstream at the Latchmoor Brook, with Hampton Ridge in the far distance. The name \"shade\" does not refer to a shady area (there are few trees on this wet heathland anyway), but instead it refers to something the ponies do: when they \"shade\" they stand out the heat of the day away from the undergrowth where insects are more of a nuisance. On a mild spring day such as this the ponies (and some cattle) are more likely to be grazing on the lawn rather than standing - food supplies are low and they have used up their fat reserves accumulated last year."
    }
  ],
  "distance_km": 14.4,
  "description": "This circular walk explores a lovely area of the New Forest between the village of Frogham and Fritham in Hampshire. The walk starts from the Abbots Well public car park on Hyde Common in Frogham. From here you can pick up footpaths heading east to up to the Hampton Ridge where there are some fine views over the area from the elevated position. You will pass Windmill Hill and Thompson's Castle before heading into the woodland of the Amberwood Inclosure. The route continues east to Hiscocks Hill and Gorley Bushes before coming to Fritham village. Here you could stop for some refreshments at the Royal Oak , roughly the half way point on the walk. The route then heads west across Fritham Plain, passing Freeworms Hill, the Sloden Inclosure, Deadbuck Hill, Hallickshole Hill and the Alderhill Inclosure. The final section passes along the pretty Latchmore Brook before returning to Hyde Common and the car park.",
  "video_url": "https://www.youtube.com/embed/7cM8iao9bxc",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}