{
  "created_at": "2025-01-06T08:30:56.352862+00:00",
  "objectID": "fbd0dfe88ab650b8a730d1bdcd0d1dc5",
  "ref": "salcombe-and-bolt-head-circular-walk-walking-route",
  "title": "Salcombe and Bolt Head Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/61/Salcombe_Harbour_-_geograph.org.uk_-_1589444.jpg",
  "nearby": [
    {
      "description": "Bolberry Down",
      "objectID": "501f480cd03edd4191a6fa3e6bc6525f",
      "ref": "bolberry-down-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Salcombe and Kingsbridge Estuary",
      "objectID": "3ce4882bca3b34dbfe55cd6d7cffcd6a",
      "ref": "salcombe-and-kingsbridge-estuary-walking-route"
    },
    {
      "description": "Prawle Point",
      "objectID": "97bdfc45b624dc269a08d3d312a508f2",
      "ref": "prawle-point-walking-route"
    },
    {
      "description": "Gara Rock",
      "objectID": "dde30304595b01503a373814cc7cc045",
      "ref": "gara-rock-walking-route"
    },
    {
      "description": "Loddiswell",
      "objectID": "ffce7186676628e9e8e86373e1b1f887",
      "ref": "loddiswell-walking-route"
    },
    {
      "description": "Blackdown Rings",
      "objectID": "821b8f70cc8cef88899d6166e4d2a774",
      "ref": "blackdown-rings-walking-route"
    },
    {
      "description": "Modbury",
      "objectID": "9a05e474780ed8bac7f2717d9d60900b",
      "ref": "modbury-walking-route"
    },
    {
      "description": "Aveton Gifford",
      "objectID": "9952b92b5315fbf21581d95cc77a7ad5",
      "ref": "aveton-gifford-walking-route"
    },
    {
      "description": "Soar Mill Cove",
      "objectID": "d33e96fcd6ba63c2675bd1b18427d287",
      "ref": "soar-mill-cove-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fbd0dfe88ab650b8a730d1bdcd0d1dc5.gpx",
  "_geoloc": {
    "lat": 50.2291535374,
    "lng": -3.7820075783
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Salcombe_Harbour_-_geograph.org.uk_-_1589444.jpg",
      "title": "Shaun Ferguson / Salcombe Harbour",
      "caption": "Salcombe Harbour From Cliff Road. Looking across Salcombe Harbour to the passenger ferry landing point at East Portlemouth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Coast_path_at_Bolt_Head_-_geograph.org.uk_-_2180310.jpg",
      "title": "Derek Harper / Coast path at Bolt Head",
      "caption": "Coast path at Bolt Head, 3 km from Salcombe, Devon, Great Britain. The South West Coast Path follows a permissive path west of the headland, climbing between crags to the limestone plateau above the coastal slope."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Overbeck%27s_and_view_of_Salcombe-geograph-2547578.jpg",
      "title": "Derek Harper / Overbeck's and view",
      "caption": "Overbeck's and view. Salcombe Footpath 18 offers this glimpse of the top lawn at the National Trust property, with the house on the left, and a view of Salcombe harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Salcombecastle2.JPG/256px-Salcombecastle2.JPG",
      "title": "Rodw / Public domain",
      "caption": "Salcombe castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Starehole_Bay_-_geograph.org.uk_-_491029.jpg",
      "title": "Tony Maguire / Starehole Bay",
      "caption": "Starehole Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Malborough%2C_above_Bolt_Head_-_geograph.org.uk_-_879415.jpg",
      "title": "Martin Bodman / Malborough: above Bolt Head",
      "caption": "Malborough: above Bolt Head Rock outcrops on the coast"
    }
  ],
  "distance_km": 8.5,
  "description": "This coastal circular walk takes you from Salcombe to the coastal headland at Bolt Head. There's much to enjoy with pretty bays, exhilarating cliff tops and a peaceful woodland section through Tor Woods towards the end of the route. The walk starts at the North Sands car park near to Salcombe Castle. The ruined castle is located on a rocky outcrop which is easily reached on foot at low tide. From here you pick up the South West Coast Path and follow it south through Collaton Wood to the beach at South Sands and Splatcove Point. Around here you will pass the Overbeck's Museum and Garden. The National Trust owned site includes a colourful subtropical garden, with exotic and rare plants surrounding the seaside home of scientist and inventor Otto Overbeck. There's great views over the estuary and coast from the gardens and an interesting museum with Overbeck's art and natural history collection together with a display of items relating to the maritime history of the area. After passing Overbeck's the route then heads through Fir Wood before following the coast path to Sharp Tor with views over Starehole Bay. This is the area where the Herzogin Cecilie ship ran aground in 1936. A dark patch of seaweed marks the site of the wreck. Shortly after Starehole Bay you come to Bolt Head where there are fabulous views along the coast. The area is great for wildlife with Dartmoor Ponies grazing on the cliffs. Also look out for birds including Fulmar, Shag, and Cormorants. From Bolt Head you head north west along the coast path towards Middle Soar where you turn right and head inland. The path then turns right again towards Tor Woods. These pretty woods contain lots of woodland flowers including bluebells, ramsons, wood sorrel and celadines. Look out for wildlife including Sika Deer as you make your way through this lovely area. After exiting the woods you arrive back at the coast where it is a short walk back to the car park. To extend your walking in the area you can continue north west along the coast path to Bolberry Down. This National Trust owned area has good surfaced paths, lots of pretty wildflowers and more great views. Just beyond Bolberry Down you will find Bolt Tail, the sister headland of Bolt Head. Just to the north east of the town you can explore the Salcombe and Kingsbridge Estuary and look out for dolphins, seals, basking sharks and a variety of wading birds. You can also catch the ferry over the estuary to East Portlemouth and follow the coast path to Prawle Point, the southernmost point of Devon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Salcombe the historic Ferry Inn is a fine place to enjoy refreshments after your walk. It's the most famous and oldest pub in Salcombe dating from 1739 when it was called \"the commercial inn\". They have a wonderful outdoor area where you can enjoy your meal with views over Salcombe Harbour to the surrounding countryside. You can find the inn on Fore Street with a postcode of TQ8 8ET for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal paths are a fine place for a dog walk and the Ferry Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At East Portlemouth you can pick up the circular Gara Rock Walk from the public car park. This area includes a fine cliff top hotel and a lovely secluded beach which you can access on a steep slope. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rYufOd7TNFs",
  "postcode": "TQ8 8LE",
  "district": "South Hams",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Woodlands, Cliff Road, Salcombe, South Hams, Devon, England, TQ8 8LE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint",
    "museum"
  ],
  "facilities": [
    "car park",
    "dog friendly",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}