{
  "created_at": "2025-01-06T04:28:30.305205+00:00",
  "objectID": "fbe69c0bd2345ed5bff3209ab46f1bde",
  "ref": "hod-hill-walking-route",
  "title": "Hod Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/26/Stourpaine%2C_Post_Office_and_pub_-_geograph.org.uk_-_258946.jpg",
  "nearby": [
    {
      "description": "Hambledon Hill",
      "objectID": "1c8969a67e3f43ad1c56c46ff4f8da7d",
      "ref": "hambledon-hill-walking-route"
    },
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "Wessex Ridgeway",
      "objectID": "43cab8ae3f5228bfec0a5cd93960fe13",
      "ref": "wessex-ridgeway-walking-route"
    },
    {
      "description": "Blandford Forum",
      "objectID": "8d7545b7b5624e04c20e9913e45a56b1",
      "ref": "blandford-forum-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fbe69c0bd2345ed5bff3209ab46f1bde.gpx",
  "_geoloc": {
    "lat": 50.884767872,
    "lng": -2.1984739929
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Stourpaine%2C_Post_Office_and_pub_-_geograph.org.uk_-_258946.jpg",
      "title": "michael ely / Stourpaine, Post Office and pub",
      "caption": "Stourpaine, Post Office and pub Situated on the A350 between Shaftesbury and Blandford Forum, Dorset. The pub is called The White Horse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/The_Village_of_Stourpaine_from_Hod_Hill_-_geograph.org.uk_-_1278856.jpg",
      "title": "Mike Searle / The Village of Stourpaine from Hod Hill",
      "caption": "The Village of Stourpaine from Hod Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Footpath_up_to_Hod_Hill_-_geograph.org.uk_-_238601.jpg",
      "title": "Kevin Young / Footpath up to Hod Hill",
      "caption": "Footpath up to Hod Hill. Photo shows a group of walkers on the steep uphill footpath entering the earthworks at Hod Hill Roman fort."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/River_Iwerne_-_geograph.org.uk_-_1425614.jpg",
      "title": "John Palmer / River Iwerne",
      "caption": "River Iwerne. For a few yards, the River Iwerne and the Green Lane descending from Hod Hill run delightfully together before entering Stourpaine separately"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Roman_fortifications%2C_Hod_Hill_-_geograph.org.uk_-_1425283.jpg",
      "title": "John Palmer / Roman fortifications, Hod Hill",
      "caption": "Roman fortifications, Hod Hill. The hill was captured in AD 43 by the Roman Second Legion (Augusta), led by Vespasian, who had already captured Maiden Castle and other hill forts to the south. The Romans built a camp in the north-west corner of the original fort, occupied by a mixed force of 720 legionaries and auxiliaries. The fort was used as a base for about 5 or 6 years, but passed out of use by about AD 50, when troops were withdrawn for the campaigns against Caractacus in Wales, and the remaining men were moved to a new fort further west at Waddon Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Ramparts_and_ditch%2C_Hod_Hill_-_geograph.org.uk_-_1425261.jpg",
      "title": "John Palmer / Ramparts and ditch, Hod Hill",
      "caption": "Ramparts and ditch. These great ramparts surround 54 acres of the top of Hod Hill. The hill was fortified by the Celtic Durotriges tribe in the Iron Age about 500 BC. Hod Hill was captured in AD 43 by the Roman Second Legion (Augusta), led by Vespasian, who had already captured Maiden Castle and other hill forts to the south. At the time the Augusta was based at Lake Farm fortress near Wimborne."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Green_lane_to_Stourpaine_-_geograph.org.uk_-_1425303.jpg",
      "title": "John Palmer / Green lane to Stourpaine",
      "caption": "Green lane to Stourpaine. The lane descends steeply from the hill to Stourpaine, and through its long history has become sunken below field level and lined with trees and vegetation"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/River_Stour_west_of_Hod_Hill_-_geograph.org.uk_-_645573.jpg",
      "title": "Jim Champion / River Stour west of Hod Hill",
      "caption": "River Stour. Looking downstream along the River Stour, to the west of the hill. The river makes a very abrupt change of direction where it meets the chalk \"island\" of Hod and Hambledon Hills, and has cut a steep cliff into the western side of the hill. The beech trees growing on the steep slope overhang the river."
    }
  ],
  "distance_km": 4.0,
  "description": "This circular walk climbs to the Hod Hill fort from Stourpaine in Dorset. The walk starts in the village of Stourpaine just to the south of the hill. From here you can pick up the Stour Valley Way and follow the waymarked trail north past the tranquil River Iwerne and on to the 143 metre (469 ft) chalk hill top. Here you'll find the site of the old Roman fortifications and fine countryside views from the hill's elevated position. The route then descends to Nutcombe Wood before picking up a riverside path along the Stour through Hod Wood. You then follow Hod Drive south east to return to Stourpaine. It's easy to extend the walk by continuing north to visit the nearby Hambledon Hill .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Stourpaine the White Horse is a fine choice for some post walk refreshment. The classic village pub dates from the early 18th Century and includes a bar, restaurant, shop, post office, games room, wood burning stoves & an open fire. Outside there's a covered outdoor decking area at the rear and a seating area out the front. They serve good quality food and can be found at postcode DT11 8TA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill, woods and country trails make for a fine dog walk. The White Horse mentioned above is also very dog friendly with water and treats available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the south is Blandford Forum where there some good riverside trails to try. To the west there's the picturesque old town of Sturminster Newton to explore. There's nice riverside trails along the Stour Valley Walk and the historic Sturminster Mill to visit here. To the south west there's another climb to Okeford Hill to try. There's more great views here and some popular mountain bike trails for cyclists as well. The epic Wessex Ridgeway can be picked up on the hill too. To the north is the pretty village of Compton Abbas where you can visit Fontmell and Melbury Downs, Compton Abbas Airfield and the highest point in the Cranborne Chase AONB at Win Green Hill. For more walking ideas in the area see the Cranborne Chase Walks and Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/H6RUU_8suWA",
  "postcode": "DT11 8TG",
  "district": "Stourpaine",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "South Holme, Stourpaine, Dorset, England, DT11 8TG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "countryside views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}