{
  "created_at": "2025-01-06T03:51:47.332355+00:00",
  "objectID": "fc04a0909362c2792f3dd92f8ed3451c",
  "ref": "bishop-auckland-walking-route",
  "title": "Bishop Auckland Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Jock%27s_Bridge_Bishop_Auckland_-_geograph.org.uk_-_138903.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fc04a0909362c2792f3dd92f8ed3451c.gpx",
  "_geoloc": {
    "lat": 54.664751703,
    "lng": -1.6802116022
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Jock%27s_Bridge_Bishop_Auckland_-_geograph.org.uk_-_138903.jpg",
      "title": "Ken Crosby / Jock’s Bridge Bishop Auckland",
      "caption": "Jock's Bridge Bishop Auckland. This is where the River Gaunless joins the River Wear"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Bishop_Auckland_-_geograph.org.uk_-_482065.jpg",
      "title": "leon / Bishop Auckland",
      "caption": "A pleasant riverside footpath along the River Wear to the north west of the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Bishop_Auckland_Castle_-_geograph.org.uk_-_10467.jpg",
      "title": "John Phillips / Bishop Auckland Castle",
      "caption": "Bishop Auckland Castle. In 1832, this castle replaced Durham Castle as the official residence of the Bishops of Durham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Entrance_to_Auckland_Castle_-_geograph.org.uk_-_1737838.jpg/512px-Entrance_to_Auckland_Castle_-_geograph.org.uk_-_1737838.jpg",
      "title": "Philip Barker / Entrance to Auckland Castle",
      "caption": "Entrance to Auckland Castle This photograph shows a view of the entrance to Auckland Castle in Bishop Auckland. The picture was taken looking in an easterly direction towards Auckland Park golf course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Auckland_Castle_-_Chapel.jpg/512px-Auckland_Castle_-_Chapel.jpg",
      "title": "I, Pit-yacker / CC BY-SA (http://creativecommons.org/licenses/by-sa/3.0/)",
      "caption": "The wonderful architecture of the Chapel at Auckland Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Hunwick_Gill_-_geograph.org.uk_-_75709.jpg/256px-Hunwick_Gill_-_geograph.org.uk_-_75709.jpg",
      "title": "Uncredited / Hunwick Gill",
      "caption": "Hunwick Gill north of Bishop Auckland. The footpath from Willington to Bishop Auckland crosses the Hunwick Gill at the point where it flows into the River Wear."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Binchester_Roman_Fort.jpg",
      "title": "John Phillips / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Binchester Roman Fort. This is located on the eastern side of the river north of the town and dates back to 75AD. There are two remarkably well preserved remains of two bath houses to see here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/The_Station_Masters_House_%2C_Hunwick_-_geograph.org.uk_-_317374.jpg",
      "title": "Hugh Mortimer / The Station Masters House : Hunwick",
      "caption": "The Station Masters House, Hunwick. Part of the original Hunwick Station, opened in 1857 by the North Eastern Railway. A branch line to the north east ran to Hunwick Colliery. The trackbed is now part of the Brandon/Bishop Auckland Way."
    }
  ],
  "distance_km": 7.0,
  "description": "This fine town in County Durham has some excellent walking opportunites with the River Wear and River Gaunless running through the town. There's also the expansive parkland surrounding the splendid castle and plenty of attractive country walks in the surrounding countryside. This circular walk around Bishop Auckland makes use of the Brandon - Bishop Auckland Walk and Weardale Way long distance paths. It also visits the historic Auckland Castle and park which is one of the highlights of the area. Start the walk in the town centre and then follow the Brandon - Bishop Auckland Walk north out of the town along a disused railway path. It takes you to the River Wear where you can enjoy waterside paths south of Willington. In this area you will also pass the picturesque Hunwick Gill where there are pretty waterfalls at the point where it flows into the Wear. At Hunwick you can then follow the Weardale Way long distance trail back towards the town. On the way back the route heads east along the river to visit Auckland Castle and Jock's Bridge over the river. For a fee you can explore the castle grounds which include a deer park, a walled garden, woodland trails and river paths. Other walks around the town include the Auckland Walk which takes you along a disused railway line to Spennymoor. If you head west out of the town along the Weardale Way you can visit Marston Lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off at The Bishop’s Kitchen at Auckland Castle. Here you can choose to eat in the beautifully refurbished medieval kitchen, or in the pretty courtyard garden."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails on the route make for a fine dog walk. Dogs are welcome in the castle deer park and in the garden area of the associated cafe. If you fancy a pub then The Green Tree is a good option. The friendly pub has a good selection of ales and a nice garden area for warmer weather. You can find it at 13 Cockton Hill Rd with a postcode of DL14 6EN for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east from the town and you will find the noteworthy town of Sedgefield. The attractive town has a village feel with a fine medieval church and a number of 18th century houses surrounding a pretty green. The Sedgefield Walk will take you to the splendid Hardwick Hall Country Park before visiting the site of Bishop Middleham Castle and Castle Lake. The hall's beautiful grounds are one of the highlights of the area and the Castle Lake is a fine place for birdwatching, especially during the warmer months. Just to the west there's the Low Barns Nature Reserve in Witton-le-Wear. The wetland reserve includes a series of pretty lakes, boardwalks, woodland and lots of wildlife to look out for. For more walking ideas in the area see the County Durham Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/eWVUdqnPACM?start=28",
  "county": "County Durham",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}