{
  "created_at": "2025-01-06T03:21:04.507807+00:00",
  "objectID": "fc42553278d5e20a9a9fb7994fbc2f18",
  "ref": "hinckley-walking-route",
  "title": "Hinckley Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/25/Ashby_Canal%2C_Hinckley_-_geograph.org.uk_-_660563.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fc42553278d5e20a9a9fb7994fbc2f18.gpx",
  "_geoloc": {
    "lat": 52.5329957211,
    "lng": -1.396314
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Ashby_Canal%2C_Hinckley_-_geograph.org.uk_-_660563.jpg",
      "title": "Mat Fascione / Ashby Canal, Hinckley",
      "caption": "Ashby Canal, Hinckley. In the distance is Coventry Road Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/The_Lime_Kilns%2C_nr._Hinckley_-_geograph.org.uk_-_162092.jpg",
      "title": "Stephen McKay / The Lime Kilns, nr. Hinckley",
      "caption": "The Lime Kilns, nr. Hinckley. This canalside pub stands at the point where the Ashby de la Zouch Canal is crossed by the A5."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Ashby_Canal_in_Hinckley_-_geograph.org.uk_-_659641.jpg",
      "title": "Mat Fascione / Ashby Canal in Hinckley",
      "caption": "These flats are part of a new build on Canal Way in Hinckley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/The_Ashby_Canal_at_Marston_Junction%2C_Warwickshire_-_geograph.org.uk_-_1136877.jpg",
      "title": "Roger Kidd / The Ashby Canal at Marston Junction, Warwickshire",
      "caption": "The Ashby Canal at Marston Junction, Warwickshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Hinckley_Town_Museum_-_geograph.org.uk_-_403498.jpg",
      "title": "Roy William Shakespeare / Hinckley Town Museum",
      "caption": "Hinckley Town Museum. Housed in 2 former Frame Knitter's cottages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/St_Mary%27s_Church_Hinckley_from_south_east.jpg/256px-St_Mary%27s_Church_Hinckley_from_south_east.jpg",
      "title": "St Mary's Church Hinckley / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "St Mary's Church. A noteworthy church dating back to the 13th century"
    }
  ],
  "distance_km": 12.5,
  "description": "This historic market town is located in southwest Leicestershire close to Nuneaton. There's nice walks in the town in Hollycroft Park and along the Ashby Canal which runs just to the west. In the town historical landmarks include the interesting Hinckley Museum which is housed in a range of 17th-century timber-framed framework knitters' cottages. In the 19th century the town was responsible for a large proportion of Britain's hosiery production. Also of interest is a fine medieval church dating from the 13th century. It is a Grade II* listed building and includes a coffee bar in the North tower. This route uses part of the Ashby Canal and the waymarked Nuneaton Circular Walk to create a circular walk to the west of the town. Start the walk on the canal, just to the west of the town centre and the train station. You then follow the towpath south to the village of Burton Hastings and then on to Bramcote Wharf and Marston Junction. This is the point where the Ashby Canal meets with the Coventry Canal. Here the route leaves the canal to pick up the Nuneaton Rotary Circular Walk and follow the trail north through Whitestone to the countryside to the east of the town. Here you pick up Hydes Lane and follow it north east back to the canal in Hinckley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Lime Kilns is located on the canal close to the start of the walk. You can sit outside in the garden area and watch the boats go by with your meal. They have a fine selection of home made pies and real ales to enjoy. You can find them on Watling Street with a postcode of LE10 3ED for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canal and country trails make for a nice walk with your pet and the Lime Kilns pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Hinckley head east of the town and you will soon come to Burbage Common. There some peaceful woodland trails here with lots of woodland birds to look out for. You can also pick up the long distance Leicestershire Round here. Head north and you will find Bosworth Battlefield Country Park. There are a series of good trails here and the Bosworth Battlefield Heritage Centre which tells the dramatic story of the Battle of Bosworth of 1485. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "postcode": "LE10 3EJ",
  "district": "Hinckley and Bosworth",
  "county": "Leicestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Nutts Lane, Hinckley, Hinckley and Bosworth, Leicestershire, England, LE10 3EJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "rural"
  ],
  "points_of_interest": [
    "historical landmarks",
    "canals",
    "countryside"
  ],
  "facilities": [
    "coffee bar",
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}