{
  "created_at": "2025-01-06T00:51:31.092668+00:00",
  "objectID": "fcc066d5b874684a707fbe6425418999",
  "ref": "upper-wharfedale-walking-route",
  "title": "Upper Wharfedale Wildlife Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/The_bridge_over_the_Wharfe_at_Buckden_-_geograph.org.uk_-_834525.jpg",
  "nearby": [
    {
      "description": "Dales Way",
      "objectID": "605d1dad48e02d248ecb985988bc777c",
      "ref": "dales-way-walking-route"
    },
    {
      "description": "Buckden Pike",
      "objectID": "b81550203a12512733f3fc4e818f7155",
      "ref": "buckden-pike-walking-route"
    },
    {
      "description": "Buckden Pike Short Waterfall Walk",
      "objectID": "c142a3ec05bbaafc5560bd11a383d16e",
      "ref": "buckden-pike-short-waterfall-walk-walking-route"
    },
    {
      "description": "Hubberholme",
      "objectID": "e707dae8bdcc9d9d28c02ed63caff249",
      "ref": "hubberholme-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fcc066d5b874684a707fbe6425418999.gpx",
  "_geoloc": {
    "lat": 54.1913213766,
    "lng": -2.090233772
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/The_bridge_over_the_Wharfe_at_Buckden_-_geograph.org.uk_-_834525.jpg",
      "title": "richard / The bridge over the Wharfe at Buckden",
      "caption": "The bridge over the Wharfe at Buckden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Kirkgill_Manor_-_geograph.org.uk_-_550134.jpg",
      "title": "John Illingworth / Kirkgill Manor",
      "caption": "Hubberholme Kirkgill Manor. Rebuilt in 1893 by Bishop Heber from a farmhouse owned by his family. For many years it was the Hubberholme vicarage. It is now an upmarket B&B. Bishop Heber was the author of the hymn \"From Greenland's Icy Mountains\". The lozenge-shaped stone plaque at the left-hand end of the frontage commemorates him."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Yockenthwaite_Stone_Circle_-_geograph.org.uk_-_549996.jpg",
      "title": "John Illingworth / Yockenthwaite Stone Circle",
      "caption": "Yockenthwaite Stone Circle. A small (25' diameter) Bronze Age stone circle on the route of the Dales Way. Current thinking is that the stones once formed the kerb of a burial cairn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Limestone_outcrops_above_Strans_Wood_-_geograph.org.uk_-_893159.jpg",
      "title": "Gordon Hatton / Limestone outcrops above Strans Wood",
      "caption": "Limestone outcrops above Strans Wood. The lower slopes in Langstrothdale are typical limestone country with thin soils and much bare rock. Each outcrop of limestone is like a mini nature reserve with many different wild flowers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Cray_Gill_Waterfall.jpg",
      "title": "Arnold Price, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cray Gill Waterfall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Upper_Wharfedale_-_geograph.org.uk_-_1351589.jpg/512px-Upper_Wharfedale_-_geograph.org.uk_-_1351589.jpg",
      "title": "Ian Greig, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Upper Wharfedale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Scar_House_-_geograph.org.uk_-_556523.jpg",
      "title": "Peter McDermott / Scar House",
      "caption": "Scar House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Footpath_beside_River_Wharfe_near_Yockenthwaite_-_geograph.org.uk_-_1490471.jpg",
      "title": "Chris Wimbush / Footpath beside River Wharfe near Yockenthwaite",
      "caption": "Footpath beside River Wharfe near Yockenthwaite"
    }
  ],
  "distance_km": 11.5,
  "description": "This circular walk explores Upper Wharfedale and Langstrothdale in the Yorkshire Dales National Park. It's a varied and stunning area with glacial valleys, limestone scenery, gills, rivers, waterfalls and woodland to enjoy. It's also great for flora and fauna with numerous wildflowers attracting a wide variety of butterflies during the warmer months. Look out for birds including yellow wagtail in the meadows and kingfishers along the river. The walk starts at Buckden where there is a public car park in the village centre. From here you can pick up the Dales Way and follow the waymarked footpath north west along the River Wharfe. The trail will take you to Hubberholme and Yockenthwaite where you can take a small detour to visit the Yockenthwaite stone circle and cave. From Yockenthwaite you follow trails east to Scar House and Hay Close. This section runs along woodland with a series of waterfalls to see on the way. Near Cray Bridge you turn south and follow Buckden Rake back to Buckden.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Buckden village you could head to the Buck Inn for some post walk refreshment. The fine Georgian coaching inn now has an attractive contempary interior. There's also outdoor seating with nice views of the village and surrounding countryside. You can find them at postcode BD23 5JA for your sat navs. In Hubberholme you could enjoy a pit stop at the noteworthy George Inn. It's an historic Grade II listed pub dating back to the 1600s. The white-washed building has mullioned windows, thick stone walls, heavy oak beams and flagged floors. The pub is well known for the lit candle that sits on the bar to indicate the pub is open and serving. The tradition dates from auctions for agricultural land or grazing that are still held in The George. The last bid to be received before the candle extinguished is the winner. The pub is thought to have been a local haunt of author JB Priestley who loved the village and its surroundings. Priestley is probably best known for his play 'An Inspector Calls'. The pub serves good quality food and is particularly known for its delicious homemade pies. It sits just opposite the Norman church which is well worthy of some investigation."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland country and river trails make for a fine dog walk and the Buck Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east of Buckden you can enjoy the climb to Buckden Pike. It's considered to be one of the finest climbs in Yorkshire with its splendid views over the beautiful Wharfedale and the Nidderdale AONB. For a more direct route to the summit you could try the Buckden Pike Short Waterfall Walk. This takes you along the waterfalls of the Buckden Beck to the hill top. The circular Hubberholme Walk will take you to Langstrothdale and the small village of Cray where there's nice views of the Cow Ghyll and the picturesque Cray Waterfalls. There's also the noteworthy White Lion pub, the highest inn in Wharfedale here. For more walking ideas in the area see the Nidderdale Walks and Yorkshire Dales Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/9DHm9J60QIE",
  "district": "Buckden",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Buckden, North Yorkshire, York and North Yorkshire, England, BD23 5JX, United Kingdom",
  "postcode": "BD23 5JX",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "valley"
  ],
  "points_of_interest": [
    "historical sites",
    "wildflowers",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}