{
  "created_at": "2025-01-06T01:14:30.762200+00:00",
  "objectID": "fcf81af491ad8349318d692e78f4582e",
  "ref": "beacon-wood-country-park-walking-route",
  "title": "Beacon Wood Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/84/Railway_Wagon_in_Beacon_Wood_Country_Park_-_geograph.org.uk_-_1264060.jpg",
  "nearby": [
    {
      "description": "Darenth Country Park",
      "objectID": "ca76f114f4bbdd665ca806615ad878bf",
      "ref": "darenth-country-park-walking-and-cycle-route"
    },
    {
      "description": "Darent Valley Path",
      "objectID": "36e7fb5e4f927dfaec7f70ff6239a05d",
      "ref": "darent-valley-path-walking-route"
    },
    {
      "description": "Greenwich to Gravesend",
      "objectID": "24a8b22c5efbf866f972051f8dfb657a",
      "ref": "greenwich-to-gravesend-cycle-route"
    },
    {
      "description": "Dartford Heath",
      "objectID": "c33e818afeceeee7abf8a552a415d852",
      "ref": "dartford-heath-walking-route"
    },
    {
      "description": "Gravesend",
      "objectID": "bc70c1dda6240ee99f8db14aa45d0286",
      "ref": "gravesend-walking-route"
    },
    {
      "description": "Greenhithe",
      "objectID": "8aca13791935820c6fac5573afa07d8d",
      "ref": "greenhithe-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fcf81af491ad8349318d692e78f4582e.gpx",
  "_geoloc": {
    "lat": 51.4215487288,
    "lng": 0.2890633918
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Railway_Wagon_in_Beacon_Wood_Country_Park_-_geograph.org.uk_-_1264060.jpg",
      "title": "David Anstiss / Railway Wagon in Beacon Wood Country Park, via Wikimedia Commons",
      "caption": "Railway Wagon in Beacon Wood Country Park. Seen beside footpath in wood. Has metal sign on post in front which reads '2ft Gauge Hudson Railway Wagons. Commonly used on industrial sites. The 'brick cars' were operated by Ibstock Building Products in Sevenoaks. The side tipping 'skip wagon worked in sand quarries at Leighton Buzzard, Bedfordshire. But is typical of the type used in the Bean clay pit unitl the mid 1960's. Donated in Spring 1993'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Beacon_Wood_Country_Park%2C_Bean_-_geograph.org.uk_-_1402834.jpg",
      "title": "Stacey Harris / Beacon Wood Country Park, Bean, via Wikimedia Commons",
      "caption": "Beacon Wood Country Park, Bean. The information board and map in the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/The_Black_Horse_public_house%2C_Bean_-_geograph.org.uk_-_1402829.jpg",
      "title": "Stacey Harris / The Black Horse public house, Bean",
      "caption": "The Black Horse public house, Bean"
    }
  ],
  "distance_km": 1.5,
  "description": "This country park has a number of peaceful woodland walks to enjoy. It is located near Gravesend in Kent. In the park you will find a pond/wetland area with a viewing platform, information point, and views out over the countryside. The woods are particularly lovely in the autumn where there are lots of mushrooms and fungi to look out for. The route below begins at the car park in Beacon Wood and follows woodland trails around the site. You can extend your walk by following public footpaths into the nearby Lords Wood, Ladies Wood and on into the nearby Darenth Country Park. It's located about a mile to the west and consists of nice wide lawns, picnic areas, meadows and pockets of woodland. In Darenth you can also pick up the Darent Valley Path and enjoy a riverside walk along the River Darent.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Stroll into Bean village and you can enjoy some post walk refreshments in the Black Horse. The pub has a lovely large garden area with BBQ's in the warmer months. It's a great place to relax with a meal on a summer day. They do good food and have a few nice ales as well. You can find them just north of the park on Bean High Street with a postcode of DA2 8AS for your sat navs. They also have a good sized parking area."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is ideal for dog walking with miles of good woodland trails to explore. The Black Horse pub in nearby Bean is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles west of the park and you'll find more nice trails on Dartford Heath. The 300 acre heath includes a series of ponds, peaceful woodland, pretty heather and lots of wildlife to look out for. You could head into the nearby town of Gravesend and enjoy walks along the Thames Estuary. The Gravesend Walk will take you to the RSPB's Cliffe Pools Nature Reserve where there's great birdwatching opportunites and lovely waterside footpaths. In Gravesend there's also a noteworthy 13th century riverside pub to visit. To the north there's Greenhithe where you can visit the historic Ingress Abbey heritage park. The park includes a photogenic Neo-gothic Jacobean-style country house surrounded by attractive parkland and a number of follies.  For more walking ideas in the area see the Kent Walks page."
    }
  ],
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beacon Wood Country Park, Southfleet Road, Bean, Dartford, Kent, England, DA2 8AR, United Kingdom",
  "postcode": "DA2 8AR",
  "district": "Dartford",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "views",
    "wildlife spotting"
  ],
  "facilities": [
    "car park",
    "information point",
    "picnic areas"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}