{
  "created_at": "2025-01-06T02:24:55.929271+00:00",
  "objectID": "fd1abb3826947ab55237648f2e77ca33",
  "ref": "tatton-park-walking-and-cycle-route",
  "title": "Tatton Park Walk and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/46/Tatton_Mere_%28Tatton_Park%29_-_geograph.org.uk_-_78592.jpg",
  "nearby": [
    {
      "description": "Rostherne Mere",
      "objectID": "96e417824d0db9a655a87eeb23dd6103",
      "ref": "rostherne-mere-walking-route"
    },
    {
      "description": "Styal Country Park",
      "objectID": "f4527767dbde93119c5270f9aa0ef3bc",
      "ref": "styal-country-park-walking-route"
    },
    {
      "description": "Lower Peover",
      "objectID": "06aa44113e6dd94e3146b95fb127c32b",
      "ref": "lower-peover-walking-route"
    },
    {
      "description": "Shakerley Mere",
      "objectID": "5d8e310fb3f3df037f5c2a948dcd5dc3",
      "ref": "shakerley-mere-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fd1abb3826947ab55237648f2e77ca33.gpx",
  "_geoloc": {
    "lat": 53.3308230954,
    "lng": -2.3881127655
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Tatton_Mere_%28Tatton_Park%29_-_geograph.org.uk_-_78592.jpg",
      "title": "Ian Warburton / Tatton Mere (Tatton Park)",
      "caption": "Tatton Mere (Tatton Park) Looking north (Taken from 'Dog Wood )"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Lake_in_Tatton_Park_-_geograph.org.uk_-_19787.jpg",
      "title": "Gary Rogers / Lake in Tatton Park",
      "caption": "Lake in Tatton Park. The smaller of two lakes (Melchett Mere) in the area lies in the south west corner of the grid square. Picture taken looking south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Home_Farm%2C_Tatton_Park_-_geograph.org.uk_-_687829.jpg/256px-Home_Farm%2C_Tatton_Park_-_geograph.org.uk_-_687829.jpg",
      "title": "Chris Allen / Home Farm, Tatton Park",
      "caption": "Home Farm. This complex was originally steam powered and the National Trust installed a horizontal single cylinder engine that had come via a private collector from the Colne Vale Dye & Chemical Co, Milnsbridge. I saw it running there in 1980."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Entrance_to_Tatton_Park%2C_Cheshire-geograph-5184336.jpg",
      "title": "JThomas / Entrance to Tatton Park",
      "caption": "Entrance to Tatton Park. Off Ashley Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Tatton_Hall_-_geograph.org.uk_-_1000685.jpg",
      "title": "David Long / Tatton Hall",
      "caption": "Tatton Hall. This side of the house can be seen in the episode \"The Greek Interpreter\" (1985) from the tv series \"The Adventures of Sherlock Holmes\", in the film \"The Hound of the Baskervilles\" (1988), in the tv episodes \"Shoscombe Old Place\" (1991), \"The Master Blackmailer\" (1992) and \"The Eligible Bachelor\" (1993) from the series The Case-Book of Sherlock Holmes and in \"The Three Gables\" (1994) from The Memoirs of Sherlock Holmes, all starring Jeremy Brett as Sherlock Holmes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Marble_Bench_in_Tatton_Park_Tower_Garden-geograph-3984125.jpg",
      "title": "David Dixon / Marble Bench in Tatton Park Tower Garden",
      "caption": "Marble Bench in Tatton Park Tower Garden. This semi-circular Verona marble bench with ends in the form of winged lions is at the edge of the Tower Garden."
    }
  ],
  "distance_km": 8.5,
  "description": "Explore the wonderful 1000 acre deer park on this walk or cycle in Knutsford, Cheshire. The route takes you around Tatton Hall, Tatton Mere and the beautiful Italian and Japanese gardens (see video below). Also of interest is the rare-breed farm with cattle, horses, sheep, pigs, goats and donkeys to see up close. Tatton Park was the winner of Cheshire's Large Visitor Attraction of the Year 2009 and 2010. Cycles can be hired in the park for reasonable rates too.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the on site Stables cafe for some post exercise refreshments. The cafe offers self-service style dining with a menu focused on using Estate meats and harvest where possible and home grown, home made, seasonal produce."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The expansive park is ideal for a dog walk. There are off lead area but please keep your dog under control because of the resident deer."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of the park you will find the lovely Rostherne Mere. The pretty mere is a nice place to extend your outing with a picturesque natural lake in peaceful surroundings. The area is also a designated nature reserve where you can look out for a variety of wildfowl on the water. The mere is located less than a mile north of Tatton Hall so easily reached on foot or by bike from the park. If you head a short distance east you could try the Mobberley Walk. The nearby village is well worth a visit with historic buildings and some excellent pubs to investigate. Just a few miles east of the park there's another fine National Trust property at Styal Country Park and Woods. The popular park includes woodland trails along the River Bollin and the historic Quarry Bank Mill. Just a few miles to the south there's Lower Peover where you can visit the Grade I listed church and enjoy a walk to Peover Hall. The 16th century country manor includes beautiful gardens which are open to the public on certain days. Just over a mile south of the village there's something of a hidden gem at Shakerley Mere. The pretty lake includes a 1 mile circular trail, lots of wildlife and pleasant woodland trails. There's also a fine 300 year old pub for refreshments after your exercise. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BJ3rMmdo__0",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mereheath Drive, Millington and Rostherne, Mere, Cheshire East, England, WA16 6SJ, United Kingdom",
  "postcode": "WA16 6SJ",
  "district": "Mere",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake",
    "garden"
  ],
  "points_of_interest": [
    "historical sites",
    "farmland",
    "gardens"
  ],
  "facilities": [
    "car park",
    "cycle hire",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}