{
  "created_at": "2025-01-06T18:44:26.241727+00:00",
  "objectID": "fd2a2281558033bc6b5223914aab503c",
  "ref": "keem-bay-walking-route",
  "title": "Keem Bay Hike Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Keem_Strand%2C_Achill_Island_-_geograph.org.uk_-_23186.jpg?20100130032819",
  "nearby": [
    {
      "description": "Achill Island",
      "objectID": "eebaae9f2904df8bcf7f7ac51c912cd5",
      "ref": "achill-island-walking-route"
    },
    {
      "description": "Dooagh Loop Walk",
      "objectID": "a11c2d073f98097c5398161d2f049df0",
      "ref": "dooagh-loop-walk-walk"
    },
    {
      "description": "Minaun Heights",
      "objectID": "061297544bc8f3500a0138d2d2cce3cd",
      "ref": "minaun-heights-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fd2a2281558033bc6b5223914aab503c.gpx",
  "_geoloc": {
    "lat": 53.96933,
    "lng": -10.19378
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Keem_Strand%2C_Achill_Island_-_geograph.org.uk_-_23186.jpg?20100130032819",
      "title": "Bruce Hall / Keem Strand, Achill Island",
      "caption": "Keem Strand, Achill Island. During the 19th century, the British government established a lifeboat station on Keem Beach. The lifeboat station was operational for over 100 years providing a vital service for those who lived and worked on the coast. The bay was used as a filming location for the 2022 film The Banshees of Inisherin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Keem_Bay%2C_Achill_Island_Co._Mayo%2C_Ireland_-_geograph.org.uk_-_683771.jpg?20110208015358",
      "title": "Mike Shinners / Keem Bay, Achill Island Co. Mayo, Ireland",
      "caption": "The bay lies at the head of a valley between the cliffs of Benmore to the west and Croaghaun mountain on the east. At the southern end of the valley, the beach is sheltered to the west by Moyteoge Head, while at the northwestern end of the valley the cliffs of Benmore connect with the spectacular mile long promontory of Achill Head. This spar is the most westerly point on Achill and tails off with two sea stacks called Gaoí Saggart and Carrickakin. Keem is accessible for cars via a clifftop road that was constructed in the 1960s along the route of an older track. This road also crosses a local geological boundary, exposing a seam of amethyst quartz in the cliffside. Amethyst is a semiprecious stone with a magnificent purple to voilet coloration, said in folklore to have a number of properties including as a love charm, as protection against thieves and drunkeness, and as an aide to sleep. Keem Bay was traditionally used by fishermen on Achill Island and is undoubtedly the location of the artist Paul Henry's famous painting 'Launching the Currach' (1910, on display in the National Gallery of Ireland)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Keem_Bay_from_Croghaun_-_geograph.org.uk_-_5813604.jpg?20231126191548",
      "title": "Keem Bay from Croghaun by Mick Garratt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Keem Bay from Croghaun. Until fairly recently the waters of Keem Bay were home to the basking shark as well as grey seals and numerous varieties of fish. In the 1940s and 50s the basking shark was hunted by local fishermen at Keem Bay using traditional canvas covered curraghs and directed by spotters situated on the cliffside on Moyteoge Head. The oil of the basking shark was extracted for export as a fine grade lubricant for the aerospace industry. The largest specimen of the porbeagle shark caught by rod-and-line in Irish waters was caught off Keem Bay by Dr. O'Donnell-Browne in 1932. It weighed 365lbs. Croaghaun is the most westerly peak of Achill Island and stands at 664 metres. On the northern slope of the mountain lie the highest sea cliffs in the country and also the highest in Europe. The cliffs are part of a vast array of sheer rock faces which start south of Keem Bay and loop around Achill head onwards to Slievemore, dropping almost vertically into the pounding waters of the Atlantic Ocean."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Ruined_coastguard_lookout_station_-_geograph.org.uk_-_5813612.jpg?20231126191723",
      "title": "Ruined coastguard lookout station by Mick Garratt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ruined coastguard lookout station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Edge_of_the_Atlantic%2C_Moyteorge_Head_-_geograph.org.uk_-_5813623.jpg?20231126191938",
      "title": "Edge of the Atlantic, Moyteorge Head by Mick Garratt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Edge of the Atlantic, Moyteorge Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/On_the_ridge_towards_Moyteoge_Head_above_Keem_Strand%2C_Achill_Island_-_geograph.org.uk_-_5220483.jpg/512px-On_the_ridge_towards_Moyteoge_Head_above_Keem_Strand%2C_Achill_Island_-_geograph.org.uk_-_5220483.jpg?20230806170915",
      "title": "On the ridge towards Moyteoge Head above Keem Strand, Achill Island by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On the ridge towards Moyteoge Head above Keem Strand, Achill Island"
    }
  ],
  "distance_km": 2.86,
  "description": "This circular loop walk visits the beautiful Keem Bay near Dooagh on Achill Island in County Mayo. The walk starts off from the parking area near the beach and then picks up trails to take you along the coast to the Moytoge Head viewpoint. From this elevated spot you can enjoy some glorious views over the horseshoe-shaped bay. The area also includes a beautiful Blue Flag beach with golden sands. You can continue your walking in the area by heading east to pick up the Dooagh Loop Walk. The climb to the nearby Minaun Heights is another great local option.",
  "details": [],
  "gazetteer_found": false
}