{
  "created_at": "2025-01-06T03:37:52.826055+00:00",
  "objectID": "fd572418a82996316505f8cf1e79aa93",
  "ref": "cemaes-bay-walking-route",
  "title": "Cemaes Bay Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Cemaes_Bay_-_geograph.org.uk_-_1717002.jpg/512px-Cemaes_Bay_-_geograph.org.uk_-_1717002.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fd572418a82996316505f8cf1e79aa93.gpx",
  "_geoloc": {
    "lat": 53.4137245725,
    "lng": -4.4522955024
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Cemaes_Bay_-_geograph.org.uk_-_1717002.jpg/512px-Cemaes_Bay_-_geograph.org.uk_-_1717002.jpg",
      "title": "David Dixon / Cemaes Bay, via Wikimedia Commons",
      "caption": "Looking across the bay towards Wylfa Head from the coast road just after leaving the car park at Cemaes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Sunset_at_Cemaes_Bay_-_geograph.org.uk_-_158740.jpg",
      "title": "Phil Williams / Sunset at Cemaes Bay, via Wikimedia Commons",
      "caption": "Sunset at Cemaes Bay. A view looking to the northwest as the sun setting over Wylfa Head illuminates the sands of Traeth Mawr. Photo taken from the foreshore by the car park at the northern end of the beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Cemaes_Bay_Village_-_geograph.org.uk_-_908588.jpg",
      "title": "Chris Eaton / Cemaes Bay Village, via Wikimedia Commons",
      "caption": "Cemaes Bay Village. The road into the village, as viewed from a guest balcony of the Harbour Hotel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/The_shores_of_Cemaes_Bay_-_geograph.org.uk_-_1179399.jpg",
      "title": "Eric Jones / The shores of Cemaes Bay, via Wikimedia Commons",
      "caption": "The shores of Cemaes Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Rhyd_Y_Groes_Wind_Farm_and_Cemaes_Bay_-_geograph.org.uk_-_776474.jpg",
      "title": "Warren Cardwell / Rhyd Y Groes Wind Farm and Cemaes Bay, via Wikimedia Commons",
      "caption": "Rhyd Y Groes Wind Farm and Cemaes Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/The_waters_of_the_inner_part_of_Cemaes_Bay_-_geograph.org.uk_-_1185140.jpg",
      "title": "Eric Jones / Traeth Mawr from the east, via Wikimedia Commons",
      "caption": "The waters of the inner part of Cemaes Bay. The headland in the background is Wylfa Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Cliffs_on_the_western_side_of_Wylfa_Head_-_geograph.org.uk_-_1192911.jpg",
      "title": "Eric Jones / Cliffs on the western side of Wylfa Head, via Wikimedia Commons",
      "caption": "Cliffs on the western side of Wylfa Head. These cliffs are composed of very ancient Mona Complex rocks of the Gwna and Fydlyn groups. These rocks form a very stable block and this was one of the reasons for locating a nuclear station here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Porth_Ogof_cove_on_Wylfa_Head_-_geograph.org.uk_-_1178275.jpg",
      "title": "Eric Jones / Porth Ogof cove on Wylfa Head, via Wikimedia Commons",
      "caption": "Porth Ogof cove on Wylfa Head Porth Ogof means \"cave cove\". The slipway, in the shelter of Ynys yr Wyn (lambs island), is that of an old lifeboat station. The station is named on OS plans dating between 1881 and 1926. The headlands of Llanbadrig and Llanlleiana can be seen in the background across the waters of Cemaes Bay."
    }
  ],
  "distance_km": 5.5,
  "description": "This lovely circular walk explores Cemaes Bay and Wylfa Head on the Anglesey coast. The bay is designated as an Area of Outstanding Natural Beauty which is also partly owned by the National Trust. On the route there's fine views over to the Isle of Man and the mountains of Northern Ireland on a clear day. The walk starts on the front in Cemaes village and follows the Anglesey Coast Path west along the bay to Wylfa Head. On this headland you can sometimes see porpoises in the seas below. After rounding the headland the route passes the old Wylfa Power Station before picking up paths to take you east through the countryside. These lead you back to the village where you can stop at the Cemaes Heritage Centre. The centre forms a permanent exhibition, a meeting room and training room. It features a brand new heritage experience, in which one can learn about the bygone era of Cemaes and the parish of Llanbadrig. There's also a a nice tea room where you can enjoy refreshments after your exercise. To continue your walking in the area head west and explore the delightful Cemlyn Bay. There's a nice circular walk here with fine views over the bay. You can pick up the Anglesey Coast Path and follow the waymarked trail to the bay. Heading north east will take you to the interesting Llanbadrig Church. Those who make the pilgrimage from Cemaes to the headland to the east, where the church stands, will be rewarded by both the history of the church and views on a clear day to the Isle of Man, the hills of the Lake District and the Mountains of Mourne in Ireland.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Stag Inn is located in the village centre and has a very good menu and selection of drinks. It's dog friendly and there's also a beer garden to sit out and relax in. You can find it on the High St at postcode LL67 0EW for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal paths make for a fine dog walk and the Stag Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east along the coast path you can visit a number of interesting historical sites. You'll pass the Dinas Gynfor coastal hillfort, Llanlleiana Porcelain Works and the fascinating Porth Wen Brickworks. This scheduled ancient monument consists of a disused Victorian brickworks which produced fire bricks, made from quartzite (silica) used to line steel-making furnaces. The remains include a number of buildings and some of the machinery. It's a photgoenic spot with the coastal scenery making a wonderful backdrop to the old buildings. A little further east is the climb to Parys Mountain where there are fine views over the area. The lovely waterside paths at Llyn Alaw lie just to the south. The lake is the largest body of water on the island. A couple of miles to the west of the lake there's also Llanddeusant where you can explore the fascinating Llynon Mill. The 18th century mill is notable as the only working windmill in Wales. The site also includes two Iron Age roundhouses where you can learn all about the ancient history of the area. Head east along the coast path and you will come to Amlwch. The coastal town is well worth exploring with a visit to the Copper Kingdom visitor centre in Port Almwch recommended. Here you can learn all about the history of Amlwch's 18th century “Copper Rush” in a series of interesting exhibitions. The splendid Amlwch Walk will take you along the coast to the historic lighthouse and viewpoint at Point Lynas. To the west there's also the beautiful neighbouring village of Bull Bay, the most northerly village in Wales. For more walking ideas in the area see the Anglesey Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bc0blLKDCms",
  "postcode": "LL67 0ER",
  "district": "Cemaes",
  "county": "Ynys Môn / Isle of Anglesey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Glantraeth, Ffordd y Traeth, Penrhyn, Llanbadrig, Cemaes, Ynys Môn / Isle of Anglesey, Cymru / Wales, LL67 0ER, United Kingdom",
  "state": "Cymru / Wales"
}