{
  "created_at": "2025-01-06T00:13:37.071944+00:00",
  "objectID": "fde863f6ed3a3635dbb832514339b716",
  "ref": "cow-green-reservoir-and-cauldron-snout-walking-route",
  "title": "Cow Green Reservoir and Cauldron Snout Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Cow_Green_Reservoir_-_geograph.org.uk_-_73995.jpg",
  "nearby": [
    {
      "description": "High Force Waterfall",
      "objectID": "644768ed8d1b4271071b163fa9a9d416",
      "ref": "high-force-waterfall-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Cross Fell Walk",
      "objectID": "2884d1220bce88b919b7e43d93d769c1",
      "ref": "cross-fell-walk-walking-route"
    },
    {
      "description": "Teesdale Way",
      "objectID": "bee1da20e3a1d771ea9f89b5a2d25ba9",
      "ref": "teesdale-way-walking-route"
    },
    {
      "description": "Mickle Fell",
      "objectID": "1416454f18583601d517239f0c1cce0d",
      "ref": "mickle-fell-walking-route"
    },
    {
      "description": "Allenheads",
      "objectID": "a0f7105253ce541885b196ed11906bb7",
      "ref": "allenheads-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fde863f6ed3a3635dbb832514339b716.gpx",
  "_geoloc": {
    "lat": 54.6731933997,
    "lng": -2.2946658141
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Cow_Green_Reservoir_-_geograph.org.uk_-_73995.jpg",
      "title": "Uncredited / Cow Green Reservoir, via Wikimedia Commons",
      "caption": "A stupendous view across to Cross Fell, Great Dun Fell and Little Dun fell from the car park at Cow Green Reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Bridge_below_Cow_Green_Reservoir_-_geograph.org.uk_-_210789.jpg",
      "title": "Hugh Mortimer / Bridge below Cow Green Reservoir, via Wikimedia Commons",
      "caption": "Bridge below Cow Green Reservoir. Taken from the top of the dam looking towards Cauldron Snout"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Cow_Green_Reservoir_-_geograph.org.uk_-_449110.jpg",
      "title": "Andrew Smith / Cow Green Reservoir, via Wikimedia Commons",
      "caption": "Cow Green Reservoir. The shoreline on the southeastern side. The western end of the dam can just be seen behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Cauldron_Snout_-_geograph.org.uk_-_1058426.jpg",
      "title": "Andy Jamieson / Cauldron Snout, via Wikimedia Commons",
      "caption": "Cauldron Snout"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Above_Cauldron_Snout_-_geograph.org.uk_-_1494738.jpg",
      "title": "Chris Heaton / Above Cauldron Snout, via Wikimedia Commons",
      "caption": "Above Cauldron Snout.The River Tees just before it become a raging torrent as it plunges down Cauldron Snout."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/The_River_Tees_above_Cauldron_Snout_-_geograph.org.uk_-_1177382.jpg",
      "title": "Andrew Curtis / The River Tees above Cauldron Snout, via Wikimedia Commons",
      "caption": "The River Tees above Cauldron Snout. Looking back towards the Pennine Way bridge and Cow Green Dam."
    }
  ],
  "distance_km": 16.0,
  "description": "This walk takes you along the beautiful Cow Green Reservoir to the spectacular Cauldron Snout waterfall in the North Pennines AONB. You start off at the car park at Cow Green Reservoir which is located on the eastern side of the water at a postcode of DL12 0HX. From here you head 2 miles south along the reservoir to the waterfall, passing the impressive Cow Green Dam on the way. Cauldron Snout is a very powerful waterfall on three levels. At 200 yards (180 m) long, it is reckoned to be the longest waterfall in England. At the waterfall you have the option of heading back to the car park or continuing along the Pennine Way and the River Tees towards Langdon Beck. The path runs right along the river to Sayer's Hill and Harwood Beck with plenty of wild moorland scenery to enjoy. If you'd like to continue your walking in the area you could head to the nearby Cross Fell for spectacular views over the Lake District and Solway Firth. If you continue east along the Pennine Way you will soon come to High Force Waterfall. It's one of the biggest waterfalls in England and a spectacular sight with the water dropping 70 feet (21m) into a plunge pool below. If you head north you could visit Burnhope Reservoir and Burnhope Seat the highest point of County Durham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off in Langdon Beck and visit the Langdon Beck Hotel for some refreshments. The hotel has a good menu and a cosy interior with roaring fires and a friendly atmosphere. It's in a wonderfully remote location, with lovely views and a whole host of other walks to try in the area. You can find the hotel to the east of the reservoir at a postcode of DL12 0XP for your sat navs.  Picture above: Langdon Beck Hotel and Langdon Beck Bridge. Langdon Beck has been adopted as the name of the hamlet."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir and waterfall make for an appealing and peaceful walk with your dog and the Langdon Beck Hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "This area is excellent for bird watching so be sure to bring your binoculars with you. For example the fields around Langdon Beck are some of the best in the North Pennines for seeing the rare Black Grouse. About 80% of Britain’s Black Grouse population live within the North Pennines. The lekking displays, which are at their peak in early Spring are quite spectacular. Lapwings, Curlew, Redshank and Snipe all breed in the surrounding pastures too. The reservoir is located a few miles west of the Bowlees Visitor Centre which is worth a visit if you have time. The centre has a wealth of information on the North Pennines AONB and a nice cafe. Just north of the visitor centre you can also visit Summerhill Force waterfall and Gibson's Cave. You can reach the site with a nice little stroll through woodland along the Bow Lee Beck to the pretty waterfall.  Pictured above the Summerhill Force waterfall and Gibson's Cave. Located a few miles east of the reservoir the site is a very worthy addition to your outing. Just to the south you can try the climb to Mickle Fell. The fell is significant as being the highest point within the historic county of Yorkshire and the highest point within County Durham. At the nearby Nenthead mining heritage centre you can learn all about the lead and zinc mining history of the North Pennines. There's also mine entrances, dumps, old buildings, reservoirs and some rare plants growing on the metal-rich mine dumps. The village is located a few miles to the north and well worth a visit. Just east of Nenthead there's also Allenheads where you will find more ruined mines, a heritage centre and a decent pub dating back to 1770. For more walking ideas in the area see the County Durham Walks and North Pennines Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/t4Wvk5neVmc",
  "county": "County Durham",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cow Green Reservoir Parking, Old Mine Tramway, Forest and Frith, County Durham, North East, England, DL12 0HX, United Kingdom",
  "postcode": "DL12 0HX",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "moorland",
    "water"
  ],
  "points_of_interest": [
    "waterfall",
    "views",
    "river"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}