{
  "created_at": "2025-01-06T01:28:43.231575+00:00",
  "objectID": "fe178ffb424752f4c5dcbdd1df788144",
  "ref": "buckingham-walking-route",
  "title": "Buckingham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/93/Stowe_Avenue_-_geograph.org.uk_-_1248621.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fe178ffb424752f4c5dcbdd1df788144.gpx",
  "_geoloc": {
    "lat": 52.0008458845,
    "lng": -0.9932941387
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Stowe_Avenue_-_geograph.org.uk_-_1248621.jpg",
      "title": "mick finn / Stowe Avenue",
      "caption": "View down Stowe Avenue towards Buckingham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Chackmore%2C_The_Queen%27s_Head_-_geograph.org.uk_-_154685.jpg",
      "title": "Nigel Cox / Chackmore: The Queen's Head",
      "caption": "Chackmore, The Queen's Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Buckingham_Museum_-_geograph.org.uk_-_760174.jpg",
      "title": "N T Stobbs / Buckingham Museum",
      "caption": "Buckingham Museum"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Manor_House_Buckingham_Geograph-1649235-by-Colin-Smith.jpg",
      "title": "Colin Smith / Manor House, Buckingham",
      "caption": "Manor House Buckingham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Buckingham_Church_-_geograph.org.uk_-_715502.jpg",
      "title": "Shaun Ferguson / Buckingham Church",
      "caption": "Buckingham Church. Looking across the Great Ouse near Ford Street to Buckingham Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Old_Town_Hall_Buckingham_Geograph-2133620-by-Nigel-Cox.jpg",
      "title": "Nigel Cox / Buckingham: The Old Town Hall",
      "caption": "Old Town Hall Buckingham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Stowe_Gothic_Temple.jpg",
      "title": "Amanda Lewis / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Stowe Park Gothic Temple"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Horse_trough%2C_Buckingham_-_geograph.org.uk_-_995709.jpg",
      "title": "mick finn / Horse trough, Buckingham",
      "caption": "Horse trough, Buckingham Horse trough near the Community Centre, Buckingham. The old Masonic Hall can be seen in the middle distance (the white building) and the Grand Junction PH is right of centre."
    }
  ],
  "distance_km": 9.7,
  "description": "This interesting market town is located in north Buckinghamshire, near to the borders of Northamptonshire and Oxfordshire. It's surrounded by some lovely countryside with other highlights including the River Great Ouse, the Grand Union Canal and the magnificent Stowe Park. This circular walk from the town takes you to the beautiful Stowe Park, just to the north east. The walk starts in the town centre where you can pick up footpaths running north through the countryside toward Chackmore. Shortly after you come to Stowe where you can follow public footpaths around the perimeter of the site. On the way there are nice views across the historic parkland and woodland. For a fee you can access all of the grounds which are run by the National Trust. There are stunning gardens to see with other highlights including the Grecian Valley, the Gothic Temple, the Temple of Friendship and the Palladian bridge. On the western side of the park you'll cross the picturesque Oxford Water on an old bridge before returning to the town on Stowe Avenue.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Woolpack in the town centre for some refreshments after your walk. The friendly pub has cost fires indoors and a large garden overlooking the river outside. It's a lovely spot to rest in on warmer days. You can find the pub on Well Street at postcode MK18 1EP. The pub is also dog friendly if you have your canine friend with you. The Mitre is the oldest pub in Buckingham and located near to the university. The 17th century pub has a fantastic garden and patio area here if the weather is good. Inside there's a cosy real open fire as well as a new log burner in winter. You can find the pub at 2 Mitre Street with a postcode of MK18 1DW for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In the town head to the Buckingham Old Gaol Museum which tells the story of Buckingham, including the Flora Thompson Collection (author of Lark Rise to Candleford) and Buckinghamshire Military Trust exhibits. The museum is housed in the Old County Gaol, built in 1748 and one of the iconic buildings of the town. On the western side of the town there's the pretty Buckingham Railway Walk. This follows a delightful footpath along the old Buckingham railway line near to the university. It's a lovely place for a peaceful stroll in the town with lots of flora and fauna to see. The Palladian Way long distance trail also starts from the town. The epic, waymarked trail runs all the way to Bath through four different counties. Just to the west of Stowe Park you can pick up the Westbury Circular Ride. This shared cycling and walking trail explores the area around the nearby village of Westbury. If you head west it will take you towards Turweston and Brackley in Northamptonshire. The interesting market town is close to the famous Silverstone racing track and includes a noteworthy Parish church with parts dating from the 11th century. Heading off to the east of the town is the Buckingham Arm of the Grand Union Canal Walk. You could follow it east towards a reservoir, Thornton and Bourton Meadow. The little park is another lovely place for a waterside stroll and can be found just to the east of the town next to the canal and River Ouse. For more walking ideas in the area see the Buckinghamshire Walks page."
    }
  ],
  "postcode": "MK18 1HT",
  "district": "Buckingham",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stowe Avenue, West End Farm, Buckingham, Buckinghamshire, England, MK18 1HT, United Kingdom",
  "state": "England"
}