{
  "objectID": "fe1e4ffead2244931831e88d2fdba02a",
  "created_at": "2024-12-18T10:51:37.998493+00:00",
  "ref": "rottingdean-walking-route",
  "title": "Rottingdean Circular Windmill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/69/Dismantled_Railway%2C_Rottingdean_Beach_-_geograph.org.uk_-_370001.jpg",
  "nearby": [
    {
      "description": "Brighton",
      "objectID": "6d0a8cf7a5a223f9f1760b6159003c0f",
      "ref": "brighton-walking-route"
    },
    {
      "description": "Undercliff Walk Brighton",
      "objectID": "bcf02e1d3af221a6df13636e41c914c6",
      "ref": "undercliff-walk-brighton-walking-route"
    },
    {
      "description": "Brighton to Newhaven",
      "objectID": "d2611da83e9ea2d4b21cf874be281030",
      "ref": "brighton-to-newhaven-walking-and-cycle-route"
    },
    {
      "description": "Brighton to Eastbourne",
      "objectID": "426a04cc4f6904f72627e94480ea1e2c",
      "ref": "brighton-to-eastbourne-walking-route"
    },
    {
      "description": "Iford",
      "objectID": "df42aca8ac31b75f6a88a750323123b6",
      "ref": "iford-walking-route"
    },
    {
      "description": "Castle Hill National Nature Reserve",
      "objectID": "bd0bd40c208e22a1f00a20fa4bfdedbf",
      "ref": "castle-hill-nature-reserve-walking-route"
    },
    {
      "description": "Telscombe Cliffs",
      "objectID": "9933c37a9f94535bde2de86906e85394",
      "ref": "telscombe-cliffs-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/23486CEC03AEA59B86258781005266BB/$FILE/Rottingdean.gpx",
  "_geoloc": {
    "lat": 50.8010105582,
    "lng": -0.0426928114
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Dismantled_Railway%2C_Rottingdean_Beach_-_geograph.org.uk_-_370001.jpg",
      "title": "Simon Carey / Dismantled Railway, Rottingdean Beach",
      "caption": "Dismantled Railway, Rottingdean Beach. The concrete blocks are the sole remnants of a railway that once linked Rottingdean to Banjo Groyne in Brighton. Built by Magnus Volk and opened in 1896 the tramcar ran on stilts powered by cables along a line fixed around 50 yards below the high tide mark. The line was short lived, extensive damage was caused by a storm in December 1896 which also finished off the Chain Pier, and although Volk had it working again in 1897 it ceased operating in 1901 when Brighton Corporation wished to build groynes which would cause Volk to realign the lines further out to sea. Some of the cable poles were still standing in the 1930s but today only the concrete blocks remain and the course of the line cut through the rocks on the seabed. This view looks from a point near the former Rottingdean terminus."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Rottingdean_Windmill_-_geograph.org.uk_-_1931014.jpg/512px-Rottingdean_Windmill_-_geograph.org.uk_-_1931014.jpg",
      "title": "Rottingdean Windmill by Paul Gillett, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Beacon Mill, also known as Rottingdean Windmill and based on Beacon Hill which lies to the west of the narrow valley containing the village. Built in 1802 on the site of a former post mill it remained in use until closure in 1881. After a number of years of neglect it was restored by the Marques of Abergavenny in 1905 then leased to a preservation society in 1923. Brighton corporation took over wonership six years later and restored it again 1935 with further repairs carried out in 1966, 75 and 88. The windmill was reputed to have been used to aid smugglers with the windmill's sails set in a certain position to advise those out at sea whether it was safe or not to land their contraband. Taken from Marine Drive, the A259, as it exits a cutting allowing for the ground level view across Rottingdean Pitch and Putt golf course with the tee marker providing the only colour on grey and snowy day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Telscombe_Tye_Dewpond_-_geograph.org.uk_-_465621.jpg",
      "title": "Peter Cox / Telscombe Tye Dewpond",
      "caption": "Telscombe Tye Dewpond. Restored with plastic liner and imported clay is Telscombe Tye Dewpond. Fenced off so that animals may not drink this is now becoming a 'wildlife area'. The Caburn can be seen on the distant horizon, just above the right hand side of the dewpond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Enclosure_on_Pickers_Hill_-_geograph.org.uk_-_458668.jpg",
      "title": "Peter Cox / Enclosure on Pickers Hill",
      "caption": "Enclosure on Pickers Hill. One of those things that is difficult to sort out exactly what it was for. The view is West towards Balsdean and the roof of the pumping station can just be seen, middle, left hand side. A ruined barn in the middle distance, and just behind the Hawthorn is the Harvey Stone"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Highdole_Hill_-_geograph.org.uk_-_51692.jpg",
      "title": "Simon Carey / Highdole Hill",
      "caption": "Highdole Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Bridleway%2C_Telscombe_Tye_-_geograph.org.uk_-_51679.jpg",
      "title": "Simon Carey / Bridleway, Telscombe Tye",
      "caption": "Bridleway, Telscombe Tye. Telscombe Tye was once common land encompassing a large tract of land around the village of Telscombe and up to the cliff tops themselves. This part of the Tye looks north west towards Pickers Hill. In the foreground a crow is stretching its wing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Telscombe_Manor_-_geograph.org.uk_-_1092823.jpg",
      "title": "Simon Carey / Telscombe Manor",
      "caption": "Telscombe Manor On the lane as it descends steeply into the village. Some parts of the manor date back to the 17th and 18th centuries though the house has been extensively re-worked. The round tower was added in the 20th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Balsdean_Cottages_-_geograph.org.uk_-_1205924.jpg/256px-Balsdean_Cottages_-_geograph.org.uk_-_1205924.jpg",
      "title": "Simon Carey / Balsdean Cottages",
      "caption": "Balsdean Cottages. The small hamlet of Balsdean now consists of a farm, these four cottages and a pumping station in the valley below. Once a populous but remote hamlet based around two farms and possessing its own chapel which was built in the 12th century and survived as a farm outbuilding up to the Second World War when all the buildings in the hamlet were reduced to rubble by the Canadian Artillery using them as target practice. The cottages were rebuilt after the war and moved out of the valley to this position."
    }
  ],
  "distance_km": 13.0,
  "description": "This attractive coastal village is located in the city of Brighton in East Sussex. It's a lovely place for a walk with a nice beach and promenade, lots of good pubs and an old windmill to visit. This circular walk from the village takes you along the sea front before climbing into the surrounding hills and countryside to the north. You'll then visit the elevated windmill which lies just to the west of the village on Beacon Hill. The walk starts at the public car park on the front and heads east along the prom before following a bridleway north east to Peldersburgh and the neighbouring village of Telscombe. The route then heads north west across Telscombe Tye to Highdole Hill and Pickers Hill with some lovely country views on the way. You then turn south, passing Balsdean Cottages and High Hill before heading south west to Beacon Hill. Here you will pass the photogenic Rottingdean Windmill which was built in 1802. There's some fine sea views to enjoy from this splendid viewpoint.",
  "video_url": "https://www.youtube.com/embed/ZQ2jVRLSr-Y",
  "postcode": "BN2 8SQ",
  "district": "Brighton and Hove",
  "county": "The City of Brighton and Hove",
  "region": "South East",
  "country": "England"
}