{
  "created_at": "2025-01-06T00:20:27.995560+00:00",
  "objectID": "fe24b1a96c37cbd128a47849327539d0",
  "ref": "macclesfield-forest-and-trentabank-reservoir-walking-route",
  "title": "Macclesfield Forest and Trentabank Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Footpath_to_Trentabank_in_Macclesfield_Forest_-_geograph.org.uk_-_1413845.jpg",
  "nearby": [
    {
      "description": "Gritstone Trail",
      "objectID": "928e56c6a6c868355ef1a26f5e709aad",
      "ref": "gritstone-trail-walking-route"
    },
    {
      "description": "Tegg's Nose Country Park",
      "objectID": "7a63ac6888ee9bd47a98ad67811ef794",
      "ref": "teggs-nose-country-park-walking-and-cycle-route"
    },
    {
      "description": "Sutton Reservoir and Danes Moss",
      "objectID": "3e4d70d0d37f19f6f7722dabba5d8757",
      "ref": "sutton-reservoir-and-danes-moss-walking-route"
    },
    {
      "description": "Wildboarclough",
      "objectID": "11390c32ce6b633610681b7bee49530a",
      "ref": "wildboarclough-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fe24b1a96c37cbd128a47849327539d0.gpx",
  "_geoloc": {
    "lat": 53.2401471989,
    "lng": -2.0356964004
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Footpath_to_Trentabank_in_Macclesfield_Forest_-_geograph.org.uk_-_1413845.jpg",
      "title": "Chris Wimbush / Footpath to Trentabank in Macclesfield Forest, via Wikimedia Commons",
      "caption": "Footpath to Trentabank in Macclesfield Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Footpath_in_Macclesfield_Forest_-_geograph.org.uk_-_1413855.jpg",
      "title": "Chris Wimbush / Footpath in Macclesfield Forest, via Wikimedia Commons",
      "caption": "Footpath in Macclesfield Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Walker_on_Andrews_Edge_-_geograph.org.uk_-_1802040.jpg",
      "title": "steven ruffles / Walker on Andrews Edge, via Wikimedia Commons",
      "caption": "Walker on Andrews Edge. A great viewpoint for the Todd Brook valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Macclesfield_Forest_and_Ridgegate_Reservoir_-_geograph.org.uk_-_693913.jpg",
      "title": "Philip Halling / Macclesfield Forest and Ridgegate Reservoir, via Wikimedia Commons",
      "caption": "Macclesfield Forest and Ridgegate Reservoir. Trees of the Macclesfield Forest reflected in Ridgegate Reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Charity_Lane%2C_Macclesfield_Forest_-_geograph.org.uk_-_704067.jpg",
      "title": "Philip Halling / Charity Lane, Macclesfield Forest, via Wikimedia Commons",
      "caption": "Charity Lane, Macclesfield Forest Footpath junction on Charity Lane. On the horizon to the right of the centre is the Cat and Fiddle Inn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Macclesfield_Forest%2BTrentabank.jpg",
      "title": "Mike Shields [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Trentabank Reservoir lies between Macclesfield, Cheshire and Buxton, Derbyshire. The dam is in Cheshire but most of the water is in Derbyshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Kissing_Gate_and_Finger_Post_for_Trentabank_-_geograph.org.uk_-_751174.jpg",
      "title": "Raymond Knapman / Kissing Gate and Finger Post for Trentabank, via Wikimedia Commons",
      "caption": "Kissing Gate and Finger Post for Trentabank Path leads down to the Visitor Centre at Trentabank Reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Across_Ridgegate_Reservoir_towards_Tegg%27s_Nose_-_geograph.org.uk_-_1413809.jpg",
      "title": "Chris Wimbush / Across Ridgegate Reservoir towards Tegg's Nose, via Wikimedia Commons",
      "caption": "Across Ridgegate Reservoir towards Tegg's Nose"
    }
  ],
  "distance_km": 4.5,
  "description": "This circular walk explores Macclesfield Forest and also pays a visit to the pretty Trentabank Reservoir on the western edge of the Peak District. The walk starts at the Standing Stone car park on the eastern edge of the forest. You then head west on good woodland footpaths through the conifer forest, passing along the Bollin Brook before arriving at Trentabank Reservoir. The area is great for wildlife spotting with a large heronry and other water loving birds such as common sandpiper, green sandpiper and little ringed plover. You may also see red deer in the woodland area. The area also include grassland with a variety of pretty plants and flowers including bluebell, tormentil, pignut, birdsfoot trefoil, foxglove and lesser knapweed. From the reservoir the route heads south back into the woodland towards Nessit Hill before returning to the car park. It's easy to extend your walking in this lovely area. You could head west past Ridegate Reservoir and pick up the Gritstone Trail and follow it to the excellent Tegg's Nose Country Park. The forest is located a few miles south east of Macclesfield town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk you can stop for refreshments at the excellent Leather's Smithy. This fine pub is located next to Ridgegate Reservoir, just to the east of Bottoms Reservoir. There's a great selection of ales and a nice beer garden to relax in when the weather is good. You can find the pub on Clarke Ln, at the north western tip of Ridgegate Reservoir. Postcode is SK11 0NE. To the south of the forest there's the small village of Wildboarclough where you will find The Crag Inn. The historic inn was originally a farm built in 1629 and then later converted to a beer house 1825. There's two cosy real fires indoors and a nice garden area for warmer days. They have a car park and are also dog friendly. You can find them at postcode SK11 0BD for your sat navs. The Wildboarclough valley is also very attractive with its streams, Georgian mill and beautiful countryside. You could approach the forest from the south from here as an alternative route."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The forest is a great place for dog walking with miles of wide trails to try. Please keep your dog on a lead for the safety of livestock though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west there's Sutton Reservoir and Danes Moss Nature Reserve to explore. The reservoir is another nice place for a waterside stroll while the reserve has some pleasant boardwalks taking you over lowland raised bog. It's an interesting area with some rare flora and fauna to see. In this same area there's also the worthy village of Gawsworth. The village includes three noteworthy historic buildings including the 15th century Gawsworth Hall. The house and grounds of the historic Tudor house are well worth exploring."
    }
  ],
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Standing Stone Car Park, Standing Stone Road, Macclesfield Forest and Wildboarclough, Cheshire East, England, SK11 0AR, United Kingdom",
  "postcode": "SK11 0AR",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "wildlife spotting area",
    "heronry",
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}