{
  "created_at": "2025-01-06T00:37:24.444847+00:00",
  "objectID": "fe438e4df0342a7c8d5ba6fa67f855ac",
  "ref": "bookham-commons-walking-route",
  "title": "Bookham Commons Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/95/Leaning_over_the_Water%2C_Bookham_Common_-_geograph.org.uk_-_1237634.jpg",
  "nearby": [
    {
      "description": "Ranmore Common",
      "objectID": "e65b70df28890a705c173ed6fcd48c05",
      "ref": "ranmore-common-walking-route"
    },
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Norbury Park",
      "objectID": "49459a09712824ac72aad3c871ff28d5",
      "ref": "norbury-park-walking-route"
    },
    {
      "description": "Box Hill Country Park",
      "objectID": "63b190df978b0c08e3925dd462c45224",
      "ref": "box-hill-country-park-walking-route"
    },
    {
      "description": "Mole Gap Trail",
      "objectID": "988a93aefb55a0cc161669ee47f431b2",
      "ref": "mole-gap-trail-walking-route"
    },
    {
      "description": "Leatherhead",
      "objectID": "27a5cba165c25dfc3bb3fbe4604ebb10",
      "ref": "leatherhead-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fe438e4df0342a7c8d5ba6fa67f855ac.gpx",
  "_geoloc": {
    "lat": 51.2898320432,
    "lng": -0.3808841412
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Leaning_over_the_Water%2C_Bookham_Common_-_geograph.org.uk_-_1237634.jpg",
      "title": "Chris Reynolds / Leaning over the Water, Bookham Common",
      "caption": "Leaning over the Water, Bookham Common. The earth dam, which keeps the pond in place, can be seen running across the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/On_Bayfield_Plain%2C_Bookham_Common_-_geograph.org.uk_-_1416489.jpg",
      "title": "Chris Reynolds / On Bayfield Plain, Bookham Common",
      "caption": "On Bayfield Plain, Bookham Common. The brown area has recently been flailed. The newsletter by the entrance explains: Local cattle will be returning to the plains to help munch-down the competitive vegetation, maintaining a grassland rich in wild flowers. This year they have been given a helping hand with a tractor flail, knowking down the invasive birch and willow saplings which were too large for the cattle to reach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/A_Path_through_the_Woodland_on_Bookham_Common_-_geograph.org.uk_-_1236861.jpg/256px-A_Path_through_the_Woodland_on_Bookham_Common_-_geograph.org.uk_-_1236861.jpg",
      "title": "Chris Reynolds / A Path through the Woodland on Bookham Common",
      "caption": "A path through the Woodland on the common. In addition to a number of tracks, and formal footpaths, there are many other paths, such as this one, ideal for dog walking. At this time of year much of the green under-storey here is holly."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Bookham_Stream%2C_Bookham_Common_-_geograph.org.uk_-_1416515.jpg",
      "title": "Chris Reynolds / Bookham Stream, Bookham Common",
      "caption": "Bookham Stream, In practice a muddy ditch which in places is almost completely obscured by vegetation \u0096 but which expands to a tiny pool by the track junction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Walkway_across_the_Marsh%2C_Bookham_Common_-_geograph.org.uk_-_1237611.jpg",
      "title": "Chris Reynolds / Walkway across the Marsh, Bookham Common",
      "caption": "Walkway across the Marsh. This provides a way of permitting people to see a march at close hand without destroying an interesting habitat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/The_Western_Pond%2C_Bookham_Common_-_geograph.org.uk_-_1237608.jpg",
      "title": "Chris Reynolds / The Western Pond, Bookham Common",
      "caption": "The Western Pond. A shallow valley runs across the Common and several low earth dams have created a series of ponds and marshy areas \u0096a paradise for wild life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/An_Overcast_Day_on_Bookham_Common_-_geograph.org.uk_-_1416492.jpg",
      "title": "Chris Reynolds / An Overcast Day on Bookham Common",
      "caption": "An Overcast Day on the common sees a dog making its way along one of the footpaths. This area represents rare grassland, full of wild flowers, insects, small mammals, and amphibians. Clumps of scrub give shelter to a great range of birds, and many butterflies can be seen. The commons would be quickly become overgrown unless careful rotational clearing is carries out and cattle have been introduced on part of the plains, because this is the finest way of managing grassland and scrub to maintain ecological diversity. (Based on text on map board by entrance)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Hadleys_Cottage._Isle_of_Wight%2C_Bookham_Common_-_geograph.org.uk_-_1237604.jpg",
      "title": "Chris Reynolds / Hadleys Cottage. Isle of Wight, Bookham Common",
      "caption": "Hadleys Cottage. Isle of Wight. In the middle of the Commons there is a small unwooded area, named the Isle of Wight, which contains a number of private properties, including Hadleys Cottage."
    }
  ],
  "distance_km": 4.0,
  "description": "This large area of common land is located just to the west of Leatherhead. It's a good place for walking with miles of trails taking you to grassland, ancient woodland and picturesque ponds. The common includes bridleways which are suitable for cyclists as well. It's a great place for wildlife too with nightingales, warblers and pretty butterflies in the summer months. There is a handy bird hide on the eastern side of the site, next to the ponds. There's an information board here detailing the birds you might see on the water. Keep your eyes peeled for little grebe and damselflies here. This walk starts from the National Trust car park at the southern end of the common. Very close by is Bookham train station so the common is very accessible by public transport. From here you can pick up the footpaths heading north west and then create a circular route through the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south into Great Bookham and you could enjoy some refreshments in the Royal Oak. It's a pub of some note, dating back to the 1570’s and includes an inglenook fireplace, stone floor and original oak doors. Outside there's a lovely garden area if the weather is fine. They also do delicious authentic Thai food and have a good selection of drinks. You can find them on the High Street at a postcode of KT23 4AG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails are ideal for a dog walk so you're likely to see other owners on your visit. Please keep them on leads in the areas where livestock is grazing. The Royal Oak mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you'll find another large area of common land in the shape of Ranmore Common. You can also pick up the North Downs Way here and head east to the nearby Box Hill Country Park. Just south east you will find Norbury Park where there's some more woodland trails and walks along the River Mole on the Mole Gap Trail. A few miles to the north of the common there's Oxshott Heath and Woods to visit. The village is also notable as being one of the most expensive places to live in the country. Residents include several premier league footballers and tennis player Andy Murray. For more walking ideas in the area see the Surrey Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UBFSu3AMy7U",
  "district": "Mole Valley",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Common road, Great Bookham, Mole Valley, Surrey, England, KT23 3JG, United Kingdom",
  "postcode": "KT23 3JG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "woodland",
    "pond"
  ],
  "points_of_interest": [
    "bird hide",
    "information board"
  ],
  "facilities": [
    "car park",
    "public transport"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}