{
  "created_at": "2025-01-06T08:49:48.739743+00:00",
  "objectID": "fe4791da3706b88910ab16423d0824bc",
  "ref": "fryent-country-park-walking-route",
  "title": "Fryent Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/58/Fryent_Country_Park_-_geograph.org.uk_-_1224435.jpg",
  "nearby": [
    {
      "description": "Capital Ring",
      "objectID": "ec2dd412bf73a76208eeb393c1b23372",
      "ref": "capital-ring-walking-route"
    },
    {
      "description": "Brent Reservoir",
      "objectID": "77350c947cc529cb1da5217f69804bfd",
      "ref": "brent-reservoir-walking-and-cycle-route"
    },
    {
      "description": "Harrow On The Hill",
      "objectID": "f495aa57752c9acd49b650473610a195",
      "ref": "harrow-on-the-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fe4791da3706b88910ab16423d0824bc.gpx",
  "_geoloc": {
    "lat": 51.5753181838,
    "lng": -0.2753687616
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Fryent_Country_Park_-_geograph.org.uk_-_1224435.jpg",
      "title": "PAUL FARMER / Fryent Country Park",
      "caption": "Fryent Country Park is 250-acres haven of traditional countryside in the heart of the Brent suburbs. This picture was taken from Fryent Way (A4140)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Barn_Hill_pond_-_geograph.org.uk_-_476223.jpg",
      "title": "Nigel Cox / Barn Hill pond",
      "caption": "Barn Hill pond. One of several ponds in the park, this one at the top of Barn Hill is reputedly the only one with fish, and was created to the design of the landscape architect Humphrey Repton in about 1793 for the then landowner Richard Page. The water level is about 83 metres above sea level."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Barn_Hill_Triangulation_Pillar_-_geograph.org.uk_-_476193.jpg",
      "title": "Nigel Cox / Barn Hill Triangulation Pillar",
      "caption": "Barn Hill Triangulation Pillar on the western side of the park. Distant lines of sight for surveyors would not have been good from this pillar. This is the best aspect although the BT Tower is also just visible in an ESE direction. The view to the north and west is totally blocked by trees. The new Wembley Stadium arch is just visible through the murk. This is possibly the closest OS Triangulation Pillar to central London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Barn_Hill_Open_Space%2C_Wembley_-_geograph.org.uk_-_32029.jpg",
      "title": "David Hawgood / Barn Hill Open Space, Wembley",
      "caption": "Barn Hill Open Space, Wembley. This is the view North from the hill, towards Kingsbury and Edgware including the Grim's Dyke/Ditch ridge with Hertfordshire. Not a big hill, a knoll 86 metres high. It is above land of 30-60 metres elevation. It is well wooded but in some directions and up trees especially has extensive views. West can be seen Harrow on the Hill, south: Wembley Stadium and east: (over the vale of the Brent Reservoir which can be made out climbing trees) is Hampstead Heath in front of which are the hillside communities of Golders Green, Childs Hill and Frognal."
    }
  ],
  "distance_km": 1.0,
  "description": "Explore 103 hectares (254 acres) of rolling fields, hills and woodland in this country park and nature reserve in the London Borough of Brent. The walk starts in the car park at the eastern end of the park and follows footpaths to the top of Barn Hill. At the top of the hill there is a pond and great views towards Wembley Stadium and London. There are also two other hills with viewpoints, several other ponds and grazing ponies to see in this fine open space. Parking is available for about 50 cars but if you're coming on public transport you can catch the underground to Kingsbury Station on the Jubilee line. If you'd like to continue your walk you can follow the Capital Ring to the nearby Brent Reservoir for waterside trails.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The George is located just to the east of the park in Kingsbury. They serve good food and have a nice garden area for warmer weather. You can find them a short stroll from the site at 234 Church Lane with a postcode of NW9 8SN for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and open parkland are ideal for dog walking so you'll probably see other owners on your visit. The George mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a couple of miles east of the park and you could pick up the Dollis Valley Green Walk in Hendon. The pleasant route will take you through London along the Dollis Brook, where there's lots of interesting flora and fauna to see. To the west is the historic Harrow On The Hill. The village is an interesting place for a walk with a noteworthy 11th century church and the famous 17th century public school to explore. There are also great views over London from the elevated position of the ancient church on the hill. For more walking ideas in the area see the Greater London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/LoP6v3RttwQ",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Fryent Way, Preston, London Borough of Brent, London, Greater London, England, HA9 9JH, United Kingdom",
  "postcode": "HA9 9JH",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "viewpoint",
    "pond",
    "grazing ponies"
  ],
  "facilities": [
    "car park",
    "underground station",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}