{
  "created_at": "2025-01-05T22:30:37.158124+00:00",
  "objectID": "fef8d4791e5930b9f554162f489fc349",
  "ref": "benbulben-forest-walking-route",
  "title": "Benbulben Forest Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Ben_Bulben_side_profile.jpg/512px-Ben_Bulben_side_profile.jpg",
  "nearby": [
    {
      "description": "Mullaghmore Head",
      "objectID": "24aadf2f9a81ab47dce1a00cb314f0af",
      "ref": "mullaghmore-head-walking-route"
    },
    {
      "description": "Rougey Cliff Walk",
      "objectID": "6c67dffaac3a558aaa8065c0162a688b",
      "ref": "rougey-cliff-walk-walking-route"
    },
    {
      "description": "Glencar Waterfall",
      "objectID": "f6ed83ccfdd0d7f6938abf144170e413",
      "ref": "glencar-waterfall-walking-route"
    },
    {
      "description": "Lough Eske",
      "objectID": "ff0ec6265e3d4357fd668fb56dcc1efd",
      "ref": "lough-eske-walking-route"
    },
    {
      "description": "Rosses Point",
      "objectID": "79cad6798bd688aced6bc3f2bf965213",
      "ref": "rosses-point-walking-route"
    },
    {
      "description": "Killaspugbrone Loop",
      "objectID": "faaea933354a053c2e190599249e8970",
      "ref": "killaspugbrone-loop-walking-route"
    },
    {
      "description": "Lough Gill",
      "objectID": "312f47d812a541329b8574cd2a947415",
      "ref": "lough-gill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/fef8d4791e5930b9f554162f489fc349.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Ben_Bulben_side_profile.jpg/512px-Ben_Bulben_side_profile.jpg",
      "title": "Jonny Lavery, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Benbulbin was formed during the ice age when Ireland was covered by glaciers. Initially, it was a vast plateau, but the movement of glaciers from the northeast to the southwest sculpted it into its distinctive present shape. The Dartry Mountains, are predominantly made up of limestones resting on mudstones. These rocks originated around 345-330 million years ago during the Viséan Stage of the Carboniferous Period in a shallow sea environment. The uppermost layer consists of a thicker and harder limestone known as the Dartry Limestone Formation. Below this lies a thinner transitional limestone formation called the Glencar Limestone Formation. Further down, the lower slopes are composed of shaly mudstone referred to as the Benbulben Shale Formation. Scree deposits are also present near the base. Fossils are scattered throughout the mountain layers, with numerous fossilized sea shells found in all layers. The shale layer additionally contains some corals. Baryte, a mineral, was extracted from Glencarbury near Benbulbin in the Dartry range from 1894 to 1979."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Benbulben_love.jpg/512px-Benbulben_love.jpg",
      "title": "Subhrambar, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Benbulben view with paraglider. The mountain is a well-established destination for hikers. Climbing it from the north face can be challenging and hazardous due to the exposure to high winds and storms from the Atlantic Ocean. Conversely, the south side provides a relatively easy walk with a gentle slope. The summit offers panoramic views of the coastal plain of north County Sligo and the Atlantic Ocean. The western edge of the ridge is situated on privately owned farmland, restricting access to the general public. However, there is a paved path up the south face, located to the east near Glencar Waterfall, just over the County Leitrim border. Among the trails running alongside Benbulbin is the Gortarowey Looped Walk, covering 5.5 kilometres (3 mi). This trail meanders through both forested areas and open landscapes, offering scenic views of Benbulbin and Donegal Bay. The walk typically takes around 1.5 hours to complete."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Benbulben%27s_Empire_Strikes_Back.........._-_geograph.org.uk_-_3891270.jpg/512px-Benbulben%27s_Empire_Strikes_Back.........._-_geograph.org.uk_-_3891270.jpg",
      "title": "Benbulben's Empire Strikes Back.......... by Jimmy Mullen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Benbulbin is a haven for a diverse range of plant species, some of which are exclusive to this region in Ireland. The mountain's elevation creates a cooler climate at higher altitudes compared to the surrounding areas, fostering the growth of Arctic–alpine species. These plants are believed to have established themselves in the period just after the glaciers that shaped Benbulbin had retreated. In 2012, research unveiled that the fringed sandwort, a plant unique to Benbulbin and not found elsewhere in the country, has been thriving since the last ice age. The endemic plants on Benbulbin are estimated to be collectively around 100,000 years old. This discovery reignites discussions about whether Ireland's present-day ecology predates the Ice Age. Other remarkable flora on Benbulbin includes Alpine saxifrage, Arabidopsis spp., arctic meadow-rue, bluebells, Meconopsis spp., Poa alpina, Polystichum lonchitis, and snowbed willow. The local wildlife in the area includes wild badgers, hares, and red foxes. Additionally, Benbulbin is home to a population of red-billed choughs, birds with a similar appearance to crows, ravens, and other Corvids, distinguished by their bright red bills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/County_Sligo_-_Carrowmore_Passage_Tomb_-_20190922144246.jpg/512px-County_Sligo_-_Carrowmore_Passage_Tomb_-_20190922144246.jpg",
      "title": "Cliffoney, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Carrowmore Passage Tomb with the mountain in the background. Carrowmore Megalithic Cemetery stands as the oldest and most densely populated cluster of Neolithic tombs in Ireland. This distinction has led to its inclusion on Ireland's Tentative List of World Heritage Sites, particularly as part of 'The Passage Tomb Landscape of County Sligo,' encompassing various related monuments. Situated near Sligo town on the Cúil Íorra Peninsula, at the core of Neolithic north-west Ireland, Carrowmore hosts the remains of more than 35 passage tombs, erected nearly 6,000 years ago. The site provides a fascinating glimpse into the ancient practices and burial rituals of this prehistoric community. An exhibition within a meticulously restored cottage serves as a starting point for your exploration of this historic landscape. As you traverse the grassy paths, a sense of awe and connection with Ireland's Neolithic past is sure to accompany you."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Front_view_of_Benbulbin_%282013%29.jpg/512px-Front_view_of_Benbulbin_%282013%29.jpg",
      "title": "IrishFireside, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Benbulbin holds a prominent place in Irish legends and folklore, serving as the backdrop for various tales. It is regarded as one of the hunting grounds of the Fianna, a legendary band of warriors believed to have lived in the 3rd century. A notable legend set in Benbulbin is \"The Pursuit of Diarmuid and Gráinne,\" wherein the warrior Diarmuid Ua Duibhne (Diarmuid) is deceived by Fionn mac Cumhaill (Finn McCool) into battling an enchanted boar. Tragically, the boar fatally wounds Diarmuid by piercing his heart with its tusk. McCool is also said to have discovered his long-lost son Oisín in this mystical location, and the mountain is considered the resting place of Diarmuid and Gráinne. Moreover, in the 6th century, St. Columba was said to have engaged in a battle on the plain beneath Benbulbin at Cúl Dreimhne (Cooladrumman). This confrontation was over the right to transcribe a Psalter that St. Columba had borrowed from St. Finnian, adding a layer of historical and religious significance to the mountain's folklore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Ben_Bulben_from_Lissadell_-_panoramio.jpg/512px-Ben_Bulben_from_Lissadell_-_panoramio.jpg",
      "title": "Adrian Farwell, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Benbulbin holds a significant place in the poetry of W. B. Yeats, the renowned Irish poet, and the area around it is aptly named Yeats Country. County Sligo, with its enchanting landscapes, is deeply woven into Yeats's literary tapestry, and Benbulbin stands out as one of the focal points on the Passport Trail, a journey through the poet's life. In The Celtic Twilight, Yeats immortalises Ben Bulben and Knocknarea, acknowledging the crucial role these landmarks play in the lives of sailors navigating the seas. The mountain makes another appearance in Yeats's On a Political Prisoner, where he recalls Countess Markiewicz riding past it on her way to political meetings. Perhaps the most poignant connection lies in Yeats's final poem, Under Ben Bulben, a beautiful description of Yeats Country. This verse reflects on the sights that inspired the poet, and notably, Yeats himself is laid to rest in Drumcliffe Churchyard, beneath the gaze of Benbulbin. The concluding lines of the poem, inscribed on limestone near the church, serve as Yeats's epitaph, urging passers by to cast a contemplative eye on life and death as they journey on. Under bare Ben Bulben's head In Drumcliff churchyard Yeats is laid. An ancestor was rector there Long years ago, a church stands near, By the road an ancient cross. No marble, no conventional phrase; On limestone quarried near the spot By his command these words are cut: Cast a cold eye On life, on death. Horseman, pass by!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Drumcliffe_-_Colourful_Gravesite_east_of_Tea_House_%5E_Craft_Store_-_geograph.org.uk_-_3746360.jpg/512px-Drumcliffe_-_Colourful_Gravesite_east_of_Tea_House_%5E_Craft_Store_-_geograph.org.uk_-_3746360.jpg",
      "title": "Drumcliffe - Colourful Gravesite east of Tea House & Craft Store by Joseph Mischyshyn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Drumcliffe graveyard"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Beef_and_Benbulbin_-_geograph.org.uk_-_2537827.jpg",
      "title": "Beef and Benbulbin by Jonathan Wilkins, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cattle with the mountain in the background."
    }
  ],
  "distance_km": 5.6,
  "description": "This circular loop walk explores the Benbulben Forest in County Sligo. The walk starts at the car park and then follows trails towards the towering Benbulben Mountain. The striking mountains is part of the Dartry Mountains, in an area sometimes called \"Yeats Country\". The peaceful woods include lots of wildlife and some excellent views towards the surrounding mountains. To continue your walking in the area head to the nearby Mullaghmore Head where you can enjoy some fine views to the historic Castle Classiebawn and back to Benbulben Mountain.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the south you can enjoy some post walk refreshments at the Pink Clover cafe. Customers can enjoy fresh bakes, homemade jams, and water kefir. Here you can also visit the grave of W.B. Yeats at the adjacent Drumcliffe Cemetery. You can find them at postcode F91 ECF5."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south there's the delightful village of Rosses Point where you can enjoy some lovely coastal walks, pretty beaches and fine views over Sligo Bay. Near here there's the Killaspugbrone Loop and Knocknarea where you can see one of Ireland's largest cairns and enjoy glorious views over the Cúil Irra peninsula. To the south east there's Lough Gill where there's some pleasant lakeside trails, woodland paths and lots of birds to look out for on the lough's islands. You can pick up the long distance Sligo Way here too."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZJ3x2-EN6eA?si=CnTdKbypYH4LzgfZ",
  "gazetteer_found": false
}