{
  "created_at": "2025-01-06T02:04:58.635942+00:00",
  "objectID": "ff9e54aa66cc45f71b54bb8c49d32807",
  "ref": "lambourn-valley-way-walking-route",
  "title": "Lambourn Valley Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Lambourn_Valley_Way_-_geograph.org.uk_-_918465.jpg",
  "nearby": [
    {
      "description": "Donnington Castle",
      "objectID": "c1df7e2b067d4bd9c38937d9c50a5648",
      "ref": "donnington-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/ff9e54aa66cc45f71b54bb8c49d32807.gpx",
  "_geoloc": {
    "lat": 51.5767326866,
    "lng": -1.5786163395
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Lambourn_Valley_Way_-_geograph.org.uk_-_918465.jpg",
      "title": "Graham Horn / Lambourn Valley Way",
      "caption": "Here the way uses the trackbed of the former Lambourn Valley railway that ran from Newbury to Lambourn. Thus, easy level walking. The railway opened in 1898 and was closed to passenger traffic in 1960. A section between Newbury and Welford remained open for freight traffic to RAF Welford until 1972. Steam railmotors and a GWR diesel railcar were used on the line, as well as steam engines owned by the Lambourn valley Railway, and Great Western Railway standard engines."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Stile_on_the_Lambourn_Valley_Way_at_Welford_-_geograph.org.uk_-_74106.jpg",
      "title": "Pam Brophy / Stile on the Lambourn Valley Way at Welford",
      "caption": "Stile on the Lambourn Valley Way at Welford. The square is largely farmland and Weston Park land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/River_Lambourn%2C_East_Garston%2C_Berkshire.jpg/512px-River_Lambourn%2C_East_Garston%2C_Berkshire.jpg",
      "title": "Philipjelley, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "River Lambourn, East Garston, Berkshire. The waterway flows through the village, dividing many houses from the main road, so that each has a bridge over the river to the front door. The river is defined as a chalk stream, rising in the Berkshire Downs near its namesake village of Lambourn. It is a tributary of the River Kennet, which is itself a tributary of the River Thames."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Lambourn_valley_farmland_-_geograph.org.uk_-_230029.jpg",
      "title": "Andrew Smith / Lambourn valley farmland",
      "caption": "Lambourn valley farmland. Looking across a small valley, an offshoot of the main valley. The western flank has a shallow gradient. The eastern flank, shielded from view, is much steeper and is grassland. Gallops are in the bottom of the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Uffington_Down_-_geograph.org.uk_-_647248.jpg",
      "title": "Andrew Smith / Uffington Down",
      "caption": "Uffington Down. Here a walker can be seen heading along the bridleway immediately to the south of the Ridgeway. The bridleway is part of the Lambourn Valley Way and is to the left of the fence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Farmland%2C_Coldborough_-_geograph.org.uk_-_230185.jpg",
      "title": "Andrew Smith / Farmland, Coldborough",
      "caption": "Farmland, Coldborough. Looking up a small dry valley into the downs above the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Lambourn_Valley_Way_-_geograph.org.uk_-_2301941.jpg/512px-Lambourn_Valley_Way_-_geograph.org.uk_-_2301941.jpg",
      "title": "Lambourn Valley Way by Des Blenkinsopp, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A horse poses for the camera in a farm at Lambourn village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/High_Street%2C_Lambourn._geograph-2312396-by-Des-Blenkinsopp.jpg/512px-High_Street%2C_Lambourn._geograph-2312396-by-Des-Blenkinsopp.jpg",
      "title": "Des Blenkinsopp / Lambourn High Street",
      "caption": "High Street, Lambourn. After Newmarket the village is the largest centre of racehorse training in England, and is home to a rehabilitation centre for injured jockeys, an equine hospital, and several leading jockeys and trainers. To the north of the village are the prehistoric Seven Barrows and a nearby long barrow."
    }
  ],
  "distance_km": 35.0,
  "description": "Travel from Oxfordshire into Berkshire along the Lambourn Valley Way and enjoy woodland, parkland and a series of quaint towns and villages. The walk starts at the Bronze age fort at Uffington Castle and the distinctive prehistoric Uffington White Horse hill figure. From here you head south across the Lambourn Downs before following the River Lambourn through Lambourn, Boxford and Speen before a lovely stretch along the Kennet and Avon Canal takes you into Newbury. Here you could visit Donnington Castle which lies just off the route. The medieval castle is surrounded by attractive farmland and peaceful woodland. It's a nice place to stop for a picnic and learn about the history of the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Newbury you will find the delightful Tea Shop By The Canal which is perfect for afternoon tea. Set in an interesting old Grade II listed building the tea shop blends the comfort and warmth of Italian culture with the fine and splendid rituals of English Cream Teas. There's also outdoor seating so you can sit out right next to the canal on warm summer days. You can find it at The Stone Building, The Wharf, Newbury with a postcode of RG145AS.The village of Uffington is also a good place to stop at and explore further. The Fox & Hounds is a good option with a great menu and a nice outdoor seating area. The Pub has 4 Star B&B accommodation, a beamed bar, and unrivalled views of The Ridgeway and Uffington White Horse. It makes a great base for exploring this lovely area. You can find the pub in the centre of the village on the High Street, with a postcode of SN77RP for your sat navs.The interesting village also has some pretty thatched cottages and a noteworthy old church which dates from the 13th century. It also has strong literary connections as John Betjeman lived there in the 1930's and 40's, during which time he wrote many famous works. JRR Tolkein, while based in Oxford, visited this area, and it is said much of his inspiration for Middle Earth came from the Ridgeway nearby."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ok3NPDwIKWI",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Woolstone, Vale of White Horse, Oxfordshire, England, SN7 7ZB, United Kingdom",
  "postcode": "SN7 7ZB",
  "district": "Vale of White Horse",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "villages"
  ],
  "facilities": [
    "picnic",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}