{
  "objectID": "ffa8058905315f9f53279aea9ea9ae62",
  "created_at": "2024-12-18T09:59:17.526110+00:00",
  "ref": "menai-bridge-walking-route",
  "title": "Menai Bridge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Strollers_on_the_Belgian_Promenade_-_geograph.org.uk_-_381644.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/B7D7183CECB6880D8025848600329F38/$FILE/Menai Bridge.gpx",
  "_geoloc": {
    "lat": 53.2248395464,
    "lng": -4.1675810749
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Strollers_on_the_Belgian_Promenade_-_geograph.org.uk_-_381644.jpg",
      "title": "Eric Jones / Strollers on the Belgian Promenade, via Wikimedia Commons",
      "caption": "Strollers on the Belgian Promenade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Belgian_Promenade%2C_Menai_Bridge_-_geograph.org.uk_-_1718121.jpg/512px-Belgian_Promenade%2C_Menai_Bridge_-_geograph.org.uk_-_1718121.jpg",
      "title": "David Dixon / Belgian Promenade, Menai Bridge, via Wikimedia Commons",
      "caption": "Belgian Promenade, Menai Bridge. Viewed from the causeway to Church Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Menai_Suspension_Bridge_%287604%29.jpg/512px-Menai_Suspension_Bridge_%287604%29.jpg",
      "title": "Nilfanion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Menai Suspension Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Part_of_the_Treborth_Botanical_Gardens_-_geograph.org.uk_-_383386.jpg",
      "title": "Eric Jones / Part  of the Treborth Botanical Gardens, via Wikimedia Commons",
      "caption": "Part of the Treborth Botanical Gardens. The gardens cover an area of 40 acres and contain over 20,000 species of flora and fauna."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Pont_Britannia_-_geograph.org.uk_-_785663.jpg",
      "title": "Eirian Evans / Pont Britannia, via Wikimedia Commons",
      "caption": "Pont Britannia. The bridge carries road and rail traffic over the Menai Straits."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Menai_Bridge_from_Marquis_of_Anglesey%27s_Column_-_geograph.org.uk_-_455494.jpg",
      "title": "Chris Downer / Menai Bridge from Marquis of Anglesey’s Column, via Wikimedia Commons",
      "caption": "The top of the Marquis of Anglesey\u0092s Column provides a fine view of the Menai Bridge."
    }
  ],
  "distance_km": 5.5,
  "description": "This walk explores the area around the Anglesey town of Menai Bridge. You'll enjoy wonderful views over the Menai Strait as you cross the water on the bridge of the same name. You'll also visit the lovely Treborth Botanic Garden, one of the highlights of the area. The walk starts in the car park at Menai Bridge, just north of the bridge and close to Church Island. From here you can pick up footpaths heading south along the delightful Belgian Promendade where there are views towards the suspension bridge. The path leads to the bridge which you cross to mainland Wales. The impressive structure was designed by Thomas Telford and completed in 1826. It is also Grade I listed. After crossing the bridge head west to the Treborth Botanic Garden. The garden has extensive outdoor grounds which extend all the way down to the shore of the Menai Strait. The grounds feature large areas of woodland, rock gardens, orchard and wildflower meadows alongside traditional outdoor planting. There's also a nice cafe with an outdoor seating area, where you could stop for refreshments. After exploring the gardens the route comes to the Britannia Bridge or Pont Britannia. This road bridge also crosses the Menai Strait which was originally designed and built by the noted railway engineer Robert Stephenson. The route then returns on the same paths back to the Menai Bridge and the car park. To continue your walking in the area head north east from the bridge and visit the popular coastal town of Bangor . Here you can visit the Roman Camp and climb to Bangor Mountain for fine views of the bridge. The Anglesey Coast Path also passes the bridge. This long distance waymarked trail is a fine way of exploring the area.",
  "video_url": "https://www.youtube.com/embed/Dwc653QdyEM",
  "district": "Porthaethwy / Menai Bridge",
  "county": "Sir Ynys Mon - Isle of Anglesey",
  "region": "Wales",
  "country": "Wales"
}