{
  "created_at": "2025-01-06T01:01:19.488749+00:00",
  "objectID": "ffce7186676628e9e8e86373e1b1f887",
  "ref": "loddiswell-walking-route",
  "title": "Loddiswell Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/94/Loddiswell_station_-_geograph.org.uk_-_1297064.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/f/ffce7186676628e9e8e86373e1b1f887.gpx",
  "_geoloc": {
    "lat": 50.3232032266,
    "lng": -3.798484953
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Loddiswell_station_-_geograph.org.uk_-_1297064.jpg",
      "title": "Derek Harper / Loddiswell station",
      "caption": "The old Loddiswell station. The station was closed in 1963; the buildings presumably date from 1893, the year the station opened. \"Loddiswell was among the first sites to have Camping Coaches (The GWR called them 'Camp Coaches'). Old coaches were 'converted' to provide holiday accommodation and sited in sidings at attractive locations. You had to arrive by train, no great hardship in days before universal car ownership. Water was available from a stand-pipe at Loddiswell which was hardly convenient being at the far end of the station yard in the Cattle Dock. However at least an unending supply was available, at Avonwick the water had to be sent in Milk Churns by train. These were not particularly cheap holidays but must certainly have been very restful by any standard.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Bluebells_in_Woodleigh_Wood_-_geograph.org.uk_-_1297209.jpg/256px-Bluebells_in_Woodleigh_Wood_-_geograph.org.uk_-_1297209.jpg",
      "title": "Derek Harper / Bluebells in Woodleigh Wood",
      "caption": "Bluebells in Woodleigh Wood in the spring"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/The_River_Avon_-_geograph.org.uk_-_2473158.jpg/512px-The_River_Avon_-_geograph.org.uk_-_2473158.jpg",
      "title": "The River Avon by Tony Atkin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The River Avon in Woodleigh Woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Approaching_Loddiswell_Mill_Bridge_-_geograph.org.uk_-_1296747.jpg",
      "title": "Derek Harper / Approaching Loddiswell Mill Bridge",
      "caption": "Approaching Loddiswell Mill Bridge. The bridge, across the River Avon, is on the left, on the lane to Loddiswell. But the buildings associated with the former mill, beyond the river, are now called \"Avon Mill\". The lane on the right continues to the former station, a full kilometre from the village as the crow flies, without all the turns in the lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Avon_valley_below_Loddiswell_-_geograph.org.uk_-_1295973.jpg",
      "title": "Derek Harper / Avon valley below Loddiswell",
      "caption": "Avon valley below Loddiswell. Taken from beside Great Gate Farm, at the junction of the old and new roads down the hill to the river, which is seen here below the Mill Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Weir_on_River_Avon_below_Loddiswell_-_geograph.org.uk_-_188001.jpg",
      "title": "Derek Harper / Weir on River Avon below Loddiswell",
      "caption": "Weir on River Avon below the village. A modest weir on the tree lined river, seen from the lane between Newmill Bridge and the Mill Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Newmill_Bridge_-_geograph.org.uk_-_1296096.jpg",
      "title": "Derek Harper / Newmill Bridge",
      "caption": "The 18th century Newmill Bridge. Looking across from the left bank of the River Avon, at the T-junction with the lane up the valley past the station. This lane was the former main road to the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/By_the_Loddiswell_Inn_-_geograph.org.uk_-_1295928.jpg",
      "title": "Derek Harper / By the Loddiswell Inn",
      "caption": "By the Loddiswell Inn. Buildings by the inn (right) at the start of South Brent Road in the centre of the village."
    }
  ],
  "distance_km": 8.0,
  "description": "This Devon based village has some lovely walking trails to follow through the Avon Valley. There's also a noteworthy 14th century church and the old Loddiswell Railway Station to visit. This circular walk from the village explores the surrounding countryside on a mixture of footpaths and country lanes. On the way there's some nice riverside paths along the River Avon and some pleasant woodland trails to enjoy. The walk starts in the village and heads east to link up with the riverside footpath. Follow the path north and you can then cross over to the other side into Woodleigh Woods. It's a pretty place with the river running through the peaceful woods which include plenty of bluebells in the spring months. The route then heads south past Wrinkley, Newmill Bridge and the remains of the old Loddiswell Rail Station. Near Culverwell you cross the river again and follow footpath north to return to the village. You could extend the walk by heading a couple of miles south east to the neighbouring village of Aveton Gifford. Here you can pick up the Avon Estuary Walk, a long distance footpath which will take you to the coast at Bigbury on Sea where you could visit the lovely Burgh Island. Near here you can also link up with the Thurlestone and Bantham Walk. On this coastal walk you'll visit the National Trust's lovely South Milton beach, the striking Thurlestone Rock Arch and a great beachside seafood cafe. For more information on the village including it's interesting history see the wikipedia page.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy post walk refreshment at the Loddiswell Inn. They serve good quality food and have a garden area. You can find them at postcode TQ7 4QJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk. The local inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south you can try the Salcombe and Kingsbridge Estuary Walk or the Kingsbridge and Bowcombe Creek Walk. The estuary in the popular market town is a fine place for a stroll, with lots of boats and birdlife to see. Just a couple of miles to the north there's the climb to Blackdown Rings. Here you'll find an Iron Age Hillfort commanding some excellent views over the surrounding area. The pretty Andrew's Wood Nature Reserve is located very close to the hill as well. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/llECibCd3zk",
  "district": "South Hams",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Well Street, Loddiswell, South Hams, Devon, England, TQ7 4SB, United Kingdom",
  "postcode": "TQ7 4SB",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "coastal"
  ],
  "points_of_interest": [
    "historical sites",
    "river views",
    "woodland"
  ],
  "facilities": [
    "car park",
    "beachside cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}