{
  "objectID": "ffe3a70c62f7fe612bcbb7f9c78e3fca",
  "created_at": "2024-12-18T05:44:31.828431+00:00",
  "ref": "wiveton-downs-walking-route",
  "title": "Wiveton Downs Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Wiveton_Downs_-_geograph.org.uk_-_1062740.jpg",
  "nearby": [
    {
      "description": "Blakeney Circular Walk",
      "objectID": "7ff7cf713beb85f916e3e552e5020f29",
      "ref": "blakeney-circular-walk-walking-route"
    },
    {
      "description": "Blakeney Point Nature Reserve",
      "objectID": "2522c877fea31a0d119931d386891c5b",
      "ref": "blakeney-point-nature-reserve-walking-route"
    },
    {
      "description": "Blakeney to Cley Walk",
      "objectID": "bdf4183dcbd83d467e0ff47c8ff060f3",
      "ref": "blakeney-to-cley-walk-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/DD037D631D0A8F48862586CF00384270/$FILE/Wiveton Downs.gpx",
  "_geoloc": {
    "lat": 52.9385248892,
    "lng": 1.0222475099
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Wiveton_Downs_-_geograph.org.uk_-_1062740.jpg",
      "title": "Ian Capper / Wiveton Downs",
      "caption": "Wiveton Downs. Part of Blakeney Eske on a section where quarrying has taken place in the past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/The_Blakeney_Esker_SSSI_-_geograph.org.uk_-_841114.jpg/256px-The_Blakeney_Esker_SSSI_-_geograph.org.uk_-_841114.jpg",
      "title": "Evelyn Simak / The Blakeney Esker SSSI",
      "caption": "The Blakeney Esker SSSI. An information board by the footpath informs about this geological feature which was created during the Quaternary period by melt water from glaciers forming a tunnel beneath the ice, and carrying large quantities of sand, gravel and flint that the glaciers had scraped out. When the glaciers retreated these tubes of sediment were left behind leaving the features visible today. The southern end of the Esker (Wiveton Downs) represents one of the very best examples of an Esker formation to be seen anywhere, and this is the reason for its SSSI designation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Wiveton_Downs_-_geograph.org.uk_-_113424.jpg",
      "title": "Jeremy Halls / Wiveton Downs",
      "caption": "Gorse on the downs. Wiveton Downs is a Site of Special Scientific Interest of geological and wildlife interest. The view is from the north side of the ridge looking across towards Wiverton and the coast beyond. View north from the Downs. A Rowan tree in berry adds colour to the scene. In the background can be seen the tower of the church of St Nicholas, Blakeney."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/North_from_Wiveton_Down_-_geograph.org.uk_-_928839.jpg",
      "title": "Ian Capper / North from Wiveton Down",
      "caption": "North from Wiveton Down"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Wiveton_Bridge_-_geograph.org.uk_-_841511.jpg",
      "title": "Evelyn Simak / Wiveton Bridge",
      "caption": "Wiveton Bridge. This old bridge spanning the River Glaven is located a short distance south of St Mary's church - it has a single arch and dates from the 15th century. A chapel once used to stand close by the bridge and it is believed that the brick buttress platform on one corner of the bridge might be associated with it. No trace remains of the chapel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Possible_remains_of_an_old_chapel_-_geograph.org.uk_-_841506.jpg/256px-Possible_remains_of_an_old_chapel_-_geograph.org.uk_-_841506.jpg",
      "title": "Evelyn Simak / Possible remains of an old chapel",
      "caption": "Possible remains of an old chapel in Wiveton village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/The_Wiveton_Bell_-_geograph.org.uk_-_841473.jpg",
      "title": "Evelyn Simak / The Wiveton Bell",
      "caption": "The Wiveton Bell Public house adjoining the village green, beside Blakeney Road. The village of Wiveton is situated on the west bank of the River Glaven, about one kilometre distant, across the river, from the village of Cley next the Sea. Wiveton has a population of about 160; some of the houses are second homes with the owners absent for most of the year. Until the 17th century, when the River Glaven was still navigable, Wiveton had a harbour, the outline of which can be seen in the fields separating it from Cley. There is a medieval bridge a short distance south of the church. The village made headlines in 1779, when the then newly-appointed Rector, James Hackman, was hanged for murdering Martha Ray, the mistress of John Montagu, 4th Earl of Sandwich (who is credited with inventing the sandwich)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Approaching_Wiveton_from_the_east_-_geograph.org.uk_-_841540.jpg",
      "title": "Evelyn Simak / Approaching Wiveton from the east",
      "caption": "Approaching Wiveton from the east. The view was taken from Wiveton Bridge which spans the River Glaven a short distance south of St Mary's church (seen here). Stonebridge House can be seen in mid-distance."
    }
  ],
  "distance_km": 1.0,
  "description": "The Wiveton Downs are located close to the Norfolk coast, near Blakeney. The Nature Reserve is lovely peaceful place for a stroll with footpaths, gorse, an old quarry, woodland and grassland to explore. You can start the walk from the nature reserve car park off Bazzy Lane at a postcode of NR25 7SN for your sat navs. From here you can pick up various footpaths across the downs where there are nice views of the surrounding coast and countryside and lots of flora and fauna to look out for. After exploring the downs head north east into Wiveton village where there's a splendid old church and a fine pub for post walk refreshment.",
  "video_url": "https://www.youtube.com/embed/DuMlJxwlHzg",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}