{
  "objectID": "70083df2005329dc08d8bc36b082e719",
  "created_at": "2024-12-19T06:54:22.543112+00:00",
  "ref": "foggintor-quarry-walking-route",
  "title": "Foggintor Quarry Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Dartmoor%2C_Former_Yelverton_to_Princetown_railway_-_geograph.org.uk_-_1012111.jpg",
  "nearby": [
    {
      "description": "Princetown",
      "objectID": "e262f139bed90e80eb60a8565de92a2c",
      "ref": "princetown-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Burrator Reservoir",
      "objectID": "24268f72cbf85f5bc56de8e5c5b2175b",
      "ref": "burrator-reservoir-walking-and-cycle-route"
    },
    {
      "description": "Great Staple Tor",
      "objectID": "c1f0f6a46572315d84ac4917828ff204",
      "ref": "great-staple-tor-walking-route"
    },
    {
      "description": "Merrivale",
      "objectID": "9354380e6125b648c9901e7a08d142a7",
      "ref": "merrivale-walking-route"
    },
    {
      "description": "Great Mis Tor",
      "objectID": "92b827d0ffa464f3f31524a5a6a46a44",
      "ref": "great-mis-tor-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/AF5FBB9B2C8224628625869600404454/$FILE/Foggintor Quarry.gpx",
  "_geoloc": {
    "lat": 50.5446380732,
    "lng": -3.991558014
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Dartmoor%2C_Former_Yelverton_to_Princetown_railway_-_geograph.org.uk_-_1012111.jpg",
      "title": "Nigel Cox / Dartmoor: Former Yelverton to Princetown railway",
      "caption": "Dartmoor: Former Yelverton to Princetown railway. You can follow this trail to the quarry from Princetown. It is the trackbed of the former Yelverton to Princetown railway that opened in 1883 and closed in 1956. Here the railway traverses the slopes of North Hessary Tor, near the quarry. The trackbed here now forms a section of the long distance footpath of the Dartmoor Way. The distant tors visible are, left to right, King's Tor in SX5573, Middle Staple Tor and Great Staple Tor in SX5475, Roos Tor in SX5476, and White Tor in SX5478."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Foggintor_Quarry_-_geograph.org.uk_-_224168.jpg",
      "title": "Brett Sutherland / Foggintor Quarry",
      "caption": "Foggintor Quarry. The flooded pits at Foggintor Quarry. The sheer face gives some idea of the enormous amount of Dartmoor granite removed from the site. The quarry is notable for having supplied the stone for Nelson's Column."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Princetown%2C_Bridge_on_the_former_Yelverton_to_Princetown_railway_-_geograph.org.uk_-_1012086.jpg",
      "title": "Nigel Cox / Princetown: Bridge on the former Yelverton to Princetown railway",
      "caption": "Bridge on the former Yelverton to Princetown railway. This is the other side of Gwyn's 58438. The railway was built on an embankment here across the side slope of North Hessary Tor, and the bridge was built to allow surface water to flow off the moor creating a tributary of the River Walkham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Dartmoor%2C_Swelltor_Quarries_-_geograph.org.uk_-_1012225.jpg",
      "title": "Nigel Cox / Dartmoor: Swelltor Quarries",
      "caption": "Swelltor Quarries. The whole of the original top of Swelltor was quarried for granite. This is the old lower quarry. A railway was needed to take away all the quarried granite. Parts of London bridge were quarried from here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Disused_Princetown_Railway_Bridge%2C_King%27s_Tor_-_geograph.org.uk_-_225981.jpg",
      "title": "Brett Sutherland / Disused Princetown Railway Bridge, King's Tor",
      "caption": "Disused Princetown Railway Bridge, King's Tor. A sturdy bridge carrying the Plymouth and Dartmoor Railway as it approached Little King Tor. A couple of Dartmoor ponies are taking shelter from the wind in its archway. The line, which opened in 1823, was constructed as a tramroad to carry stone from Foggintor Quarry off the moor. It was later adapted in 1882 as the GWR branch line from Yelverton to Princetown. The line finally closed in March 1956 due to dwindling use (prior to the Beeching cuts), and the track removed a year later."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Dartmoor%2C_King%27s_Tor_-_geograph.org.uk_-_1012356.jpg",
      "title": "Nigel Cox / Dartmoor: King's Tor",
      "caption": "King's Tor. None of the current Ordnance Survey maps gives a height for King's Tor but Victorian versions show a spot level of 1314 feet, presumably for the highest point, which is almost exactly 400 metres above sea level. A group of people on top give an indication of scale. Possibly because the quality of the granite was not as good as to be found in the neighbouring tors, Foggintor and Swelltor, King's Tor has only slightly been altered by quarrying works."
    }
  ],
  "distance_km": 9.0,
  "description": "This circular walk visits the Foggintor Quarries near Princetown on Dartmoor. The route also climbs to the nearby King's Tor for fine views over the area. The walk starts from the public car park in the village of Princetown, just to the east of the site. From here you can pick up a section of the Dartmoor Way and follow the waymarked footpath west along a dismantled railway line. After about 1.5 miles you turn north to follow a footpath to the quarry. Here you'll find a tranquil lake surrounded by the atmospheric quarry ruins. It's a photogenic spot which also gives an insight into the areas mining heritage. After exploring the quarry you continue west to visit the neighbouring Swelltor Quarries before climbing up to King's Tor. There's excellent views over the National Park from this elevated location. The trail then loops around the hill before returning to Princetown on an alternative bridleway.",
  "video_url": "https://www.youtube.com/embed/Jt3lTGVa-84",
  "postcode": "PL20 6QE",
  "district": "Princetown",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}