{
  "created_at": "2025-01-06T03:44:30.355257+00:00",
  "objectID": "705973cabe99c6073beafed1b32ae235",
  "ref": "stock-ghyll-force-walking-route",
  "title": "Stock Ghyll Force Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/24/Stockghyll_Falls_-_geograph.org.uk_-_12551.jpg",
  "nearby": [
    {
      "description": "Wansfell Pike",
      "objectID": "c93de37c2f64e0729e16b17534f646b9",
      "ref": "wansfell-pike-walking-route"
    },
    {
      "description": "Ambleside",
      "objectID": "6fe5f39486b7c84acaa4072c9ba5d1c1",
      "ref": "ambleside-walking-route"
    },
    {
      "description": "Jenkin's Crag",
      "objectID": "7a4f317fa0fce2a0c90f05728a993155",
      "ref": "jenkins-crag-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/705973cabe99c6073beafed1b32ae235.gpx",
  "_geoloc": {
    "lat": 54.4320659878,
    "lng": -2.9611579342
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Stockghyll_Falls_-_geograph.org.uk_-_12551.jpg",
      "title": "Ian Adams / Stockghyll Falls",
      "caption": "Stockghyll Falls 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Stockghyll_Force_-_geograph.org.uk_-_1332905.jpg/256px-Stockghyll_Force_-_geograph.org.uk_-_1332905.jpg",
      "title": "DS Pugh / Stockghyll Force",
      "caption": "Stockghyll Falls 2. The falls are surrounded by woodland with beech the most popular type. In the spring months lots of pretty daffodils can be seen in the area around the falls."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Waterwheel_on_the_side_of_Stock_Ghyll_off_North_Road_-_geograph.org.uk_-_1553075.jpg",
      "title": "Alexander P Kapp / Waterwheel on the side of Stock Ghyll off North Road",
      "caption": "Waterwheel on the side of Stock Ghyll off North Road in Ambleside. The Stock Gill Beck flows for roughly four miles from Red Screes hill through the town of Ambleside to the River Rothay. You can continue your walk through the nearby Rothay Park which lies on the western side of Ambleside. Stock Ghyll has been painted by numerous well known artisits including J. M. W. Turner, John Ruskin, Kurt Schwitters, and many others."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Bridge_House%2C_Ambleside_-_geograph.org.uk_-_1733267.jpg/256px-Bridge_House%2C_Ambleside_-_geograph.org.uk_-_1733267.jpg",
      "title": "David Dixon / Bridge House, Ambleside",
      "caption": "Bridge House, Ambleside. This tiny stone-built house straddling Stock Ghyll and standing next to the main A591 road in Ambleside is probably one of the Lake District's best known and most photographed landmarks. The tiny building is originally thought to have been a summer house and/or an apple store for nearby Ambleside Hall. Dating from the 16th century, it was built over Stock Ghyll to escape land tax. It has also been said that at some time a family with six children lived here in the two rooms. It is now a shop for the National Trust."
    }
  ],
  "distance_km": 1.0,
  "description": "This walk takes you to the beautiful Stock Ghyll Force waterfall in Ambleside, in the Lake District. The waterfall is just a short walk from the centre of Ambleside. From here you walk to Stockgyhll Lane where there is a sign saying 'To the Waterfalls'. Bear left here to enter Stock Ghyll Woods where you follow shady paths along Stock Ghyll Beck to the main falls. Here you will find a railed viewpoint from which you can watch the spectacular 70 foot high waterfall. It's a lovely wooded climb with a series of smaller waterfalls to enjoy on the way. If you would like to continue your walk you could climb Wansfell Pike for fabulous views of the Coniston Fells, Fairfield, Lake Windermere and Red Screes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Ambleside head to the Unicorn Inn for some refreshments after your walk. This quintessential traditional Lakeland public house is the oldest pub in Ambleside, dating back to the 18th century. They do good home cooked food and have a fine selection of ales. You can find the pub in the town at postcode LA22 9DT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails makes for a fine walk with your dog and the Unicorn Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you enjoy this walk then there's another short woodland climb to Jenkin's Crag to try. It's located just to the south of the town and includes a visit to the National Trust's Stagshaw Gardens before climbing to the viewpoint over Windermere. For more walking ideas in the area see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YVx2TgTWcQw",
  "postcode": "LA22 9BX",
  "district": "Ambleside",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}