{
  "created_at": "2025-01-06T04:03:14.300362+00:00",
  "objectID": "70ebaf52e62a1a06f0d49acead15b0cd",
  "ref": "bigbury-on-sea-walking-route",
  "title": "Bigbury on Sea Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Signpost_on_coast_path%2C_Bigbury-on-Sea_-_geograph.org.uk_-_1474876.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/70ebaf52e62a1a06f0d49acead15b0cd.gpx",
  "_geoloc": {
    "lat": 50.285362484,
    "lng": -3.8959180779
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Signpost_on_coast_path%2C_Bigbury-on-Sea_-_geograph.org.uk_-_1474876.jpg",
      "title": "Derek Harper / Signpost on coast path, Bigbury-on-Sea",
      "caption": "Signpost on coast path, Bigbury-on-Sea. A signpost on Marine drive directs walkers along the top of slumped cliffs at the village, towards the sand that connects (except at high tide) Burgh Island to the mainland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Bigbury-on-Sea_-_geograph.org.uk_-_1733946.jpg/512px-Bigbury-on-Sea_-_geograph.org.uk_-_1733946.jpg",
      "title": "Glen Denny / Bigbury-on-Sea",
      "caption": "The view of Bigbury-on-Sea from the Pilchard Inn on Burgh Island, with the causeway exposed at low tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Thurlestone%2C_near_Stiddicombe_Wood_-_geograph.org.uk_-_632479.jpg",
      "title": "Martin Bodman / Thurlestone: near Stiddicombe Wood",
      "caption": "Thurlestone: near Stiddicombe Wood. A view upstream on a public footpath from Bantham with the Avon estuary at low tide. Stiddicombe Wood on the right"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Thurlestone%2C_Jenkins_Quay%2C_Bantham_-_geograph.org.uk_-_1551511.jpg",
      "title": "Martin Bodman / Thurlestone: Jenkins Quay, Bantham",
      "caption": "Thurlestone, Jenkins Quay, Bantham. Near the mouth of the Avon, on Bantham Ham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Avon_Estuary_-_geograph.org.uk_-_286524.jpg",
      "title": "Ian Nadin / Avon Estuary",
      "caption": "Avon Estuary. After a delightful crossing aboard the diminutive Bantham ferry operated by the harbour master and his dog, you are rewarded with this view of Burgh Island. The island, cut off at high tide, is occupied by a hotel that was apparently frequented by Agatha Christie, and the medieval Pilchard Inn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Aveton_Gifford%2C_near_North_Efford_-_geograph.org.uk_-_632485.jpg",
      "title": "Martin Bodman / Aveton Gifford: near North Efford",
      "caption": "Aveton Gifford, near North Efford. The River Avon, looking upstream on a December afternoon at low tide"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Creek_near_Milburn_Orchard_-_geograph.org.uk_-_1574698.jpg",
      "title": "Tony Atkin / Creek near Milburn Orchard",
      "caption": "Creek near Milburn Orchard. A tidal creek leading into the Avon Estuary. Taken from the Tidal Road at the mouth of the creek."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Bigbury%2C_towards_Green_Well_-_geograph.org.uk_-_632481.jpg",
      "title": "Martin Bodman / Bigbury: towards Green Well",
      "caption": "Bigbury: towards Green Well. With the quay at Villa Crusoe beyond, on the left and the River Avon at low tide. Seen from a point near Stiddicombe Wood on a public path from Bantham"
    }
  ],
  "distance_km": 16.0,
  "description": "This attractive seaside village is located in the South Hams area of South Devon. It's a popular place for a walk with a beautiful beach, a fantastic tidal island, a river estuary and some splendid countryside. There's also a couple of noteworthy ancient pubs with a history dating back over 700 years. This route uses part of the Avon Estuary Walk and the South West Coast Path to create a circular walk around the village. On the way you'll visit Burgh Island and the neighbouring villages of Aveton Gifford and Bigbury. The route starts on the sea front in the village and heads over to the island. You can cross over on foot over the beach at low tide or catch the sea tractor run by the hotel on the island. The island has a strong assocation with Agatha Christie, serving as the inspirational setting for the mystery 'And Then There Were None'. After exploring the island you return to the mainland and head along the coast to Sharpland Point, Folly Hill and Cockleridge. Here you can catch the seasonal ferry over the Avon to Bantham on the opposite side. The route then picks up the Avon Estuary Walk and follows the waymarked footpath north east past Aunemouth Sands, Stiddicombe Wood, Stadbury Farm and Efford Farm before coming to Aveton Giffford Bridge. Here you cross the river to enter the village of Aveton Giffford. The pretty village lies at the head of the estuary of the River Avon and includes a 13th century church and the streamside Fisherman's Rest pub. After exploring the village you head south west along the other side of the river, passing Milburn Orchard, Bigbury village and Bigbury golf course. Shortly after passing around the course you descend back into Bigbury on Sea.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop off at the Journey's End for some refreshments. It's a pub of some note, dating all the way back to the 13th century. Inside there's a cosy interior with four fires and a lovely conservatory. Outside there's a large garden area for warmer days. They serve high quality food and can be found at Ringmore with a postcode of TQ7 4HL for your sat navs. On Burgh Island a visit to the 14th century Pilchard Inn is also recommended. The historic pub first served the fishermen who lived on the Island and mainland shores over 700 years ago; then the smugglers and wreckers who lured ships onto the Western rocks; and now hotel guests and the public. There's a nice outdoor area with views to enjoy with your meal. You can find them at postcode TQ7 4BG."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coast and country trails make for a fine dog walk. Dogs are welcome on the main beach from October to May, with the beach to the west of the causeway welcoming dogs throughout the year. It's best to keep them on leads in the Burgh Island area. The two old pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles east from the village and you could visit the neighbouring town of Kingsbridge. Here you can pick up the Kingsbridge and Bowcombe Creek Walk and the Salcombe and Kingsbridge Estuary Walk. There's some great wildlife spotting opportunities here. Also to the east you can pick up the coastal Hope Cove to Salcombe Walk. Head west along the coast path and you will soon come to the Erme Estuary and the lovely Wonwell Beach. A few miles to the north east there's the worthy village of Loddiswell where you can enjoy some fine trails through the River Avon Valley. The village includes an historic 14th century church and the old Loddiswell Railway Station as well. Near here there's the climb to the viewpoint and Iron Age Hillfort at Blackdown Rings. On the opposite side of the estuary you can explore Thurlestone and Bantham. Here you'll find the National Trust's lovely South Milton beach, the striking Thurlestone Rock Arch and a great beachside seafood cafe. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SuCm7MZZAWs",
  "postcode": "TQ7 4AU",
  "district": "Bigbury-on-Sea",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}