{
  "created_at": "2025-01-06T02:32:27.936997+00:00",
  "objectID": "710d2064a30083354f4a095646d8929a",
  "ref": "goblin-combe-walking-route",
  "title": "Goblin Combe Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Goblin_combe.jpg",
  "nearby": [
    {
      "description": "Two Rivers Way",
      "objectID": "9b0267da75d536c948959460dc124a94",
      "ref": "two-rivers-way-walking-route"
    },
    {
      "description": "Strawberry Line",
      "objectID": "2c27bd1da9e7f0906f9b5c9b22e1f99c",
      "ref": "strawberry-line-(yatton-to-chard)-walking-and-cycle-route"
    },
    {
      "description": "Cheddar Reservoir",
      "objectID": "e10c903d2daf1b8614b1867cc5a3e388",
      "ref": "cheddar-reservoir-walking-route"
    },
    {
      "description": "Cheddar Gorge",
      "objectID": "670588568e5784bafdbeb40078ef6507",
      "ref": "cheddar-gorge-walking-route"
    },
    {
      "description": "Axbridge",
      "objectID": "d999f5fa4a6a78a18465e1063b442905",
      "ref": "axbridge-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/710d2064a30083354f4a095646d8929a.gpx",
  "_geoloc": {
    "lat": 51.3853361213,
    "lng": -2.7788175794
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Goblin_combe.jpg",
      "title": "Doug Lee [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Goblin combe view. \"Combe\" is the same as the Welsh word \"cwm\" which means valley. The combe hosts a population of the nationally scarce stinking hellebore (Helleborus foetidus), growing on scree slopes. The presence of limestone fern (Gymnocarpum robertianum), another nationally scarce plant, is notable on limestone scree in this area. The site is also home to various other flowers such as autumn gentian, autumn ladies'-tresses, and yellow-wort. This diverse habitat supports a rich variety of butterflies, with over 30 species documented, including grizzled and dingy skippers, brown argus, and green hairstreak."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Cleeve_Wood_-_geograph.org.uk_-_277091.jpg",
      "title": "Philip White [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cleeve Wood. An ancient beech tree beside the path in Cleeve woods to the Combe. The Combe has a folk tale involving primroses: “There was a parcel of children and they was a-picking primroses, see, and one poor little dear her wandered away on her lone self right down into Goblin Combe. She were only a little trot, see, and didn't know no better. Well, when she do find she's a lost she cries, and the tears do run down her dear little face, and dap on her pinafore like summer rain, and she do throw her self against a rock. Then the rock opens and there's the fairies all come to comfort her tears. They do give her a gold ball and they lead the dear little soul safe home – on account she was carrying primroses, see. Well, twas the wonder of the village and the conjuror he gets the notion he'd aget his fists on more than one gold ball when next the fairies opened the hill. So he do pick a bunch of primroses and he go on up Goblin Combe, and he was glad enough to get in to the rock after all he see and hear on the way up. Well, twasn't the right day, nor the right number of primroses, and he wasn't no dear little soul – so they took him!“"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Goblin_Combe_-_geograph.org.uk_-_980847.jpg",
      "title": "Dr Duncan Pepper [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Goblin Combe. An SSSI of upland limestone with rare plants and dwarf yew. Excellent views to the S and W. The area includes the Goblin Combe Environment Centre which operates as a registered charity, offering educational training and residential facilities for various visiting groups. Situated within expansive woodland ridges at the beginning the Combe, the center is dedicated to providing diverse environmental education to people of all ages and from all sectors of the community. Leveraging the woodland surroundings, the center creates a unique teaching space, essentially a 'classroom without walls,' fostering a dynamic learning environment focused on natural history."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Goblin_Combe_cliffs_-_geograph.org.uk_-_901736.jpg",
      "title": "George Evans [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Goblin Combe cliffs. Looking towards King's Wood over the Combe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Cleeve_Toot_hill_fort_-_geograph.org.uk_-_277089.jpg",
      "title": "Philip White / Cleeve Toot hill fort",
      "caption": "Cleeve Toot hill fort. This is the information board for Cleeve Toot, a late bronze age or early iron age hill fort located just to the east of the car park, near the start of the walk. The site has not yet been excavated, and it now in dense woodland at the edge of Cleeve Wood. The settlement is roughly oval, measuring approximately 125 metres (410 ft) in length by 90 metres (300 ft) in breadth. About 150 metres (490 ft) to the north lies another, smaller settlement, believed to have functioned as a satellite community to nearby Cadbury Hill. Pits discovered at the site suggest the existence of round houses. The settlement is enclosed by a single stone rampart with a broad shallow outer ditch. Additionally, there is evidence of a prehistoric or Roman field system in the vicinity."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Goblin_Combe_-_geograph.org.uk_-_2422785.jpg",
      "title": "Goblin Combe by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking towards the combe from the western end near Bristol Airport."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Cleeve%2C_bluebell_wood_-_geograph.org.uk_-_62547.jpg",
      "title": "Martin Bodman / Cleeve: bluebell wood",
      "caption": "Cleeve, bluebell wood around Wrington."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Green_at_Cleeve_-_geograph.org.uk_-_2419963.jpg",
      "title": "Green at Cleeve by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Green at Cleeve village near the route start. The village is also located close to King's Wood and Urchin Wood, also designated as a Site of Special Scientific Interest (SSSI). It spans 128.1 hectares and provides a crucial habitat for diverse plant species. The site has a rich botanical history, with records dating back to the County Flora of 1893. This woodland is notably significant for its high diversity of vascular plants. Among them are populations of the nationally rare purple gromwell (Lithospermum purpurocaeruleum) and the scarce angular Solomon's seal (Polygonatum odoratum), adding to the ecological importance of the area. Cleeve Heronry, situated in the woodland near the village, serves as a nesting site for herons. The heronry was observed to have 40 nests in 1994 and 47 nests in 2007, indicating a substantial population. Notably, the heronry is equipped with CCTV, allowing interested individuals to view the activities within one of the nests during the spring when the birds are raising their chicks. This site, covering an area of 3.2 hectares, is owned by Avon Wildlife Trust, contributing to the conservation and observation of these fascinating birds."
    }
  ],
  "distance_km": 6.0,
  "description": "Explore this peaceful wooded valley on this lovely circular walk in North Somerset. The woods are located a few miles north east of Congresbury, near the small village of Cleeve. The site includes hundreds of acres of woodland, large areas of open grassland and some moderate climbs with great views towards the Mendip Hills. There's also limestone cliffs and limestone meadows with lots of wildflowers to look out for. You can start your walk from the car park on Cleeve Hill Road at the eastern end of the combe. Here you will find the Goblin Combe Environmental Centre, which provides educational training and residential facilities for visiting groups. From here you can pick up the footpaths heading east through the woods. Look out for a variety of woodland birds and butterflies including grizzled and dingy skippers, brown argus and green hairstreak. You can extend the walk by heading north through Wrington Warren to Brockley Wood. If you enjoy this walk then you could head west towards Yatton, and climb to Cadbury Hill Fort. In Congresbury you can pick up the Two Rivers Way and enjoy a walk along the River Yeo. At Yatton you can pick up the wonderful Strawberry Line cycling and walking trail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the south west of the site there's The Star for some post walk refreshment. They serve good quality food and have a garden area to sit out in during the warmer months. You can find them at Rhodyate Hill, Congresbury, BS49 5AJ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails are ideal for dog walking. You will probably bump into other owners with their pets on your visit."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head about a mile south west of the car park you could enjoy a climb to Cadbury Hill Fort. There's some splendid views over the area from this ancient site. You could also pick up the Congresbury Yeo and enjoy a pleasant riverside walk through the area. The circular Wrington Walk visits the site from the nearby village. The interesting settlement includes a noteworthy 13th century church and an excellent old world pub. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3dynwLQzjfs",
  "district": "Cleeve",
  "county": "North Somerset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}