{
  "objectID": "71211c1c6d3131c940dd9f8c85578495",
  "created_at": "2024-12-19T11:03:18.917389+00:00",
  "ref": "austwick-walking-route",
  "title": "Austwick Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a5/The_village_green_at_Austwick_-_geograph.org.uk_-_1650285.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/71211c1c6d3131c940dd9f8c85578495.gpx",
  "_geoloc": {
    "lat": 54.1125041413,
    "lng": -2.3559497626
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/The_village_green_at_Austwick_-_geograph.org.uk_-_1650285.jpg",
      "title": "Bill Boaden / The village green at Austwick",
      "caption": "The village green at Austwick In the centre is the Gamecock pub, with Thwaites beer and good food"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Rooftops_of_Austwick_-_geograph.org.uk_-_1650290.jpg",
      "title": "Bill Boaden / Rooftops of Austwick",
      "caption": "Rooftops of Austwick. This shows the limestone terrain around."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Austwick_Beck_-_upstream_from_Austwick_Bridge_-_geograph.org.uk_-_1727134.jpg",
      "title": "John S Turner / Austwick Beck - upstream from Austwick Bridge",
      "caption": "Austwick Beck - upstream from Austwick Bridge. Looking upstream along Austwick Beck from Austwick Bridge. The downstream side is much more shady. The light coloured 'mark' above the beck near the trees is a heron that didn't wait to be photographed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Austwick_Beck_-_downstream_from_Austwick_Bridge_-_geograph.org.uk_-_1727125.jpg",
      "title": "John S Turner / Austwick Beck - downstream from Austwick Bridge",
      "caption": "Looking downstream along the shady Austwick Beck from Austwick Bridge. The upstream side is open pasture land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Norber_erratics_-_geograph.org.uk_-_1503375.jpg",
      "title": "Gordon Hatton / Norber erratics",
      "caption": "Norber erratics. Erratic Ordovician greywacke boulders sit on Carboniferous limestone plinths on the hillside at Norber. This group of interest due to the sapling growing from a tiny patch of soil trapped in a groove on one of the boulders"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Clapham%2C_Yorkshire_Dales_National_Park_-_geograph.org.uk_-_204203.jpg",
      "title": "Kate Jewell / Clapham, Yorkshire Dales National Park",
      "caption": "Clapham, Yorkshire Dales National Park. Cottages by Brokken Bridge on Church Avenue. The Cave Rescue Organisation is based in Clapham."
    }
  ],
  "distance_km": 6.5,
  "description": "The delightful little village of Austwick is positioned nicely in the Yorkshire Dales National Park. This circular walk from the village visits the fascinating Norber Erratics before heading to the nearby village of Clapham. The walk runs for just over 4 miles with a moderate climb on the way. The walk starts in the village and follows a footpath north past Austwick Hall and Town head before climbing up to Norber Erratics. Here you'll find a set of glacial erratic boulders which were probably deposited by melting ice sheets at the end of the last ice age, around 12,000 years ago. The area includes some wonderful limestone scenery and fine views over the dales countryside. You then descend to the south west to pick up Thwaite Lane and follow it west into Clapham. The popular village has been home to the Farrer family who established their Ingleborough estate in the 18th century. The family owns, and is responsible for, much of the land, walls, woods, fields and moors of the village, surrounding countryside and farms. After exploring the village you can pick up another public footpath and follow it east back into Austwick.",
  "video_url": "https://www.youtube.com/embed/biH6B7gbOdc",
  "postcode": "LA2 8BN",
  "district": "Austwick",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England"
}