{
  "created_at": "2025-01-06T02:36:10.085992+00:00",
  "objectID": "715630ef54f84b19983f09e013c49885",
  "ref": "denmead-walking-route",
  "title": "Denmead Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/21/All_Saints%27_church%2C_Denmead_-_geograph.org.uk_-_741798.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/715630ef54f84b19983f09e013c49885.gpx",
  "_geoloc": {
    "lat": 50.9055834584,
    "lng": -1.0646014426
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/All_Saints%27_church%2C_Denmead_-_geograph.org.uk_-_741798.jpg",
      "title": "Peter Facey / All Saints' church, Denmead",
      "caption": "All Saints church, Denmead"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Track_in_Creech_Woods_-_geograph.org.uk_-_1027321.jpg",
      "title": "Chris Gunns / Track in Creech Woods",
      "caption": "Track in Creech Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Cottages%2C_Hoe_Gate_-_geograph.org.uk_-_379245.jpg",
      "title": "Robin Webster / Cottages, Hoe Gate",
      "caption": "Cottages, Hoe Gate. The foreground is part of Hoegate Common, which is access land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Approaching_Hole_Farm_on_Hole_Lane_-_geograph.org.uk_-_901823.jpg",
      "title": "Peter Facey / Approaching Hole Farm on Hole Lane",
      "caption": "Approaching Hole Farm on Hole Lane. A footpath crosses left to right in front of the garden fence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Hambledon%2C_High_Street_and_parish_church_-_geograph.org.uk_-_540886.jpg",
      "title": "Chris Downer / Hambledon: High Street and parish church",
      "caption": "Hambledon: High Street and parish church. Looking up the High Street at Hambledon, with cobbled pavements, with the parish church of St. Peter and St. Paul at the top of the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Rushmere_Pond_-_geograph.org.uk_-_898942.jpg",
      "title": "Peter Facey / Rushmere Pond",
      "caption": "Rushmere Pond"
    }
  ],
  "distance_km": 14.3,
  "description": "This Hampshire based village is in a great location for exploring the countryside and woodland of the surrounding Forest of Bere. This circular walk from the village uses sections of the Wayfarer's Walk and the King's Way to visit Creech Woods in the Forest of Bere and the neighbouring village of Hambledon. The walk starts in the village centre where you can pick up the Wayfarer's Walk and follow the waymarked footpath south through the town to Glenfield Farm and Furzeley Corner next to the golf course. The route then heads west to take you into Creech Woods where there are numerous footpaths to explore. In the woods you'll find conifers, heather and lots of woodland birds. At the western end of the forest you can link up with the King's Way near Apless Lane. Follow the trail north and it will take you towards Hambledon via Shirmal Farm and Hoe Gate. At Hambledon you can pick up the Wayfarer's Walk again and follow it south through the countryside to Denmead, passing Rushmere pond on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Fox and Hounds is a nice place to relax with some refreshment after your walk. There's a lovely sheltered patio garden with vines and clematis climbing a twinkling light covered pergola. There's also covered dining pods with heat and light so you can still dine outside if the weather is not too clever. They are located on the edge of the village at School Lane at postcode PO7 6NA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails make for ideal dog walking. The Fox and Hounds mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Denmead head west to visit the West Walk section of the Forest of Bere. There's miles of nice trails here with pretty bluebells to see in the spring months. The village is also not far from the south coast where you can try the Portsmouth and Southsea Coastal Walk and enjoy views of the famous Spinnaker Tower and can catch the ferry over the harbour to Gosport and Lee on Solent. The wildlife rich Farlington Marshes Nature Reserve is also located in this area. You could also pick up the Meon Valley Trail nearby. The shared cycling and walking trail runs along a disused railway line to nearby West Meon. For more walking ideas in the area see the Hampshire Walks page."
    }
  ],
  "district": "Winchester",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cemetery Lane, Denmead, Winchester, Hampshire, England, PO7 6TL, United Kingdom",
  "postcode": "PO7 6TL",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "footpaths",
    "bird watching"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}