{
  "objectID": "71654046aa9486d7410bad72c722b9be",
  "created_at": "2024-12-18T03:17:16.027296+00:00",
  "ref": "litcham-walking-route",
  "title": "Litcham and East Lexham Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Litcham_Common_5.jpg/512px-Litcham_Common_5.jpg?20180826171814",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/DA6FCF2134573A8986258B1C0042D2B8/$FILE/Litcham.gpx",
  "_geoloc": {
    "lat": 52.7239696509,
    "lng": 0.7917237346
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Litcham_Common_5.jpg/512px-Litcham_Common_5.jpg?20180826171814",
      "title": "Dudley Miles, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Ponies grazing on Litcham Common. Litcham Common is a 24.9-hectare (62-acre) Local Nature Reserve in Norfolk. It is owned by Neil Foster, Lexham Estate, and managed by Norfolk County Council, Lexham Estate and the Department for Environment, Food and Rural Affairs.\nThis heathland site has areas of acid grassland, wet and dry heath, scrub and mature oak and birch woodland.  Of archaeological interest is a surviving bronze age burial disc towards the south of the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Ponies_on_Litcham_common_-_geograph.org.uk_-_4887296.jpg?20230607101603",
      "title": "Ponies on Litcham common by Hugh Craddock, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pony by the pond on Litcham common. The Nar Valley Way footpath crosses the common, following farm tracks through Lexham Estate and commons at Litcham and Castle Acre.\nIn 2006, the Litcham Common Management Committee proposed introducing grazing to preserve the habitat. After approval in 2007, fencing was erected in May 2008, and four Dartmoor ponies arrived in June 2008. The ponies currently graze the western half of the common, with plans to install cattle grids on Dunham Road to allow grazing of the entire common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_Bull_Inn%2C_Litcham_-_geograph.org.uk_-_5540762.jpg?20231015023128",
      "title": "The Bull Inn, Litcham by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Bull Inn, Litcham. The Bull Inn is a 17th-century coaching inn with parts dating back to the 14th century, and it is the only surviving pub from many that once served the village.\nThe village has various amenities such as a post office, butchers, church, Methodist chapel, bus garage, fish and chip shop, and a health centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/East_Lexham_St_Andrew%27s_church_-_geograph.org.uk_-_2278382.jpg?20210704073652",
      "title": "East Lexham St Andrew's church by Adrian S Pye, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "East Lexham St Andrew's church. East Lexham's parish church, dedicated to Saint Andrew, is one of Norfolk's 124 remaining Anglo-Saxon round-tower churches. St. Andrew's dates back to the eleventh century and underwent significant restoration in the late nineteenth century. The church boasts fine examples of nineteenth-century stained glass, including a depiction of Saint Michael and the dragon by James Powell and Sons. It also features artwork by Richard Foster, depicting the Nativity, Saint Andrew as a fisherman, and the Day of Judgement.\nSt. Andrew's is thought to be one of the oldest churches in England. According to Pevsner, the building dates back to the Anglo-Saxon era. The mound on which the church stands suggests the site was used for Pagan worship before being taken over by Christians in the seventh century. The original church might have been constructed of wood or wattle and daub. Recent research supports Pevsner's view that the current church was built by Saxons but shows Norman influence. This conclusion is based on the differing styles of the three belfry openings. The east opening, in particular, has a unique stone frame cut out to form a Maltese cross. The belfry contains one bell with a Latin inscription translating to \"I am called the bell of Virgin exalted Mary,\" thought to have been cast by Brasyers of Norwich in the fifteenth century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Church_Street%2C_Litcham_-_geograph.org.uk_-_4127441.jpg/512px-Church_Street%2C_Litcham_-_geograph.org.uk_-_4127441.jpg?20221212203524",
      "title": "Church Street, Litcham by Bikeboy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Church Street, Litcham. The name Litcham means 'Enclosure homestead/village' or 'hemmed-in land with an enclosure.' It is mentioned in the Domesday Book as Licham, Lecham, or Leccham as 'a Market Town in the centre of Norfolk,' with other spellings including Lucham, Lycham, and Luychesham.\nEdward I granted Litcham the right to hold a weekly market, which did not thrive and ceased by 1836. This market influenced the layout of the village, especially the widening of Church Street near All Saints Church.\nIn Elizabethan times, Litcham was a centre for the local tanning industry, with families like Collinson and Hallcottis becoming wealthy and influential. The Hallcottis family were benefactors, building almshouses and contributing to the church. Mathew Hallcottis is depicted on the village sign with his tanning equipment.\nIn 1831, the population was 771, with over a third being agricultural workers. In 1977, Litcham was designated a conservation village and has eleven listed buildings, including a church and priory dating back to the 12th century. The village lies at a major crossroads of country lanes, with the B1145 being a significant route between King's Lynn and Norwich, formerly a stagecoach route. The 17th-century Bull Inn, which also served as the local law court until the late 18th century, was where horses were changed. The green in front of the Bull Inn once had a row of old cottages and a chapel, demolished in 1968."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/All_Saints%27_church%2C_Litcham_-_geograph.org.uk_-_4127500.jpg/512px-All_Saints%27_church%2C_Litcham_-_geograph.org.uk_-_4127500.jpg?20221212205209",
      "title": "All Saints' church, Litcham by Bikeboy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "All Saints' church in Litcham. The church's square tower was largely rebuilt in the early 15th century. Its clock, made by a Swaffham blacksmith, dates from 1725. The tower has a peal of six bells rung by the Litcham Bellringers. The unusual red and green rood screen from 1536 shows twenty-two saints and features delicate carvings. Female saints depicted include Sitha, Cecilia, Dorothy, Juliana, Agnes, Petronella, Helena, and Ursula. The early 15th-century baptismal font has shields, once painted with arms. The church also has a rare wooden Dutch coffer used for storing books, and the statues’ faces remain intact, unlike those in other local churches.\nThe village also has a Methodist Chapel on Front Street, built in 1909."
    }
  ],
  "distance_km": 8.0,
  "description": "This waymarked trail follows the East Lexham Circular Walk through the countryside surrounding the villages of Litcham and East Lexham in Norfolk. On the pleasant rural route you will pass through Litcham Common and enjoy views of the River Nar and the surrounding countryside. Look out for the wild ponies and the diverse range of habitats on the common at the start of the walk. Part of the walk also uses a section of the Nar Valley Way . You could continue your outing along this long distance footpath if you have time. Following it west will take you to Castle Acre and its historic castle. Please scroll down for the full list of walks near and around Litcham. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "video_url": "https://www.youtube.com/embed/X1aBFgVSQZc?si=_vwIbQSgyuxypALv",
  "district": "Litcham",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}