{
  "created_at": "2025-01-06T02:13:22.124793+00:00",
  "objectID": "7238b9d7e14818477cdb1d08cd52cb12",
  "ref": "felbrigg-hall-park-walking-route",
  "title": "Felbrigg Hall Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Geese_on_Felbrigg_Pond_-_geograph.org.uk_-_724695.jpg",
  "nearby": [
    {
      "description": "Peddars Way and Norfolk Coast Path",
      "objectID": "4e358890f1c641370cd442450ff77e93",
      "ref": "peddars-way-and-norfolk-coast-path-walking-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Sheringham Park",
      "objectID": "3f875e147dc723f57262c945a493643d",
      "ref": "sheringham-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7238b9d7e14818477cdb1d08cd52cb12.gpx",
  "_geoloc": {
    "lat": 52.9083868946,
    "lng": 1.2587793461
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Geese_on_Felbrigg_Pond_-_geograph.org.uk_-_724695.jpg",
      "title": "Evelyn Simak / Geese on Felbrigg Pond",
      "caption": "Geese on Felbrigg Pond. The history of Felbrigg estate dates back to the middle ages, when a member of the Norman family of Bigod took the name Felbrigg and built a manor house on the site of the present Hall, in the early 15th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Felbrigg_Hall_3.jpg",
      "title": "Evelyn Simak / View towards Felbrigg Hall",
      "caption": "Felbrigg Hall. In around 1450 Felbrigg was acquired by John Wyndham, a wealthy merchant from the Norfolk town of Wymondham. The manor house was altered and added on to by following generations until a family member, \"Mad Windham\", almost ruined the estate and was forced to sell it in 1863, with all its contents. The estate was purchased by John Ketton, a Norwich merchant, whose daughter married a distant cousin of \"Mad Windham\". Their grandson, Robert Wyndham Ketton-Cremer (d. 1969) bequeathed the Felbrigg Hall and estate to the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Felbrigg_Pond_-_geograph.org.uk_-_724692.jpg",
      "title": "Evelyn Simak / Felbrigg Pond",
      "caption": "The view is northerly across Felbrigg Pond, at this time of the year populated by many geese."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Outflow_of_Felbrigg_Pond_-_geograph.org.uk_-_724710.jpg",
      "title": "Evelyn Simak / Outflow of Felbrigg Pond",
      "caption": "Outflow of the Pond. The bricked-in pipe seen in mid-distance, emerging from the ground, allows water from Felbrigg Pond to flow off in southerly direction, forming a small stream. Solar panels (seen at right) have been set up in this fenced-off area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/St_Margaret%27s_church_-_geograph.org.uk_-_724596.jpg",
      "title": "Evelyn Simak / St Margaret's church",
      "caption": "St Margaret's church is located east of Felbrigg Hall. It was built during the 1450s by Simon de Felbrigg, who is commemorated, together with his first wife Margaret, by the most noteworthy of a number of fine brasses in the church. The life-size brass is situated at the eastern end of the nave and protected by a carpet. Sir Simon is one of only six Knights of the Garter, and his wife Margaret was cousin to Anne of Bohemia (wife of Richard II). The church also contains a large number of wall monuments to members of the Wyndham family. The octagonal baptismal font dates from the 14th century, as does the sedilia, damaged beyond repair when the early 19th century monument to William Windham was built directly into them. William Windham was one of England's best-known and most eloquent statesmen at the turn of the 18th century; his monument was made by Joseph Nollekens. The church is open every day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/A_stand_of_cypress_trees_-_geograph.org.uk_-_641903.jpg",
      "title": "Evelyn Simak / A stand of cypress trees",
      "caption": "A stand of cypress trees ... surrounded by tall conifers and beeches. Many of the ancient oaks, beeches, maples and sycamores in Great Wood were planted by William Windham. Known as William I, the son of Thomas Windham (who in the 17th century built Felbrigg Hall) planted the foundation of the 600 acre woodland. Bordered in the west by the picturesque Lion's Mouth, it extends to the B1436 (Felbrigg Road) in the east and the A148 (Holt Road) to the north, and beyond. Great Wood shelters Felbrigg Hall and park from the winds that blow in from the North Sea, two miles distant to the north. Felbrigg estate is in the care of the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/St_Margaret%27s_church_-_baptismal_font_-_geograph.org.uk_-_724605.jpg/256px-St_Margaret%27s_church_-_baptismal_font_-_geograph.org.uk_-_724605.jpg",
      "title": "Evelyn Simak / St Margaret's church - baptismal font",
      "caption": "St Margaret's church - baptismal font. In the corner behind two 13th century coffin slabs can be seen laid out on the tiled floor. It is believed that they once covered the coffins of two priests."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/St_Margaret%27s_church_-_memorial_-_geograph.org.uk_-_724611.jpg/256px-St_Margaret%27s_church_-_memorial_-_geograph.org.uk_-_724611.jpg",
      "title": "Evelyn Simak / St Margaret's church - memorial",
      "caption": "St Margaret's church - memorial. This elaborate memorial to Thomas Windham and his two wives was made by a Norwich stonemason named Martin Morley in 1669."
    }
  ],
  "distance_km": 8.5,
  "description": "Explore Fellbrigg's 520 acres of rolling landscape park, woods and waymarked trails on this circular walk in Cromer, Norfolk. There's also the historic St Margaret's church to visit, just to the east of the hall. The church dates back to the 15th century and includes a noteworthy 14th century font. The hall is located very close to the Peddars Way and Norfolk Coast Path and Weavers' Way long distance trails. You can pick up these footpaths to extend your walking through the countryside surrounding the hall.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The park is a fine place for a dog walk with miles of woodland and parkland trails to explore. They are not permitted within the house or walled garden though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west there are similar trails in the expansive Sheringham Park which is also run by the National Trust. The parkland surrounds the 19th century Sheringham Hall and includes miles of peaceful woodland trails, beautiful landscaped gardens full of rhododendrons and azaleas and fabulous views of the Norfolk coast. There is also an abundance of wildlife with 3 species of deer and a wide variety of birds and butterflies. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xt-jTjTpPrM",
  "postcode": "NR11 8PR",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}