{
  "created_at": "2025-01-06T02:08:57.170741+00:00",
  "objectID": "723ffe66e6c7309684667e7094a58bed",
  "ref": "verwood-walking-route",
  "title": "Verwood Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Verwood%2C_Stephen%27s_Castle_-_geograph.org.uk_-_1354174.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/723ffe66e6c7309684667e7094a58bed.gpx",
  "_geoloc": {
    "lat": 50.882582321,
    "lng": -1.8787682581
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Verwood%2C_Stephen%27s_Castle_-_geograph.org.uk_-_1354174.jpg",
      "title": "Mike Faherty / Verwood, Stephen's Castle",
      "caption": "Stephen's Castle. Verwood used to support a brick and pottery industry, obtaining raw materials from local pits such as this; local pits have supported the building of motorways & Mulberry Harbour. Now a nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Stephen%27s_Castle%2C_%22What%27s_under_your_Feet%22_-_geograph.org.uk_-_1354234.jpg",
      "title": "Mike Faherty / Stephen's Castle, \"What's under your Feet?\"",
      "caption": "Stephen's Castle, \"What's under your Feet?\" Two grooved wooden triangles, one on top of the other; inscribed with words such as Geology, Method, Quarrying, Human & Amphibian. Designed to make visitors think about the interaction between the local environment & themselves?"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Stephen%27s_Castle%2C_Verwood_-_geograph.org.uk_-_11041.jpg",
      "title": "Stuart Buchan / Stephen's Castle, Verwood",
      "caption": "Stephen's Castle view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Track_on_the_edge_of_Stevens_Castle_Verwood_-_geograph.org.uk_-_2787600.jpg",
      "title": "Track on the edge of Stevens Castle Verwood by Clive Perrin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Track on the edge of Stevens Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Stephen%27s_Stone%2C_near_Verwood_-_geograph.org.uk_-_409350.jpg",
      "title": "Stuart Buchan / Stephen's Stone, near Verwood",
      "caption": "Stephen's Stone, near Verwood. In 1220 Stephen's Stone was recorded as \"LE HORESTONE\" and was a boundary point in this area so could be a boundary stone. It is thought to be about 3 tonnes in weight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Forestry%2C_near_Alderholt%2C_Dorset_-_geograph.org.uk_-_314587.jpg",
      "title": "Clive Perrin / Forestry, near Alderholt, Dorset",
      "caption": "Forestry, near Alderholt, Dorset. Dense conifer plantation in the distance. In the foreground amongst the heather are self sown conifers. Near the vehicles are members of the Two Trees conservation group and New Forest volunteer rangers, who are here to remove some of these invasive trees to create a wide band of heather which will provide an improved habitat for heathland creatures."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Cranborne_common_-_geograph.org.uk_-_42921.jpg",
      "title": "Clive Perrin / Cranborne common",
      "caption": "Cranborne common. The common is now a nature reserve,and an important heathland habitat.The view is taken from the SW corner of the square looking NE towards Alderholt."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Boveridge_Heath%2C_conservation_-_geograph.org.uk_-_1354426.jpg",
      "title": "Mike Faherty / Boveridge Heath, conservation",
      "caption": "Boveridge Heath, conservation. According to the nearby noticeboard, the Forestry Commission has cleared some of its softwood trees and blocked up drains, to recreate what local wet heathland used to look like; the project looks successful, judging by the amount of sedges that have reappeared."
    }
  ],
  "distance_km": 6.0,
  "description": "This Dorset town is a nice place to start a walk with extensive woodland and heathland to explore. It's also located close to the New Forest National Park and the Cranborne Chase AONB where there are numerous walking opportunities. This circular walk from the town takes you into the adjacent Verwood Forest, visiting the Stephen's Castle Nature Reserve and the Cranborne Common Nature Reserve. It's a pleasant place for walking or cycling, with a series of nice wide tracks to follow to the two reserves and across Boveridge Heath. At Stephen's Castle you'll find a short hill climb to a lovely viewpoint with views across the town and the surrounding countryside. There's also picturesque ponds, Bronze Age tumulus, peaceful woodland trails and pretty purple heather in the warmer months. Look out for various woodland birds and butterflies as you make your way through the wildlife rich area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Monmouth Ash is a nice place for some rest and refreshment after your exercise. The historic pub includes a charming old interior with oak beans, open fires and flagstone floors. The pub’s name, unique in Britain, commemorates the 1685 capture of the Duke of Monmouth (Charles II’s illegitimate son) in Verwood, after the Monmouth Rebellion to overthrow James II was defeated. Legend has it that the Duke was captured after his clothes were found below an Ash tree. Monmouth was beheaded for treason on 15 July 1685. Many of his supporters were tried during the Bloody Assizes, led by Judge Jeffreys, and were condemned to death or transportation. James II was able to consolidate his power and reigned until 1688, when he was deposed by another nephew, William III of Orange, in the Glorious Revolution. They serve a delicious Sunday roast and have a nice big garden to relax in on warmer days. You can find the pub on Manor Road at postcode BH31 6DT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and heathland trails are ideal for a dog walk. The Monmoth Ash pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south east of the town you'll find the Moors Valley Country Park. Here you can enjoy some well maintained cycling and walking trails with on site bike hire. The neighbouring town of Ringwood can also be found on the eastern fringes of the park."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hB7XX-IflQ8",
  "postcode": "BH31 7PX",
  "district": "Verwood",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Coronation Road, Verwood, Dorset, England, BH31 7PX, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "grassland"
  ],
  "points_of_interest": [
    "nature reserves",
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}