{
  "created_at": "2025-01-06T03:37:40.800651+00:00",
  "objectID": "72a7c7484c779a8fa355702c3ff85dbf",
  "ref": "loddon-walking-route",
  "title": "Loddon Walks - River Chet and Hardley Marshes",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Loddon_Mill_-_geograph.org.uk_-_1418845.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/72a7c7484c779a8fa355702c3ff85dbf.gpx",
  "_geoloc": {
    "lat": 52.5401152499,
    "lng": 1.4811214571
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Loddon_Mill_-_geograph.org.uk_-_1418845.jpg",
      "title": "Evelyn Simak / Loddon Mill",
      "caption": "Loddon Mill. The building now houses a Well Being Centre. Loddon is a market town in the Broadland district in South Norfolk, located on the River Chet, where there is a marina and staithes once used by the wherries. The watermill by the bridge across the river is recorded to be the oldest building in the town. The town centre has been designated as a conservation area and is made up of many period properties"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Houses_by_Loddon_Quay_%28the_south_side%29_-_geograph.org.uk_-_1418862.jpg",
      "title": "Evelyn Simak / Houses by Loddon Quay (the south side)",
      "caption": "Houses by Loddon Quay (the south side)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/View_to_Loddon_Quay_from_the_Wherryman%27s_Way_-_geograph.org.uk_-_1362445.jpg",
      "title": "Evelyn Simak / View to Loddon Quay from the Wherryman's Way",
      "caption": "View to Loddon Quay from the Wherryman's Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/The_western_edge_of_Hardley_Flood_-_geograph.org.uk_-_1363085.jpg",
      "title": "Evelyn Simak / The western edge of Hardley Flood",
      "caption": "The western edge of Hardley Flood. Hardley Flood was formed when agricultural land was flooded in the 1940s and is now a Site of Special Scientific Interest, with many birds nesting here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Hardley_Mill_-_geograph.org.uk_-_1419476.jpg",
      "title": "Evelyn Simak / Hardley Mill",
      "caption": "Hardley Mill. Overlooking the Hardley Marshes, with the sugar factory in Cantley seen in the background. Hardley windmill was a drainage pump operating beside the River Yare. It was powered by an Appold turbine capable of rising 12 tons of water per minute via a 12 ft high vertical shaft of 5 ft in diameter. Built in 1874 for Sir Thomas Proctor Beauchamp by the Ludham millwright Dan England it operated until about 1950 when it was damaged, abandoned and replaced by an electrical drainage pump. Restoration work was started in 1991 under the leadership of architect Peter Grix. By 2005 structural work both inside and outside the tower was complete. Cap and sails were restored in the following years and the sails will go up any day now. Besides bringing the mill back to full working condition funding has been made available for a visitor centre which will also function as a drop-in centre for walkers on the Wherryman's Way long distance footpath between Great Yarmouth and Norwich. New moorings have been constructed in order to provide for visiting boats. Built in 1912, the sugar factory was the first British beet sugar factory. Today the factory employs a permanent workforce of 112 - 155, processing an average of 1.3 million tonnes of beet annually. Approximately 1,200 tonnes of crystal sugar are produced daily, and the six silos used for storing it have a capacity of 10,000 tonnes each. The factory also produces 80,000 tonnes of sugar beet feed in pellet form per season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Hardley_Hall_Lane_-_geograph.org.uk_-_1339686.jpg",
      "title": "Evelyn Simak / Hardley Hall Lane",
      "caption": "Hardley Hall Lane. The southern-most section of Hardley Hall Lane is a private road leading to Hardley Hall, which can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/The_Hardley_Cross_-_geograph.org.uk_-_1445690.jpg/256px-The_Hardley_Cross_-_geograph.org.uk_-_1445690.jpg",
      "title": "Evelyn Simak / The Hardley Cross",
      "caption": "The Hardley Cross. Norton Marsh drainage mill can be seen in the background. The Hardley Cross is situated at the confluence of the rivers Chet and Yare. It marks an ancient boundary at which control over the River Yare passed from the Corporation of Norwich to the Borough of Great yarmouth. Down to this point the river is part of the City of Norwich. The cross was restored in the 10th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Boat_travelling_upstream_past_the_derelict_Limpenhoe_drainage_mill_-_geograph.org.uk_-_1445621.jpg",
      "title": "Evelyn Simak / Boat travelling upstream past the derelict Limpenhoe drainage mill",
      "caption": "Boat travelling upstream past the derelict Limpenhoe drainage mill"
    }
  ],
  "distance_km": 10.7,
  "description": "This attractive market town in Norfolk has some delightful riverside trails to try. There's also some interesting history with a 15th century church and an 18th century water mill to see. This circular walk from the village explores the area to the east, visiting the River Chet, Hardley Flood and Hardley Marshes. The walk starts in the village and heads east to pick up the riverside footpath along the Chet. Follow the trail east and it will take you past Chedgrave Common Farm to Hardely Flood. Here you'll find picturesque lagoons with reedbeds and lots of birdlife to see. The path continues east past Hardley Hall and Nogdam End to Norton Mill where the Chet meets with the River Yare. Follow the river north past Hardley Marshes and Limpenhoe Mill before turning west along Hardley Dike. You can then follow country lanes south west past Broom Hill to Chedgrave and Loddon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy some post walk refreshments at The Swan. The pub is housed in a lovely old building which dates back to the 18th century when it was originally a coaching house. Inside there's a cosy interior with roaring fires while outside there's a nice courtyard garden. You can find them at 23 Church Cl, NR14 6LX. The pub is a short stroll from the River Chet and the historic church which dates to 1490."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and waterside trails make for a pleasant walk with your dog. The Swan mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Norfolk Broads Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tfTgZapNT5Y",
  "postcode": "NR14 6HD",
  "district": "Chedgrave",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}