{
  "created_at": "2025-01-06T02:19:40.313442+00:00",
  "objectID": "72a9c33668da9c68ccd74aea1a4c3288",
  "ref": "bath-canal-walk-walking-route",
  "title": "Bath Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/58/Kennet_and_Avon_Canal_above_Bathampton_-_geograph.org.uk_-_178606.jpg",
  "nearby": [
    {
      "description": "Barton Farm Country Park",
      "objectID": "1f325f9d98757447b9310eb23a5932ef",
      "ref": "barton-farm-country-park-walking-route"
    },
    {
      "description": "Somerset Coal Canal",
      "objectID": "9a5461648c689c292bbacec866c2ac09",
      "ref": "somerset-coal-canal-walking-route"
    },
    {
      "description": "Kennet and Avon Canal Walk",
      "objectID": "0c879db862142efde19b17abd060ac05",
      "ref": "kennet-and-avon-canal-walk-walking-route"
    },
    {
      "description": "Bath Skyline Walk",
      "objectID": "b6b4865a9d1a79c649f625a750864dc7",
      "ref": "bath-skyline-walk-walking-route"
    },
    {
      "description": "Avoncliff",
      "objectID": "1bf40dee4f228a46530eec76cbcd604b",
      "ref": "avoncliff-walking-route"
    },
    {
      "description": "Norton St Philip",
      "objectID": "565943fd29676dd871533ea773471c5a",
      "ref": "norton-st-philip-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/72a9c33668da9c68ccd74aea1a4c3288.gpx",
  "_geoloc": {
    "lat": 51.3770479326,
    "lng": -2.3522785195
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Kennet_and_Avon_Canal_above_Bathampton_-_geograph.org.uk_-_178606.jpg",
      "title": "Pierre Terre / Kennet & Avon Canal above Bathampton, via Wikimedia Commons",
      "caption": "Kennet and Avon Canal above Bathampton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Dundas.JPG/512px-Dundas.JPG",
      "title": "Rodw at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Dundas Aqueduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Sydney_Gardens%2C_Bath_%28geograph_3829585%29.jpg",
      "title": "Stephen Richards / Sydney Gardens, Bath",
      "caption": "Sydney Gardens, Bath. These beautiful gardens are located right next to the canal at the end of Great Pulteney Street. The Grade II listed gardens are notable as the only remaining eighteenth-century pleasure gardens in the country. Features included a maze, grotto, sham castle and an artificial rural scene with moving figures powered by a clockwork mechanism. The park also includes the Grade I listed Holburne Museum. Here you will find Bath's first public art gallery which includes pieces by Gainsborough, Guardi, Stubbs, Ramsay and Zoffany."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Bathampton_Toll_Bridge_-_Bathampton%2C_England_-_DSC09876.jpg/512px-Bathampton_Toll_Bridge_-_Bathampton%2C_England_-_DSC09876.jpg",
      "title": "Daderot, Public domain, via Wikimedia Commons",
      "caption": "Bathampton Toll Bridge. Just off the route this noteworthy old bridge is worth a small detour from the canal. The Grade II listed bridge was built of Bath stone in 1872. You can find the old Toll house next to it with a board advertising the historical toll prices."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Claverton_-_geograph.org.uk_-_1776142.jpg/512px-Claverton_-_geograph.org.uk_-_1776142.jpg",
      "title": "Rick Crowley / Claverton",
      "caption": "A view over the village of Claverton. There is just the single street, lined with charming stone properties dating back to the 17th century. Claverton Manor (not in shot) is higher up the hill behind, and is now the American Museum. The manor was built about 1820. On 26 July 1897 when he was 23, Winston Churchill made his first political speech here. The museum is well worth a visit if you have time. It takes you on a journey through the history of America with a exhibitions and a fine collection of folk and decorative arts. There's also 125 acres of grounds with views of the Limpley Stoke Valley and the River Avon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Cottages_on_the_canal_at_Avoncliff_-_geograph.org.uk_-_1227342.jpg",
      "title": "Simon Palmer / Cottages on the canal at Avoncliff, via Wikimedia Commons",
      "caption": "Cottages on the canal at Avoncliff. This is where the stretch from Bradford on Avon turns 90 degrees to cross the aqueduct across the River Avon and railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Avoncliff_Aqueduct_with_trip_boat_-_geograph.org.uk_-_877458.jpg",
      "title": "P L Chadwick / Avoncliff Aqueduct with trip boat",
      "caption": "Avoncliff Aqueduct with trip boat. A trip boat is crossing the Avoncliff Aqueduct on the Kennet & Avon Canal. The aqueduct was completed in 1798. The architect and engineer was John Rennie."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Kennet_and_Avon_Canal_at_Bradford_on_Avon_-_geograph.org.uk_-_1265654.jpg",
      "title": "Simon Palmer / Kennet and Avon Canal at Bradford on Avon",
      "caption": "Canal at Bradford on Avon"
    }
  ],
  "distance_km": 8.0,
  "description": "This is a popular walk along the Kennet and Avon Canal from Bath to Bradford on Avon. It's about a 10 mile walk along the towpath taking you from Somerset into Wiltshire on the southern fringes of the Cotswolds AONB. On the way you'll pass pretty locks, lots of barges, delightful little cottages, interesting villages, and attractive parks and gardens. The walk starts at Bath locks situated at the start of the Kennet and Avon Canal. You then head north towards Bathwick passing through tunnels as you go. At Bathwick you pass the lovely Sydney Gardens which are worth a slight deviation from the canal to explore. The gardens are the only remaining eighteenth-century pleasure gardens in England. The path continues to the village of Bathampton where you can take a small detour to visit the Toll Bridge over the River Avon. The bridge and toll house are both Grade II listed. There's splendid views from the bridge down to the beautiful weir below. At Bathampton you turn south to Claverton. The little village has a Grade II listed pumping house and a church which dates from the 13th century. You continue south towards Monkton Combe, passing the Dundas Aqueduct which carries the Kennet and Avon Canal over the River Avon on the Somerset Wiltshire border. It's a real highlight of the walk with great views over the river and the surrounding countryside from the elevated position of the aqueduct. You can virtually explore this section of the canal using the google street view link below. The route then heads to Limpley Stoke and Freshford, passing Conkwell Wood on the way. The final section takes you into Wiltshire where you will pass the impressive Avoncliff Aqueduct and Barton Farm Country Park before finishing in Bradford Upon Avon. Barton Farm is worth exploring if you have time. It includes historic buildings, craft shops and tea rooms while the farmhouse, granary and tithe barn of the original Barton Farm date back to the 14th century. There's lots of good options for extending your walking around the canal. At Bathampton you can pick up the tremendous Bath Skyline Walk where you can enjoy fabulous views over the city.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Avoncliff be sure to investigate the noteworthy Cross Guns Inn. The pub dates all the way back to 1550 and is a splendid example of Cotswold stone and expert masonry. Indoors there's old gables, wooden beams, stone floors, and cosy roaring fires to warm yourself next to on colder days. Outdoors there are lovely terraced gardens with fine views of the railway aqueduct and the canal. It's the perfect spot to relax in on warm summer days. You can find the pub at 159 Bradford Road with a postcode of BA15 2HB for your sat navs. There's also the excellent Bathampton Mill to consider. The pub is in a lovely spot on the River Avon in the village. There's a lovely large garden and courtyard area where you can relax with views over the water. Inside there's a sylish interior with a log fire and delicious Mediterranean cuisine to sample from the menu. You can find them right on the river on Mill Lane with a postcode of BA2 6TS for your sat navs. There's also a large car park if you wanted to start a walk from there."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Bathampton Walk starts in Bathampton and visits Monkton Coombe, Limpley Stoke and the excellent American Museum at Claverton. The museum is one of the highlights of the area and well worth a small detour from the canal. It takes you on a journey through the history of America with exhibitions and a fine collection of folk and decorative arts. There's also 125 acres of grounds with views of the Limpley Stoke Valley and the River Avon. On the western side of Bath there's the noteworthy village of Newton St Loe to visit. It includes the attractive Newton College and Newton Park where there's an 18th-century landscaped garden, designed by the famous landscape gardener Capability Brown. There's also a historic 18th century country house and a fine 17th century pub to see too. On the north western outskirts of the city there's the little village of Kelston where you can pick up the Kelston Roundhill Walk. This popular circular walk takes you up to an ancient barrow where there are wonderful views to the Wiltshire Downs, the Mendip Hills and the Black Mountains of Wales. There's also a fine 17th century pub to visit in the village afterwards. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rBZGmyGJ37w",
  "postcode": "BA2 4JJ",
  "district": "Bath",
  "county": "Bath and North East Somerset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}