{
  "created_at": "2025-01-06T11:08:17.201188+00:00",
  "objectID": "72d1ed788d1bf9d9d53223cfb7ddb263",
  "ref": "fareham-walking-route",
  "title": "Fareham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/77/Lower_Quay_-_Fareham_-_geograph.org.uk_-_690221.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/72d1ed788d1bf9d9d53223cfb7ddb263.gpx",
  "_geoloc": {
    "lat": 50.8519947578,
    "lng": -1.1664640211
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Lower_Quay_-_Fareham_-_geograph.org.uk_-_690221.jpg",
      "title": "Colin Babb / Lower Quay - Fareham, via Wikimedia Commons",
      "caption": "Lower Quay, Fareham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Iron_64lb_RML_at_Fort_Nelson.JPG/512px-Iron_64lb_RML_at_Fort_Nelson.JPG",
      "title": "No machine-readable author provided. Gaius Cornelius assumed (based on copyright claims). [Public domain], via Wikimedia Commons",
      "caption": "Iron 64lb RML at Fort Nelson. Converted on Palliser's system form a smoothbore 32 pounder of 58cwt, by inserting a rifled tube. Mounted on a reproduction traversing carriage. This equipment represents port of Fort Nelson's original armament. Photographed on 26-Apr-06 at Fort Nelson, Portsmouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Fort_nelson_entrance.JPG/512px-Fort_nelson_entrance.JPG",
      "title": "en:User:Geni [CC BY 2.5 (https://creativecommons.org/licenses/by/2.5)], via Wikimedia Commons",
      "caption": "Royal Armouries Fort Nelson, Portsmouth. Main entrance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Fort_nelso_Artillery_Hall_gallery.JPG/512px-Fort_nelso_Artillery_Hall_gallery.JPG",
      "title": "Geni [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Photo of part of the Artillery Hall gallery at fort nelson"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Friendly_horse_by_the_Nelson_Monument%2C_Portsdown_Hill_-_geograph.org.uk_-_1114467.jpg",
      "title": "Basher Eyre / Friendly horse by the Nelson Monument, Portsdown Hill, via Wikimedia Commons",
      "caption": "Friendly horse by the Nelson Monument, Portsdown Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Nelson_Monument%2C_Boarhunt%2C_Hampshire.jpg",
      "title": "Martyn Pattison [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Nelson Monument, Portsdown Hill, Boarhunt, Hampshire. This 110 feet (34 m) tribute has stood here for almost 200 years, with the foundation stone being laid in 1807, only two years after Nelson's death. The monument was created from subscriptions raised by the navy officers and men of the Fleet who served under Lord Nelson at the Battle of Trafalgar."
    }
  ],
  "distance_km": 12.0,
  "description": "This market town in Hampshire has some lovely walks along Portsmouth Harbour and an interesting maritime history. This circular walk in uses a section of the Allan King's Way to visit the Nelson Monument and Fort Nelson near the town. You'll also enjoy a coastal stretch along Portsmouth Harbour and the easy access Fareham Creek Trail. The walk starts opposite the town quays where you can follow a coastal path around the Cams Hill Estate. Here you can pick up the Allan King's Way and follow it north to the Nelson Monument. The distinctive 120 feet (37 m) high monument sits on Portsdown Hill. It was completed in 1808, shortly after Nelson's death, to \"perpetuate the glorious victories of the British Navy\". The route then continues to Fort Nelson which was built as a result of the 1859 Royal Commission by Lord Palmerston to prevent a French land attack. The fort is one of five defensive forts built on the summit of Portsdown Hill in the 1860s, overlooking the important naval base of Portsmouth. The site is now part of the Royal Armouries, housing their collection of artillery, and a Grade I Listed Building. You can tour the armouries which include French field guns captured at the Battle of Waterloo and fortress guns from India and China. The fort is also in an elevated position so there are fine views over the surrounding countryside and the city of Portsmouth. After exploring the fort the route then returns to the start point on the same paths. To continue your walking in the area head east along the Allan King's Way to visit Portchester Castle. The medieval castle has a fascinating history and commands fine views over the harbour. If you head east you can also visit Fort Southwick and Fort Widley.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/x52FKw74VMc",
  "postcode": "PO16 8SA",
  "district": "Fareham",
  "county": "Hampshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}