{
  "created_at": "2025-01-06T11:14:00.140866+00:00",
  "objectID": "73464b923afc2f4574cadc58391b8ac2",
  "ref": "grass-wood-walking-route",
  "title": "Grass Wood Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/50/Northern_edge_of_Grass_Wood_-_geograph.org.uk_-_1154611.jpg?20110225105438",
  "nearby": [
    {
      "description": "Grassington Circular Walk",
      "objectID": "f7c1eadf27501cfc8d89fdf08a8d4edc",
      "ref": "grassington-circular-walk-walking-route"
    },
    {
      "description": "Grassington to Conistone Walk",
      "objectID": "b9285d30bc051e6b41533b31ca93ddbc",
      "ref": "grassington-to-conistone-walk-walking-route"
    },
    {
      "description": "Grassington to Kettlewell",
      "objectID": "f4a8d8398fac427e7f3ee739351812fe",
      "ref": "grassington-to-kettlewell-walking-route"
    },
    {
      "description": "Grassington",
      "objectID": "9b0ebc708d7f6edf19dcccfd0a0f336d",
      "ref": "grassington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/73464b923afc2f4574cadc58391b8ac2.gpx",
  "_geoloc": {
    "lat": 54.0818436694,
    "lng": -2.0234639269
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Northern_edge_of_Grass_Wood_-_geograph.org.uk_-_1154611.jpg?20110225105438",
      "title": "Stephen Craven / Northern edge of Grass Wood",
      "caption": "Northern edge of Grass Wood. The wood thins out as it approaches the River Wharfe, and this is its furthest extent along the river bank. The area was designated as a Site of Special Scientific Interest (SSSI) in 1955 for its upland broadleaved woodland. It is also included in A Nature Conservation Review under the entry for \"Conistone Old Pasture and Bastow Wood\". The Yorkshire Wildlife Trust purchased the site in 1983 and now manages it as a nature reserve. The entire area of the SSSI is registered common land. Two adjacent sites, Bastow Wood and Conistone Old Pasture, are also designated as SSSIs. Bastow Wood is recognised for its broadleaved woodland and calcareous grassland, while Conistone Old Pasture is noted for its calcareous grassland and limestone pavement. Grass Wood is the last remaining native site in Britain for the Lady's Slipper Orchid."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/River_Wharfe_in_Lower_Grass_Wood_-_geograph.org.uk_-_824394.jpg?20110220164120",
      "title": "Peter Church / River Wharfe in Lower Grass Wood",
      "caption": "River Wharfe in Lower Grass Wood. An extensive remnant upland woodland of this size is uncommon on limestone in the Yorkshire Dales, which is why Grass Wood has been designated as a SSSI. The woodland element is unsettled and atypical for its location—unlike Bastow Wood, which is more stable as it has not been replanted. However, the very rich ground flora of Grass Wood is characteristic of ancient woodland on limestone. This floristic value owes its continued existence to the uninterrupted woodland cover, which qualifies it as ancient woodland. Additionally, the absence of sheep grazing in Grass Wood has preserved its ground flora, unlike in Bastow Wood, where grazing has evidently cleared the woodland ground flora in the past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Lower_Grass_Wood_with_bluebell_carpet_-_geograph.org.uk_-_3972740.jpg/512px-Lower_Grass_Wood_with_bluebell_carpet_-_geograph.org.uk_-_3972740.jpg?20221109032534",
      "title": "Lower Grass Wood with bluebell carpet by Carroll Pierce, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lower Grass Wood with bluebell carpet. There is a notable variety of vascular plants in Grass Wood that are considered indicators of undisturbed, ancient woodland. These include Herb Paris (Paris quadrifolia), Lily-of-the-valley (Convallaria majalis), Ramsons (Allium ursinum), Wood Sorrel (Oxalis acetosella), Wood Anemone (Anemone nemorosa), Dog's Mercury (Mercurialis perennis), Woodruff (Galium odoratum), and Wood-sedge (Carex sylvatica). The area also hosts an extraordinary range of geophytes—plants with bulbs or bulbous growths that are particularly well-adapted to woodland environments. These geophytes include the ancient woodland indicators Lily-of-the-valley, Herb Paris, and Ramsons, as well as the less common Angular Solomon's-seal (Polygonatum odoratum) and the more common Bluebells (Hyacinthoides non-scripta) and Lord-and-ladies (Arum maculatum). There is also one patch of Solomon's-seal (Polygonatum multiflorum), which is thought to be of garden origin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/A_stile_in_Bastow_Wood_-_geograph.org.uk_-_1845564.jpg/512px-A_stile_in_Bastow_Wood_-_geograph.org.uk_-_1845564.jpg?20210330193618",
      "title": "A stile in Bastow Wood by Ian Greig, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A stile in Bastow Wood. The Early-purple Orchid (Orchis mascula), another geophyte, is found under the lighter shade of sparser woodland cover in Grass Wood. This demonstrates its adaptability, as it is more often associated with open grassland and can be seen in profusion in the nearby Conistone Old Pasture. The conditions in Grass Wood also appear ideal for the rare and highly endangered Lady's-slipper Orchid (Cypripedium calceolus), historically known to grow in the limestone areas of the Yorkshire Dales. This orchid is found in continental Europe, thriving in the decomposed humus of semi-shaded woodland on limestone. The virtual extinction of the Lady's-slipper Orchid from its historical range is often attributed to uprooting by gardeners and botanists. However, its preferred habitat also shrunk significantly due to human clearance of woodland from the limestone landscape, and sheep grazing further contributed to its decline. It is hoped that the rescue plan for the Lady's-slipper Orchid will be successful, and that Grass Wood may eventually be selected as one of the locations for its reintroduction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Grass_Wood_and_Dewbottom_Scar_-_geograph.org.uk_-_77540.jpg?20100130155529",
      "title": "Chris Heaton / Grass Wood and Dewbottom Scar",
      "caption": "Grass Wood and Dewbottom Scar. Other woodland species found in Grass Wood include Wild Strawberry (Fragaria vesca), Red Campion (Silene dioica), Wood Cranesbill (Geranium sylvaticum), Primrose (Primula vulgaris), Bugle (Ajuga reptans), and St John's wort (Hypericum hirsutum). A few Columbine (Aquilegia vulgaris) can be found at woodland edges. Scarce clumps of Stinking Iris (Iris foetidissima) and Stinking Hellebore (Helleborus foetidus) are also present. Grassland species such as Lady's-mantle (Alchemilla glabra), Great Burnet (Sanguisorba officinalis), Melancholy Thistle (Cirsium helenioides), and Goldilocks Buttercup (Ranunculus auricomus) are found in clearings. In the open landscape of dry, rocky calcareous grassland, species take refuge on the steep, un-wooded scar edges of the limestone, particularly along the sunlit areas of Dewbottom Scar. Here, the locally uncommon Rock Whitebeam (Sorbus rupicola) can be found, along with Burnet Rose (Rosa pimpinellifolia), Common Rock-rose (Helianthemum nummularium), Bloody Crane's-bill (Geranium sanguineum), Salad-burnet (Sanguisorba minor), Wild Marjoram (Origanum vulgare), and Wild Thyme (Thymus polytrichus)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/An_Ent_in_Grass_Wood_-_geograph.org.uk_-_824388.jpg/256px-An_Ent_in_Grass_Wood_-_geograph.org.uk_-_824388.jpg?20110220145452",
      "title": "Peter Church / An Ent in Grass Wood",
      "caption": "An Ent in Grass Wood"
    }
  ],
  "distance_km": 3.5,
  "description": "This circular walk explores the Grass Wood Nature Reserve near Grassington in North Yorkshire. The reserve is well known for its bluebells and other wildflowers during the summer months. As you make your way along the peaceful woodland trails look out for wildlife such as northern brown argus butterfly and birds including Tawny Owl, Nuthatch and Treecreeper. On the western edge of the woods there are also some pleasant riverside trails along the River Wharfe. You can extend your walking on the Grassington Circular Walk, the Grassington to Conistone Walk and the Grassington to Kettlewell Walk .",
  "details": [],
  "video_url": "https://www.youtube.com/embed/FPcVaC9YcXE?si=l3v7F_GOveE2yxW9",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grass Wood Lane, Conistone with Kilnsey, Grassington, North Yorkshire, York and North Yorkshire, England, BD23 5BT, United Kingdom",
  "postcode": "BD23 5BT",
  "district": "Grassington",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "wildlife"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}