{
  "created_at": "2025-01-06T00:19:36.568725+00:00",
  "objectID": "7370651bc1c3cefb1e28e3a4f3b87cfc",
  "ref": "newmillerdam-country-park-walking-and-cycle-route",
  "title": "Newmillerdam Country Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/66/Causeway_across_the_lake%2C_Newmillerdam_Country_Park%2C_Crigglestone_-_Chevet_-_geograph.org.uk_-_317185.jpg",
  "nearby": [
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "Wakefield Canal",
      "objectID": "2c842fc1a310ef45573cb18c3945e94c",
      "ref": "wakefield-canal-walking-and-cycle-route"
    },
    {
      "description": "Pugneys Country Park",
      "objectID": "9f75fc5c86440c0f383663091e197975",
      "ref": "pugneys-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7370651bc1c3cefb1e28e3a4f3b87cfc.gpx",
  "_geoloc": {
    "lat": 53.6371417089,
    "lng": -1.5002273767
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Causeway_across_the_lake%2C_Newmillerdam_Country_Park%2C_Crigglestone_-_Chevet_-_geograph.org.uk_-_317185.jpg",
      "title": "Humphrey Bolton / Causeway across the lake, Newmillerdam Country Park, Crigglestone / Chevet",
      "caption": "Causeway across the lake, Crigglestone / Chevet. This is the turning point of the 2km walk around the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Newmillerdam_looking_to_the_causeway._-_geograph.org.uk_-_483552.jpg",
      "title": "John Fielding / Newmillerdam looking to the causeway.",
      "caption": "Newmillerdam looking to the causeway. It runs left middle to right middle of photo. The lake is a good spot for wildlife with Great Crested Grebe, Mute Swan, Mallard and Coot to look out for on the water. You may also see bats feeding above the Dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Newmillerdam_outlet_weir_-_geograph.org.uk_-_483745.jpg",
      "title": "John Fielding / Newmillerdam outlet weir",
      "caption": "Outlet weir. On the right hand edge of the photo can be seen the A61 Barnsley Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Newmillerdam_Boathouse_-_geograph.org.uk_-_205463.jpg",
      "title": "Dr Neil Clifton / Newmillerdam Boathouse",
      "caption": "Historic Victorian boathouse seen from the other side of the dam. The structure was built in the 1820s to entertain the guests of the Pilkington family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Bushcliff_Wood_Track_-_geograph.org.uk_-_494130.jpg",
      "title": "John Fielding / Bushcliff Wood Track",
      "caption": "Bushcliff Wood Track. Located at the southern end of the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Outlet_weir_to_Newmillerdam_lake%2C_off_Barnsley_Road%2C_Crigglestone_-_geograph.org.uk_-_317255.jpg",
      "title": "Humphrey Bolton / Outlet weir to Newmillerdam lake, off Barnsley Road, Crigglestone",
      "caption": "Outlet weir to Newmillerdam lake, off Barnsley Road. Crigglestone Chevet corn mill was moved to a site to the north of Barnsley Road from one upstream of the boathouse by Francis Nevile of Chevet Hall in 1633. It would seem likely that this was to make a private hunting park in what is now Newmillerdam Country Park. The present dam, which carries the A61 Barnsley Road, might have been constructed in conjunction with the 19C turnpike road. Certainly the outlet weir and the bridge look to be 19C rather than 17C work."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Seat_in_Newmillerdam_Country_Park%2C_Crigglestone_-_geograph.org.uk_-_317324.jpg",
      "title": "Humphrey Bolton / Seat in Newmillerdam Country Park, Crigglestone",
      "caption": "Carved Seat. The inspiration for the carved heads might well have been the lost Norse settlement of Thurstonhaugh, which was somewhere in the vicinity."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Barnsley_Road_at_Newmillerdam%2C_Crigglestone_-_Sandal_-_geograph.org.uk_-_317203.jpg",
      "title": "Humphrey Bolton / Barnsley Road at Newmillerdam, Crigglestone / Sandal",
      "caption": "Barnsley Road, Sandal. The lake is on the right, and the hamlet of Hill Top, in Sandal township, is on the hillside beyond the bend in the main road."
    }
  ],
  "distance_km": 4.25,
  "description": "Enjoy cycling and walking paths in this popular country park in Wakefield. The park includes a central lake surrounded by a surfaced path and woodland with way-marked cycling trails and carpets of bluebells in the spring months. You can start your outing from the car park at the northern end of the park. Then pick up the trails heading south through Kings Wood and Bushcliff Wood. If you would like to continue your outing you could follow the Chevet branch line old railway into the countryside and onto the nearby Barnsley Canal. Here you can join with the Trans Pennine Trail and head towards Wakefield or Barnsley. Just to the north of the park you'll find Pugneys Country Park where there's another nice lake and a nature reserve with interesting flora and fauna. In Wakefield you can pick up the Wakefield Canal and follow it to Castleford .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The park has several different options for post walk refreshment with a number of cafes and pubs to choose from. The Dam Inn serves good food and has a patio overlooking the dam. You can find them at the northern end of the lake at 669 Barnsley Rd, WF2 6QG. There's also the Boat House Cafe on the eastern side of the lake."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is the perfect dog walking spot with its woodland and lakeside trails. You're bound to see plenty of other dogs with their owners on a fine day. The Dam Inn and Boathouse cafe mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north west of the lake there's the Newmillerdam Village Green. It's a lovely little place for a stroll with a labyrinth and pretty garden area to see. The popular Wakefield Wheel Cycle Route passes through the park. The 38 mile circular route visits several of the local highlights, using a waymarked trail. It's a great way of exploring the rivers, canals, parks, woods, lakes and countryside around the town. See the Wakefield Cycle Routes page for more rides around the area. To the south east there's the old Newmillerdam Viaduct in a secluded spot in the woodland of the Chevet Branch Line Nature Reserve. This stretch of a now disused railway line, runs east / west and consists of a mixture of woodland, limestone grassland and associated scrubland."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dBX2c4nX1vE",
  "postcode": "WF2 7SX",
  "district": "Wakefield",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Barnsley Road, Crigglestone, Newmillerdam, Wakefield, West Yorkshire, England, WF2 7SX, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "canal"
  ],
  "points_of_interest": [
    "nature reserve",
    "canal"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}