{
  "objectID": "737a15d5655a7e4aeaf79e93090fc85f",
  "created_at": "2024-12-18T23:10:02.452931+00:00",
  "ref": "tyninghame-beach-walking-route",
  "title": "Tyninghame Beach Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/56/Beach_and_trees_at_Tyninghame_-_geograph.org.uk_-_2077721.jpg?20210529085849",
  "nearby": [
    {
      "description": "John Muir Way",
      "objectID": "003c712c8320e6d0880db2081ffe01bb",
      "ref": "john-muir-way-walking-route"
    },
    {
      "description": "Seacliff Beach",
      "objectID": "c1b5ff12a66850fd223bf4b0fd404d95",
      "ref": "seacliff beach-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/1FB3F5B4748B491986258BE8006C603D/$FILE/Tyninghame Beach.gpx",
  "_geoloc": {
    "lat": 56.0194595715,
    "lng": -2.6005682857
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Beach_and_trees_at_Tyninghame_-_geograph.org.uk_-_2077721.jpg?20210529085849",
      "title": "Beach and trees at Tyninghame by Jim Barton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Beach and trees at Tyninghame. During a walk around Tyninghame Beach and Ravensheugh Sands, you can encounter a wide variety of bird species, thanks to the diverse habitats of woodland, dunes, and shoreline. Coastal and sea birds such as gannets, kittiwakes, and oystercatchers are commonly seen, especially near the water. At low tide, waders like curlews, redshanks, and dunlins forage along the sand and in rock pools."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Links_Wood_-_geograph.org.uk_-_584261.jpg?20110206141731",
      "title": "Richard Webb / Links Wood",
      "caption": "Links Wood. In the woodland areas, you might spot woodland birds such as robins, great tits, and woodpeckers. During migration seasons, the area can host additional species like warblers and flycatchers. The nearby Bass Rock, visible from the beach, is a major breeding site for gannets, adding to the birdwatching appeal of the region. Keep an eye out for kestrels and buzzards, which are occasionally seen hovering over the dunes in search of prey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/St_Baldred%27s_Cradle_-_geograph.org.uk_-_2258231.jpg/512px-St_Baldred%27s_Cradle_-_geograph.org.uk_-_2258231.jpg?20210630144245",
      "title": "St Baldred's Cradle by Eileen Henderson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Baldred's Cradle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Ravensheugh_Sands_-_geograph.org.uk_-_3617496.jpg?20220626021734",
      "title": "Ravensheugh Sands by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ravensheugh Sands"
    }
  ],
  "distance_km": 5.8,
  "description": "This walk visits Tyninghame Beach in East Lothian, a serene coastal area renowned for its unspoiled beauty. Starting from the Tyninghame Links car park, follow a well-trodden path through a mixed woodland, where you may spot roe deer, red squirrels, and an array of birdlife. The path meanders past remnants of wartime tank defences before emerging onto the sweeping expanse of Ravensheugh Sands. The golden beach stretches for miles, framed by undulating dunes and backed by rugged woodland. As you stroll along the sand, you’ll be treated to panoramic views of the Bass Rock, a volcanic island hosting one of the world’s largest gannet colonies. At low tide, rock pools teem with marine life, and the gentle waves invite paddlers or those seeking quiet reflection. The area has a rich history, with connections to St Baldred, a revered 8th-century monk, whose legacy is tied to the nearby headland. The terrain is generally easy to navigate, with sandy paths, woodland tracks, and beach sections that can be tide-dependent, so checking tide times is advisable. You can extend the walk by picking up the John Muir Way and following it to the nearby John Muir Country Park . The delightful Seacliff Beach is located just to the north as well.",
  "video_url": "https://www.youtube.com/embed/ne0cGrCA6Ck?si=zKm-P2Yx-1h_v0Pa",
  "county": "East Lothian",
  "region": "Scotland",
  "country": "Scotland"
}