{
  "created_at": "2025-01-05T23:31:02.915007+00:00",
  "objectID": "73b31e3969b84c5c911ebe2fd72acebf",
  "ref": "saffron-walden-walking-route",
  "title": "Saffron Walden Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/71/Walden_Castle%2C_Saffron_walden_-_geograph.org.uk_-_154528.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/73b31e3969b84c5c911ebe2fd72acebf.gpx",
  "_geoloc": {
    "lat": 52.0227944477,
    "lng": 0.2400809274
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Walden_Castle%2C_Saffron_walden_-_geograph.org.uk_-_154528.jpg",
      "title": "Janine Forbes / Walden Castle, Saffron walden",
      "caption": "Walden Castle, Saffron Walden. Built sometime between 1125 and 1141 little remains today except the flint walls of the keep."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Audley_End_House%2C_Saffron_Walden%2C_Essex_%28geograph_2591600%29.jpg",
      "title": "pam fray / Audley End House, Saffron Walden, Essex",
      "caption": "Audley End House, Saffron Walden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Market_Cross_and_Town_Hall%2C_Saffron_Walden._-_geograph.org.uk_-_138028.jpg/256px-Market_Cross_and_Town_Hall%2C_Saffron_Walden._-_geograph.org.uk_-_138028.jpg",
      "title": "Colin Smith / Market Cross and Town Hall, Saffron Walden.",
      "caption": "Market Cross and the black and white Town Hall. The town takes its name from its former trade in saffron - used in dyeing and in medicine. The Town Hall was rebuilt in the 19th Century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Duck_Pond%2C_Saffron_Walden_-_geograph.org.uk_-_154502.jpg",
      "title": "Janine Forbes / Duck Pond, Saffron Walden",
      "caption": "Duck Pond. Located next to the long stay car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Cottages_off_Church_Street_Saffron_Walden_-_geograph.org.uk_-_1374785.jpg",
      "title": "PAUL FARMER / Cottages off Church Street Saffron Walden",
      "caption": "Attractive old cottages off Church Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Saffron_Walden_Museum_-_geograph.org.uk_-_1374772.jpg",
      "title": "PAUL FARMER / Saffron Walden Museum",
      "caption": "Saffron Walden Museum. The Museum, set in an enclosed grass meadow, was opened in 1835. It is located close to the castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Saint_Mary%27s_Church%2C_Saffron_Walden_-_geograph.org.uk_-_154537.jpg",
      "title": "Janine Forbes / Saint Mary's Church, Saffron Walden",
      "caption": "Spring blossom at Saint Mary's Church. The church is the largest parish church in Essex. It dates mainly from the end of the 15th century and is a Grade I listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Dutch_Garden%2C_Bridge_End_Garden%2C_Saffron_Walden_-_geograph.org.uk_-_950196.jpg/256px-Dutch_Garden%2C_Bridge_End_Garden%2C_Saffron_Walden_-_geograph.org.uk_-_950196.jpg",
      "title": "Julian Osley / Dutch Garden, Bridge End Garden, Saffron Walden",
      "caption": "A view of the Dutch Garden at Bridge End Gardens. Here you'll find seven interlinked gardens, including a maze, rose garden and walled garden."
    }
  ],
  "distance_km": 8.5,
  "description": "This circular walk tours the countryside around the Essex town of Saffron Walden. You'll visit the ruins of the 12th century Waldren Castle and one of the highlights of the area at Audley End. The trail starts in the centre of town and follows the Harcamlow Way to the splendid Jacobean mansion at Audley End. After exploring the fine parkland and gardens you continue south along the Beechy Ride track to Brakey Ley Wood before turning east to the Debden Road. Here you turn east and follow public footpaths and minor roads back into the town centre. You can extend the walk by continuing south from Brakey Ley Wood along the Harcamlow Way towards Newport. Around here you can pick up a nice trail along Debden Water to Debden Park. Also of interest is the long distance Saffron Trail which starts in Safron Walden. The Icknield Way Path runs just to the north of the town and can also be easily picked up to explore the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Old English Gentleman for a great pub experience in the town. The noteworthy pub dates from the 19th century and was named CAMRA Regional Pub of the Year 2012. There's a charming interior with a cosy fire and wood burner. Outside there's a sun trap patio garden for warmer days. You can find them on Gold Street with a postcode of CB10 1EJ for your sat navs. At Audley End there's two nice on site cafes which make an ideal stopping point on the walk. The tea room does lovely soups made from vegetables grown in the organic kitchen garden. There's also lots of nice outdoor seating for finer days."
    },
    {
      "subtitle": "Dog Walking",
      "content": "With lots of lovely woodland, parkland and country trails the area is ideal for dog walking. Please keep them on leads in the Audley End grounds though. The Old English Gentleman pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head to the lovely Bridge End Gardens for an easy stroll in the town. There are seven delightful 19th-century gardens here including a particularly fine Dutch garden. There's also statue fountain, fine topiary and beautiful herbaceous borders to see here. You can find them on Castle Street with a postcode of CB10 1BE for your sat navs.  If you follow the Harcamlow way south from the town you could pay a visit to the worthy town of Thaxted. Here you'll find a number of historic half timbered houses, a 14th century Guildhall, 16th century almshouses and a picturesque windmill. Following the trail south west will take you to Clavering where there's a noteworthy 14th century church and some delightful almshouses dating back to the 15th century. You'll also pass picturesque Arkesden which is well worth exploring. Just to the south there's the neighbouring village of Newport to explore. There's several photogenic Tudor buildings to admire in this historic settlement. You can also enjoy a walk to nearby Debden where there's a pretty lake and waterfall to see. For more walking ideas in the area see the Essex Walks page."
    }
  ],
  "postcode": "CB10 1EW",
  "district": "Uttlesford",
  "county": "Essex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cafe Coucou, 17, George Street, Pleasant Valley, Saffron Walden, Uttlesford, Essex, England, CB10 1EW, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "castle ruins",
    "mansion",
    "parkland",
    "gardens"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}