{
  "created_at": "2025-01-06T01:03:31.475765+00:00",
  "objectID": "73b9f0b2098478f1b40c2a05097b0f84",
  "ref": "baggeridge-country-park-walking-and-cycle-route",
  "title": "Baggeridge Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/18/The_Toposcope%2C_Baggeridge_Country_Park%2C_with_Baggeridge_Brickworks_-_geograph.org.uk_-_410301.jpg",
  "nearby": [
    {
      "description": "Wombourne Railway Walk",
      "objectID": "37c0cd74db3f71c2f8ea51e533c71534",
      "ref": "wombourne-railway-walk-walking-route"
    },
    {
      "description": "Staffordshire and Worcestershire Canal",
      "objectID": "7b73e095a9e82ad1e47bcabf38c25232",
      "ref": "staffordshire-and-worcestershire-canal-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/73b9f0b2098478f1b40c2a05097b0f84.gpx",
  "_geoloc": {
    "lat": 52.535651094,
    "lng": -2.152362067
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/The_Toposcope%2C_Baggeridge_Country_Park%2C_with_Baggeridge_Brickworks_-_geograph.org.uk_-_410301.jpg",
      "title": "Alan Murray-Rust / The Toposcope, Baggeridge Country Park, with Baggeridge Brickworks",
      "caption": "The Toposcope, Baggeridge Country Park, with Baggeridge Brickworks. Situated on the old colliery tip, views in suitable weather include the Malvern Hills, The Wrekin and the Long Mynd. Baggeridge Brickworks still make a variety of special bricks. Brickmaking and collieries were often bedfellows as the shale brought up from the mines often crushes to good brickmaking clay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Bag_Pool_%2C_Baggeridge_Country_Park%2C_Sedgley_-_geograph.org.uk_-_154307.jpg",
      "title": "Frank Smith / Bag Pool, Baggeridge Country Park, Sedgley",
      "caption": "A view of Bag Pool. The park is on the site of the old Baggeridge Colliery. Baggeridge Bricksworks can be seen in the background. The pit closed down in 1968 and reclamation began in 1981. At one time the pit was the most modern and biggest in the world. This photo was taken in April 2006"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Baggeridge_Car_Park_-_geograph.org.uk_-_374581.jpg",
      "title": "Gordon Griffiths / Baggeridge Car Park",
      "caption": "The car park and Ranger Office for the country park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Another_one_of_Baggeridge_Bandstand_-_geograph.org.uk_-_786068.jpg",
      "title": "Row17 / Baggeridge Bandstand",
      "caption": "Baggeridge Bandstand"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/View_from_Toposcope_-_geograph.org.uk_-_358100.jpg",
      "title": "Gordon Griffiths / View from Toposcope",
      "caption": "View from the Toposcope. The high point of Baggeridge Country Park was man made from the old colliery waste. The view is to Sedgley Village and churches on a high ridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Cress_Beds_-_geograph.org.uk_-_374566.jpg",
      "title": "Gordon Griffiths / Cress Beds",
      "caption": "Cress Beds. Watercress beds from the Earl of Dudleys time."
    }
  ],
  "distance_km": 3.5,
  "description": "Enjoy 150 acres of woodland and countryside in this country park near Wolverhampton. The park has four walking trails of varying levels of distance and difficulty. You will visit a number of peaceful water pools and viewpoints with terrific views of the surrounding countryside. There is also a two-mile figure of 8 mountain bike trail suitable for families with older children and beginners. Other attractions include a sensory garden, miniature railway and tea room. The park is located in Sedgley, just a few miles south of Wolverhampton city centre. On the southern side of the hall there's the 18th century Himley Hall. The historic hall is surrounded by ‘Capability’ Brown landscaped parkland with woodland walks, waterfalls and a large lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's an on site cafe selling a decent range of meals and snacks."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great place for dog walks so you'll probably see plenty of other dogs on your visit. The cafe mentioned above is also dog friendly and even serves special doggy ice cream!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a couple of miles west of the park and you can pick up the Staffordshire and Worcestershire Canal and enjoy a nice waterside walk along the towpath. You're also near to Wombourne where you can pick up the popular Wombourne Railway Walk and cycle or walk along the old railway line. Head north from the park and you can try the Wolverhampton Canal Walk along the Birmingham Canal. Also nearby is the circular Brewood Canal Walk. This visits the pretty Belvide Reservoir and the Georgian country house of Chillington Hall with its Capability Brown landscaped park and lake. The noteworthy Weston Park is also located just west of Belvide Reservoir and north west of Chillington Hall. There's more than 1000 acres of landscaped parkland surrounding this 17th century country mansion. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/s9I5n_t6jt0",
  "postcode": "DY3 4HB",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Circular, Himley, Gospel End, South Staffordshire, Staffordshire, England, DY3 4HB, United Kingdom",
  "district": "South Staffordshire",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoint",
    "garden",
    "railway"
  ],
  "facilities": [
    "tea room",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}