{
  "created_at": "2025-01-06T02:47:33.925169+00:00",
  "objectID": "73cca2c40e644ae9c1f87a1804fa76f8",
  "ref": "lake-vyrnwy-walking-and-cycle-route",
  "title": "Lake Vyrnwy Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Lake_Vyrnwy_Dam.jpeg/512px-Lake_Vyrnwy_Dam.jpeg",
  "nearby": [
    {
      "description": "Rhiwargor Waterfall",
      "objectID": "82ede8009567f6e2089df40c2e05d72d",
      "ref": "rhiwargor-waterfall-walking-route"
    },
    {
      "description": "Glyndwr's Way",
      "objectID": "0f92cd8d0f797f967adff74848343282",
      "ref": "glyndwrs-way-walking-route"
    },
    {
      "description": "Dyfnant Forest",
      "objectID": "96639a109d7ad3896614a3edb7cf99bd",
      "ref": "dyfnant-forest-walking-and-cycle-route"
    },
    {
      "description": "Pistyll Rhaeadr",
      "objectID": "9472cc56cd08a962c99678bd4674d024",
      "ref": "pistyll-rhaeadr-walking-route"
    },
    {
      "description": "Llangynog",
      "objectID": "8494d108aba93ed753db32bd05eb3f4d",
      "ref": "llangynog-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/73cca2c40e644ae9c1f87a1804fa76f8.gpx",
  "_geoloc": {
    "lat": 52.7612939692,
    "lng": -3.4588347342
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Lake_Vyrnwy_Dam.jpeg/512px-Lake_Vyrnwy_Dam.jpeg",
      "title": "Sean the Spook at the English language Wikipedia [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "View of the Lake Vyrnwy Dam in Powys looking East, showing compensation water being released from the reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Looking_up_Lake_Vyrnwy_-_geograph.org.uk_-_493401.jpg",
      "title": "Chris Downer / Looking up Lake Vyrnwy, via Wikimedia Commons",
      "caption": "Looking up Lake Vyrnwy From the hotel car park, a splendid view up the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Lake_Vyrnwy_-_geograph.org.uk_-_1590523.jpg",
      "title": "William Pugh / Lake Vyrnwy, via Wikimedia Commons",
      "caption": "The tower at Lake Vyrnwy"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Lake_Vyrnwy_-_geograph.org.uk_-_1536850.jpg",
      "title": "RAY JONES / Lake Vyrnwy, via Wikimedia Commons",
      "caption": "Aerial view across the Northern end of Lake Vyrnwy. Taken from an Enstrom 480B helicopter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Llyn_Efyrnwy_-_Lake_Vyrnwy_-_geograph.org.uk_-_1093682.jpg",
      "title": "Nigel Brown / Llyn Efyrnwy / Lake Vyrnwy, via Wikimedia Commons",
      "caption": "Also known ads Llyn Efyrnwy this is a view across the lake from close to the dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Sculpture_at_Lake_Vyrnwy_-_geograph.org.uk_-_510152.jpg/256px-Sculpture_at_Lake_Vyrnwy_-_geograph.org.uk_-_510152.jpg",
      "title": "Penny Mayes / Sculpture at Lake Vyrnwy, via Wikimedia Commons",
      "caption": "Sculpture at the lakeside. There are several examples of wooden sculpture around the lake. This one is in a picnic area and is entitled 'Gateway to other worlds' by Stan Jankowski. The Victorian filter tower in SJ0121 may be seen across the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Lake_Vyrnwy_Tower_-_geograph.org.uk_-_1182130.jpg",
      "title": "Chris Fox / Lake Vyrnwy Tower, via Wikimedia Commons",
      "caption": "Autumn view of the tower taken from the Lake Vyrnwy Hotel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Picnic_area%2C_Lake_Vyrnwy_-_geograph.org.uk_-_510155.jpg/256px-Picnic_area%2C_Lake_Vyrnwy_-_geograph.org.uk_-_510155.jpg",
      "title": "Penny Mayes / Picnic area, Lake Vyrnwy, via Wikimedia Commons",
      "caption": "Picnic area. The giant tables at this picnic area are in the shape of trees and leaves."
    }
  ],
  "distance_km": 18.0,
  "description": "Follow the lakeside cycle lanes around this lovely reservoir on this circular ride in Powys. The country lanes around the water are flat and well maintained so this is a farily easy waterside ride. It's a lovely area with the lake surrounded by hills and attractive woodland. You can hire bikes at Llandwddyn at the southern end of the water. This route starts from the visitor centre near the village of Llanwddyn and the impressive Vyrnwy Dam. You then follow the B4393 around the water for about 12 miles. The whole of this route is probably more suitable for cyclists but walkers can enjoy the reserve too. There's nice paths at the southern end of the water near the visitor centre, including a sculpture trail. There's also woodland trails on both the western and eastern side of the lake. At the northern end of the lake you will find the beautiful Rhiwargor Waterfall. There's a nice track running along the Afon Eiddew to the spectacular waterfall. At the southern end you can pick up the Glyndwr's Way long distance footpath. The waymarked trail can be used to explore the nearby Dyfnant Forest. The area is also a RSPB nature reserve so you can look out for a variety of birds including great crested grebes, dippers and buzzards. There are bird hides around the lake. You can follow the trail using the google street view link below.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the Lake Vyrnwy Hotel for some afternoon tea in the outdoor seating area which has fine views over the lake. You can find the hotel on the eastern side of the water at postcode SY10 0LY."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake is a great for a dog walk and the hotel mentioned above is also dog friendly. The nearby Dyfnant Forest is also ideal for dog walking."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south from the car park and you can explore the expansive Dyfnant Forest. Our circular walk starts from the lake car park and takes you along some of the footpaths and bridleways in the coniferous woods. The forest is also good for mountain biking with a number of wide off road trails to try. The lake is also not far from another major highlight of the area at Pistyll Rhaeadr. These wonderful falls are regarded as one of the Seven Wonders of Wales. There's a nice walking trail to follow through the gorge with a lovely waterside tea room to visit too. The falls are located about 7 miles north east of the lake. To the south of the lake you can pick up the Ann Griffiths Walk at Pont Llogel. The 7 mile trail is named after Wales' foremost female hymn writer. You'll pass locations associated with her life including her home at Dolwar Fach and her memorial chapel at Dolanog. Just a few miles to the north east there's the worthy village of Llangynog. The attractive settlement sits in fine scenic spot at the confluence of the Rivers Tanat and Eirth. From here you can explore the Tanat Valley and Berwyn Mountains. The circular Bwlch y Groes Cycle Route passes the northern end of the lake. This challenging climb takes you to the second highest public road mountain pass in Wales, with a summit altitude of 545 metres (1,788 ft). The trail also visits Bala Lake at the south eastern end of the ride. With most of the route taking place on minor roads it is also suitable for walkers."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1Y-TdXJ0Y0s",
  "postcode": "SY10 0LU",
  "district": "Llanwddyn",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Llanwddyn, Powys, Cymru / Wales, SY10 0LU, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "water",
    "grass"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "sculpture trail",
    "waterfall"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "bird hides",
    "long distance footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}