{
  "created_at": "2025-01-06T09:22:49.415996+00:00",
  "objectID": "7417f23f5fed8e070c74c5704421c5fa",
  "ref": "cadair-berwyn-walking-route",
  "title": "Cadair Berwyn Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/87/Cadair_Berwyn_-_geograph.org.uk_-_979947.jpg",
  "nearby": [
    {
      "description": "Pistyll Rhaeadr",
      "objectID": "9472cc56cd08a962c99678bd4674d024",
      "ref": "pistyll-rhaeadr-walking-route"
    },
    {
      "description": "North Berwyn Way",
      "objectID": "c89d24f0c84f2e3d0bafd9bbd7eecdc3",
      "ref": "north-berwyn-way-walking-route"
    },
    {
      "description": "Llangynog",
      "objectID": "8494d108aba93ed753db32bd05eb3f4d",
      "ref": "llangynog-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7417f23f5fed8e070c74c5704421c5fa.gpx",
  "_geoloc": {
    "lat": 52.8539120499,
    "lng": -3.3735621657
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Cadair_Berwyn_-_geograph.org.uk_-_979947.jpg",
      "title": "Eirian Evans / Cadair Berwyn",
      "caption": "Cadair Berwyn. Seen from Craig y Mwn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Summit_of_Cadair_Berwyn_-_geograph.org.uk_-_611130.jpg",
      "title": "George Tod / Summit of Cadair Berwyn",
      "caption": "A dog poses for the camera at the summit of Cadair Berwyn. Trig point view (827 metres) looking eastwards."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/View_towards_the_main_summit_from_Cadair_Berwyn_New_Top_-_geograph.org.uk_-_1201011.jpg",
      "title": "Espresso Addict / View towards the main summit from Cadair Berwyn New Top",
      "caption": "View towards the main summit. View northwards with Craig Berwyn beyond. The summit of Cadair Bronwen just appears over the ridge in the distance as well."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Cadair_Berwyn_New_Top_rocks_-_geograph.org.uk_-_1199895.jpg",
      "title": "Espresso Addict / Cadair Berwyn New Top rocks",
      "caption": "Top rocks. The classic view from the rocks of the southern summit of the mountain onto Llyn Lluncaws on a September afternoon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/View_of_Cadair_Berwyn_from_Moel_Sych_-_geograph.org.uk_-_192323.jpg",
      "title": "Espresso Addict / View of Cadair Berwyn from Moel Sych",
      "caption": "The mountain from Moel Sych. View north east from Craig y Llyn, just below the summit of Moel Sych. The right peak is the south top of Cadair Berwyn; the left is the main (though lower) summit with the trig point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/View_SE_from_Cadair_Berwyn_New_Top_-_geograph.org.uk_-_1199897.jpg",
      "title": "Espresso Addict / View SE from Cadair Berwyn New Top",
      "caption": "View SE from New Top. View from the southern summit down the Moel yr Ewig ridge. Cwm Maen Gwynedd is the valley on the left"
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to the highest point in the Berwyn Mountains range on this challenging walk in North East Wales. The walk starts from the car park at Tan-y-pistyll and takes you to the beautiful Pistyll Rhaeadr Waterfall. The falls are 240-foot (73 m) high and regarded as one of the Seven Wonders of Wales. You'll pass through attractive woodland and along the rushing waters of the Afon (River) Rhaeadr on this section of the walk. You then climb to Moel Sych the joint second highest summit on the Berwyn range. Here you will find a cairn and lovely views down to Llyn Lluncaws. From Moel Sych you continue to the 832 m (2,730 ft) summit of Cadair Berwyn. The summit lies on the border between Powys and Denbighshire, and is the highest point in Denbighshire. The views in all directions are simply stunnning with Cheshire, the Brecon Beacons and Snowdonia all visible on a clear day. From here you could continue to Cadair Bronwen but this route descends to the glacial Llyn Lluncaws and then through the beautiful Cwm Nant y Llyn valley before returning to the car park. It's a nice descent with the Nant y Llyn stream and some gorgeous scenery to enjoy. There is a B&B and a cafe near the falls so you can refresh yourself after the walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Tan-y-Pistyll Café is located near the car park at the waterfall. They serve a good range of meals, snacks and sweet treats. Just to the south west you could pay a visit to the worthy village of Llangynog. The attractive settlement sits in fine scenic spot at the confluence of the Rivers Tanat and Eirth. The New Inn is a walker friendly inn serving good quality food which you can enjoy around the log fires in the cosy interior. If the weather is good then the garden area is a great place to relax. They also provide accommodation if you would like to stay in this lovely area. You can find them on Berwyn Street at a postcode of SY10 0EX for your sat navs. Head into nearby Llandrillo and there's The Dudley Arms which dates back to the 18th century. It includes many period features including oak beams, stone walls and cosy fires. You can find them on the High Street at postcode LL21 0TL. The inn is dog friendly and provides rooms if you would like to stay in the area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Llandrillo Walk climbs to the mountain from the village to the north. The walk route takes you to the peak via Moel Pearce, Cadair Bronwen and the ancient Moel Ty Uchaf stone circle. The village itself is well worth exploring with several listed buildings and views of the River Dee."
    }
  ],
  "video_url": "https://www.youtube.com/embed/5ZATu5m5fAg",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B4391, Pen-y-Bont-Fawr, Pen-y-bont-fawr, Powys, Cymru / Wales, SY10 0HN, United Kingdom",
  "postcode": "SY10 0HN",
  "district": "Pen-y-bont-fawr",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "hard",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "pub/cafe",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}