{
  "created_at": "2025-01-06T01:43:25.066672+00:00",
  "objectID": "7454be7653cb8e4ef0870c2419e7356a",
  "ref": "hampstead-heath-walking-and-cycle-route",
  "title": "Hampstead Heath Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Hampstead_Heath_-_geograph.org.uk_-_1005708.jpg",
  "nearby": [
    {
      "description": "Dollis Valley Green Walk",
      "objectID": "cb6a7287ea281d933efef82ab4608634",
      "ref": "dollis-valley-green-walk-walking-route"
    },
    {
      "description": "Green London Way",
      "objectID": "e259e12d0abfa57ca9b45deaa30ec1f5",
      "ref": "green-london-way-walking-route"
    },
    {
      "description": "Capital Ring",
      "objectID": "ec2dd412bf73a76208eeb393c1b23372",
      "ref": "capital-ring-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7454be7653cb8e4ef0870c2419e7356a.gpx",
  "_geoloc": {
    "lat": 51.5578762812,
    "lng": -0.1672924884
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Hampstead_Heath_-_geograph.org.uk_-_1005708.jpg",
      "title": "Martin Addison / Hampstead Heath, via Wikimedia Commons",
      "caption": "Cyclists and a pedestrian meet on the West Heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Hampstead_Heath_-_geograph.org.uk_-_1003993.jpg",
      "title": "Martin Addison / Hampstead Heath, via Wikimedia Commons",
      "caption": "Part of the heath beside the Vale of Health - looking towards the hospital on the corner of Heath Street and East Heath Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Hampstead_Heath_-_geograph.org.uk_-_97869.jpg",
      "title": "Richard Slessor / Hampstead Heath, via Wikimedia Commons",
      "caption": "Taken from Parliament Hill, looking towards Highgate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Hampstead_Heath_-_geograph.org.uk_-_1276570.jpg",
      "title": "Shaun Ferguson / Hampstead Heath, via Wikimedia Commons",
      "caption": "Sandy Road entrance off Spaniards Road on to Hampstead Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Hampstead_Heath_-_geograph.org.uk_-_1003989.jpg",
      "title": "Martin Addison / Hampstead Heath, via Wikimedia Commons",
      "caption": "Ladies talk while walking their dogs on a bright autumn morning."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Footpath_on_Hampstead_Heath_-_geograph.org.uk_-_53758.jpg",
      "title": "Glyn Baker / Footpath on Hampstead Heath, via Wikimedia Commons",
      "caption": "A footpath across Hampstead Heath running almost parallel to West Heath Road. The photo was taken looking almost due west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Mixed_Bathing_Pond%2C_Hampstead_Heath_-_geograph.org.uk_-_1029150.jpg",
      "title": "Stephen McKay / Mixed Bathing Pond, Hampstead Heath, via Wikimedia Commons",
      "caption": "Mixed Bathing Pond. This pond is the uppermost of the three Hampstead Ponds at the southern end of Hampstead Heath, created in the 18th century by damming Hampstead Brook, a tributary of the River Fleet,to supply London with water. Mixed bathing is allowed here during the summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Walking_over_Hampstead_Heath_-_geograph.org.uk_-_1029173.jpg",
      "title": "Stephen McKay / Walking over Hampstead Heath, via Wikimedia Commons",
      "caption": "Walking over Hampstead Heath. The heath has long been a popular place for Londoners to get out into the fresh air, as this couple are, strolling up from Hampstead Ponds at the southern end of the Heath."
    }
  ],
  "distance_km": 5.0,
  "description": "This circular walk explores London's famous Hampstead Heath. It runs for a distance of just over 3 miles, visiting several of the parks' highlights. The large park covers 790 acres and contains miles of well laid out footpaths. You can climb the 98 metre (322 ft) high Parliament Hill for terrific views of major London landmarks such as Canary Wharf, the Gherkin, the Shard and St Paul's Cathedral. Along the eastern edge of the park are the pretty Highgate ponds which include three open-air public swimming pools. At the northern end of the heath you'll find Kenwood House. This former stately home is run by English Heritage and consists of gardens, ancient woodland and sculptures by Barbara Hepworth, Henry Moore and Eugene Dodeigne. Several long distance walking trails run past the heath - you could pick up Dollis Valley Green Walk, Green London Way or the Capital Ring if you would like to extend your walk. The route below is devised for walkers but cycling is also permitted on the heath but please be respectful of other users. Click here to see a map of the heath with the cycle route marked out.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Parliament Hill Cafe is a nice place to stop for refreshments. It's in a nice location, next to the bandstand in the park. There's a good range of snack and an outdoor seating area to relax in warmer days. You can find it at postcode NW5 1QR for your sat navs. There's an abundance of fine cafes and pubs around the heath as well. One noteworthy place worth consideration is The Spaniards Inn. The pub dates from 1585 and has some interesting literary connections. John Keats apparently penned Ode to a Nightingale in the garden and the pub is also mentioned in Charles Dickens’ Pickwick Papers. There's an attractive interior with oak-panelled walls, chandeliers, beams and log fires. Outside there's a nice garden with a BBQ on warmer days. You can find the inn on Spaniards Road at the north western end of the heath. Postcode for your sat nav is NW3 7JJ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The heath is a fantastic place for dog walking and you will see lots of other people walking their pet on your outing."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YvctFCm8PVQ",
  "postcode": "NW3 1BN",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "East Heath Road, South End Green, Belsize Park, London Borough of Camden, London, Greater London, England, NW3 1BN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland"
  ],
  "points_of_interest": [
    "viewpoint",
    "gardens",
    "sculptures"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "swimming pools"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}