{
  "objectID": "74ac829c1a2c74cf0a1f8e00f8123108",
  "created_at": "2024-12-18T23:12:05.307483+00:00",
  "ref": "cadmans-pool-walking-route",
  "title": "Cadman's Pool Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/73/Cadman%27s_Pool%2C_New_Forest_-_geograph.org.uk_-_9835.jpg",
  "nearby": [
    {
      "description": "Latchmore Brook and Hasley Hill Inclosure",
      "objectID": "1a5304aea5b8925dffc8e0cbea306d3b",
      "ref": "latchmore-brook-and-hasley-hill-inclosure-walking-route"
    },
    {
      "description": "Fritham",
      "objectID": "1618e6bc4fb50f181976db6d09d30bfb",
      "ref": "fritham-walking-route"
    },
    {
      "description": "Frogham to Fritham Circular Walk",
      "objectID": "fb922606b779c86a40973f22a05f8aa8",
      "ref": "frogham-to-fritham-circular-walk-walking-route"
    },
    {
      "description": "Bramble Hill",
      "objectID": "722bea53b12925e3a579147381898b90",
      "ref": "bramble-hill-walking-route"
    },
    {
      "description": "Godshill",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/904F36AEE71FEA7685257FA900399384/$FILE/Cadman's Pool.gpx",
  "_geoloc": {
    "lat": 50.9091270799,
    "lng": -1.6757674896
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Cadman%27s_Pool%2C_New_Forest_-_geograph.org.uk_-_9835.jpg",
      "title": "Stuart Buchan / Cadman's Pool, New Forest, via Wikimedia Commons",
      "caption": "Cadman's Pool, New Forest. This photo was taken from the car park. It is a popular starting point for walkers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Ducks%2C_Cadman%27s_Pool_-_geograph.org.uk_-_1387394.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ducks, Cadman's Pool. The pond is a breeding ground for duck and Canada geese and is one of only three ponds in the forest where fishing is allowed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Cadman%27s_Pool_-_geograph.org.uk_-_1387370.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cadman's Pool was created in the 1960s to enhance the scene by deputy surveyor of the Forest, Arthur Cadman."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Heathland_to_the_west_of_Cadman%27s_Pool%2C_New_Forest_-_geograph.org.uk_-_69295.jpg",
      "title": "Jim Champion / Heathland to the west of Cadman's Pool, New Forest, via Wikimedia Commons",
      "caption": "Heathland to the west of Cadman's Pool, New Forest. This is the view southwest from the path that leads west from the car park at Cadman's Pool. The corner of the Holly Hatch Inclosure can be seen on the right, and a few self-seeded Scots Fir can be seen on the slope to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Entrance_to_Cadman%27s_Pool_car_park%2C_New_Forest_-_geograph.org.uk_-_150794.jpg",
      "title": "Jim Champion / Entrance to Cadman's Pool car park, New Forest",
      "caption": "Entrance to the car park. The concrete track to the Forestry Commission car park at Cadman's Pool is a remnant of the Second World War airfield on the plain. The name of the pool is not a mis-spelling of nearby Cadnam, it was the surname of the Forest deputy surveyor from the 1960s who created the pool to enhance the forest scene. The car park provides convenient access to Anses Wood on the hillside leading down to Dockens Water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Heathland_to_the_west_of_Cadman%27s_Pool%2C_New_Forest_-_geograph.org.uk_-_150789.jpg",
      "title": "Jim Champion / Heathland to the west of Cadman's Pool, New Forest",
      "caption": "A similar view southwest across the heathland. Here the gravel capped terrace of Ocknell Plain slopes down to Dockens Water - the hillside is mostly waterlogged, indicated by the lack of bracken."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Track_through_Broomy_Inclosure%2C_New_Forest_-_geograph.org.uk_-_336046.jpg",
      "title": "Jim Champion / Track through Broomy Inclosure, New Forest",
      "caption": "Woodland trail west of the site. This track passes through the eastern part of Broomy Inclosure, from Broomy Bottom to Holly Hatch Cottage. This half of Broomy Inclosure comprises oak planted in 1829 following the 1808 Act of Parliament (a result of Napoleonic tensions and the need for good timber for the navy). The inclosure was 'thrown open' long ago, and without fences the commoners' stock have grazed away the ground cover between the trees shaping the present scene of tall oaks with nothing between."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Dockens_Water_and_Holly_Hatch_Cottage%2C_New_Forest_-_geograph.org.uk_-_336091.jpg",
      "title": "Jim Champion / Dockens Water and Holly Hatch Cottage, New Forest",
      "caption": "Dockens Water and Holly Hatch Cottage. The white building is Holly Hatch Cottage, a Forest Keeper's residence - one of the more remote dwellings in the New Forest. In the foreground is the concrete ford across Dockens Water, with the stream water passing beneath via plastic tubes. Dockens Water eventually joins the River Avon near Ibsley."
    }
  ],
  "distance_km": 6.0,
  "description": "This walk visits a particularly lovely and fairly quiet area of the New Forest. The attractive little pool is located near Fritham and Stoney Cross. It attracts a variety of birdlife and is a great place for a picnic. This walk starts from the Cadman's Pool car park and takes you around the pond to Splash Bridge through the Holly Hatch Inclosure. You then follow Dockens Water back to the car park. It's a nice stretch with riverside willows and pretty bridges over the water. The area is also great for wildlife spotting. Look out for deer, ponies and birds such as finches, firecrests, and woodlarks. If you would like to extend your walk then you could head to Latchmore Brook and the Hasley Hill Inclosure which is only about a mile west of the pool. Our Fritham Circular Walk visits the pool and the pretty Green Pond and Janesmoor Pond.",
  "video_url": "https://www.youtube.com/embed/C24S7E2O0bU",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}