{
  "objectID": "75b1ec9b28f6af510c046240ab5eba63",
  "created_at": "2024-12-18T21:45:52.435432+00:00",
  "ref": "sherborne-castle-walking-route",
  "title": "Sherborne Walks - Circular Walk around the Abbey and Castle",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Shadows_opposite_Sherborne_Abbey-geograph-3672309.jpg",
  "nearby": [
    {
      "description": "Macmillan Way",
      "objectID": "cf3f4a199da30cc9ae551d49d13ec8f4",
      "ref": "macmillan-way-walking-route"
    },
    {
      "description": "Corton Denham",
      "objectID": "ecd561a581c6a1ec71c4a72e88c5b0c9",
      "ref": "corton-denham-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/C2B265BF7DEB16B780257F22006502F6/$FILE/Sherborne Castle.gpx",
  "_geoloc": {
    "lat": 50.9462463605,
    "lng": -2.5162960251
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Shadows_opposite_Sherborne_Abbey-geograph-3672309.jpg",
      "title": "Basher Eyre / Shadows opposite the abbey",
      "caption": "Shadows opposite Sherborne Abbey. The abbey is one of the finest buildings in the county. It was originally founded as a cathedral it became an Abbey in 1075 before finally becoming the parish church of Sherborne with the dissolution of the monasteries. However, it is often referred to as the ‘cathedral of Dorset’."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Sherborne_Old_Castle_-_geograph.org.uk_-_458355.jpg",
      "title": "Chris Downer / Sherborne Old Castle",
      "caption": "Sherborne Old Castle from its gateway. This 12th-century ruined castle is located in the grounds of the mansion. The castle was built as the fortified palace of Roger de Caen, Bishop of Salisbury and Chancellor of England, and still belonged to the church in the late 16th century. After passing through Sherborne on the way to Plymouth, Sir Walter Raleigh fell in love with the castle, and Queen Elizabeth relinquished the estate, leasing it to Raleigh in 1592."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/The_lake%2C_Sherborne_Castle_-_geograph.org.uk_-_458358.jpg",
      "title": "Chris Downer / The lake, Sherborne Castle",
      "caption": "The lake, Sherborne Castle. This beautiful lake was designed by Capability Brown in 1753. It separates the old and new castles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Folly%2C_Sherborne_Castle_grounds_-_geograph.org.uk_-_812006.jpg",
      "title": "Simon Palmer / Folly, Sherborne Castle grounds",
      "caption": "Folly, Sherborne Castle grounds. Looking for all the world like an English civil war casualty, this is in fact a 19th century folly built to enhance the view in the Castle gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Sherborne_Castle_02.jpg",
      "title": "Mike Searle, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sherborne Castle. View of the 16th-century Tudor mansion. In the First World War the house was used by the Red Cross as a hospital and in the Second World War as the headquarters for the commandos involved in the D-Day landings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Remains_of_the_north-east_gatehouse%2C_Sherborne_Old_Castle_-_geograph.org.uk_-_509695.jpg",
      "title": "Jim Champion / Remains of the north-east gatehouse, Sherborne Old Castle",
      "caption": "Remains of the north-east gatehouse, Old Castle. In the foreground are the remains of the buildings next to the north-east gatehouse in the inner wall of the Old Castle. On the right a causeway has been created across the moat, bypassing the need for a bridge. The gatehouse was built in a similar style to the surviving south-west gatehouse at the other corner of the castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Southern_defences%2C_Sherborne_Old_Castle_-_geograph.org.uk_-_509284.jpg",
      "title": "Jim Champion / Southern defences, Sherborne Old Castle",
      "caption": "Southern defences, Old Castle. The castle's plan is roughly octagonal. The ditch to the right is the southern portion of the moat, with a crenellated wall on the outer bank. Most of the inner curtain wall is missing. The trees on the right are part of the Sherborne (new) Castle gardens, on the northern side of the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/The_moat%2C_Sherborne_Old_Castle_-_geograph.org.uk_-_509251.jpg/256px-The_moat%2C_Sherborne_Old_Castle_-_geograph.org.uk_-_509251.jpg",
      "title": "Jim Champion / The moat, Sherborne Old Castle",
      "caption": "The moat, Old Castle. Looking along the south-west corner of the moat at Sherborne Old Castle, from the entrance bridge. The castle's outer defences are roughly octagonal in shape, with the corners much shorter than the north, south, east and west sides. The trees beyond the outer crenellated wall were planted as part of the gardens of Sherborne (new) Castle. When the castle was built (12th Century) the valley below was under water, forming a shallow lake, and guests and supplies would have arrived by boat at a quay at the bottom of the steps at the barbican."
    }
  ],
  "distance_km": 2.0,
  "description": "The Dorset town of Sherborne is a fine place for a stroll with two sites of major historical interest and an attractive town centre. This circular walk starts from Sherborne Abbey before heading through the town to the castle. The walk then explores the grounds and gardens of the castle before passing along Sherborne lake to the nearby Sherborne Old Castle. It's a lovely walk with waterside paths along the 50 acre lake, woodland trails and a beautiful 42 acre landscaped garden with specimen trees, herbaceous borders and sweeping lawns. You can also explore the fine 16th-century Tudor mansion built by Sir Walter Raleigh in 1594. Inside you can view collections of art, furniture and porcelain, and Raleigh’s original kitchen. The now ruined 12th century old castle was built as the fortified palace of Roger de Caen, Bishop of Salisbury. You can visit the castle and grounds between April and October. Please note : both Sherborne castle and Sherborne old castle charge separate entry fees. See the link below for more details. There are free public footpaths across Sherborne Castle Park to the south of the castles. The Macmillan Way long distance trail runs through Sherborne so you could pick this up to extend your walk. Heading south will take you to Honeycombe Wood, Lillington and Yetminster.",
  "video_url": "https://www.youtube.com/embed/06-4Y3yKzYQ",
  "district": "Sherborne",
  "county": "Dorset",
  "region": "South West",
  "country": "England"
}