{
  "created_at": "2025-01-06T04:08:25.516877+00:00",
  "objectID": "75b979162fee5a6fdcfdf930e02a9b99",
  "ref": "malvern-common-walking-route",
  "title": "Malvern Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/37/Malvern_Common_-_geograph.org.uk_-_447145.jpg",
  "nearby": [
    {
      "description": "Worcestershire Beacon",
      "objectID": "e3eec8ab2b55e682d487fbe0872eaa36",
      "ref": "worcestershire-beacon-walking-route"
    },
    {
      "description": "Malvern Hills",
      "objectID": "e0218b46cc5b1e3547ff06616f1c7623",
      "ref": "malvern-hills-walking-route"
    },
    {
      "description": "Hanley Swan",
      "objectID": "679d14b04178b50890d151de68955347",
      "ref": "hanley-swan-walking-route"
    },
    {
      "description": "Colwall",
      "objectID": "3aa3dc3d18a2bbdf1d7381ce30c4b1f9",
      "ref": "colwall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/75b979162fee5a6fdcfdf930e02a9b99.gpx",
  "_geoloc": {
    "lat": 52.0963945257,
    "lng": -2.327082951
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Malvern_Common_-_geograph.org.uk_-_447145.jpg",
      "title": "Trevor Rickard / Malvern Common, via Wikimedia Commons",
      "caption": "Early morning mist on the Worcester Beacon and North Hill behind the common and the Malvern Technology Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Malvern_Common_-_geograph.org.uk_-_646835.jpg",
      "title": "Trevor Rickard / Malvern Common, via Wikimedia Commons",
      "caption": "View westwards towards the Worcestershire Beacon. This large area of common land is administered by the Malvern Hills Conservators, which will ensure it stays as green space."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Malvern_Common_-_geograph.org.uk_-_648292.jpg",
      "title": "Trevor Rickard / Malvern Common, via Wikimedia Commons",
      "caption": "From a waterlogged common looking north-west towards Great Malvern, the Worcestershire Beacon (left) and North Hill (right)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Malvern_Common_-_geograph.org.uk_-_646739.jpg",
      "title": "Trevor Rickard / Malvern Common, via Wikimedia Commons",
      "caption": "View eastwards from the rugged path through Firs Valley with the B4218 Wyche Road below. The Cotswold ridge some 25 miles away on the other side of the sea of mist and Bredon Hill forming an 'island' to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Peachfield_House_-_geograph.org.uk_-_1055260.jpg",
      "title": "Bob Embleton / Peachfield House, via Wikimedia Commons",
      "caption": "Peachfield House. Viewed from Hawthorn Lane withy the buildings of QinetiQ behind. Beyond is Great Malvern with North Hill in the background. Lady Littleton owned this house in the 1820s. Peachfield Road originally ran from this house to the Worcester to Ledbury turnpike road at Lower Wyche. The road still carrying this name has now been diverted somewhat to pass along the southern edge of the common land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Malvern_Common_-_geograph.org.uk_-_1064884.jpg",
      "title": "Bob Embleton / Malvern Common, via Wikimedia Commons",
      "caption": "A view in a north easterly direction from near the Peachfield road towards St. Andrews church. The distant wooded hill behind the large white Peachfield House is Dripshill."
    }
  ],
  "distance_km": 4.0,
  "description": "This route takes you across the Peachfield and Malvern Commons in the Malvern Hills AONB. The commons are located just to the south of Great Malvern and include a number of easy footpaths to try. There's also great views of the hills which are just to the west of the site. You can start the walk from the car park on Peachfield Common just off Peachfield Road. The site also includes interesting flora with species-rich grassland supported by a number of pretty wildflowers. Look out for lady’s bedstraw, common knapweed, bird’s-foot-trefoil and various orchids. In the summer months you can see lots of pretty butterflies fluttering around the flowers. Just a short distance to the west you will find Worcestershire Beacon. You could extend the walk to climb to this popular summit. From the 425 metres (1,394 ft) peak you can see 13 counties of England on a clear day. For a longer walk you can try the Malvern Hills Walk which runs along the whole length of the AONB.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "We recommend heading to the Chase Inn for some refreshments after your walk. There's a great menu and a really splendid garden area with lovely views towards the Black Mountains. You can find the pub in Upper Colwall, just to the south of Worcestershire Beacon, with a postcode of WR13 6DJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east there's the delightful village of Hanley Swan. The picturesque settlement includes a pretty village green, a pond, a 17th century pub and walking trails to neighbouring Hanley Castle where you can see the remains of the ancient fort. The river trails and historic 16th century pub at Upton Upon Severn are also in this area. For an alternative circular walk starting from the Colwall train station see the Colwall Walk. Here you can also visit the Colwall Park Hotel where you can enjoy a delicious afternoon tea in the beautiful hotel grounds."
    }
  ],
  "postcode": "WR14 4AP",
  "district": "Malvern Hills",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Peachfield Road, Wyche, Malvern Wells, Malvern, Malvern Hills, Worcestershire, England, WR14 4AP, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "views",
    "wildflowers",
    "summit"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}