{
  "created_at": "2025-01-06T10:34:56.489024+00:00",
  "objectID": "75d6be509adaff16b2144c9239df3075",
  "ref": "lewes-walking-route",
  "title": "Lewes Circular River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6e/River_Ouse_from_Hamsey_-_geograph.org.uk_-_1013280.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/75d6be509adaff16b2144c9239df3075.gpx",
  "_geoloc": {
    "lat": 50.8723868862,
    "lng": 0.0081231679
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/River_Ouse_from_Hamsey_-_geograph.org.uk_-_1013280.jpg",
      "title": "Kevin Gordon [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Ouse from Hamsey. This photo was taken from near Hamsey Church. The buildings on the left are houses on the Landport Estate, Lewes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Lewes_Castle%2C_Barbican.jpg/512px-Lewes_Castle%2C_Barbican.jpg",
      "title": "By Michael Coppins (Own work) [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Lewes Castle. The medieval castle's original name was Bray Castle, and it now stands in a commanding position guarding the South Downs gap between the towns of Lewes and Cliffe. It is made of local limestone and flint blocks and is built on a man-made mount just north of Lewes' high street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/River_Ouse_-_geograph.org.uk_-_417313.jpg",
      "title": "Simon Carey [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Ouse. The spire of Offham church can be seen in the haze in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Quarry_face_behind_the_Chalk_pit_Inn_-_geograph.org.uk_-_1618327.jpg",
      "title": "Robin Webster [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Quarry near Offham. Quarry face behind the Chalk pit Inn. As a bonus the right hand side gives a spledid view over the Ouse valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Heart_of_Reeds%2C_Lewes_Railway_Nature_Reserve_-_geograph.org.uk_-_291632.jpg",
      "title": "Simon Carey / Heart of Reeds, Lewes Railway Nature Reserve",
      "caption": "Heart of Reeds, Lewes Railway Nature Reserve. A landscaped area of reeds within the nature reserve to attract wildlife designed by Chris Drury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Swan_Inn%2C_Lewes_-_geograph.org.uk_-_66230.jpg",
      "title": "Simon Carey / Swan Inn, Lewes",
      "caption": "Swan Inn, Lewes. Situated in the southern suburb of Southover the Swan stands at the junction of Southover High Street, Kingston Road (left) and Bell Lane (right). This view looks west and was taken from Southover High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Site_of_the_Battle_of_Lewes_1264_-_geograph.org.uk_-_71534.jpg",
      "title": "Simon Carey / Site of the Battle of Lewes 1264",
      "caption": "Site of the Battle of Lewes 1264. The battle was fought between Simon de Montfort and Henry III in the field in the foreground with the former being victorious. This stunning view takes in Lewes, Lewes castle, Southerham chalk pits to the left and Beddingham Hill behind it. Nearby is the Battle of Lewes Memorial. Presented to the town in 1964 on the 700th anniversary of the battle and placed in the grounds of the former priory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Cliffe_High_Street%2C_Lewes_-_geograph.org.uk_-_70594.jpg",
      "title": "Simon Carey / Cliffe High Street, Lewes",
      "caption": "Cliffe High Street, Lewes. Looking east towards the junction with Malling Street and South Street. Until the 1960s this was the main road out of Lewes. Cliffe has long been a suburb of Lewes and grew out of its position as a crossing point over the river Ouse. It's still a shopping street but the eastern end thankfully is full of smaller shops rather than the big chain stores. Unfortunately, the area is still susceptible to flooding the last causing widespread damage a few years ago. This whole street was under water."
    }
  ],
  "distance_km": 9.0,
  "description": "This circular walk around the county town of East Sussex includes riverside paths, lovely views of the South Downs and a visit to Lewes Castle. The attractive town is located a few miles north east of Brighton, in a pretty area of the South Downs. As such there's several good options for walkers with some good hill climbs and waterside walks along the River Ouse to enjoy. This walk starts at the 11th century castle and heads east along the High Street to the river. Here you pick up the Sussex Ouse Valley Way to take you north along the River Ouse to South Malling and Offham. This section runs past the Offham Marshes Site of Special Scientific Interest where you can look out for birds such as mallards, mute swans, grey herons and moorhens. After passing through Offham you turn south to pick up a section of the Greenwich Meridian Trail which leads you through the countryside and back to the town. To continue the walk you could follow the river in a southerly direction and visit the village of Rodmell. Here you can pick up the South Downs Way long distance trail. One of the higlights of the area is the nearby Mount Caburn. Here you will find a lovely nature reserve and wonderful views from the 480-feet (146m) hill summit. Our Glynde to Lewes Walk will take you there on a circular path while also visiting the historic Glynde Place. Another good option is to follow the Sussex Ouse Valley Way in a north easterly direction to Barcombe Mills. Here you can enjoy waterside trails, a small reservoir and a delightful riverside pub. Another major highlight of the area is the climb to Firle Beacon. Near here you can also visit Charleston, the delightful home and country meeting place for the writers, painters and intellectuals known as the Bloomsbury group. Heading east from the town will take you past the Malling Down Nature Reserve to Glyndebourne. The English country house, is also the site of an opera house that, since 1934, has been the venue for the annual Glyndebourne Festival Opera.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town head to the Swan Inn for some post walk refreshment. The quaint little pub serves good quality food and has a delightful walled garden for warmer days. The historic inn dates back to at least 1760 and has a charming interior with low ceilings, wonky walls and an open fire. You can find them at 30a Southover High Street with postcode BN7 1HU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and river trails make for a fine dog walk. The Swan Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a couple of miles to the south you'll find the interesting village of Iford. The historic settlement includes 18 listed buildings, a 12th century church and a sundial marking the Greenwich meridian which runs through the village. From here you can enjoy a walk up to the viewpoint at Iford Hill on a particularly lovely section of the South Downs. On the Iford walk there's also Rodmell where you can visit the National Trust's Monk's House. The 16th-century weatherboarded cottage was once the home of author Virginia Woolfe and her husband. Next to the village there's also the Castle Hill National Nature Reserve. The significant site includes chalk grassland with ancient settlements and lots of interesting flora and fauna to see."
    }
  ],
  "video_url": "https://www.youtube.com/embed/r-3asMkpC3s",
  "postcode": "BN7 1XP",
  "district": "Lewes",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "166, High Street, Southover, Lewes, East Sussex, England, BN7 1XP, United Kingdom",
  "state": "England"
}