{
  "created_at": "2025-01-06T04:46:02.206260+00:00",
  "objectID": "76206b7b56060df09a605b6585dce9e2",
  "ref": "ogmore-by-sea-walking-route",
  "title": "Ogmore by Sea and Dunraven Bay Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Ogmore-by-Sea_-_geograph.org.uk_-_90879.jpg",
  "nearby": [
    {
      "description": "Glamorgan Heritage Coast",
      "objectID": "4306a39e1f2fa17d3c7e649594fa6c58",
      "ref": "glamorgan-heritage-coast-walking-route"
    },
    {
      "description": "Southerndown and Ogmore Coastal Walk",
      "objectID": "a876e5bb4a6884184455b56e1a55ae20",
      "ref": "southerndown-and-ogmore-coastal-walk-walking-route"
    },
    {
      "description": "Merthyr Mawr Sand Dunes Walk",
      "objectID": "6e0a6a35f8bcdb1632a419f4469afe53",
      "ref": "merthyr-mawr-sand-dunes-walk-walking-route"
    },
    {
      "description": "Llantwit Major",
      "objectID": "e30301cd015873753de7d342941ce479",
      "ref": "llantwit-major-walking-route"
    },
    {
      "description": "Bridgend Circular Walk",
      "objectID": "f22b929f96f41c63ab8edbce84785b59",
      "ref": "bridgend-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/76206b7b56060df09a605b6585dce9e2.gpx",
  "_geoloc": {
    "lat": 51.4675998462,
    "lng": -3.6387979707
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Ogmore-by-Sea_-_geograph.org.uk_-_90879.jpg",
      "title": "Darius Khan / Ogmore-by-Sea",
      "caption": "Rocks at Ogmore-by-Sea"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Mouth_of_River_Ogmore%2C_Ogmore-by-Sea%2C_Wales_-_geograph.org.uk_-_90093.jpg",
      "title": "John Goodall / Mouth of River Ogmore, Ogmore-by-Sea, Wales",
      "caption": "Mouth of River Ogmore"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Rock_Strata_on_Ogmore_Beach_-_geograph.org.uk_-_209395.jpg",
      "title": "Linda Bailey / Rock Strata on Ogmore Beach",
      "caption": "Rock Strata on Ogmore Beach. The rock strata is dipping towards the east here and then just beyond dips the other way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Coastal_viewpoint_at_site_of_plaque_on_a_rock_-_geograph.org.uk_-_1019465.jpg/256px-Coastal_viewpoint_at_site_of_plaque_on_a_rock_-_geograph.org.uk_-_1019465.jpg",
      "title": "Andrew Hill / Coastal viewpoint at site of plaque on a rock",
      "caption": "Coastal viewpoint at site of plaque on a rock. At the east end of Ogmore by Sea village, with views across the Bristol Channel to Exmoor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Dunraven_Bay_-_geograph.org.uk_-_996964.jpg/512px-Dunraven_Bay_-_geograph.org.uk_-_996964.jpg",
      "title": "Trevor Rickard / Dunraven Bay",
      "caption": "Dunraven Bay. View from Trwyn y Witch looking north-west across the beach towards Southerdown and Ogmore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Descending_towards_Dunraven_Bay_-_geograph.org.uk_-_161825.jpg",
      "title": "Nigel Homer / Descending towards Dunraven Bay",
      "caption": "Descending towards Dunraven Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Coast_road%2C_Ogmore-by-sea_-_geograph.org.uk_-_1016936.jpg",
      "title": "Mick Lobb / Coast road, Ogmore-by-sea",
      "caption": "Coast road, Ogmore-by-sea"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Ogmore_Estuary_-_geograph.org.uk_-_15181.jpg",
      "title": "Richard Knights / Ogmore Estuary",
      "caption": "Ogmore Estuary. This is near where the Ogmore (Ogwr) joins the sea and is an area of saltmarsh. On the left side lie part of the windswept dunes of Candlestone."
    }
  ],
  "distance_km": 7.0,
  "description": "Ogmore by Sea is a pretty coastal village located at the mouth of the River Ogmore as it enters the sea on the Glamorgan coast. It's a fine place for walkers with coastal paths, lovely beaches and wonderful estuary views. This walk from the village takes you along a section of the Wales Coast Path from Ogmore to the lovely Dunraven Bay. It's about a 2.5 mile walk to the bay, so just under 5 miles there and back. Start the walk from the public car park on the sea front in Ogmore, close to the mouth of the Ogmore River. From here you can pick up the waymarked coastal trail and follow it south east to the pretty bay. Here you'll find a lovely beach, some impressive high cliffs and the Dancing Stones. The bay is also often referred to as Southerndown beach taking its name from the nearby village. It's a great place for fossil hunting and look for wildlife in the rock pools. Also keep your eyes peeled for the rare chough bird with its distinctive red bill and legs.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The splendidly named Pelican In Her Piety is a fine choice for refreshments in the village. The original inn on this site was built by the Carne family in the 18th Century and named after the family coat of arms which features a pelican. The gastro pub is located in an excellent position with views of Ogmore Castle and the surrounding countryside. They have a very good menu and a fine selection of ales to. You can find the pub on the Ogmore Road with a postcode of CF32 0QP for your sat navs. Also consider the delightful Hilary and Iain's Kitchen. This cafe bistro does great food and also has an outdoor seating area with fine sea views. You can find it at 87 Main Rd, with a postcode of CF32 0PW."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal path and Ogmore beach are a fine place to bring you dog for a bracing walk. The Pelican In Her Piety pub mentioned above is also very dog friendly and can provide water and treats for your hungry friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west of the village you can visit one of the highlights of the area at the Merthyr Mawr Sand Dunes. If you head north east along the river you will come to Merthyr Mawr and Ogmore Castle. The historic ruined castle is Grade I listed and is situated in a photogenic spot on the south bank of the River Ewenny and the east bank of the River Ogmore. Ogmore was one of three castles built in the area in the early 12th century, the others being Coity Castle and Newcastle Castle. To the south you can pick up the Glamorgan Heritage Coast Walk and heads south to the beach at Traeth Mawr, the historic St Donat's Castle and the town of Llantwit Major. The Bridgend Circular Walk passes through the area. It explores the area around the town, passing close to Bryngarw Country Park at the northern tip. There's great walking trails here taking you to woodland, gardens, and an ornamental lake. Here you can also pick up the Garw Valley Railway Path. The shared cycling and walking path starts in the park and heads north along a disused railway line to Blaengarw alond the River Garw."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Jx62RcsN8ro",
  "district": "Ogmore-by-Sea / Aberogwr",
  "county": "Bro Morgannwg - the Vale of Glamorgan",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}