{
  "created_at": "2025-01-06T18:51:55.633606+00:00",
  "objectID": "76c7007dd1cf71888b3631676abd1e7c",
  "ref": "dursey-island-loop-walking-route",
  "title": "Dursey Island Loop Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Dursey_Island_Cable_Car_09_2015_09_02.jpg/512px-Dursey_Island_Cable_Car_09_2015_09_02.jpg?20150927194539",
  "nearby": [
    {
      "description": "Bere Island",
      "objectID": "0c05db2c780bba3e6ccc48571fce1ec0",
      "ref": "bere-island-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/76c7007dd1cf71888b3631676abd1e7c.gpx",
  "_geoloc": {
    "lat": 51.6102309,
    "lng": -10.1548276
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Dursey_Island_Cable_Car_09_2015_09_02.jpg/512px-Dursey_Island_Cable_Car_09_2015_09_02.jpg?20150927194539",
      "title": "K. Jähne, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Cable Car. Dursey Island is connected to the mainland by Ireland's only cable car, a unique mode of transport that has become something of a local icon. The cable car provides not only a lifeline for the island's few semi-permanent residents but also offers an adventurous way for visitors to experience the island's tranquil beauty. The island itself is a peaceful retreat, home to just a handful of people and characterised by its serene landscapes, making it an ideal destination for those seeking solitude and a break from the hustle and bustle of daily life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/On_Dursey_Island_-_Signal_tower_on_Cnoc_Bolais_-_geograph.org.uk_-_6008942.jpg/512px-On_Dursey_Island_-_Signal_tower_on_Cnoc_Bolais_-_geograph.org.uk_-_6008942.jpg?20231227151838",
      "title": "On Dursey Island - Signal tower on Cnoc Bolais by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Signal tower on Cnoc Bolais. During migration seasons, Dursey Island attracts a variety of rare birds, including some from as far as North America, Siberia, the Far East, and Southern Europe. Notable sightings have included species such as the Wilson's Warbler, Ovenbird, Eastern Olivaceous Warbler, Red-flanked Bluetail, Hoopoe, and Bee-eater. The island's varied habitats—primarily grass fields and low hedgerows—make it an ideal stopover for these migratory birds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Oile%C3%A1n_Baoi_%28Dursey_Island%29%2C_Triangulation_Pillar_-_geograph.org.uk_-_283991.jpg?20101214194453",
      "title": "Nigel Cox / Oileán Baoi (Dursey Island): Triangulation Pillar",
      "caption": "Oileán Baoi (Dursey Island), Triangulation Pillar. On a clear day like this one, the trig must have one of the finest aspects in all of Ireland. This view was taken looking back along the spine of Dursey Island towards the mainland, with the Kenmare River to the left and Bantry Bay to the right, but the views to the ends of the peninsulas to the north and south are equally spectacular. Cod's Head in V5447 is the headland to the left of the pillar. The pillar is at 252 metres above sea level."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Oile%C3%A1n_Baoi_%28Dursey_Island%29%2C_Kilmichael_-_geograph.org.uk_-_262201.jpg?20101212160449",
      "title": "Nigel Cox / Oileán Baoi (Dursey Island): Kilmichael",
      "caption": "A whitewashed cottage in the hamlet of Kilmichael, one of the three settlements on the island. Dursey has no shops, pubs or restaurants. At one point there was a post office on the island; this has since closed. The island is historically composed of three villages or 'townlands'—Ballynacallagh, Kilmichael, and Tilickafinna. These locations offer a glimpse into the island's past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Oile%C3%A1n_Baoi_%28Dursey_Island%29%2C_Ballynacallagh_-_geograph.org.uk_-_262141.jpg?20101212160448",
      "title": "Nigel Cox / Oileán Baoi (Dursey Island): Ballynacallagh",
      "caption": "The road from the cable car station looking towards the hamlet of Ballynacallagh. People who live and work on the island have their own cars and tractors which are parked at the cable car station when they are on the mainland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Oile%C3%A1n_Baoi_%28Dursey_Island%29%2C_Illanebeg_-_geograph.org.uk_-_283997.jpg?20101214194450",
      "title": "Nigel Cox / Oileán Baoi (Dursey Island): Illanebeg",
      "caption": "Illanebeg. The only land in this grid square is the south-western end of this island off Dursey Island, visible in the middle distance. The far coastline is the northern side of the bleak flat uninhabited promontory of Crow Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Oile%C3%A1n_Baoi_%28Dursey_Island%29%2C_Kilmichael_-_geograph.org.uk_-_283996.jpg?20101214194450",
      "title": "Nigel Cox / Oileán Baoi (Dursey Island): Kilmichael",
      "caption": "The hamlet of Kilmichael with the peak of Knockaree at 171 metres above sea level in V4941 visible to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Oile%C3%A1n_Baoi_%28Dursey_Island%29%2C_Southern_slopes_-_geograph.org.uk_-_262151.jpg?20101212160451",
      "title": "Nigel Cox / Oileán Baoi (Dursey Island): Southern slopes",
      "caption": "Southern slopes. Viewed looking from near the hamlet of Kilmichael showing that some of the island is used for pasture. The distant peninsula over the sea is Reen. The waters surrounding Dursey are teeming with marine life, including regular appearances by dolphins and whales. The island is also a haven for birdwatchers, as it hosts thousands of seabirds such as Gannets, Manx Shearwaters, Guillemots, Razorbills, and Puffins. Additionally, the island is an important breeding site for Choughs, a species of crow with distinctive red legs and beak."
    }
  ],
  "distance_km": 11.3,
  "description": "This circular walk follows the Dursey Island Loop around the island of Dursey at the southwestern tip of the Beara Peninsula. You can reach the island from the mainland by Ireland's only cable car. The waymarked walk takes you across the centre of the island and includes a climb to the 305 metre high Cnoc Bolais hill. From here there are glorious views over the rest of the island and the mountains, rivers and bays of the Beara Peninsula. On the way you can look out for wildlife including dolphins and a variety of sea birds. To continue your island walking in the area head east to explore Bere Island where there are another 2 waymarked loop walks to try.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/RkI9D10VE2s?si=DGJ9FSQmawbdqFJh",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Beara Way, Billeragh, Kilnamanagh, West Cork, County Cork, Munster, P75 K722, Éire / Ireland",
  "postcode": "P75 K722",
  "district": null,
  "county": "County Cork",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "coastal"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "viewpoints"
  ],
  "facilities": [
    "cable car"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}