{
  "created_at": "2025-01-05T23:31:47.561504+00:00",
  "objectID": "773b8caa60b4c80640a6d16aa219b0cb",
  "ref": "telford-walking-route",
  "title": "Telford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/66/Part_of_The_Silkin_Way%2C_Telford_Town_Park_-_geograph.org.uk_-_1361276.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/773b8caa60b4c80640a6d16aa219b0cb.gpx",
  "_geoloc": {
    "lat": 52.6760972201,
    "lng": -2.4448384571
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Part_of_The_Silkin_Way%2C_Telford_Town_Park_-_geograph.org.uk_-_1361276.jpg",
      "title": "Richard Law / Part of The Silkin Way, Telford Town Park",
      "caption": "Part of The Silkin Way, Telford Town Park. A quiet and nondescript track through the Town Park on a summer day. Some years ago, this was used for a stage in the Lombard RAC Rally - Metro 6R4s and Audi Quattros at 80mph made for a spectacular scene."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Randlay_Pool_from_the_south_-_geograph.org.uk_-_924177.jpg",
      "title": "Richard Law / Randlay Pool from the south",
      "caption": "Radlay Pool Telford. This small lake is located in the Town Park and has a nice circular footpath to try."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Ironbridge002.JPG/512px-Ironbridge002.JPG",
      "title": "No machine-readable author provided. Jasonjsmith assumed (based on copyright claims). [Public domain], via Wikimedia Commons",
      "caption": "Ironbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/5619_whistle_inn.JPG/512px-5619_whistle_inn.JPG",
      "title": "Jamielw at English Wikipedia [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)]",
      "caption": "Telford Steam Railway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Telford_Town_Park_Pool_-_geograph.org.uk_-_296066.jpg",
      "title": "Roger Dean / Telford Town Park Pool",
      "caption": "Telford Town Park Pool. This is one of two pools. The top pool was a feeder pool for the Shropshire Canal. Unfortunateley the top pool burst its banks and flooded the canal. This then formed the second pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/The_Rough_Park_Way%2C_north_of_Woodside_-_geograph.org.uk_-_1763767.jpg/512px-The_Rough_Park_Way%2C_north_of_Woodside_-_geograph.org.uk_-_1763767.jpg",
      "title": "Richard Law / The Rough Park Way, north of Woodside",
      "caption": "The Rough Park Way, north of Woodside"
    }
  ],
  "distance_km": 18.0,
  "description": "This Shropshire based town has a number of long distance trails passsing through the area. There's also a lovely local country park and the ever popular climb to the Wrekin to try. This route from makes use of the Silkin Way and the Ironbridge Way to create a circular walk around the town. You'll visits some of the town's local parks and the wonderful Ironbridge Gorge to the south of the town. The walk starts in the town centre where you can pick up the Silkin Way shared cycling and walking trail. This will lead you past the town park where you can enjoy some waterside footpaths along the Radlay Pool. In 2015 the pleasant Town Park was voted \"UK's Best Park\" in the inaugural public competition organised by Fields in Trust. The trail then passes Stirchley and Madeley before arriving at the River Severn. Here you can pick up the Severn Way and follow it west to the historic town of Ironbridge. Here you can view the impressive bridge which opened in 1781. It was the first major bridge in the world to be made of cast iron, and was greatly celebrated after construction owing to its use of the new material. The bridge, the adjacent settlement of Ironbridge and the Ironbridge Gorge form the UNESCO Ironbridge Gorge World Heritage Site. In the town you can pick the Ironbridge Way and follow it north toward the impressive Telford Steam Railway on the western outskirts of the town. The route then turns east to take you back into Telford town centre. Just to the north of the town you can visit Granville Country Park. The pretty nature reserve has some nice footpaths taking you to copses, heaths, grasslands, pools, scrub, and wet woodlands. Just to the west of the town is the wonderful climb to The Wrekin where you can enjoy magnificent views over the beautiful Shropshire Hills AONB and no less than 17 counties of England.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east of Telford you'll find the attractive market town of Shifnal. There's a nice easy climb to Lodge Hill to the south of the town. It's a good viewpoint with nice views over the area to the Wrekin. Also of interest is the circular Coalbrookdale and Ironbridge Gorge Walk which visits the fascinating Coalbrookdale Museum of Iron before exploring the woodland trails in the gorge. Just a mile south of the Iron Bridge you can visit the historic Benthall Hall. This National Trust owned hall dates from the 16th century and includes some beautiful gardens. You can tour the fine house and learn all about the interesting family history which dates back to the doomsday. Just to the north there's the lovely Aqualate Mere to explore. There's a pleasant waterside path to pick up at this large, scenic lake. The site is one of the area's highlights and notable as the largest natural lake in the English Midlands. Just to the west of here there's the interesting market town of Newport where you can enjoy another waterside stroll along the old Newport Canal. The Wellington Walk starts from the historic market town which lies just north west of Telford. It visits The Wrekin and The Ercall Nature Reserve where there are some striking geological features to admire. The walk start from close to the town's bus station and train station making the area accessible by public transport. The town is also well worth exploring with its historic market and the splendid Victorian house and garden at the National Trust's Sunnycroft to see. For more walking ideas around Telford see the Shropshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Mg9ACEvN-Ww",
  "postcode": "TF3 4DA",
  "district": "Telford",
  "county": "Telford and Wrekin",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brodie House, Grange Central, Old Park, Lawley and Overdale, Telford, Telford and Wrekin, England, TF3 4DA, United Kingdom",
  "state": "England"
}