{
  "created_at": "2025-01-06T04:50:46.149594+00:00",
  "objectID": "7743b069899a3f6f411a29a8707273a7",
  "ref": "west-devon-way-walking-route",
  "title": "West Devon Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/West_Devon_Way_in_Saltram_Wood.jpg/512px-West_Devon_Way_in_Saltram_Wood.jpg",
  "nearby": [
    {
      "description": "Meldon Reservoir",
      "objectID": "1d5341b9b1c74e75ed47c0541598cf9d",
      "ref": "meldon-reservoir-walking-route"
    },
    {
      "description": "Grenofen Bridge to Double Waters",
      "objectID": "84714176f168ece32670baf07fcec86c",
      "ref": "grenofen-bridge-to-double-waters-walking-route"
    },
    {
      "description": "Lydford Gorge",
      "objectID": "0ff9bdbdb039a023d1044e62672e2fb5",
      "ref": "lydford-gorge-walking-route"
    },
    {
      "description": "Yelverton Garden House",
      "objectID": "a5e2a1719382cfae0aefb26198ec7cf0",
      "ref": "yelverton-garden-house-walking-route"
    },
    {
      "description": "Abbot's Way",
      "objectID": "d9f4cb8d57bdeea1fdfe3d8949ee261e",
      "ref": "abbots-way-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7743b069899a3f6f411a29a8707273a7.gpx",
  "_geoloc": {
    "lat": 50.7372264685,
    "lng": -4.0028682302
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/West_Devon_Way_in_Saltram_Wood.jpg/512px-West_Devon_Way_in_Saltram_Wood.jpg",
      "title": "Nilfanion [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Saltram Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/West_Devon_Way_near_Alston_-_geograph.org.uk_-_384771.jpg",
      "title": "Derek Harper / West Devon Way near Alston, via Wikimedia Commons",
      "caption": "West Devon Way near Alston. The footpath, following Buckland Monachorum Bridleway 45, turns away westwards from the car park near Alston Cottage and begins to descend the Walkham valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Footbridge_over_the_Plym_-_geograph.org.uk_-_1690618.jpg",
      "title": "Derek Harper / Footbridge over the Plym",
      "caption": "Footbridge over the Plym. A useful connector linking paths through the riverside woods on the Leigham side of the river with the West Devon Way, which follows the old Lee Moor Tramway down the east side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Burn_Cottage_-_geograph.org.uk_-_418791.jpg",
      "title": "Derek Harper / Burn Cottage",
      "caption": "Burn Cottage. The shallow upper reaches of the Burn valley are a marked contrast to the nearby Lydford Gorge. This view from Mary Tavy Footpath 32, which is also followed by a cycle track and the West Devon Way, looks across the valley past Burn Cottage, where ponies have gathered in a corner of the moor, to Wastor Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Towards_the_Plym_valley_-_geograph.org.uk_-_1621140.jpg",
      "title": "Derek Harper / Towards the Plym valley",
      "caption": "Towards the Plym valley. A view across meadows from the road between Bickleigh and Ham Farm, looking up the well-wooded Plym valley. On the left, the line of trees heading slightly up to the right indicates the line of the former Plym Valley railway, now a cycle trail and followed by the West Devon Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Wooded_ridge_between_Rivers_Tavy_and_Walkham_-_geograph.org.uk_-_124561.jpg",
      "title": "Derek Harper / Wooded ridge between Rivers Tavy and Walkham",
      "caption": "Wooded ridge between Rivers Tavy and Walkham. Moss-covered boulders beside the Way just before it drops down to Double Waters, where the Walkham (below left) joins the Tavy (below right). Looking south-west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Fernworthy_Down_-_geograph.org.uk_-_316756.jpg",
      "title": "Derek Harper / Fernworthy Down",
      "caption": "Fernworthy Down Toffee-coloured puddles on Bridestowe Byway 16 as it cuts along the western foot of the Down, which is access land. The byway here forms part of the West Devon Way and the Dartmoor Way, and must have been an important route between Okehampton and Lydford before the present A386."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/West_Devon_Way_-_geograph.org.uk_-_383090.jpg",
      "title": "Derek Harper / West Devon Way",
      "caption": "The Way follows this smooth tarmac drive to Bucktor as its descends the side of the Walkham valley through park-like common land. This is also the line of Buckland Monachorum Bridleway 45."
    }
  ],
  "distance_km": 57.0,
  "description": "Explore the western edge of the Dartmoor National Park on this walk through beautiful Devon. The route begins in Okehampton and passes through Sourton, Lydford, Mary Tavy, Tavistock and Bickleigh before finishing in the maritime city of Plymouth. Trail highlights include the picturesque Meldon Reservoir and the town of Lydford with its noteworthy castle and nearby Lydford Gorge. Near Tavistock you visit Double Waters, a lovely spot where the River Walkham meets the River Tavy. There are also lovely waterside stretches along the River Tavy near Tavistock and along the River Plym into Plymouth.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the start/end in Okehampton The Fountain Inn is a good choice. The inn has a lovely terrace and riverside garden area where you can relax on warmer days. They serve a fine Sunday carvery with a cosy interior and two real fires. You can find them on Fore Street with a postcode of EX20 1AP. The town itself is also well worth exploring with highlights including the 15th century Chapel of St James and the medieval ruins of Okehampton Castle which is now run as a tourist attraction by English Heritage.On the walk you could stop for refreshments at the Highwayman Inn for a great pub experience. The pub is considered England's most unusual inn with a marvellous interior and an interesting mix of ancient artifacts. It dates from the 11th-century and is also said to be haunted! The wonderful inn is located to the west of Meldon Reservoir at Sourton, postcode EX20 4HN. In Peter Tavy there's the 15th century Peter Tavy Inn. The pub includes a charming old interior with ancient timber beams and warming log fires. Outside there's a lovely garden area with views of the Dartmoor countryside. You can find them at postcode PL19 9NN for your sat navs. The village also includes a 14th century church and more nice views of the River Tavy."
    }
  ],
  "video_url": "https://www.youtube.com/embed/q4vJSr1ldNQ",
  "postcode": "EX20 1HU",
  "district": "West Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "1, Castle Road, Okemoor Park, Okehampton, West Devon, Devon, England, EX20 1HU, United Kingdom",
  "state": "England"
}