{
  "created_at": "2025-01-06T03:08:12.830051+00:00",
  "objectID": "775d344c816bcbe2e47b2443eed12602",
  "ref": "stoke-by-nayland-walking-route",
  "title": "Stoke By Nayland Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Stoke-by-Nayland_-_geograph.org.uk_-_130582.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/775d344c816bcbe2e47b2443eed12602.gpx",
  "_geoloc": {
    "lat": 51.9894325635,
    "lng": 0.8950298788
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Stoke-by-Nayland_-_geograph.org.uk_-_130582.jpg",
      "title": "Chris Heaton / Stoke-by-Nayland",
      "caption": "Stoke-by-Nayland. Lovely village in Suffolk's Constable Country"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/The_small_village_green_at_Stoke-by-Nayland_-_geograph.org.uk_-_846477.jpg",
      "title": "Robert Edwards / The small village green at Stoke-by-Nayland",
      "caption": "The small village green at Stoke-by-Nayland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Fen_Street%2C_Nayland_-_geograph.org.uk_-_1352854.jpg",
      "title": "Nina Metson / Fen Street, Nayland",
      "caption": "Fen Street, Nayland Houses on Fen Street, looking towards Court Street. Houses on this side of Fen Street are accessed across private bridges which span a small stream running off the River Stour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Swan_at_Nayland_-_geograph.org.uk_-_186550.jpg",
      "title": "Bob Jones / Swan at Nayland",
      "caption": "Swan at Nayland. The River Stour flows from right to left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/St_Peters_church%2C_Boxted_%28geograph_4210405%29.jpg/512px-St_Peters_church%2C_Boxted_%28geograph_4210405%29.jpg",
      "title": "Bikeboy / St Peter's church, Boxted",
      "caption": "St Peters church, Boxted"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/The_Essex_Way_131_-_St_Mary%27s_Langham_-_geograph.org.uk_-_2404945.jpg",
      "title": "Trevor Harris / The Essex Way 131: St Mary's Langham",
      "caption": "The Essex Way 131: St Mary's Langham, near to Stratford st Mary, Suffolk, Great Britain. Taken from the Essex Way as it passes the church on the south side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Stour_Valley_Path%2C_Stratford_St_Mary_-_panoramio.jpg/256px-Stour_Valley_Path%2C_Stratford_St_Mary_-_panoramio.jpg",
      "title": "Maarten Sepp / CC BY-SA (https://creativecommons.org/licenses/by-sa/3.0)",
      "caption": "Stour Valley Path, Stratford St Mary"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/River_Stour%2C_Suffolk-Essex_border_-_geograph.org.uk_-_397554.jpg",
      "title": "John Lemay / River Stour, Suffolk/Essex border",
      "caption": "River Stour, Suffolk-Essex border. This is the River Stour, just upstream of Stratford St Mary, in \"Constable Country\". Photo is taken from the \"Stour Valley Path\"."
    }
  ],
  "distance_km": 22.6,
  "description": "This route uses sections of the St Edmund Way, the Essex Way and the Stour Valley Path to create a circular walk around this Suffolk based village. It's a very pretty settlement with many cottages and old timber-framed houses. There's also a noteworthy village church which dates from the 15th century and features several times in John Constable's paintings. The route runs for about 14 miles, visiting the neighbouring settlements of Nayland, Langham and Stratford St Mary. On the way there's lovely Constable country scenery and views of the River Stour to enjoy. The walk starts in Stoke By Nayland where you can pick up the St Edmund Way and follow it west and then south to Nayland. Here you cross the River Stour on Nayland Bridge before continuing south east to Boxted where you pick up the Essex Way. Follow it east and it will take you to Langham where you turn north towards Stratford St Mary. Here you pick up the Stour Valley Path and follow the waymarked trail along the river for a while before passing Thornington Hall. This old hall dates from 1600 and is owned by the National Trust. It is a picturesque place and one of the best timber-framed houses in Suffolk. After passing the old hall you continue north towards Gifford's Hall and Withermarsh Green before turning west to return to Stoke By Nayland.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Crown is a fine place for refreshments after your walk. The main draw here is a beautiful large garden area where you can relax on warmer days. They do great food and can be found on Park Street, Stoke-by-Nayland at postcode CO6 4SE for your sat navs. The Angel Inn is also in the village and well worth consideration. It dates all the way back to the 16th century and includes open fires, original brickwork and oak beams. You can find it on Polstead Street at postcode CO6 4SA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine walk with your dog. The Crown and the Angel Inn mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can further explore the area on the Dedham Vale Walk and head south east to Dedham. Here you can try the Dedham to Flatford Walk and visit the splendid Flatford Mill. It's an idyllic place and the scene of Constable's most famous painting 'The Hay Wain'. His birthplace at East Bergholt is also nearby and well worth visiting. Just to the north is neighbouring Polstead where there's a village green, pond a fine 17th century inn worthy of investigation. You could also pay a visit to the nearby Alton Water where there are some lovely waterside trails. To the west you can visit the worthy village of Bures. The village occupies an interesting spot, straddling the border between Suffolk and Essex. There's also a historic medieval church and a 12th century Motte and Bailey Castle which are well worth a visit. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "postcode": "CO6 4AY",
  "district": "Stoke-by-Nayland",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}