{
  "created_at": "2025-01-06T04:53:03.412525+00:00",
  "objectID": "778948ecf18acc2fa4dcc7adb47b1ed1",
  "ref": "crummock-water-walking-route",
  "title": "Crummock Water Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Dodd%2C_Crummock_Water_-_geograph.org.uk_-_30387.jpg",
  "nearby": [
    {
      "description": "Rannerdale Knotts",
      "objectID": "65de0a9da7547072a5b09ca4992850e1",
      "ref": "rannerdale-knotts-walking-route"
    },
    {
      "description": "Grasmoor",
      "objectID": "aa71aeddb145eb9c716f655e497e399f",
      "ref": "grasmoor-walking-route"
    },
    {
      "description": "Loweswater",
      "objectID": "c72c8c5008e823c614cd04061aea6f44",
      "ref": "loweswater-walking-route"
    },
    {
      "description": "Buttermere",
      "objectID": "9e5cd22c37b1be41a492341eb97fe4f6",
      "ref": "buttermere-walking-route"
    },
    {
      "description": "Scale Force",
      "objectID": "228e6f5ba7bafffc46c174128691e52d",
      "ref": "scale-force-walking-route"
    },
    {
      "description": "Force Crag Mine",
      "objectID": "b47fd1c6d7598f833dc4c3ae32637bfa",
      "ref": "force-crag-mine-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/778948ecf18acc2fa4dcc7adb47b1ed1.gpx",
  "_geoloc": {
    "lat": 54.5395456717,
    "lng": -3.2779217753
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Dodd%2C_Crummock_Water_-_geograph.org.uk_-_30387.jpg",
      "title": "Norman Durk / Dodd: Crummock Water, via Wikimedia Commons",
      "caption": "A view of Dodd peak, from Crummock water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Crummock_Water_-_geograph.org.uk_-_43371.jpg",
      "title": "Christine Matthews / Crummock Water, via Wikimedia Commons",
      "caption": "Crummock Water. The lake measures 2.5 miles (4.0 km) long, 0.6 miles (0.97 km) wide. It is 140 feet (43 metres) deep."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Ling_Crags%2C_Crummock_Water_-_geograph.org.uk_-_189437.jpg/512px-Ling_Crags%2C_Crummock_Water_-_geograph.org.uk_-_189437.jpg",
      "title": "Mark Anderson / Ling Crags, Crummock Water, via Wikimedia Commons",
      "caption": "Looking towards High Ling Crag from Low Ling Crag."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/The_shores_of_Crummock_Water_-_geograph.org.uk_-_549287.jpg",
      "title": "John Street / The shores of Crummock Water, via Wikimedia Commons",
      "caption": "The shores of Crummock Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Crummock_Water_-_geograph.org.uk_-_1405861.jpg",
      "title": "Derek Voller / Crummock Water",
      "caption": "This lovely view was taken under a glorious clear blue sky, on a circuit walk of the lake, looking South-East towards the well known profile of Honister Crag in the distance. Who would believe that I reached my car at Buttermere village in pouring rain. It says a lot about the contrariness of the Lake District weather."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/The_Cocker_leaves_Crummock_Water_-_geograph.org.uk_-_880163.jpg",
      "title": "Slbs / The Cocker leaves Crummock Water",
      "caption": "The Cocker leaves Crummock Water. The River Cocker starts at the north of the lake. It then flows into Lorton Vale. The name 'Crummock' is thought to mean 'Crooked one' and could refer to the winding nature of the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Crummock_Water_and_Buttermere_from_the_summit_of_Mellbreak_-_geograph.org.uk_-_39831.jpg",
      "title": "Ian Cunliffe / Crummock Water and Buttermere from the summit of Mellbreak",
      "caption": "Crummock Water and Buttermere from the summit of Mellbreak. Mellbreak hill runs along th western side of the lake. Alfred Wainwright said of this beautiful scene: 'no pairing of hill and lake in Lakeland have a closer partnership than these'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Woodhouse_garden%2C_Crummock_Water_-_geograph.org.uk_-_30390.jpg",
      "title": "Norman Durk / Woodhouse garden, Crummock Water",
      "caption": "Woodhouse garden. View to the lake and Mellbreak."
    }
  ],
  "distance_km": 14.0,
  "description": "Enjoy a walk around Crummock Water in the Lake District National Park. The route starts at the pretty village of Butteremere and follows the lakeside walking trail along the western shore of the lake. You then return through Mellbreak fell with fabulous views of the lake below. If you would like to continue your walk you could head to the nearby Buttermere Lake and enjoy the lakeside path there. Loweswater is also not far and is usually a more peaceful option as there are usually fewer visitors to this area. For great views over Crummock Water you could climb Grasmoor fell, which towers above the lake. For a more moderate climb look no further than the delightful Rannerdale Knotts which also overlooks the water. It also includes the beautiful bluebell valley with carpets of the flowers covering the surrounding hills.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kirkstile Inn in Loweswater is a great place to go for refreshments after your walk. They do excellent food and there is a nice garden with wonderful views of the surrounding fells. It's a lovely place to to sit outside and enjoy a drink on warmer days. The pub provides fine accommodation if you need to stay over and is also dog friendly. You can find it at postcode CA13 0RU. The Fish Inn in Butteremere village is a another good option. The inn has an interesting history being one of the oldest inns in the Lake District. They do good food and there's a comfy lounge with sofas and a fireplace to relax in indoors. There's also seating outside with fabulous views of the surrounding fells. You can easily find it in the village at postcode CA13 9XA.The Bridge Inn is also located right in the village. There's another fine garden area with one of the best views in England here."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Back in Buttermere village pay a visit to the pretty St James Church. The noteworthy church was built in 1840, though the original chapel dates back to 1507. Inside there is a stone tablet set into a window sill as a memorial to the famous walker Alfred Wainwright. The window looks out on his favourite place to walk, Haystacks, where his ashes were scattered. It's a picturesque and peaceful place to visit after your exercise.   Pictured above, the church of St James in Buttermere village, exterior and interior. Another popular walk from the village is the circular route up to Scale Force. The pretty falls are located just over a mile west of the village centre and can be reached on good public footpaths. It's well worth a visit as it's the site of the highest waterfall in the Lake District.  Pictured above Scale Force waterfall, a worthy walk from the village. Although it is less visited now, in the past boat trips across Crummock Water followed by guided excursions up to the waterfall were popular. The trail takes you along the bubbling waters of Scale Beck before coming to the falls which feed the lake. Just to the east you can pick up the Coledale Horseshoe. The popular circular walk starts from the village of Braithwaite, exploring the wonderful hanging valley and visiting several of the area's significant peaks on the way. The route also passes close to Force Crag Mine. The Scheduled ancient monument dates back to the 1800s and is now run by the National Trust. It's an interesting place to visit with information boards detailing the mine's history and some pleasant walks along the Coledale Beck."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hKqTQRiQIjI",
  "postcode": "CA13 9FG",
  "district": "Buttermere",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B5289, Buttermere, Cumberland, England, CA13 9FG, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "lake",
    "fell"
  ],
  "points_of_interest": [
    "views",
    "valley",
    "hills"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}