{
  "created_at": "2025-01-06T03:57:43.099597+00:00",
  "objectID": "77d01f30057b7497362adbbfffa13633",
  "ref": "tarn-hows-walking-route",
  "title": "Tarn Hows Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Tarn_Hows_from_the_disabled_car_park_-_geograph.org.uk_-_760357.jpg",
  "nearby": [
    {
      "description": "Black Crag",
      "objectID": "2d9fe5edea01160da315d5ee3a03801e",
      "ref": "black-crag-walking-route"
    },
    {
      "description": "Coniston Water",
      "objectID": "8ff1601a87dc5e5765d676448785d23a",
      "ref": "coniston-water-walking-and-cycle-route"
    },
    {
      "description": "Monk Coniston",
      "objectID": "313732670ca1fcc9e39c621592b6e1ec",
      "ref": "monk-coniston-walking-route"
    },
    {
      "description": "Colwith Force",
      "objectID": "60d4c36d2decf12daef27d50af9869cb",
      "ref": "colwith-force-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Grizedale Forest",
      "objectID": "0a88b6cf9125ab976d424e60b592db47",
      "ref": "grizedale-forest-walking-and-cycle-route"
    },
    {
      "description": "Hawkshead to Tarn Hows Walk",
      "objectID": "7d08d5ad4b1966a260ff4c36bf594bc8",
      "ref": "hawkshead-to-tarn-hows-walk-walking-route"
    },
    {
      "description": "Holme Fell",
      "objectID": "3bb059280003cc0a64d0f652c1341cc3",
      "ref": "holme-fell-walking-route"
    },
    {
      "description": "Silurian Way",
      "objectID": "f4cac6a02e916d21774532b77f14dde8",
      "ref": "silurian-way-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/77d01f30057b7497362adbbfffa13633.gpx",
  "_geoloc": {
    "lat": 54.3853202176,
    "lng": -3.0330930583
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Tarn_Hows_from_the_disabled_car_park_-_geograph.org.uk_-_760357.jpg",
      "title": "Phil Champion / Tarn Hows from the disabled car park",
      "caption": "Tarn Hows from the disabled car park. Tarn Hows was created to supply water to a sawmill in Yewdale. Today it is a popular beauty spot managed by the National Trust. The gate on the right leads to a well graded all-ability path leading to a viewpoint with a bench overlooking the tarn and surrounding heathland. The notice on the gate describes the gradient, length and destination of the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Road_and_heathland_above_Tarn_Hows_-_geograph.org.uk_-_760362.jpg",
      "title": "Phil Champion / Road and heathland above Tarn Hows",
      "caption": "Road and heathland above Tarn Hows"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Tarn_Hows_-_geograph.org.uk_-_361546.jpg",
      "title": "Richard C / Tarn Hows",
      "caption": "Tarn Hows"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/The_Tarns_Middle_Section_-_geograph.org.uk_-_791171.jpg",
      "title": "Alex Robinson / The Tarns Middle Section",
      "caption": "The Tarns Middle Section"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Western_shore_of_The_Tarns_-_geograph.org.uk_-_630142.jpg",
      "title": "Trevor Rickard / Western shore of The Tarns",
      "caption": "Western shore of The Tarns"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Beltie_by_the_Tarns_-_geograph.org.uk_-_1338340.jpg",
      "title": "David Baird / Beltie by the Tarns",
      "caption": "Beltie by the Tarns. A Belted Galloway grazing beside the tarn. Renowned for their docility, Belties are more used to surviving on very poor quality grazing unsuitable for most other breeds, but here they are being used mainly for conservation purposes. Their presence helps maintain a richer variety of plants, including the touch-me-not balsam which in turn encourages the rare netted carpet moth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Northern_head_of_Tarn_Hows_-_geograph.org.uk_-_839043.jpg",
      "title": "Espresso Addict / Northern head of Tarn Hows",
      "caption": "Northern head of Tarn Hows"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Bench_at_the_north_end_of_Tarn_Hows_-_geograph.org.uk_-_1338308.jpg",
      "title": "David Baird / Bench at the north end of Tarn Hows",
      "caption": "Bench at the north end of Tarn Hows. This sinuous bench provides a welcome rest when walking round the Tarns"
    }
  ],
  "distance_km": 3.5,
  "description": "This popular beauty spot is perfect for a peaceful walk in beautiful surroundings. The area is run by the National Trust and consists of a large picturesque tarn surrounded by woodland. There are well surfaced tracks taking you around the tarn and into the woodland. From the high points there are lovely views of the Lake District Mountains and the surrounding countryside. On a clear day you can see Helvellyn, Nethermost Pike, Dollywaggon Pike, Fairfield, Hart Crag and Dove Crag. The walk starts from the National Trust car park just to the south of the tarns. Head north along country lanes and you can pick up the nice surfaced footpaths along the water. There's also the option of climbing above lakes on the eastern side, where there's splendid views down to the tarns. At the northern end of the lake there's some benches where you can enjoy a rest at what is roughly the half way point of the walk. The Cumbria Way long distance walk runs through Tarn Hows. You could pick this up to continue your walk towards Colwith Force Waterfall and Elterwater (north). You could reach the site from nearby Coniston or Hawkshead on our Hawkshead to Tarn Hows Walk. It's about a 2 mile walk from the village on a mixture of country lanes and footpaths. Also nearby is the wonderful Grizedale Forest with numerous walking and cycling trails to enjoy. This route also links with the Monk Coniston Walk. This lies just to the south of the tarn and can be started from the Tarn Hows car park. It will take you through the pretty Monk Coniston Hall estate to Coniston Water. On the way you will pass through the hall's attractive woodland and walled garden. The route below starts from the car park and takes you around the tarn in an anti-clockwise direction. The climbs to Black Crag and Holme Fell start from the same car park and are both great options if you would like a more challenging walk with the reward of some wonderful views of the Coniston Lake and the Langdale Fells.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the summer months there's usually an ice cream van at the site selling tea, coffee and English Lakes ice cream. You could also head into Coniston where there's a nice lakeside cafe with great views. The Bluebird Cafe does a great range of meals and snacks. There's also a lovely outdoor seating area right next to the lake. You can find it in the village at a postcode of LA21 8AN. Hawkshead is also not far from the site. Here you'll find the 17th century Sun Innwhich is a popular option for walkers. They do really good food including an excellent fish and chips. It's a friendly place and can be easily found in the village on Main Street with a postcode of LA22 0NT for your sat navs. The inn also provides good quality accommodation and is very dog friendly if you have your pet with you."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The path around the tarn is perfect for a dog walk and you'll probably see plenty of other owners on a fine day. There's also plenty of fine woodland trails near the tarns which are also great for dog walking. The expansive Grizedale Forest just to the south is particularly good. There is some livestock around the tarns so you may want to keep them on leads in these areas."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lJ0KDjNwThs",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hawkshead Hill, Hawkshead, Westmorland and Furness, England, LA22 0PP, United Kingdom",
  "postcode": "LA22 0PP",
  "district": "Hawkshead",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoint",
    "waterfall",
    "estate"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly",
    "bench",
    "woodland",
    "walled garden"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}