{
  "created_at": "2025-01-06T01:09:30.401416+00:00",
  "objectID": "78556f35dcddc4b23825a34e27485355",
  "ref": "bayhurst-wood-country-park-and-ruislip-woods-walking-and-cycle-route",
  "title": "Bayhurst Wood Country Park and Ruislip Woods Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Mature_trees_in_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_62489.jpg/256px-Mature_trees_in_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_62489.jpg",
  "nearby": [
    {
      "description": "Hillingdon Trail",
      "objectID": "06b97e909edfc59a60c0d2fe1e632a42",
      "ref": "hillingdon-trail-walking-route"
    },
    {
      "description": "Denham Country Park",
      "objectID": "40f47cba5f31251a38746d6f04a22323",
      "ref": "denham-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/78556f35dcddc4b23825a34e27485355.gpx",
  "_geoloc": {
    "lat": 51.5902160871,
    "lng": -0.4608130303
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Mature_trees_in_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_62489.jpg/256px-Mature_trees_in_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_62489.jpg",
      "title": "David Hawgood / Mature trees in Bayhurst Wood Country Park",
      "caption": "Mature trees in Bayhurst Wood Country Park. An information board says that this wood boasts many fine mature trees, unusual for a country park. Some of these are oak trees growing tall and straight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Ruislip%2C_Bayhurst_Wood_Country_Park_-_geograph.org.uk_-_1037362.jpg",
      "title": "Nigel Cox / Ruislip: Bayhurst Wood Country Park",
      "caption": "Bayhurst Wood is one of four main woods that make up the Ruislip Woods National Nature Reserve. The others are Park Wood, Copse Wood, and Mad Bess Wood. They are remnants of the broad leaved woodland that covered much of Middlesex in prehistoric times. Much of the woodland was lost to the construction of settlements and the need for fields for crops in the middle ages, and then to suburban development in the first part of the twentieth century. Today the wood forms Bayhurst Wood Country Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Hillingdon_Trail_in_Mad_Bess_Wood%2C_Ruislip_-_geograph.org.uk_-_62479.jpg",
      "title": "David Hawgood / Hillingdon Trail in Mad Bess Wood, Ruislip",
      "caption": "Hillingdon Trail in Mad Bess Wood, Ruislip. Part of Ruislip Woods National Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Frozen_pond_by_Copse_Wood%2C_Ruislip_-_geograph.org.uk_-_111164.jpg",
      "title": "David Hawgood / Frozen pond by Copse Wood, Ruislip",
      "caption": "Frozen pond by Copse Wood, Ruislip. The pond is part of a stream that runs through Copse Wood and from here goes onto Northwood Hills. Taken on a cold day, there is a very thin film of ice on the pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Ruislip_Lido_from_Woody_Bay_-_geograph.org.uk_-_1735385.jpg",
      "title": "Alex McGregor / Ruislip Lido from Woody Bay",
      "caption": "Ruislip Lido from Woody Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Ruislip%2C_Bayhurst_Wood_Country_Park%2C_David_Brough_Cycle_Trail_-_geograph.org.uk_-_1037378.jpg",
      "title": "Nigel Cox / Ruislip: Bayhurst Wood Country Park: David Brough Cycle Trail",
      "caption": "David Brough Cycle Trail through the woods. The David Brough Cycle Trail was named after one of Hillingdon Council's longest serving employees in recognition and appreciation of his services to the borough. David joined the council in 1969 and later became head of democratic services before retiring in 2007. This two kilometre long trail was officially opened on 24 June 2008, and was the first in a series of proposed family friendly cycle trails in the borough."
    }
  ],
  "distance_km": 8.0,
  "description": "Bayhurst Wood Country Park and Ruislip Woods are located in the London Borough of Hillingdon and contain numerous walking and cycling trails. Ruislip Woods covers 726 acres and became the first National Nature Reserve in an urban area of England in 1997. The site includes grassland, ponds, streams, marshland and the delightful Ruislip Lido. The site is popular with Mountain bikers as there are a number of challenging off road trails. However there are also family cycle routes such as the David Brough cycle trail which is located in Bayhurst Wood and is suitable for all abilities of rider.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into nearby Harefield and you could visit the splendid The Old Orchard. They have a lovely large garden area where you can enjoy a meal on finer days. From there's a wonderful view towards the surrounding countryside, rivers and lakes of the Colne Valley. They also have a charming interior with interesting old photos on the wall. They serve a good range of high quality food and have a good drinks selection as well. You can find them to the north west of the woods at Park Lane with a postcode of UB9 6HJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In nearby Ruislip you can link up with the Celandine Route. This popular walk will take you along the River Pinn from Pinner to Cowley. Just to the west is Denham Country Park where there are some lovely lakeside and riverside paths to try."
    }
  ],
  "video_url": "https://www.youtube.com/embed/fty6q2HQlyw",
  "county": "Greater London",
  "region": "London",
  "country": "England",
  "gazetteer_found": true
}