{
  "created_at": "2025-01-06T09:02:24.902601+00:00",
  "objectID": "787546feefd96e885676506f29d5e48c",
  "ref": "haworth-hebden-bridge-walk-walking-route",
  "title": "Haworth-Hebden Bridge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Main_Street%2C_Haworth%2C_West_Yorkshire.jpg/256px-Main_Street%2C_Haworth%2C_West_Yorkshire.jpg",
  "nearby": [
    {
      "description": "Hebden Bridge",
      "objectID": "032b62035ea618e8df9cc2f5e8bb5791",
      "ref": "hebden-bridge-walking-route"
    },
    {
      "description": "Penistone Hill Country Park",
      "objectID": "1327eb80e9795e93b9cd866a82168f13",
      "ref": "penistone-hill-country-park-walking-route"
    },
    {
      "description": "Hardcastle Crags",
      "objectID": "8c8e0416de95d6531813fb6dd0724615",
      "ref": "hardcastle-crags-walking-route"
    },
    {
      "description": "Calderdale Way",
      "objectID": "96f0b565a2bbeec9d6d8b9b6775d477b",
      "ref": "calderdale-way-walking-route"
    },
    {
      "description": "Lumb Hole Falls",
      "objectID": "227e9d5bde5c0854bf935f07bcf17173",
      "ref": "lumb-hole-falls-walking-route"
    },
    {
      "description": "Lower Laithe Reservoir",
      "objectID": "bd99765ac55988de72eedef651f3a785",
      "ref": "lower-laithe-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/787546feefd96e885676506f29d5e48c.gpx",
  "_geoloc": {
    "lat": 53.8276665973,
    "lng": -1.962934054
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Main_Street%2C_Haworth%2C_West_Yorkshire.jpg/256px-Main_Street%2C_Haworth%2C_West_Yorkshire.jpg",
      "title": "SpaceMonkey at the English language Wikipedia / CC BY-SA (http://creativecommons.org/licenses/by-sa/3.0/)",
      "caption": "Main Street, Haworth, West Yorkshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Penistone_Hill_Country_Park_and_Lower_Laithe_Reservoir_-_geograph.org.uk_-_364398.jpg",
      "title": "Phil Champion / Penistone Hill Country Park and Lower Laithe Reservoir",
      "caption": "Penistone Hill Country Park and Lower Laithe Reservoir. The village beyond the reservoir is Stanbury, which lies in the adjacent square"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Hardcastle_Crags_-_geograph.org.uk_-_835064.jpg",
      "title": "Phil Champion / Hardcastle Crags",
      "caption": "Hardcastle Crags. The name 'Hardcastle Crags' is used to refer to the whole of the National Trusts estate on both sides of Hebden Dale. Most visitors don't stray past Gibson Mill. The Crags themselves are to the north of that point between the main track and the Hebden Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Lumb_Hole_Waterfall_-_geograph.org.uk_-_854381.jpg/512px-Lumb_Hole_Waterfall_-_geograph.org.uk_-_854381.jpg",
      "title": "Raymond Knapman / Lumb Hole Waterfall",
      "caption": "Lumb Hole Waterfall. Picturesque waterfall on Crimsworth Dean Beck near Stone Booth Farm, north of Pecket Well."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Lumb_Hole_Waterfall_-_geograph.org.uk_-_368053.jpg",
      "title": "Paul Glazzard / Lumb Hole Waterfall",
      "caption": "Lumb Hole Waterfall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Bridge_over_Hebden_Water%2C_Hebden_Bridge_-_geograph.org.uk_-_145035.jpg",
      "title": "michael ely / Bridge over Hebden Water, Hebden Bridge",
      "caption": "Bridge over Hebden Water, Hebden Bridge"
    }
  ],
  "distance_km": 13.0,
  "description": "This walking path takes you through some beautiful Yorkshire countryside from Haworth to Hebden Bridge. It runs for about 8 miles, linking two of the more popular settlements of the area. The walk starts in Penistone Hill Country Park near Haworth and heads south passing Lower Laithe and Leeshaw Reservoirs. You will also pass the splendid Lumb Hole waterfalls and the beautiful wooded valley at Hardcastle Crags before following Crimsworth Dean Beck and Hebden Water to Hebden Bridge.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Hebden Bridge there's the excellent Rim Nam Thai Restaurant. It's located in a wonderful spot right on the canal side just a short distance from The Hebden Bridge Picture House. It's a great place to enjoy a fine meal with a lovely scenic view. You can find it at Butlers Wharf at postcode HX7 8AF. A little to the west of the town centre there's also the noteworthy Fox & Goose Inn. The pub is the first community-owned pub in West Yorkshire. The friendly place is well worth some investigation with its cosy interior with a roaring fire and an exhibition space for local artists to display their work. Outside there's a lovely hillside beer garden which is great on warmer days. The place is also very dog friendly and will provide water bowls and free biscuits. You can find the pub at 7 Heptonstall Road with a postcode of HX7 6AZ for your sat navs. On the walk you could stop off in Pecket Well at the noteworthy Robin Hood Inn. The historic 17th century coaching inn has carvings of 2 men in Lincoln Green and is inscribed “If Robin Hood be not at home come take a pot with little John”. They serve traditional pub food and a fine selection of ales. If the weather is good you can sit outside in the garden area and enjoy splendid views towards Stoodley Pike. In the colder months there's a cosy interior with with 2 log burning fires to keep you warm. The inn is located just to the south of the falls at Pecket Well with postcode HX7 8QR. At the other end of the route in Haworth you'll find the excellent Haworth Old Hall. The historic 16th century inn has a charming interior with beautiful open log fires. The Tudor inn is one of the oldest buildings in the village dating back to 1621. The hall has a fascinating history with two elaborate tunnels buried beneath it. Once used as an escape route, one of the tunnels connects directly to Haworth Parish Church. During times of religious persecution, the owners would use the tunnels beneath the house to offer the nonconformist people of Haworth a safe passage of escape from the forces of the Church of England. The hall does very good food and if the weather is fine you can sit out in the large beer garden. You can find the inn Sun Street at postcode BD22 8BP for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the route you'll pass one of the hidden gems of the area at Lumb Hole Falls. These pretty waterfalls are located on the Crimsworth Beck and are a popular place for wild swimming and walks. There's also a plaque to Ted Hughes poem 'Six young Men' which concerns a group of men photographed at the falls shortly before they went to fight in the first World War. In Haworth you can extend your walking by visiting the Bronte Waterfall and Top Withens. It's a beautiful area with strong connections to the Bronte sisters. There's also the Haworth Moor Circular Walk which climbs to some of the viewpoints on the moor and visits Leeshaw Reservoir."
    }
  ],
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dimples Lane, Hole Farm, Haworth and Stanbury, Haworth, Bradford, West Yorkshire, England, BD22 8QS, United Kingdom",
  "postcode": "BD22 8QS",
  "district": "Bradford",
  "county": null,
  "state": "England"
}