{
  "created_at": "2025-01-06T04:51:11.934768+00:00",
  "objectID": "7893d92f99ec2a133237a6089c0765d7",
  "ref": "darwell-reservoir-walking-route",
  "title": "Darwell Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Darwell_Reservoir_-_geograph.org.uk_-_1286231.jpg/256px-Darwell_Reservoir_-_geograph.org.uk_-_1286231.jpg",
  "nearby": [
    {
      "description": "Bodiam Castle",
      "objectID": "3fabf07f813132bc1f97724d49e0d4fa",
      "ref": "bodiam-castle-walking-route"
    },
    {
      "description": "Brede High Woods",
      "objectID": "61d011b6ad74d6068ade7ddf8b54f123",
      "ref": "brede-high-woods-walking-route"
    },
    {
      "description": "Powdermill Reservoir",
      "objectID": "0de62c79cfeb3c7511d57530696c3836",
      "ref": "powdermill-reservoir-walking-route"
    },
    {
      "description": "Burwash",
      "objectID": "6033aee99bc610fe07a28c8f35f65a58",
      "ref": "burwash-walking-route"
    },
    {
      "description": "Bewl Water",
      "objectID": "e016f27e7e61d59b93cae067b96b5347",
      "ref": "bewl-water-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7893d92f99ec2a133237a6089c0765d7.gpx",
  "_geoloc": {
    "lat": 50.955862686,
    "lng": 0.4670892875
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Darwell_Reservoir_-_geograph.org.uk_-_1286231.jpg/256px-Darwell_Reservoir_-_geograph.org.uk_-_1286231.jpg",
      "title": "Simon Carey / Darwell Reservoir, via Wikimedia Commons",
      "caption": "Darwell Reservoir. Built in the late 1940s to supply water for the Hastings area. In recent years dry autumns and summers have left it below capacity and requiring a link with nearby Bewl Water to top it up. However, it is currently operating at 88% capacity. Old Woman's Wood is on the opposite bank whilst a dumped jeep is just about keeping its bonnet above water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Darwell_Reservoir_-_geograph.org.uk_-_1289867.jpg",
      "title": "Simon Carey / Darwell Reservoir, via Wikimedia Commons",
      "caption": "The eastern dam end viewed from the footpath that links Mountfield Lane with Glottenham Manor. The hedge at the end of the field marks the course of the former whilst Darwell Wood hugs the slopes of the next ridge to the south. The reservoir covers around 156 acres and is just over a mile long."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Looking_Towards_Darwell_Reservoir_-_geograph.org.uk_-_1286178.jpg",
      "title": "Simon Carey / Looking Towards Darwell Reservoir, via Wikimedia Commons",
      "caption": "Looking Towards Darwell Reservoir. Simmett's Wood is on the immediate right with Furnace Shaw at the bottom of the hill before the water. On the far shore to the left is Old Woman's Wood with Hunter's Farm beyond. Sizzes and Scalands Work Woods are in the distance to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Darwell_Stream_-_geograph.org.uk_-_1289771.jpg/256px-Darwell_Stream_-_geograph.org.uk_-_1289771.jpg",
      "title": "Simon Carey / Darwell Stream, via Wikimedia Commons",
      "caption": "Darwell Stream. A tributary of the Rother that also feeds the nearby reservoir of the same name. Its confluence with the river is just north of Robertsbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Darwell_Wood_-_geograph.org.uk_-_1289806.jpg",
      "title": "Simon Carey / Darwell Wood",
      "caption": "Darwell Wood. Viewed from Mountfield Lane with a small part of the Reservoir to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Darwell_Wood_-_geograph.org.uk_-_3485491.jpg",
      "title": "Darwell Wood by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Track in the woods. The wood is designated as a Site of Special Scientific Interest (SSSI). Most of the wood is made-up of coppices of hornbeam with oak standards. There is a wide variety of flora including wood sage and blackberry. If you are lucky you may spot roe deer or birds such as woodcock, green woodpecker and tawny owl."
    }
  ],
  "distance_km": 8.0,
  "description": "Explore Darwell Reservoir and Darwell Wood on this walk near Mountfield in East Sussex. The woods have lots of nice walking trails with streams, broadleaf woodland, bluebells and wild garlic to enjoy. From the public footpaths there are nice views through the trees to Darwell Reservoir. Look out for wildlife including green woodpeckers, buzzard, nightjar and sparrowhawk. The walk starts from the village of Mountfield just to the east of the woods. From here you can pick up public footpaths leading into the woods and towards the reservoir. Darwell Reservoir is located close to Robertsbridge and Battle.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The reservoir is located about a mile south west of the village of Robertsbridge. Robertsbridge railway station is on the main railway line from Hastings to London Charing Cross and provides a way of visiting the area by public transport. In the village you'll find several nice pubs including the George Inn. The pub is set in an old 18th century coaching inn and has a good menu and lots of character. Inside there's a cosy interior with warming fires and outside there's a sunny south facing patio for warmer days. You can find the pub in the centre of the village with a postcode of TN32 5AW for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir and surrounding woods are a nice place to take your dog for a walk. The George Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east of Robertsbridge you'll find Bodiam Castle. The 14th century moated castle in Sussex is one of the National Trust's most visited properties. It's well worth a visit with lovely grounds and gardens to explore. If you head east from the water you can visit Powdermill Reservoir where there's a circular walk around the encompassing Brede High Woods. It's a lovely place for a peaceful stroll with heathland, coppice, ghyll woodland, broadleaf woodland, ponds, springs and streams to enjoy. To the north west you can visit the worthy village of Burwash. Our circular walk from the village visits the National Trust's Bateman's. The fine 17th century Jacobean house was the home of author Rudyard Kipling. You can explore the house and the surrounding gardens with some great views of the surrounding High Weald countryside. For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7vySch9h9v0",
  "postcode": "TN32 5LH",
  "district": "Rother",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Road, John's Cross, Mountfield, Rother, East Sussex, England, TN32 5LH, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "views",
    "wildlife"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "loop",
  "activities": [
    "walking"
  ]
}