{
  "objectID": "79a58b4f603e92d79f03ef88668b7c58",
  "created_at": "2024-12-19T05:44:30.425852+00:00",
  "ref": "beaulieu-heath-walking-route",
  "title": "Beaulieu Heath Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Hatchet_Pond_Facing_West._-_geograph.org.uk_-_373067.jpg",
  "nearby": [
    {
      "description": "Hatchet Pond",
      "objectID": "672193e659e5492000d0b0041f8db883",
      "ref": "hatchet-pond-walking-route"
    },
    {
      "description": "Dibden Inclosure",
      "objectID": "cb44af7278b158aa6d613f987bd452f4",
      "ref": "dibden-inclosure-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/04280BB9881BF6A38025835C007FCF12/$FILE/Beaulieu Heath.gpx",
  "_geoloc": {
    "lat": 50.8143428642,
    "lng": -1.513048086
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Hatchet_Pond_Facing_West._-_geograph.org.uk_-_373067.jpg",
      "title": "Gillian Moy [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Hatchet Pond Facing West. With the road leading to East Bouldre behind, this is the view across the water at Hatchet Pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Hatchet_Moor_car_park%2C_New_Forest_-_geograph.org.uk_-_456973.jpg",
      "title": "Jim Champion / Hatchet Moor car park, New Forest",
      "caption": "Hatchet Moor car park, New Forest. This car park is located off the B3054 road, between the road and the western end of Hatchet Pond. It is surrounded by some of the old marl pits which are now flooded. The car park is a lot less busy than the nearby Hatchet Pond car park (which has the added attractions of toilets and an ice cream van)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Path_through_the_heather%2C_Beaulieu_Heath%2C_New_Forest_-_geograph.org.uk_-_509235.jpg",
      "title": "Jim Champion / Path through the heather, Beaulieu Heath, New Forest",
      "caption": "Path through the heather, Beaulieu Heath. The heather here is re-colonising a re-seeded area of lawn on Beaulieu Heath, near Crockford car park. The track leading away from the foreground is still grassy. There are cattle grazing this part of the heath, which happily eat the heather. In some areas of the Forest (for example Canada Common in the north) the heather has been completely removed by intense grazing pressure from the cattle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Beaulieu_Heath_model_aircraft_flying_area_-_geograph.org.uk_-_413794.jpg",
      "title": "Paul Whittington / Beaulieu Heath model aircraft flying area",
      "caption": "Beaulieu Heath model aircraft flying area. This was taken from the car park on the heath, off the B3054, looking west onto the runway where model aircraft were being flown. Taken on a Sunday afternoon in June."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Heathland_on_Hatchet_Moor%2C_Beaulieu_Heath%2C_New_Forest_-_geograph.org.uk_-_27602.jpg",
      "title": "Jim Champion / Heathland on Hatchet Moor, Beaulieu Heath, New Forest",
      "caption": "Heathland on Hatchet Moor, Beaulieu Heath. Typical view of the heathland with bracken, gorse and silver birch. The setting sun throws long shadows and bathes everything in a golden light. In the foreground are some prickly bushes growing in the ditch alongside one of the Second World War airfield's service roads, which now serves as an off-road cycle route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Stockley_Cottage%2C_New_Forest_-_geograph.org.uk_-_69261.jpg",
      "title": "Jim Champion / Stockley Cottage, New Forest",
      "caption": "Stockley Cottage. The cottage is a Forest Keeper's residence, at the southeastern corner of the Stockley Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Ford_through_Crockford_Stream%2C_Upper_Crockford_Bottom%2C_New_Forest_-_geograph.org.uk_-_408459.jpg",
      "title": "Jim Champion / Ford through Crockford Stream, Upper Crockford Bottom, New Forest",
      "caption": "Ford through Crockford Stream, Upper Crockford Bottom. The water in the foreground is Crockford Stream, flowing from left to right. This is a ford used by horseriders and wellington-wearers. There is a plank bridge across a narrower part of the stream just off to the right. Sandy silts are washed down from the surrounding heathland and are deposited here where the flow slows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Young_Scots_pine_by_a_track%2C_Beaulieu_Heath%2C_New_Forest_-_geograph.org.uk_-_457082.jpg",
      "title": "Jim Champion / Young Scots pine by a track, Beaulieu Heath, New Forest",
      "caption": "Young Scots pine by a track, Beaulieu Heath. This young Scots pine tree is growing alongside a well-worn track on the heath."
    }
  ],
  "distance_km": 11.5,
  "description": "Beaulieu Heath is a large area of heathland in the New Forest with miles of nice trails to try. This 7 mile circular walk takes place on a series of flat paths running down towards Norleywood and Crockford Bottom. You can start the walk from one of the car parks off the Beaulieu Road, just west of the village. There's one at the Hatchet Pond and one a little further on at Stockley Cottage. You can then pick up a number of different trails taking you around the heath, where you can see woodland, gorse and heather. Towards the southern end of the heath at Crockford Bottom there's also some pretty streams and little pools. Other highlights on the heath include the model aircraft flying area and the lovely Hatchet Pond . The pond is a great place for wildlife with egrets, herons and possibly New Forest Ponies enjoying a drink! To continue your walking in the area head to the village and try the Beaulieu River Walk . It will take you along the river to the delightful hamlet of Buckler's Hard. In the north eastern section of the heath you will find the Dibden Inclosure . It's a popular section of the heath with pretty streams, ponds and great views across the forest from the high points.",
  "video_url": "https://www.youtube.com/embed/jyt1m-TGaiM",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}