{
  "created_at": "2025-01-06T04:45:47.306518+00:00",
  "objectID": "79b42b566f4936366e461cc865cc159b",
  "ref": "bradgate-country-park-walking-and-cycle-route",
  "title": "Bradgate Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/71/Bradgate_House_-_geograph.org.uk_-_883104.jpg",
  "nearby": [
    {
      "description": "Cropston Reservoir",
      "objectID": "a2602885c266b6748752f2d4e7c29920",
      "ref": "cropston-reservoir-walking-route"
    },
    {
      "description": "Charnwood Forest",
      "objectID": "638af887754e3a9f2a61cc0dc9f98037",
      "ref": "charnwood-forest-walking-route"
    },
    {
      "description": "Swithland Reservoir",
      "objectID": "d68d5fe50f31f1977713de3ff549b03c",
      "ref": "swithland-reservoir-walking-route"
    },
    {
      "description": "Swithland Woods",
      "objectID": "1cb3723a8453f782e387941b63b7a69f",
      "ref": "swithland-woods-walking-and-cycle-route"
    },
    {
      "description": "Leicestershire Round",
      "objectID": "03b619aca78d74705228ce8c8598b890",
      "ref": "leicestershire-round-walking-route"
    },
    {
      "description": "Groby Pool",
      "objectID": "fe4a60425e63ae799a6a00af13dccf1f",
      "ref": "groby-pool-walking-route"
    },
    {
      "description": "Martinshaw Wood",
      "objectID": "204a627e227aceb47dc43cb62908eb33",
      "ref": "martinshaw-wood-walking-route"
    },
    {
      "description": "National Forest Way",
      "objectID": "33273a16668d5733c3b1e311dffdbaed",
      "ref": "national-forest-way-walking-route"
    },
    {
      "description": "Mountsorrel",
      "objectID": "8e2631b122f8119c7dca4d8f26a7c5b5",
      "ref": "mountsorrel-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/79b42b566f4936366e461cc865cc159b.gpx",
  "_geoloc": {
    "lat": 52.6971246756,
    "lng": -1.1983930535
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Bradgate_House_-_geograph.org.uk_-_883104.jpg",
      "title": "Stephen McKay / Bradgate House",
      "caption": "Bradgate House was built between about 1490 and 1500 and was one of the first unfortified great houses in the country, reflecting the relative stability of the Tudor period now that the Wars of the Roses were over. The house suffered a chequered history, particularly following the unfortunate episode of Lady Jane Grey's coronation which led to the confiscation of the Grey's property. This was subsequently restored and the Greys lived here until 1719 after which the house was abandoned although the family retained the property and continued to manage the park. The park together with the ruins of the house were sold in 1925, eventually becoming the property of Charles Bennion who donated the park to the City and County of Leicester. Thus the house remains as a magnificent ruin with just the chapel restored to something like its original condition."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Bradgate_Park_-_geograph.org.uk_-_1472586.jpg",
      "title": "Trevor Rickard / Bradgate Park",
      "caption": "Extensive view south-west from the war memorial across the 850-acre park with the city of Leicester in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Old_John_Tower%2C_Bradgate_Park_-_geograph.org.uk_-_884819.jpg/256px-Old_John_Tower%2C_Bradgate_Park_-_geograph.org.uk_-_884819.jpg",
      "title": "Stephen McKay / Old John Tower, Bradgate Park",
      "caption": "Old John Tower surveys Bradgate Park from this high vantage point. The story is that there was once a windmill here; in 1786, to celebrate the coming of age of the 5th Earl of Stamford's son, a huge bonfire was built including a pole surrounded by logs and tar barrels. Unfortunately, the pole burnt through, toppling and killing Old John, the miller. In his memory, the Earl decreed that this tower should be built on the site of the mill. It is said that the buttress seen here gives the tower the appearance of a beer mug - which may have been a humorous reference to the old miller."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Bradgate_Park_-_geograph.org.uk_-_885478.jpg",
      "title": "Stephen McKay / Bradgate Park",
      "caption": "The Charnwood Forest landscape of rugged hills emerging from areas of thick woodland is unlike anywhere else in Leicestershire and can be quite a surprise for anyone unfamiliar with the county. Bradgate Park, an ancient deer park covering 830 acres, contains some of the best of this landscape and has benefited from being kept largely in its original condition - although much of the park has now been overtaken by bracken which replaced gorse and heather. This path leads up to the Leicestershire Yeomanry memorial."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/River_Lin%2C_Bradgate_Park_-_geograph.org.uk_-_881816.jpg",
      "title": "Stephen McKay / River Lin, Bradgate Park",
      "caption": "The River Lin ambles through the park before feeding Cropston Reservoir. It is ultimately a tributary of the River Soar."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Fallow_deer%2C_Bradgate_Park_-_geograph.org.uk_-_883437.jpg",
      "title": "Stephen McKay / Fallow deer, Bradgate Park",
      "caption": "Fallow deer. Bradgate has an unbroken history as a deer park stretching back at least to the 13th century. This herd of fallow deer are relaxing in the deer sanctuary, an area of the park closed to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Lady_Jane%27s_Tower_-_geograph.org.uk_-_883397.jpg/256px-Lady_Jane%27s_Tower_-_geograph.org.uk_-_883397.jpg",
      "title": "Stephen McKay / Lady Jane's Tower",
      "caption": "Lady Jane's Tower, near to Newton Linford, Leicestershire. One of the best preserved and most poignant parts of Bradgate House is Lady Jane's Tower at the south eastern corner of the site. Lady Jane Grey was the great granddaughter of Henry VII and lived here as a child; it is said that she used to visit this tower as a retreat, perhaps from her over-bearing and ambitious parents. She had the terrible misfortune to become embroiled in the power struggle that ensued after the death of Edward VI and the attempt to prevent Mary Tudor, a Catholic, from acceding to the throne. Jane was declared Queen in 1553 four days after the death of Edward with the support of her father-in-law the protestant Duke of Northumberland. But Mary had the better claim and more widespread support; Jane's 'reign' lasted only nine days. Jane was imprisoned and beheaded for high treason in February 1554 at the age of only 16."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Lady_Jane%27s_Tower%2C_Bradgate_House_-_geograph.org.uk_-_882154.jpg/256px-Lady_Jane%27s_Tower%2C_Bradgate_House_-_geograph.org.uk_-_882154.jpg",
      "title": "Stephen McKay / Lady Jane's Tower, Bradgate House",
      "caption": "The interior of the octagonal Lady Jane's Tower, part of the east wing of the ruined Tudor mansion. It is believed that this was used by the ill-fated Lady Jane Grey as her private retreat; reputedly a highly intelligent girl, it is said that she would read Plato here in Greek at the age of thirteen whilst looking out across the park."
    }
  ],
  "distance_km": 8.3,
  "description": "Bradgate is a very large, 830 acre park located just outside the city of Leicester. It is hugely popular, with almost a million visitors each year. At Bradgate you will find a deer park with herds of red and fallow deer, a waterside path along the pretty Cropston Reservoir and a multitude of peaceful woodland walking trails. Also of interest is the climb to Old John Tower, the highest hill in Bradgate Park. The hill stands at 212 metres (696 ft) high, and is a prominent landmark across Leicester and Leicestershire. The route below is designed for walkers but cycling is allowed along the tarmac Carriageway within Bradgate Park and along bridleways in the nearby Swithland Woods. Bradgate is also historically significant as the birthplace and early home of Lady Jane Grey - Queen of England for 9 days in the 16th century. In the park you can visit the ruins of Bradgate House, built some time around 1520. To extend your walk you could follow the Leicestershire Round out of the park and visit the nearby Swithland Reservoir. You could also follow our Charnwood Forest circular walk to Beacon Hill Country Park and enjoy wonderful views from the elevated position of the park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There are two tea rooms at the site where you can enjoy some post walk refreshment. You could also head to the nearby village of Swithland where you'll find the Griffin Inn. They do good food and have a covered outdoor area which can be used rain or shine. There's a stylish interior too with with exposed beams and stone walls. In 2019 they were voted pub of the year in the Leicestershire Tourism and Hospitality Awards. You can find the pub at postcode LE12 8TJ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland make for a fine dog walk so you'll probably see other owners on your visit. You do need to keep them under control or on leads especially near the deer."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Woodhouse Eaves Walk starts from the nearby pretty village. It visits the park as well as Swithland Woods and Swithland Reservoir. Just to the north of the site there's the village of Barrow upon Soar. There's some nice walks along the Grand Union Canal and a fine waterside pub to visit here. Less than a mile south of the southern fringes of the park you'll find Groby Pool. The small lake is a good place for wildlife watching and also includes some adjacent bluebell woods. The woodland trust's Martinshaw Wood is located about half a mile south west from here. It's another peaceful local place for bird watching and easy trails. The National Forest Way passes through the area. The long distance trail takes you to several of the highlights of the National Forest area. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KDpAIhV-I1E",
  "postcode": "LE7 7HQ",
  "county": "Leicestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bradgate Country Park Hallgates Car Park, Roecliffe Road, Horseshoe Cottage Farm, Newtown Linford, Cropston, Charnwood, Leicestershire, England, LE7 7HQ, United Kingdom",
  "district": "Charnwood",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}