{
  "created_at": "2025-01-06T19:01:20.853946+00:00",
  "objectID": "79cad6798bd688aced6bc3f2bf965213",
  "ref": "rosses-point-walking-route",
  "title": "Rosses Point Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/%22Waiting_On_The_Shore%22_Memorial.jpg/512px-%22Waiting_On_The_Shore%22_Memorial.jpg",
  "nearby": [
    {
      "description": "Benbulben Forest",
      "objectID": "fef8d4791e5930b9f554162f489fc349",
      "ref": "benbulben-forest-walking-route"
    },
    {
      "description": "Mullaghmore Head",
      "objectID": "24aadf2f9a81ab47dce1a00cb314f0af",
      "ref": "mullaghmore-head-walking-route"
    },
    {
      "description": "Rougey Cliff Walk",
      "objectID": "6c67dffaac3a558aaa8065c0162a688b",
      "ref": "rougey-cliff-walk-walking-route"
    },
    {
      "description": "Glencar Waterfall",
      "objectID": "f6ed83ccfdd0d7f6938abf144170e413",
      "ref": "glencar-waterfall-walking-route"
    },
    {
      "description": "Lough Eske",
      "objectID": "ff0ec6265e3d4357fd668fb56dcc1efd",
      "ref": "lough-eske-walking-route"
    },
    {
      "description": "Killaspugbrone Loop",
      "objectID": "faaea933354a053c2e190599249e8970",
      "ref": "killaspugbrone-loop-walking-route"
    },
    {
      "description": "Lough Gill",
      "objectID": "312f47d812a541329b8574cd2a947415",
      "ref": "lough-gill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/79cad6798bd688aced6bc3f2bf965213.gpx",
  "_geoloc": {
    "lat": 54.30483,
    "lng": -8.56226
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/%22Waiting_On_The_Shore%22_Memorial.jpg/512px-%22Waiting_On_The_Shore%22_Memorial.jpg",
      "title": "Enrico Strocchi, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The sculpture 'Waiting on Shore', commemorating all those lost at sea from the Rosses Point area, was erected by the Friends of Rosses Point on a limestone podium at the entrance to the pier in Rosses Point. The site was generously donated by the Sligo County Council and overlooks the harbour and Coney Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Memorial_plaque%2C_Rosses_Point_-_geograph.org.uk_-_1622657.jpg",
      "title": "Willie Duffin / Memorial plaque, Rosses Point",
      "caption": "Memorial plaque, Rosses Point. Over 60 ships have been lost in Sligo Bay, with hardly any trace surviving. However, some notable incidents include the wreck of the Naryana in 1886 off Coney Island. Her full nameplate hangs in MJ Ward's Bar, while a photo of her captain and her ship's lifeboat nameplate can be seen in Austie's. The SS Sligo, wrecked in 1912 near Ardbowline, has its anchor mounted close to her captain's house near the end of the village. In 1925, the Diamantis Pateris was wrecked near the village with 5000 tons of maize aboard. Interesting pictures of this incident can be found in Harry's Bar, and her Captain's Table is displayed proudly in the front bar of Austie's."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Rosses_Point_Village_-_geograph.org.uk_-_24302.jpg",
      "title": "Gerry Gallagher / Rosses Point Village",
      "caption": "Rosses Point Village. Photo taken looking East from the top of the village. As a maritime locale, the village was inhabited by pirates and smugglers. Elsinore House, later owned by Henry Middleton, was originally constructed by John Black, also known as \"Black Jack,\" who was reputed to be a skilled smuggler and pirate. An investigation into the activities of an armed gang of smugglers in Rosses Point took place in the early 1800s. Eventually, authorities seized Elsinore, \"Black Jack's\" splendid residence, in recognition of his illicit endeavours."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Rosses_Point_%2852077156918%29.jpg/512px-Rosses_Point_%2852077156918%29.jpg",
      "title": "Miguel Mendez, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Deadmans Point. \"Is he dead, Captain?\" asked one of the crew. \"I can't be sure,\" came the reply, \"but we can't afford to delay sailing on this tide. He'll have to be buried.\" And so they did just that. They laid the sailor to rest in a shallow grave on the headland, placing a loaf of bread and a shovel beside him in case he should awaken. And thus, Deadman's Point acquired its name."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Bomore_Point_-_geograph.org.uk_-_979019.jpg",
      "title": "Oliver Dixon / Bomore Point",
      "caption": "Bomore Point. The area has a rich history of producing sailors and sea captains who traversed the globe. Among its notable figures is the Petty Officer stationed on The Perch Rock since 1821, famously known as our Metal Man. Positioned strategically, when ships align his light with the Oyster Island light in the backdrop, they ensure they are on the correct course home. As ships approach, his outstretched arm indicates the deep channel. Designed by Thomas Kirk, who also created Nelson's Statue once atop a pillar in Dublin and the three statues adorning the GPO, the Metal Man serves as a crucial navigational aid. Pilots maintained a constant lookout for incoming ships, often from watch houses. The oldest of these houses stands along the scenic walk. Within its walls, WB Yeats once listened to seafarers recount tales of distant lands and local folklore involving ghosts and fairies. This watch house along the scenic walk was later replaced by one near the 1st Tee on the Golf Course. Today, the VHF radio has supplanted the need for prolonged night watches."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/The_Beach_of_Rosses_Point_from_Bomore_Point_-_geograph.org.uk_-_241420.jpg",
      "title": "Bob Embleton / The Beach of Rosses Point from Bomore Point",
      "caption": "The Beach of Rosses Point from Bomore Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/A_quiet_moment_with_Yeats_on_Rosses_Point_-_geograph.org.uk_-_1950304.jpg",
      "title": "A quiet moment with Yeats on Rosses Point by John M, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A quiet moment with Yeats on Rosses Point. Rosses Point has historically served as a wellspring of inspiration for artists, poets, and musicians, a tradition that endures to this day. Perhaps its most renowned association is with the Yeats family. Deeply involved in Sligo's maritime trade, the extended Yeats clan found solace and creative fuel in the village, influencing the works of WB Yeats and the paintings of Jack Yeats. Elsinore, once owned by their Great Uncle William Middleton, played a central role in their lives. The Middleton lodges, Bowmore and Moyle, were frequented by the extended family, with Moyle Lodge hosting WB during the summer of 1887. It was here that WB penned the story poem \"The Wanderings of Oisin.\" While the significance of the Yeatsian connection to the village may not have received adequate attention, exploring WB's writings offers a glimpse into the village's past, while Jack's paintings capture its essence. Embark on the coastal walk and delve deeper into this rich history through interpretive panels along the way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Rosses_Point_%2852077380039%29.jpg/512px-Rosses_Point_%2852077380039%29.jpg",
      "title": "Miguel Mendez, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Rosses Point marks the entrance to Sligo Harbour from Sligo Bay, with Oyster Island standing out as a prominent landmass when approaching the village from Sligo town. Further along lies Inishmulclohy, also known as Coney Island, the second and larger island in the vicinity."
    }
  ],
  "distance_km": 4.0,
  "description": "Rosses Point is a delightful coastal village situated on the Wild Atlantic Way in County Sligo, Ireland. It is nestled against the stunning backdrop of Benbulben, the Dartry mountain range, and the scenic beauty of Sligo Bay. You can park on the sea front and enjoy a lovely coastal stroll along the footpaths. Follow the trails west and they will take you to the Lifeboat Station and the memorial statue commemorating all those lost at sea from the Rosses Point area. Continue west and you will soon come to Deadman's Point and Bomore Point where there is a beach and fantastic views over the bay to Coney Island and Oyster Island.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Benbulben Forest Walk is a popular walk through some peaceful woodland with excellent views of Benbulben Mountain. Near here there's also Mullaghmore Head where you can enjoy some fine views to the historic Castle Classiebawn. Just to the east there's the Glencar Waterfall in County Leitrim. Here you will find a picturesque waterfall next to the lovely Glencar Lough. To the south there's the Killaspugbrone Loop and Knocknarea where you can see one of Ireland's largest cairns and enjoy glorious views over the Cúil Irra peninsula and the Atlantic coast. To the east there's Lough Gill where there's some pleasant lakeside trails, woodland paths and lots of birds to look out for on the lough's islands. You can pick up the long distance Sligo Way here too."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZLC5sPgoRQg?si=Cgz2agHceKmDYUxN",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "L3309, Rosses Upper, Drumcliff West ED, Sligo Municipal Borough District, County Sligo, Connacht, F91 T0A4, Éire / Ireland",
  "postcode": "F91 T0A4",
  "district": null,
  "county": "County Sligo",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "coastal",
    "mountain"
  ],
  "points_of_interest": [
    "memorial statue",
    "beach",
    "views"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}