{
  "created_at": "2025-01-06T01:12:45.651804+00:00",
  "objectID": "79da751a4d22fea51490824af3dea857",
  "ref": "worth-matravers-and-st-aldhelms-head-circular-walk-walking-route",
  "title": "Worth Matravers, Winspit Quarry and St Aldhelm's Head Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Worth_Matravers._-_geograph.org.uk_-_200921.jpg",
  "nearby": [
    {
      "description": "Purbeck Circular Walk",
      "objectID": "2d0e5d76279d2821c7623efa873e4c8d",
      "ref": "purbeck-circular-walk-walking-route"
    },
    {
      "description": "Kimmeridge Bay to Chapmans Pool",
      "objectID": "8bf494265d0239bbd58479ec4d6f762c",
      "ref": "kimmeridge-bay-to-chapmans-pool-walking-route"
    },
    {
      "description": "Durlston Country Park",
      "objectID": "1129d02e294cd49c09e3881bc416cc3f",
      "ref": "durlston-country-park-walking-route"
    },
    {
      "description": "Langton Matravers",
      "objectID": "335ec509a17de0358fdcb93f87220bc4",
      "ref": "langton-matravers-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/79da751a4d22fea51490824af3dea857.gpx",
  "_geoloc": {
    "lat": 50.597484182,
    "lng": -2.0371371193
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Worth_Matravers._-_geograph.org.uk_-_200921.jpg",
      "title": "Colin Smith / Worth Matravers., via Wikimedia Commons",
      "caption": "Duck pond at Worth Matravers. This Dorset village has a long history of stone-cutting. The houses are built of Purbeck Stone (as is much of central London!). The local pub, the \"Square and Compasses\" takes its name from mason's tools."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Path_to_Winspit%2C_Worth_Matravers_%28260232%29_%289453494517%29.jpg/512px-Path_to_Winspit%2C_Worth_Matravers_%28260232%29_%289453494517%29.jpg",
      "title": "Robert Linsdell from St. Andrews, Canada [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Path to Winspit, Worth Matravers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Disused_Quarry_buildings_Winspit%2C_Worth_Matravers_-_geograph.org.uk_-_20522.jpg",
      "title": "Jerry Fryman / Disused Quarry buildings Winspit, Worth Matravers, via Wikimedia Commons",
      "caption": "Disused Quarry buildings Winspit, Worth Matravers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/St._Aldhelm%27s_Head%2C_St._Aldhelm%27s_chapel_-_geograph.org.uk_-_522917.jpg",
      "title": "Chris Downer / St. Aldhelm’s Head: St. Aldhelm’s chapel, via Wikimedia Commons",
      "caption": "St. Aldhelm's Head: St. Aldhelm's chapel. This Norman chapel is unusual in that the corners, rather than the faces, point north, east, south and west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Square_and_Compass_-_Worth_Matravers_%28geograph_4637761%29.jpg/512px-Square_and_Compass_-_Worth_Matravers_%28geograph_4637761%29.jpg",
      "title": "Les Hull / Square and Compass - Worth Matravers, via Wikimedia Commons",
      "caption": "Square and Compass"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Worth_Matravers-_Woodhenge_%28geograph_4883001%29.jpg",
      "title": "Chris Downer / Worth Matravers: Woodhenge, via Wikimedia Commons",
      "caption": "Woodhenge - The landlord of the Square and Compass, Charlie Newman, built a tree trunk sculpture known as Woodhenge, in the field near the public house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/20160814-Royal_Marines_Emmetts_Hill_Memorial.JPG/512px-20160814-Royal_Marines_Emmetts_Hill_Memorial.JPG",
      "title": "DR G WILD [Public domain], via Wikimedia Commons",
      "caption": "Marines Memorial, Emmetts Hill. Memorial to Royal Marines killed in action in recent conflicts beside the coastal path on Emmetts Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Emmetts_Hill_-_geograph.org.uk_-_1700266.jpg/512px-Emmetts_Hill_-_geograph.org.uk_-_1700266.jpg",
      "title": "Maurice D Budden / Emmetts Hill, via Wikimedia Commons",
      "caption": "Emmetts Hill. Houns-tout Cliff, in the next square to the north, can be seen in the background."
    }
  ],
  "distance_km": 7.0,
  "description": "This circular walk takes you from the pretty Dorset village of Worth Matravers to the historic St. Aldhelm's Chapel at St. Aldhelm's Head on the Dorset coast. The walk starts in the village where there is a public car park and a picturesque duck pond. From here you follow a nice footpath south along Winspit Bottom to the Winspit Quarries by the coast. You then pick up the coast path and follow it west to St. Aldhelm's Chapel. The small, Grade I listed building dates from the Norman period. Its identification as a chapel rests on records of payments to the chaplain during the reign of King Henry III (1261–1272). The chapel appears to have gone out of use some time before 1625, and was in a ruinous condition by the end of the 18th century. Repairs were carried out by local landowners during the 19th century, and the chapel was reopened for church services in 1874. During the late 19th and early 20th centuries regular weekly services were held, attended by coastguards and their families who lived in nearby cottages. After exploring the chapel the route bends round to the north to Emmetts Hill where you will pass the Royal Marines Association memorial garden which was initiated following the IRA attack on the Royal Marines Barracks at Deal in September 1989. The next stage takes you to West Hill. where you have the option of taking a detour from the route and heading down to the beautiful Chapmans Pool. This route follows a country lane east past Renscombe Farm to return you to Worth Matravers. Back in the village you can enjoy refreshments at the cafe by the pond or at the Square and Compass pub. The pub has a nice beer garden to sit out in during the summer months. It's also notable as a Grade II listed building, originally built in the 18th century as a pair of cottages before becoming a public house. The building includes a museum of fossils and other local artefacts and the pub is one of only nine nationally that has been included in every edition of CAMRA's Good Beer Guide. Our longer Purbeck Circular Walk passes through Worth Matravers so you could pick up the trail to continue your walking in the area. Heading east along the path will take you to the lovely Durlston Country Park where there's some nice flora and fauna to see.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of Worth Matravers you'll find the picturesque village of Kingston. Here you'll find some splendid Purbeck stone cottages, a wonderful old pub and a significant church known as 'The Cathedral of the Purbecks'. The circular Kingston Walk takes you to the viewpoint at Houns-Tout cliff. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/XvvVcbe_OFE",
  "postcode": "BH19 3BP",
  "district": "Worth Matravers",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Worth Farm Barns, Worth Matravers, Dorset, England, BH19 3BP, United Kingdom",
  "state": "England"
}