{
  "created_at": "2025-01-06T04:28:24.464766+00:00",
  "objectID": "7a5303a055eba1e07871eaf5a4e405f0",
  "ref": "peter-scott-walk-walking-route",
  "title": "Peter Scott Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/23/Peter_Scott_Walk_on_the_sea_bank_of_The_Wash_-_geograph.org.uk_-_1492012.jpg",
  "nearby": [
    {
      "description": "Sutton Bridge",
      "objectID": "912a411b019ffe6847c2eae13e6e5cd6",
      "ref": "sutton-bridge-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7a5303a055eba1e07871eaf5a4e405f0.gpx",
  "_geoloc": {
    "lat": 52.8070516598,
    "lng": 0.2132307016
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Peter_Scott_Walk_on_the_sea_bank_of_The_Wash_-_geograph.org.uk_-_1492012.jpg",
      "title": "Richard Humphrey / Peter Scott Walk on the sea bank of The Wash",
      "caption": "Peter Scott Walk on the sea bank of The Wash. The mid point of this walk between The Nene and The Gt Ouse along the edge of The Wash"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Peter_Scott_Walk_walkway_-_geograph.org.uk_-_673027.jpg",
      "title": "Alison Rawson / Peter Scott Walk walkway",
      "caption": "Peter Scott Walk walkway. This walkway takes the walker safely past the factory units to the right without encountering the muddy foreshore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Peter_Scott_Walk_-_geograph.org.uk_-_528383.jpg/256px-Peter_Scott_Walk_-_geograph.org.uk_-_528383.jpg",
      "title": "Martin Pearman / Peter Scott Walk",
      "caption": "The trail leading along the sea wall to the River Nene."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Sir_Peter_Scott_Lighthouse_%28East_lighthouse%29_%28geograph_3408244%29.jpg/512px-Sir_Peter_Scott_Lighthouse_%28East_lighthouse%29_%28geograph_3408244%29.jpg",
      "title": "J.Hannan-Briggs / Sir Peter Scott Lighthouse (East lighthouse)",
      "caption": "Sir Peter Scott Lighthouse (East lighthouse). Home of British ornithologist, conservationist, painter, naval officer, broadcaster, and sportsman Sir Peter Markham Scott. The only child of Antarctic explorer Robert Falcon Scott, he developed an early interest in observing and shooting wildfowl as well as developing a passion for their breeding. His father, the famous Scott of the Antarctic, urged his wife in his last letter home before he died on his ill-fated mission to the South Pole, to: “Make the boy interested in natural history”."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Start_of_the_Peter_Scott_Walk_-_geograph.org.uk_-_3008101.jpg",
      "title": "Start of the Peter Scott Walk by Oliver Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Start of the Peter Scott Walk north of Sutton Bridge. Scott helped found the World Wide Fund for Nature, whose logo he designed, and founded the Wildfowl & Wetlands Trust in Slimbridge in 1946. He was always interested in yachting and only started gliding in his middle years. He competed for the UK in sailing and took home a bronze medal at the 1936 Summer Olympics. He received the J. Paul Getty Prize, the WWF Gold Medal, and a knighthood in 1973 for his efforts to conserve wild animals."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Footpath_Along_The_Sea_Line_of_The_Lynn_Deeps_-_geograph.org.uk_-_326569.jpg",
      "title": "Tim Hallam / Footpath Along The Sea Line of The Lynn Deeps",
      "caption": "Footpath Along The Sea Line of The Lynn Deeps. These raised 'platforms' have got further out into the Wash over successive years early last Century. This was created, according to the map in 1917."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Pool_in_the_Wash_-_geograph.org.uk_-_686658.jpg/512px-Pool_in_the_Wash_-_geograph.org.uk_-_686658.jpg",
      "title": "Ben Harris / Pool in the Wash",
      "caption": "Pool in the Wash. A few metres outside the Sea Bank stands this brackish pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/The_grassy_top_of_a_small_island_-_geograph.org.uk_-_3330837.jpg/512px-The_grassy_top_of_a_small_island_-_geograph.org.uk_-_3330837.jpg",
      "title": "The grassy top of a small island by Mat Fascione, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The grassy top of a small island. Scott was one of the first people to understand how television could bring wildlife into people's homes. In 1953 he hosted the BBC's inaugural natural history programme live from his Slimbridge home. He later rose to fame as a television personality who provided commentary on the Queen's coronation and marriage. Sir David Attenborough refers to Sir Peter as his \"hero\" and the \"patron saint of conservation\" and cites his groundbreaking television career as an inspiration."
    }
  ],
  "distance_km": 16.0,
  "description": "Travel along the Wash on this lovely, easy walk through Norfolk. The path starts by the River Nene near to Naturalist and painter Sir Peter Scott's lighthouse north of Sutton Bridge. You then follow the coastline of the Wash to the Lynn Channel on the River Great Ouse. The river then leads you to the finish point at King's Lynn Ferry. Wildlife is abundant on this walk with numerous species of bird to look out for including oystercatchers, curlew, redshanks and marsh harriers. Scott is best known as the WWT (Wildfowl & Wetlands Trust) founder. There is a tribute and statue to him at the WWT London Wetland Centre. More information on his life and works can be found on the photograph panel text below.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the western end of the walk you can pick up the waymarked Nene Way where the River Nene enters The Wash. It can then be followed south into Wisbech. To explore the Wash further you could head north into Lincolnshire and visit the Frampton Marsh Nature Reserve and the RSPB's Freiston Shore. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/fvnPPb-2VBg",
  "postcode": "PE12 9QJ",
  "district": "South Holland",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "East Bank, Lighthouse Farm, Sutton Bridge, South Holland, Lincolnshire, England, PE12 9QJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "coastal"
  ],
  "points_of_interest": [
    "historical site",
    "tribute",
    "statue"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "bird watching"
  ]
}