{
  "created_at": "2025-01-06T02:02:23.179283+00:00",
  "objectID": "7a5c41c4147dc159ce9aa56084802569",
  "ref": "wistmans-wood-walking-route",
  "title": "Wistman's Wood Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Wistmans_Wood%2C_Dartmoor_-_geograph.org.uk_-_647059.jpg",
  "nearby": [
    {
      "description": "Lych Way",
      "objectID": "7d94a58e41b4ddf1e031929ac5e84fe7",
      "ref": "lych-way-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Two Bridges Dartmoor Walk",
      "objectID": "0e9ca17c212bd97239421f81cd18b50d",
      "ref": "two-bridges-dartmoor-walk-walking-route"
    },
    {
      "description": "Bellever Forest",
      "objectID": "85077e1b59350bc84ced5819ee7acb87",
      "ref": "bellever-forest-walking-and-cycle-route"
    },
    {
      "description": "Great Staple Tor",
      "objectID": "c1f0f6a46572315d84ac4917828ff204",
      "ref": "great-staple-tor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7a5c41c4147dc159ce9aa56084802569.gpx",
  "_geoloc": {
    "lat": 50.5585772956,
    "lng": -3.9651746902
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Wistmans_Wood%2C_Dartmoor_-_geograph.org.uk_-_647059.jpg",
      "title": "Paul Ansell / Wistmans Wood, Dartmoor, via Wikimedia Commons",
      "caption": "No photo can really do justice to this extraordinary place. The stunted oaks, the lichen and moss create a timeless and unique atmosphere - you really have to be in there to appreciate it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Path_to_Wistmans_Wood_-_geograph.org.uk_-_992063.jpg",
      "title": "Guy Wareham / Path to Wistmans Wood, via Wikimedia Commons",
      "caption": "Gorse flanked path to Wistmans Wood. Fingerpost at Crockern, Longaford and Littaford Tors in distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Dartmoor_Forest%2C_Wistman%27s_Wood_-_geograph.org.uk_-_689790.jpg",
      "title": "Martin Bodman / Dartmoor Forest: Wistman’s Wood, via Wikimedia Commons",
      "caption": "Wood Moss-covered granite boulders and stunted oaks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Dartmoor_Forest%2C_Wistman%27s_Wood%2C_West_Dart_valley_-_geograph.org.uk_-_689787.jpg",
      "title": "Martin Bodman / Dartmoor Forest: Wistman’s Wood, West Dart valley, via Wikimedia Commons",
      "caption": "Dartmoor Forest: Wistman\u0092s Wood, West Dart valley. Above the trees the line of the Devonport Leat, cut in the 1790s, can be seen across the valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Dartmoor_Forest%2C_edge_of_Wistman%27s_Wood_-_geograph.org.uk_-_689784.jpg",
      "title": "Martin Bodman / Dartmoor Forest: edge of Wistman’s Wood, via Wikimedia Commons",
      "caption": "Dartmoor Forest, edge of Wistman's Wood. Looking across the West Dart valley with the line of the Devonport Leat up on Beardown Hill. The West Dart runs behind the oak trees. A red flag flies from a cairn on the horizon, warning of danger areas within military ranges"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Wistman%27s_Wood_Feb.jpg/512px-Wistman%27s_Wood_Feb.jpg",
      "title": "Nilfanion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "The stunted Pedunculate Oaks (Quercus robur) inside Wistman's Wood during mid February."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Wistman%27s_Wood_in_winter.jpg",
      "title": "alex jane from london, uk [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A remnant of ancient oak Quercus robur woodland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Wistman%27s_Wood_and_Littaford_Tor_-_geograph.org.uk_-_211399.jpg",
      "title": "Derek Harper / Wistman's Wood and Littaford Tor, via Wikimedia Commons",
      "caption": "Wistman's Wood and Littaford Tor. Looking across the West Dart from the northwestern corner of the square. The southern edge of the ancient oak wood crosses into this square; Littaford Tor is the small tor at top centre. (The larger Longaford Tor is out of square)."
    }
  ],
  "distance_km": 7.0,
  "description": "Enjoy a walk around this atmospheric forest and nature reserve in the Dartmoor National Park. It's an unusual place consisting of stunted oak trees with gnarled, tangled branches. There's also lots of spongy moss and over 100 types of lichen hanging from the branches. Other features include boulders covered with lichen and other trees such as rowan, holly, hawthorn, hazel and eared-willow. This circular walk starts at a car park near the Two Bridges Hotel, just to the south of the wood. You then pick up a footpath to the nature reserve before climbing Longaford Tor, where there are great views over Dartmoor. You return passing Littaford Tors and Crockern Tor. The wood is located just to the north of Princetown which is on the Dartmoor Way. The eery Lych Way ancient footpath also passes the northern tip of the woods. To extend your walking try our Two Bridges Dartmoor Walk. The long circular walk starts from the same location and visits the wood before heading east to visit the fascinating gunpowder mill remains and the lovely Bellever Forest .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Two Bridges Hotel is a nice place to go for a Devon Cream Tea after your walk. The luxury hotel is beautifully positioned right on the banks of the West Dart River. Outside there's a lovely outdoor area where you can relax with afternoon tea on warmer days. There's also a nice garden you can stroll around after your food. Inside there's a cozy bar with log fires, and an elegant lounge. You can find the hotel right next to the river and bridge at postcode PL20 6SW. Not far from bridges is the noteworthy Warren House Inn, one of the highest pubs in England. The 19th century inn is one of the most famous on Dartmoor, sitting in an isolated position some 1425ft (434m) above sea level. Originally built to serve the busy local tin mining community, the Inn was always a favourite haunt with miners from the neighbouring Tin Mines, including Golden Dagger, Vitifer and Birch Tor Mines. From the elevated position of the inn there are breathtaking views over the area. Indoors there's a cosy interior with oak beams and open fires. They do great food and are also dog friendly. The Warren House Inn lies at the very centre of Dartmoor between Moretonhampstead and Princetown on the B3212 with a postcode of PL20 6TA.  From Postbridge just follow the B3212 north east from the village and you will soon come to the inn."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles south west of the wood there's one of the hidden gems of the area at Foggintor Quarry. Here you'll find a tranquil lake surrounded by the atmospheric quarry ruins. There's also the option of continuing north west to visit King's Tor and Great Staple Tor where there are more great views to enjoy. For more walking ideas in the area see the Dartmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/AMN_MKlBvtI",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Trout Cottage, Two Bridges, Dartmoor Forest, West Devon, Devon, England, PL20 6SW, United Kingdom",
  "postcode": "PL20 6SW",
  "district": "West Devon",
  "state": "England"
}