{
  "created_at": "2025-01-06T00:10:20.684349+00:00",
  "objectID": "7b069969abbce7739d946a80523467b2",
  "ref": "market-drayton-walking-route",
  "title": "Market Drayton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Shropshire_Union_Canal_at_Market_Drayton_-_geograph.org.uk_-_256105.jpg",
  "nearby": [
    {
      "description": "Shropshire Union Canal",
      "objectID": "d286ea892666d94e0e1ac40b769ac8f3",
      "ref": "shropshire-union-canal-walking-route"
    },
    {
      "description": "Whitchurch Canal Walk",
      "objectID": "c2f44abb9cdfe60b3cf0004c5304ae9d",
      "ref": "whitchurch-canal-walk-walking-route"
    },
    {
      "description": "Brown Moss Nature Reserve",
      "objectID": "1cc9d283115e174a8a9bff7b06e5972a",
      "ref": "brown-moss-nature-reserve-walking-route"
    },
    {
      "description": "Hawkstone Park",
      "objectID": "2b528f1531ad7bd809db1f14f36d0770",
      "ref": "hawkstone-park-walking-route"
    },
    {
      "description": "Wrenbury",
      "objectID": "dd81bbe44f7a23e65a54efe7b01e7972",
      "ref": "wrenbury-walking-route"
    },
    {
      "description": "Hodnet",
      "objectID": "c947d754068c157ebbed651215cd1852",
      "ref": "hodnet-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7b069969abbce7739d946a80523467b2.gpx",
  "_geoloc": {
    "lat": 52.9108294924,
    "lng": -2.4756794319
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Shropshire_Union_Canal_at_Market_Drayton_-_geograph.org.uk_-_256105.jpg",
      "title": "Espresso Addict / Shropshire Union Canal at Market Drayton",
      "caption": "Shropshire Union Canal at Market Drayton. This modern estate on the outskirts of Market Drayton backs onto the Shropshire Union Canal. The bridge in the distance is the busy A53"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Shropshire_Union_Canal_at_Market_Drayton%2C_Shropshire_-_geograph.org.uk_-_1592523.jpg",
      "title": "Roger Kidd / Shropshire Union Canal at Market Drayton, Shropshire",
      "caption": "Lovely shot of the canal at Market Drayton. New housing in Waterside Drive is on the left, with Betton Mill, now converted into apartments and Betton Bridge (No 63) straight ahead. The whole stretch of canal on the non tow path side shown here has been developed recently, apart from the boatyard (formerly Ted's) beyond the bridge. Moorings on the left are private; visitors have space on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Shropshire_Union_Canal_near_Market_Drayton%2C_Shropshire_-_geograph.org.uk_-_1593093.jpg",
      "title": "Roger Kidd / Shropshire Union Canal near Market Drayton, Shropshire",
      "caption": "Approaching Victoria Wharf and Bridge (No 65). For many years Orwell's coal yard was here, where we could also buy logs and diesel fuel, but now it is called Orwell's Boatyard and was closed on the two occasions we passed this week."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Tyrley_Locks_-_geograph.org.uk_-_515029.jpg",
      "title": "Stephen McKay / Tyrley Locks",
      "caption": "Tyrley Locks. An ascending boat is entering no. 4 lock. The lower part of the lock flight runs through an avenue of trees, with on this occasion strong sunshine glinting through - but it would be a gloomy place on a dull day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/The_President_at_the_top_of_Tyrley_Locks_-_geograph.org.uk_-_187414.jpg",
      "title": "David Morris / The President at the top of Tyrley Locks",
      "caption": "The President at the top of Tyrley Locks. Having just come up through Tyrley locks, we were delighted to see the President waiting to go down. The President is a steam-powered ex-working narrowboat built in 1909."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Shropshire_Union_Canal_approaching_Tyrley_Locks%2C_Staffordshire_-_geograph.org.uk_-_1606246.jpg",
      "title": "Roger Kidd / Shropshire Union Canal approaching Tyrley Locks, Staffordshire",
      "caption": "Shropshire Union Canal approaching Tyrley Locks, Staffordshire. A tree lined and shady stretch of canal leads into the cutting containing the lower locks of the Tyrley flight. The canal was fully opened by 1835, engineered by Thomas Telford, his final canal project."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Shropshire_Union_Canal_near_Cheswardine%2C_Shropshire_-_geograph.org.uk_-_1589024.jpg",
      "title": "Roger Kidd / Shropshire Union Canal near Cheswardine, Shropshire",
      "caption": "Shropshire Union Canal near Cheswardine, Shropshire Under Westcottmill Bridge on the Shropshire Union Canal. The bridge is purely for farmers' access and a public footpath from the double bend on Westcott Lane on the left to Cheswardine on the right (1200 metres) where the Red Lion pub with its own brewery can be found. N.B. The footpath no longer goes through Westcott Mill Farm, but instead follows the concrete road adjacent to the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Church_of_St_Swithun%2C_Cheswardine_-_geograph.org.uk_-_23144.jpg",
      "title": "Tony Grant / Church of St Swithun, Cheswardine",
      "caption": "Church of St Swithun, Cheswardine. This is the Church of England Church in Cheswardine village. It is made of red sandstone, which is locally quarried. This is the third church built on the site, and was last rebuilt in 1886 to 1889 through the benevolence of Charles Donaldson-Hudson, the patron of the church and resident of Cheswardine Hall. The tower was not rebuilt, but St Katherine's chapel was moved further north and east."
    }
  ],
  "distance_km": 18.5,
  "description": "This pleasant market town in north Shropshire has some nice waterside trails along the River Tern and the Shropshire Union Canal. The town is also well known for its gingerbread and has some fine architecture with half timbered and red brick buildings to admire. This walk from the town takes you along a section of the Shropshire Union Canal to the neighbouring village of Cheswardine. The walk starts just to the east of the town centre where you can pick up the canal towpath. Follow it south and it will take you past the pretty Tyrley Locks and Cheswardine Bridge. You then leave the canal to follow a footpath north east through the countryside to visit Cheswardine. It's a pretty village with some nice pubs and interesting old buildings. It has also been runner up in Britain in Bloom several times. The route then returns to the canal to follow it back to Market Drayton. The walk can be extended by continuing along the canal to Little Soudley and Knighton.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The canalside Wharf Tavern is a fine place for some post walk refreshments. The outdoor seating area is a lovely place to relax and watch the narrowboats pass by. They have a good selection of cask ales and also offer traditional home cooked meals. You can find the pub right next to the canal at postcode TF9 2LP for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could follow the canal north to visit Adderley, Coxbank and Audlem where there's an impressive 15 lock flight and a fine canalside pub. North west of the town you can visit the town of Whitchurch and try the Whitchurch Canal Walk which takes you along the Llangollen Branch of the Shropshire Union Canal. Near here there's also the pretty Brown Moss Nature Reserve where there are some nice trails and lots of wildlife to look out for. Hawkstone Park is also located nearby. Here you will find 100 acres of intricate pathways, ravines, arches, bridges, towering cliffs and follies. To the east of here is the worthy village of Hodnet where you could pay a visit to the delightful Hodnet Hall Gardens. There's 60 acres to explore with lakes, bluebell woodland, a Water Garden and a Kitchen Garden the highlights. The historic village also includes a noteworthy Norman church and a fine pub dating to the 16th century. To the north there's Comber Mere. The 12th century abbey includes a large lake and bluebell woodland which is open to the public on certain open days. Near here you'll also find the worthy village of Wrenbury. The settlement is a conservation area with a number of historic properties including an early 16th century church overlooking the pretty village green. There's also a fine canalside pub with a lovely garden to visit. For more walking ideas in the area see the Shropshire Walks page."
    }
  ],
  "district": "Market Drayton",
  "county": "Shropshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Windsor Drive, Market Drayton, Shropshire, England, TF9 1RL, United Kingdom",
  "postcode": "TF9 1RL",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "rural"
  ],
  "points_of_interest": [
    "historic buildings",
    "village"
  ],
  "facilities": [
    "pub",
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}