{
  "objectID": "7b069969abbce7739d946a80523467b2",
  "created_at": "2024-12-19T20:54:17.984576+00:00",
  "ref": "market-drayton-walking-route",
  "title": "Market Drayton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Shropshire_Union_Canal_at_Market_Drayton_-_geograph.org.uk_-_256105.jpg",
  "nearby": [
    {
      "description": "Shropshire Union Canal",
      "objectID": "d286ea892666d94e0e1ac40b769ac8f3",
      "ref": "shropshire-union-canal-walking-route"
    },
    {
      "description": "Whitchurch Canal Walk",
      "objectID": "c2f44abb9cdfe60b3cf0004c5304ae9d",
      "ref": "whitchurch-canal-walk-walking-route"
    },
    {
      "description": "Brown Moss Nature Reserve",
      "objectID": "1cc9d283115e174a8a9bff7b06e5972a",
      "ref": "brown-moss-nature-reserve-walking-route"
    },
    {
      "description": "Hawkstone Park",
      "objectID": "2b528f1531ad7bd809db1f14f36d0770",
      "ref": "hawkstone-park-walking-route"
    },
    {
      "description": "Wrenbury",
      "objectID": "dd81bbe44f7a23e65a54efe7b01e7972",
      "ref": "wrenbury-walking-route"
    },
    {
      "description": "Hodnet",
      "objectID": "c947d754068c157ebbed651215cd1852",
      "ref": "hodnet-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/A63CA2209DC209BE8625859A00509009/$FILE/Market Drayton.gpx",
  "_geoloc": {
    "lat": 52.9108294924,
    "lng": -2.4756794319
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Shropshire_Union_Canal_at_Market_Drayton_-_geograph.org.uk_-_256105.jpg",
      "title": "Espresso Addict / Shropshire Union Canal at Market Drayton",
      "caption": "Shropshire Union Canal at Market Drayton. This modern estate on the outskirts of Market Drayton backs onto the Shropshire Union Canal. The bridge in the distance is the busy A53"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Shropshire_Union_Canal_at_Market_Drayton%2C_Shropshire_-_geograph.org.uk_-_1592523.jpg",
      "title": "Roger  Kidd / Shropshire Union Canal at Market Drayton, Shropshire",
      "caption": "Lovely shot of the canal at Market Drayton.  New housing in Waterside Drive is on the left, with Betton Mill, now converted into apartments and Betton Bridge (No 63) straight ahead. The whole stretch of canal on the non tow path side shown here has been developed recently, apart from the boatyard (formerly Ted's) beyond the bridge. Moorings on the left are private; visitors have space on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Shropshire_Union_Canal_near_Market_Drayton%2C_Shropshire_-_geograph.org.uk_-_1593093.jpg",
      "title": "Roger  Kidd / Shropshire Union Canal near Market Drayton, Shropshire",
      "caption": "Approaching Victoria Wharf and Bridge (No 65). For many years Orwell's coal yard was here, where we could also buy logs and diesel fuel, but now it is called Orwell's Boatyard and was closed on the two occasions we passed this week."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Tyrley_Locks_-_geograph.org.uk_-_515029.jpg",
      "title": "Stephen McKay / Tyrley Locks",
      "caption": "Tyrley Locks. An ascending boat is entering no. 4 lock. The lower part of the lock flight runs through an avenue of trees, with on this occasion strong sunshine glinting through - but it would be a gloomy place on a dull day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/The_President_at_the_top_of_Tyrley_Locks_-_geograph.org.uk_-_187414.jpg",
      "title": "David Morris / The President at the top of Tyrley Locks",
      "caption": "The President at the top of Tyrley Locks. Having just come up through Tyrley locks, we were delighted to see the President waiting to go down. The President is a steam-powered ex-working narrowboat built in 1909."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Shropshire_Union_Canal_approaching_Tyrley_Locks%2C_Staffordshire_-_geograph.org.uk_-_1606246.jpg",
      "title": "Roger  Kidd / Shropshire Union Canal approaching Tyrley Locks, Staffordshire",
      "caption": "Shropshire Union Canal approaching Tyrley Locks, Staffordshire. A tree lined and shady stretch of canal leads into the cutting containing the lower locks of the Tyrley flight. The canal was fully opened by 1835, engineered by Thomas Telford, his final canal project."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Shropshire_Union_Canal_near_Cheswardine%2C_Shropshire_-_geograph.org.uk_-_1589024.jpg",
      "title": "Roger  Kidd / Shropshire Union Canal near Cheswardine, Shropshire",
      "caption": "Shropshire Union Canal near Cheswardine, Shropshire Under Westcottmill Bridge on the Shropshire Union Canal. The bridge is purely for farmers' access and a public footpath from the double bend on Westcott Lane on the left to Cheswardine on the right (1200 metres) where the Red Lion pub with its own brewery can be found. N.B. The footpath no longer goes through Westcott Mill Farm, but instead follows the concrete road adjacent to the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Church_of_St_Swithun%2C_Cheswardine_-_geograph.org.uk_-_23144.jpg",
      "title": "Tony Grant / Church of St Swithun, Cheswardine",
      "caption": "Church of St Swithun, Cheswardine. This is the Church of England Church in Cheswardine village. It is made of red sandstone, which is locally quarried. This is the third church built on the site, and was last rebuilt in 1886 to 1889 through the benevolence of Charles Donaldson-Hudson, the patron of the church and resident of Cheswardine Hall. The tower was not rebuilt, but St Katherine's chapel was moved further north and east."
    }
  ],
  "distance_km": 18.5,
  "description": "This pleasant market town in north Shropshire has some nice waterside trails along the River Tern and the Shropshire Union Canal. The town is also well known for its gingerbread and has some fine architecture with half timbered and red brick buildings to admire. This walk from the town takes you along a section of the Shropshire Union Canal to the neighbouring village of Cheswardine. The walk starts just to the east of the town centre where you can pick up the canal towpath. Follow it south and it will take you past the pretty Tyrley Locks and Cheswardine Bridge. You then leave the canal to follow a footpath north east through the countryside to visit Cheswardine. It's a pretty village with some nice pubs and interesting old buildings. It has also been runner up in Britain in Bloom several times. The route then returns to the canal to follow it back to Market Drayton. The walk can be extended by continuing along the canal to Little Soudley and Knighton.",
  "district": "Market Drayton",
  "county": "Shropshire",
  "region": "West Midlands",
  "country": "England"
}