{
  "created_at": "2025-01-06T04:16:19.892397+00:00",
  "objectID": "7b491815b9290d73a8137e8a38d25ec5",
  "ref": "irwell-sculpture-trail-walking-route",
  "title": "Irwell Sculpture Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/ca/On_the_Irwell_Sculpture_Trail_%28geograph_685424%29.jpg",
  "nearby": [
    {
      "description": "Clifton Country Park",
      "objectID": "47aa17e2e6f7621a98067299fc90805f",
      "ref": "clifton-country-park-walking-and-cycle-route"
    },
    {
      "description": "Burrs Country Park",
      "objectID": "6d4718dfe9b5900149c70f84c90eb03e",
      "ref": "burrs-country-park-walking-route"
    },
    {
      "description": "Elton Reservoir",
      "objectID": "b38e7304c30c7b48933cfe0b0d6a68c2",
      "ref": "elton-reservoir-walking-route"
    },
    {
      "description": "Peel Tower",
      "objectID": "cc1ad1dce04225c45f904ca3ca1cb8d8",
      "ref": "peel-tower-walking-route"
    },
    {
      "description": "Summerseat",
      "objectID": "9fecf42c6853e4fd34e6f45ab32b2dd0",
      "ref": "summerseat-walking-route"
    },
    {
      "description": "Rawtenstall",
      "objectID": "8f3261170881905f7bbcf823178d5a59",
      "ref": "rawtenstall-walking-route"
    },
    {
      "description": "Bacup",
      "objectID": "b791697bc1ae0f3210d52785118cf83c",
      "ref": "bacup-walking-route"
    },
    {
      "description": "Medlock Valley Way",
      "objectID": "117beb206e1a5c1969c12e03fc4ab417",
      "ref": "medlock-valley-way-walking-and-cycle-route"
    },
    {
      "description": "Radcliffe Canal Walk",
      "objectID": "d97af80872a82e4c48cecb435504e5ff",
      "ref": "radcliffe-canal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7b491815b9290d73a8137e8a38d25ec5.gpx",
  "_geoloc": {
    "lat": 53.4683075134,
    "lng": -2.2933825477
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/On_the_Irwell_Sculpture_Trail_%28geograph_685424%29.jpg",
      "title": "Wesley Trevor Johnston / On the Irwell Sculpture Trail, via Wikimedia Commons",
      "caption": "Delightful riverside sculpture near Summerseat"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Irwell_Sculpture_Trail_Stubbins_-_geograph.org.uk_-_378964.jpg",
      "title": "Paul Anderson / Irwell Sculpture Trail Stubbins, via Wikimedia Commons",
      "caption": "These old stone sets run for about a half mile section between Ramsbottom and Stubbins and are part of The Irwell Sculpture Trail that follows a well established 30 mile footpath stretching from Salford Quays through Bury into Rossendale and up to the Pennines above Bacup. The field to the left is a flood plain which is used when the River Irwell bursts its banks like it did in January 2007"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Eye-glass_sculpture_on_Irwell_Sculpture_Trail_in_Bury%2C_Lancashire.jpg/256px-Eye-glass_sculpture_on_Irwell_Sculpture_Trail_in_Bury%2C_Lancashire.jpg",
      "title": "Edward Smith / Eye-Glass Sculpture on the Irwell Valley Trail, via Wikimedia Commons",
      "caption": "Eye-glass sculpture on Irwell Sculpture Trail in Bury, Lancashire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Sculpture_-_Irwell_Sculpture_Trail_near_Lumb_-_geograph.org.uk_-_348491.jpg",
      "title": "liz dawson / Sculpture - Irwell Sculpture Trail near Lumb, via Wikimedia Commons",
      "caption": "Sculpture near Lumb"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Sculpture_-_geograph.org.uk_-_144827.jpg",
      "title": "Dennis Turner / Sculpture, via Wikimedia Commons",
      "caption": "Stone Cycle sculpture by Julie Edwards at Burrs Country Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/In_the_Picture%2C_Edenfield_%28geograph_481701%29.jpg",
      "title": "Paul Rudge / In the Picture, via Wikimedia Commons",
      "caption": "\"Frame\" sculpture 'In the Picture' near Strongstry. Nice view of the countryside through this eye catching piece"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/James_and_the_ball_of_fire_%28geograph_1687066%29.jpg/512px-James_and_the_ball_of_fire_%28geograph_1687066%29.jpg",
      "title": "David Dixon [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "James and the ball of fire. A striking piece near Radcliffe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Burrs_Mill_Chimney%2C_Bury_%28geograph_388064%29.jpg",
      "title": "Paul Anderson [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Burrs Mill Chimney, Bury"
    }
  ],
  "distance_km": 48.0,
  "description": "Follow the River Irwell on this splendid waterside walk through Greater Manchester and enjoy over 70 artworks by renowned artists. The walk starts at Salford Quays and follows the trail north through Radcliffe, Bury and Ramsbottom towards Bacup. The walk visits some lovely riverside country parks including Clifton Country Park and Burrs Country Park. You also pass Outwood Country Park where you can pick up the Outwood Trail. Another route highlight is a nice stretch along the Bury Canal where you'll pass the pretty Elton Reservoir. Near Rawtenstall and Ramsbottom you will pass close to the Peel Tower. The monument is dedicated to Sir Robert Peel, the 19th century Prime Minister considered the father of modern British policing. It's a major local landmark and worth the climb to the top for the views over the area. The trail also visits a series of art galleries and museums including the Lowry and the East Lancashire Railway.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Eagle and Child in Ramsbottom is a pub worthy of some investigation. It was named Great British Pub Awards ‘Pub of the Year’ in September 2017 and has a whole host of other awards to its name. It's a pub with a social conscience targeting young people who are marginalised and need extra help such as young offenders and disabled young people. They're rated as one of the best food pubs in Greater Manchester, having consistently featured in all the main national newspapers ‘Top 50 Sunday Lunch’ features. One of the main attractions is a stunning Orangery dining room, with fine views across the Irwell valley to Holcombe. The expansive garden area includes an outdoor kitchen and bar, polytunnel, veg beds, compost beds, fruit shrubs and ornamental beds and a mini orchard with chickens. It's a lovely setting and the ideal place to round off your walk. You can find the pub in the town on Whalley Rd with a postcode of BL0 0DL for your sat navs. At Summerseat there's The Hamers Arms for consideration. The traditional, stone-built pub includes an open fire and a nice garden area outside. They also do a fine Sunday carvery. You can find them at postcode BL0 9UG for your sat navs. The picturesque village also includes historic old mills, a heritage railway station on the East Lancs Railway and an impressive viaduct over the river. In Lancashire based Rawtenstall there's The Buffer Stops pub at Rawtenstall train station on the East Lancs Railway. It's a nice place to enjoy a drink and watch the old steam trains go by. They have a great selection of ales with the pub a key stop on the Rail Ale Trail. On the experience you can hop on and hop off all along the East Lancashire Railway line, stopping at some of the oldest and most popular pubs in the Irwell Valley. You can find the bar on the platform at postcode BB4 6EH. While in the town you could also visit the excellent Whitaker Museum and Art Gallery. There's some fine exhibitions, documentary films, a fascinating art collection, a cafe and picturesque gardens to stroll around in afterwards. Entry is free and the museum can be found on Haslingden Road at postcode BB4 6RE."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Salford Trail runs along part of the route. You could pick up this waymarked footpath to further explore the highlights of the city. Just south of Ramsbottom you could take a small detour from the route to visit the lovely Redisher Wood. In the woods there are peaceful woodland trails and water features including the Holcombe Brook, a picturesque lake and photogenic waterfalls. In Manchester city centre the Irwell meets with the River Medlock. Here you can pick up the Medlock Valley Way and enjoy another riverside walk towards Oldham. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jTCKI95EfmE",
  "postcode": "M17 1HE",
  "district": "Trafford Park",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}