{
  "created_at": "2025-01-06T02:27:19.178142+00:00",
  "objectID": "7b73e095a9e82ad1e47bcabf38c25232",
  "ref": "staffordshire-and-worcestershire-canal-walking-and-cycle-route",
  "title": "Staffordshire and Worcestershire Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/35/Staffordshire_and_Worcestershire_Canal_at_Hinksford%2C_Staffordshire_-_geograph.org.uk_-_1023796.jpg",
  "nearby": [
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Shugborough Park",
      "objectID": "00838de229b5951c5883b2c03ba186d1",
      "ref": "shugborough-park-walking-route"
    },
    {
      "description": "Kingsford Country Park",
      "objectID": "7f3770e2d54910c0e6bb092912af1b15",
      "ref": "kingsford-country-park-walking-route"
    },
    {
      "description": "Kinver Edge",
      "objectID": "46a1e3028f153ba776c5aef2f3e05ce2",
      "ref": "kinver-edge-walking-route"
    },
    {
      "description": "Wolverhampton Canal Walk",
      "objectID": "53c744dbeac3d1f9c3d9776a16d46b1f",
      "ref": "wolverhampton-canal-walk-walking-route"
    },
    {
      "description": "Kidderminster",
      "objectID": "b09bce69a44612919e0eb8cfe0f0762d",
      "ref": "kidderminster-walking-route"
    },
    {
      "description": "Penkridge",
      "objectID": "d3f33c26e1e7f96fcb42dff9dfd59070",
      "ref": "penkridge-walking-route"
    },
    {
      "description": "Wightwick Manor",
      "objectID": "2d4259f6f205afa029da4241259e3efa",
      "ref": "wightwick-manor-walking-route"
    },
    {
      "description": "Smestow Valley",
      "objectID": "82402b73d231a28f12740f6e5570f48e",
      "ref": "smestow-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7b73e095a9e82ad1e47bcabf38c25232.gpx",
  "_geoloc": {
    "lat": 52.3373689517,
    "lng": -2.2784823709
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Staffordshire_and_Worcestershire_Canal_at_Hinksford%2C_Staffordshire_-_geograph.org.uk_-_1023796.jpg",
      "title": "Roger Kidd / Staffordshire and Worcestershire Canal at Hinksford, Staffordshire",
      "caption": "Hinksford, Staffordshire. This attractive \"semi-trad\" narrowboat is moored opposite the Hinksford pumping station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Staffordshire_and_Worcestershire_Canal_approaching_Gailey_Lock_-_geograph.org.uk_-_1558352.jpg",
      "title": "Roger Kidd / Staffordshire and Worcestershire Canal approaching Gailey Lock",
      "caption": "Approaching Gailey Lock On the Staffordshire and Worcestershire Canal (opened fully in 1772) there are forty-three locks (forty-five if you don't fancy the deep wide locks at Stourport). Here at Gailey (called \"top lock\" presumably as a reference to a sequence of four well spaced locks down to Rodbaston just under a mile away) the lock drops the water level by 8ft 6in (2.6 metres). An unusual round castellated tower was formerly a toll keeper's office. The (formerly) very busy A5 road crosses the bridge by the lock buildings ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Staffordshire_and_Worcestershire_Canal_north_of_Kidderminster_-_geograph.org.uk_-_1024548.jpg",
      "title": "Roger Kidd / Staffordshire and Worcestershire Canal north of Kidderminster",
      "caption": "Canal view north of Kidderminster and just below Wolverley Court lock and bridge. The embankment hides the scene across the River Stour flood plain. This Kidderminster Flood Alleviation bank was created in 2003-4 as part of an extensive scheme to protect the town, and also allow more land to be viable for new housing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Staffordshire_and_Worcestershire_Canal%2C_Kinver_-_geograph.org.uk_-_906846.jpg",
      "title": "Stephen McKay / Staffordshire & Worcestershire Canal, Kinver",
      "caption": "View at Kinver. Below Kinver Lock the canal passes through a hilly area, the hills closing in on the east bank. Kinver's visitor moorings are located here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Staffordshire_and_Worcestershire_Canal_north_of_Coven_Heath%2C_Staffordshire_-_geograph.org.uk_-_1361128.jpg",
      "title": "Roger Kidd / Staffordshire and Worcestershire Canal north of Coven Heath, Staffordshire",
      "caption": "Canal north of Coven Heath, Staffordshire. The Staffordshire and Worcestershire Canal was opened in 1772, and engineered by James Brindley. It cost a little over £100,000 at the time for its 46 mile course from Stourport to Great Haywood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Staffordshire_and_Worcestershire_Canal_at_Penkridge_-_geograph.org.uk_-_966838.jpg",
      "title": "Roger Kidd / Staffordshire and Worcestershire Canal at Penkridge",
      "caption": "Canal view at the historic market town of Penkridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Gailey_Lock_and_Toll_Office%2C_Staffordshire_-_geograph.org.uk_-_2597581.jpg",
      "title": "Gailey Lock and Toll Office, Staffordshire by Roger Kidd, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gailey Lock and Toll Office,. Gailey Reservoir, the home of South Staffordshire Sailing Club, is located just to the south of Penkridge. It's a short walk east from the pretty Gailey Wharf to the reservoirs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Staffordshire_and_Worcestershire_Canal_at_Greensforge_-_geograph.org.uk_-_682037.jpg",
      "title": "Roger Kidd / Staffordshire and Worcestershire Canal at Greensforge",
      "caption": "Greensforge lock."
    }
  ],
  "distance_km": 74.0,
  "description": "Follow the Staffordshire and Worcestershire Canal from Stourport-on-Severn to Great Haywood on this easy waterside walking and cycling route. The walk starts at Stourport-on-Severn by the Staffordshire and Worcestershire Canal Basin near to the River Severn. You then head north to Kidderminster with views of the River Stour as you go. You continue to Kinver where you could deviate from the path to visit the splendid Kingsford Country Park and Kinver Edge. The large area of woodland and heathland has miles of walking trails with wonderful views across the region. The next section takes you through Wolverhampton, passing the National Trust owned Wightwick Manor Gardens and the wildlife rich Smestow Valley Nature Reserve. You continue to Stafford before the final stretch to Great Haywood Junction, passing the beautiful Shugborough Park on the way. The 900 acre estate is well worth visiting with its expansive parkland and stunning gardens. At Great Haywood the canal links with the Trent and Mersey Canal. You could extend your walk into the Trent Valley and the Cannock Chase AONB. The whole of the route is open for walkers while cyclists can enjoy a super section from Stourport to Kidderminster along National Cycle Network Route 54. It's an excellent choice for a safe, waterside cycle.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Kidderminster make a pit stop at The Weavers. The canalside pub has a lovely garden area to sit out in on warmer days. It's a great spot to relax and watch the boats go by. The pub is set in a listed Georgian building dating from 1804 and also includes a cosy interior full of character. They do lovely home-cooked pub meals and have a fine selection of ciders and ales. You can find the pub at 40 Park Lane with a postcode of DY11 6TG for your sat navs. In Penkridge there's The Cross Keys to consider. It's another canalside pub where you can sit outside and enjoy a drink while watching the boats, ducks and swans go by. You can find them at Filance Lane with a postcode of ST19 5HJ for your sat navs. The historic market town is also worth exploring with a Grade I listed medieval church, the Penkridge Railway Viaduct and the Old Market Square to see."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Stafford you could take a small detour from the route to visit the historic Stafford Castle. The ancient castle commands fine views over the area from its elevated position. In Wolverhampton you will pass very close to the National Trust's Wightwick Manor. The Victorian manor house includes some fine paintings and is surrounded by some beautiful gardens. It is well worth a small detour from the towpath. Postcode for sat navs is WV6 8EE. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/JEmtFGx-7Rc",
  "postcode": "DY13 9ER",
  "district": "Wyre Forest",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mart Lane, Waters Edge, Stourport-on-Severn, Wilden, Wyre Forest, Worcestershire, England, DY13 9ER, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "heathland",
    "waterside"
  ],
  "points_of_interest": [
    "country park",
    "nature reserve",
    "parkland",
    "gardens"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}