{
    "created_at": "2025-01-05T23:43:11.410873+00:00",
    "objectID": "7bb52ab81d3ee4aa1fc3bdb4c5668704",
    "ref": "paxton-pits-walking-route",
    "title": "Paxton Pits Walking Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/Great_River_Ouse_near_Paxton_Pits_-_geograph.org.uk_-_222066.jpg",
    "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7bb52ab81d3ee4aa1fc3bdb4c5668704.gpx",
    "_geoloc": {
        "lat": 52.2517512832,
        "lng": -0.2482620367
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Great_River_Ouse_near_Paxton_Pits_-_geograph.org.uk_-_222066.jpg",
            "title": "Paul Glazzard / Great River Ouse near Paxton Pits, via Wikimedia Commons",
            "caption": "Great River Ouse near Paxton Pits. The 'Mio Amore' heading north along the Great River Ouse past the Paxton Pits Nature Reserve near St. Neots, Cambridgeshire."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Paxton_Pits_Nature_Reserve._-_geograph.org.uk_-_22743.jpg",
            "title": "Jack Hill [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
            "caption": "Information Board at the reserve."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Paxton_Pits_Nature_Reserve_-_geograph.org.uk_-_1547986.jpg",
            "title": "Mick Lobb / Paxton Pits Nature Reserve, via Wikimedia Commons",
            "caption": "Lake view"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Paxton_Pits_Nature_Reserve_-_geograph.org.uk_-_1206569.jpg",
            "title": "Stephen McKay / Paxton Pits Nature Reserve, via Wikimedia Commons",
            "caption": "Gravel pits by the River Great Ouse were dug out here between the 1940s and 1960s; the area was designated a nature reserve in the 1980s and is now an important visitor attraction as well as a haven for aquatic wildlife. The lake in this photo is called Heronry South Lake; no herons were in evidence on this occasion, but a swan can be seen in the shadow of the trees."
        }
    ],
    "distance_km": 5.0,
    "description": "Visit this delightful nature reserve in Little Paxton and enjoy a series of well laid out, waterside walking trails. The paths run around a series of pretty ponds and lakes with a riverside stretch along the River Great Ouse to enjoy too. There's nearly 200 acres to explore with habitats including meadow, reedbed, scrub and woodland. It's great for wildlife with a heronry plus nightingales and cormorants to look out for. There's two, short waymarked trails to follow around the site. The Heron Trail runs for about 2 miles with a surfaced path for the first mile. The circular trail visits two bird hides where you can watch the Cormorants and Herons roosting on the islands. The 1.5 mile Meadow Trail visits the southern part of the reserve. You'll pass lakes and meadows with a variety of wildflowers such as Wild Roses and Hawthorn blossom. The Ouse Valley Way runs through the reserve so you can pick this up to extend yor walk. If you head south along the river you will soon come to St Neots. Head north and you will come to Godmanchester and Huntingdon .",
    "details": [
        {
            "subtitle": "Pubs/Cafes",
            "content": "You can pick up snacks in the visitors centre but if you'd like something more substantial head to The Anchor in Little Paxton. The friendly pub has a cosy log fire for colder days and for the summer months there is a lovely outdoor dining area as well as an outside patio and play area. You can find the pub on the High Street in the village just to the west of the reserve. The postcode is PE19 6HA. Another nice idea is to follow the waymarked riverside path south into St Neots to visit the splendid River Mill pub. The riverside pub has dining area opening out on to the lower mill pond viewing deck. Outside there are lots of picnic tables alongside the upper mill pond and the marina. It's a lovely place to relax on a summer day. You can find it about 1 mile south of the reserve at postcode PE19 8GW."
        },
        {
            "subtitle": "Dog Walking",
            "content": "The Pits are a nice place for a dog walk but please keep them under close control. Both the Anchor pub and River Mill mentioned above welcomes dogs."
        },
        {
            "subtitle": "Further Information and Other Local Ideas",
            "content": "The reserve is located close to Grafham Water which is a real highlight of the area. The large lake has nice waterside walking trails and is located only about 1.5 miles north west of Paxton Pits. Head west and you'll soon come to the interesting town of Kimbolton where you can visit the historic Kimbolton Castle. The castle is notable as the final home of King Henry VIII's first wife, Catherine of Aragon. For more walking ideas in the area see the Cambridgeshire Walks page."
        }
    ],
    "video_url": "https://www.youtube.com/embed/-96jKz-50BY",
    "county": "Cambridgeshire",
    "region": "Cambridgeshire and Peterborough",
    "country": "United Kingdom",
    "gazetteer_found": true,
    "nominatim_found": true,
    "display_address": "Meadow Trail, Little Paxton, Great Paxton, Huntingdonshire, Cambridgeshire, Cambridgeshire and Peterborough, England, PE19 6ET, United Kingdom",
    "postcode": "PE19 6ET",
    "district": "Huntingdonshire",
    "state": "England",
    "llama_cpp": true,
    "estimated_duration": "2-3 hours",
    "difficulty": "easy",
    "terrain": ["woodland", "meadow", "river"],
    "points_of_interest": ["bird hide", "wildflower areas"],
    "facilities": ["visitor center", "car park", "dog friendly"],
    "route_type": "circular",
    "activities": ["walking"]
}
