{
  "created_at": "2025-01-06T03:16:55.422787+00:00",
  "objectID": "7bf8f8d4757789d9a1faa8aaa8c5d372",
  "ref": "glastonbury-canal-walking-route",
  "title": "Glastonbury Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d8/The_Glastonbury_Canal_-_geograph.org.uk_-_676952.jpg",
  "nearby": [
    {
      "description": "Shapwick Heath",
      "objectID": "00dcec466fb12d8eede01f0856ed383a",
      "ref": "shapwick-heath-walking-route"
    },
    {
      "description": "Ham Wall",
      "objectID": "ea729ec162dbf58bb3b59487d3899c73",
      "ref": "ham-wall-walking-route"
    },
    {
      "description": "Glastonbury Tor",
      "objectID": "806f45c20865df8f31e23f192bf3aa76",
      "ref": "glastonbury-tor-walking-route"
    },
    {
      "description": "Westhay Moor",
      "objectID": "d1ec40f32a98940fbfdf9884f1b86daf",
      "ref": "westhay-moor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7bf8f8d4757789d9a1faa8aaa8c5d372.gpx",
  "_geoloc": {
    "lat": 51.1493575005,
    "lng": -2.7276579786
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/The_Glastonbury_Canal_-_geograph.org.uk_-_676952.jpg",
      "title": "Sharon Loxton / The Glastonbury Canal",
      "caption": "The Glastonbury Canal opened in 1833. It helped drain the surrounding area and for a while helped revive Glastonbury's economy allowing goods to be brought into the town from the coast. However, the fact that peat swells was a problem because the banks of the canal swelled and closed in, much reducing its size."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/The_Glastonbury_Canal_and_Meare_Heath_%28geograph_2671996%29.jpg",
      "title": "Ken Grainger / The Glastonbury Canal and Meare Heath",
      "caption": "The canal and Meare Heath. After only 21 years the canal was replaced by the Highbridge - Glastonbury railway. The rail journey only took 35 minutes. The railway ran beside the canal and was raised. This photograph is taken from beside the old railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/The_Glastonbury_Canal_and_cycle_track%2C_Shapwick_Heath_%28geograph_2672000%29.jpg",
      "title": "Ken Grainger / The Glastonbury Canal and cycle track, Shapwick Heath",
      "caption": "View of the cycle track along the canal at Shapwick Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Pool_west_of_Dyehouse_Lane%2C_Glastonbury_-_geograph.org.uk_-_217319.jpg",
      "title": "Jim Champion / Pool west of Dyehouse Lane, Glastonbury",
      "caption": "Pool west of Dyehouse Lane, Glastonbury. Dyehouse Lane runs from Beckery to Northload Bridge with the usual drainage ditches either side. Mid-way along the road, to its western side, is this rectangular pool surrounded by willows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/The_South_Drain_-_geograph.org.uk_-_676959.jpg",
      "title": "Sharon Loxton / The South Drain",
      "caption": "The South Drain Taken from the old railway bridge, this shows the South Drain as it flows northwards to meet the Canal. Both then head west-north-west across the Somerset Levels towards the Bristol Channel. On the left is part of Walton Heath. More specifically, the area seen in the photograph is a former peat excavation area which was known as 'Signal Pole' and was worked by Fisons PLC. A lot of the fields or 'grounds' where peat excavation took place were given names. It is now flooded and forms part of the Ham Wall Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Ham_Wall_Reserve_-_geograph.org.uk_-_677505.jpg",
      "title": "Sharon Loxton / Ham Wall Reserve",
      "caption": "Ham Wall Reserve. This photograph was taken from the disused railway line looking across the canal to the worked out peat digging areas. All the peat in this area was extracted by Fisons PLC. It is now an RSPB reserve."
    }
  ],
  "distance_km": 8.0,
  "description": "Follow the Glastonbury Canal through the Somerset Levels on this waterside walk through the Avalon Marshes. You'll pass through a series of lovely nature reserves with lots of wildlife and beautiful scenery to look out for. The walk starts at the Canal wharf in Glastonbury and heads west towards Glastonbury Heath and the Ham Wall Nature Reserve. The reserve has lovely waterside paths and wildlife such as otters, dragonflies, butterflies, marsh harriers, water voles, bitterns and roe deer. The canal continues through Shapwick Heath Nature Reserve with its reedbeds, wildflower meadows, fens and woods to explore. For more details on the walks and wildlife in the area see the Avalon Marshes page.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the start of the walk there's the climb to the famous Glastonbury Tor to try. Just to the south west you'll find the neighbouring village of Street. Here you can enjoy a climb along the Polden Way to the National Trust's Walton Hill in the Polden Hills. Just to the south of Street you'll also find the neighbouring village of Compton Dundon where you can try the Compton Dundon and Combe Hill Wood Walk. The circular walk includes a climb to Iron Age Hillfort on Dundon Beacon and a visit to the Hood Monument, which is something of a historic local landmark. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jOIs3DX2sFw",
  "district": "Glastonbury",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dyehouse Lane, Beckery, Glastonbury, Somerset, England, BA6 9QS, United Kingdom",
  "postcode": "BA6 9QS",
  "state": "England"
}