{
  "created_at": "2025-01-06T11:16:49.639073+00:00",
  "objectID": "7c182c67561de8a03c542a5c8b840812",
  "ref": "bury-st-edmunds-walking-route",
  "title": "Bury St Edmunds Walks - Abbey, Parks and River Walk",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/56/Cornhill%2C_Bury_St_Edmunds_-_geograph.org.uk_-_741766.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7c182c67561de8a03c542a5c8b840812.gpx",
  "_geoloc": {
    "lat": 52.2449755766,
    "lng": 0.7162784678
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Cornhill%2C_Bury_St_Edmunds_-_geograph.org.uk_-_741766.jpg",
      "title": "Oxyman / Cornhill, Bury St Edmunds",
      "caption": "Cornhill, Bury St Edmunds"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Abbey_Gardens%2C_Bury_St_Edmunds_-_geograph.org.uk_-_775284.jpg",
      "title": "Bob Jones / Abbey Gardens, Bury St Edmunds",
      "caption": "Abbey Gardens, Bury St Edmunds. This view is taken from the bank of the River Lark, which flows to the east of the Abbey Gardens. The tower of the Cathedral can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/River_Lark%2C_in_Bury_St_Edmunds_-_geograph.org.uk_-_936691.jpg/256px-River_Lark%2C_in_Bury_St_Edmunds_-_geograph.org.uk_-_936691.jpg",
      "title": "Bob Jones / River Lark, in Bury St Edmunds",
      "caption": "River Lark. Despite this scene being a stone's throw from the A14, and a few hundred yards from the Cathedral, this area of Bury St Edmunds is generally known only by dog-walkers. A permissive footpath encircles a low-lying marshy area which used to be privately owned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Bury_St_Edmunds_Cathedral_and_Abbey_ruins_-_geograph.org.uk_-_214251.jpg",
      "title": "Bob Jones / Bury St Edmunds Cathedral and Abbey ruins",
      "caption": "Bury St Edmunds Cathedral and Abbey ruins. The contrast between the new cathedral tower and the old Abbey ruins is spectacular. The Abbey was sacked by local townspeople in 1327 and then on the 20th January 1465, a great fire ravaged the Abbey. It destroyed all the roofs, and brought down the central tower and spire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Autumn_Sunset_on_Hardwick_Heath_-_geograph.org.uk_-_1001296.jpg",
      "title": "Greg Aspland / Autumn Sunset on Hardwick Heath",
      "caption": "Autumn Sunset on Hardwick Heath. This open space to the south of the town is a nice place for a stroll. There's 55 acres to explore with a large field and woodland. It's popular with dog walkers as they are allowed to run off lead here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Go_To_Bed_Meadow_-_geograph.org.uk_-_1292472.jpg",
      "title": "Andrew Hill / Go To Bed Meadow",
      "caption": "Go To Bed Meadow on the southern outskirts of the town. The pretty meadow is full of buttercups in May."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Nowton_Court_-_geograph.org.uk_-_978190.jpg",
      "title": "Oxyman / Nowton Court",
      "caption": "Nowton Court"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Carved_panda%2C_Nowton_Park_-_geograph.org.uk_-_978276.jpg",
      "title": "Oxyman / Carved panda, Nowton Park",
      "caption": "Carved panda, Nowton Park"
    }
  ],
  "distance_km": 11.0,
  "description": "This walk visits some of the highlights of this lovely Suffolk town using sections of the St Edmund Way and Bury to Clare Walk. You'll visit the delightful Abbey Gardens, the River Linnet, Hardwick Heath and Nowton Park. The walk starts off in the centre of town with a stroll around the Abbey Gardens next to the cathedral. The gardens have a nice circular walk taking you to a rose garden, sensory garden, ancient monument ruins, an aviary, and a section of the River Lark. You can then follow a section of the waymarked St Edmund Way, south through the town to Hardwick Heath, crossing the River Linnet on the way. The 55 acre open space of Hardwick Heath is popular with dog walkers and includes majestic trees such as 200-year-old Cedars of Lebanon. After leaving the heath you continue south into the countryside before picking up a section of the Bury St Edmunds to Clare Walk and heading east to Nowton Park. Here you will find good paths taking you around 200 acres of Suffolk countryside landscaped in a beautiful Victorian style. After exploring the park the walk follows Hencote Lane back to the St Edmund Way before returning to the town centre. This route heads south from the town but you could also head north along the Lark Valley Path. This delightful riverside trail takes you along the River Lark to the nearby West Stow Country Park and the Lackford Lakes Nature Reserve. It's a lovely walk with woodland, lakes and lots of wildlife to look out for on the way. Other good options for walkers include the nearby Clare Castle Country Park and Ickworth Park. The delightful nature reserves at Bradfield Woods and Cavenham Heath are also well worth a visit. Please scroll down for the full list of walks near and around Bury St Edmunds. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town head to The Nutshell for some post walk refreshments. It's a quirky little place confirmed to be Britain's smallest pub, with a bar that measures just 15ft by 7ft. Despite its size there's a number of unusual items inside including a mummified cat, currency notes on the ceiling, historical photos, military items and an aeroplane propeller. As such the Victorian pub is a local tourist attraction and well worthy of some investigation. You can find them at 17 The Traverse, with a postcode of IP33 1BJ for your sat navs. There's also a nice on site cafe in Nowton Park if you prefer to enjoy a meal in the parkland surroundings."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails make for a fine dog walk with Hardwick Heath and Nowton Park popular with our four legged friends. The on site cafe at Nowton Park is also very dog friendly with dog ice cream made from sausage meat and handmade dog biscuits available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/t7SmBc_dm70",
  "district": "West Suffolk",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "IP33 2060, Angel Hill, West Suffolk, Suffolk, England, IP33 1LS, United Kingdom",
  "postcode": "IP33 1LS",
  "state": "England"
}