{
  "created_at": "2025-01-06T02:15:29.594431+00:00",
  "objectID": "7c1b4c50330734cfeebc84527ff63975",
  "ref": "upton-upon-severn-walking-route",
  "title": "Upton Upon Severn Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/The_Plough_Inn_and_%27Pepperpot%27%2C_Upton-on-Severn_-_geograph.org.uk_-_2180754.jpg/512px-The_Plough_Inn_and_%27Pepperpot%27%2C_Upton-on-Severn_-_geograph.org.uk_-_2180754.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7c1b4c50330734cfeebc84527ff63975.gpx",
  "_geoloc": {
    "lat": 52.06466321,
    "lng": -2.217628938
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/The_Plough_Inn_and_%27Pepperpot%27%2C_Upton-on-Severn_-_geograph.org.uk_-_2180754.jpg/512px-The_Plough_Inn_and_%27Pepperpot%27%2C_Upton-on-Severn_-_geograph.org.uk_-_2180754.jpg",
      "title": "The Plough Inn and 'Pepperpot', Upton-on-Severn by Mike Baldwin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Plough Inn and & Pepperpot Upton-on-Severn. The town’s iconic feature is locally known as the “Pepperpot”, a tower built in 1770 to replace the church and its spire which was demolished in 1754. Sat on top of the tower is the distinctive copper-clad cupola."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/River_Severn%2C_Upton_upon_Severn_-_geograph.org.uk_-_2544091.jpg/512px-River_Severn%2C_Upton_upon_Severn_-_geograph.org.uk_-_2544091.jpg",
      "title": "River Severn, Upton upon Severn by Stephen McKay, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Severn, Upton upon Severn. Until the mid-20th Century, the bridge crossing the Severn at Upton upon Severn was the only one between here and Worcester. During the Civil War, soldiers of Oliver Cromwell’s army crossed the river here to fight in the battle of Upton; a fight they won. They later marched on to Worcester to fight in that battle. The modern bridge now crossing the Severn was built in 1940."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Tudor_House_Museum%2C_Upton_upon_Severn_-_geograph.org.uk_-_2533444.jpg/512px-Tudor_House_Museum%2C_Upton_upon_Severn_-_geograph.org.uk_-_2533444.jpg",
      "title": "Tudor House Museum, Upton upon Severn by Bob Embleton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tudor House Museum, Upton upon Severn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/River_Severn%2CQueenhill_Viaduct_-_geograph-2654167-by-kevin-skidmore.jpg/512px-River_Severn%2CQueenhill_Viaduct_-_geograph-2654167-by-kevin-skidmore.jpg",
      "title": "kevin skidmore / River Severn,Queenhill Viaduct",
      "caption": "River Severn,Queenhill Viaduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Worcestershire_Bank_of_the_Severn_-_geograph.org.uk_-_1349683.jpg",
      "title": "Pierre Terre / Worcestershire Bank of the Severn",
      "caption": "Worcestershire Bank of the Severn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Gloucestershire_Bank_of_the_Severn_-_geograph.org.uk_-_1349691.jpg",
      "title": "Pierre Terre / Gloucestershire Bank of the Severn",
      "caption": "Gloucestershire Bank of the Severn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Tewkesbury_Abbey_viewed_from_the_Vineyards_-_geograph.org.uk_-_2778122.jpg/512px-Tewkesbury_Abbey_viewed_from_the_Vineyards_-_geograph.org.uk_-_2778122.jpg",
      "title": "Tewkesbury Abbey viewed from the Vineyards by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tewkesbury Abbey viewed from the Vineyards"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/The_Severn_river_bank_at_Uckinghall_-_geograph.org.uk_-_653693.jpg",
      "title": "Philip Halling / The Severn river bank at Uckinghall",
      "caption": "The Severn river bank at Uckinghall. Two houses on the bank of the River Severn near Uckinghall. At the time the river was running higher than normal. A month later all this was flooded during one of the highest floods in living memory."
    }
  ],
  "distance_km": 21.2,
  "description": "This small town in Worcestershire is ideally positioned for river and country walks. There's also some interesting timber framed Tudor buildings and a noteworthy pub dating from the 16th century to relax in after your exercise. This circular walk from the town takes you along both sides of the river to the south of the settlement. It uses a section of the Severn Way to visit nearby Tewkesbury and the neighbouring village of Holly Green. The walk starts on the river where you can pick up the Severn Way and follow the waymarked footpath south to Tewkesbury, passing Queenhill and Bushley. Cross the bridge and you can explore the historic town, enjoying a stroll along the River Avon and visiting the 12th century abbey. This first section follows the western bank of the river on the Worcestershire side. After exploring Tewkesbury the walk heads north on the opposite side of the river. You'll pass Uckinghall Meadow and the village of Ripple. Here you could visit the noteworthy St Mary's Church, a Grade I listed building with \"exceptional\" 15th-century stalls. The final section takes you to Holly Green before crossing the river to return to Upton. The second leg follows the eastern bank or the Gloucestershire side of the river. On the second section of the walk you have the option of heading east to visit Twyning. It's well worth a visit with more footpaths along the River Avon and a splendid riverside pub with a terrace overlooking the water. During the summer boats ferry people up the river Avon from Tewkesbury to enjoy the pub's hospitality.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Hart is set in a Grade II listed building dating all the way back to 1510. They serve good quality food in the fine restaurant area and provide accommodation if you would like to stay in the area. There's also a car park and an outdoor seating area. The pub has literary connections having been mentioned in Henry Fielding’s novel Tom Jones. Two of the rooms were used as the setting for key scenes in the book. It also played a part in the Civil War in 1651 when Royalist troops under the command of Prince Rupert “Partook in drinking strong waters at the inn known as The Lion whereupon a heavy sleep came upon them”. This allowed Roundhead soldiers to cross the bridge into Upton and take control of the church (The Pepperpot) and hold out until reinforcements arrived. The Royalists retreated to Worcester and a week later the King was defeated by Cromwell, effectively ending the Civil War. You can find the inn on the High Street at postcode WR8 0HJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trails make for a pleasant dog walk and the White Hart mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north you can vist the delightful village of Hanley Swan. The picturesque settlement includes a pretty village green, a pond, a 17th century pub and walking trails to neighbouring Hanley Castle where you can see the remains of the ancient fort."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4e5Z9zsVMNY",
  "postcode": "WR8 0HT",
  "district": "Malvern Hills",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Street, Upton-upon-Severn, Malvern Hills, Worcestershire, England, WR8 0HT, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "historic buildings",
    "riverfront",
    "church",
    "village"
  ],
  "facilities": [
    "pub",
    "river access",
    "footpath"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}