{
  "created_at": "2025-01-06T00:57:28.207866+00:00",
  "objectID": "7c51e44ea2e0bfac4213b1427b20f948",
  "ref": "shere-walking-route",
  "title": "Shere Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Middle_Street%2C_Shere%2C_Surrey_-_geograph.org.uk_-_1434321.jpg",
  "nearby": [
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "St Martha's Hill",
      "objectID": "e5f6c8e85616a17034c36a6b1847b1fe",
      "ref": "st-marthas-hill-walking-route"
    },
    {
      "description": "Albury Park",
      "objectID": "0791c545fbaa10904cb5ccb6e6b1cbc0",
      "ref": "albury-park-walking-route"
    },
    {
      "description": "Newlands Corner",
      "objectID": "ae4ec2a114b72c1717f37b5988b9a18e",
      "ref": "newlands-corner-walking-route"
    },
    {
      "description": "Fox Way",
      "objectID": "c216f9e2ccbc1b29ac7c65339dc7f2f3",
      "ref": "fox-way-walking-route"
    },
    {
      "description": "Chantry Wood",
      "objectID": "acde9707754f211fc39e02a7c929ed3d",
      "ref": "chantry-wood-walking-route"
    },
    {
      "description": "Gomshall",
      "objectID": "ac6c904252cf350c0e2212a59d9c50c8",
      "ref": "gomshall-walking-route"
    },
    {
      "description": "Gomshall",
      "objectID": "ac6c904252cf350c0e2212a59d9c50c8",
      "ref": "gomshall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7c51e44ea2e0bfac4213b1427b20f948.gpx",
  "_geoloc": {
    "lat": 51.2201676985,
    "lng": -0.4647736125
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Middle_Street%2C_Shere%2C_Surrey_-_geograph.org.uk_-_1434321.jpg",
      "title": "Peter Trimming / Middle Street, Shere, Surrey, via Wikimedia Commons",
      "caption": "Middle Street, Shere. Looking towards the North Downs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Newlands_Corner%2C_on_Albury_Downs_-_geograph.org.uk_-_460461.jpg",
      "title": "Colin Smith / Newlands Corner, on Albury Downs, via Wikimedia Commons",
      "caption": "Newlands Corner, on Albury Downs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/North_Downs_Way_at_Newlands_Corner_-_geograph.org.uk_-_233971.jpg",
      "title": "Richard Thomas / North Downs Way at Newlands Corner, via Wikimedia Commons",
      "caption": "North Downs Way at Newlands Corner"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/On_St_Martha%27s_Hill_-_geograph.org.uk_-_547028.jpg",
      "title": "Colin Smith / On St Martha's Hill, via Wikimedia Commons",
      "caption": "On St Martha's Hill The North Downs Way here is sandy as it climbs the greensand ridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/St_Martha_Hill.jpg",
      "title": "Colin Smith / North Downs Way, St Martha's Hill, via Wikimedia Commons",
      "caption": "St Martha's Hill, an anciently volcanic knoll in the north downs, looking west along the lower then equal height escarpment towards the Clandon, Effingham and Horsley Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Chilworth_Manor-geograph-2078175.jpg",
      "title": "N Chadwick / Chilworth Manor, via Wikimedia Commons",
      "caption": "Chilworth Manor 17th century manor house."
    }
  ],
  "distance_km": 14.5,
  "description": "The attractive Surrey village of Shere is in a great location for exploring the Surrey Hills and the North Downs. This circular walk makes use of the North Downs Way and other public footpaths to visit some of the highlights of the area including Newlands Corner, St Martha's Hill and Albury Park. The route runs for a distance of 9 miles with some moderate climbs along the way. From the high points there are splendid view over the surrounding countryside to enjoy. The walk starts in the village centre and heads north past Netley Park to meet with the North Downs Way. Follow the waymarked path west and it will take you past Chantry Wood and Clandon Downs to Newlands Corner. The lovely beauty spot is one of the highlights of the area and is very popular with walkers and cyclists. There's several nice woodland trails and open chalk downland with wonderful views over the Surrey Hills. You can also look out for wildlife including roe deer, green woodpeckers, nuthatches and tawny owls. The route continues west to St Martha's Hill, another fine spot for walkers. The hill summit stands at 574 feet (175 m) and commands wonderful views of the surrounding area. There are also a number of nice woodland trails, attractive grassland and a number of interesting plants. After taking in the views the route heads south past Chilworth Manor, a 17th century manor house and Grade II listed building. You then pick up public footpaths to take you south east eventually reaching the woodland of Albury Warren. Here you reach Albury Park where you will find 150 acres of parkland with lots of walking trails to try. Features include peaceful woodland, pretty lakes and views of the River Tillingbourne. There is also the Grade II listed Albury country house and the Saxon Old St Peter and St Paul's Church to see. After exploring the park you follow footpaths back into Shere where there are some quality pubs for refreshments after your walk. It's also nice to stroll around the village where you will find pretty cottages, shops including a blacksmith and trekking shop, a tea house, art gallery, and a noteworthy Norman church. To extend your walking from the village you could try the Fox Way long distance trail which runs through Shere. The trail takes you on a tour of the countryside, woodland and canals surrounding Guildford. You could follow the trail to the nearby Blackheath Common where there are a series of nice trails to try. The tranquil Silent Pool is also near the village and well worth a visit.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the village you can try the Chilworth Gunpowder Mills Walk. This historical trail takes you along the River Tillingbourne to the ruins of several old Gunpowder Mills. The mills were originally established in 1625 by the East India Company and became an important supplier of gunpowder to the Government during the 17th, 18th and 19th centuries. It's an impressive sight with a number of buildings to explore and informations boards detailing the history of the area. You can access the trail on Blacksmith Lane at a postcode of GU4 8NQ. Just to the east is the neighbouring Gomshall where you'll find nice trails along the Tilling Bourne stream and a fine riverside pub. For more walking ideas in the area see the North Downs Walks page."
    }
  ],
  "district": "Guildford",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Forge, Middle Street, Shere, Gomshall, Guildford, Surrey, England, GU5 9HF, United Kingdom",
  "postcode": "GU5 9HF",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "chalk downland"
  ],
  "points_of_interest": [
    "viewpoint",
    "historical site",
    "park"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park",
    "dog friendly",
    "play area",
    "tea house",
    "art gallery",
    "church"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}