{
  "created_at": "2025-01-06T04:38:10.873677+00:00",
  "objectID": "7cfb95d052c62e9e8d65c59321e2c410",
  "ref": "llanfyllin-walking-route",
  "title": "Llanfyllin Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/76/Llanfyllin_-_geograph.org.uk_-_3098617.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7cfb95d052c62e9e8d65c59321e2c410.gpx",
  "_geoloc": {
    "lat": 52.7660185087,
    "lng": -3.2730195415
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Llanfyllin_-_geograph.org.uk_-_3098617.jpg",
      "title": "Llanfyllin by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Llanfyllin. The town's name comes from Myllin, a Celtic Saint of the 7th century. The town received its borough charter from Llewelyn ap Gruffydd, Lord of Mechain in 1293, making it one of just two Welsh towns (the other being Welshpool) to do so."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Main_Square_in_Llanfyllin_-_geograph.org.uk_-_21496.jpg",
      "title": "J M Briscoe / Main Square in Llanfyllin",
      "caption": "Main Square in Llanfyllin. The town is situated between Shrewsbury and Bala, two market towns that have long been important to this region of Wales and the Welsh borders. There is proof of an early British settlement at the nearby Bodyddon. Although some claim Meifod or Caersws, Llanfyllin may be the \"Mediolanum among the Ordovices\" mentioned in Ptolemy's Geography (circa AD 150)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Llanfyllin_Workhouse_-_the_west_courtyard_-_geograph.org.uk_-_2196351.jpg",
      "title": "Llanfyllin Workhouse - the west courtyard by Penny Mayes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Llanfyllin Workhouse. After being highlighted on BBC 2's Restoration show, The Workhouse has changed into a hub for the arts, innovation, and the environment. It is home to the Workhouse History Centre, the only free, open-to-the-public workhouse museum in Wales, as well as a variety of events such local music festivals, horse fairs, and art exhibitions. Its 6-acre location, which also houses a sensory garden and is used for classes and activities related to ecology."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Llanfyllin_Workhouse_-_the_vegetable_plot_-_geograph.org.uk_-_2196385.jpg/256px-Llanfyllin_Workhouse_-_the_vegetable_plot_-_geograph.org.uk_-_2196385.jpg",
      "title": "Llanfyllin Workhouse - the vegetable plot by Penny Mayes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Llanfyllin Workhouse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Churchyard_and_houses%2C_Llanfyllin_-_geograph.org.uk_-_3612232.jpg",
      "title": "Churchyard and houses, Llanfyllin by Andrew Hill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Churchyard and houses. The town is well-known for Fynnon Coed y Llan, a holy well. Saint Myllin, who is said to have performed baptisms here in the sixth century, is honoured by the well's dedication. Saint Myllin is also honoured in the parish church. The Irish bishop Saint Mo Ling, also known as Moling Luachra, is said to be the patron saint of Myllin (614–697). This is uncertain, though. There is no evidence that Mo Ling visited Wales, and it is said that Myllin is interred beneath the altar of the church in Llanfyllin while Mo Ling is thought to have been laid to rest at his monastery in Ireland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Cain_Valley_Hotel%2C_Llanfyllin_-_geograph.org.uk_-_2577883.jpg/512px-Cain_Valley_Hotel%2C_Llanfyllin_-_geograph.org.uk_-_2577883.jpg",
      "title": "Cain Valley Hotel, Llanfyllin by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cain Valley Hotel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Llanfyllin_High_Street_-_geograph.org.uk_-_1923090.jpg/512px-Llanfyllin_High_Street_-_geograph.org.uk_-_1923090.jpg",
      "title": "Llanfyllin High Street by nick macneill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Llanfyllin High Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Villa_Norge%2C_Llanfyllin_-_geograph.org.uk_-_3098479.jpg",
      "title": "Villa Norge, Llanfyllin by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Villa Norge"
    }
  ],
  "distance_km": 3.8,
  "description": "This market town is located in Montgomeryshire, Powys. Walkers can explore the beautiful River Cain Valley and the nearby Berwyn Mountains. Other local walking highlights include Lake Vyrnwy and the Snowdonia National Park to the west. To the north west there's the incredible views from Cadair Berwyn and the wonderful Pistyll Rhaeadr waterfall. The interesting old town also includes two 18th century pubs for post walk refreshment. This circular walk from the village visits the Llanfyllin Workhouse. The workhouse is located just east of the village and is a historical highlight of the area. Here you can learn all about the working conditions for those unfortunate to enter the 1830s workhouse. It has been well preserved with lots of information boards detailing the history of the area. On the walk you can also enjoy some splendid views of the rolling hills surrounding the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old New Inn is housed in a 1790 Grade II listed building at the end of Llanfyllin High Street. Photos of current and former sports teams are used to decorate the bar, which is simply furnished. The pool table is located in the rear function room. If the sun is out, there is an elevated drinking area in the back and a covered, heated shelter to the side of the building. A very friendly locals pub serving three well kept ales. Recently, food has been introduced. You can find them at postcode SY22 5AA for your sat navs. The pub is dog friendly. Also on the High Street is the Cain Valley Hotel. Formerly the Wynnstay Arms the hotel was constructed in the 17th century. The centre of the inn is dominated by a staircase from the same era. On the right as you enter, there is a public bar, and on the other side, there is a cosy lounge bar. Reassuringly traditional, with numerous crevices and wooden beams all over. Through the hallway, the Birches restaurant is located in a sizable space."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dauOOYIH1hM",
  "postcode": "SY22 5AT",
  "district": "Llanfyllin",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "36, High Street, Llanfyllin, Powys, Cymru / Wales, SY22 5AT, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "waterfalls",
    "views"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}