{
  "created_at": "2025-01-06T04:05:35.217642+00:00",
  "objectID": "7d79fec4f51e527a21f8def0ddd3d4c4",
  "ref": "manorbier-to-freshwater-east-walk-walking-route",
  "title": "Manorbier to Freshwater East Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Manorbier_Bay_-_geograph.org.uk_-_36303.jpg",
  "nearby": [
    {
      "description": "Pembrokeshire Coast Path",
      "objectID": "ad6d6081a04362874fc894b50c9a12b7",
      "ref": "pembrokeshire-coast-path-walking-route"
    },
    {
      "description": "Manorbier Castle",
      "objectID": "87ea1c50b633144e82842081a5c5d240",
      "ref": "manorbier-castle-walking-route"
    },
    {
      "description": "Freshwater West",
      "objectID": "41d68244ddc861dacf0570cd704aa129",
      "ref": "freshwater-west-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7d79fec4f51e527a21f8def0ddd3d4c4.gpx",
  "_geoloc": {
    "lat": 51.6441679295,
    "lng": -4.8001263176
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Manorbier_Bay_-_geograph.org.uk_-_36303.jpg",
      "title": "Tony Grant / Manorbier Bay",
      "caption": "Manorbier Bay. Manorbier bay taken in the evening. A secluded Welsh bay frequented by dog walkers and ideal for romantic BBQ's."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Footpath_on_East_Moor_Cliff_-_geograph.org.uk_-_2384670.jpg/512px-Footpath_on_East_Moor_Cliff_-_geograph.org.uk_-_2384670.jpg",
      "title": "Footpath on East Moor Cliff by Ian Paterson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath on East Moor Cliff"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Swanlake_Beach_-_geograph.org.uk_-_669652.jpg",
      "title": "Rob Lowe / Swanlake Beach",
      "caption": "Swanlake Beach. The development of the bay has been facilitated by erosion along numerous faults. Some of these show up as gullies cutting across the layers in the wave-cut platform. The orientation of the faults can be measured from vertical air photos (eg. Google Earth). Frictional forces caused the changes in orientation (strike) of the bedding which coincide with the faults. I have a theory that the name Swanlake is derived from the Viking chieftain Sweyn (as in Sweyn's Ey, now Swansea) and that the Lake part of the name may be a Norse word for spring or stream, as there are several of these behind the sandy beach. This secluded bay would have been a safe place for Viking raiders to obtain supplies of fresh water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Swanlake_Bay_-_geograph.org.uk_-_1570744.jpg",
      "title": "Sid Howells / Swanlake Bay",
      "caption": "Swanlake Bay. View over the western part of the bay, showing cliffs up to 40m high and a wave-cut platform (seen here at mid-tide). Vertical layers (beds) form part of the sequence of rocks referred to as the Old Red Sandstone. Near the top of the cliffs, slight curvature of the beds shows evidence of mass movements (solifluction flows) during the latter part of the Ice Age. As a result of post-glacial rise in sea level, marine erosion has removed most of the solifluction flow deposits, although there are some remnants behind the sandy beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Near_Privar_-_geograph.org.uk_-_56209.jpg",
      "title": "Dennis Turner / Near Privar",
      "caption": "Near Privar. Western edgre of West Moor Cliff looking west from Pembrokeshire Coastal path towards Freshwater East."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Freshwater_East_Bay_-_geograph.org.uk_-_1565656.jpg",
      "title": "Sid Howells / Freshwater East Bay",
      "caption": "Freshwater East Bay. View SW at high tide showing beach and climbing dunes. Valley extending inland for 5km has been formed by erosion of soft rock (Ordovician shales) in core of Freshwater East Anticline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Evening_at_Freshwater_East_-_geograph.org.uk_-_1356192.jpg",
      "title": "Ruth Sharville / Evening at Freshwater East",
      "caption": "Evening at Freshwater East"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Trewent_Point_-_geograph.org.uk_-_1567377.jpg",
      "title": "Sid Howells / Trewent Point",
      "caption": "Trewent Point at Freshwater East. View showing inaccessible shoreline on the south side of the headland. You can walk out along the top of this headland but the path gets progressively narrower and it's potentially dangerous (especially during/after rain and in windy weather). Rocks in the lower part of the sequence known as the Old Red Sandstone dip south-south-west at 50 degrees and include a layer of volcanic ash (the Townsend Tuff). This location is on the southern limb of the Freshwater East Anticline. Freshwater East Bay (out of sight behind headland) has been formed by erosion of softer rocks in the core of the anticline. The black line is a lichen zone immediately above the limit of high tide. The rocks below this are encrusted with grey barnacles. Wind, waves and tidal currents can create dangerous conditions for kayakers (foreground). The area lies within a Site of Special Scientific Interest (SSSI) so please avoid disturbance to wildlife (especially nesting birds)."
    }
  ],
  "distance_km": 6.0,
  "description": "This walk follows a lovely section of the Pembrokeshire Coast Path from Manorbier to the village of Freshwater East. The cliff top route runs for just under 4 miles passing a number of beautiful bays and beaches on the way. You start off at the car park near the historic Manorbier Castle. From here you follow the waymarked footpath west, passing Manorbier Bay, East Moor Cliff and Swanlake Bay before coming to the lovely beach at Freshwater East. The route passes along the beach before finishing at Trewent Point.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west and you can visit Freshwater West where there's a lovely beach with sand dunes and rock pools. There's also a fine circular walk around Angle Bay and the village of Angle starting from here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bVF9ALLJF98",
  "postcode": "SA70 7TA",
  "district": "Manorbier",
  "county": "Pembrokeshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B4585, Manorbier, Pembrokeshire, Cymru / Wales, SA70 7TA, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal"
  ],
  "points_of_interest": [
    "historic castle",
    "beach"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}