{
  "created_at": "2025-01-05T23:22:55.877485+00:00",
  "objectID": "7da9ccde213952f149316b4514bb7170",
  "ref": "wellesbourne-walking-route",
  "title": "Walk around Wellesbourne Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/23/Wellesbourne_Water_Mill_-_geograph.org.uk_-_89870.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7da9ccde213952f149316b4514bb7170.gpx",
  "_geoloc": {
    "lat": 52.1940375085,
    "lng": -1.5951208472
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Wellesbourne_Water_Mill_-_geograph.org.uk_-_89870.jpg",
      "title": "David Stowell / Wellesbourne Water Mill",
      "caption": "Wellesbourne Water Mill. This mill on the River Dene dates from 1834, as can be seen from the brickwork. It has been restored to working order and is open to the public on some weekends. In 1990 it won a conservation award for Wind and Watermills. The mill is driven by a large breastshot waterwheel and is used to produce wholemeal and white flour, semolina and bran."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/River_Dene%2C_Wellesbourne_-_geograph.org.uk_-_2499300.jpg",
      "title": "River Dene, Wellesbourne by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Dene"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Path_to_Wellesbourne_Water_Mill_-_geograph.org.uk_-_2496627.jpg",
      "title": "Path to Wellesbourne Water Mill by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path to Wellesbourne Water Mill. This is a view of the path running south from the village to the mill. Farms with horses dot the route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Chestnut_Square%2C_Wellesbourne_%28geograph_2496331%29.jpg",
      "title": "Derek Harper / Chestnut Square, Wellesbourne",
      "caption": "Chestnut Square, Wellesbourne. A view of some of the picturesque thatched dwellings in the village. The half timbered house in the centre (behind tree) is the grade II* listed Little House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/The_Dene_in_Charlecote_Park_-_geograph.org.uk_-_1567556.jpg",
      "title": "Derek Harper / The Dene in Charlecote Park",
      "caption": "The Dene in Charlecote Park. The River Dene meets the River Avon near Charlecote House, about 300 metres from here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/River_Dene_in_Charlecote_Park_-_geograph.org.uk_-_1567599.jpg",
      "title": "Derek Harper / River Dene in Charlecote Park",
      "caption": "River Dene in Charlecote Park. Looking upstream. The section of fence in the foreground exemplifies the style used around the park. The variable height of the uprights confuses the deer and prevents them from jumping it, apparently."
    }
  ],
  "distance_km": 8.0,
  "description": "This large village in Warwickshire has some nice riverside trails and a significant National Trust property to visit. There's also a noteworthy ancient pub to investigate after your exercise. The inn has a fascinating history stretching back hundreds of years. This walk from the village first heads south along the River Dene to visit the historic watermill before heading north to visit the splendid Charlecote Park. The Watermill dates back to the early part of the 19th century and sits in a picturesque riverside spot just a mile south of the settlement. The National Trust owned Charlecote includes a splendid deer park and pleasant woodland trails. You could extend the walk at the start by continuing south east to Combrook where you could visit the lovely Compton Verney. Here you'll find Capability Brown landscaped grounds surrounding a fine Georgian Mansion. For more detail about the history, architecture and the village's local airfield see the informative wikipedia page.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kings Head is a good choice for some post walk refreshment. It's a historic place dating all the way back to the 1600s. The inn was notably used as a hospital during the English Civil War (1642–1651). You can find them on Warwick Road at postcode CV35 9LX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trails make for a pleasant dog walk. The Kings Head mentioned above is also dog friendly with water and treats available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south east is Gaydon where you can visit the British Motor Museum. The noteworthy museum houses one of the largest collections of historic British cars in the world. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "postcode": "CV35 9RA",
  "district": "Stratford-on-Avon",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "2,4, Chapel Street, Wellesbourne CP, Wellesbourne, Stratford-on-Avon, Warwickshire, England, CV35 9RA, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "deer park",
    "landscaped grounds"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}