{
  "created_at": "2025-01-06T03:45:39.903997+00:00",
  "objectID": "7dac2fdaf42e1348ecd8d2e4b59e7953",
  "ref": "oxford-canal-walk-walking-route",
  "title": "Oxford Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Oxford_Canal_east_of_Rugby%2C_Warwickshire_-_geograph.org.uk_-_988082.jpg",
  "nearby": [
    {
      "description": "Rousham Park",
      "objectID": "2efe50d9d18092ddaa38ffbe205cf2b6",
      "ref": "rousham-park-walking-route"
    },
    {
      "description": "Port Meadow",
      "objectID": "70196209afb54473f5c7af6a9efdfc7c",
      "ref": "port-meadow-walking-route"
    },
    {
      "description": "Rugby",
      "objectID": "f8d69dc3597051a5ca84943d3e79537b",
      "ref": "rugby-walking-route"
    },
    {
      "description": "Thrupp Canal Walk",
      "objectID": "7879828a6c463aa283da0ad570dec6c8",
      "ref": "thrupp-canal-walk-walking-route"
    },
    {
      "description": "Kidlington Circular Walk",
      "objectID": "4bd9628943546e512d92208718c6ce1f",
      "ref": "kidlington-circular-walk-walking-route"
    },
    {
      "description": "Braunston to Whilton Locks",
      "objectID": "06ccbc072a8e86ccc09e327e544c7ee6",
      "ref": "braunston-to-whilton-locks-walking-route"
    },
    {
      "description": "Coventry Canal",
      "objectID": "c8f3fefe14d76428c762cb3872e28420",
      "ref": "coventry-canal-walking-and-cycle-route"
    },
    {
      "description": "Coventry",
      "objectID": "37f16e66f56979d06be79d600d76c244",
      "ref": "coventry-walking-route"
    },
    {
      "description": "Farnborough Hall",
      "objectID": "a8808220aa71bc4d5967cc53ba6cb7bf",
      "ref": "farnborough-hall-walking-route"
    },
    {
      "description": "Napton on the Hill",
      "objectID": "5da4a7a8328ea70cd70c8a7a22f674af",
      "ref": "napton-on-the-hill-walks"
    },
    {
      "description": "Napton Reservoir",
      "objectID": "c6450334e0feaf026f2a2a542f288072",
      "ref": "napton-reservoir-walking-route"
    },
    {
      "description": "Upper And Lower Heyford Canal Walk",
      "objectID": "cec1b527df7df6826a0927a38de453f6",
      "ref": "upper-and-lower-heyford-canal-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7dac2fdaf42e1348ecd8d2e4b59e7953.gpx",
  "_geoloc": {
    "lat": 51.7539147001,
    "lng": -1.2650282647
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Oxford_Canal_east_of_Rugby%2C_Warwickshire_-_geograph.org.uk_-_988082.jpg",
      "title": "Roger Kidd / Oxford Canal east of Rugby, Warwickshire, via Wikimedia Commons",
      "caption": "Oxford Canal east of Rugby, Warwickshire. Here we are approaching Bridge No 68, a typical brick built structure allowing the farmers to have access to fields on both sides of the canal. The Oxford Canal was authorised as early as 1769, and James Brindley devised a meandering course hugging contours wherever possible. He died in 1772, and Samuel Simcock completed the task, but by the late 1820s, a considerable straightening of the course was engineered which cut many miles from the length of the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Hillmorton_Top_Locks%2C_Oxford_Canal%2C_Warwickshire_-_geograph.org.uk_-_987658.jpg",
      "title": "Roger Kidd / Hillmorton Top Locks, Oxford Canal, Warwickshire, via Wikimedia Commons",
      "caption": "Hillmorton Locks, Rugby, Warwickshire The flight of locks at Hillmorton consists of three pairs, the bottom pair (here) numbered 2 and 3, then up to Nos 4 and 5, with No 6 and No 7 being the toplock pairing. This is because of the stop lock at Hawkesbury, about sixteen miles away being allocated number one on this, the North Oxford Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/The_Oxford_Canal_east_of_Brinklow%2C_Warwickshire_-_geograph.org.uk_-_1051656.jpg",
      "title": "Roger Kidd / The Oxford Canal east of Brinklow, Warwickshire",
      "caption": "The canal east of Brinklow, Warwickshire. All Oaks Wood (good visitor moorings adjacent) is on the sky line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/The_Oxford_Canal%2C_Cropredy_-_geograph.org.uk_-_662653.jpg",
      "title": "Andrew Smith / The Oxford Canal, Cropredy",
      "caption": "The scene at Cropredy near Banbury in Oxfordshire. The wharf south of the bridge on the road to Williamscot. The village also lies on the River Cherwell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Oxford_Canal%2C_Hillmorton_-_geograph.org.uk_-_615187.jpg",
      "title": "Stephen McKay / Oxford Canal, Hillmorton",
      "caption": "Hillmorton. Looking from the bottom lock on a frosty morning. This is the start of a long pound that stretches to Hawkesbury Junction on the outskirts of Coventry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Boats_moored_in_feeder_arm%2C_Oxford_Canal%2C_Clifton_-_geograph.org.uk_-_1414820.jpg",
      "title": "Andy F / Boats moored in feeder arm, Oxford Canal, Clifton",
      "caption": "Boats moored in feeder arm at Clifton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Napton_Marina_-_geograph.org.uk_-_2433202.jpg/512px-Napton_Marina_-_geograph.org.uk_-_2433202.jpg",
      "title": "Napton Marina by Graham Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Napton Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/The_Oxford_Canal_at_Stretton_Stop%2C_Warwickshire_-_geograph.org.uk_-_1051679.jpg",
      "title": "Roger Kidd / The Oxford Canal at Stretton Stop, Warwickshire",
      "caption": "The Canal at Stretton Stop, Warwickshire. The B4027 road bridge is seen here beyond the moored hire craft of Rose Narrowboats. A small swing footbridge often blocks the canal by the parked cars."
    }
  ],
  "distance_km": 124.0,
  "description": "Follow the Oxford Canal from Oxford to Coventry on this splendid waterside walk. You follow the towpath of the canal for the duration of the route meaning this is a fairly easy walk (providing you don't do at all at once!) You will pass through a series of delightful villages including Thrupp, Lower Heyford, Banbury, Cropredy, Braunston Turn and Rugby before finishing at Hawkesbury Junction in Coventry. The peaceful south Midlands countryside, a series of pretty locks and several excellent canal side pubs make this walk a fantastic experience. Highlights include the delightful Port Meadow at the start of the route in Oxford, great views of the River Cherwell through Oxfordshire and the stunning gardens at Rousham Park .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just north of Kidlington you can stop at the Jolly Boatman Inn at Thrupp. The pub has lovely canalside seating and a great menu. You can find it at postcode OX5 1JU.Also of interest is the noteworthy Perch Inn in Binsey. The thatched 17th-century country inn is one of the oldest pubs in Oxford and sits next to the lovely Port Meadow. It has a great menu and a splendid, large garden to sit out and relax in during the warmer months. Notably, the pub was a frequent haunt of Inspector Morse from the famous ITV series of the 80s and 90s. You can find it on Binsey Lane at postcode OX2 0NG. At lock number 3 in Braunston you can visit the canalside Admiral Nelson for some refreshments. The interesting building itself dates back to 1730 and pre-dates the canal. It was originally a farm building and cows were milked where the restaurant is today and a green grocer’s shop which opened onto the lock side was where there is now a skittles room. There's a lovely beer garden where you can sit out in the summer months, and watch the canal boats and the world go by. You can cosy up in the winter next to the roaring open fire. The pub is right on the canal in Braunston at postcode NN11 7HJ. The village of Napton on the Hill is a nice place to explore. Here you'll find some historic buildings including a 12th century church, an old tower mill and The Folly. The old wood beamed pub sits in a fine location next to the canal. You can relax outside in the lovely waterside garden and watch the world go by. It's a friendly place with a good menu and selection of drinks. The pub can be found on Folly Lane with postcode CV47 8NZ for your sat navs. Near here you can also pay a visit to the pretty Napton Reservoirs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the end of the route you can link up with the Coventry Canal and try the Coventry Circular Walk to explore the area further. Near Claydon you could leave the canal to visit the National Trust's Farnborough Hall. The Grade I listed hall dates from the 18th century and is surrounded by attractive parkland with lakes and beautiful landscaped gardens."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2yYtDUWkuiY",
  "postcode": "OX1 2HB",
  "district": "Oxford",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Worcester College, Walton Street, St Thomas', City Centre, Oxford, Oxfordshire, England, OX1 2HB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "river views"
  ],
  "facilities": [
    "pub/cafe",
    "canal side"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}