{
  "created_at": "2025-01-06T00:59:48.845392+00:00",
  "objectID": "7dbbd9146ed129b40d47f41851b48b3f",
  "ref": "nine-ladies-stone-circle-walk-walking-route",
  "title": "Nine Ladies Stone Circle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Nine_Ladies_02.jpg/512px-Nine_Ladies_02.jpg",
  "nearby": [
    {
      "description": "Stanton Moor",
      "objectID": "0bf243bd5f27630246d7ca692c75b575",
      "ref": "stanton-moor-walking-route"
    },
    {
      "description": "Darley Dale",
      "objectID": "64f3b3af75ee294adcbb13b9675ba7bd",
      "ref": "darley-dale-walking-route"
    },
    {
      "description": "Winster",
      "objectID": "91716657bc8c69eec6c8aec1aaef5fb8",
      "ref": "winster-walking-route"
    },
    {
      "description": "Birchover",
      "objectID": "b5432b1f0dd03da9344e99957955faba",
      "ref": "birchover-walking-route"
    },
    {
      "description": "Robin Hood's Stride",
      "objectID": "1eb37f43c9abd03a73886d9a4b4628ed",
      "ref": "robin-hoods-stride-walking-route"
    },
    {
      "description": "Bonsall",
      "objectID": "172fa0fd74959c774622c9ebf5db583b",
      "ref": "bonsall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7dbbd9146ed129b40d47f41851b48b3f.gpx",
  "_geoloc": {
    "lat": 53.1562333989,
    "lng": -1.6463609525
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Nine_Ladies_02.jpg/512px-Nine_Ladies_02.jpg",
      "title": "PaleCloudedWhite, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Nine Ladies. The purpose of such monuments is unknown, although archaeologists speculate that the stones represented supernatural entities for the circles' builders. Measuring 10.8 metres in diameter, the stone circle consists of ten millstone grit stones, although for several centuries one of these was buried, providing the impression that there had been nine stones. Whether the tenth was part of the original prehistoric design or a later addition is unknown. The earth rises up around the circle, although it is unclear if this was part of a deliberate earthen bank or the unintended result of other activities. It is possible that either a hollow, a standing stone, or an earthen mound was once located inside the ring. A single monolith, the King Stone, stands to the southwest of the circle; it is unknown if this was placed there in deliberate reference to the Nine Ladies circle or whether their proximity is incidental."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Stanton_Moor%2C_heather%2C_gorse_and_silver_birch_-_geograph.org.uk_-_1455696.jpg",
      "title": "John Sutton / Stanton Moor: heather, gorse and silver birch",
      "caption": "Stanton Moor, heather, gorse and silver birch. The archaeologist Aubrey Burl described the area of Stanton Moor as \"a prehistoric necropolis of cairns, ring-cairns, standing stones and stone circles\". It is 300m north/north-east of the Reform Tower, while to the west of the stone circle is a cairn cemetery containing three large Bronze Age ring-cairns. Although the moor is largely heathland, the area near to the Nine Ladies is dominated by fescue grasses. The heather has been cleared from the site and the birch trees have been prevented from encroaching on the stones themselves, improving visibility of the monument"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Stanton_Moor_-_Footpath_Entrance_from_Birchover_Road_-_geograph.org.uk_-_960338.jpg",
      "title": "Alan Heardman / Stanton Moor - Footpath Entrance from Birchover Road",
      "caption": "Stanton Moor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Old_quarry_near_Cork_Stone_-_geograph.org.uk_-_992536.jpg",
      "title": "Chris Wimbush / Old quarry near Cork Stone",
      "caption": "Old quarry near Cork Stone"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Quarried_stone_and_birches_-_geograph.org.uk_-_1617869.jpg/256px-Quarried_stone_and_birches_-_geograph.org.uk_-_1617869.jpg",
      "title": "David Lally / Quarried stone and birches",
      "caption": "Quarried stone and birches"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/The_Reform_Tower_in_Autumn_-_geograph.org.uk_-_584436.jpg/256px-The_Reform_Tower_in_Autumn_-_geograph.org.uk_-_584436.jpg",
      "title": "David Lally / The Reform Tower in Autumn",
      "caption": "The Reform Tower in Autumn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/King_Stone_to_Nine_Ladies_-_geograph.org.uk_-_992544.jpg",
      "title": "Chris Wimbush / King Stone to Nine Ladies",
      "caption": "King Stone to Nine Ladies. During the 18th and 19th centuries, the Nine Ladies attracted the attention of antiquarians like Hayman Rooke and Thomas Bateman. Archaeological excavation took place in 2000. A wall was built around the circle in the 19th century but removed in 1985. Since the late 20th century, the Nine Ladies has been regarded as a sacred site by modern Pagan groups who conduct rituals there. From 1999 to 2010 the area around the site was home to the Nine Ladies Anti-Quarry Campaign, which sought to prevent a nearby quarrying operation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Stanton_Moor_-_Footpath_to_Birchover_Road_from_the_Cork_Stone_-_geograph.org.uk_-_959857.jpg",
      "title": "Alan Heardman / Stanton Moor - Footpath to Birchover Road from the Cork Stone",
      "caption": "Stanton Moor"
    }
  ],
  "distance_km": 4.0,
  "description": "This walk visits the fascinating Bronze Age stone circle of the Nine Ladies in the Derbyshire Peak District. The walk starts from the village of Birchover on the edge of Stanton Moor. From here you can pick up country lanes to take you to the moor, passing the Barton Hill quarries and the noteworthy Cork Stone on the way. On the moor you can then follow nice footpaths up to the stone circle. Here you will find the 9 upright stones thought to depict nine ladies turned to stone as a penalty for dancing on Sunday. The site dates from the Bronze age about 3,000 to 4,000 years ago. After exploring the site you can follow other trails south past the stone tower on the eastern side of the moor. The Reform or Earl Grey Tower, was built by William Pole Thornhill and dedicated to the Reform Act 1832. After passing the structure other trails then lead you back to the village where you can enjoy refreshments at one of the pubs or cafes. For an alternative walk to the site you could park on the Lees Road just to the north of the stone circle. See the Stanton Moor Walk for more details. To further continue your walking in the area you could visit Sheepwalk wood just north of the moor. Two long distance footpaths also run past the western and eastern side of the area. The Derwent Valley Heritage Way can be followed through Darley Dale to Matlock along the River Derwent. The Limestone Way can be followed towards nearby Youlgreave .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Birchover there's two decent pubs for post walk refreshment. The Red Lion dates back to 1680 and includes oak beams, stone walls, log burners and a nice patio area. Just up the street there's also The Druid Inn to try. It too has an interesting history having once been the meeting place of the Druids who used the sites around the village for ceremonial worship in ancient times."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The moorland is a fine place for a dog walk. Birchover's local pubs are also both dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south from Birchover and you will soon come to the neighbouring village of Winster. The village is well worth a visit with the 17th century Old Market Hall a highlight of the area. The building is owned by the National Trust and was the first to be acquired by the charity back in 1906 for the princly sum of £50. At the hall you'll find a series of interpretation panels detailing the history of the village and a scale model of Winster. The village also includes a noteworthy old pub which dates all the way back to 1472. The circular walk from the village will take you to Bonsall which is also worthy of some exploration. You can visit Darley Dale on the longer Birchover Walk which also starts in the village. Just to the west there's the popular Robin Hood's Stride. The splendid rock formation is one of the highlights of the area. There's also the Bronze Age Nine Stones Close Stone Circle just north of the rocks. For more walking ideas in the area see the Peak District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/R1gUPz53lUg",
  "district": "Birchover",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}