{
  "objectID": "7dc1dc5ae7311bcbb7a0d44fe6bcfa18",
  "created_at": "2024-12-19T14:54:28.909361+00:00",
  "ref": "horton-in-ribblesdale-walking-route",
  "title": "Horton in Ribblesdale Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Horton_in_Ribblesdale_-_geograph.org.uk_-_1382610.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/7E9833738227FB668625859500369862/$FILE/Horton in Ribblesdale.gpx",
  "_geoloc": {
    "lat": 54.1481560675,
    "lng": -2.2914567555
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Horton_in_Ribblesdale_-_geograph.org.uk_-_1382610.jpg",
      "title": "Andy Jamieson / Horton in Ribblesdale",
      "caption": "Horton in Ribblesdale. Footbridge over the Ribble"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Horton_in_Ribblesdale_-_geograph.org.uk_-_429350.jpg",
      "title": "John S Turner / Horton in Ribblesdale",
      "caption": "Looking along the B6479 in Horton in Ribblesdale, North Yorkshire, on a sunny day. On the left is a K6 telephone kiosk, which is useful in the area due to patchy mobile phone coverage. Behind the phone box is the National Parks car park, which is pay and display. There is also a toilet block beside the car park. In the distance is the first of the twin bridges at Horton, this one is over Brants Ghyll."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Two_bridges_in_Horton_in_Ribblesdale_-_geograph.org.uk_-_1276126.jpg",
      "title": "John S Turner / Two bridges in Horton in Ribblesdale",
      "caption": "Two bridges in Horton in Ribblesdale New Inn Bridge, which carries the B6479 over the River Ribble, is in the centre of the photo. The wooden pedestrian bridge on the left enables pedestrians to avoid the narrow stone bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Station_Road%2C_Horton_in_Ribblesdale_-_geograph.org.uk_-_429978.jpg",
      "title": "John S Turner / Station Road, Horton in Ribblesdale",
      "caption": "Station Road, Horton in Ribblesdale. Looking down Station Road, Horton in Ribblesdale, towards the B6479, which turns to the left in this photo. Pen-y-ghent, one of the Yorkshire Three Peaks, is prominent in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Office_Stores%2C_Horton_in_Ribblesdale_-_geograph.org.uk_-_967215.jpg",
      "title": "John S Turner / Office Stores, Horton in Ribblesdale",
      "caption": "Office Stores. The village shop in Horton in Ribblesdale is no longer the post office, and post office facilities are now only available at The Crown Inn. However, the shop itself is still an important part of the community."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/%22Erratic%22_boulder_next_to_farmtrack_at_Winskill_Stones_-_geograph.org.uk_-_914832.jpg",
      "title": "Raymond Knapman / \"Erratic\" boulder next to farmtrack at Winskill Stones",
      "caption": "\"Erratic\" boulder next to farmtrack at Winskill Stones. This granite boulder has been left by the last ice age glacier,and probably from the Lake District or beyond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Limestone_pavement-Winskill_stones_-_geograph.org.uk_-_1125697.jpg",
      "title": "Tony  Mercer / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Limestone pavement-Winskill stones Clints and grykes. Pen-y-ghent in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Ash_tree_at_Winskill_Stones_-_geograph.org.uk_-_9249.jpg/256px-Ash_tree_at_Winskill_Stones_-_geograph.org.uk_-_9249.jpg",
      "title": "Graeme Churchard / Ash tree at Winskill Stones",
      "caption": "Ash tree at Winskill Stones. An ash tree growing on a limestone pavement"
    }
  ],
  "distance_km": 19.0,
  "description": "This pretty Yorkshire Dales village is a popular place for walkers. It is often used as the start point for the Yorkshire Three Peaks which includes Whernside, Ingleborough Mountain and Pen y ghent. The latter is particularly close to the village and many climbs begin from Horton, visiting the wonderul natural hole of Hull Pot on the way. This less strenuous walk from the village follows the River Ribble south to Stainforth and the Winskill Stones Nature Reserve. There's nice country views, riverside paths and some wonderful limestone scenery to enjoy. You'll also pass the village of Stainforth where a visit to the Stainforth Force waterfall is an option. Start the walk from the village and head east to meet with the Ribble Way. You can follow this waymarked trail south along the river to Stainforth and then up to the Winskill Stones. Here you'll find an amazing section of limestone pavement which is very popular with photographers. There's also fine views over the Dales from the elevated position of the reserve. After taking in the views the route returns to the village along the same paths.",
  "district": "Horton in Ribblesdale",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England"
}