{
  "created_at": "2025-01-05T23:23:45.339254+00:00",
  "objectID": "7e5ec6a2f05b9bc72bcc040093dc41ae",
  "ref": "uppermill-walking-route",
  "title": "Uppermill Canal and Country Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Uppermill_-_geograph.org.uk_-_2116.jpg",
  "nearby": [
    {
      "description": "Huddersfield Narrow Canal",
      "objectID": "cc37cb6f71f583b2bd8b68de491da756",
      "ref": "huddersfield-narrow-canal-walking-route"
    },
    {
      "description": "Dovestone Reservoir",
      "objectID": "0d7ed24d146072fbb560c097dec2d52d",
      "ref": "dovestone-reservoir-walking-route"
    },
    {
      "description": "Oldham Way",
      "objectID": "5aeb40c8128d72cea5b1bb1992a0b91d",
      "ref": "oldham-way-walking-route"
    },
    {
      "description": "Saddleworth Moor",
      "objectID": "f3b1481eabf73cec0272a4220d55b432",
      "ref": "saddleworth-moor-walking-route"
    },
    {
      "description": "Aldermans Hill",
      "objectID": "9b867fb34349aa7f83662a46da1706e4",
      "ref": "aldermans-hill-walking-route"
    },
    {
      "description": "Standedge Trail",
      "objectID": "9b6b2bda4fe179a707aba9a14eb7d27c",
      "ref": "standedge-trail-walking-route"
    },
    {
      "description": "Pots and Pans",
      "objectID": "5ff01f4ed8af3b123205c3fb2b938ed3",
      "ref": "pots-and-pans-walking-route"
    },
    {
      "description": "Diggle Canal Walk",
      "objectID": "e17f4f4710df0abdf9800375a1063efc",
      "ref": "diggle-canal-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7e5ec6a2f05b9bc72bcc040093dc41ae.gpx",
  "_geoloc": {
    "lat": 53.549493443,
    "lng": -2.0079219401
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Uppermill_-_geograph.org.uk_-_2116.jpg",
      "title": "David Stowell / Uppermill",
      "caption": "Newly re-opened Lock 21W on the Huddersfield Narrow Canal through Uppermill, in Greater Manchester, England. The restoration is so new that some of the ironwork is still in primer awaiting final painting!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Uppermill_Viaduct_-_geograph.org.uk_-_251677.jpg",
      "title": "Paul Anderson / Uppermill Viaduct",
      "caption": "Uppermill Viaduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Village_Green_Uppermill_-_geograph.org.uk_-_985897.jpg",
      "title": "Paul Anderson / Village Green Uppermill",
      "caption": "Village Green Uppermill. This row of old mill workers cottages in the centre of the village used to house the workers of the converted cotton mill nearby. For future referance one of the two bedroom cottages was on the market for £208,000 in March 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Saints_Cafe_Uppermill_-_geograph.org.uk_-_985929.jpg",
      "title": "Paul Anderson / Saints Cafe Uppermill",
      "caption": "Saints Cafe Uppermill. This old three storey mill workers cottage in the centre of the village. houses a hairdressers on the second floor and a cafe on the ground floor. The park to the left of the picture is the location of the annual Whit Friday Brass Band Contest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/High_Street_Uppermill_-_geograph.org.uk_-_811625.jpg",
      "title": "Paul Anderson / High Street Uppermill",
      "caption": "High Street Uppermill. Saddleworth Round Table's 35th Annual BeerWalk took place on Saturday 17th of May 2008. This is the scene on the High Street in the village as the entrants make their way on to the next village which is Dobcross. The Beer Walk involves walking around the villages of Saddleworth taking in the wonderful local scenery (and a certain amount of local refreshment.) This is traditionally done in Fancy Dress. This year over 1800 people took part with thousands more turning out to line the route and watch them with upwards of £50,000 being raised for various charities on this event alone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/High_Street_Bridge_Uppermill_-_geograph.org.uk_-_898854.jpg",
      "title": "Paul Anderson / High Street Bridge Uppermill",
      "caption": "High Street Bridge Uppermill. In April 2000 work started on the re-instatement of Wade Lock and High Street bridge. When the canal was originally built, the road twisted across a bridge here. When the canal was closed, the top of the bridge's arch was removed so that the road way could be straightened and flattened. Luckily the existing structure was in a good enough condition to be restored and used, saving a lot of construction time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Dovestones_Reservoir_-_geograph.org.uk_-_489653.jpg",
      "title": "Paul Anderson [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dovestones Reservoir. Located above the village of Greenfield Dovestones Reservoir was built in 1967 to supply drinking water for the Oldham area. Today the reservoir is quite a tourist attraction offering many walks amongst the picturesque surroundings of the Peak District National Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Court_Street_Uppermill_-_geograph.org.uk_-_1185741.jpg",
      "title": "Paul Anderson / Court Street Uppermill",
      "caption": "Court Street, in the centre of the village, leads up to the Civic Hall on Lee Street which is the building in the centre of the picture. The Civic Hall is a popular venue for various functions like weddings, 1940s dances and big name brass band evenings."
    }
  ],
  "distance_km": 16.4,
  "description": "The pretty village of Uppermill is in a lovely location on the Huddersfield Narrow Canal and the River Tame. It's also located close to the South Pennines and the Peak District making it an excellent base for walking. This circular walk around the village follows a section of the Huddersfield Narrow Canal before heading to the nearby Dovestone Reservoir on the waymarked Oldham Way. There's much to enjoy with easy waterside paths and some more challenging climbs with the reward of excellent views over the surrounding moors. The walk starts on the canal in Uppermill and follows the towpath south to Grasscroft with views of the River Tame on the way. Here you leave the canal and follow the Oldham Way and other paths east to visit the popular Dovestone Reservoir. You can follow the Oldham Way north along the eastern part of the reservoir before passing Aldermans Hill and heading across Brockley Moor. You then turn north along the western edge of Saddleworth Moor to Rocher Brow. Here you turn west to rejoin the canal at Uppermill.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Waggon Inn is a good choice for refreshments after your walk. This 19th Century coaching inn includes a comfortable lounge, bar and dining area with a good menu. There's also a lovely outdoor area where you can relax on warmer days. You can find it on the High Street with a postcode of OL3 6HR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and woods on the route make for a fine dog walk. The Waggon Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can extend the walk by heading north to Diggle where you can visit the Standedge Tunnel and pick up the Standedge Trail. The impressive Saddleworth Viaduct can also be seen in this area. The popular Pots and Pans Walk also starts nearby, visiting a series of rock formations and a fine viewpoint. For more walking ideas around Uppermill see the Greater Manchester Walks, South Pennines Walks and Peak District Walks pages."
    }
  ],
  "postcode": "OL3 6BS",
  "district": "Oldham",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "11, Kenworthy Gardens, Saddleworth, Uppermill, Oldham, Greater Manchester, England, OL3 6BS, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "moor"
  ],
  "points_of_interest": [
    "reservoir",
    "moor"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}