{
  "objectID": "7e87b379acd57c1bf49c0fda3d91970a",
  "created_at": "2024-12-18T10:32:11.520372+00:00",
  "ref": "trent-lock-walking-route",
  "title": "Trent Lock Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Erewash_Canal%2C_Trentlock_-_geograph.org.uk_-_763828.jpg",
  "nearby": [
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Erewash Canal",
      "objectID": "e5e398a58bcf54dce4342ad1064fb6a8",
      "ref": "erewash-canal-walking-and-cycle-route"
    },
    {
      "description": "Midshires Way",
      "objectID": "4efa64d62ebcd5313a1463ad7df62014",
      "ref": "midshires-way-walking-route"
    },
    {
      "description": "Shardlow",
      "objectID": "bcaa3341b63a7725287c094afb5a600d",
      "ref": "shardlow-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/8543D030BDC3EC02802584AB00512F38/$FILE/Trent Lock.gpx",
  "_geoloc": {
    "lat": 52.8766848107,
    "lng": -1.2739829889
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Erewash_Canal%2C_Trentlock_-_geograph.org.uk_-_763828.jpg",
      "title": "Stephen McKay / Erewash Canal, Trentlock, via Wikimedia Commons",
      "caption": "Trentlock. The river yacht and houseboats moored on the opposite bank are hardly typical of the canal network, but Trentlock is a place where river and canal craft mix. This is the attractive start of the almost 12-mile long Erewash Canal; much of the route runs through an urban and industrial landscape but it is nevertheless a fascinating waterway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Sawley_Marina_-_geograph.org.uk_-_585458.jpg",
      "title": "J147 / Sawley Marina, via Wikimedia Commons",
      "caption": "Sawley Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/River_Trent_near_Trent_Lock_-_geograph.org.uk_-_685849.jpg",
      "title": "Alan Murray-Rust / River Trent near Trent Lock, via Wikimedia Commons",
      "caption": "River Trent near Trent Lock. The south bank of the river is far less frequented than the northern, due to the lack of direct road access!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Houses_at_Trent_Lock_-_geograph.org.uk_-_7489.jpg",
      "title": "Chris J Dixon / Houses at Trent Lock, via Wikimedia Commons",
      "caption": "Houses at Trent Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/River_Trent%2C_Trent_Lock_-_geograph.org.uk_-_762297.jpg",
      "title": "Stephen McKay / River Trent, Trent Lock, via Wikimedia Commons",
      "caption": "River Trent at the lock. Looking upstream; the bridge marks the start of the Erewash Canal which will take boaters almost 12 miles up the Erewash Valley to Langley Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Trent_Lock_-_geograph.org.uk_-_762380.jpg",
      "title": "Stephen McKay / Trent Lock, via Wikimedia Commons",
      "caption": "The top gate of the southernmost of the 15 locks on the Erewash Canal between here and Langley Mill. Note the traditional-style narrowboats moored opposite."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/River_Trent_at_Trent_Lock_-_geograph.org.uk_-_3820.jpg",
      "title": "Martin Clark / River Trent at Trent Lock, via Wikimedia Commons",
      "caption": "River Trent at the lock. Looking south-west across the River Trent from Trent Lock towards the junction with the River Soar, with Ratcliffe-on-Soar power station behind the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Sawley_Marina_Bridge_-_geograph.org.uk_-_1103172.jpg",
      "title": "Andy Jamieson / Sawley Marina Bridge, via Wikimedia Commons",
      "caption": "Sawley Marina Bridge"
    }
  ],
  "distance_km": 13.0,
  "description": "This circular walk explores the countryside and waterways surrounding Trent Lock in Long Eaton . It's a significant location as the lock marks the point where the River Trent and River Soar meet with the beginning of the Erewash canal. It also sits on the border of three counties: Leicestershire, Nottinghamshire and Derbyshire. On the route you'll visit the Trent and Mersey Canal , Sawley Marina and the River Soar. The route runs for about 8 miles on a series of flat footpaths making it ideal for an easy afternoon stroll. Start the walk from the Trentlock car park at the end of Lock Lane, just to the south of Long Eaton town centre. From here you can pick up waterside footpaths heading west to Sawley Bridge Marina. The marina is notable as the largest Inland Marina in the United Kingdom with a water space of 23 acres. It's a lovely spot with lots of boats and a nice cafe where you could stop for some refreshments. The cafe has a good menu and outdoor seating with views of the marina. At the marina you can pick up the Midshires Way and follow it south east toward Ratcliffe on Soar. Here you can pick up a footpath running north along the River Soar. Follow this up to the canal and lock before turning south west to follow country paths back to the Midshires Way. You can then follow this back to Sawley Marina before heading east along the canal back to the car park. To continue your walking from the lock head north east along the river to visit the lovely Attenborough Nature Reserve where there a series of lakes and lots of wildlife to enjoy. The Beeston Canal can also be picked up at the eastern end of the reserve.  If you head west you can visit Shardlow where there's another pretty marina and a circular walk using the canal and the River Trent.",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}