{
  "created_at": "2025-01-06T03:01:35.207267+00:00",
  "objectID": "7eef735451490804669ebaaaf8442142",
  "ref": "stackpole-estate-walking-route",
  "title": "Stackpole Estate Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/da/Stackpole_-_geograph.org.uk_-_208744.jpg",
  "nearby": [
    {
      "description": "St Govan's Chapel",
      "objectID": "f760da5caaca6e86e3a0c9da50406fdc",
      "ref": "st-govans-chapel-walking-route"
    },
    {
      "description": "Pembrokeshire Coast Path",
      "objectID": "ad6d6081a04362874fc894b50c9a12b7",
      "ref": "pembrokeshire-coast-path-walking-route"
    },
    {
      "description": "Manorbier Castle",
      "objectID": "87ea1c50b633144e82842081a5c5d240",
      "ref": "manorbier-castle-walking-route"
    },
    {
      "description": "Bosherston to Barafundle Bay Walk",
      "objectID": "edfe85df94e93a64f17a8b267d072982",
      "ref": "bosherston-to-barafundle-bay-walk-walking-route"
    },
    {
      "description": "Manorbier to Freshwater East Walk",
      "objectID": "7d79fec4f51e527a21f8def0ddd3d4c4",
      "ref": "manorbier-to-freshwater-east-walk-walking-route"
    },
    {
      "description": "Freshwater West",
      "objectID": "41d68244ddc861dacf0570cd704aa129",
      "ref": "freshwater-west-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7eef735451490804669ebaaaf8442142.gpx",
  "_geoloc": {
    "lat": 51.6247719595,
    "lng": -4.9033626821
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Stackpole_-_geograph.org.uk_-_208744.jpg",
      "title": "Stephen McKay / Stackpole",
      "caption": "The village of Stackpole. Looking along the village street. Stackpole is not an anglicised Welsh name; South Pembrokeshire was settled by people of Flemish origin in the 12th century, and became known as 'Little England beyond Wales', with an English linguistic and cultural flavour which is still evident today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Stackpole_Quay_-_geograph.org.uk_-_1053359.jpg",
      "title": "Stephen McKay / Stackpole Quay",
      "caption": "View down to Stackpole Quay. Stackpole Quay dates from the 18th century when it was built to ship out limestone from a nearby quarry and to unload supplies for Stackpole Court, owned by the Earl of Cawdor. The Cawdor family moved away after the Second World War, and Stackpole Court itself was demolished in 1963, leaving this lonely harbour to a peaceful existence sheltering the odd fishing vessel. Here in the summer of 1972 it was the sort of 'off the beaten track' place that visitors could feel a sense of achievment in seeking out. All that has changed today; this is now part of the National Trust's Stackpole Estate, immensely popular with tourists. At least this ensures that the site is safe from inappropriate development, but some of the magic has been lost in the process."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Stackpole_Elidor_Church_-_geograph.org.uk_-_208258.jpg",
      "title": "Stephen McKay / Stackpole Elidor Church",
      "caption": "Elidor Church. Stackpole's church is located in the tiny hamlet of Stackpole Elidor, or Cheriton, a mile or so from Stackpole village. In spite of its remote location, it is well looked after."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Stack_near_Stackpole_Quay_-_geograph.org.uk_-_897783.jpg",
      "title": "Ruth Sharville / Stack near Stackpole Quay",
      "caption": "Sea stack near the quay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Sandy_bay_by_Stackpole_Warren._-_geograph.org.uk_-_113119.jpg",
      "title": "Colin Smith / Sandy bay by Stackpole Warren.",
      "caption": "Sandy bay by Stackpole Warren. Taken from the Pembrokeshire Coastal Path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Eight_arch_bridge_at_Stackpole_-_geograph.org.uk_-_189664.jpg",
      "title": "Duncan Gammon / Eight arch bridge at Stackpole",
      "caption": "Eight arch bridge at Stackpole"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Stackpole_Inn_-_geograph.org.uk_-_85079.jpg",
      "title": "Stephen Bashford / Stackpole Inn",
      "caption": "Stackpole Inn. An excellent pub, good food, good beer, friendly."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Near_the_Raming_Hole_to_the_west_of_Stackpole_Head_-_geograph.org.uk_-_24402.jpg",
      "title": "Alan Rolfe / Near the Raming Hole to the west of Stackpole Head",
      "caption": "Near the Raming Hole to the west of Stackpole Head"
    }
  ],
  "distance_km": 10.0,
  "description": "Explore the wonderful National Trust owned Stackpole Estate on this circular walk in the Pembrokeshire National Park. In the estate you'll find miles of coastal footpaths, woodland trails and waterside sections along the beautiful, large lake. Stackpole is located near Freshwater East on the Pembrokeshire Coast Path. There's 12 square kilometres to explore on a variety of good footpaths. This walk starts at the Stackpole Quay car park and takes you along the coast path to Stackpole Head with wonderful views of Barafundle Bay. You'll also pass the striking natural stone arches known as the Lattice Windows. The route then heads towards Bosherton passing the delightful Stackpole Warrens. This area of grassland is great for wildlife watching with butterflies and birds visiting the wildflower meadows in the summer months. At the little village of Bosherton you can enjoy refreshments at the pub and visit the fascinating Norman church of the late 13th century. From Bosherton you continue along the lovely Stackpole Lily Ponds. Look out for waterlilies in the summer and wildlife which includes the resident otters. The final section takes you along the deer park track, returning to the car park. If you'd like to continue your walking in this area then you could head along the coast to the fascinating, 13th century St Govan's Chapel .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the excellent Stackpole Inn for some post walk refreshments. The friendly inn has a good menu and a lovely garden area to sit out in on warmer days. It's also won many awards including The Best Food Experience Pembrokeshire 2019, and The Food, Drink and Hospitality Award 2019. You can find them at Jasons Corner with a postcode of SA71 5DF for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The estate is a splendid place for a dog walk so you will probably see plenty of other owners on a fine day. The Stackpole Inn mentioned above is also dog friendly in the bar area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east along the coast path you could pay a visit to Manorbier Castle. The historic Norman castle has some lovely gardens to explore. You can also pick up the Manorbier to Freshwater East Walk here. The Bosherston to Barafundle Bay Walk starts from the car park in the nearby little village. It will take you to the award winning beach at Barafundle before heading to St Govan's Chapel. There's then a fine old pub to visit in Bosherston at the end of the walk. Head west and you can visit Freshwater West where there's a lovely beach with sand dunes and rock pools. There's also a fine circular walk around Angle Bay and the village of Angle starting from here. For more walking ideas in the area see the Pembrokeshire Coast Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GnbfIfvvmDM",
  "postcode": "SA71 5LS",
  "county": "Pembrokeshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stackpole Quay, Stackpole Road, East Trewent, Stackpole and Castlemartin, Freshwater East, Pembrokeshire, Cymru / Wales, SA71 5LS, United Kingdom",
  "district": "Freshwater East",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "arch",
    "wildflower meadows",
    "chapel"
  ],
  "facilities": [
    "car park",
    "pub/cafe",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}