{
  "created_at": "2025-01-06T18:44:40.883291+00:00",
  "objectID": "7f22fd88f48bfead312e44a5870574b7",
  "ref": "poison-glen-donegal-walking-route",
  "title": "Poison Glen Donegal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Old_Dunlewy_Church_with_lough_beyond_-_geograph.org.uk_-_2546212.jpg?20210830124903",
  "nearby": [
    {
      "description": "Dungloe River Walk",
      "objectID": "ac7ed8192dc3f2e767ec3fa3b11be553",
      "ref": "dungloe-river-walk"
    },
    {
      "description": "Muckish Railway Walk",
      "objectID": "4e9418ce4fc0bba830a19e21e9987591",
      "ref": "muckish-railway-walk-walking-route"
    },
    {
      "description": "Donegal Boardwalk",
      "objectID": "3e52b36430df175b1a551d4e5904a58a",
      "ref": "donegal-boardwalk-walking-route"
    },
    {
      "description": "Glenveagh Bridle Path",
      "objectID": "f7076cd5d77af4d298ebd54959e975b1",
      "ref": "glenveagh-bridle-path-walking-route"
    },
    {
      "description": "Lough Salt",
      "objectID": "a2a7a430dd22249bd675a8702c4f635d",
      "ref": "lough-salt-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7f22fd88f48bfead312e44a5870574b7.gpx",
  "_geoloc": {
    "lat": 55.01977,
    "lng": -8.11346
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Old_Dunlewy_Church_with_lough_beyond_-_geograph.org.uk_-_2546212.jpg?20210830124903",
      "title": "Old Dunlewy Church with lough beyond by C Michael Hogan, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Old Dunlewy Church with lough beyond. The story of Dunlewey Church is indeed a touching one, tied to the deep love between James Russell and his wife, Jane. After marrying Jane Smith in 1825, James Russell amassed a fortune as a hop merchant in London. With their wealth, the couple purchased the Dunlewey estate in County Donegal, an area known for its stunning natural beauty, nestled between the wild Atlantic Ocean and the Derryveagh Mountains. Tragically, Jane passed away in 1843, and James was heartbroken. As a lasting tribute to his beloved wife, James commissioned the construction of a beautiful church on the estate. This church, known as the Dunlewey Church of Ireland, was completed in 1853. The building, made of locally sourced white marble and blue limestone, stands as a symbol of James's enduring love for Jane. The church, with its Gothic architecture, has become a landmark in the area, attracting visitors who come not only to admire its beauty but also to reflect on the touching story behind its creation. Although it is no longer in use as a place of worship, the church remains a poignant reminder of the great love between James and Jane Russell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Track_to_the_Poisoned_Glen_-_geograph.org.uk_-_396344.jpg?20110203193355",
      "title": "Chris Gunns / Track to the Poisoned Glen",
      "caption": "Track to the Poisoned Glen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Poison_Glen_-_View_of_arched_footbridge_and_mountains_-_geograph.org.uk_-_1189759.jpg?20110225213807",
      "title": "Joseph Mischyshyn / Poison Glen - View of arched footbridge & mountains",
      "caption": "View of arched footbridge. The Poisoned Glen is steeped in both myth and a bit of historical error. According to legend, this striking landscape was the site where the giant king Balor of Tory Island met his end. Balor, who had a deadly, poisonous eye, was slain by his grandson Lughaidh. As the story goes, the poison from Balor's eye spilled out, splitting the rocks and poisoning the glen, hence the name. However, the true origin of the name is less dramatic. The glen was originally intended to be called \"An Gleann Neamhe,\" meaning \"The Heavenly Glen.\" But when an English cartographer mapped the area, he made a mistake, writing it as \"An Gleann Neimhe,\" which translates to \"The Poisoned Glen.\" This cartographic error resulted in the eerie and ominous name the glen carries today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Poison_Glen_-_Mother_Nature_-_the_florist_-_geograph.org.uk_-_1189623.jpg?20110225213757",
      "title": "Joseph Mischyshyn / Poison Glen - Mother Nature - the florist",
      "caption": "Mother Nature - the florist. A wonderful display of flowers in the glen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Poison_Glen_-_Upstream_view_and_Gorse_from_footbridge_-_geograph.org.uk_-_1189808.jpg?20110225213805",
      "title": "Joseph Mischyshyn / Poison Glen - Upstream view & Gorse from footbridge",
      "caption": "Upstream view & Gorse from footbridge. As seen looking northeast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Poison_Glen_-_Rocks_and_heather_along_stream_at_bridge_-_geograph.org.uk_-_1189617.jpg?20110225213759",
      "title": "Joseph Mischyshyn / Poison Glen - Rocks & heather along stream at bridge",
      "caption": "Rocks and heather along stream at bridge. The Cronaniv Burn is a short watercourse located in County Donegal, Ireland. It originates in the Derryveagh Mountains, specifically from the southern end of the Poisoned Glen (Cró Nimhe in Irish), a glacial valley steeped in local mythology. The burn flows northwest through the middle of the Poisoned Glen, passing along the southern edge of the village of Dunlewey (Dún Lúiche in Irish), which lies at the base of Errigal (An Earagail), the highest peak in County Donegal. As it continues its course, the Cronaniv Burn eventually merges with the Devlin River (Abhainn Dhuibhlinne), just before the Devlin River enters Dunlewey Lough (Loch Dhún Lúiche). The burn's journey from the mountains to the lough is relatively short, but it plays a vital role in the hydrology of the area, contributing to the scenic beauty and natural ecosystem of the Poisoned Glen and its surroundings."
    }
  ],
  "distance_km": 1.6,
  "description": "This walk visits the beautiful Poison Glen in Dunlewey, County Donegal. The glen includes some stunning scenery with a pretty stream, an old arched footbridge, spectacular mountain views and some very special flora and fauna to see. The walk starts at the noteworthy Old Dunlewey Church near to the beautiful Dunlewey Lough. This historic ruin is located in a wonderful spot at the foot of Mount Errigal, the tallest of the Derryveagh Mountain range and the largest in Donegal. From the church you then follow quiet lanes south east to the glen where you can enjoy a peaceful stroll along the Cronaniv Burn. To continue your walking in the area head south west and try the the popular Dungloe River Walk with its delightful fairy woodland garden and views of Lough Dungloe.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north east you could try the Muckish Railway Walk near Falcarragh. This trail takes you along the old Letterkenny to Burtonport railway line in the Derryveagh Mountains. Near here you can also pick up the Donegal Boardwalk and enjoy a fine coastal walk along the lovely Sheephaven Bay. Near here there's more nice waterside paths along Lough Salt. You can also climb to Loughsalt mountain for some fine views over the lake and surrounding area. The glen is close to the stunning Glenveagh National Park where you could pick up the Glenveagh Bridle Path. The shared cycling and walking path will take you through the glen to the historic Glenveagh Castle where you can explore the beautiful gardens and learn about the castle's fascinating history."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xr5BAEFX92I?si=-lvmGDrnGOoqGcZx",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "The Wooden Bridge, Dún Lúiche, Dunlewy ED, Glenties Municipal District, County Donegal, Ulster, Éire / Ireland",
  "postcode": null,
  "district": null,
  "county": "County Donegal",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "natural scenery"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}