{
  "created_at": "2025-01-06T05:04:33.742799+00:00",
  "objectID": "7f350f5ea0f5c787abdfac6396931738",
  "ref": "sittingbourne-walking-route",
  "title": "Sittingbourne Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Milton_Creek_-_geograph.org.uk_-_646673.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7f350f5ea0f5c787abdfac6396931738.gpx",
  "_geoloc": {
    "lat": 51.3453670897,
    "lng": 0.7330421228
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Milton_Creek_-_geograph.org.uk_-_646673.jpg",
      "title": "Richard Dorrell / Milton Creek",
      "caption": "Milton Creek. Looking south from just beyond Kemsley Down station (Sittingbourne and Kemsley Light Railway). Once an important waterway, but now unused and probably unknown to most Sittingbourne residents. The water tower and buildings around it are at Sittingbourne Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Dolphin_Yard_Sailing_Barge_Museum%2C_Sittingbourne_-_geograph.org.uk_-_1214.jpg",
      "title": "Penny Mayes / Dolphin Yard Sailing Barge Museum, Sittingbourne",
      "caption": "Dolphin Yard Sailing Barge Museum. The site includes the original sail loft and forge which have been converted to a museum devoted to the history of the Thames Sailing Barge and the associated industries of brick and cement making which once sustained the local fleet of barges."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Church_Marshes_Country_Park_-_work_in_progress_-_geograph.org.uk_-_710844.jpg",
      "title": "Richard Dorrell / Church Marshes Country Park - work in progress",
      "caption": "Church Marshes Country Park in 2008. Now Milton Creek Country Park. The completed part of the groundwork comes to an abrupt halt at this point. The site was a former landfill tip which is being buried under a massive quantity of infill to create the country park. The church is Holy Trinity, Milton Regis."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Little_Murston_Nature_Reserve_-_geograph.org.uk_-_6550.jpg",
      "title": "Penny Mayes / Little Murston Nature Reserve",
      "caption": "Little Murston Nature Reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Fishing_pond_in_Church_Marshes_Country_Park_-_geograph.org.uk_-_710821.jpg",
      "title": "Richard Dorrell / Fishing pond in Church Marshes Country Park",
      "caption": "Fishing pond in Milton Creek Country Park. This pond existed long before the Country Park had been created. It was possibly originally a clay pit for the local brickworks. The pond has now been tidied up, with new paths and fishing access platforms. A permit is required to fish here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Across_Little_Muston_Nature_Reserve_-_geograph.org.uk_-_1073628.jpg",
      "title": "David Anstiss / Across Little Muston Nature Reserve",
      "caption": "Across Little Muston Nature Reserve. Near bridleway from Sittingbourne to Conyer. Kemsley Papermill in background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Wrecks_at_Elmley_Ferry_-_geograph.org.uk_-_1016626.jpg",
      "title": "pam fray / Wrecks at Elmley Ferry",
      "caption": "Wrecks at Elmley Ferry"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Light_railway_viaduct_and_steam_pipe%2C_Sittingbourne_-_geograph.org.uk_-_4976.jpg",
      "title": "Penny Mayes / Light railway viaduct and steam pipe, Sittingbourne",
      "caption": "Light railway viaduct and steam pipe. The light railway line was built to carry both raw materials and finished paper products between Bowater's paper mills at Sittingbourne and Kemsley. It runs on this low concrete viaduct which has been decaying steadily over the years. The railway line is kept open by a group of enthusiasts who run steam trains on it through the summer and have done a lot of work in recent years to maintain the viaduct."
    }
  ],
  "distance_km": 9.5,
  "description": "This Kentish town has some fine river and coastal walking to try nearby. This circular walk around Sittingbourne visits Milton Creek Country Park and Little Murston Nature Reserve on the Swale. Both of these scenic sites are easily reachable on foot from the town centre. The walk starts at the train station where you can pick up the Saxon Shore Way and follow the waymarked footpath north along the Milton Creek to Milton Creek Country Park. The 128 acre park includes some nice trails along the park's lakes and waterways. The route then crosses the creek and heads north along the Saxon Shore Way to Little Murston Nature Reserve. There's some pretty lakes and views of the Swale with lots of wildfowl to look out for in this area. At the reserve you can also pick up the River Swale Heritage Trail which can be followed east to Conyer. This route heads south along the Saxon Shore Way to return you to the town centre via Murston and Bayford.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Red Lion is a good choice for some post walk refreshment in the town. They do a find Sunday roast and have a nice outdoor area too. You can find them on the High Street at postcode ME10 4PB for your sat navs. The pub is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north across the Swale and you could explore the nearby Isle of Sheppey where there's some good coastal trails to try. If you continue east then you could visit Conyer Creek and Faversham where you can explore the Oare Marshes and pick up the Faversham to Whitstable Walk. For more walking ideas in the area see the Kent Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/i3zXd4nw_Wk",
  "postcode": "ME10 2GZ",
  "district": "Swale",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "4, B2006, Grove Park, Regent Quay, Sittingbourne, Swale, Kent, England, ME10 2GZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "nature reserve",
    "heritage trail"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}