{
  "objectID": "7f63fac511d4842245d8ede843141db9",
  "created_at": "2024-12-19T04:17:39.197480+00:00",
  "ref": "torwood-castle-and-tappoch-broch-walking-route",
  "title": "Torwood Castle, Tappoch Broch and Blue Pool Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Tappoch_Broch_-_eastern_side_-_geograph.org.uk_-_1024921.jpg?20110223154027",
  "nearby": [
    {
      "description": "Plean Country Park",
      "objectID": "822753c1cc2f183e96e57583afa3d6c5",
      "ref": "plean-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/CBEF40D1EC8D0B6286258BCC004263FC/$FILE/Torwood Castle and Tappoch Broch.gpx",
  "_geoloc": {
    "lat": 56.0448020234,
    "lng": -3.8669050813
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Tappoch_Broch_-_eastern_side_-_geograph.org.uk_-_1024921.jpg?20110223154027",
      "title": "Lairich Rig / Tappoch Broch - eastern side",
      "caption": "Brochs are usually found only in the north and west of Scotland, but Tappoch Broch is one of only a few southern examples. A number of interesting features can still be seen in the interior; this contrasts greatly with the outside of the broch, which simply presents the appearance of a large mound. This photo is a view of the eastern side of the broch, taken while standing on the northern part of the wall-head. A gap in the wall, just above and to the right of centre in this image, is one end of the passage that formed the main entrance of the broch. At the time of the first excavation, this passage had a double lintel; at the time of writing, only a single lintel stone remains. The features of this broch, as it might originally have appeared, are perhaps best exemplified in the exceptionally well-preserved Broch of Mousa. Another very fine example is Dùn Chàrlabhaig."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Tappoch_Broch_-_southern_side_-_geograph.org.uk_-_1024967.jpg?20110223154029",
      "title": "Lairich Rig / Tappoch Broch - southern side",
      "caption": "This photo was taken from within the central courtyard of the broch, and shows the inner wall on the southern side. The opening that can be seen here is not the main entrance, but leads, instead, to a stone stairway built within the structure of the walls. It is possible (by crouching down) to pass under the double lintel of the opening; the passage then turns sharply to the right (i.e., to the west), to follow the space between the outer and inner walls; it is within this space that the stone stairway is located."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Tappoch_Broch_-_northern_side_-_geograph.org.uk_-_1024931.jpg?20110223154028",
      "title": "Lairich Rig / Tappoch Broch - northern side",
      "caption": "The present photo shows the northern part of the circular wall, as seen from the southern side. When walking the portion of the wall-head shown in this photograph, one noticeable feature is an oval stone-lined pit, which I measured to be about 2.7m by 2.2m, set between the outer and inner walls of the broch. The pit is more noticeable from the adjacent parts of the wall-head, but its position can be seen in this photo as a green patch on top of the wall, near the right-hand edge of the photo. The pit is not mentioned in the account of the 1864 excavation of the broch, and so seems to have been the result of later interference with the remains, rather than being an original feature. In this connection, the book \"Archaeology Around Glasgow\" (Susan Hothersall), in its article on Torwood Broch, comments: \"In 1964, Dr Euan MacKie, an archaeologist with a special interest in the Iron Age, investigated what appeared to be an internal chamber within the north-east section of the broch wall, but concluded that it was a relatively recent structure built into the ruins\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/The_approach_to_Tappoch_Broch_-_geograph.org.uk_-_1024864.jpg?20110223155015",
      "title": "Lairich Rig / The approach to Tappoch Broch",
      "caption": "The approach to Tappoch Broch. The passageway that was the main entrance to this broch is located on its near side (the eastern side). As this view shows, the broch appears, from the outside, to be little more than a steep mound; however, the well-preserved interior retains many features of interest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Torwood_Blue_Pool_or_the_%27Blue_Water%27_-_geograph.org.uk_-_435943.jpg?20110204092324",
      "title": "Nigel J C Turnbull / Torwood Blue Pool or the ‘Blue Water’",
      "caption": "Torwood Blue Pool or the 'Blue Water'.  Known to locals as the Blue Pool or the Blue Water, this 6.1 metre (20 feet) internal diameter brick lined vertical shaft is 4 metres deep. Although the pool now looks black in colour and heavy with algal growth, it used to be the most amazing blue colour with water so clear you could see the bottom. It was like looking through a blue diamond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Tappoch_Broch_-_geograph.org.uk_-_2039288.jpg/512px-Tappoch_Broch_-_geograph.org.uk_-_2039288.jpg?20210522093125",
      "title": "Tappoch Broch by Texas Radio and The Big Beat, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tappoch Broch"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Torwood_Castle_-_geograph.org.uk_-_5746687.jpg/512px-Torwood_Castle_-_geograph.org.uk_-_5746687.jpg?20231116211703",
      "title": "Torwood Castle by Euan Nelson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Torwood Castle. Built in 1566 for Sir Alexander Forrester. The ruin was acquired in 1957 by Mr Gordon Millar. He spent the last forty years of his life working on his own to restore the stonework. In November 2002, Torwood Castle estate was given over to Torwood Castle Trust (a registered charity). Torwood Castle is a category \u0091A\u0092 listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Footpath_to_Torwood_-_geograph.org.uk_-_1588145.jpg?20110303235000",
      "title": "Lairich Rig / Footpath to Torwood",
      "caption": "Footpath to Torwood. Between the path and the dry-stone wall to its left, the course of a small stream can be seen."
    }
  ],
  "distance_km": 4.5,
  "description": "This circular walk visits Torwood Castle and the Iron Age Tappoch Broch near Falkirk in the Central Lowlands of Scotland. The two historic sites are located near to each other in Tor Wood. The walk additionally visits the photogenic Torwood Blue Pool. On the walk there's also some peaceful woodland trails and fine views over the surrounding countryside to enjoy. You can start the walk from the Glen Road where roadside parking is available. From here you follow footpaths south to the remains of Torwood Castle.  After exploring the 16th century ruins the route continues south west to the Blue Pool. The pool is a well known local beauty spot and can take on an amazing blue colour in the right conditions. The route then continues north east to visit Tappoch Broch. The remains of the Iron Age structure are well worth exploring with several walls and entrances remaining. To continue your walking in the area head north to visit Plean Country Park . The attractive park includes flower meadows, ponds, streams and the ruined 18th century Plean Country House.",
  "video_url": "https://www.youtube.com/embed/d8Hlv37rVDk?si=p_7D4AlHra4r8V4j",
  "district": "Torwood",
  "county": "Falkirk",
  "region": "Scotland",
  "country": "Scotland"
}