{
  "created_at": "2025-01-06T04:29:05.137478+00:00",
  "objectID": "7fdb366ec641dc5bed455232e6398ede",
  "ref": "hawes-walking-route",
  "title": "Hawes Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Hardraw_Force_%286257%29.jpg/512px-Hardraw_Force_%286257%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7fdb366ec641dc5bed455232e6398ede.gpx",
  "_geoloc": {
    "lat": 54.3039204898,
    "lng": -2.1950596859
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Hardraw_Force_%286257%29.jpg/512px-Hardraw_Force_%286257%29.jpg",
      "title": "Nilfanion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Hardraw Force 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Hardraw_Force_Yorkshire.JPG/512px-Hardraw_Force_Yorkshire.JPG",
      "title": "Wehha [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Hardraw Force 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Cotter_Force_-_geograph.org.uk_-_106869.jpg",
      "title": "Stephen Charles / Cotter Force, via Wikimedia Commons",
      "caption": "Cotter Force"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Aysgill_Force%2C_Gayle_Beck._-_geograph.org.uk_-_25978.jpg",
      "title": "Steve Partridge / Aysgill Force, Gayle Beck., via Wikimedia Commons",
      "caption": "Aysgill Force, Gayle Beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Hawes.jpg/512px-Hawes.jpg",
      "title": "Cyberdemon007 at en.wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Hawes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/River_Ure%2CHawes%2Cyorkshire_dales_-_panoramio.jpg",
      "title": "Paul Lakin [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "River Ure, Hawes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/St._Margaret%27s%2C_Hawes_-_geograph.org.uk_-_4157347.jpg/512px-St._Margaret%27s%2C_Hawes_-_geograph.org.uk_-_4157347.jpg",
      "title": "St. Margaret's, Hawes by Phil Platt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St. Margaret's, Hawes. The Grade II listed church dates back to 1851."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/View_north_down_Gayle_Lane%2C_Hawes_-_geograph.org.uk_-_3853741.jpg/512px-View_north_down_Gayle_Lane%2C_Hawes_-_geograph.org.uk_-_3853741.jpg",
      "title": "View north down Gayle Lane, Hawes by Robert Graham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View north down Gayle Lane"
    }
  ],
  "distance_km": 16.0,
  "description": "This circular walk around the market town of Hawes visits three lovely waterfalls and takes you through some beautiful Yorkshire countryside. The town is in a great location for walkers with the lovely scenery of the Yorkshire Dales and some good waymarked footpaths to follow. The walk makes use of the Pennine Way and other public footpaths to visit Hardraw Force, Cotter Force and Aysgill Force waterfalls. The 10 mile route starts in the centre of the town and heads north, crossing the River Ure, before climbing along Hardraw Beck to Hardraw Force Waterfall. The impressive waterfall is England's highest single drop waterfall, falling some 100ft. Access to the waterfall is through the 13th century Green Dragon Inn. The route then climbs west to Bluebell Hill, reaching a height of over 1000ft and providing great views over the surrounding area. From here you descend back to the River Ure, where you head west along the river to Cotterdale Beck and on to Cotter Force Waterfall. The falls are very pretty, comprising of six steps, each with its own small waterfall. From here you head back along the river to Appersett, where you follow the Widdale Beck towards Appersett Viaduct. The route then heads back towards Hawes where you can take a detour south along the Gayle Beck to visit Aysgill Force Waterfall. There's lots of other nice walks to try in the Hawes area. You could try the climb to the splendid Great Shunner Fell. The hill is the highest point in Wensleydale and can be climbed from the village of Hardraw which this walk visits. A few miles to the south east of the town you can visit the lovely Semer Water. The lake has a nice walking trail which visits Keld Scar Waterfall, Crooks Beck and Marsett Beck.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "This walk passes the Green Dragon Inn, the gateway to the splendid Hardraw Falls. The pub has an interesting history dating right back to the 13th century. Hardraw is old English for Shepherds dwelling, and the land once formed part of land owned by the Cistercian Monks, who settled here before moving to Jervaulx Abbey in lower Wensleydale. They kept a Grange at Hardraw and possibly a small chantry chapel.The pub has a good selection of beers and a good menu if you wish to dine.  Pictured above, the exterior and interior of the Green Dragon in Hardraw near Hawes. The lovely old unspoilt and unaltered interior has a wealth of period features including a cosy real fire. There's also a few tables outside if the weather is decent."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west you can try the Appersett Viaduct and the River Ure Walk. This visits the Victorian fiver arched railway viaduct which used to carry the Northallerton to Garsdale railway line over the Widdale Beck. Near Semer Water there's also the worthy village of Bainbridge. The village includes views of the River Bain and a 15th century hotel which is one of the oldest in Yorkshire. The circular Garsdale Walk starts from the nearby Garsdale train station on the Settle and Carlisle Line. It's a beautiful place with trails along the Grisedale Beck and more pretty waterfalls to see. The area lies just a few miles to the north west of Hawes. Near here there's also the noteworthy Uldale Force. This impressive waterfall is located in a striking limestone gorge on the River Rawthey. There's also a series of smaller waterfalls so the area is well worth a visit especially after rainfall. The Buttertubs Pass is located just north of the settlement. The road is one of the highest in the county and was used in the 2014 Tour de France as the second King of the Mountains climb. You could drive up to the top of the pass where there is a car park and viewpoint with a waterfall. For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ijBAO1PR414",
  "district": "Hawes",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Penn Lane, Gayle, Hawes, North Yorkshire, York and North Yorkshire, England, DL8 3QU, United Kingdom",
  "postcode": "DL8 3QU",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "waterfalls",
    "historical sites"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}