{
  "created_at": "2025-01-06T01:58:09.006995+00:00",
  "objectID": "7fdc6fb2f7fea331856378985222adb9",
  "ref": "rotherham-round-walk-walking-route",
  "title": "Rotherham Walks - Rotherham Round",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/28/Rotherham_town_centre_weir_on_the_River_Don_-_geograph.org.uk_-_684124.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/7/7fdc6fb2f7fea331856378985222adb9.gpx",
  "_geoloc": {
    "lat": 53.4292866702,
    "lng": -1.3553646906
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Rotherham_town_centre_weir_on_the_River_Don_-_geograph.org.uk_-_684124.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rotherham town centre. Weir on the River Don The bridge on the left going out of picture provides pedestrian access to Tesco's from the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Boston_Castle_-_Rotherham_-_geograph.org.uk_-_191088.jpg",
      "title": "Nikki Mahadevan / Boston Castle - Rotherham",
      "caption": "Boston Castle - Rotherham. The castle, built in 1775, was a hunting lodge owned by the Earl of Effingham. The Earl marked his objection to the harsh British treatment of the American colonies, by naming the lodge Boston Castle (after Boston, Massachusetts, the scene of the Boston Tea Party of 1775). He also banned tea drinking at the castle! The building has suffered badly from vandalism and is currently derelict. It stands on a hillside with fine views over the valley of the Rivers Don and Rother."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Blue_Man%27s_Bower_-_Rotherham_-_geograph.org.uk_-_180939.jpg",
      "title": "Nikki Mahadevan / Blue Man's Bower - Rotherham",
      "caption": "Blue Man's Bower - an area of flooded grassland in the town. It includes a moated, raised area which is a scheduled monument, first known record 1668. The \"ditch\" which the cows are grazing in, is part of the moat. Part of the raised area can be seen to the right of the picture. It is managed to prevent erosion by grazing livestock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Old_Sandstone_Quarry_in_Boston_Park_-_geograph.org.uk_-_191114.jpg",
      "title": "Nikki Mahadevan / Old Sandstone Quarry in Boston Park",
      "caption": "Old Sandstone Quarry in Boston Park. The park is located south of the town and another nice place for a stroll. Set into the face of this old sandstone quarry, is the 17th century doorway from a demolished Rotherham town building that incorporated the remains of the medieval College of Jesus founded by Thomas Rotherham in 1483 (centre of picture). The sandstone, known as Rotherham or Mexborough Red Rock, was extensively quarried in the area and is evident in many buildings in the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/River_Rother_and_flour_mills_-_geograph.org.uk_-_799469.jpg",
      "title": "Alan Murray-Rust / River Rother and flour mills",
      "caption": "River Rother and flour mills. The Rother has now only a few tens of metres to go before joining the Don. The flour mill clearly stands on the site of a historic water mill but there are now no signs of any weir that one would have expected to accompany it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Rotherham_Round_Walk_-_geograph.org.uk_-_799584.jpg",
      "title": "Alan Murray-Rust / Rotherham Round Walk",
      "caption": "On the Rotherham Round Walk. At this point the Round Walk leaves The Tops to join Back Lane towards Nether Haugh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/On_the_Rotherham_Round_Walk_%5E1_-_geograph.org.uk_-_772693.jpg",
      "title": "Steve F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hoober stand in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Wentworth_Woodhouse_-_geograph.org.uk_-_1039905.jpg",
      "title": "Garry Bonsall / Wentworth Woodhouse",
      "caption": "Wentworth Woodhouse.Home of the Earls Fitzwilliam. Facade blackened by smoke from factories during the industrial revolution. Wentworth lies on the Barnsley coal seam, mined by the Earls on their land and making them one of the richest British families in the 1900s. The wealth of the Fitzwilliam family is now managed by a trust, the last Earl left no heirs."
    }
  ],
  "distance_km": 40.0,
  "description": "This minster town in South Yorkshire is a fine place for walkers with a number of country parks, riverside trails, local reservoirs and some lovely waymarked footpaths to try. This is a circular walk through the countryside around the interesting Yorkshire town. The walk starts at All Saints' Parish Church in the town centre of Rotherham and circles the town on a series of footpaths and country lanes. Walk highlights include views of the River Don and the Grade I listed Wentworth Woodhouse Country House with its lovely 150 acre park. You'll also pass close to the lovely Ulley Reservoir Country Park and Treeton Dyke at the southern end of the route.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Cutlers Arms is a good choice for refreshment in the town. The building dates from 1825 and has recently been restored to its former Edwardian splendour. The pub includes a garden area for warmer days. You can find them at 29 Westgate with a postcode of S60 1BQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk. The Cutlers Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Boston Castle and Park is located to the south of the town. There are great views over the town from the elevated position of the castle. The site also includes beautiful gardens and Canklow Woods, an ancient woodland area. The area is a great place to continue your walking around Rotherham. You can find the park at 33 Boston Castle Grove with a postcode of S60 2BA."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1pExsdHl0Ns",
  "postcode": "S60 2DJ",
  "district": "Rotherham",
  "region": "South Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Renoirs & Rouge, 14, The Crofts, Moorgate, Rotherham, South Yorkshire, England, S60 2DJ, United Kingdom",
  "county": null,
  "state": "England"
}