{
  "created_at": "2025-01-06T09:01:07.851462+00:00",
  "objectID": "4002330bc537469f0c04b1c3d7837dca",
  "ref": "howden-20-walking-route",
  "title": "Howden 20 Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Howden_Minster_-_geograph.org.uk_-_472449.jpg/256px-Howden_Minster_-_geograph.org.uk_-_472449.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4002330bc537469f0c04b1c3d7837dca.gpx",
  "_geoloc": {
    "lat": 53.7453880544,
    "lng": -0.8650811023
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Howden_Minster_-_geograph.org.uk_-_472449.jpg/256px-Howden_Minster_-_geograph.org.uk_-_472449.jpg",
      "title": "Paul Glazzard / Howden Minster",
      "caption": "The impressive tower at Howden Minster, seen from the churchyard. The manor and church at Howden were gifted to William of Calais (Bishop of Durham) in 1080 A.D. The original Norman church was rebuilt during the 13th century in the Early English style and again in the Decorated style in the mid 14th century. After being subjected to the Dissolution of Collegiate Churches and Chantries in 1548 the buildings were not destroyed, although some parts were allowed to fall into disrepair as only the nave was used for services. The Parliamentarians are said to have used parts of the Minster as a stable during the English Civil War. The chancel roof collapsed in 1696 and the chapter house roof in 1750. The church was further damaged by a fire in 1932 apparently started by drunks attending the town's horse fair, and was restored once again in 1934. The chapter house received a new roof in 1984 and other ruined elements are now designated a safe ruin, preserved by the Department of the Environment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Howden_Marsh_-_geograph.org.uk_-_472851.jpg",
      "title": "Paul Glazzard / Howden Marsh",
      "caption": "Howden Marsh. The eastern end of the lake at Howden Marsh Nature Reserve. Seventeen acres of Howden Marsh have been leased by Howden Town Council from the local authority (now the East Riding of Yorkshire Council) since 1974. The site was designated a Local Nature Reserve in May 2002."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Pump_Brickyard_Farm_North_Howden.jpg",
      "title": "Paul Glazzard / Brickyard Farm, Howden",
      "caption": "Pump Brickyard Farm North Howden. This small 'windmill' was almost certainly a wind pump used to drain the former clay pits which are now fishing lakes. The clay would have been used for brick making for the local building industry, which is where Brickyard Farm gets its name. The pump is only about fifty metres east of Wood Lane and not where there is a windmill shown on the O/S maps."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Loftsome_Bridge_%28geograph_3435955%29.jpg/512px-Loftsome_Bridge_%28geograph_3435955%29.jpg",
      "title": "Chris Morgan / Loftsome Bridge",
      "caption": "Loftsome Bridge over the River Derwent, south of Wressle, East Riding of Yorkshire. Walkers can be seen on the grassy riverside path in the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/The_River_Ouse_-_geograph.org.uk_-_610549.jpg",
      "title": "Peter Church / The River Ouse",
      "caption": "The River Ouse, Boothferry. Looking west over a gate on the Trans Pennine Trail. Here the outflow at Knedlington Clough joins the River Ouse. The trail runs along the floodbank of the river. The gatepost sports signs for the Trans Pennine Trail, a public footpath, and the Howden Twenty."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/River_Derwent_near_Gunby%2C_East_Yorks._-_geograph.org.uk_-_807974.jpg",
      "title": "Peter Church / River Derwent near Gunby, East Yorks.",
      "caption": "River Derwent near Gunby. The river flows towards Gunby Ings, and away from the photographer. Footpaths run along this eastern side of the river at least as far as Bubwith, and with a junction taking you onto the Bubwith Rail Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Wressle_Castle_-_geograph.org.uk_-_616309.jpg",
      "title": "Paul Glazzard / Wressle Castle",
      "caption": "Wressle Castle. Looking north-northeast across the River Derwent at dusk. The Wressle Castle ruins were once part of a larger building begun in around 1380 by Sir Thomas Percy, brother of the Earl of Northumberland. Thomas Percy lost his head for siding with his brother Henry Percy who led a rebel army against King Henry IV at the Battle of Shrewsbury in 1403. The castle was later occupied by parliamentary forces during the English Civil War, and in 1648 they dismantled most of the building leaving two corner towers and one of the four ranges which connected them. What remained of the castle was occupied until 1796 when it was gutted by a fire. There is currently no general public access to Wressle Castle which is situated on a working farm owned by the Falkingham family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/River_Derwent%2C_South_Duffield_Ings_-_geograph.org.uk_-_616303.jpg",
      "title": "Paul Glazzard / River Derwent, South Duffield Ings",
      "caption": "River Derwent, South Duffield Ings, north of Wressle.. Looking east-southeast across the river from the embankment off the eastern end of Holmes House Lane, towards a pond on the west side of Breighton Road, Wressle."
    }
  ],
  "distance_km": 32.0,
  "description": "This 20 mile circular walk takes you on a tour of the countryside around the market town of Howden in Yorkshire. It starts and finishes in Howden next to the magnificent Howden Minster and follows the Rivers Ouse and Derwent through Boothferry, Wressle and Breighton. You then return to Howden along country lanes through Willitoft and Spaldington. You will also pass the interesting grade 1 listed Wressle Castle on the way. This is a fairly flat and easy walk with several long waterside sections to enjoy.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Howden you could head to neighbouring Goole and pick up the Trans Pennine Trail. The shared cycling and walking trail runs along the River Ouse before it joins with the River Humber near Brough. Around Bubwith you can link up with the Bubwith Rail Trail. This flat, easy path will take you along an old railway line toward Holme-on-Spalding-Moor and Market Weighton."
    }
  ],
  "video_url": "https://www.youtube.com/embed/z1-LWBlmeGY",
  "postcode": "DN14 7ST",
  "district": "Howden",
  "county": "East Riding of Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}