{
  "created_at": "2025-01-06T00:50:00.117696+00:00",
  "objectID": "40132143c3099b82275175b6a3e9d0f2",
  "ref": "burford-circular-walk-walking-route",
  "title": "Burford Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Ducks_at_Burford_-_geograph.org.uk_-_553931.jpg",
  "nearby": [
    {
      "description": "Minster Lovell",
      "objectID": "73c9fdc1338576853a99ecaf9621e434",
      "ref": "minster-lovell-walking-route"
    },
    {
      "description": "Donnington Way",
      "objectID": "007b2daae680c4496388eed789741431",
      "ref": "donnington-way-walking-route"
    },
    {
      "description": "Witney Circular Walk",
      "objectID": "de2dffdd3f11084fa24a5fb36eab5072",
      "ref": "witney-circular-walk-walking-route"
    },
    {
      "description": "Eastleach",
      "objectID": "96ef057d8655ba756dd8c6a2e836b9cb",
      "ref": "eastleach-walking-route"
    },
    {
      "description": "Southrop",
      "objectID": "fbb308c5a0e2908a1faf66bfc0ed9d63",
      "ref": "southrop-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/40132143c3099b82275175b6a3e9d0f2.gpx",
  "_geoloc": {
    "lat": 51.8084768133,
    "lng": -1.6331360836
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Ducks_at_Burford_-_geograph.org.uk_-_553931.jpg",
      "title": "David Stowell / Ducks at Burford",
      "caption": "The ducks on the mill leat beside the main public car park in Burford thrive on tidbits from the visitors. The name of the town is derived from the Old English words 'burh' meaning hilltown and 'ford',the crossing of a river. In 2009 thw town was ranked sixth in Forbes magazine's list of \"Europe's Most Idyllic Places To Live\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Warwick_Almshouses%2C_Burford_Geograph-1917948-by-wfmillar.jpg/512px-Warwick_Almshouses%2C_Burford_Geograph-1917948-by-wfmillar.jpg",
      "title": "wfmillar / Warwick Almshouses, Burford",
      "caption": "The old Warwick Street Almshouses. These photogenic almshouses were founded in 1457 by Henry Bishop of Burford. The inscription over the central doorway reads: \"These almshouses were founded by Richard Earl of Warwick in the year 1457 and were rebuilt in the year 1828.\" This is not entirely accurate as the buildings were licensed by the Earl of Warwick but founded by Henry Bishop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/The_Lamb_Inn%2C_Burford%2C_Oxfordshire-geograph-4017752-by-Des-Blenkinsopp.jpg/512px-The_Lamb_Inn%2C_Burford%2C_Oxfordshire-geograph-4017752-by-Des-Blenkinsopp.jpg",
      "title": "Des Blenkinsopp / The Lamb Inn, Burford",
      "caption": "The Lamb Inn, Burford. On Sheep Street, which seems appropriate. Head into the ancient inn for some well earned refreshments after the walk. They also provide good quality accommodation if you need to stay over."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/River_Windrush%2C_Burford_-_geograph.org.uk_-_233833.jpg",
      "title": "David Stowell / River Windrush, Burford",
      "caption": "River Windrush, Burford. The river is a lovely feature of the settlement. It is a tributary of the River Thames rising near Winchcombe and flowing south east for 40 miles to meet the Thames at Newbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/River_Windrush%2C_Swinbrook_-_geograph.org.uk_-_862910.jpg",
      "title": "Brian Robert Marshall / River Windrush, Swinbrook",
      "caption": "River Windrush, Swinbrook. The river is one of the many tributaries of the Thames. At Swinbrook it has more than one channel. This is the main flow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Swinbrook_-_geograph.org.uk_-_130772.jpg",
      "title": "David Hawgood / Swinbrook",
      "caption": "Swinbrook. View from the churchyard south to the Windrush"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Burford_Priory_%28geograph_4017764%29.jpg/512px-Burford_Priory_%28geograph_4017764%29.jpg",
      "title": "Des Blenkinsopp / Burford Priory",
      "caption": "Burford Priory. This noteworthy country house stands on the site of a 13th-century Augustinian priory hospital. The building dates from the 16th and 17th centuries and is Grade I listed. It is now a now a private dwelling."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/The_Tolsey%2C_Burford_%28geograph_4362347%29.jpg",
      "title": "Alex McGregor / The Tolsey, Burford",
      "caption": "The Tolsey. This is one of the more historically significant buildings in the town. The Tudor building dates back to 1520. It was formerly the market hall and town hall but is now used as a museum. There are interesting exhibitions detailing the history of the town."
    }
  ],
  "distance_km": 9.0,
  "description": "This circular walk explores the countryside and woodland surrounding the Oxfordshire town of Burford. The interesting medieval town is situated in the Cotswold Hills near to the Gloucestershire border. There are nice footpaths to follow along the River Windrush and then into the farmland and woodland above the town. There is a good sized parking area just of the High Street in the town from which you can start your walk. Nearby is the Grade II Listed Burford Methodist Church, built in the early 18th century. If you head east out of the town you can pick up a public footpath along the River Windrush to Widford. Here you turn north and cross the river and head to the pretty village of Swinbrook. The village includes the church of Saint Mary the Virgin which dates from about 1200. After visiting Swinbrook the walk passes the site of the medieval village of Widford. St Oswald's church in Widford is Early English Gothic and dates from the 13th century. Widford was a substantial village in the Middle Ages but only the 16th-century manor house and a few other houses remain today. The route heads north from Widford, visiting some small woodland areas before arriving at the village of Fulbrook with its Norman church. The final section returns you to the finish point at Burford. You can extend your walk by continuing east from Swinbrook to Minster Lovell. It's a nice stroll along the river with the option of exploring the atmospheric ruins of the 15th century Minster Lovell hall. Just to the west of Burford you can pick up the Donnington Way long distance footpath in Great Barrington. Also nearby is the attractive town of Witney where you can visit the pretty lake and Church Grenn on our Witney Circular Walk .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Lamb Inn is a good choice for some post walk refreshments. The historic inn dates all the way back to the 15th century and has a wonderfully cosy interior with exposed beams, a roaring fire and flagstone floors. Outside there's a delightful English country garden for summer days. You can find the inn on Sheep Street with a postcode of OX18 4LR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The village, river paths, woodland and countryside trails on this route are ideal for a dog walk. The Lamb Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One of the highlights of the area is located just a few miles south of the village at the Cotswold Wildlife Park and Gardens. The site covers 160 acres with beautiful parkland, a Victorian Manor House, a walled garden and a collection of mature trees. They also have a diverse range of animal species with exotic birds, zebras, lions and giraffes. It's located in Bradwell Grove just over 2 miles south of Burford at postcode OX18 4JP for your sat navs. To the south there's Eastleach where you can enjoy two noteworthy Norman churches and an ancient stone slab clapper footbridge over the River Leach. It's another picture postcard place known for its numerous historic buildings and a colourful display of daffodils in the spring. Lovely Southrop can also be visited in this area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/k6cUPqH-Um0",
  "postcode": "OX18 4SF",
  "district": "West Oxfordshire",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Guildenford Car Park, Guildenford, Burford, Fulbrook, West Oxfordshire, Oxfordshire, England, OX18 4SF, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical site",
    "church",
    "village"
  ],
  "facilities": [
    "car park",
    "church",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}