{
  "created_at": "2025-01-06T00:06:17.454465+00:00",
  "objectID": "4014c6f69680790b811289c26991c91d",
  "ref": "tunstall-forest-walking-and-cycle-route",
  "title": "Tunstall Forest Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Beech_pollards_in_Tunstall_Forest_-_geograph.org.uk_-_385302.jpg",
  "nearby": [
    {
      "description": "Orford Ness",
      "objectID": "d29ab9e294a7b037db4219c4c227d782",
      "ref": "orford-ness-walking-route"
    },
    {
      "description": "Rendlesham Forest",
      "objectID": "f312dc3de426e5ef5c4b568e53ee7437",
      "ref": "rendlesham-forest-walking-and-cycle-route"
    },
    {
      "description": "Suffolk Coast Path",
      "objectID": "0e29c3db92e53d17066c601df86904be",
      "ref": "suffolk-coast-path-walking-route"
    },
    {
      "description": "Iken Walk",
      "objectID": "f36a1844169e9a06ef3ab11275f00a14",
      "ref": "iken-walks"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4014c6f69680790b811289c26991c91d.gpx",
  "_geoloc": {
    "lat": 52.1506728121,
    "lng": 1.4783329821
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Beech_pollards_in_Tunstall_Forest_-_geograph.org.uk_-_385302.jpg",
      "title": "Simon Leatherdale / Beech pollards in Tunstall Forest, via Wikimedia Commons",
      "caption": "Beech pollards in Tunstall Forest. Veteran Beech pollards in \"six acre covert\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Deer_on_a_Forest_Track_in_Tunstall_Forest_-_geograph.org.uk_-_66477.jpg",
      "title": "Jon Hopkins / Deer on a Forest Track in Tunstall Forest, via Wikimedia Commons",
      "caption": "Deer on a Forest Track. The nice wide track is flanked by gorse bushes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Pond_-_Tunstall_Forest_-_geograph.org.uk_-_260949.jpg",
      "title": "Simon Leatherdale / Pond - Tunstall Forest, via Wikimedia Commons",
      "caption": "This pond in the forest is a good breeding site for Frog and Toad, the surrounding area is excellent for seeing Adders (the trees in the background are Corsican pines)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Crag_pit_-_Tunstall_Forest._-_geograph.org.uk_-_399417.jpg",
      "title": "Simon Leatherdale / Crag pit - Tunstall Forest., via Wikimedia Commons",
      "caption": "One of many crag pits that dot the landscape in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Tumulus_in_Tunstall_Forest_-_geograph.org.uk_-_420871.jpg",
      "title": "Simon Leatherdale / Tumulus in Tunstall Forest, via Wikimedia Commons",
      "caption": "Tumulus in the forest. This Bronze age tumulus (on the right) is set on top of a ridge with open views to the north and west and mature Scots Pine to the south west. The remainder of the vista is young (post '87 gale) pine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Woodlark_area_in_Tunstall_Forest._-_geograph.org.uk_-_420865.jpg",
      "title": "Simon Leatherdale / Woodlark area in Tunstall Forest., via Wikimedia Commons",
      "caption": "Woodlark area. This is one of several areas kept open in Tunstall forest SSSI to encourage Woodlark and Nightjar populations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Snape_Maltings_viewed_from_Tunstall_Forest._-_geograph.org.uk_-_1458845.jpg",
      "title": "John Goldsmith / Snape Maltings viewed from Tunstall Forest., via Wikimedia Commons",
      "caption": "Snape Maltings viewed from the firest. The maltings buildings, now a concert and shopping centre, are just visible to the left of the tree above the post. The photograph was taken from a footpath on the edge of the forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Veteran_Oaks_and_Bluebells_-_Tunstall_Forest_-_geograph.org.uk_-_260956.jpg",
      "title": "Simon Leatherdale / Veteran Oaks and Bluebells - Tunstall Forest, via Wikimedia Commons",
      "caption": "Nice view of some veteran Oaks and Bluebells amidst the conifers"
    }
  ],
  "distance_km": 16.5,
  "description": "This large forest in Suffolk has miles of good footpaths and a 10 mile red graded single-track mountain bike trail. The waymarked route is called the Viking Trail and is a narrow flowing singletrack running through the trees, with twists, berms and some short climbs. It's a fun ride and not too challenging though there are some technically tricky bits. The ride starts at the car park off Tunstall Road towards the northern end of the forest. This mountain bike route is designed for cyclists but walkers can easily pick up the forest footpaths from the same start location. You can walk down to Tunstall Common and then continue south to the little village of Chillesford for refreshments. From here you can pick up the Suffolk Coast Path to take you back into the forest and then head west to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise we'd recommend heading north from the forest to Snape Maltings for some refreshments. There's lots of good choices here with freshly prepared local food and cream teas to cafés overlooking the Alde estuary. In the village of Snape there is the noteworthy Golden Key public house. The pub is a relaxed cottage-style dining pub dating back to the 1600’s, just tucked away from the main road through the beautiful village. It's packed full of original character, beams, open fires and quirky details. You can find it in the village on Priory Road with a postcode of IP17 1SA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome at the forest and it's an excellent place to explore with them. You'll likely see other dog owners and you can let them off the lead as well."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you'd like to continue your exercise in the area then you could head to the nearby Rendlesham Forest where you'll find family cycle routes on flat well defined paths and quiet country lanes. For walkers there are also two way-marked trails of differing lengths. Just to the north of the reserve you will find the village of Snape and the interesting Snape Maltings. The expansive arts complex on the banks of the River Alde. The Maltings and the forest can also be reached on foot from nearby Saxmundham where there is a train station. You can follow the East Suffolk Line Walks south from the historic market town through the valley of the River Fromus. The Iken Walk can be picked up on the eastern side of the forest at the Iken Cliff car park. It will take you east along the river to visit the splendid old St Botolph's Church. The ancient place of worship includes a part thatched roof and an ancient nave dating back to the 12th century. Also nearby is the splendid Orford Ness Nature Reserve. The national trust owned reserve is located on a remote shingle spit by the River Ore and can be accessed by catching the National Trust ferry from Orford Quay. For more walking ideas in the area see the Suffolk Coast and Heaths and the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7HfFAAilR2o",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}