{
  "created_at": "2025-01-06T02:10:30.149724+00:00",
  "objectID": "40423006e031c70d6606e84cba05cffa",
  "ref": "uffington-white-horse-walking-route",
  "title": "Uffington White Horse Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0d/The_Uffington_White_Horse_-_geograph.org.uk_-_1369337.jpg",
  "nearby": [
    {
      "description": "The Ridgeway",
      "objectID": "67c8d0b4232ea41d6486cc873a66e477",
      "ref": "the-ridgeway-cycle-route"
    },
    {
      "description": "Wayland's Smithy",
      "objectID": "0621cec6237b6ae60200ea1b2bd4a708",
      "ref": "waylands-smithy-walking-route"
    },
    {
      "description": "Ashbury",
      "objectID": "bf249e16926212bc5fa57c05f92dc104",
      "ref": "ashbury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/40423006e031c70d6606e84cba05cffa.gpx",
  "_geoloc": {
    "lat": 51.5773603945,
    "lng": -1.5781415417
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/The_Uffington_White_Horse_-_geograph.org.uk_-_1369337.jpg",
      "title": "Philip Halling / The Uffington White Horse, via Wikimedia Commons",
      "caption": "The head and eye of the Uffington White Horse. There was some uncertainty as to the age of the figure, some thought it dated from the Bronze Age as its stylised shape is similar to those found on coins from the period whilst others thought it was Anglo-Saxon and dated from the time of King Alfred. Research has revealed that the figure dates back some 3,000 years to the late Bronze Age."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/The_Uffington_White_Horse_-_geograph.org.uk_-_1369349.jpg",
      "title": "Philip Halling / The Uffington White Horse, via Wikimedia Commons",
      "caption": "Head of the horse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/The_Eye_of_the_Uffington_White_Horse_-_geograph.org.uk_-_908841.jpg",
      "title": "clockworkpurple / The Eye of the Uffington White Horse, via Wikimedia Commons",
      "caption": "The Eye of the Uffington White Horse. Taken from just above the head of the White horse, with The Manger in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Earthworks_of_Uffington_Castle_-_geograph.org.uk_-_1370598.jpg",
      "title": "Philip Halling / Earthworks of Uffington Castle, via Wikimedia Commons",
      "caption": "Earthworks of Uffington Castle View to the south from the eastern earthworks of Uffington Castle which dates from the Iron Age and the year 300BC to 43AD."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Whitehorse_Hill_-_geograph.org.uk_-_292726.jpg",
      "title": "Andrew Smith / Whitehorse Hill, via Wikimedia Commons",
      "caption": "Whitehorse Hill top kite flying. Looking out across the Vale of White Horse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Uffington-White-Horse-sat.jpg",
      "title": "USGS [Public domain], via Wikimedia Commons",
      "caption": "Aerial satellite view of the Uffington White Horse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/The_Ridgeway%2C_Whitehorse_Hill_-_geograph.org.uk_-_647230.jpg",
      "title": "Andrew Smith / The Ridgeway, Whitehorse Hill, via Wikimedia Commons",
      "caption": "The Ridgeway National Trail on Whitehorse Hill. Chalk is very much in evidence here as the ancient highway passes a little to the south of the top of the hill. This is in contrast to many of the lower sections where mud is more in evidence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Sheep_on_Whitehorse_Hill_-_geograph.org.uk_-_292740.jpg",
      "title": "Andrew Smith / Sheep on Whitehorse Hill, via Wikimedia Commons",
      "caption": "Sheep on Whitehorse Hill"
    }
  ],
  "distance_km": 2.5,
  "description": "This short circular walk visits White Horse Hill and the Iron Age hillfort of Uffington Castle near Swindon. The area is historically significant with the 3000 year old prehistoric white horse hill figure and the hillfort located close together. The castle sits at a height of 860 feet (262m) above sea level making it the highest point in Oxfordshire. Also of interest is Dragon Hill, said to be the site where St. George slew the dragon. It's a very attractive area with chalk downland and lovely views over the Berkshire Downs. There is a White Horse Hill car park which gives direct access to the trail to the White Horse. Follow the trails south east and it will take you up to the hill top where there's grazing sheep, a trig point and wide ranging views across Vale of White Horse. If you would like to extend your walk you can continue west along the Ridgeway to Wayland's Smithy. This fascinating Neolithic long barrow is only about a mile from the hill. You could also head south and visit Ashdown House Estate. The National Trust owned estate has nice woodland walks and attractive grounds. If you are on a bike you can visit White Horse Hill from the Ridgeway which runs past the site.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head north from the hill into the village of Uffington for some post walk refreshments. The Fox & Hounds is a good option with a great menu and a nice outdoor seating area. The Pub has 4 Star B&B accommodation, a beamed bar, and unrivalled views of The Ridgeway and Uffington White Horse. It makes a great base for exploring this lovely area. You can find the pub in the centre of the village on the High Street, with a postcode of SN77RP for your sat navs.The interesting village also has some pretty thatched cottages and a noteworthy old church which dates from the 13th century. It also has strong literary connections as John Betjeman lived there in the 1930's and 40's, during which time he wrote many famous works. JRR Tolkein, while based in Oxford, visited this area, and it is said much of his inspiration for Middle Earth came from the Ridgeway nearby."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There are several other white horse figures in Britain but the Uffington Horse is by far the oldest and is of an entirely different design from the others inspired by it. The horse's origins were confirmed when silt removed from the horse's 'beak' was scientifically dated to the late Bronze Age, some time between 1380 and 550 BC. Iron Age coins that bear a representation of the White Horse have been found, supporting the early dating. The horse is thought to represent a tribal symbol perhaps connected with the builders of the adjacent Iron Age hillfort of Uffington Castle. Just to the west is the worthy village of Ashbury where you could visit The Rose and Crown. The inn includes a charming interior with a cosy fire while outside there's a lovely garden area for warmer weather. You can find them on the High Street at postcode SN6 8NA for your sat navs. The village is also a very pleasant place for a stroll with its quaint thatched cottages and fine old church."
    }
  ],
  "video_url": "https://www.youtube.com/embed/pBi7pzBZxrE",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dragon Hill Road, Woolstone, Vale of White Horse, Oxfordshire, England, SN7 7QH, United Kingdom",
  "postcode": "SN7 7QH",
  "district": "Vale of White Horse",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "chalk downland",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "trig point"
  ],
  "facilities": [
    "car park",
    "National Trust estate"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}