{
    "created_at": "2025-01-06T00:49:27.421461+00:00",
    "objectID": "409141b650142b9cd84f56c11c09309b",
    "ref": "bawsey-pits-walking-route",
    "title": "Bawsey Country Park Walks",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/42/Bawsey_Country_Park_-_geograph.org.uk_-_205474.jpg",
    "nearby": [
        {
            "description": "Roydon Common",
            "objectID": "98297160a7218ab00857bff2c07903e9",
            "ref": "roydon-common-walking-route"
        },
        {
            "description": "King's Lynn and The Walks",
            "objectID": "56652f8a61235771b1c5a95d57616747",
            "ref": "kings-lynn-and-the-walks-walking-route"
        },
        {
            "description": "Dersingham Bog",
            "objectID": "38b8ad630bfe6c864e0469c804ffe5f6",
            "ref": "dersingham-bog-walking-route"
        },
        {
            "description": "Pentney Lakes",
            "objectID": "7d87fa9f338021989c869697aba49b3e",
            "ref": "pentney-lakes-walking-route"
        },
        {
            "description": "Great Massingham",
            "objectID": "69cecf30872eea75e93e9df4cbb428ea",
            "ref": "great-massingham-walking-route"
        }
    ],
    "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/409141b650142b9cd84f56c11c09309b.gpx",
    "_geoloc": {
        "lat": 52.7500103725,
        "lng": 0.4810858928
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Bawsey_Country_Park_-_geograph.org.uk_-_205474.jpg",
            "title": "ray sullivan / Bawsey Country Park",
            "caption": "Expanse of sand on the edge of the lake betraying the origin of the lake's quarrying operation."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Bawsey_Country_Park_-_geograph.org.uk_-_205469.jpg",
            "title": "ray sullivan / Bawsey Country Park",
            "caption": "One of several lakes in the area created from disused sand pits/quarries. The local Kings Lynn golf club was nearby also, until moving around a similar time to the cessation of sand extraction. Now fishing & sailing take place."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/View_from_a_bridge_-_geograph.org.uk_-_1546727.jpg",
            "title": "Richard Humphrey / View from a bridge",
            "caption": "View from a bridge. The bridge I am standing on once crossed over a long forgotten railway line near Bawsey Country Park"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/On_the_edge_of_a_water-filled_quarry_pit_in_Seventy_Acre_Plantation_-_geograph.org.uk_-_1323668.jpg",
            "title": "Evelyn Simak / On the edge of a water-filled quarry pit in Seventy Acre Plantation",
            "caption": "On the edge of a water-filled quarry pit in Seventy Acre Plantation"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/The_ruined_church_of_St_James_in_Bawsey_%28geograph_1867285%29.jpg",
            "title": "Evelyn Simak / The ruined church of St James in Bawsey",
            "caption": "The ruined church of St James in Bawsey. If you follow footpaths north west from the park you can visit the ruins of this old church. The church was dedicated to St James and has been in ruins since at least 1745. Its distinctive remains will be familiar to anyone who has travelled the A149 towards Hunstanton, standing high on a hill at church farm. The building and its surrounding area were the subject of a live dig by the Time Team programme in 1998."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_deserted_village_of_Bawsey_%28geograph_1867278%29.jpg",
            "title": "Evelyn Simak / The deserted village of Bawsey",
            "caption": "The deserted village of Bawsey"
        }
    ],
    "distance_km": 3.0,
    "description": "This country park near King's Lynn has nice trails to follow around around birch covered hills and a Scandinavian style lake. It's a delightful spot with the lakes surrounded by attractive woodland and small cliffs. There's also little beaches and picnic areas. You can park at the car park at the north eastern end of the lake, off Gayton Road. From here you can pick up the trails to take you around the site. N.B Please do not swim in the waters of the lake. It may look tempting but several people have got into difficulty. To continue your walk you can head north and visit Roydon Common. The pretty nature reserve includes a large area of heathland and woodland with Dartmoor Ponies to look out for.",
    "details": [
        {
            "subtitle": "Pubs/Cafes",
            "content": "The Sandboy is conveniently located just to the north of the park. The old railway pub has a good menu and selection of drinks. They have a good sized garden area with views to the surrounding woodland as well. You can find them on Gayton Road with a postcode of PE32 1EP for your sat navs."
        },
        {
            "subtitle": "Dog Walking",
            "content": "The lake and woodland are ideal for dog walking so you'll probably bump into other owners with their pets on your visit. The Sandboy pub mentioned above is also dog friendly."
        },
        {
            "subtitle": "Further Information and Other Local Ideas",
            "content": "For more interesting local history head a couple of miles north of the park to visit Castle Rising. Here you'll find the ruins of an English Heritage owned castle surrounded by impressive earthworks. The pretty little village of the same name is also well worth exploring. A little further north you'll find Sandringham Country Park. The expansive park surrounds the Queen's famous country retreat. In the park you'll find miles of excellent woodland and parkland walking trails. On the western side of the estate there's also the interesting village of Wolferton. Here you can visit the noteworthy Wolferton Railway Station. The now disused station was well known during the 1800’s through its association with the Royal Family who used the station because of its proximity to Sandringham House. There are also trails to pick up around the Dersingham Bog Nature Reserve in this area. The reserve is part of the wider Sandringham Royal Estate and includes attractive heathland with interesting flora and fauna to see. A few miles to the south of the park is another of the historical highlights of the area at Castle Acre. Here you'll find the atmospheric ruins of and 11th century castle and priory. There's also some lovely waterside trails along the River Nar through the picture postcard village. The attractive village of Great Massingham and the historic Houghton Hall gardens can be found just to the north. A few miles due south of the park you'll find Shouldham Warren where there are two colour coded waymarked walks. The nature reserve includes beautiful pine woodlands and a fine Rhododendron Avenue. The associated village is also worth seeing with a pretty village green and a 14th century church to see. To the south there's the pretty Pentney Lakes and the walk to Shouldham Warren Nature Reserve. For more walking ideas around King's Lynn see the Norfolk Walks page."
        }
    ],
    "video_url": "https://www.youtube.com/embed/tPMTq-d8Jkc",
    "postcode": "PE32 1ER",
    "county": "Norfolk",
    "region": null,
    "country": "United Kingdom",
    "gazetteer_found": true,
    "nominatim_found": true,
    "display_address": "Gayton Road, Bawsey, Leziate, King's Lynn and West Norfolk, Norfolk, England, PE32 1ER, United Kingdom",
    "district": "King's Lynn and West Norfolk",
    "state": "England",
    "llama_cpp": true,
    "estimated_duration": "half day",
    "difficulty": "moderate",
    "terrain": ["woodland", "cliffs"],
    "points_of_interest": ["picnic area", "nature reserve"],
    "facilities": ["car park", "dog friendly"],
    "route_type": "circular",
    "activities": ["walking"]
}
