{
  "created_at": "2025-01-06T03:44:21.589327+00:00",
  "objectID": "40f47cba5f31251a38746d6f04a22323",
  "ref": "denham-country-park-walking-route",
  "title": "Denham Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Heron_sculpture%2C_Denham_Country_Park_-_geograph.org.uk_-_663787.jpg/256px-Heron_sculpture%2C_Denham_Country_Park_-_geograph.org.uk_-_663787.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/40f47cba5f31251a38746d6f04a22323.gpx",
  "_geoloc": {
    "lat": 51.5667341877,
    "lng": -0.4874684124
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Heron_sculpture%2C_Denham_Country_Park_-_geograph.org.uk_-_663787.jpg/256px-Heron_sculpture%2C_Denham_Country_Park_-_geograph.org.uk_-_663787.jpg",
      "title": "David Hawgood / Heron sculpture, Denham Country Park",
      "caption": "Heron sculpture, Denham Country Park. In the grounds of the Colne Valley Visitor Centre in Denham Country Park. The heron is the symbol of the Colne Valley Regional Park. The sculpture, unveiled in 2005, is six metres high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Woodland_in_Denham_Country_Park_-_geograph.org.uk_-_20114.jpg/256px-Woodland_in_Denham_Country_Park_-_geograph.org.uk_-_20114.jpg",
      "title": "David Hawgood / Woodland in Denham Country Park",
      "caption": "Woodland in Denham Country Park. Small patches of woodland in this area are the remnants of a forest which extended down to Windsor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/River_Misbourne_in_Denham_Country_Park_-_geograph.org.uk_-_854924.jpg",
      "title": "Nigel Cox / River Misbourne in Denham Country Park",
      "caption": "River Misbourne in Denham Country Park. The Misbourne is a chalk stream that rises northwest of Great Missenden in SP8902 and runs for about 23 kilometres, as the crow flies, before ending where it joins the River Colne in TQ0585. Here, only about 1 kilometre upstream of the confluence with the Colne, it is still very shallow. This view was taken from the Denham Court Drive bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Awkward_bridge_over_River_Colne_Denham_Country_Park_-_geograph.org.uk_-_29037.jpg",
      "title": "Jack Hill / Awkward bridge over River Colne Denham Country Park",
      "caption": "Awkward bridge over River Colne Denham Country Park. I wonder if this has been retained as an item of heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/The_Swan%2C_Village_Road%2C_Denham_-_geograph.org.uk_-_3340427.jpg",
      "title": "The Swan, Village Road, Denham by Alexander P Kapp, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Swan, Village Road, Denham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Denham_village_-_geograph.org.uk_-_3474322.jpg",
      "title": "Denham village by Rod Allday, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Denham village to the west of the park. Denham Film Studios were near the village and where famous films, including Brief Encounter and In Which We Serve were produced. The buildings were demolished in 1980 and the site re-landscaped as a business park and later as a site for luxury homes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Seating_area%2C_Denham_Country_Park_-_geograph.org.uk_-_4315695.jpg/512px-Seating_area%2C_Denham_Country_Park_-_geograph.org.uk_-_4315695.jpg",
      "title": "Seating area, Denham Country Park by Alan Hunt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sheltered Seating area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Path%2C_Denham_Country_Park_-_geograph.org.uk_-_4321204.jpg",
      "title": "Path, Denham Country Park by Robin Webster, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath in the summer."
    }
  ],
  "distance_km": 7.0,
  "description": "Enjoy waterside walking in this delightful park in Uxbridge. The rivers Colne and Misbourne and the Grand Union Canal pass through the park. There is a variety of wildlife, including herons, kingfishers and dragonflies. You will also find the useful Colne Valley Park Visitor Centre and cafe in the park. The route below starts and ends at the parking facility in the park but Denham rail station is less than a mile away so makes for a good access point. The excellent Colne Valley Trail also passes through the park so you could pick up this waymarked trail to extend your walking.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Denham village there's the Swan Inn for post walk refreshments. The pub serves good quality food and has a nice heated garden room. You can find them at postcode UB9 5BH. The village is a fine place for a stroll too with the 16th century Southlands Manor, a 14th century bakery and a church with Norman features to see. Uxbridge has an interesting history as the site of the attempted negotiations between King Charles I and the Parliamentary Army during the English Civil War. The public house at the centre of those events, since renamed the Crown & Treaty, still stands and is worthy of some investigation. The pub is Grade II* listed, and dates from 1576. There is even an album named after the pub by mercury prize nominated band Sweet Billy Pilgrim. The pub does very good food and also has a fine outdoor bar for the summer months. You can find the historic inn on Oxford Road at postcode UB8 1LU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails in the park are great for dog walking so you'll probably see other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The excellent Colne Valley Trail also passes through the park so you could pick up this waymarked trail to extend your walking. If you follow the trail north it will take you along a series of lakes towards Rickmansworth and Batchworth. Head south west and you will find two other fine parks in the shape of Black Park Country Park and Langley Park Country Park. There's miles of good cycling and walking trails through the woodland in these parks. The Celandine Route runs just to the east of the park. It will take you along the River Pinn from Pinner to Cowley. For more walking ideas in the area see the Buckinghamshire Walks and London Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/amg1JY3ODYs?si=QOES4W9W5U2c8o6A",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Denham Court Drive, Denham, Denham, Gerrards Cross and Chalfonts Community Board, Buckinghamshire, England, UB9 5AU, United Kingdom",
  "postcode": "UB9 5AU",
  "district": "Denham",
  "state": "England"
}