{
  "created_at": "2025-01-06T01:38:25.968324+00:00",
  "objectID": "416e092e3c67777693efdefbd8795fa5",
  "ref": "pulborough-walking-route",
  "title": "Pulborough Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Footpaths_to_Pulborough_-_geograph.org.uk_-_297256.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/416e092e3c67777693efdefbd8795fa5.gpx",
  "_geoloc": {
    "lat": 50.9557698119,
    "lng": -0.5020123195
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Footpaths_to_Pulborough_-_geograph.org.uk_-_297256.jpg",
      "title": "Simon Carey / Footpaths to Pulborough",
      "caption": "Following the course of both footpaths as they cross the flood plain of the Arun back towards Pulborough perched on higher ground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/River_Arun%2C_Lev%C3%A9e_south_of_Pulborough_-_geograph.org.uk_-_1507050.jpg",
      "title": "Nigel Cox / River Arun: Levée south of Pulborough",
      "caption": "River Arun: Levée south of Pulborough. The Arun is tidal along this reach and the water meadows on either side are protected from inundation by the levées on either side of the river. The RSPB Pulborough Brooks reserve is to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Pulborough_Brooks_-_geograph.org.uk_-_297262.jpg",
      "title": "Simon Carey / Pulborough Brooks",
      "caption": "View over Pulborough Brooks. Brooks is a Sussex term to describe the wetlands of a river's flood plain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/River_Arun_south_of_Pulborough_-_geograph.org.uk_-_1507070.jpg",
      "title": "Nigel Cox / River Arun south of Pulborough",
      "caption": "River Arun south of Pulborough. The Arun is tidal in this reach and about thirty metres wide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Pulborough_Brooks_RSPB_site_and_flood_meadow_-_geograph.org.uk_-_1507142.jpg",
      "title": "Nigel Cox / Pulborough Brooks RSPB site and flood meadow",
      "caption": "Pulborough Brooks RSPB site and flood meadow. This is the north-eastern corner of the Pulborough Brooks RSPB site which covers the flood plain on the east side of the River Arun here. It is grazed by cattle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/River_Stor_near_Pulborough_-_geograph.org.uk_-_1507026.jpg",
      "title": "Nigel Cox / River Stor near Pulborough",
      "caption": "River Stor near Pulborough. The River Stor is a tributary of the River Arun and flows into the latter just downstream of Pulborough. Because the Arun is tidal in this reach and because there are no structures on the Stor to control the flow of water the Stor itself is tidal here too. However there are large earth embankments on either side of the river here to constrain any high water levels."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/View_Across_Pulborough_Brooks_-_geograph.org.uk_-_297268.jpg",
      "title": "Simon Carey / View Across Pulborough Brooks",
      "caption": "View Across Pulborough Brooks. Taken from higher ground to the south east of the square which is RSPB land and contains a number of their hides. If you look closely you can see a golden line running through the middle of the brooks this is roughly the site of the Sussex Greensand Way a Roman road that ran from Stane Street east to Barcombe. It crossed the brooks by means of a causeway some of which still exists."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Rivermead%2C_Pulborough_-_geograph.org.uk_-_246017.jpg",
      "title": "Simon Carey / Rivermead, Pulborough",
      "caption": "Rivermead. The road overlooks the Pulborough Brooks and South Downs."
    }
  ],
  "distance_km": 5.3,
  "description": "This large village is located on the northern edge of the South Downs in the Horsham district of West Sussex. Near the village there's nice riverside walks along the River Arun, some pretty nature reserves and large woodland areas. This circular walk from the village visits the Pulborough Brooks Nature Reserve to the south of the village. Start the walk from the car park at the southern edge of the village. From here you can pick up footpaths heading south to the RSPB reserve where you'll find wetlands and nature trails. Look out for wildlife including Peregrine Falcon, Lapwing and Wigeon as you maked your way around the site. There's also some good views across the South Downs to enjoy from the paths. Follow the footpaths south and they will take you towards Wiggonholt. There's the option here of taking a detour south to visit Wiggonholt Common where there are some nice woodland trails. This walk heads north past Lickfold towards Marehill, before heading through the village to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The nature reserve includes its own RSPB cafe where you can stop for refreshments on the walk. In the village there's some good pubs including The White Horse on Mare Hill Road. They do good food and also have a fine terraced garden for warmer weather. It's a lovely place to sit out and enjoy views across the Brooks. You can find the pub at a postcode of RH20 2DY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The public footpaths around the reserve are good for dog walking. You cannot take your dog on the Wetland trail though. There's also some nice woodland trails through Northpark Wood on Wiggonholt Common. The RSPB cafe mentioned above is dog friendly with dogs allowed onto the tea terrace adjacent to the cafe."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Wey South Path can be picked up on the western side of the village. This waymarked, long distance footpath will take you south along the river Arun towards Amberley and the lovely Amberley Wild Brooks Nature Reserve. You'll also pass the village of Coldwaltham and the little nature reserve of Waltham Brooks on the path. Head south east from the town and you will soon come to the neighbouring town of Storrington. The picturesque little town has a pretty mill pond and good access to the South Downs which is located just to the south. The circular Storrington Walk takes you onto the downs, climbing to Kithurst Hill where there's fine views to the coast from the summit. Rackham Woods can be found just to south. The circular route also visits the viewpoint at Rackham Hill and the fascinating Iron Age Urnfields containing the cremated remains of prehistory people in clay pots.  For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SM9UA9Re7P8",
  "postcode": "RH20 2BF",
  "district": "Horsham",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pulborough Village Hall, Swan View, Pulborough, Marehill, Horsham, West Sussex, England, RH20 2BF, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "grassland"
  ],
  "points_of_interest": [
    "nature reserves",
    "wetlands",
    "nature trails",
    "views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}