{
  "created_at": "2025-01-06T01:48:46.136621+00:00",
  "objectID": "4177464e1cf9a8926d3800526af18249",
  "ref": "heydon-walking-route",
  "title": "Heydon Hall Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Village_green_%2C_Heydon_-_geograph.org.uk_-_302163.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4177464e1cf9a8926d3800526af18249.gpx",
  "_geoloc": {
    "lat": 52.8012735968,
    "lng": 1.1332837156
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Village_green_%2C_Heydon_-_geograph.org.uk_-_302163.jpg",
      "title": "Jurek and Trish Sienkiewicz / Village green, Heydon",
      "caption": "Village green. Heydon village is privately owned, belonging to the estate of the Bulwer Long family since 1640. There has been no new building in over 100 years, giving a feeling of \"stepping back in time\". It was created a conservation area in 1971 and has often been used as the set for TV and film productions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Gatehouse_cottages%2C_Heydon%2C_Norfolk_-_geograph.org.uk_-_2111671.jpg/512px-Gatehouse_cottages%2C_Heydon%2C_Norfolk_-_geograph.org.uk_-_2111671.jpg",
      "title": "Gatehouse cottages, Heydon, Norfolk by nick macneill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gatehouse cottages, Heydon, Norfolk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Heydon_Tea_Rooms_-_geograph.org.uk_-_3015350.jpg",
      "title": "Heydon Tea Rooms by Oliver Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Heydon Tea Rooms"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/The_site_of_a_medieval_village_-_partially_unearthed_-_geograph.org.uk_-_1303147.jpg",
      "title": "Evelyn Simak / The site of a medieval village - partially unearthed",
      "caption": "Park Lane. The site of a medieval village - partially unearthed. During recent earthworks - preparing for the laying of cables to connect with the proposed Sheringham Shoal offshore wind farm - workers exposed what is believed to be the remains of a medieval settlement, located in a field between the village of Heydon and the B1149, further to the east. Archaeologists were called in to document what will soon be destroyed. Trenches have been dug into the silt and peat layers which here underlay the topsoil, and to-date several medieval artefacts and coins have been unearthed. One artefact dating from prehistoric times has also been found, indicating that this site might have been populated a long time before the Middle Ages. This view was taken in southerly direction. The edge of Monson's Wood can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Monson%27s_Wood_-_geograph.org.uk_-_1303090.jpg",
      "title": "Evelyn Simak / Monson's Wood",
      "caption": "Monson's Wood. Approaching Monson's Wood on the unsurfaced road which links Park Farm > 1303131 with the B1149, further to the north. The view to the farm is obscured by the tall trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Heydon_Hall_-_geograph.org.uk_-_555336.jpg",
      "title": "David Williams / Heydon Hall",
      "caption": "Heydon Hall. This fine home was built in 1581 and despite some additions over the centuries it has now been restored to its original condition. It stands in its own grounds and the nearby village of Heydon is one of only 12 that are privately owned in the UK. It belongs to the Buler Long family who have been here since the 17th Century. No one will be surprised to know it is popular with film-makers who are looking for character locations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/St_Peter_%5E_St_Paul%2C_Heydon_-_geograph.org.uk_-_2592377.jpg/512px-St_Peter_%5E_St_Paul%2C_Heydon_-_geograph.org.uk_-_2592377.jpg",
      "title": "St Peter & St Paul, Heydon by John Salmon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Peter and St Paul church. A Grade I listed church dating back to the 1400s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Heydon_Hall_Lodges_%28east_entrance%29_-_geograph.org.uk_-_528382.jpg",
      "title": "Zorba the Geek / Heydon Hall Lodges (east entrance)",
      "caption": "Heydon Hall Lodges (east entrance). These lodges are right on the Norwich - Holt Road and presumably received visitors from London, unless they came through the village"
    }
  ],
  "distance_km": 4.0,
  "description": "This walk visits the delightful Norfolk village of Heydon. The pretty village includes the 16th century Heydon Hall Estate which is open to the public on certain days. There's nice footpaths to follow around the expansive estate or alternative public footpaths if the estate is closed. This circular walk starts from the village green and takes you through the village and around the perimeter of the estate. It's an attractive area which includes a 14th century church and a noteworthy 16th century pub. The area has often been used as a filming location including a Monty Python's Flying Circus sketch about village idiots.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the Earle Arms for some well earned refreshment. The historic pub dates back to the 1500s and has a charming old interior. You can find the inn next to the village green at postcode NR11 6AD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a fine dog walk though you asked to please keep them on leads in the Heydon Hall estate. The Earle Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east and there's one of the area highlights at Blickling Hall in Aylsham. Here you will find five thousand acres of parkland, farmland, lakes and woodland to explore on foot or by bike. You can also pick up the Weavers' Way long distance footpath in this area. To the north west of the Blickling Estate there's Mannington Hall and Gardens near Itteringham. The historic house is surrounded by lovely parkland with delightful gardens, woodland and a lake to see. The 18th century Wolterton Hall can also be visited in this area"
    }
  ],
  "video_url": "https://www.youtube.com/embed/oFORK6YuHzk",
  "postcode": "NR11 6RQ",
  "district": "Broadland",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Old School Cottage, The Street, Heydon, Broadland, Norfolk, England, NR11 6RQ, United Kingdom",
  "state": "England"
}