{
  "created_at": "2025-01-06T04:26:43.041016+00:00",
  "objectID": "41b4ef47ffdf9bb79af74d5afbe69524",
  "ref": "tunstall-reservoir-walking-and-cycle-route",
  "title": "Tunstall Reservoir Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Tunstall_Reservoir_-_geograph.org.uk_-_30837.jpg",
  "nearby": [
    {
      "description": "Wolsingham",
      "objectID": "9b480b80e6e474bba479f7f536c3479b",
      "ref": "wolsingham-walking-route"
    },
    {
      "description": "Weardale Way",
      "objectID": "ac14ee8f22194ccfbf6b9116bc1cfa09",
      "ref": "weardale-way-walking-route"
    },
    {
      "description": "Waskerley Way",
      "objectID": "29b8bb65cae9e91a5bd809abd7a210bc",
      "ref": "waskerley-way-walking-and-cycle-route"
    },
    {
      "description": "Allensford Country Park",
      "objectID": "42ae4679c50d9e252513fb41afd7a2ca",
      "ref": "allensford-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/41b4ef47ffdf9bb79af74d5afbe69524.gpx",
  "_geoloc": {
    "lat": 54.7618067139,
    "lng": -1.9029948049
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Tunstall_Reservoir_-_geograph.org.uk_-_30837.jpg",
      "title": "John Clive Nicholson [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Tunstall Reservoir. On the path from Salters Gate to Tunstall Reservoir. The reservoir was almost empty at the time. Photo taken in the autumn of 2003"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Tunstall_Reservoir_-_geograph.org.uk_-_549877.jpg",
      "title": "Peter McDermott / Tunstall Reservoir",
      "caption": "View of the valve tower"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tunstall_Reservoir_-_geograph.org.uk_-_521174.jpg",
      "title": "george hurrell / Tunstall Reservoir",
      "caption": "A summer view of the reservoir taken from the car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Geese_by_Tunstall_Reservoir_-_geograph.org.uk_-_322592.jpg",
      "title": "Oliver Dixon / Geese by Tunstall Reservoir",
      "caption": "Geese by Tunstall Reservoir. A wintery view taken in January 2007"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Tunstall_Reservoir%2C_-_the_Dam_-_geograph.org.uk_-_77807.jpg",
      "title": "Uncredited / Tunstall Reservoir, - the Dam",
      "caption": "Lovely green countryside surrounding the water and the dam. Seen from the Wolsingham to Tunstall footpath that runs up the East side of the Waskerley Beck. Taken in mid summer 2004"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Shoreline_at_Tunstall_Reservoir_-_geograph.org.uk_-_1326934.jpg",
      "title": "Roger Smith / Shoreline at Tunstall Reservoir",
      "caption": "Walkers amble along the shoreline in spring 2009"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Cattle_Grazing_between_Wolsingham_and_Tunstall_-_geograph.org.uk_-_77878.jpg",
      "title": "Uncredited / Cattle Grazing between Wolsingham and Tunstall",
      "caption": "Cattle Grazing between Wolsingham and Tunstall. The footpath between Wolsingham and the Tunstall Reservoir, at about the half-way point, goes straight through the centre of this field. At the time, a bull was in amongst the cows so we thought it best to forget the footpath and walk round the edge of the field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Information_board_Tunstall_Nature_Reserve_-_geograph.org.uk_-_1326938.jpg",
      "title": "Roger Smith / Information board Tunstall Nature Reserve",
      "caption": "Information board Tunstall Nature Reserve. It reads: \"Tunstall Reservoir is located within the North Pennines Area of Outstanding Beauty and its east shoreline lies within Backstone Bank and Raal Hill Site of Special Scientific interest. This quiet tract of wetland around the head of Tunstall Reservoir has been set aside for nature conservation and most of it can be seen from this viewpoint. The appearance of the wetland, which supports a number of damp-loving plant communities, changes according to season and to the fluctuations in the level of the reservoir.\""
    }
  ],
  "distance_km": 3.0,
  "description": "Follow the footpath around this pretty reservoir and nature reserve near Wolsingham in Country Durham. It's a lovely place for an easy stroll with species rich woodland on the eastern side of the reservoir and a nature reserve at the northern end. Look out for a variety of birdlife including Great rested grebe, tufted duck, goosander, moorhen, coot, mallard and common sandpiper. Butterflies are also common in the reserve. Keep your eyes peeled for admiral, small tortoiseshell, peacock and meadow brown. The whole of this circular route is designed for walkers but cyclists can enjoy the lovely country lane on the western side of the reservoir too. The trail runs for about 2 miles so will probably take around an hour to complete. There's a series of benches dotted around the site if you want to take the weight of your feet and enjoy the view. There's a small car parking area on the eastern side of the water on Leazes Lane. You can pick up the footpaths here and there's also a picnic area for some sandwiches after your walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Wolsingham and there's a number of good options for post walk refreshments. The Black Bull is located on the Market Place and does good food at reasonable prices. Outside there's a south facing garden area for finer days. They also have a few decent rooms if you need to stay over. You can find the inn at a postcode of DL13 3AB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir is a nice place for a dog walk and there's some good trails in the surrounding woods too. The Black Bull mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could start the walk from the nearby market town of Wolsingham if you prefer. There's a nice public footpath heading north from here along the Waskerley Beck. It's a scenic route with some attractive countryside and a nice way to reach the water if you have time. In Wolsingham you can also extend your walking in the area by picking up the waymarked Weardale Way. The trail will take you through the area along the River Wear to Stanhope if you follow it in a westerly direction. About a mile north of the reservoir you could pick up the Waskerley Way. The trail will take you to the nearby Smiddy Shaw Reservoir and Waskerley Reservoirs. A little further to the north there's Allensford Country Park to explore. There's nice riverside trails, a decent cafe and a lovely waterfall on the Wharnley Burn in this popular and picturesque park."
    }
  ],
  "video_url": "https://www.youtube.com/embed/fsOtHjMA8OY",
  "postcode": "DL13 3LX",
  "county": "County Durham",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Leazes Lane, Wolsingham, County Durham, North East, England, DL13 3LX, United Kingdom",
  "district": "Wolsingham",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1 hour",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "picnic area",
    "benches"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}