{
  "objectID": "41d8efa189cbc27d063501af109e3898",
  "created_at": "2024-12-19T03:55:17.809186+00:00",
  "ref": "bicester-walking-route",
  "title": "Bicester Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/91/The_River_Ray%2C_Bicester_-_geograph.org.uk_-_1415983.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/41d8efa189cbc27d063501af109e3898.gpx",
  "_geoloc": {
    "lat": 51.9047253362,
    "lng": -1.1275381719
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/The_River_Ray%2C_Bicester_-_geograph.org.uk_-_1415983.jpg",
      "title": "Kurt C / The River Ray, Bicester",
      "caption": "The River Ray. This interesting shot was taken at the junction of The Causeway with Chapel Street, in Bicester. The River Ray travels some distance underground beneath roads to emerge here. Eventually nearer to Oxford, it joins the Cherwell and the Thames. The recently vacant Old Chapel is visible in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Market_Square_-_Bicester_-_geograph.org.uk_-_1032144.jpg",
      "title": "Colin Babb / Market Square - Bicester",
      "caption": "Market Square"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Rectory_Place%2C_Bicester_-_geograph.org.uk_-_1416232.jpg",
      "title": "Kurt C / Rectory Place, Bicester",
      "caption": "Rectory Place. A lovely picture showing the often overlooked Rectory Place (including of course, The Rectory to St Edburg's Church), and to the right a section of Kings End. Kings End is the main one way road into The Causeway and the town centre. Two of Bicester's oldest pubs are shown here, The Swan and The Six Bells."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Bure_Park_%28actual_Park%29%2C_Bicester_-_geograph.org.uk_-_1416179.jpg",
      "title": "Kurt C / Bure Park (actual Park), Bicester",
      "caption": "This picture was taken from the very edge of Bure Park, the actual 'park' which was formerly open farmland back in the 1980's, rather than the adjacent residential estate of the same name! Here we also see the Chiltern Railway that splits Bicester in two. The train seen is heading left (East) into Bicester North Station. A popular for local folk to walk dogs!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/South_Bicester_and_Muswell_Hill_-_geograph.org.uk_-_1415597.jpg",
      "title": "Kurt C / South Bicester & Muswell Hill",
      "caption": "South Bicester & Muswell Hill. A long distance shot taken from Bicester North Rail Station, looking towards Muswell Hill, over southern Bicester. The main Bicester to Thame road is also clearly shown in the distance, winding up and then around the base of Muswell Hill. The famous Brill Hill and it's windmill, lurk behind this hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/The_King%27s_Arms_Hotel_-_Bicester_-_geograph.org.uk_-_1032131.jpg",
      "title": "Colin Babb / The King's Arms Hotel - Bicester",
      "caption": "The King's Arms Hotel, Market Square. The gable-fronted building immediately to the right is 39 Market Square, a late 16th- or early-17th century timber-framed shop and former house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/The_Old_Chapel%2C_Bicester_-_geograph.org.uk_-_1415972.jpg",
      "title": "Kurt C / The Old Chapel, Bicester",
      "caption": "Former Congregationalist Chapel, Chapel Street. It was built in 1728 and altered about 1840 and 1873. It is no longer a place of worship, and has since been a restaurant and a snooker club. It is now boarded up, but some original stained glass windows remain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/%27Town_Walk%27_Foot-Cycle_Path%2C_Bicester_-_geograph.org.uk_-_1416109.jpg",
      "title": "Kurt C / 'Town Walk' Foot/Cycle Path, Bicester",
      "caption": "'Town Walk' Foot/Cycle Path. A view of the combined foot and cycle path connecting north Bicester to the Town Centre. This time looking SW towards Withington Road and the town centre. It is fully fenced off in both directions and on both sides, and is approx 300 yards long. Although it has existed for many years, it has recently been named 'Town Walk', though many locals are indifferent to its name!"
    }
  ],
  "distance_km": 10.0,
  "description": "This walk from the Oxfordshire town of Bicester takes you through the countryside on the Cross Bucks Way visiting a series of pretty villages. You'll visit Marsh Gibbon and Poundon before finishing at Twyford where you can get the bus back to Bicester. There's much to enjoy as you make your way from Oxfordshire into Buckinghamshire and into the gently rolling agricultural landscape of Aylesbury Vale. You can pick up footpaths just east of the town centre that will take you through the countryside to the Cross Bucks Way. This long distance trail will take you to the Buckinghamshire village of Marsh Gibbon. Here you turn north towards Poundon, climbing to a height of over 300ft on Beacon Hill, where there are great views over Aylesbury Vale. The walk then descends into the village of Twyford where the route finishes. You can return to Bicester the same way or catch the bus back. The walk can be extended by continuing to Hillesden and Winslow .",
  "county": "Oxfordshire",
  "region": "South East",
  "country": "England"
}