{
  "objectID": "4200176be3bc0f504966e4405de833e9",
  "created_at": "2024-12-18T10:10:54.332632+00:00",
  "ref": "oxwich-to-port-eynon-walking-route",
  "title": "Oxwich to Port Eynon Coastal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/55/Oxwich_Bay%2C_from_near_St_Illtyd%27s_church_-_geograph.org.uk_-_47313.jpg",
  "nearby": [
    {
      "description": "Three Cliffs Bay",
      "objectID": "55dc69e0b8dec6ed32484cc1408678bd",
      "ref": "three-cliffs-bay-walking-route"
    },
    {
      "description": "Pennard Castle",
      "objectID": "1ff613659d385d1b03bc54cdab981f59",
      "ref": "pennard-castle-walking-route"
    },
    {
      "description": "Oxwich Bay Circular",
      "objectID": "eea739e0244ceef959db2404aff02586",
      "ref": "oxwich-bay-circular-walking-route"
    },
    {
      "description": "Rhossili Bay",
      "objectID": "0c940bb56a1bee9e7946898286eacf2d",
      "ref": "rhossili-bay-walking-route"
    },
    {
      "description": "Rhossili to Port Eynon Walk",
      "objectID": "0f095dd201e61823835dc91d48ad5ac7",
      "ref": "rhossili-to-port-eynon-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4200176be3bc0f504966e4405de833e9.gpx",
  "_geoloc": {
    "lat": 51.5571169656,
    "lng": -4.1644160518
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Oxwich_Bay%2C_from_near_St_Illtyd%27s_church_-_geograph.org.uk_-_47313.jpg",
      "title": "Pip Rolls / Oxwich Bay, from near St Illtyd's church",
      "caption": "Oxwich Bay, from near St Illtyd's church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/St_Illtyd%27s_Church%2C_Oxwich_-_geograph.org.uk_-_46956.jpg",
      "title": "Pip Rolls / St Illtyd's Church, Oxwich",
      "caption": "St Illtyd's Church, Oxwich. The Church was rebuilt by the sheep farming Cistercian monks in the late 12th century, and most of what we can see today dates back to this period."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Oxwich_Forest_-_geograph.org.uk_-_1511144.jpg",
      "title": "Kev Griffin / Oxwich Forest",
      "caption": "Oxwich Forest. Oxwich Bay has so many different habitats that it is one of the most diverse coastal areas in Britain. The beach, dunes, marshes and these woodlands teem with wildlife, particularly in the Spring and Summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Horses_at_Holy%27s_Wash%2C_Port-Eynon_Bay_-_geograph.org.uk_-_1512889.jpg/512px-Horses_at_Holy%27s_Wash%2C_Port-Eynon_Bay_-_geograph.org.uk_-_1512889.jpg",
      "title": "Kev Griffin / Horses at Holy's Wash, Port-Eynon Bay",
      "caption": "Horses at Holy's Wash, Port-Eynon Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Slade_Bay_%28The_Sands%29_-_geograph.org.uk_-_1512839.jpg",
      "title": "Kev Griffin / Slade Bay (The Sands)",
      "caption": "Slade Bay, otherwise known as 'The Sands', is a small stretch of sand surrounded by rocks. This area is surrounded by grazing fields at the top and cliffs that drop from the coastal path straight down onto the beach. It is possible to access this beach by walking from Slade village down through the grazing fields and connecting to the coastal path. It is also possible to walk here from the same coastal path that follows around from Oxwich on the west or Horton from the east. You will have to climb down from the coastal path and over some rocks to access the beach. Compared to other beaches in Gower, Slade is perhaps one of the most inaccessible but due to this reason, it also makes it one of the quieter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Horton%2C_Port_Eynon_Bay_-_geograph.org.uk_-_1512876.jpg",
      "title": "Kev Griffin / Horton, Port Eynon Bay",
      "caption": "Horton, Port Eynon Bay. Horton is a little village in South Gower, set on a steep hill that stretches down to the beach. It shares the bay with Port Eynon which is located at the Western end. Like many Gower villages its roots are mainly agricultural, but Horton also has a long connection with the lifeboat and Methodism."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Monument_atop_Port_Eynon_Point_-_geograph.org.uk_-_1522976.jpg",
      "title": "Kev Griffin / Monument atop Port Eynon Point",
      "caption": "Monument atop Port Eynon Point. There is a plaque on the other side of this monument which reads : THE GOWER SOCIETY HELPED TO PRESERVE THESE CLIFFS FOR THE NATION IN MEMORY OF GWENT JONES 1910-1962 STEPHEN LEE 1889-1962. The reserve at Port Eynon Point can be accessed from the footpath on the west side of Port Eynon beach. When the tide is out, it is possible to walk onto Port Eynon Point, likened to a lunar landscape. It is not advisable to bathe off Port Eynon Point. From here you can walk East to Port Eynon Bay or West, over the top of Port Eynon Point, and down to Overton Mere and Culver Hole."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Port_Eynon_Bay_-_geograph.org.uk_-_1512807.jpg",
      "title": "Kev Griffin / Port Eynon Bay",
      "caption": "Port Eynon, which can be seen in the far distance, is the most southerly point on Gower and is thought to be named after an Eleventh Century Welsh Prince, Eynon. It is believed that he built Port Eynon castle which has disappeared over the years. Once there was a booming trade in Oyster fishing, limestone quarrying, lobstering and crabbing, but as with many little ports also came reports of smuggling. At one stage, it is thought that eight excise men were stationed in the village alone."
    }
  ],
  "distance_km": 10.0,
  "description": "A lovely coastal walk from Oxwich to Port Eynon on the Gower coast. It's a splendid stretch of coast with gorgeous beaches and some excellent views from the high points on the trail. The walk starts from the car park at Oxwich where you can pick up the Wales Coast Path. Follow the trail south east and it will take past the 12th century St Illtyd's Church and Oxwich Wood to Oxwich Point. The route then heads west past Holy's Wash to The Sands (Slade Bay) and Horton, with wonderful views over Port Eynon Bay on the way. You head along the lovely beach towards Port Eynon Point before turning inland to pass Overton Mere. Shortly after the route finishes in the village of Port Eynon. It's a small village but there are good facilities with fish and chops and pubs for refreshment at the end of your walk.",
  "video_url": "https://www.youtube.com/embed/xIKzWKepTzs",
  "county": "Abertawe - Swansea",
  "region": "Wales",
  "country": "Wales"
}