{
  "created_at": "2025-01-06T02:21:04.672915+00:00",
  "objectID": "4240d95c911c09d76b51c8598e204156",
  "ref": "cadbury-castle-walking-route",
  "title": "Cadbury Castle Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4f/View_over_South_Cadbury_from_Cadbury_Castle._-_geograph.org.uk_-_1557670.jpg",
  "nearby": [
    {
      "description": "Leland Trail",
      "objectID": "69f155d0de56fd039f2b3816d30fa952",
      "ref": "leland-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4240d95c911c09d76b51c8598e204156.gpx",
  "_geoloc": {
    "lat": 51.0270631786,
    "lng": -2.5267117412
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/View_over_South_Cadbury_from_Cadbury_Castle._-_geograph.org.uk_-_1557670.jpg",
      "title": "Pam Goodey / View over South Cadbury from Cadbury Castle., via Wikimedia Commons",
      "caption": "View over South Cadbury from Cadbury Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Descent_from_Cadbury_Castle_-_geograph.org.uk_-_486294.jpg",
      "title": "Graham Horn / Descent from Cadbury Castle, via Wikimedia Commons",
      "caption": "Descent from the castle. The footpath descends from the edge of the ramparts of Cadbury Castle north-east back towards the village of South Cadbury. Access to the castle is free and there is a small car park nearby the bottom of this footpath. A wheelchair could probably be pushed up this path but it is quite steep and rutted in places."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Cadbury_Castle_-_geograph.org.uk_-_990888.jpg",
      "title": "Brian Roberts / Cadbury Castle, via Wikimedia Commons",
      "caption": "View of Cadbury Castle from Beacon Lane with Whitcombe farm in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Looking_NE_from_the_northern_slopes_of_Cadbury_Castle_-_geograph.org.uk_-_31195.jpg",
      "title": "john spivey / Looking NE from the northern slopes of Cadbury Castle, via Wikimedia Commons",
      "caption": "Looking NE from the northern slopes of the castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Ramparts_of_Cadbury_Castle_looking_south_-_geograph.org.uk_-_486319.jpg",
      "title": "Graham Horn / Ramparts of Cadbury Castle looking south, via Wikimedia Commons",
      "caption": "Ramparts of the Castle looking south. The western ramparts of Cadbury Castle, looking south towards Parrock Hill and Corton Ridge. There is a double set of ramparts, with this moat between them, encircling the hilltop, with just one access point at the north-east corner."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/The_Camelot%2C_South_Cadbury_-_geograph.org.uk_-_486269.jpg",
      "title": "Graham Horn / The Camelot, South Cadbury, via Wikimedia Commons",
      "caption": "The Camelot, South Cadbury. Formerly the Red Lion, and renamed to attract the visitors to the castle, which has a cryptic message on descent inviting people to find out more in the pub."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Cadbury_Castle%2C_Somerset_-_geograph.org.uk_-_2717.jpg",
      "title": "Paul Dixon / Cadbury Castle, Somerset",
      "caption": "From the Neolithic Age (3000BC) to the early 11th century, the fortress of Cadbury was in turn a military stronghold, centre of trade and culture, and probably the focus of a religious cult; by the early 16th century folklore identified with the Camelot of Arthurian romance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Looking_down_on_Sutton_Montis_-_geograph.org.uk_-_486311.jpg",
      "title": "Graham Horn / Looking down on Sutton Montis",
      "caption": "Looking down on Sutton Montis. As the defenders of the castle would have done, although obviously the village did not exist when the castle was built on this hill top in the iron age. Its defensive properties can be well seen here though."
    }
  ],
  "distance_km": 1.5,
  "description": "Climb to this Iron Age hillfort on Cadbury Hill on this short walk in Somerset. The hill is thought to be the site of King Arthur's Camelot and has a fascinating history. From the high points there are wonderful views over the surrounding Somerset countryside. You can start the walk from the car park just off Chruch Lane to the east of the hill. You then pick up the footpath on Castle Lane to take you up and around the ramparts of the hill fort. It's a splendid spot with far reaching views over the beautiful woodland and countryside below. The hill is on the Leland Trail long distance footpath so you have the option of starting your walk from the village of North Cadbury and heading south along the trail to visit the castle. You could also extend your walk by heading west through the countryside to Queen Camel. You can visit the hill by bike by cycling along National Cycle Network route 266 from Castle Cary or along route 26 from Sherborne.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Camelot in South Cadbury for some refreshments after your walk. It's very conveniently located just a short stroll from the base of the hill. The walls of the pub are even covered with information relating to the history of the castle site. There's a good menu and a lovely garden area to relax in on warmer days. You can find it in the village on Chapel Rd, with a postcode of BA22 7EX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill is a nice place to give your dog some air and the Camelot pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The larger village of North Cadbury is located just to the north of the site. You can follow waymarked trails north to visit the pretty village if you have time. The Castle Cary Walk takes you to the hill fort from the nearby town. It follows the epic Macmillan Way south for just over 5 miles to the site. The town has a train station so it's a nice way of visiting the fort by public transport. Castle Cary is also well worth exploring with some interesting old buildings including a 15th century pub. Head south and there's the pretty village of Corton Denham. As an alternative you could start your walk from here and follow the Monarch's Way north to the site. The village has a good 18th century inn for post walk refreshment or overnight accommodation. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/D00MuVdnttE",
  "district": "South Cadbury",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Castle Lane, South Cadbury and Sutton Montis, South Cadbury, Somerset, England, BA22 7HA, United Kingdom",
  "postcode": "BA22 7HA",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "countryside"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}