{
  "created_at": "2025-01-06T09:13:26.632442+00:00",
  "objectID": "4255679db0e37f4767c6e0cd3dfd1f27",
  "ref": "tyneham-walking-route",
  "title": "Tyneham Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Tyneham_Farm_-_geograph.org.uk_-_645510.jpg",
  "nearby": [
    {
      "description": "Lulworth Range Walks",
      "objectID": "d1c3c67519dae8ca6c20e116a252abb3",
      "ref": "lulworth-range-walks-walking-route"
    },
    {
      "description": "Corfe Castle",
      "objectID": "a41a4f07c0e3e0ab6661161546ce00bf",
      "ref": "corfe-castle-walking-route"
    },
    {
      "description": "Kimmeridge Bay",
      "objectID": "8bf494265d0239bbd58479ec4d6f762c",
      "ref": "kimmeridge-bay-to-chapmans-pool-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Lulworth Cove to Osmington Mills Coastal Walk",
      "objectID": "2ce78bd4a80f7f4211fb17b1f55cd7ae",
      "ref": "lulworth-cove-to-osmington-mills-coastal-walk-walking-route"
    },
    {
      "description": "Winfrith Newburgh",
      "objectID": "6c814cd6b82dba041eeb0bfb7a346691",
      "ref": "winfrith-newburgh-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4255679db0e37f4767c6e0cd3dfd1f27.gpx",
  "_geoloc": {
    "lat": 50.6219394281,
    "lng": -2.1686196186
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Tyneham_Farm_-_geograph.org.uk_-_645510.jpg",
      "title": "Jim Champion / Tyneham Farm",
      "caption": "Tyneham Farm. The buildings here are those of Tyneham Farm, viewed from the footpath up to the top of Gad Cliff. Povington Hill is in the background, part of the chalk ridge that forms the spine of the Purbeck Hills. This area was commandeered by the War Office in December 1943, and is still used as a firing range. This farm operates within the constraints of a live firing range. Public access is only possible along the Range Walks when the range is not active."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Donation_cairn_at_Tyneham_Farm_-_geograph.org.uk_-_1632878.jpg/256px-Donation_cairn_at_Tyneham_Farm_-_geograph.org.uk_-_1632878.jpg",
      "title": "Phil Champion / Donation cairn at Tyneham Farm",
      "caption": "Donation cairn at Tyneham Farm. The project to restore the farm at Tyneham, and the village in general is reliant on modest car parking charges and donations from members of the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/The_Pond_Yard_-_geograph.org.uk_-_1632876.jpg",
      "title": "Phil Champion / The Pond Yard",
      "caption": "The Pond Yard. This cobbled yard area at the farm may have been used for washing carts or dipping sheep. The surface was uncovered as part of the restoration of the farm, which has not been occupied since the whole area was requisitioned by the War Office in 1943."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Ruined_cottage%2C_Tyneham_-_geograph.org.uk_-_319298.jpg/256px-Ruined_cottage%2C_Tyneham_-_geograph.org.uk_-_319298.jpg",
      "title": "Jim Champion / Ruined cottage, Tyneham",
      "caption": "Ruined cottage. This cottage is in the terrace to the south of St Mary's Church. The occupants of the house were evacuated from the village in 1943, along with the rest of the villagers, when the area was included in an extension of the ranges attached to Lulworth Camp. After the war the range was kept open and the villagers could not return. The building has been 'made safe' so that the public can go inside when the village is open."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Cottages_and_church%2C_Tyneham_-_geograph.org.uk_-_319282.jpg/256px-Cottages_and_church%2C_Tyneham_-_geograph.org.uk_-_319282.jpg",
      "title": "Jim Champion / Cottages and church, Tyneham",
      "caption": "Cottages and church. On the left is a terrace of ruined cottages, in the sunlight the south transept of St Mary's Church (not ruined). The village was commandeered by the Army during the Second World War when the area was first used as a firing range. The church and school have recently been restored, and some of the ruined cottages stabilised, so that the public can visit when the ranges are closed (most weekends and public holidays)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Water_Fountain%2C_Tyneham_-_geograph.org.uk_-_319252.jpg/256px-Water_Fountain%2C_Tyneham_-_geograph.org.uk_-_319252.jpg",
      "title": "Jim Champion / Water Fountain, Tyneham",
      "caption": "Water Fountain. This fountain, bearing the date 1853, has a common drinking water-themed inscription from the bible - \"Whosoever drinketh of this water shall thirst again: but whosoever drinketh of the water that I shall give him shall never thirst; but the water that I shall give him shall be in him a well of water springing up into ever lasting life.\" The modern sign to the left of the tap reads \"Do not drink\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/St_Mary%27s_Church%2C_Tyneham_-_geograph.org.uk_-_319276.jpg",
      "title": "Jim Champion / St Mary's Church, Tyneham",
      "caption": "St Mary's Church. The church at Tyneham is a small cruciform-plan building with walls of limestone rubble. The north transept and parts of the nave are medieval, dating from the 13th century, while the south transept was rebuilt in the mid 19th century by the Reverend William Bond and contains several monuments to the Bond family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/View_along_the_Ridge%2C_Tyneham_Cap_-_geograph.org.uk_-_695854.jpg",
      "title": "Jim Champion / View along the Ridge, Tyneham Cap",
      "caption": "View along the Ridge, Tyneham Cap. This drystone wall follows the top of the Purbeck limestone ridge, with one of the Lulworth Range Walks following it on the southern (right) side. In the far distance is the Purbeck Hills chalk ridge, and the ruins of Corfe Castle are just about visible through the haze."
    }
  ],
  "distance_km": 8.0,
  "description": "This walk visits a fascinating abandoned village on the Dorset coast. The village was deserted during the second world war when all the residents were told to leave so the area could be used for military training. Tyneham is part of the Lulworth Range Walks an area still owned and used by the military. It is only open at certain times - please see the link below for more details. This circular walk takes you around the village before visiting the viewpoints at Povington Hill and Tyneham Cap. The walk starts from the free public car park in the village at a postcode of BH20 5DE for your sat navs. From here you can pick up footpaths heading north through the village to the quarry near Whiteway Hill. Turn east and the footpaths will take you up to Povington Hill where there is a picnic area and fine viewpoint to the coast. The route continues east to West Creech Hill before before following country lanes and bridleways south. The route then turns west to climb up to Tyneham Cap where there are more great views. Shortly after you turn north to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the north west of the site you'll find the village of East Lulworth. Here you can enjoy some post walk refreshments at The Weld Arms. The 17th century inn has a very good menu and a lovely large garden area for warmer days. You can find them at postcode BH20 5QQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The village and the cliff top paths are a fine place for a bracing dog walk. You can also stroll down to the beach where your dog can enjoy a dip. The Weld Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative route try the Lulworth Range which starts from the same car park and visits Flower's Barrow, Worbarrow Tout and Gold Down. The south eastern tip of this route passes close to the village of Kimmeridge where you can pick up the Kimmeridge Bay Walk. There is a marine wildlife reserve here with lots of intersting creatures to look out for in the rock pools. Head a few miles to the west and you could visit the historic Lulworth Castle. The castle dates back to the 17th Century and includes some beautiful grounds and gardens. Near here there's the Winfrith Newburgh Heath and Tadnoll Nature Reserves. The reserves include miles of peaceful heathland trails with lots of wildlife and a splendid viewpoint. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4SVL-JdY8_s",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Tyneham, Tyneham Range Walks, Steeple with Tyneham, Dorset, England, BH20 5QF, United Kingdom",
  "postcode": "BH20 5QF",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "coastal"
  ],
  "points_of_interest": [
    "village",
    "viewpoint",
    "quarry"
  ],
  "facilities": [
    "car park",
    "picnic area"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}