{
  "created_at": "2025-01-06T03:52:32.805192+00:00",
  "objectID": "425a3448f68ddd01ef4fb70ac49d6247",
  "ref": "butser-hill-walking-route",
  "title": "Butser Hill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Rakefield_Hanger_at_the_foot_of_Butser_Hill_-_geograph.org.uk_-_2652.jpg",
  "nearby": [
    {
      "description": "Staunton Way",
      "objectID": "79b718d63abef82bc882216aa133a310",
      "ref": "staunton-way-walking-route"
    },
    {
      "description": "Hangers Way",
      "objectID": "112e1c088c98838db8d6b4ebd2670675",
      "ref": "hangers-way-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Queen Elizabeth Country Park",
      "objectID": "2d00787b508d75ff109828048c9d5216",
      "ref": "queen-elizabeth-country-park-walking-and-cycle-route"
    },
    {
      "description": "Petersfield Lake and Heath",
      "objectID": "30dbdb2eea6c25dda6b190fa569d79f5",
      "ref": "petersfield-lake-and-heath-walking-route"
    },
    {
      "description": "Clanfield",
      "objectID": "1d3b6c034e1a1c750be1e34608b0275d",
      "ref": "clanfield-walking-route"
    },
    {
      "description": "South Harting",
      "objectID": "d7e2e4e086cc0fcd2bb82b6e9d321b9a",
      "ref": "south-harting-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/425a3448f68ddd01ef4fb70ac49d6247.gpx",
  "_geoloc": {
    "lat": 50.9757081034,
    "lng": -0.9872718679
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Rakefield_Hanger_at_the_foot_of_Butser_Hill_-_geograph.org.uk_-_2652.jpg",
      "title": "Martyn Pattison / Rakefield Hanger at the foot of Butser Hill, via Wikimedia Commons",
      "caption": "Rakefield Hanger at the foot of Butser Hill. The area supports a variety of plant species, including common cowslips, which blanket the slopes in spring, adding vibrant colour to the landscape. Additionally, the hill boasts a significant bryophyte and lichen flora, with 125 species of bryophytes and 82 species of lichens recorded, making it the richest chalk grassland site in Hampshire for these groups."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Ramsdean_Down_and_Rake_Bottom%2C_Butser_Hill_-_geograph.org.uk_-_26186.jpg",
      "title": "Jim Champion / Ramsdean Down and Rake Bottom, Butser Hill, via Wikimedia Commons",
      "caption": "Looking north from Butser Hill at the chalk slopes of Ramsdean Down and Rake Bottom (called Grandfather's Bottom on the maps at the hill) below. The fauna here is equally impressive, especially the butterfly populations. Over 30 species have been documented, including notable species such as the Duke of Burgundy and the Silver-spotted Skipper. The area is also home to other butterfly species like the Green Hairstreak, Grizzled Skipper, and Dingy Skipper, particularly in regions like Rake Bottom. This diversity underscores the hill's importance as a conservation area for lepidopteran species."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Path_up_Butser_Hill_-_geograph.org.uk_-_355195.jpg",
      "title": "Stephen Williams / Path up Butser Hill, via Wikimedia Commons",
      "caption": "This gate is a convenient place to catch ones breath on the long climb up the hill. There was an organised walk taking place on this day, and the bloke in the reflective jacket and cycling helmet was marshalling."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Portsdown_Hill_and_Bembridge_Down%2C_from_Butser_Hill_-_geograph.org.uk_-_1739307.jpg/512px-Portsdown_Hill_and_Bembridge_Down%2C_from_Butser_Hill_-_geograph.org.uk_-_1739307.jpg",
      "title": "Chris Gunns / Portsdown Hill and Bembridge Down, from Butser Hill, via Wikimedia Commons",
      "caption": "Portsdown Hill and Bembridge Down, from Butser Hill. Dead Man's Copse, a well known local landmark, widely visible in this area. 1246311 The monument on Bembridge down is just visible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Radio_mast_on_Butser_Hill_-_geograph.org.uk_-_3603928.jpg",
      "title": "Radio mast on Butser Hill by Peter Facey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Radio mast on the hill. The name Butser derives from the Old English Bryttes Oran meaning Briht's slope. Oran or Ora is Old English for a flat topped hill or a steep slope."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Butser_Hill_-_geograph.org.uk_-_8087.jpg",
      "title": "Stephen Dawson / Butser Hill",
      "caption": "The trig point. Butser Hill is a designated Dark Sky Discovery Site, making it an excellent location for stargazing due to minimal light pollution. Additionally, the hill is a popular spot for hang-gliding, with enthusiasts taking advantage of its elevation and open landscapes. The annual Butser Hill Challenge, a fell run event, attracts participants who test their endurance on the hill's slopes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Butser_Hill_toilets_and_kiosk_-_geograph.org.uk_-_807483.jpg",
      "title": "Mark Percy / Butser Hill toilets and kiosk",
      "caption": "Dome shaped kiosk and picnic bench at the foot of the hill near the car park. Beyond its natural history, Butser Hill holds archaeological significance. The summit and surrounding areas feature ancient field systems and evidence of Iron Age settlements, including ditches and banks whose purposes remain subjects of study. These historical features offer insights into the area's past human activity and land use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Ramsdean_Down_and_Rake_Bottom_from_Butser_Hill_-_geograph.org.uk_-_1739561.jpg",
      "title": "Chris Gunns / Ramsdean Down and Rake Bottom from Butser Hill",
      "caption": "Ramsdean Down and Rake Bottom from the hill. This striking landscape lies just north west of the hill. Bridle paths can be followed north along the western edge of Rake Bottom to the village of Ramsdean."
    }
  ],
  "distance_km": 1.0,
  "description": "Climb to the highest point on the South Downs on this walk near Petersfield. There's a good sized car park off Limekiln Lane just to the west of the hill. From here it is a short climb to the 271 metres (889 ft) high summit of the hill. At the top you can enjoy wonderful views over the South Downs to the Isle of Wight. The area is also a nature reserve with woodland, lowland, chalk grassland habitats. Look out for variety of butterflies including Duke of Burgundy, Chalkhill Blue and Silver-Spotted Skipper. Fans of the comedy Only Fools and Horses may remember a scene with Del Boy reluctantly taking off on a hang glider. This scene was filmed on the western slopes of Butser Hill. The South Downs Way National Trail passes the car park so it's easy to extend your walk. Following it south will take you into Queen Elizabeth Country Park. Here you will find miles of woodland trails and some super mountain bike trails. You can also pick up the Staunton Way and Hangers Way long distance trails in the park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk you can stop for refreshments at The Old Drum on Chapel St at postcode GU32 3DP. The contemporary country pub is located in the centre of Petersfield and has a lovely beer garden. Built in the 18th Century, it is the oldest in the area and has been beautifully restored to keep its character and charm."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill is a great place for a dog walk but please keep them on leads where cattle is grazing."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east from the hill you'll soon come to the idyllic village of Buriton. It's a delighfully picturesque place with a pretty duck pond and an old church. The St Mary's church is worth investigating as it contains some ancient pieces including medieval Sedilia (seats), Norman arches, a 13th century mural, a Norman font and Pillars bearing carvings of water Lilies, Foliage and Scallops. It's a lovely place to relax after your climb and has a nice pub for refreshments too. The Five Bells is a traditional country pub with a lovely rustic outside seating area at the front of the pub and a selection of cosy nooks and crannies to choose from inside. You can find it north of the pond, on the High Street with a postcode of GU31 5RX for your sat navs. The Buriton Circular Walk starts from the village and visits the hill before exploring the surrounding country lanes.   Buriton Pond and church - a worthy place to visit close to the hill. A few miles to the east there's another a splendid viewpoint at Harting Down. There's also the nearby village of South Harting where you could pay a visit to the National Trust's Uppark. Here you'll find a fine 17th century Georgian House surrounded by lovely gardens with views of the English Channel. The author H.G Wells stayed in the house during the late 19th century. The class divisions he observed here inspired his socialist views which later manifested themselves in work such as 'The Time Machine'. You can find the house at postcode GU31 5QR. Just to the south you can pick up the Clanfield Walk and visit Butser Ancient Farm and Windmill Hill. The farm is one of the area highlights and includes an archaeological open-air museum with reconstructions of Neolithic dwellings, Iron Age roundhouses, a Romano-British villa and an early Saxon house. For more walking ideas in the area see the Hampshire Walks and the South Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/uLO4sxfqgy4",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Limekiln Lane, East Meon, East Hampshire, Hampshire, England, GU32 1RX, United Kingdom",
  "postcode": "GU32 1RX",
  "district": "East Hampshire",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "chalk grassland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "nature reserve",
    "long distance trails"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}