{
  "objectID": "425f68ffbd4404bd3d90378d904bb2d0",
  "created_at": "2024-12-19T11:04:08.282470+00:00",
  "ref": "hawkshead-walking-route",
  "title": "Hawkshead Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Beatrix_Potter_Gallery%2C_Hawkshead_-_geograph.org.uk_-_503308.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/79EBAAB38FD22BFB80258160003812E1/$FILE/Hawkshead.gpx",
  "_geoloc": {
    "lat": 54.3757344232,
    "lng": -2.9973666428
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Beatrix_Potter_Gallery%2C_Hawkshead_-_geograph.org.uk_-_503308.jpg",
      "title": "Kate Jewell / Beatrix Potter Gallery, Hawkshead",
      "caption": "Beatrix Potter Gallery, Hawkshead. The cream building on the right is owned by the National Trust and houses a collection of Beatrix Potter's drawings including the original letter that started the story of Peter Rabbit. The building was actually the office of William Heelis, the solicitor who dealt with the purchase of Hill Top Farm for Miss Potter in 1905. He eventually married her in 1913 when she was 47. The building on the left is the National Trust's office and ticket shop for the Gallery. The public house next to the Gallery is the Red Lion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/The_Sun_Inn%2C_Hawkshead%2C_Cumbria_-_geograph.org.uk_-_2785824.jpg/512px-The_Sun_Inn%2C_Hawkshead%2C_Cumbria_-_geograph.org.uk_-_2785824.jpg",
      "title": "The Sun Inn, Hawkshead, Cumbria by Christine Matthews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Sun Inn, Hawkshead, Cumbria"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Hawkshead_Grammar_School_-_geograph.org.uk_-_1378690.jpg",
      "title": "Paul Shreeve / Hawkshead Grammar School",
      "caption": "Grammar School. Next to the path leading to the parish church. William Wordsworth went to school here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/War_memorial%2C_Hawkshead.jpg",
      "title": "Philip Halling / Celtic cross, Hawkshead",
      "caption": "Photograph of the war memorial in the churchyard"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Summit_of_Latterbarrow_-_geograph.org.uk_-_39819.jpg",
      "title": "Ian Cunliffe / Summit of Latterbarrow",
      "caption": "Summit of Latterbarrow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Moss_Eccles_tarn_-_geograph.org.uk_-_894441.jpg",
      "title": "Tom Richardson / Moss Eccles tarn",
      "caption": "Moss Eccles tarn on Claife Heights"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Hawkshead_Show%2C_August_24th%2C_2010_-_geograph.org.uk_-_2046021.jpg",
      "title": "Hawkshead Show, August 24th, 2010 by David Long, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hawkshead Show, August 24th, 2010"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Hawkshead_Church_-_geograph.org.uk_-_900302.jpg",
      "title": "David Palmer / Hawkshead Church",
      "caption": "Hawkshead Church. I think this might be one of Ruskin's Views?"
    }
  ],
  "distance_km": 10.0,
  "description": "Hawkshead is a lovely little Lakeland village situated at the northern end of Esthwaite Water. It's a great place to visit with pretty streets, lots of nice cafes and an interesting history. Must see attractions include William Wordsworth's Grammar School which was founded in 1585. For a small fee you can tour the school and see the original desks with William Wordsworth's own carvings on them. The village is also home to the wonderful Beatrix Potter Gallery. The gallery is run by the National Trust and situated in a 17th-century stone-built house. Here you can browse the original sketches and watercolours painted by Potter for her children's stories. The area is also great for walkers with lots of trails to try. This is a popular circular walk which will take you to several of the highlights of the area. You'll climb to Latterbarrow Hill and along to Claife Heights before descending to the home of Beatrix Potter at Hill Top . The route then heads along Esthwaite Water to return to the village. There's much to enjoy on the walk with great views, woodland trails, pretty tarns and the bonus of finishing in Near Sawrey where you can visit Hill Top and enjoy refreshments at the pub.. The walk starts in the centre of the village and follows footpaths past the police station to Crag Wood and onto Loanthwaite Lane. You then climb to Latterbarrow which reaches a height of 803 feet (245 m) with splendid views over Esthwaite Water and Lake Windermere. The route then descends to the woodland trails on Claife Heights before passing Wise Een Tarn and Moss Eccles tarn. Beatrix Potter owned Moss Eccles and donated it to the National Trust after her death. The tarn is stocked with water lilies and fish, and surrounded by pretty rhododendrons. The next section then descends to the little village of Near Sawrey and Hill Top. The fascinating house is the 17th century former home of children's author and illustrator Beatrix Potter. You can tour the house and gardens where expert guides will tell you all about the life and works of Beatrix Potter. In Near Sawrey you can enjoy refeshments at the nice pub before picking up a new footpath running along Esthwaite Water. This will lead you back to Hawkshead where the route finishes.",
  "video_url": "https://www.youtube.com/embed/NMA8pVVKCp4",
  "postcode": "LA22 0FB",
  "district": "Hawkshead",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England"
}