{
  "objectID": "42ae4679c50d9e252513fb41afd7a2ca",
  "created_at": "2024-12-18T00:56:44.900464+00:00",
  "ref": "allensford-country-park-walking-route",
  "title": "Allensford Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Allensford_Park_-_geograph.org.uk_-_897542.jpg",
  "nearby": [
    {
      "description": "Consett and Sunderland Railway Path",
      "objectID": "7319de94d2a250aeefb009f9b04acf48",
      "ref": "consett-and-sunderland-railway-path-walking-route"
    },
    {
      "description": "Pow Hill Country Park and Derwent Reservoir",
      "objectID": "6694f8e5c13c35fa3cddcfe42bc52745",
      "ref": "pow-hill-country-park-and-derwent-reservoir-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/B0F0E44A5B5D36CE80257D3F00328289/$FILE/Allensford Country Park.gpx",
  "_geoloc": {
    "lat": 54.8476025985,
    "lng": -1.8763936536
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Allensford_Park_-_geograph.org.uk_-_897542.jpg",
      "title": "Helen Wilkinson / Allensford Park",
      "caption": "Allensford Park. A grassy park beside the River Derwent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/River_Derwent_-_geograph.org.uk_-_1529420.jpg",
      "title": "Malcolm Coils / River Derwent",
      "caption": "River Derwent in the park. Spring morning with rocks giving a lead into the focal point, with muted reflections giving a sense of tranquility."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Wharnley_Burn_Waterfall_%2816498619809%29.jpg/512px-Wharnley_Burn_Waterfall_%2816498619809%29.jpg",
      "title": "Mick C from Durham, United Kingdom, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Wharnley burn is near Allensford just up stream from a small country park area and hamlet in County Durham, in England. It is situated a short distance to the west of Consett, and to the east of Castleside on the River Derwent.\nFirst recorded as Aleynforth in Bishop Hatfield's survey of c. 1382. The placename is sometimes listed as Allansford, \"At Allansford...is a bridge over the Derwent into Northumberland, surrounded by some of the most beautiful scenery on that stream; there are a few cottages on each side of the river\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Wharnley_Beck_bridge_-_geograph.org.uk_-_1529592.jpg",
      "title": "Malcolm Coils / Wharnley Beck bridge",
      "caption": "Wharnley Beck bridge. Bridge over Wharnley Beck with small waterfall in the background. It is uncertain when a bridge replaced the ford, however a bridge was in existence in the late 17th century when the structure was in a \"very ruinous and in greate decay” according to the Northumberland Quarter Sessions for 1687-1697.\nAllensford Mill farmhouse was originally called the Belsay Castle Inn, named after the estate of the Middleton family of Belsay Castle. Part of the inn was built in the late 17th century and may have been a bastle. Later additions continued throughout the 18th and 19th centuries. The inn was licensed until 1869. The upper room in the outbuilding served as a nonconformist chapel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Derwent_Valley_-_geograph.org.uk_-_396950.jpg",
      "title": "Oliver Dixon / Derwent Valley",
      "caption": "Derwent Valley view, east of the park. The deeply incised valley of the River Derwent viewed from Pemberton Road. The large building on the far side is the Derwent Manor Hotel at Allensford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Allensford_Picnic_Area_-_geograph.org.uk_-_74984.jpg",
      "title": "Colin Edgar / Allensford Picnic Area",
      "caption": "View along the main picnic area, the trees following along derwent river."
    }
  ],
  "distance_km": 5.0,
  "description": "Enjoy riverside woodland walks and magnificent views of the Derwent Valley in this country park near Consett. The River Derwent runs right through the park, with riverside footpaths to follow. The park has picnic tables, a shop and a nature trail in Deneburn Wood. Near the park there's also a picturesque waterfall and old bridge on the Wharnley burn. You can find this just west of the car park. On the northern side of the river there's also the Allensford blast furnace which is part of the local heritage trail and of some industrial archaeological interest.",
  "video_url": "https://www.youtube.com/embed/LKBElgnBLmM",
  "district": "Allensford",
  "county": "County Durham",
  "region": "North East",
  "country": "England"
}