{
  "created_at": "2025-01-06T03:02:18.006622+00:00",
  "objectID": "42b131dc6c3ceb2e411d3896080042c0",
  "ref": "lopwell-dam-walking-route",
  "title": "Lopwell Dam Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Lopwell_Dam_-_geograph.org.uk_-_84226.jpg",
  "nearby": [
    {
      "description": "Tamar Estuary",
      "objectID": "df6ac2e391bb42c1254df54bede75879",
      "ref": "tamar-estuary-walking-route"
    },
    {
      "description": "Tamar Valley Discovery Trail",
      "objectID": "ee55b9ee756d935ffaa037bca736c52b",
      "ref": "tamar-valley-discovery-trail-walking-route"
    },
    {
      "description": "Buckland Abbey",
      "objectID": "53f88ca31024de9e5e7d956ab40354ec",
      "ref": "buckland-abbey-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/42b131dc6c3ceb2e411d3896080042c0.gpx",
  "_geoloc": {
    "lat": 50.4638126021,
    "lng": -4.1514354737
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Lopwell_Dam_-_geograph.org.uk_-_84226.jpg",
      "title": "Tony Atkin / Lopwell Dam, via Wikimedia Commons",
      "caption": "Lopwell Dam. The purpose of this dam is less to hold a great deal of water behind it and more to stop salty tidal water coming up stream. This makes the river water available to be extracted for the public water supply."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Lopwell_Dam_on_the_River_Tavy_near_Plymouth_-_geograph.org.uk_-_1201702.jpg",
      "title": "Mark Land / Lopwell Dam on the River Tavy near Plymouth, via Wikimedia Commons",
      "caption": "The River Tavy turns into the Tavy Estuary before joining the Tamar at Lopwell Dam. Plymouth City Council built the dam in 1953, incorporating a fish pass to allow migration upriver to spawning grounds. The old pumphouse beside the car park, (which featured as the surgery in the 1990\u0092s BBC TV series \u0093The Vet\u0094), was replaced by a new underground pumphouse in 1981. This is now covered by a Butterfly Meadow, open to the public. The old barn next to the public toilets is now a Camping Barn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Youth_Hostel_at_Lopwell_Dam_-_geograph.org.uk_-_224628.jpg",
      "title": "Kate Jewell / Youth Hostel at Lopwell Dam, via Wikimedia Commons",
      "caption": "Youth Hostel at Lopwell Dam"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lopwell_-_geograph.org.uk_-_1045879.jpg/256px-Lopwell_-_geograph.org.uk_-_1045879.jpg",
      "title": "Derek Harper / Lopwell, via Wikimedia Commons",
      "caption": "Lopwell. Lopwell was a traditional river quay serving nearby mines and farmland, and used by the monks of Buckland Abbey. Silver and lead were once exported, and coal and lime imported. From the mid 19th to mid 20th centuries, pleasure steamers from Plymouth also used to call in here. Photo taken from the path to the Butterfly Meadow above the pumping station. The first building on the right houses the public toilets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Freshwater_marsh_in_the_river_Tavy_at_Lopwell_-_geograph.org.uk_-_3602066.jpg/512px-Freshwater_marsh_in_the_river_Tavy_at_Lopwell_-_geograph.org.uk_-_3602066.jpg",
      "title": "Freshwater marsh in the river Tavy at Lopwell by David Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Freshwater marsh in the river Tavy at Lopwell. Lopwell has long been a tidal fording point, and a ferry also operated here until around 1930. Before the dam was built, the river was navigable further inland. Upriver were Lopwell lime kilns, where lime was burned for use in sweetening the soil. There was also a small quay where flat-bottomed Tamar barges brought \u0091dock dung\u0092 (sweepings from the streets of Plymouth), which was used as a fertiliser, returning with woodland products."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Milton_Brook_valley_near_Lopwell_-_geograph.org.uk_-_67203.jpg",
      "title": "Crispin Purdye / Milton Brook valley near Lopwell",
      "caption": "Milton Brook valley near Lopwell. This photograph was taken shortly after the clearance of all woodland in this section of valley as far between Lopwell and Lilliput, 1k south of Milton Coombe, during the winter of 1978. The clearance was in preparation for the damming of Milton Brook at Lopwell to create a holding reservoir of water for Plymouth during times of drought."
    }
  ],
  "distance_km": 3.35,
  "description": "Lopwell Dam Local Nature Reserve covers an area of 5 hectares on the River Tavy near Plymouth and Tavistock. It consists of a variety of different habitats including mudflats, freshwater marsh, wildflower meadow, scrub-grassland, saltmarsh and semi-natural woodland. It's great for riverside walking and bird watching and includes a new cafe and visitor centre. This walk starts from the car park at Lopwell before following trails along both sides of the river, using the bridge at Lopwell House. The Tamar Valley Discovery Trail passes the reserve so you can pick this up to extend your walk. The trails runs north to Bere Alston and south to Tamerton Foliot. Also nearby is the Tamar Estuary Nature Reserve with lots more wading birds to look out for.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Pump House cafe is a nice place to enjoy some refreshments after your walk. On fine days you can sit outside and enjoy fine views of the dam. There's light lunches and lots of tasty eats and treats to try.  Just to the north of the dam is the little village of Milton Combe where you'll find the wonderfully named Who'd Have Thought It pub. It's a charming 16th Century Inn with an excellent menu and a friendly welcome. Inside there's an attractive interior with real fires to warm yourself by in the winter months. Outside there's a pretty garden with a babbling brook for warmer days. You can find the inn at a postcode of PL20 6HP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and the on site cafe is also dog friendly. The Who'd Have Thought It pub mentioned above is also very dog friendly. They even have a special menu for dogs!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to extend the walk by heading south along the western side of the river to the village of Bere Ferrers. Here you can pick up the wonderful Tamar Valley Line. The scenic railway takes you through rolling green, sleepy villages and beautiful river crossings. The highlight of the journey is when the train slowly creeps down over the impressive Calstock viaduct and you are 120 feet high looking down on the river below. Head north from the dam and you could explore the expansive Buckland Abbey where there are nice woodland trails and pretty gardens on the estate. It's National Trust owned and only about a mile from the dam so well worth a visit if you have time."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KrwphqrM188",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Buckland Monachorum, Milton Combe, West Devon, Devon, England, PL6 7BZ, United Kingdom",
  "postcode": "PL6 7BZ",
  "district": "West Devon",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "marsh"
  ],
  "points_of_interest": [
    "nature reserve",
    "river views",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "bird watching"
  ]
}