{
  "objectID": "4315d217a49aa57d235c0529c7be0081",
  "created_at": "2024-12-18T21:38:08.225286+00:00",
  "ref": "woodbridge-walking-route",
  "title": "Around Woodbridge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/35/Low_tide_on_the_River_Deben_-_geograph.org.uk_-_900868.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/3D088AA0FA2D709C802582B5007FB772/$FILE/Woodbridge.gpx",
  "_geoloc": {
    "lat": 52.0903360089,
    "lng": 1.3180810805
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Low_tide_on_the_River_Deben_-_geograph.org.uk_-_900868.jpg",
      "title": "Bob Jones / Low tide on the River Deben",
      "caption": "Low tide on the River Deben"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Woodbridge_Tide_Mill_on_River_Deben_-_geograph.org.uk_-_888424.jpg",
      "title": "Roger Gittins [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Woodbridge Tide Mill on River Deben. The Tide Mill seen on the right was built in about 1796 where a medieval mill once stood. The mill as one might expect was used to grind corn in flour but was finally used to produce animal feed. When it ground to a halt in 1956 and was the last working tide-mill. To the left you will see the granary where the wheat was stored. The tide mill was restored and opened to the public in 1972. The pond in which tide water was trapped to run the mill became the Yacht Harbour a small pond still exists for demonstration of the mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Low_lying_fields_by_the_Deben_-_geograph.org.uk_-_1183521.jpg",
      "title": "Andrew Hill / Low lying fields by the Deben",
      "caption": "Low lying fields by the Deben"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Access_to_the_River_Deben_-_geograph.org.uk_-_875744.jpg/256px-Access_to_the_River_Deben_-_geograph.org.uk_-_875744.jpg",
      "title": "Alison Rawson / Access to the River Deben",
      "caption": "Access to the River Deben"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/River_Deben_near_Woodbridge_-_geograph.org.uk_-_900985.jpg",
      "title": "Bob Jones / River Deben near Woodbridge",
      "caption": "River Deben near Woodbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Once_someone%27s_pride_and_joy_-_geograph.org.uk_-_900862.jpg",
      "title": "Bob Jones / Once someone's pride and joy",
      "caption": "Once someone's pride and joy"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Kingston_Marshes_-_geograph.org.uk_-_900877.jpg",
      "title": "Bob Jones / Kingston Marshes",
      "caption": "Kingston Marshes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Kyson_Hill_overlooking_the_Deben_-_geograph.org.uk_-_1183479.jpg",
      "title": "Andrew Hill / Kyson Hill overlooking the Deben",
      "caption": "Kyson Hill overlooking the Deben"
    }
  ],
  "distance_km": 3.3,
  "description": "The Suffolk town of Woodbridge has some lovely trails to try along the River Deben. You can follow the river north or south with two National Trust properties to visit. Heading north will take you towards Melton where you can cross the river to visit Sutton Hoo. This circular walk heads south along a section of the Fynn Valley Walk to take you to Kyson Hill and Kyson Point on the western side of the river. It's a really lovely stretch of the Deben with lots of little boats and nice views of the surrounding countryside. You can start the walk from the train station which is located right next to the quay. From here you can pick up the Fynn Valley Walk next to the Woodbridge Tide Mill . The Grade I listed building is very well preserved and has a water wheel which still turns and is capable of grinding a wholemeal flour. A mill has operated on the site for 800 years and is now open to the public for tours. Follow the river south and you will soon come to Kyson Hill. The National Trust owned area includes a grassy hill, surrounded by wooded belts, sloping down to the saltings and mudflats of the tidal Deben. It's a great area for bird watching with many species visiting the estuary. Look out for egrets, oyster catchers, plovers, teals, little grebes, redshanks, black tailed godwits, and curlews as you make your way along the river. After admiring the estuary views from the little hill, the walk continues to Kyson Point where there are fine views of Martlesham Creek . The route then follows other paths back to the town through the countryside. To extend your waterside walking try our longer River Deben Walk which takes you all the way to Felixstowe . You could also head west through the countryside along the Fynn Valley Walk to Playford. Just to the east of the town you will find Rendlesham Forest . The mysterious forest includes the UFO trail which takes you to some of the areas connected to the UFO sighting in December 1980. Near here is the fascinating Sutton Hoo ancient burial ground. The National Trust owned estate has some nice trails through woodland and along the river. The long distance Sandlings Walk also passes through the town and will take you on a tour of the Suffolk Coast and Heaths Area of Outstanding Natural Beauty.",
  "district": "Woodbridge",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England"
}