{
  "objectID": "43b74603772adeff3f6223d9d2c5df42",
  "created_at": "2024-12-18T01:04:12.510106+00:00",
  "ref": "midland-link-walking-route",
  "title": "Midland Link Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/Lane_to_Wroxall_from_Haseley_Knob_-_geograph.org.uk_-_1775384.jpg",
  "nearby": [
    {
      "description": "Baddesley Clinton",
      "objectID": "50800eca937fa1b2a7d13d9889b4eca3",
      "ref": "baddesley-clinton-walking-route"
    },
    {
      "description": "Kenilworth",
      "objectID": "4e9e374f0ec0f2bedb3262742bd66540",
      "ref": "kenilworth-walking-route"
    },
    {
      "description": "Earlswood Lakes",
      "objectID": "b7f68a5fd7b29e35da37594e3ead1e44",
      "ref": "earlswood-lakes-walking-route"
    },
    {
      "description": "Tanworth-in-Arden",
      "objectID": "fd4dc4a9665336e0ce2d8669cbabcdc0",
      "ref": "tanworth-in-arden-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/24DC72B40724E1D7802579E70036123B/$FILE/Midland Link.gpx",
  "_geoloc": {
    "lat": 52.3775865956,
    "lng": -1.9203238782
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Lane_to_Wroxall_from_Haseley_Knob_-_geograph.org.uk_-_1775384.jpg",
      "title": "Robin Stott / Lane to Wroxall from Haseley Knob",
      "caption": "Lane to Wroxall from Haseley Knob. The Midland Link recreational path takes this route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Haseley_Knob_from_across_the_A4177_-_geograph.org.uk_-_1775379.jpg",
      "title": "Robin Stott / Haseley Knob from across the A4177",
      "caption": "Haseley Knob from across the A4177. This stretch of the A4177 bypasses Haseley Knob. The yellow signs advertise The Croft, a guest house with discreet caravan pitches at the back. The road in the foreground has come from Wroxall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Footpath_crossing_-_geograph.org.uk_-_559906.jpg",
      "title": "David Stowell / Footpath crossing",
      "caption": "Footpath crossing. The point at which the footpath from the Midland Link towards Hockley Heath crosses the lane at Obelisk Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Kenilworth_Castle_-_geograph.org.uk_-_103123.jpg",
      "title": "Angela Tuff / Kenilworth Castle",
      "caption": "Kenilworth Castle. On approach from the Car Park. Once the home of the favourite of Elizabeth I, Robert Dudley (Earl of Leicester). He extensively renovated it for her visit in 1575AD."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Baddesley_Clinton_manor_house_-_geograph.org.uk_-_3075895.jpg/512px-Baddesley_Clinton_manor_house_-_geograph.org.uk_-_3075895.jpg",
      "title": "Baddesley Clinton manor house by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Baddesley Clinton manor house"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Earlswood_Lakes_-_Engine_House_-_geograph.org.uk_-_81358.jpg",
      "title": "David Stowell / Earlswood Lakes - Engine House",
      "caption": "Earlswood Lakes - Engine House. Earlswood Lakes were built to provide water for the Stratford-upon-Avon Canal. This view is looking NW along to the dam towards the old engine house at the point at which the canal feeder leaves the lakes. The lakes are divided into three pools and the one seen here is known as Engine Pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Tanworth-in-Arden_-_geograph.org.uk_-_87163.jpg",
      "title": "David Stowell / Tanworth-in-Arden",
      "caption": "Tanworth-in-Arden in Warwickshire, near the start of the route. The centre of the village with the War Memorial, village green and the 14th century church of St Mary Magdalene beyond. One of this picturesque village's more dubious claims to fame was as the outdoor setting for village of King's Oak in the long defunct TV soap Crossroads. This village deserves a return visit on a sunnier day!"
    }
  ],
  "distance_km": 32.0,
  "description": "Enjoy lakes, canals, woodlands and historic villages on this waymarked walk through the Worcestershire and Warwickshire countryside. The walk begins at the Forehill picnic site, just outside Birmingham, and heads to Tanworth-in-Arden on country lanes and footpaths. This section of the walk passes the three man-made reservoirs at Earlswood Lakes and the interesting Transport Museum at Wythall with its extensive collection of buses, battery electric vehicles and a miniature steam railway. From Tanworth-in-Arden you continue east towards the village of Lapworth, passing the 17th century Umberslade Hall and Park on the way. The mansion is a a Grade II* listed building and is surrounded by parkland and lakes. At Lapworth you join the Stratford Upon Avon Canal for a short waterside stretch which takes you to Kingswood Junction where the Stratford-upon-Avon Canal meets the Grand Union Canal. A short stroll from Kingswood takes you onto another major highlight on the walk, as you reach the moated manor house of Baddesley Clinton . This medieval manor house dates from the 15th century and includes a pretty garden, lakeside walks and woodland trails in the adjacent Hay Wood . The final section of the walk then takes you to Kenilworth , passing through the peaceful Hay Wood and the village of Wroxhall on the way. You finish at the impressive Kenilworth Castle described by architectural historian Anthony Emery as 'the finest surviving example of a semi-royal palace of the later middle ages, significant for its scale, form and quality of workmanship'. The castle dates from the 16th century and includes a beautiful Elizabethan Garden with a bejewelled aviary and marble fountain.",
  "video_url": "https://www.youtube.com/embed/VNanyePafU8",
  "county": "Worcestershire",
  "region": "West Midlands",
  "country": "England"
}