{
  "created_at": "2025-01-06T00:18:12.163466+00:00",
  "objectID": "43b7b893f9c8a196d1fd908de5172d6d",
  "ref": "denny-wood-walking-route",
  "title": "Denny Wood Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Denny_Wood_Caravan_Site%2C_New_Forest_-_geograph.org.uk_-_36636.jpg",
  "nearby": [
    {
      "description": "Matley Wood",
      "objectID": "324f11d2c329890d5e484884880ffca5",
      "ref": "matley-wood-walking-route"
    },
    {
      "description": "Lyndhurst",
      "objectID": "6004e8b0ac8ca159efad3e2fed7d73fe",
      "ref": "lyndhurst-walking-route"
    },
    {
      "description": "Hollands Wood",
      "objectID": "a5ec645d3370d77646d1ca123b234a40",
      "ref": "hollands-wood-walking-route"
    },
    {
      "description": "Standing Hat",
      "objectID": "0d6cf994aa44e5798a59163747541af4",
      "ref": "standing-hat-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/43b7b893f9c8a196d1fd908de5172d6d.gpx",
  "_geoloc": {
    "lat": 50.8604172788,
    "lng": -1.5265637023
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Denny_Wood_Caravan_Site%2C_New_Forest_-_geograph.org.uk_-_36636.jpg",
      "title": "Jim Champion / Denny Wood Caravan Site, New Forest",
      "caption": "Denny Wood Caravan Site. This Forestry Commission caravan site is on the edge of the vast wooded area between Lyndhurst and Brockenhurst."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Amanita_rubescens_fungus_in_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_256724.jpg/512px-Amanita_rubescens_fungus_in_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_256724.jpg",
      "title": "Jim Champion / Amanita rubescens fungus in Denny Wood, New Forest",
      "caption": "Amanita rubescens fungus. The amanita rubescens fungus (also known as The Blusher) is edible - in fact it is described by my fungi guide as \"one of the best culinary fungi\". Many of its close relations are highly toxic, including the similar looking Amanita pantherina. Risk of incorrect identification is high, and it would probably be best to stick to the cautious principle of not consuming wild fungi with gills. This specimen was growing beneath a spreading beech tree."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Rolling_pony_at_Denny_Wood_campsite%2C_New_Forest_-_geograph.org.uk_-_251589.jpg",
      "title": "Jim Champion / Rolling pony at Denny Wood campsite, New Forest",
      "caption": "Rolling pony at the campsite. The caravan site at Denny Wood closes at the end of September, so by now all the campers have gone and the ponies are free to graze on the lawn. This photo was taken after a sharp shower of rain, and when the sun came out this pony rolled around on the wet grass for a while before shaking dry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Ponies_grazing_south_of_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_28321.jpg",
      "title": "Jim Champion / Ponies grazing south of Denny Wood, New Forest",
      "caption": "Ponies grazing south of Denny Wood. This open land is the western part of the Bishop of Winchester's Purlieu, a not particularly practical piece of wet and boggy land that was given to the Bishop of Winchester in the thirteenth century. The story goes that when he applied for a part of the Forest he was permitted as much as he could crawl around in a day. An earthwork defines the boundary of the Purlieu (called the Bishop's Dyke) and is still visible today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Recently-branded_foal_in_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_256420.jpg",
      "title": "Jim Champion / Recently-branded foal in Denny Wood, New Forest",
      "caption": "Recently-branded foal. The ponies in the New Forest are semi-wild - each is owned by a Commoner who pays fees for the right to depasture the animal on the open Forest. Foals are born in the Forest and are branded with the appropriate mark when they are rounded up in one of the 'drifts' that happen in the late summer. This foal has been branded recently, where the shaved patch is on its back. This foal has had a small patch on its back shaved in order to brand it with its owner"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Denny_Lodge%2C_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_28317.jpg",
      "title": "Jim Champion / Denny Lodge, Denny Wood, New Forest",
      "caption": "Denny Lodge. This remote dwelling gives its name to the inclosure to the southeast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Broadleaved_woodland_in_summer%2C_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_28309.jpg",
      "title": "Jim Champion / Broadleaved woodland in summer, Denny Wood, New Forest",
      "caption": "Broadleaved woodland in summer. This is probably what most people imagine the New Forest to be like: oak, ash, beech and sycamore trees with the occasional sunny glade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Fallen_tree_in_Denny_Wood%2C_New_Forest_-_geograph.org.uk_-_260912.jpg",
      "title": "Jim Champion / Fallen tree in Denny Wood, New Forest",
      "caption": "Fallen tree. When older trees fall in the Ancient and Ornamental woodlands of the Forest they are generally left alone - this woodland \"management\" policy satisfies ecologists who argue that the dead and rotting wood is an important habitat for insects and fungi and enriches the whole ecosystem. It also provides an opportunity for new seedlings to establish if they are protected from the grazing ponies and deer by the tangle of branches."
    }
  ],
  "distance_km": 8.0,
  "description": "This walk visits Denny Wood and the Denny Inclosure in the New Forest. It's one of the more peaceful areas of the forest with mainly oak and beech trees. Keep your eyes peeled for deer on the walk as they are often spotted in this tranquil area. The walk starts from the Denny Wood campsite area where there is a small parking area. From here you pick up trails and head south. These are shared cycling and walking trails running along National Cycle Network Route 2. They will take you past Denny Lodge before turning around to visit the Stubby Copse Inclosure and the Parkhill Inclosure. You then pass the Little Holmhill Inclosure and Church Place, the site of a former royal hunting lodge. Shortly after you pass Thorn Hill and return to the car park.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you would prefer to come by public transport then Beaulieu Road Station is just a short walk from the wood. Leave the station and follow a footpath west and it will take you into the wood. You could also start the walk from the larger car park at the Matley Bog Inclosure. It's located just to the north of the wood and is another nice place for a stroll. There's a nature reserve with a boggy marsh and marsh flowers to see here. The Matley Wood Walk heads through the wood and across the heath to the River Beaulieu at the eastern end. For more walking ideas in the area see the Lyndhurst Walks and New Forest Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/pTdRNS7uYvE",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beaulieu Road, Denny Lodge, New Forest, Hampshire, England, SO42 7YQ, United Kingdom",
  "postcode": "SO42 7YQ",
  "district": "New Forest",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "loop",
  "activities": [
    "walking",
    "cycling"
  ]
}