{
  "created_at": "2025-01-06T02:37:55.415888+00:00",
  "objectID": "43cab8ae3f5228bfec0a5cd93960fe13",
  "ref": "wessex-ridgeway-walking-route",
  "title": "Wessex Ridgeway Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/34/Shillingstone_Hill%2C_Wessex_Ridgeway_-_geograph.org.uk_-_234050.jpg",
  "nearby": [
    {
      "description": "Cerne Abbas Giant",
      "objectID": "2c6881c296b89240f66db212212bcff3",
      "ref": "cerne-abbas-giant-walking-route"
    },
    {
      "description": "Roundway Hill",
      "objectID": "9d909597ab0bb9b3977c2999cbceff47",
      "ref": "roundway-hill-walking-route"
    },
    {
      "description": "Bulbarrow Hill",
      "objectID": "6c8542117a87948384460e2ebf82d1d4",
      "ref": "bulbarrow-hill-walking-route"
    },
    {
      "description": "Avebury Stones",
      "objectID": "131fc4cd3eaa13cde0fc3361fc0d2e7a",
      "ref": "avebury-stones-walking-route"
    },
    {
      "description": "Cerne Abbas Giant",
      "objectID": "2c6881c296b89240f66db212212bcff3",
      "ref": "cerne-abbas-giant-walking-route"
    },
    {
      "description": "Win Green Hill",
      "objectID": "6b5d3aac497b3f71b65271779eaf11e4",
      "ref": "win-green-hill-walking-route"
    },
    {
      "description": "Pilsdon Pen",
      "objectID": "68b6540d8d3ac4be085c018b4474ab18",
      "ref": "pilsdon-pen-walking-route"
    },
    {
      "description": "Lewesdon Hill",
      "objectID": "09e0dcc0017bd705b92bd95689d47d5c",
      "ref": "lewesdon-hill-walking-route"
    },
    {
      "description": "Pewsey",
      "objectID": "966c6818a4ec3f1bf02a0685ddd7b65b",
      "ref": "pewsey-walking-route"
    },
    {
      "description": "Cherhill White Horse",
      "objectID": "66bf3dd0621fdf25f8c5635bec31aec9",
      "ref": "cherhill-white-horse-walking-route"
    },
    {
      "description": "Tollard Royal",
      "objectID": "5c97e826c9eab9b2fcc4cfe4f49462bb",
      "ref": "tollard-royal-walking-route"
    },
    {
      "description": "Sydling St Nicholas",
      "objectID": "12e058de2e0770bf7e265790d587877c",
      "ref": "sydling-st-nicholas-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/43cab8ae3f5228bfec0a5cd93960fe13.gpx",
  "_geoloc": {
    "lat": 51.4186462003,
    "lng": -1.7339090208
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Shillingstone_Hill%2C_Wessex_Ridgeway_-_geograph.org.uk_-_234050.jpg",
      "title": "michael ely / Shillingstone Hill, Wessex Ridgeway",
      "caption": "Shillingstone Hill, Wessex Ridgeway. The trig pillar (known as Shilling Stone Hill to the OS) is 223 metres above sea level. This area is part of Blandford Forest. Looking south from the Wessex Ridgeway footpath/bridleway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Gallops_by_the_Wessex_Ridgeway_-_geograph.org.uk_-_885382.jpg",
      "title": "Brian Robert Marshall / Gallops by the Wessex Ridgeway",
      "caption": "Gallops by the Wessex Ridgeway. The gallops are in the foreground. The clump of trees in the valley beyond the gate marks the position of Manton House Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Wessex_Ridgeway_-_geograph.org.uk_-_458186.jpg",
      "title": "Phil Williams / Wessex Ridgeway",
      "caption": "A view looking to the southeast towards a junction of a public footpath (right)and a bridleway forming part of the Wessex Ridgeway (Left) on the lane between Chicklade and Hindon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Wessex_Ridgeway_-_geograph.org.uk_-_248531.jpg",
      "title": "Rupert Fleetingly / Wessex Ridgeway",
      "caption": "A dog surveys the countryside from the trail. Looking north along the bridleway on Buckland Down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Crockers_Farmhouse_from_the_Wessex_Ridgeway_-_geograph.org.uk_-_560126.jpg",
      "title": "Mike Searle / Crockers Farmhouse from the Wessex Ridgeway",
      "caption": "Crockers Farmhouse from the Wessex Ridgeway. This farm is located on the minor road between Mappowder and Higher Ansty. The long distance footpath passes through the farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Morgan%27s_Hill_from_Wessex_Ridgeway_-_geograph.org.uk_-_57843.jpg",
      "title": "Doug Lee / Morgan's Hill from Wessex Ridgeway",
      "caption": "Morgan's Hill from the Ridgeway. The ridgeway is also visible climbing the hill towards the antennae (located in SU0367) to the left of which is the golf course. Furze Knoll in SU0366 can also be seen on the skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/The_Wessex_Ridgeway%2C_Maiden_Newton_-_geograph.org.uk_-_908391.jpg",
      "title": "Andrew Smith / The Wessex Ridgeway, Maiden Newton",
      "caption": "At Maiden Newton. Descending into the Frome valley between a fields of wheat and mown hay. Combe Bottom falls steeply away to the right of the track which is only a public footpath at this point. The Hog Cliff Bottom National Nature Reserve is also located in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Wessex_Ridgeway_on_Roundway_Down_-_geograph.org.uk_-_419597.jpg",
      "title": "Chris Heaton / Wessex Ridgeway on Roundway Down",
      "caption": "On Roundway Down. Long dusty lane heading east over this chalky down, not far from the battlefield site."
    }
  ],
  "distance_km": 221.0,
  "description": "This wonderful trail runs from Marlborough in Wiltshire to Lyme Regis on the Jurassic Coast in Dorset. You will pass: - Overton Down - The mystical Avebury Stones - The White Horse at Bratton - Wardour Castle ruins - Ibberton Hill with splendid views -The Vale of Pewsey - Salisbury Plain - Pilsdon Pen - with panoramic views of Marshwood Vale - Lewesdon Hill the highest point in the county of Dorset. - Cerne Abbas Giant - the mysterious figure on Giant Hill in Dorset thought to have been created in the 17th century - Win Green Hill, the highest point in the Cranborne Chase AONB - Bulbarrow Hill - this Iron Age Hill fort near Blandform Forum command wonderful views over Blackmore Vale. Roundway Hill - the site of a 1643 Civil War battle, also includes the Oliver's Castle Iron Age Hillfort.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop for refreshments at the noteworthy Grove Arms pub. The dog friendly inn dates from the 16th century and includes a nice sun terrace. It can be found on Ludwell Hill in the village of Ludwell, a few miles east of Shaftesbury. For sat navs the postcode is SP7 9ND.The Rising Sun is also in this area, just to the west of the Grove Arms. The quaint pub has a free car park and a nice garden to sit out in on a sunny day. The pub is marked on Ordnance Survey maps and can be found on the Salisbury Road at postcode SP7 9LT. Also of note is the pretty village of Ibberton where you'll find the Ibberton pub. The inn has an interesting history stretching all the way back to the 16th century. It has retained original features such as flagstone floors, beams and inglenook fireplace complete with bread oven. Outside there's two gardens with a trickling stream running through. It's a lovely spot to relax in on a fine summer day. You can find the pub on Church Lane with a postcode of DT11 0EN. It's also worth strolling round the village and visiting the interesting St. Eustace Church which dates back to the 14th century. Here you can also pick up the Ibberton Millennium Path which explores the area on a waymarked footpath. In the village of Cherhill near the Cherhill White Horse you will find the Black Horse. The pub has an interesting history dating back to the 18th century when it was a coaching inn. It is notable for being the hideout for the infamous Cherhill Gang, a group of highwaymen that would rob passers by naked to avoid being caught. They have a charming interior with interesting artwork on the walls. There's also a good menu and an outdoor area as well. You can find them at a postcode of SN11 8UT for your sat navs. The village is also worth exploring with a number of picturesque thatched cottages and an old church to see. In Tollard Royal there's The King John Inn to consider. They serve high quality food which you can enjoy in the lovely Victorian tiered garden. Near Dorchester you'll pass through the Dorset village of Maiden Newton where you'll find the Chalk & Cheese public house. The friendly pub serves good food and has a nice beer garden for warmer days. You can find them very close to the train station at 53 Dorchester Road with a postcode of DT2 0BD. The village has a train station so is an accessible place to start a walk along the trail. In Sydling St Nicholas there's the Greyhound Inn. The old coaching inn dates back several centuries and is located on the delightful High Street with its pastel painted houses built from flint and stone. They serve high quality dishes and also have a beautiful garden area for warmer weather. You can find them at postcode DT2 9PD for your sat navs. The pub is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the Wiltshire village of Tollard Royal consider stopping off at the delightful Larmer Tree Gardens, just to the south of the settlement. The beautiful gardens include some nice walkways with tea rooms, peacocks and a folly viewpoint to enjoy."
    }
  ],
  "video_url": "https://www.youtube.com/embed/qfzUZTZlH5E",
  "postcode": "SN8 1LN",
  "district": "Marlborough",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Tourist information, 90, High Street, St Martins, Marlborough, Wiltshire, England, SN8 1LN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "woodland",
    "historical"
  ],
  "points_of_interest": [
    "historical site",
    "archaeological site",
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}