{
  "created_at": "2025-01-06T00:42:58.908072+00:00",
  "objectID": "43cfc843e243944fe2788ff9cd6d543c",
  "ref": "shoreham-by-sea-walking-route",
  "title": "Circular Walk in Shoreham by Sea Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Norfolk_Bridge_and_the_River_Adur._Shoreham_by_Sea_-_geograph.org.uk_-_48491.jpg",
  "nearby": [
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Fulking",
      "objectID": "ab51140ef3d2c52b4e42f795aeed8f98",
      "ref": "fulking-walking-route"
    },
    {
      "description": "Devils Dyke",
      "objectID": "559c4472c28b81a7e291de92d4226085",
      "ref": "devils-dyke-walking-route"
    },
    {
      "description": "Brighton Coastal Walk",
      "objectID": "a3c86c41397885580f561720cd57ee0a",
      "ref": "brighton-coastal-walk-walking-route"
    },
    {
      "description": "Downs Link",
      "objectID": "c71f2209e0279c5ed434c03995619c32",
      "ref": "downs-link-walking-and-cycle-route"
    },
    {
      "description": "River Adur and Bramber Castle",
      "objectID": "f27ac5ebaa6aee441fb6e21d9c186d55",
      "ref": "river-adur-and-bramber-castle-walking-route"
    },
    {
      "description": "Steyning",
      "objectID": "a52b21ac7dc0517cb6ec6669da8f5043",
      "ref": "steyning-walking-route"
    },
    {
      "description": "Lancing Ring",
      "objectID": "4d54d0591ff942722e7a5606f1f398be",
      "ref": "lancing-ring-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/43cfc843e243944fe2788ff9cd6d543c.gpx",
  "_geoloc": {
    "lat": 50.8349144883,
    "lng": -0.2810045985
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Norfolk_Bridge_and_the_River_Adur._Shoreham_by_Sea_-_geograph.org.uk_-_48491.jpg",
      "title": "Bob Embleton / Norfolk Bridge and the River Adur. Shoreham by Sea",
      "caption": "Norfolk Bridge and the River Adur. Shoreham by Sea. Taken at high tide looking east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Shoreham_Beach_-_geograph.org.uk_-_574135.jpg",
      "title": "Bob Parkes / Shoreham Beach",
      "caption": "Shoreham Beach. Looking east from Shoreham Beach towards Shoreham Power Station and Brighton beyond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Shoreham-by-Sea_harbour_and_St_Mary_de_Haura_Church%2C_West_Sussex%2C_England.jpg/512px-Shoreham-by-Sea_harbour_and_St_Mary_de_Haura_Church%2C_West_Sussex%2C_England.jpg",
      "title": "Acabashi / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "The River Adur in Shoreham-by-Sea harbour, with a view of St Mary de Haura Church, in West Sussex, England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Shoreham-by-Sea_Riverside_Moorings_houseboat_jetty_decking%2C_West_Sussex.jpg/512px-Shoreham-by-Sea_Riverside_Moorings_houseboat_jetty_decking%2C_West_Sussex.jpg",
      "title": "Acabashi / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Houseboat jetty decking with drying washing at Riverside Moorings, a houseboat moorings which has become a tourist attraction, along the southern tidal mud flats of the River Adur, and off a riverbank footpath adjacent to Riverside Road and Beach Green in Shoreham-by-Sea, West Sussex, England. The boats, some of which are retired military ships, have been converted into 'artworks' by the addition of second hand vehicles, other boats and found scrap, and are quarters for living and renting."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Bramber_Castle_ruin_-_geograph.org.uk_-_367434.jpg/256px-Bramber_Castle_ruin_-_geograph.org.uk_-_367434.jpg",
      "title": "Dave Spicer / Bramber Castle ruin",
      "caption": "Bramber Castle ruin. This is just the what is left of the Gatehouse tower, some floor joist holes, can still be seen. It is a pleasant place to sit and have a picnic in the shadow of the remains of the old Norman castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/View_from_Beeding_Hill_-_geograph.org.uk_-_54102.jpg",
      "title": "Simon Carey / View from Beeding Hill",
      "caption": "View from Beeding Hill. Looking south from the point on the map where the fence, bridleway and powerlines all cross each other. The hills in the distance are Slonk Hill (left) and Mill Hill (right), beyond them is Shoreham and the sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Thundersbarrow_Hill_-_geograph.org.uk_-_54113.jpg",
      "title": "Simon Carey / Thundersbarrow Hill",
      "caption": "Thundersbarrow Hill. Looking south towards the site of an ancient settlement. The other side of the hill contains a barrow and ancient field system."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Footpath_and_seat_on_Mill_Hill%2C_Shoreham%2C_West_Sussex_-_geograph.org.uk_-_1805370.jpg/512px-Footpath_and_seat_on_Mill_Hill%2C_Shoreham%2C_West_Sussex_-_geograph.org.uk_-_1805370.jpg",
      "title": "nick macneill / Footpath and seat on Mill Hill, Shoreham, West Sussex",
      "caption": "Footpath and seat on Mill Hill, Shoreham, West Sussex. The buildings in the background are Old Erringham Farm. In the Middle Ages this was the village of Erringham and the chapel remains are noted on O/S maps. The use of chapel rather than church suggests the village was small however."
    }
  ],
  "distance_km": 18.0,
  "description": "This West Sussex town has some nice coastal routes and access to the River Adur and the South Downs. This circular walk from the town takes you along the River Adur to Bramber Castle before heading across the downs and returning to the town via the Mill Hill Nature Reserve. There's excellent views to enjoy from the high points as you cross the Downs. Start the walk just to the west of the train station where you can pick up a shared cycling and walking trail heading north along the River Adur to Upper Beeding and Bramber Castle. Here you'll find the ruins of an 11th century castle with a more complete church which was built as part of the castle residences and buildings. After exploring the castle the route returns to Upper Beeding where you pick up a section of the Monarch's Way to take you south east across the Downs to Beeding Hill. From here there are nice views back down to the Shoreham coast and a National Trust car park. The route continues to Thundersbarrow Hill and Whitelot Bottom. Here you turn west to Mossy Bottom before turning south to visit the Mill Hill Nature Reserve. This reserve is characterised by chalk grassland with lovely views of the Adur Valley. It is particularly beautiful in the summer months when there are wild flowers and butterflies, including the rare Adonis Blue butterfly. The site also includes a 500-metre easy access trail, which enables less mobile people to enjoy this site. From the reserve you continue south to return to Shoreham town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bridge inn is a fine place to go for some post walk refreshments. The main draw here is a lovely riverside terraced garden overlooking the River Adur. It's a great place to relax on a fine summer day. They do very good sea food if you are hungry. You can find the pub at 87 High Street with a postcode of BN43 5DE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river paths and the hill climbs across the Downs are ideal for fit dogs. The Bridge Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Bramber Castle is located very close to the attractive market town of Steyning. The town is worth exploring with a fine high street and a number of Tudor style half timbered houses and smart Georgian town houses to see. You can also try the Steyning Walk which takes you north along the River Adur to Stretham. The South Downs Way can be picked up near Beeding Hill. If you follow the trail east you can visit the Radio Masts on Truleigh Hill, Edburton Hill, Fulking Hill and the popular Devils Dyke. Just to the north west is the Lancing Ring Nature Reserve. The reserve is a great place for wildlife walks with splendid views over the Adur Valley from the high points. Head east from the town and you can try the Brighton Coastal Walk which takes you along the seafront from Southwick to Brighton. Also of interest is the Downs Link. This shared cycling and walking trail runs from St Martha's Hill in Guildford to Shoreham-by-Sea. It links the South Downs Way and North Downs Way trails. For more walking ideas in the area see the Sussex Walks and South Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/WR6LkQl9B8E",
  "postcode": "BN43 5QN",
  "district": "Adur",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lagoon Way, Shoreham-by-Sea, Adur, West Sussex, England, BN43 5QN, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "grassland",
    "downland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "views"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible",
    "easy access trail"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}