{
  "objectID": "43db26c83fc899613cea8aa5d90d3107",
  "created_at": "2024-12-18T18:36:10.061145+00:00",
  "ref": "exceat-to-eastbourne-walk-walking-route",
  "title": "Seven Sisters - Exceat to Eastbourne Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/22/Exceat_Visitors_Centre_-_geograph.org.uk_-_884090.jpg",
  "nearby": [
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Cuckmere River and Cuckmere Haven",
      "objectID": "0031e72eff78feeb55c5999ef91a5511",
      "ref": "cuckmere-river-and-cuckmere-haven-walking-route"
    },
    {
      "description": "Birling Gap",
      "objectID": "9c0431c6cf1f5f9a15b6e5d928e80cb4",
      "ref": "birling-gap-walking-route"
    },
    {
      "description": "Beachy Head",
      "objectID": "bb7945ac0629e5882929a64e8f9be3ad",
      "ref": "beachy-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/43db26c83fc899613cea8aa5d90d3107.gpx",
  "_geoloc": {
    "lat": 50.773774965,
    "lng": 0.1468677291
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Exceat_Visitors_Centre_-_geograph.org.uk_-_884090.jpg",
      "title": "Simon Carey / Exceat Visitors Centre",
      "caption": "Exceat Visitors Centre - start point for the walk and the headquarters of the Seven Sisters Country Park. The farmhouse is the last remaining part of Exceat village which disappeared sometime in the 15th century, the farmhouse which is now a restaurant dates from the 17th century along with some of the barns and outhouses many of which have been converted to other uses.  The shepherd's mobile hut has a small exhibition inside it. The road is the A259 which has just descended Exceat Hill and is about to cross the valley floor along an old medieval causeway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Birling_Gap_-_geograph.org.uk_-_1597568.jpg",
      "title": "Michael FORD / Birling Gap",
      "caption": "White cliffs viewed from the Birling Gap."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Beachy_Head_-_geograph.org.uk_-_948045.jpg",
      "title": "Andrew Smith / Beachy Head",
      "caption": "Beachy Head. Downland slopes gently down on the landward side of the chalk cliff which is here above the lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Eastbourne_Pier-geograph-3221501.jpg/256px-Eastbourne_Pier-geograph-3221501.jpg",
      "title": "Oast House Archive / Eastbourne Pier",
      "caption": "Eastbourne Pier. The 300m long Victorian pier was officially opened in 1870, however work did not finish until 1872. The Concert Hall and Pavilion were added in 1888. Above the concert hall is one of the earliest Victorian camera obscuras. The pier was reclassified to Grade II* listed in May 2009. In 2009 the pier was up for sale for a guide price of £5million. The fire of 30th July 2014 saw the arcade section of the pier destroyed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Exceat_Hill_-_geograph.org.uk_-_620955.jpg",
      "title": "Simon Carey / Exceat Hill",
      "caption": "Exceat Hill. Looking down the footpath that runs from the visitor centre to the beach. The former village church of Exceat was located on the western side of the hill above a valley that was often flooded. The village itself appears in the Domesday Book but appears to have suffered during the 14th century to French raiding parties, poor harvests, repeated flooding and the Black Death so that by the 15th century it was reported that no inhabitants were left. The church fell into disrepair and the former parish of Exceat was amalgamated with that of nearby Westdean in 1540."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/On_the_Seven_Sisters_-_geograph.org.uk_-_2004133.jpg",
      "title": "On the Seven Sisters by Graham Horn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Walkers on the Seven Sisters."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Birling_Gap_-_geograph.org.uk_-_1272592.jpg",
      "title": "Simon Carey / Birling Gap",
      "caption": "Birling Gap. The few houses in the small hamlet are actually located on either side of this private road which also carries the bridleway from East Dean and footpath from the cliff tops of the Seven Sisters. The rooftops in the distance mark the site of the hotel, bar and tea rooms whilst beyond are the fishermans cottages which are now uninhabited."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Belle_Tout_Lighthouse_-_geograph.org.uk_-_3778990.jpg",
      "title": "Belle Tout Lighthouse by Simon Carey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Belle Tout Lighthouse"
    }
  ],
  "distance_km": 16.0,
  "description": "This walk takes you from the Exceat visitor centre in the Seven Sisters Country Park, to the seaside town of Eastbourne. The walk runs for a distance of just under 10 miles using a coastal section of the The South Downs Way National Trail. The route is waymarked throughout and includes a few moderate climbs as you traverse the wonderful sea cliffs on the way. The area is also great for flora and fauna with  Lapwing, Skylark and Perigrin Falcon to look out for. There's also lots of pretty wildflowers and butterflies in the summer months. Start the walk from the car park at the visitor centre at a postcode of BN25 4AD. From here you can pick up the waymarked trail and follow it south along the Cuckmere River toward Cuckmere Haven. The route then turns east to follow the coast path to Birling Gap. This area includes the picturesque Belle Tout lighthouse and a National Trust cafe where you could stop for refreshments. It's a popular spot with some spectacular views to enjoy from the cliff top. The route continues east to Beachy Head, the highest chalk sea cliff in Britain. It's another fine spot with views all the way to West Sussex and Kent. After taking in the views the route then descends to Eastbourne, passing along the seafront before finishing at the pier.",
  "video_url": "https://www.youtube.com/embed/ZqIrJ5qjMEQ",
  "postcode": "BN25 4AB",
  "county": "East Sussex",
  "region": "South East",
  "country": "England"
}