{
  "created_at": "2025-01-06T04:16:37.480038+00:00",
  "objectID": "43eb61aa27f7dacc041c5fbb3e1504e8",
  "ref": "pen-y-fan-walking-route",
  "title": "Pen Y Fan From Storey Arms Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Pen_y_Fan_-_geograph.org.uk_-_764969.jpg",
  "nearby": [
    {
      "description": "Pen y Fan Horseshoe Walk",
      "objectID": "cd902c3116a5d8dd1fa00894db4c47bb",
      "ref": "pen-y-fan-horseshoe-walk-walking-route"
    },
    {
      "description": "Brecon Beacons Way",
      "objectID": "4adcdd2b37eb2d33c13c059536b8417d",
      "ref": "brecon-beacons-way-walking-route"
    },
    {
      "description": "Beacons Reservoir",
      "objectID": "be2759504a44627a57c3418038d3ac7e",
      "ref": "beacons-reservoir-walking-route"
    },
    {
      "description": "Llyn Cwm Llwch",
      "objectID": "e271075ed9dcb351a35c170dc4b6c7bd",
      "ref": "llyn-cwm-llwch-walking-route"
    },
    {
      "description": "Cantref Reservoir",
      "objectID": "de3a576f89390edb78f62efc785e535e",
      "ref": "cantref-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/43eb61aa27f7dacc041c5fbb3e1504e8.gpx",
  "_geoloc": {
    "lat": 51.8716776743,
    "lng": -3.4776865662
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Pen_y_Fan_-_geograph.org.uk_-_764969.jpg",
      "title": "Jonathan Billinger / Pen y Fan",
      "caption": "This is the path which ascends the hill from the Cefn Cwm Llwch. The nose of Corn Du can be seen on the extreme left. Llyn Cwm Llwch is down to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Summit_of_Pen-y-Fan_-_geograph.org.uk_-_797061.jpg",
      "title": "Kenneth Yarham / Summit of Pen-y-Fan",
      "caption": "Summit of Pen-y-Fan, from the ridge route to Cribyn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/The_summit_of_Pen_y_Fan_-_geograph.org.uk_-_1302912.jpg",
      "title": "Kenneth Yarham / The summit of Pen y Fan",
      "caption": "The summit of the mountain. The stony summit of and its cairn with a view beyond along the northern edge of the National park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Pen-y-Fan_-_geograph.org.uk_-_802730.jpg",
      "title": "Kenneth Yarham / Pen-y-Fan",
      "caption": "Pen-y-Fan from the summit of Cribyn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Path_to_Corn_Du_-_geograph.org.uk_-_1108681.jpg",
      "title": "Graham Horn / Path to Corn Du",
      "caption": "Path to Corn Du. The direct route from Storey Arms to Corn Du passes through the south-east corner of this square, on the shoulder of Y Gyrn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/The_tourist_path_ascending_Corn_Du_-_geograph.org.uk_-_1115685.jpg",
      "title": "Jonathan Billinger / The tourist path ascending Corn Du",
      "caption": "The tourist path ascending Corn Du. The Beacons Way ascent from Storey Arms is well frequented by strollers and dog-walkers. It is well paved and maintained."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Corn_Du_and_Pen_y_Fan_from_Bwlch_Duwynt_-_geograph.org.uk_-_1040962.jpg",
      "title": "Peter Smyly, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Corn Du and Pen y Fan from Bwlch Duwynt. Corn Du on the left and Pen y Fan on the right. Once you have reached one summit, it is an easy task to walk down and up again to the other one. These are the two highest peaks in the Brecon Beacons. Pen y Fan means the top peak, a fitting name since it is the highest point in South Wales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Main_path_to_Pen_y_Fan_-_geograph.org.uk_-_1115747.jpg",
      "title": "Jonathan Billinger / Main path to Pen y Fan",
      "caption": "Main path to Pen y Fan. Round about the point where dog-walkers and easy Sunday strollers start to think about going back to the car."
    }
  ],
  "distance_km": 8.0,
  "description": "Climb the highest peak in South Wales and southern Britain on this stunning walk in the Brecon Beacons National Park. This is a challenging climb to the 2906 feet (886m) summit but the footpaths are generally very good for most of the walk. You start at the car park at Storey Arms about 10 miles north of Merthyr Tydfil. There is an alternative car park at Pont ar Daf just to the south if you prefer. The first stage passes through woodland and crosses Blaen Taf Fawr before ascending toward Bwlch Duwynt. You continue to Corn Du where there are fabulous views of the Neuadd Valley, Cantref Reservoir, Beacons Reservoir and Llwyn-on Reservoir. Shortly after you reach the summit of Pen Y Fan where you will find a former Bronze Age burial chamber. The views are fantastic with Sugar Loaf, the Bristol Channel , Carmarthen Bay, Swansea Bay, the Gower Peninsula, the Black Mountains, the Cambrian Mountains and Exmoor all visible on a clear day. From the summit you descend to Corn Du and then on to the heather covered Y Gyrn. You soon come to a woodland area and the finish point at the car park. For an alternative route to the summit try the wonderful Pen y Fan Horseshoe Walk. This fantastic ridge walk starts from the car park in Taf Fechan Forest and visits the Upper and Lower Neuadd Reservoirs, Corn Du and the Cribyn. The Brecon Beacons Way runs past the mountain so you could pick this up to continue your walk. Beacons Reservoir is also very near the start point to the walk so you could enjoy an easy waterside stroll here too.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Storey Arms Refreshments Kiosk is located next to the Storey Arms car park. You can pick up some well earned post walk refreshments including hot food and drinks here. Follow the A road north and you'll soon come to The Tai'r Bull Inn at Libanus. If it's a chilly day then the cosy interior with a traditional log fire will soon warm you up. There's also a lovely outdoor section with great views back to Pen-y-Fan. They have a good menu with a particular fine Sunday lunch and a fine selection of real ales. The inn also provides rooms if you would like to stay in the area. You can find them a couple of miles north of the car park at postcode LD3 8EL for your sat navs. They are also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north from the mountain car park and you can visit another highlight of the area at Llyn Cwm Llwch. It's a beautiful place and considered the best preserved glacial lake in South Wales. The epic Cambrian Way passes through the area. The long distance waymarked route starts from the city of Cardiff and runs for nearly 300 miles through the Brecon Beacons, the Cambrian Mountains and Snowdonia before finishing on the North Wales coast at Conwy. The Storey Arms is located next to the car park at the start of the route. The outdoor adventurous education offers residential and day visits for schools, youth groups and families. They organise activities such as Canoeing, hill walking, mountain biking and rock climbing. For more walking ideas in the area see the Brecon Beacons Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/y49yN7cD3pY",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A470, Glyn Tarell, Powys, Cymru / Wales, LD3 8NL, United Kingdom",
  "postcode": "LD3 8NL",
  "district": null,
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "hard",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}