{
  "created_at": "2025-01-06T04:50:51.955829+00:00",
  "objectID": "444fb3d84019bfb0cf1d3bee105c7dda",
  "ref": "dalby-forest-walking-and-cycle-route",
  "title": "Dalby Forest Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Autumn_ferns_in_Dalby_Forest_-_geograph.org.uk_-_1561544.jpg",
  "nearby": [
    {
      "description": "Pickering",
      "objectID": "8463cd586b92ae63a57a051352630d24",
      "ref": "pickering-walking-route"
    },
    {
      "description": "Wykeham Forest",
      "objectID": "decc0796f0bbabb327dc710cb721af16",
      "ref": "wykeham-forest-walking-and-cycle-route"
    },
    {
      "description": "Tabular Hills Walk",
      "objectID": "164ff337d1103761aae50fca51222fc4",
      "ref": "tabular-hills-walk-walking-route"
    },
    {
      "description": "Hackness",
      "objectID": "ce1b8692e494b9d4a7676fc0dfb0a4ed",
      "ref": "hackness-walking-route"
    },
    {
      "description": "Forge Valley Woods",
      "objectID": "8ae04bd75322a3680e85379c49f4e057",
      "ref": "forge-valley-woods-walking-route"
    },
    {
      "description": "West Ayton",
      "objectID": "f5f97c4a6c3fa49aedd026dab88858fa",
      "ref": "west-ayton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/444fb3d84019bfb0cf1d3bee105c7dda.gpx",
  "_geoloc": {
    "lat": 54.2759893729,
    "lng": -0.6866416968
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Autumn_ferns_in_Dalby_Forest_-_geograph.org.uk_-_1561544.jpg",
      "title": "Barrie Cann / Autumn ferns in Dalby Forest, via Wikimedia Commons",
      "caption": "Autumn ferns in Dalby Forest. The golds and bronzes of the ferns alongside the pathway were a beautiful site, and stretched as far as the eye could see. The forest is home to many species of wildlife such as badgers, roe deer and nightjars, as well as five species of bat. There are also several different species of trees including oak, beech, ash, alder and hazel. Sitka spruce is the prevalent tree species accounting for 30% of all trees in the forest. Other noteworthy flora includes narrow leaved marsh orchids, yellow bird's-nest and violet crown cup. There are four Sites of Special Scientifica Interest (SSSI) within the forest at Ellerburn Bank, Ellers Wood & Sand Dale, Seive Dale Fen and Troutsdale & Rosekirk Dale Fens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Staindale_Lake_Dalby_Forest_-_geograph.org.uk_-_5405.jpg",
      "title": "Martin Norman / Staindale Lake Dalby Forest, via Wikimedia Commons",
      "caption": "Staindale Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Thornton_Dale%2C_Dalby_Forest_-_geograph.org.uk_-_1561535.jpg",
      "title": "Barrie Cann / Thornton Dale, Dalby Forest, via Wikimedia Commons",
      "caption": "Thornton Dale. The beautiful colours of autumn. There is evidence of people living in Dalby Forest since the Bronze Age. Burial mounds, linear earthworks of unknown purpose and the remains of a flourishing rabbit warrening industry have also been found throughout the woods. In all there are 83 scheduled and over 600 unscheduled monuments within the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Fire_Tower_crossroads_in_Dalby_Forest_-_geograph.org.uk_-_290428.jpg",
      "title": "Phil Catterall / Fire Tower crossroads in Dalby Forest, via Wikimedia Commons",
      "caption": "Fire Tower crossroads in Dalby Forest. No fire tower is apparent here despite it being indicated on a recent 1:25000 Ordnance Survey Map. 150 million years ago, the region now enveloped by the forest was submerged underwater. Fossils dating from this epoch are scattered throughout the entire area. The primary soil composition on the moorland and spurs consists of Middle calcareous grit, or sandstone. In other areas, Hambleton Oolite Limestone and Yedmandale Limestone, along with sandstone, are prevalent. Mudstone, also known as Oxford Clay Formation, dominates the valley floor, with some pockets of peat bogs interspersed throughout. The forest is situated on an ascending terrain, ranging from an elevation low of 60m in Thornton Dale to a peak of 248m. Four principal water valleys traverse the landscape: Thornton Dale, Trouts Dale, Stain Dale, and Deep Dale. These dales were formed by the runoff of meltwater from glacial ice fields during the Devensian period."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Grain_Beck_in_Dalby_Forest_-_geograph.org.uk_-_1318006.jpg/256px-Grain_Beck_in_Dalby_Forest_-_geograph.org.uk_-_1318006.jpg",
      "title": "Andy Beecroft / Grain Beck in Dalby Forest, via Wikimedia Commons",
      "caption": "Grain Beck near Staindale Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Mountain_bike_trail_in_Dalby_Forest_-_geograph.org.uk_-_290450.jpg",
      "title": "Phil Catterall / Mountain bike trail in Dalby Forest, via Wikimedia Commons",
      "caption": "Start of one of the mountain bike trails in the forest. Enterprise have recently constructed special rough gravel paths throughout the forest for mountain bike enthusiasts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/The_tollgate_at_Dalby_Forest_Drive_-_geograph.org.uk_-_223220.jpg",
      "title": "Bill Griffiths / The tollgate at Dalby Forest Drive, via Wikimedia Commons",
      "caption": "The tollgate at Dalby Forest Drive. It costs £5 to take a car into Dalby Forest and this is where you stop to pay. (Its free in December for the locals - but don't tell anyone)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Wooden_walkway_at_Staindale_Lake%2C_Dalby_Forest_-_geograph.org.uk_-_1561494.jpg",
      "title": "Barrie Cann / Wooden walkway at Staindale Lake, Dalby Forest, via Wikimedia Commons",
      "caption": "This wooden walkway is across the boggy east end of Staindale Lake"
    }
  ],
  "distance_km": 8.5,
  "description": "Enjoy miles of cycling and walking trails in this large forest in the North York Moors. The forest has lots of different cycling trails to try. These range from easy family routes to challenging trails for experienced mountain bikers. You can hire a bike and then pick one of the colour coded trails. The easy green route is a great one for families while the 21 mile red route is a more challenging single track trail. The trails start from the Dalby Visitor Centre on Dalby Forest Drive. There's also miles of country lanes to follow through the forest and its surrounding area. For walkers there are also several good trails to choose from. The trails are of varying lengths and difficulty. You can try easy waterside walks around the pretty Staindale Lake or along Ellerburn Beck. There are also longer walks to the sandstone sculptures of the Bridestones or to Adderstone Rigg. This area of the North York Moors is great for walking and cycling with Wykeham Forest just a few miles to the east. Here you'll find more mountain bike trails and some climbs to great viewpoints. The circular Hackness Walk visits the forest from the nearby village. You can follow a pleasant riverside path along the River Derwent from the settlement to the forest. The Tabular Hills Walk long distance trail also runs through the woods. The waymarked 48 mile trail takes you across the southern boundary of the North York Moors National Park from Scarborough to Helmsley. The forest is located close to the ancient market town of Pickering where you can visit Pickering Castle and enjoy countryside trails along the Pickering Beck.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Lockton village is located on the north western fringes of the forest. Here you'll find the Loft Tea Rooms and Gallery. These delightful tea rooms are the ideal place to enjoy a cream tea after your walk. It's an Idyllic setting with the tea rooms surrounded by pretty gardens and attractive North York Moors countryside. The site includes a lovely gallery which showcases the work of local artists who have painted the beautiful surroundings. There's also Tag’s Bistro which offers a varied range of dining options and an evening menu. You can find the cafe in the village on Hudgin Lane with a postcode of YO18 7QA for you sat navs. In the village there's also a Youth Hostel and several holiday cottages if you need accommodation. Also nearby is Levisham where you'll find the 19th century Horseshoe Inn. It's in a lovely spot in the pretty village and includes a nice outdoor seating area if the weather is fine. The pub was featured in an article for The Telegraph's 'The 30 best winter pubs in Britain, for dog-lovers, walkers, foodies and more'. There's a good menu and a warm welcome at the this traditional country pub. You can find the pub at postcode YO18 7NL. They also have a sister pub in Lockton called the Fox and Rabbit. There's another splendid outdoor area with fine views of the countryside here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The forest is excellent for dog walking with miles of nice wide tracks for them to explore. You will probably see plenty of other owners on your outing. The Horseshoe Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of the forest there's a few worthy sites to visit. About 2 miles north east of the car park you'll find a series of fascinating sandstone sculptures at the Bridestones. These date back to the Jurassic period 150 million years ago and are a highlight of the area. Near here you'll also find the stunning Hole of Horcum. This beautiful natural amphitheatre is located on Levisham Moor and another must see in the area. On the western side of the moor you'll find the wonderfully positioned Skelton Tower. The tower dates from 1830 and sits perched high above the moor in a dramatic and picturesque spot. There are great views over Goathland Moor and the steam trains of the North York Moors Railway below. It's a great spot to take some stunning photos. At the northern edge of the forest there's the climb to the ancient standing stones and fine viewpoint at Blakey Topping. This circular walk starts from the Crosscliff car park and viewpoint at the northern end of Dalby Forest. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://player.vimeo.com/video/105037037",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Red 37, Low Dalby, Thornton-le-Dale, North Yorkshire, York and North Yorkshire, England, YO18 7LT, United Kingdom",
  "postcode": "YO18 7LT",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "forest",
    "mountain"
  ],
  "points_of_interest": [
    "visitor center",
    "sculptures",
    "viewpoint",
    "settlement"
  ],
  "facilities": [
    "car park",
    "pub/cafe",
    "dog friendly",
    "play area"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}