{
  "objectID": "445a90e64c61028cb0612953ca5b2b13",
  "created_at": "2024-12-21T19:37:16.873555+00:00",
  "ref": "carrowkeel-walking-route",
  "title": "Carrowkeel Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706180256.jpg/512px-County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706180256.jpg",
  "nearby": [
    {
      "description": "Lough Allen",
      "objectID": "57f2cc985ffbef96b0e0ace8d5871f9f",
      "ref": "lough-allen-walking-route"
    },
    {
      "description": "Carrick On Shannon",
      "objectID": "8da718cee891050c122234771ec652a6",
      "ref": "carrick-on-shannon-walking-route"
    },
    {
      "description": "Lough Key Forest Park",
      "objectID": "5512b3c66998993191fab92efb47885e",
      "ref": "lough-key-forest-park-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/6F176D36F94E5ABB86258A7E005F34D0/$FILE/carrowkeel.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706180256.jpg/512px-County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706180256.jpg",
      "title": "Rob Hurson, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "The Carrowkeel tombs are protected National Monuments and are considered one of the \"big four\" passage tomb cemeteries in Ireland, along with Carrowmore,  Brú na Bóinne and Loughcrew. The monuments were first excavated in 1911 by a team led by R.A.S. Macalister, with Robert Lloyd Praeger and Edmund Clarence Richard Armstrong. These excavations unearthed a variety of items including animal bones, cremated human remains, and Neolithic tools and pottery. The specific type of pottery discovered, known as Carrowkeel Ware, was first identified at these sites. Some Bronze Age pottery was also found. While some artefacts are housed in the National Museum of Ireland, most of the bone collection was taken to Cambridge University, where Macalister's father, Alexander, was a professor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706180551.jpg/512px-County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706180551.jpg",
      "title": "Rob Hurson, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Praeger described a haunting experience during their initial entry into one of the Carrowkeel tombs, finding it untouched since the last Bronze Age inhabitant, with remnants like stone beads, bone tools, and fragments of decayed pottery.  Research at Cambridge's Leverhulme Centre for Human Evolutionary Studies, as part of the Human Population Dynamics at Carrowkeel Project, corrected the initial dating of the monuments to between c. 3,500 and 2,500 Cal. BC. Isotope analysis suggested that the individuals buried there had lived in a carboniferous limestone region, likely near Carrowkeel. DNA studies of six individuals revealed ancestral links to Anatolia, showing closer ties to the Mediterranean than the Danubian expansion of early farming in Europe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706173845.jpg/512px-County_Sligo_-_Carrowkeel_Megalithic_Cemetery_-_20190706173845.jpg",
      "title": "Rob Hurson, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Carrowkeel, located above Lough Arrow in the Bricklieve Mountains, features fourteen central passage tombs, with some accessible through narrow passages. The tombs, often facing northwest towards Cúil Irra, Knocknarea, and Carrowmore, form part of a larger complex with twelve more within a 6km radius. One notable outlier is the giant passage tomb, Heapstown Cairn, part of the legendary Moytura, a site of mythical battles.  Conservation of these monuments is critical as they face threats from visitors causing physical damage and graffiti, which can harm ancient megalithic art. Treasure hunting at these sites, which predate the use of metals in Ireland, is illegal and damaging. Irish folklore warns against disrespecting such tombs, as it is believed to bring bad luck or a curse. The Office of Public Works is developing a preservation and protection plan for Carrowkeel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Carrowkeel_Passage_Tomb_-_geograph.org.uk_-_1929464.jpg",
      "title": "Carrowkeel Passage Tomb by John M, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": ""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Two_of_the_carrowkeel_tombs.jpg/512px-Two_of_the_carrowkeel_tombs.jpg",
      "title": "Jon Sullivan, Public domain, via Wikimedia Commons",
      "caption": ""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/The_path_up_to_the_central_monuments_at_Carrowkeel%2C_Sligo.JPG/512px-The_path_up_to_the_central_monuments_at_Carrowkeel%2C_Sligo.JPG",
      "title": "Shane Finan, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": ""
    }
  ],
  "distance_km": 5.4,
  "description": "This walk visits the fascinating ancient site of Carrowkeel in south County Sligo. There are some pleasant footpaths to follow around the site which includes a cluster of Neolithic passage tombs dating from the 4th millennium BC. You can start the walk from the parking area to the west of the site and then follow country lanes south before turning east to head up to the tombs. The tombs are located in an elevated spot in the Bricklieve Mountains so there are fine views over the surrounding area to enjoy on the walk. To continue your walking in the area you could head east to visit Lough Allen where there's a nice circular walk. You can also pick up the long distance Leitrim Way here.",
  "video_url": "https://www.youtube.com/embed/KfzkcEqgdac?si=x3CrzLLV8D2p_j_I"
}