{
  "objectID": "448aef174c1db685f7119f79095b1da6",
  "created_at": "2024-12-18T23:39:11.632996+00:00",
  "ref": "launceston-walking-route",
  "title": "Launceston Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Launceston_Castle_-_geograph.org.uk_-_93182.jpg/256px-Launceston_Castle_-_geograph.org.uk_-_93182.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/E483D5EB6FA95355802584EA0050BE5D/$FILE/Launceston.gpx",
  "_geoloc": {
    "lat": 50.6365538636,
    "lng": -4.3621221324
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Launceston_Castle_-_geograph.org.uk_-_93182.jpg/256px-Launceston_Castle_-_geograph.org.uk_-_93182.jpg",
      "title": "Ernie Camacho / Launceston Castle",
      "caption": "Launceston Castle. This old castle dominates the skyline of Launceston (the only walled town in Cornwall). George Fox, founder of the Quakers, was imprisoned here for 8 months in 1656."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Launceston_-_the_castle_-_geograph.org.uk_-_571477.jpg",
      "title": "Chris Downer / Launceston: the castle",
      "caption": "Launceston: the castle. A fine motte and bailey castle on a fine summer's day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Launceston_Castle_Gate_-_geograph.org.uk_-_320679.jpg",
      "title": "Tony Atkin / Launceston Castle Gate",
      "caption": "An imposing entrance to the castle grounds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Lifton%2C_the_river_Lyd_near_Lifton_Bridge_-_geograph.org.uk_-_85214.jpg",
      "title": "Martin Bodman / Lifton: the river Lyd near Lifton Bridge",
      "caption": "Lifton: the river Lyd near Lifton Bridge. Below Lifton village, looking west"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/South_Lodge%2C_Lifton_-_geograph.org.uk_-_460150.jpg",
      "title": "Derek Harper / South Lodge, Lifton",
      "caption": "South Lodge, Lifton This C19 lodge beside Lifton Bridge is one of two for Lifton Park, although technically it is east of the house rather than south of it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/St_Mary%27s_church%2C_Lifton_-_geograph.org.uk_-_458986.jpg/256px-St_Mary%27s_church%2C_Lifton_-_geograph.org.uk_-_458986.jpg",
      "title": "Derek Harper / St Mary's church, Lifton",
      "caption": "St Mary's church, Lifton The church, with big pinnacles on its west tower, sits just above the village centre, and just north of a gridline. Seen from the grassy bank beside Parsonage Court."
    }
  ],
  "distance_km": 8.5,
  "description": "This Cornish town sits on the border with Devon in the lovely Tamar Valley. Two excellent waymarked trails begin their journey in Launceston, in the shape of the Two Castles Trail and the Tamar Valley Discovery Trail. These are both great options for exploring the beautiful countryside surrounding the town. This walk uses a section of the Two Castles Trail to take you to the nearby village of Lifton. You start of at Launceston Castle which has a history dating back to the 11th century. Today the castle is owned by the duchy of Cornwall and operated by English Heritage as a tourist attraction. Much of the castle defences remain, including the motte, keep and high tower which overlook the castle's former deer park to the south. The castle marks the start of the Two Castle's Trail which you can follow east through the countryside to Liftondown and and Lifton in Devon. The pretty village sits on the confluence of the rivers Wolf and Lyd so there are some nice riverside paths to try in this area. You can return to Launceston on the same paths or catch the bus back if you prefer. Also near the town is the lovely Roadford Lake. The large 730 acre lake has a number of waymarked trails and lots of wildlife to look out for on the way.",
  "postcode": "PL15 7DR",
  "district": "Launceston",
  "county": "Cornwall",
  "region": "South West",
  "country": "England"
}