{
  "objectID": "449d715751bdf9dd4b603dab63857abe",
  "created_at": "2024-12-19T07:29:41.511076+00:00",
  "ref": "bangor-walking-route",
  "title": "Bangor Mountain, Coast and Woods Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Pier_y_Garth_Bangor_Garth_Pier_-_geograph.org.uk_-_680447.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/449d715751bdf9dd4b603dab63857abe.gpx",
  "_geoloc": {
    "lat": 53.23668607,
    "lng": -4.12216901
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Pier_y_Garth_Bangor_Garth_Pier_-_geograph.org.uk_-_680447.jpg",
      "title": "Alan Fryer / Pier y Garth Bangor Garth Pier, via Wikimedia Commons",
      "caption": "Pier y Garth Bangor Garth Pier. Looking from the entrance down the length of the pier"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Pier_y_Garth_Bangor_Garth_Pier_-_geograph.org.uk_-_680728.jpg",
      "title": "Alan Fryer / Pier y Garth Bangor Garth Pier, via Wikimedia Commons",
      "caption": "Looking towards Glyn y Garth across Afon Menai from Garth Pier"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_12th_century_earthworks_of_the_Roman_Camp_-_geograph.org.uk_-_657757.jpg",
      "title": "Eric Jones / The 12th century earthworks of the Roman Camp, via Wikimedia Commons",
      "caption": "The 12th century earthworks of the Roman Camp. Bangor's Roman Camp is Norman rather than Roman. The earthworks are the remains of a well positioned motte and bailey castle built by Hugh D'Avranches, the Earl of Chester, early in the 12th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Meadow_and_mast_on_Bangor_Mountain_-_geograph.org.uk_-_812675.jpg",
      "title": "Eric Jones / Meadow and mast on Bangor Mountain, via Wikimedia Commons",
      "caption": "Meadow and mast on Bangor Mountain"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Panoramic_view_of_Bangor_from_Bangor_Mountain_-_geograph.org.uk_-_2110537.jpg/512px-Panoramic_view_of_Bangor_from_Bangor_Mountain_-_geograph.org.uk_-_2110537.jpg",
      "title": "Panoramic view of Bangor from Bangor Mountain by Meirion, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Panoramic view of Bangor from Bangor Mountain"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Grade_II_listed_North_Wales_Heroes_Memorial%2C_Bangor_-_geograph.org.uk_-_2914164.jpg",
      "title": "Grade II listed North Wales Heroes Memorial, Bangor by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Grade II listed North Wales Heroes Memorial, Bangor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Bangor_Cathedral_-_geograph.org.uk_-_2877090.jpg/512px-Bangor_Cathedral_-_geograph.org.uk_-_2877090.jpg",
      "title": "Bangor Cathedral by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bangor Cathedral"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Garth%2C_Bangor_-_geograph.org.uk_-_3824259.jpg",
      "title": "Garth, Bangor by easthantsxc, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A bike rests against the railings near the pier at Garth"
    }
  ],
  "distance_km": 7.0,
  "description": "This walk around Bangor takes you to some of the highlights of the coastal town. You'll visit the interesting Roman Camp, walk along the coastal path, climb to Bangor Mountain and enjoy a stroll along Garth Pier. There's also a woodland and riverside section along an old railway path. The walk starts at Garth with a walk along the pier. The popular pier provides wonderful views over the Menai Strait, which separates the island of Anglesey from the mainland of Wales. Atfer exploring the pier head west along the coast path to visit the Bangor Roman Camp. The area is now a nature reserve but in the 12th century the hill top was occupied by a fort. There's woodland trails, interesting flora and fauna and more nice views over the Menai Strait from the elevated position of the hill fort. After viewing the site the walk returns to the coast path before heading inland to climb Bangor Mountain. There are several rocky outcrops at high points on the mountain providing panoramic views of the city centre, the Menai Strait and over to the east of Anglesey, including the town of Beaumaris. This is probably the best location from which to see the city highlights including Bangor University and the cathedral. After taking in the views the route then descends to the east where you can pick up a section of the North Wales Path. The waymarked trail will lead you north along the River Cegin to the coast. The route then finishes with another coastal section leading you back to Garth Point. To extend the walk you could head east and visit Penrhyn Castle. Here you will find 60 acres of woodland and parkland surrounding a large 19th-century neo-Norman castle. Also nearby is Plas Newydd where there are lovely woodland walks and pretty gardens. There's also the option of crossing the Menai Bridge and picking up the wonderful Anglesey Coast Path. Our Menai Bridge Walk takes you across the bridge and also visits the lovely Treborth Gardens. Also of note is the North Wales Coast path which starts in the town and heads all the way to Prestatyn, with the first section running to Conwy. To further continue your walking around Bangor you could head east into the wonderful Snowdonia National Park where there are miles of trails to try. You could follow the North Wales Path east and visit Abergwyngregyn and Aber Falls. The falls are one of the walking highlights of the area and well worth a visit.",
  "video_url": "https://www.youtube.com/embed/X8eBbUK0a6c",
  "postcode": "LL57 2SW",
  "district": "Bangor",
  "county": "Gwynedd - Gwynedd",
  "region": "Wales",
  "country": "Wales"
}