{
  "created_at": "2025-01-06T09:58:08.628763+00:00",
  "objectID": "44e5492f8b5b979c55e7e27436548937",
  "ref": "tadcaster-viaduct-walk-walking-route",
  "title": "Tadcaster Viaduct Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/52/Tadcaster_%28geograph_2132099%29.jpg",
  "nearby": [
    {
      "description": "Towton Battlefield",
      "objectID": "c4d84921196f376387c6bdfc5508d52f",
      "ref": "towton-battlefield-walking-route"
    },
    {
      "description": "Jorvic Way",
      "objectID": "7a353e892d2c506a9cebc22a31e84d8a",
      "ref": "jorvic-way-walking-route"
    },
    {
      "description": "Ebor Way",
      "objectID": "460b6eaefa835488435e3937ef49f82d",
      "ref": "ebor-way-walking-route"
    },
    {
      "description": "Lotherton Hall Estate",
      "objectID": "e25e4d911f6c64482bbcd52fd364c665",
      "ref": "lotherton-hall-estate-walking-route"
    },
    {
      "description": "Aberford",
      "objectID": "3eefc7797d6273f8cd82cdbe7cba6fcd",
      "ref": "aberford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/44e5492f8b5b979c55e7e27436548937.gpx",
  "_geoloc": {
    "lat": 53.8848302068,
    "lng": -1.2606753512
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Tadcaster_%28geograph_2132099%29.jpg",
      "title": "BC / Tadcaster",
      "caption": "River and viaduct view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/The_River_Wharfe_upstream_of_the_collapsed_bridge_%28geograph_4799723%29.jpg",
      "title": "Graham Hogg / The River Wharfe upstream of the collapsed bridge",
      "caption": "The River Wharfe upstream of the collapsed bridge. Taken from the old railway viaduct, currently (January 2016) the only means pedestrians have for crossing the river in Tadcaster following the collapse of the road bridge in the floods of December 2015."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Tadcaster_%285933628427%29.jpg/512px-Tadcaster_%285933628427%29.jpg",
      "title": "Tim Green from Bradford [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Countryside around Tadcaster"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/River_Wharfe%2C_Weir_and_Viaduct_-_geograph.org.uk_-_716134.jpg",
      "title": "Betty Longbottom / River Wharfe, Weir and Viaduct",
      "caption": "River Wharfe, Weir and Viaduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/St_Mary%27s_church_-_geograph.org.uk_-_720570.jpg",
      "title": "Gordon Hatton / St Mary's church",
      "caption": "St Mary's church, located close to the river in the town. Attractive parish church of the perpendicular period which was taken down in 1875-7 and re-erected after being raised five feet to avoid flooding from the nearby river. Records show that this work cost a total of £8426, 4 shillings and 6 pence halfpenny. Only the tower remained in its original position. This work seems to have been done in a sensitive manner as the church doesn't exhibit the usual results of Victorian restoration and improvement."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Tadcaster_Bridge_-_geograph.org.uk_-_720558.jpg",
      "title": "Gordon Hatton / Tadcaster Bridge",
      "caption": "Tadcaster Bridge. An important crossing of the River Wharfe, once carrying the main Leeds to York road. The bridge is early 18th century and is reputedly built of stone taken from the old castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Timber_framed_building%2C_Tadcaster_-_geograph.org.uk_-_720575.jpg",
      "title": "Gordon Hatton / Timber framed building, Tadcaster",
      "caption": "The Ark, a timber framed building in the town. Odd to find a timber framed building in a town which is known for its limestone buildings. This much restored building in Kirkgate has limestone in the lower walls with typical Vale of York style timber work above. It is the oldest building in active use in the town, built in the late-15th century, although it has been enlarged and altered many times since. Two carved heads on its front represent the heads of Noah and his wife, hence its name. The Ark has been a meeting place, a post office, an inn, a butcher's shop, a private house and a museum; it is currently the Town Council offices."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/The_Wharfe_approaching_Tadcaster_-_geograph.org.uk_-_722577.jpg",
      "title": "Gordon Hatton / The Wharfe approaching Tadcaster",
      "caption": "The Wharfe a mile above Tadcaster. The Wharfe is one of Yorkshire's most attractive rivers, but its lower reaches are less well known than its course through Wharfedale and past Ilkley"
    }
  ],
  "distance_km": 1.8,
  "description": "This walk visits the impressive Tadcaster Viaduct across the River Wharfe in the Yorkshire town of Tadchester. The viaduct was constructed as part of the northern section of the Leeds-York Line. It consists of 11 arches, 7 west of the river, 2 east of the river, and 2 wider arches across the River Wharfe. Start the walk from the Bridge Street Bridge and follow Wharfe Bank Terrace along the river to the viaduct. You can then climb up to the viaduct where there is a footpath running along the top. There's nice views over the town and the river from the elevated position of the viaduct. The interesting market town has other historical sites to visit after your walk. The oldest building in active use in the town is 'The Ark', built in the late-15th century. There's also Tadcaster Bridge built in 1700 which connects two parts of the town centre. To continue your walking around Tadcaster you could head south and try the Towton Battlefield Walk. The historical walk explores the site of the Battle of Towton which was fought on 29 March 1461 near the village of Towton. The Jorvic Way and the Ebor Way also pass through the town. You can pick up these trails to explore the countryside surrounding the town. Heading north east on the Ebory Way will take you through the countryside to Copmanthorpe. There's also nice riverside footpaths heading south east from Tadcaster to the nearby village of Ulleskelf.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head few miles south of Tadcaster and you'll find one of the historic highlights of the area at the Lotherton Hall Estate. The fine Edwardian house is surrounded by beautiful parkland with woodland, a deer park and a bird garden to see. The circular Aberford Walk starts in the nearby village and explores the surrounding countryside before visiting the hall. On the way you'll pass Saxton and the noteworthy Crooket Billet pub which is famous for its giant Yorkshire Puddings. Just north of the village you can pick up the Hazlewood Castle Walk and visit the nearby country estate. Here you'll find expansive bluebell woods and a mountain bike trail located to the west of the 18th century mansion which is now run as a hotel. Parlington Woods on the historic Parlington Hall Estate can be visited near here. Just north of the woods you can also explore the villages of Barwick-in-Elmet and Thorner. Here you could visit Bramham Park where there are hundreds of acres of parkland, gardens, woodland and countryside to explore. The landscaped park surrounds the historic 18th century Bramham House which is a Grade I listed building."
    }
  ],
  "postcode": "LS24 9BA",
  "district": "Tadcaster",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wharfe Bank Terrace, Tadcaster, North Yorkshire, York and North Yorkshire, England, LS24 9BA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "footpath"
  ],
  "points_of_interest": [
    "historical sites",
    "town views"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}