{
  "created_at": "2025-01-06T01:15:00.407581+00:00",
  "objectID": "44ec2b3b8b7e98043f939264377f2f88",
  "ref": "bedford-purlieus-national-nature-reserve-walking-route",
  "title": "Bedford Purlieus National Nature Reserve Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/de/Bedford_Purlieus_-_geograph.org.uk_-_1228190.jpg",
  "nearby": [
    {
      "description": "Nene Way",
      "objectID": "069bba7a02799aa7ca3ec8c4f9c867fe",
      "ref": "nene-way-walking-route"
    },
    {
      "description": "Wansford",
      "objectID": "2c730355290c16a7bd5978cfad46d1e8",
      "ref": "wansford-walking-route"
    },
    {
      "description": "Harringworth Welland Viaduct",
      "objectID": "6402c801bd00042c8f38254b0a54dabf",
      "ref": "harringworth-welland-viaduct-walking-route"
    },
    {
      "description": "Kings Cliffe Railway Walk",
      "objectID": "4ab67c0af9f67651b479fcc04e650522",
      "ref": "kings-cliffe-railway-walk-walking-route"
    },
    {
      "description": "Blatherwycke Lake",
      "objectID": "51e4d2d8c50251fa499c614cb8a6e2ab",
      "ref": "blatherwycke-lake-walking-route"
    },
    {
      "description": "Barnack Hills And Holes",
      "objectID": "33cbb2f7fc0baf18439beaa72f67c840",
      "ref": "barnack-hills-and-holes-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/44ec2b3b8b7e98043f939264377f2f88.gpx",
  "_geoloc": {
    "lat": 52.5860314554,
    "lng": -0.4575667166
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Bedford_Purlieus_-_geograph.org.uk_-_1228190.jpg",
      "title": "Simon Huguet / Bedford Purlieus, via Wikimedia Commons",
      "caption": "A woodland ride in the National Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Bedford_Purlieus_-_geograph.org.uk_-_1228194.jpg",
      "title": "Simon Huguet / Bedford Purlieus, via Wikimedia Commons",
      "caption": "The ancient woodland is a National Nature Reserve managed by the Forestry Commission."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Ash_tree%2C_Bedford_Purlieus_NNR_-_geograph.org.uk_-_66176.jpg",
      "title": "Katie / Ash tree, Bedford Purlieus NNR, via Wikimedia Commons",
      "caption": "Ash tree, Bedford Purlieus NNR. Bedford Purlieus is a National Nature Reserve and contains many interesting species of flora and fauna."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Green_Arch_Bridleway_-_geograph.org.uk_-_187438.jpg",
      "title": "Michael Patterson / Green Arch Bridleway, via Wikimedia Commons",
      "caption": "Green Arch Bridleway"
    }
  ],
  "distance_km": 3.5,
  "description": "These splendid ancient woods near Peterborough have miles of woodland walking trails to try. You can start the walk from the car park off the A47, just east of Wansford (postcode PE8 6NN). The area is a hidden gem with 520 acres of ancient woodland to explore. The extensive flora includes beech, birch, field maple, bluebells, primroses, celandines, violets and wood anemones, wild strawberries and garlic. There's also lots of wildlife to look out for including deer, cuckoo, foxes, red kites and buzzards. The woods contains more plant and insect species than most other woods in this country. Bedford Purlieus is located just to the west of the lovely riverside village of Wansford. The Nene Way long distance footpath runs through the village so you could pick this up to extend your walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the nearby village of King's Cliffe there's the The Cross Keys for some rest and refreshment after your exercise. The pub dates back to 1732 and includes a charming old interior with oak beams and inglenook fireplaces. They serve a fine Sunday roast and also provide rooms if you'd like to stay over. You can find them on West Street at postcode PE8 6XA for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Wansford Walk starts from the nearby riverside village. It visits the reserve and the ancient woodland of Old Sulehay Forest just to the east. The route also passes through the picturesque settlements of Yarwell and Nassington. A few miles to the west there's some excellent mountain bike trails and walking routes to be found at Wakerley Woods and Fineshade Woods. Near here there's also the noteworthy Harringworth Welland Viaduct to admire. The Grade II listed viaduct is about a kilometre long, and was completed in 1878. It contains 82 arches and is notable as the longest masonry viaduct across a valley in Britain. Just to the south west you'll find the pretty village of King's Cliffe where you can pick up the Kings Cliffe Railway Walk. The easy trail runs along a now disused railway line to the east of the village. King's Cliffe is also a pleasant place for a stroll with a Norman church, picturesque 17th century almshouses and nice views of the Willow Brook, a tributary of the River Nene. There's also a fine old 18th century pub for refreshments afterwards. Near here there's also Blatherwycke Lake to explore. There's some lovely waterside trails with lots of birdlife to see on the water at this scenic spot. For more walking ideas in the area see the Cambridgeshire Walks page."
    }
  ],
  "postcode": "PE8 6NN",
  "county": "City of Peterborough",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}