{
  "objectID": "4503cc2743cc716718018acbcf230bed",
  "created_at": "2024-12-18T01:48:26.419380+00:00",
  "ref": "farndon-walking-route",
  "title": "Farndon Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Farndon_Village_-_geograph.org.uk_-_58487.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4503cc2743cc716718018acbcf230bed.gpx",
  "_geoloc": {
    "lat": 53.0840697564,
    "lng": -2.8791229683
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Farndon_Village_-_geograph.org.uk_-_58487.jpg",
      "title": "Dennis Turner / Farndon Village",
      "caption": "Farndon Village. Birthplace of the 17th century map maker John Speed. Although born here, he left at the age of 18 to work as a tailor in London and only in his fifties did he take up map making."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Pasture_alongside_the_River_Dee_-_geograph.org.uk_-_1349038.jpg",
      "title": "Alan Murray-Rust / Pasture alongside the River Dee",
      "caption": "Pasture alongside the River Dee south of Farndon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/The_River_Dee_near_Holt_Castle_-_geograph.org.uk_-_980945.jpg",
      "title": "Eirian Evans / The River Dee near Holt Castle",
      "caption": "The River Dee near Holt Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Remains_of_Holt_Castle_-_geograph.org.uk_-_352189.jpg",
      "title": "Peter Craine / Remains of Holt Castle",
      "caption": "Remains of Holt Castle. This was built in the 13th century following the conquest of North Wales by King Edward I. After playing a crucial part in the Civil war in the 17th c. it was partly demolished and the stones from the site were used to build Eaton Hall. The remains of the castle, shown above, are believed to be the inner courtyard. The building was also called Castle Lyons originally."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Farndon_Bridge_-_geograph.org.uk_-_1842921.jpg/512px-Farndon_Bridge_-_geograph.org.uk_-_1842921.jpg",
      "title": "Farndon Bridge by Anthony Parkes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Farndon Bridge. This noteworthy structure crosses the River Dee and the England-Wales border between Farndon on the English side and Holt, Wrexham on the Welsh. The 14th century bridge is Grade I listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/River_Dee_meander_below_Dogkennel_Farm%2C_Shocklach_-_geograph.org.uk_-_548378.jpg",
      "title": "Philip Ingram / River Dee meander below Dogkennel Farm, Shocklach",
      "caption": "River Dee meander below Dogkennel Farm, Shocklach. The Dee has cut low cliffs in the glacial clay as it meanders down its flood plain. This area is frequently completely inundated."
    }
  ],
  "distance_km": 18.0,
  "description": "This pretty village is located on the banks of the River Dee right on the England-Wales Border. Historic features in the settlement include the medieval stone bridge and St Chad's church which dates from the 14th century. This route uses sections of The Marches Way and the Bishop Bennet Way to create a circular walk around the village. On the way you'll enjoy fine views of the River Dee and visit the neighbouring settlements of Shocklach and Churton. The walk starts in the village and follows the waymarked Marches Way south along the River Dee, passing the village of Holt and the remains of its historic castle. You continue south, passing Crewe-by-Farndon and Caldecott Green before coming to Shocklach. You could stop off here for refreshment at what is roughly the half way point on the walk. The route then picks up the Bishop Bennet Way and follows it north to Castletown, Wetreins Green and Rowleyhill. The trail will eventually lead you into the village of Churton where you can pick up the Marches Way again, and follow it south back to Farndon.",
  "video_url": "https://www.youtube.com/embed/QeqLy2AyVg0",
  "postcode": "CH3 6QF",
  "district": "Farndon",
  "county": "Cheshire West and Chester",
  "region": "North West",
  "country": "England"
}