{
  "created_at": "2025-01-05T22:30:22.240919+00:00",
  "objectID": "4533e7ff5a4e6194eb25a8f820743ee4",
  "ref": "chichester-harbour-walking-route",
  "title": "Chichester Harbour Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/View_Across_Chichester_Harbour_-_geograph.org.uk_-_1720247.jpg/512px-View_Across_Chichester_Harbour_-_geograph.org.uk_-_1720247.jpg",
  "nearby": [
    {
      "description": "Thorney Island",
      "objectID": "2c10245d0aef7db4f6681cde77494dfc",
      "ref": "thorney-island-walking-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Chichester Canal",
      "objectID": "1e8bcd65c69dc75467ac241ecc43c213",
      "ref": "chichester-canal-walking-route"
    },
    {
      "description": "New Lipchis Way",
      "objectID": "308aa2c4709a534d0490bf1ea452e10e",
      "ref": "new-lipchis-way-walking-route"
    },
    {
      "description": "West Sussex Literary Trail",
      "objectID": "29bd03faa16e6ef2738d90aa3d00470f",
      "ref": "west-sussex-literary-trail-walking-route"
    },
    {
      "description": "Pagham Harbour",
      "objectID": "6d427ed206907a4b53e7d5f39d94fc93",
      "ref": "pagham-harbour-walking-route"
    },
    {
      "description": "Chichester Walls Walk",
      "objectID": "6b8a5fb7bc7b089b606d656dbda29b12",
      "ref": "chichester-walls-walk-walking-route"
    },
    {
      "description": "Chichester Marina and Birdham",
      "objectID": "e97a821ad26d7efbc0887e8d4fb84827",
      "ref": "chichester-marina-and-birdham-walking-route"
    },
    {
      "description": "Chidham",
      "objectID": "94bf4181053e3306eda2b708f8222f39",
      "ref": "chidham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4533e7ff5a4e6194eb25a8f820743ee4.gpx",
  "_geoloc": {
    "lat": 50.8423423063,
    "lng": -0.8971684509
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/View_Across_Chichester_Harbour_-_geograph.org.uk_-_1720247.jpg/512px-View_Across_Chichester_Harbour_-_geograph.org.uk_-_1720247.jpg",
      "title": "Peter Trimming / View Across Chichester Harbour",
      "caption": "View Across Chichester Harbour. At the Langstone side of the harbour, Langstone Mill can be seen to the right of picture, and The Royal Oak towards the left of picture. The area is one of the south coast's most popular sailing waters with as many as 12,500 craft regularly using the harbour, with competitive racing taking place among the 14 sailing clubs of the Chichester Harbour Federation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Entrance_to_Chichester_Harbour_-_geograph.org.uk_-_1350202.jpg",
      "title": "Peter Facey / Entrance to Chichester Harbour",
      "caption": "Entrance to Chichester Harbour From beach at West Wittering. The land in the distance is Eastoke Point. The harbour stands as one of four natural harbours along this stretch of the coastline, alongside Portsmouth Harbour, Langstone Harbour, and Pagham Harbour. It retains its status as one of the few remaining undeveloped coastal regions in Southern England, maintaining its wild character. Its extensive stretches and intricate creeks serve as both a vital wildlife sanctuary and some of Britain's most sought-after boating destinations. In the 10th century, nearby Chichester emerged as a significant town. Dell Quay served as the primary landing place, ranking as the 6th most important port in England at the time, with goods then transported by road to the town. The Domesday survey of 1086 provides insights into many villages that still exist today, including Bosham, Thorney, Fishbourne, Birdham, and Itchenor, along with details of assets such as mills, fisheries, and salterns. During Medieval Times (AD 410-1485), there was a general population decline in the area, although Bosham was an exception as it gained central importance. The village boasts a claim to being the most ancient site in Sussex with an unbroken tradition of Christianity. Its church was constructed around AD 1050-1100, and the famous Bayeux Tapestry depicts King Harold II (1066) praying at this church. Historical maps offer valuable insights into the changes in the Chichester Harbour Area of Outstanding Natural Beauty (AONB). The 1575 Saxton map illustrates Thorney Island as detached from the mainland, with the northern part of the island reclaimed relatively recently."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Mudflats_-_Chichester_Harbour_-_geograph.org.uk_-_603330.jpg",
      "title": "Bob Parkes / Mudflats - Chichester Harbour",
      "caption": "Harbour Mudflats. The area includes a number of diverse habitats, such as intertidal mudflats, shingle, saltmarsh, sand dunes, marshes and woodland. The mudflats provide feeding grounds for internationally important numbers of redshanks, ringed plovers, black-tailed godwits, dunlins, sanderlings, curlews and greenshanks. There are also geologically important sand dunes and shingles at East Head and east of Langstone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Chichester_Harbour_-_geograph.org.uk_-_160633.jpg",
      "title": "Ray Stanton / Chichester Harbour",
      "caption": "High Tide with sailboats out on the water. Emsworth can be seen in the distance. The harbour is one of the south coast's most popular sailing waters with as many as 12,500 craft regularly using the harbour, with competitive racing taking place among the 14 sailing clubs of the Chichester Harbour Federation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Footpath_on_the_western_edge_of_Chidham_Peninsula_-_geograph.org.uk_-_2683139.jpg/512px-Footpath_on_the_western_edge_of_Chidham_Peninsula_-_geograph.org.uk_-_2683139.jpg",
      "title": "Footpath on the western edge of Chidham Peninsula by Shazz, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath on the western edge of Chidham Peninsula. A population of Common Seals (Phoca vitulina), also known as Harbour seals, inhabits the Solent and frequently ventures into Chichester Harbour. This harbour serves as the sole known rookery in the Eastern English Channel, rendering these seals regionally distinctive and consequently significant. On occasion, Atlantic Grey seals have also been observed in the area. Chichester Harbour offers an optimal habitat for these seals, as it remains relatively tranquil and abundant in food sources such as fish and crustaceans, which they feed on. Additionally, there is ample mud and sandbanks for them to rest on. Each seal possesses unique markings, and their colouration can vary from tan to grey, black, and brown. Females typically have a smaller size and longer lifespan compared to males. Seals can be spotted throughout the harbour and have been known to venture into marinas, occasionally choosing swimming platforms on moored boats as spots for a nap!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Looking_east_from_Chidham_peninsula_towards_Bosham_-_geograph.org.uk_-_2891226.jpg/512px-Looking_east_from_Chidham_peninsula_towards_Bosham_-_geograph.org.uk_-_2891226.jpg",
      "title": "Looking east from Chidham peninsula towards Bosham by Christopher Hilton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking east from Chidham peninsula towards Bosham. Huge populations of wildfowl and waders use the mudflats feeding on the rich plant life and the expansive populations of intertidal invertebrates. Over 7,500 Brent geese overwinter on the intertidal mud-land and adjacent farmland and around 55,000 birds reside in or visit the Harbour throughout the year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Footbridge_in_the_north-eastern_part_of_the_Chidham_peninsula_-_geograph.org.uk_-_1627033.jpg",
      "title": "Basher Eyre / Footbridge in the north-eastern part of the Chidham peninsula",
      "caption": "Footbridge in the north-eastern part of the Chidham peninsula. The harbour is one of the few remaining undeveloped coastal areas in Southern England and remains relatively wild. Its wide expanses and intricate creeks are a significant wildlife haven and among some of Britain's most popular boating waters."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Inlet_curving_with_the_coastal_path_approaching_Chidham_-_geograph.org.uk_-_1627883.jpg",
      "title": "Basher Eyre / Inlet curving with the coastal path approaching Chidham",
      "caption": "Inlet curving with the coastal path approaching Chidham. Local farms in the background. The early 19th-century tithe maps offer insights into local industrial and agricultural activities, evident in field names such as 'Brick Kiln Marsh'. During the Industrial Revolution, the landscape saw the emergence of windmills, watermills, and tidemills. Industries like salt production persisted into the late 19th century, while local clay was utilised for brickmaking. Additionally, sectors such as fishing, boat building, and rope making thrived in the area. Later historical remnants reflect Britain's defense efforts. Thorney Island's airfield was established in 1938, and during the Second World War, defensive structures like pillboxes and machine gun positions dotted the coastline. Chichester Harbour played a strategic role, with measures like simulated urban lighting at Itchenor and a dummy airfield with fake planes at West Wittering aimed at diverting enemy bombers from Portsmouth. Following the war, a post-war surge in population, economic prosperity, and leisure time spurred the harbor's transformation into a prominent recreational hub for watersports on the South Coast of England. The boat population expanded rapidly, moorings and marina berths multiplied, and the area faced increasing pressure from development and human activity. In response, the Conservancy was established in 1971 to oversee the management of both land and water within the Chichester Harbour Area of Outstanding Natural Beauty (AONB)."
    }
  ],
  "distance_km": 10.0,
  "description": "This circular walk take you around the lovely Chidham peninsula. The peninsula extends southwards into Chichester Harbour and lies within an Area of Outstanding Beauty. It's a splendid place for a walk with footpaths running along the coast with fine views over the harbour for the duration of the walk. It's also great for wildlife with several species of wintering wildfowl and waders to look out for on the way. The walk starts at the village of Nutbourne where there is a train station. You can then pick up the paths heading south along the Thorney Island to Cobnor Point. Here you can enjoy nice views across the Chichester Channel to West Itchenor. The path then turns north along the Bosham Channel to the village of Chidham, with nice views over to Bosham Quay. At Chidham you head west across the countryside to return to Nutbourne. You can easily extend your walking in this lovely area by heading west to Thorney Island where you can pick up the Sussex Border Path long distance footpath. In nearby Chichester you can pick up the Chichester Canal an enjoy a waterside walk along the towpath. You can also pick up the long distance New Lipchis Way and West Sussex Literary Trail in Chichester. A few miles south of Chichester you can enjoy more bird watching opportunities at the lovely RSPB Pagham Harbour. In the city itself the Chichester Walls Walk is a great way of learning about the fascinating Roman history of the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you head into Chidham village you can visit the splendid Old House at Home pub. The 18th century inn includes traditional wooden beams and open fireplaces. There's also a lovely garden area to relax in on warmer days. You can find the pub at postcode PO18 8SU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is a great for dog walking and the Old House at Home pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For a shorter circular walk head east and visit the delightful Chichester Marina and Birdham. There's some lovely boats to see here with fine views over the harbour from a different perspective. Just to the north west of the town there's the splendid Kingley Vale National Nature Reserve in the South Downs. The noteworthy reserve contains one of the finest yew forests in Europe, including a grove of ancient trees which are among the oldest living things in Britain. On the western side of the town you could pick up the Centurion Way. This easy shared cycling and walking trail runs along the old Midhurst and Chichester railway track to West Dean. For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/XxJtMKfCYlg",
  "district": "Chichester",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "School Lane, Nutbourne, Southbourne, Nutbourne, Chichester, West Sussex, England, PO18 8RZ, United Kingdom",
  "postcode": "PO18 8RZ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "waterfront views",
    "historical sites"
  ],
  "facilities": [
    "train station",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}