{
  "created_at": "2025-01-06T01:32:26.225520+00:00",
  "objectID": "4559216c392e0d7d8b704da6abbdd685",
  "ref": "pershore-walking-route",
  "title": "Pershore Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/81/Pershore_Abbey_-_geograph.org.uk_-_1433312.jpg",
  "nearby": [
    {
      "description": "Tiddesley Wood",
      "objectID": "07c36efe430c0b60686477e83ccbb570",
      "ref": "tiddesley-wood-walking-route"
    },
    {
      "description": "Wychavon Way",
      "objectID": "098eca580895bbbf6dcdadde38f1c351",
      "ref": "wychavon-way-walking-route"
    },
    {
      "description": "Croome Court",
      "objectID": "075885bb44df0b389d1ee94479e0fde2",
      "ref": "croome-court-walking-route"
    },
    {
      "description": "Warwickshire Millennium Way",
      "objectID": "30d2afd2703efebe52cc7944fa3f7559",
      "ref": "warwickshire-millennium-way-walking-route"
    },
    {
      "description": "Evesham Country Park",
      "objectID": "4e27178d265d2f78d62f22f8d2c3ff20",
      "ref": "evesham-country-park-walking-route"
    },
    {
      "description": "Tewkesbury",
      "objectID": "c1728308faa1cfb6875fc9a6acb41daa",
      "ref": "tewkesbury-walking-route"
    },
    {
      "description": "Twyning",
      "objectID": "7fe6f6c07614946e2fbd464a354be7a7",
      "ref": "twyning-walking-route"
    },
    {
      "description": "Hanley Swan",
      "objectID": "679d14b04178b50890d151de68955347",
      "ref": "hanley-swan-walking-route"
    },
    {
      "description": "Elmley Castle",
      "objectID": "3de9c2fab4b85e41c173b00deff2140c",
      "ref": "elmley-castle-walking-route"
    },
    {
      "description": "Ashton Under Hill",
      "objectID": "8b7d86a3c00dfafad03e3b9733cf7f88",
      "ref": "ashton-under-hill-walking-route"
    },
    {
      "description": "Bredon Hill",
      "objectID": "1938aabe055c1f51548f641b2e70b06e",
      "ref": "bredon-hill-walking-route"
    },
    {
      "description": "Evesham Abbey Park River Walk",
      "objectID": "d2eb71d3c46f50811c6e08085c8de2d1",
      "ref": "evesham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4559216c392e0d7d8b704da6abbdd685.gpx",
  "_geoloc": {
    "lat": 52.1104863944,
    "lng": -2.0793887904
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Pershore_Abbey_-_geograph.org.uk_-_1433312.jpg",
      "title": "Sarah Ganderton / Pershore Abbey",
      "caption": "Pershore Abbey from the Abbey Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Pershore_Abbey_tree_sculpture_-_geograph.org.uk_-_489420.jpg",
      "title": "andy dolman / Pershore Abbey tree sculpture",
      "caption": "Pershore Abbey tree sculpture"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Sculpture_in_Pershore_-_geograph.org.uk_-_1058280.jpg",
      "title": "Philip Halling / Sculpture in Pershore",
      "caption": "A sculpture in the graveyard of the former St Andrew's church in Pershore is a two-sided modern sculpture of the 'Garden God' (known locally as the Moon Goddess). The sculpture is by Peter Inchbald."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Pershore_Marina_-_geograph.org.uk_-_1157458.jpg",
      "title": "Trevor Rickard / Pershore Marina",
      "caption": "Pershore Marina. Situated on the south bank of the river Avon near the bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/The_River_Avon_at_Pershore_-_geograph.org.uk_-_305993.jpg",
      "title": "Philip Halling / The River Avon at Pershore",
      "caption": "The River Avon by the weir and lock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Entrance_to_Tiddesley_Wood_-_geograph.org.uk_-_1158334.jpg",
      "title": "Trevor Rickard / Entrance to Tiddesley Wood",
      "caption": "Entrance to Tiddesley Wood Looking north-west across the A4104. The finger post reads 'Pershore Bridges Circular Walk'. This is not a public footpath, but the path through the woods is a permissive path which is part of a five-mile circular walk around the south of Pershore. The wood is managed by the Worcestershire Wildlife Trust."
    }
  ],
  "distance_km": 9.7,
  "description": "This circular walk from the market town of Pershore visits some of the highlights of the area. You'll visit Pershore Abbey before enjoying a riverside path along the River Avon. The trail then explores the peaceful woodland trails in Tiddesley Wood before returning to the abbey. The walk starts in the town centre at the historic abbey which is surrounded by a lovely park. The abbey was one of the largest medieval abbeys in Britain but was destroyed in the Reformation. The abbey church still exists and includes a beautiful interior and a lantern tower dates which from 1350. From the abbey you head south east to meet up with the River Avon. Follow the riverside path west and it will take you to Tiddesley Wood. These woods are also a nature reserve with a number of good footpaths to try. They are really special during the spring months when there are carpets of bluebells, wood anemones, violets and cowslips. After exploring the woods you head east past Orchard Farm and Cornmore before returning to the river path. This will take you back towards the town centre and the abbey.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Star Inn is a great choice for some refreshments on the walk. The historic pub is set in a fine 15th century coaching inn and does excellent food. There's a snug interior and a lovely beer garden right next to the river for warmer days. You can find the inn at 23 Bridge Street with a postcode of WR10 1AJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The route is nice for dog walking particularly on the woodland trails in Tiddesley Wood where you'll probably bump into other owners. You are requested to keep them on leads in this area though. The Star Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The long distance Wychavon Way passes through the town. The trail is a great way of further exploring the area. You could pick up the trail and follow it north east along the river to Wyre Piddle and Church Lench. Heading south will take you to Pensham, Great Comberton, Battens Wood and the viewpoint at the Banbury Stone Tower. To the west of the town you'll find some nice trails around Croome Court Park. Here you can explore the beautiful parkland surrounding the 18th century Neo-Palladian mansion. The epic Warwickshire Millennium Way also starts from the town. This long distance trail will take you through the Warwickshire, Worcestershire and Northamptonshire countryside to Middleton Cheney. To the east you'll find Evesham Country Park where there's wide lawns, orchards, a lake and more trails along the River Avon. To the north there's the settlements of Tewkesbury, Upton Upon Severn and Twyning where you can enjoy riverside trails along the Avon and the Severn. Near here there's the delightful village of Hanley Swan. The picturesque settlement includes a pretty village green, a pond, a 17th century pub and walking trails to neighbouring Hanley Castle where you can see the remains of the ancient fort. The circular walk from Ashton Under Hill to the picture postcard village of Elmley Castle and the fine viewpoint at Bredon Hill lies just a few miles to the south. For more walks in the county see the Worcestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/x5Omli-gBvI",
  "postcode": "WR10 1JR",
  "district": "Wychavon",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Abbey Road, Pershore, Pensham, Wychavon, Worcestershire, England, WR10 1JR, United Kingdom",
  "state": "England"
}