{
  "created_at": "2025-01-05T23:40:39.595003+00:00",
  "objectID": "45a2169e64564b789686419fe12f5895",
  "ref": "bowder-stone-walking-route",
  "title": "Bowder Stone Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/The_Bowder_Stone_-_geograph.org.uk_-_964682.jpg",
  "nearby": [
    {
      "description": "Castle Crag",
      "objectID": "938402ee0496b74c4b98a5e2e0327498",
      "ref": "castle-crag-walking-route"
    },
    {
      "description": "Allerdale Ramble",
      "objectID": "641f71c34743ce206179b03c5da3b722",
      "ref": "allerdale-ramble-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Circular Walk from Rosthwaite",
      "objectID": "e795de8aa071f85c51e0055059327504",
      "ref": "circular-walk-from-rosthwaite-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/45a2169e64564b789686419fe12f5895.gpx",
  "_geoloc": {
    "lat": 54.5414051084,
    "lng": -3.1560580153
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/The_Bowder_Stone_-_geograph.org.uk_-_964682.jpg",
      "title": "Trevor Harris / The Bowder Stone, via Wikimedia Commons",
      "caption": "The Bowder Stone is a massive erratic, deposited by a glacier in the last Ice Age."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Bowder_Stone_-_geograph.org.uk_-_1515039.jpg",
      "title": "Shaun Ferguson / Bowder Stone, via Wikimedia Commons",
      "caption": "View of the staircase with some walkers enjoying the view from the top"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/The_Bowder_Stone_-_from_the_south_-_geograph.org.uk_-_546801.jpg",
      "title": "Rob Farrow / The Bowder Stone - from the south, via Wikimedia Commons",
      "caption": "View from the south. The Bowder Stone is estimated to weigh around 2000 tons and is about 30'(9m) high, 50'(15m) across and 90'(27m) in circumference. Surprisingly it is not here as the result of having cleaved off the mountain, as it is of a completely different rock ! So it is assumed that it was pushed here by a glacier during the Ice Age - and probably originated in Scotland. Its name most likely comes from the Norse god Odin's son, Balder. It's easy to get to the top and have a sit thanks to these thoughtfully provided steps which have been here in one form or another since the C19th century"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Bowder_Stone_-_from_the_east_-_geograph.org.uk_-_546806.jpg",
      "title": "Rob Farrow / Bowder Stone - from the east, via Wikimedia Commons",
      "caption": "A view of the stone taken from a slightly elevated position to the east."
    }
  ],
  "distance_km": 1.0,
  "description": "This short walk visits the interesting Bowder Stone in the Borrowdale area of the Lake District National Park. The large stone is located just to the south of Derwentwater, near Grange. You can visit the site by parking at the National Trust public car park and following a pleasant woodland footpath south the photogenic stone. It's a pleasant, easy stroll which takes around 10 minutes or so. The huge boulder is an impressive sight standing at a height of about 30 feet (9.1 m) and weighing around 2000 tons. There is a 19th century staircase which you climb to the top of the stone. From there you can enjoy fine views over the area before ambling back to the car park. The stone is located just a short distance to the east of Castle Crag. This is another popular walk in the area and well worth an extension to your outing. The hill stands at a height of 290 m (950 ft), offering fine views over Borrowdale from the summit. Also to the west of the stone you can pick up the Allerdale Ramble and Cumbria Way waymarked trails. There's some nice riverside trails along the River Derwent to follow into Rosthwaite .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Borrowdale Gates Hotel is located just to the north of the stone in Grange. It's about a 10 minute stroll from the car park and a nice way to extend the walk and get some refreshments. The hotel is in a lovely spot and includes a terrace and some pretty gardens with fine views of the surrounding fells. During the colder months, open log fires are lit in the lounges all day, providing warmth and cosiness for reading and drinks. The restaurant is open to non residents and includes panoramic windows offering captivating fell views to complement the imaginative menu. It's a fine place to enjoy a meal and then stroll around the pretty gardens surrounding the hotel. You can find the Borrowdale Gates in Grange at postcode CA12 5UQ."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mlcYp4DluAk",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Kings How, Rosthwaite, Borrowdale, Cumberland, England, CA12 5XA, United Kingdom",
  "postcode": "CA12 5XA",
  "district": "Rosthwaite",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "10 minutes",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}