{
  "created_at": "2025-01-05T23:49:43.178309+00:00",
  "objectID": "45d4fadc6175dc0ecca31b1139b2b3c0",
  "ref": "castleford-walking-route",
  "title": "Castleford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Wildfowl_at_Fairburn_Ings_-_geograph.org.uk_-_20677.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/45d4fadc6175dc0ecca31b1139b2b3c0.gpx",
  "_geoloc": {
    "lat": 53.7439132542,
    "lng": -1.3163689222
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Wildfowl_at_Fairburn_Ings_-_geograph.org.uk_-_20677.jpg",
      "title": "Toby Speight / Wildfowl at Fairburn Ings",
      "caption": "Wildfowl at Fairburn Ings. The lagoons created for disposal of power station fly-ash have become important sites for ducks, geese and swans."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/The_River_Aire%2C_Castleford_-_geograph.org.uk_-_259290.jpg",
      "title": "Bill Henderson / The River Aire, Castleford",
      "caption": "The River Aire, Castleford. This is the view of the River Aire, looking east from the car park of the Crimea Tavern."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Railway_Bridge_over_the_River_Aire%2C_Castleford_Ings_-_geograph.org.uk_-_790527.jpg",
      "title": "Bill Henderson / Railway Bridge over the River Aire, Castleford Ings",
      "caption": "Railway Bridge over the River Aire, Castleford Ings"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Allerton_Bywater_-_Allerton_Ings.jpg",
      "title": "David Pickersgill / Waterside vegetation",
      "caption": "Waterside vegetation Buttercups, water mint and forget-me-nots growing in the wet soil at the edge of Allerton Ings. The church of St Mary the Less in the background. The crane is working on the 'Millennium Village' on the old Allerton Bywater colliery site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Allerton_Bywater_-_geograph.org.uk_-_121483.jpg",
      "title": "Paul Johnston-Knight / Allerton Bywater",
      "caption": "Allerton Bywater. These lakes, ponds, ings, have formed over the former pit under the village, depressed since the closure of the mines, but now undergoing resurgence with the advent of Millennium Village (\"the place that's going to be the place to be\") - built by English Partnerships and comprising new affordable housing, commercial and industrial premises."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Newton_Ings_from_Newton_Farm_-_geograph.org.uk_-_127172.jpg",
      "title": "Paul Johnston-Knight / Newton Ings from Newton Farm",
      "caption": "Newton Ings from Newton Farm. Near the remains of an ancient abbey, this offshoot of Fairburn Ings stands between the hamlet of Newton Farm and Castleford, with Hickson chemical works in the background. Image taken looking south-west from the northern edge of the square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/St_Aidan%27s_Nature_Reserve_looking_south_westish_from_below_the_walking_dragline.jpg/256px-St_Aidan%27s_Nature_Reserve_looking_south_westish_from_below_the_walking_dragline.jpg",
      "title": "Richard Avery / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "A view across the wetland and reedbeds in St Aidan's Nature Reserve. The village of Mickleton Methley is visible in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/St_Aidan%27s_Nature_Reserve1.jpg/512px-St_Aidan%27s_Nature_Reserve1.jpg",
      "title": "Richard Avery / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "St Aidan's Nature Reserve. A gaggle of about 130 Greylag Geese on the lake near the dragline."
    }
  ],
  "distance_km": 6.5,
  "description": "Castleford is a town in West Yorkshire, located a few miles south east of the city of Leeds. The historic market town has Roman roots and a famous Rugby League team. For walkers there's nice waterside footpaths along the river and canal that runs through the town. There's also some RSPB nature reserves with a number of lakes so it's a good area for wildlife watching while enjoying an easy stroll. This walk visits the Fairburn Ings Nature Reserve before taking you along the River Aire to Allerton Bywater, Lowther Lake and the RSPB St Aidan's to the north west of the town. Along the way there's nice riverside paths and lots of wildlife to look out for too. The walk starts from the Fairburn Ings car park and visitor centre just to the north of the town. From here you can pick up footpaths heading west to Newton Ings, passing the remains of Newton Abbey on the way. You then follow a waterside path along the Aire and Calder Navigation to Castleford Ings. Here you turn north along the River Aire to Allerton Bywater. Follow the river round to the west and it will take you to the pretty Lowther Lake before finishing at RSPB St Aidan's. The reserve consists of reedbed, wetland, meadows and woodland. There's also 12km of trails and a visitor centre with information about the area. Look out for bittern, marsh harrier and skylark as you make your way around the reserve. The Trans Pennine Trail can be picked up on the southern side of the reserve and followed along the Aire and Calder Navigation Canal.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Griffin Inn is located close to the canal and a good place to visit for refreshments. It's a friendly place with a good menu and selection of drinks. You can find the pub in a nice spot next to the canal on Lock Lane with a postcode of WF10 2LB for your sat navs. In Allerton Bywater you'll find The Boat in a fine spot next to the River Aire. There's a good menu and nice garden to sit out in on warmer days. You can find them at postcode WF10 2BX."
    },
    {
      "subtitle": "Dog Walking",
      "content": "This is a nice walk for dogs but please keep them on leads in St Aidan's Reserve and under control in Fairburn Ings. At the latter you'll find a dog parking area, a dog bowl and a recreation area. The Griffin and The Boat pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west of the town to pick up the Wakefield Canal. This will take you along the towpath of the Aire and Calder Navigation into Wakefield where there are three lovely local parks to explore in the town centre."
    }
  ],
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Newton Lane, Ledsham, Castleford, Ledston, North Yorkshire, West Yorkshire, England, WF10 2BH, United Kingdom",
  "postcode": "WF10 2BH",
  "district": "Castleford",
  "county": "North Yorkshire",
  "state": "England"
}