{
  "created_at": "2025-01-06T02:15:53.275981+00:00",
  "objectID": "46071f0121cc97ad8c4cdc0997db81a5",
  "ref": "rhyd-y-foel-walking-route",
  "title": "Rhyd y Foel Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a6/The_old_post-office_-_geograph.org.uk_-_727491.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/46071f0121cc97ad8c4cdc0997db81a5.gpx",
  "_geoloc": {
    "lat": 53.2782303589,
    "lng": -3.6310961446
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/The_old_post-office_-_geograph.org.uk_-_727491.jpg",
      "title": "Jonathan Wilkins / The old post-office",
      "caption": "The old post-office in Rhyd y Foel. A picturesque cluster of roadside buildings, including a proper telephone box and the old post office."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Dulas_valley_-_geograph.org.uk_-_947973.jpg",
      "title": "Jonathan Wilkins / Dulas valley",
      "caption": "Dulas valley from Pen y Corddyn Mawr. The Afon Dulas runs through the coastal hills in a deep gorge with cliffs in the Carboniferous Limestone outcrop on both sides. In the middle distance is Craig-y-forwyn and in the far distance can be seen Mynydd Marian, all summits on the limestone outcrop. It is notable in this view that there is a matching limestone plateau on both sides of the valley at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Pen_y_Corddyn_Mawr_-_geograph.org.uk_-_3253720.jpg/512px-Pen_y_Corddyn_Mawr_-_geograph.org.uk_-_3253720.jpg",
      "title": "Pen y Corddyn Mawr by Rude Health, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Walkers with their dog on the top of Pen y Corddyn Mawr."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Limestone_cliff_-_geograph.org.uk_-_947926.jpg",
      "title": "Jonathan Wilkins / Limestone cliff",
      "caption": "Limestone cliff. The hilltop ends abruptly at these cliffs which form the eastern boundary of the fort. No need to build any ramparts here. Whether these are natural cliffs or the result of historical quarrying is very difficult to judge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Disused_quarries%2C_Rhyd_y_Foel_-_geograph.org.uk_-_947950.jpg",
      "title": "Jonathan Wilkins / Disused quarries, Rhyd y Foel",
      "caption": "Disused quarries, Rhyd y Foel. The outcrop of Carboniferous Limestone has been exploited here for a very long time, as indicated by the dark grey colour of the rock faces in the middle distance, and the mature trees covering the heaps of spoil thrown down the hill towards the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Rampart%2C_Pen-y-corddyn_Mawr_-_geograph.org.uk_-_947936.jpg",
      "title": "Jonathan Wilkins / Rampart, Pen-y-corddyn Mawr",
      "caption": "Rampart, Pen-y-corddyn Mawr. Only the northern side of the hillfort is without a natural defence, so a neat pair of ramparts run east to west and define the hilltop stronghold. As there is very little soil up here, the ramparts are built of broken limestone heaped up and looking today very like the lower scree slopes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Miniature_forest_-_geograph.org.uk_-_947895.jpg",
      "title": "Jonathan Wilkins / Miniature forest",
      "caption": "Miniature forest. The scree, stones and limestone outcrop are covered in part with a low-growing mixture of Blackthorn and Cotoneaster. The large tree is a Yew."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Craig_y_Forwyn%2C_Conwy.jpg",
      "title": "Jonathan Wilkins / Craig y Forwyn",
      "caption": "Craig y Forwyn, Conwy lies just to the west of the village and is visible from the hill fort. The maiden's rock? There must be a story attached...... A seemingly natural outcrop, the extensive scree of debris and remains of benching with produced limestone boulders indicate that this too is extensively quarried. The local Carboniferous Limestone has always been a valuable asset, both for building stone and agricultural lime. The narrow gap of the Dulas valley as it cuts through the coastal hills is a natural point at which to exploit these mineral riches."
    }
  ],
  "distance_km": 2.0,
  "description": "This small rural village lies in a lovely spot in the River Dulas Valley, near to the Conwy coast. This short circular walk from the village takes you up to the Pen y Corddyn Mawr hillfort which lies just to the south of the settlement. You can follow footpaths up to the site and enjoy some wonderful views over the Dulas valley and the coast. The fort sits in a photogenic spot on the top of a huge limestone plateau surrounded by precipitous cliffs. It has an interesting Romano British, and early Medieval Period history. Just to the west of the village you can pick up the North Wales Path. The long distance waymarked footpath could be followed north to Llanddulas where you can pick up the coast path to neighbouring Abergele .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The village lies on the western edge of Gwrych Castle, a striking Grade I listed 19th-century country house. You can visit the castle which is now open daily for visitors to explore and enjoy the 250 acres of historic gardens and parkland. The castle became famous in 2020 when it was used as the setting for the 20th series of I'm a Celebrity...Get Me Out of Here!"
    }
  ],
  "video_url": "https://www.youtube.com/embed/KkV64Joy3QI",
  "district": "Rhyd-y-foel",
  "county": "Conwy",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Llanddulas and Rhyd-y-Foel, Rhyd-y-foel, Conwy, Cymru / Wales, LL22 8EB, United Kingdom",
  "postcode": "LL22 8EB",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "cliff"
  ],
  "points_of_interest": [
    "hillfort",
    "historical site"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}