{
  "created_at": "2025-01-06T01:45:11.981158+00:00",
  "objectID": "46370f3aadd55711383508d2321778cf",
  "ref": "blewbury-walking-route",
  "title": "Blewbury and Blewburton Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Blewburton_Hill_48.jpg/256px-Blewburton_Hill_48.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/46370f3aadd55711383508d2321778cf.gpx",
  "_geoloc": {
    "lat": 51.5706749547,
    "lng": -1.2304367443
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Blewburton_Hill_48.jpg/256px-Blewburton_Hill_48.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Blewburton Hill 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Blewburton_Hill_27.jpg/256px-Blewburton_Hill_27.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Blewburton Hill 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Blewburton_Hill_01.jpg/256px-Blewburton_Hill_01.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Blewburton Hill. South rampart."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Blewburton_Hill_04.jpg/512px-Blewburton_Hill_04.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Blewburton Hill. South flank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Blewburton_Hill_-_geograph.org.uk_-_721198.jpg",
      "title": "Andrew Smith / Blewburton Hill, via Wikimedia Commons",
      "caption": "Looking down from the hillfort and across arable fields to the village of Blewbury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Footpath_to_the_hill_-_geograph.org.uk_-_1379650.jpg",
      "title": "Bill Nicholls / Footpath to the hill, via Wikimedia Commons",
      "caption": "Footpath to the hill. This farm track doubles as a footpath and will lead you to Blewburton Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Over_the_Almshouses_-_geograph.org.uk_-_1371105.jpg",
      "title": "Bill Nicholls / Over the Almshouses, via Wikimedia Commons",
      "caption": "View towards the Almshouses (two houses in front of the car) from on top of Blewbury Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/The_Red_Lion%2C_Chapel_Lane%2C_Blewbury_-_geograph.org.uk_-_252460.jpg/512px-The_Red_Lion%2C_Chapel_Lane%2C_Blewbury_-_geograph.org.uk_-_252460.jpg",
      "title": "Stuart / The Red Lion, Chapel Lane, Blewbury, via Wikimedia Commons",
      "caption": "The Red Lion public house, Chapel Lane, Blewbury, Oxfordshire (formerly Berkshire)"
    }
  ],
  "distance_km": 5.0,
  "description": "This walk from the Oxfordshire village of Blewbury visits the Iron Age Hillfort at Blewburton Hill. The hill is located a short distance to the east of the village and the walk includes a visit to the nearby village of Aston Tirrold. It's a 3 mile walk with a small climb and some nice views over the surrounding Oxfordshire countryside to enjoy on the way. The walk starts in the village of Blewbury, located just to the south of Didcot in the North Wessex Downs. From here you can pick up footpaths heading east up to Blewburton Hill. The univallate hill fort may have been occupied from the 4th century BC to the 1st century BC. Interesting finds at the site include Neolithic or Early Bronze Age flints recovered during excavations, and a polished stone axe found in the ditch near the entrance. Although there was no Roman occupation of the hilltop, a number of fragments of Roman pottery were recovered, dating to the 1st century AD, and the 3rd–4th centuries AD. After exploring the hill the walk descends to the village of Aston Tirrold where you could stop for refreshments at the local pub. The walk then returns to Blewbury on the same paths. To continue your walking in the area head south and pick up our Streatley Circular Walk which uses part of The Ridgeway National Trail. You could also head to nearby Goring and enjoy a riverside walk along the Thames Path .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy refreshment at the Blueberry. They serve particularly delicious pizzas from their wood fired pizza oven. Outside their's a sun trap garden for warmer days. You can find them on London Road at postcode OX11 9NU for your sat navs. There's also the historic Red Lion which dates all the way back to 1612. There's a charming olde worlde interior here with a cosy, oak-beamed, a working Inglenook fireplace and flagstone floors. There's also a beautiful orchard garden with views over neighbouring fields. You can find them on Chapel Lane with a postcode of OX11 9PQ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the two village pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The village is well-known for its literary and artistic connections. Famous authors include Kenneth Grahame (Wind In The Willows) and the ex-jockey and thriller writer, Dick Francis. Agatha Christie also lived in the nearby village of Cholsey. The Blewbury-Churn-Hill-East-Illsley-Down Walk climbs to another viewpoint to the south of the village. Head north and you could pick up the Didcot Walk and visit the interesting Didcot Railway Centre, the scenic hills of Wittenham Clumps, the River Thames and the interesting Roman town of Dorchester. Just to the west you'll find the interesting village of Chilton. Near here you can pick up the epic Ridgeway National Trail, one of the walking highlights of the area. For more walking ideas in the area see the Oxfordshire Walks, North Wessex Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/fyjnKqGqKWU",
  "postcode": "OX11 9NW",
  "district": "Vale of White Horse",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Corner Cottage, Bessels Lea, Blewbury, Vale of White Horse, Oxfordshire, England, OX11 9NW, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "3 hours",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "pub"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}