{
  "created_at": "2025-01-06T08:36:15.683527+00:00",
  "objectID": "465bdd913fde7b50fee58ea1ed748388",
  "ref": "ebury-way-walking-and-cycle-route",
  "title": "Ebury Way Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Watford%2C_Ebury_Way_-_geograph.org.uk_-_1022669.jpg",
  "nearby": [
    {
      "description": "Colne Valley Trail",
      "objectID": "e2dd72c89baa5d0473703a87e5bb4a94",
      "ref": "colne-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Cassiobury Park",
      "objectID": "918843258a2593e4af6f89c94bbef9e2",
      "ref": "cassiobury-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/465bdd913fde7b50fee58ea1ed748388.gpx",
  "_geoloc": {
    "lat": 51.6368703601,
    "lng": -0.466675834
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Watford%2C_Ebury_Way_-_geograph.org.uk_-_1022669.jpg",
      "title": "Nigel Cox / Watford: Ebury Way",
      "caption": "On the trail at Watford with autumn leaves on the path in October 2008. follows the trackbed of the long dismantled railway line from Watford to Rickmansworth. Opened in 1862, it was shortly afterwards taken over by the London & North Western Railway, but was an early victim of the post-war Nationalization of the railways, closing to passenger traffic in 1952. It now forms sections of both National Cycle Network Routes 6 (London to Keswick) and 61 (Rickmansworth to Ware)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Watford%2C_Ebury_Way_-_geograph.org.uk_-_732678.jpg",
      "title": "Nigel Cox / Watford: Ebury Way",
      "caption": "The trail viewed looking west towards the A4145 Tolpits Lane bridge and then to Rickmansworth. The blue sign has a wildly overoptimistic distance of ¼ mile to Cassiobury Park and Watford Met Line Station. The very nearest point in the park is at least 1 mile away and the station at least a ¼ mile beyond that!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Ebury_Way%2C_Croxley_-_geograph.org.uk_-_86530.jpg",
      "title": "Nigel Cox / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Croxley. Ebury Way viewed looking west under the Metropolitan Line bridge towards Rickmansworth, with a southbound underground train about to cross."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Watford%2C_Ebury_Way_-_geograph.org.uk_-_88477.jpg",
      "title": "Nigel Cox / Watford: Ebury Way",
      "caption": "Viewed looking west towards Rickmansworth from north of the Vale Industrial Estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/River_Colne_from_Ebury_Way%2C_Watford_-_geograph.org.uk_-_44005.jpg/256px-River_Colne_from_Ebury_Way%2C_Watford_-_geograph.org.uk_-_44005.jpg",
      "title": "David Hawgood / River Colne from Ebury Way, Watford",
      "caption": "River Colne from Ebury Way, Watford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/River_Colne_from_Ebury_Way%2C_Watford_-_geograph.org.uk_-_64118.jpg",
      "title": "Nigel Cox / River Colne from Ebury Way, Watford",
      "caption": "River Colne from Ebury Way, Watford. This is the reverse view from the first geograph in this square, and shows the River Colne flowing away southwards from Ebury Way towards Hampermill. Note the heron and the pillbox if you can see them!"
    }
  ],
  "distance_km": 5.0,
  "description": "This is an easy short cycle and walking route ideal for families. It runs along National Cycle route 61 and a dismantled railway line from Rickmansworth to Watford and passes through a variety of habitats, including open moor, woodland, and wetlands. The trail crosses a number of waterways including the rivers Colne, Chess and Gade and the Grand Union Canal. See the National Cycle Route 61 page for details of the full route which runs from Maidenhead to Hoddesdon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the start of the trail at Batchworth Lock you can enjoy some refreshments at the Cafe at Lock 81. They have a variety of sandwiches, hot food, hot and cold drinks, chocolate, crisps and sweets. There's also the adjacent Canal Centre with a wealth of information and the excellent Little Union Canal. This miniature working model canal shows how a lock and canal works. You can find the cafe at 99 Church St with a postcode of WD3 1JJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a nice walk to do with your dog but please keep them under close control as there are often a lot of cyclists on the path. The Cafe at Lock 81 mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Colne Valley Trail runs from Uxbridge to Rickmansworth. It's a good option for continuing your walking or cycling in the area. It runs on waterside paths and also passes a series of pretty lakes. The Celandine Route also runs just to the east of the trail. It will take you along the River Pinn from Pinner to Cowley. Part of the trail runs along the Croxley Green Boundary Walk. This waymarked circular walk explores the area around the worthy village, visiting the canal and the River Gade on the way. You'll pass the southern edge of the trail as you pass Watford and Rickmansworth. For more walking ideas in the area see the London Walks page."
    }
  ],
  "postcode": "WD3 1JF",
  "district": "Rickmansworth",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}