{
  "objectID": "469bba56fa85e9d7ef226050247c65e0",
  "created_at": "2024-12-18T13:58:59.635153+00:00",
  "ref": "solva-to-newgale-walk-walking-route",
  "title": "Solva to Newgale Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Solva_Harbour_-_geograph.org.uk_-_239001.jpg",
  "nearby": [
    {
      "description": "Pembrokeshire Coast Path",
      "objectID": "ad6d6081a04362874fc894b50c9a12b7",
      "ref": "pembrokeshire-coast-path-walking-route"
    },
    {
      "description": "Solva Harbour",
      "objectID": "fb03b20fce2308c81106a137ece22c34",
      "ref": "solva-harbour-walking-route"
    },
    {
      "description": "Solva to St Davids Coastal Walk",
      "objectID": "1b0c98c52cdc19e5e9bde20da3531ac2",
      "ref": "solva-to-st-davids-coastal-walk-walking-route"
    },
    {
      "description": "Little Haven",
      "objectID": "0e94f7938bb6f314184cb389446aab1a",
      "ref": "little-haven-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/469bba56fa85e9d7ef226050247c65e0.gpx",
  "_geoloc": {
    "lat": 51.8738446222,
    "lng": -5.1881330934
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Solva_Harbour_-_geograph.org.uk_-_239001.jpg",
      "title": "Jeremy Owen / Solva Harbour, via Wikimedia Commons",
      "caption": "Solva Harbour. Taken from the Gribin, at Solva, looking North Towards the Village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Dinas_Fawr_and_Pen_Dinas_%2810%29_-_geograph.org.uk_-_1534377.jpg",
      "title": "Andy F / Dinas Fawr and Pen Dinas (10), via Wikimedia Commons",
      "caption": "Dinas Fawr and Pen Dinas. Looking east along the coast from the 'summit' of Dinas Fawr headland. The dramatic heather-clad peninsula of Dinas Fawr is about a mile southeast of Solva, Pembrokeshire. A public right of way leads from the long-distance coastpath along the knife-edge ridge to the tip of the headland. However, this path is exposed, rough-surfaced and precipitous so it is unsuitable for walkers who are not sure-footed and agile."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Dinas_Fawr_-_geograph.org.uk_-_622180.jpg",
      "title": "Robin Lucas / Dinas Fawr, via Wikimedia Commons",
      "caption": "Dinas Fawr viewed from the Pembroke coast path. Green Scar can be seen beyond, and on the skyline is Ramsey Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Dinas_Fach_-_geograph.org.uk_-_1191723.jpg",
      "title": "Deborah Tilley / Dinas Fach, via Wikimedia Commons",
      "caption": "Dinas Fach 'Dinas' meaning city, 'Fach' meaning small. City is an unusual name for a rural/ coastal area but there are a few Dinas names around. The meaning could be inferred as meaning a 'town' or camp, but not as we know them today. In the Iron Age the coastline was dotted with well defended promontory forts. Dinas Fawr is referred to as Iron Age in the Historical Environments Report but was described by the Royal Commission for Ancient Monuments in Wales as \" An extensive hog-back promontory where a bank and ditch has been observed (RCAHM Pembs 1925)but not subsequently confirmed. Hollows on the promontory are thought to represent small-scale copper mining rather than occupational features\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Dinas_Fach_-_geograph.org.uk_-_622185.jpg",
      "title": "Robin Lucas / Dinas Fach, via Wikimedia Commons",
      "caption": "Dinas Fach viewed from the Pembroke Coast Path with Newgale Sands in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Shoreline_rocks_and_Dinas_Fach_-_geograph.org.uk_-_1254157.jpg",
      "title": "Richard Law / Shoreline rocks and Dinas Fach, via Wikimedia Commons",
      "caption": "Shoreline rocks and Dinas Fach. These rocks are at the northern end of Newgale, near Pwll March. The promontory of Dinas Fach is quite clear in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Magical_Newgale_-_geograph.org.uk_-_1616246.jpg",
      "title": "Deborah Tilley / Magical Newgale, via Wikimedia Commons",
      "caption": "Magical Newgale. The silhouetted cliffs look dark and brooding but the beach was simply glowing in the weak, winter sun. One point of interest - the distinct shape of Rickett's Head promontory is man made, carved out of the cliff by the mining activity of previous centuries.The coal in the area was particularly pure and smoked very little. Queen Victoria used to burn the coal from the Trefrane seam at Sandringham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Newgale_Beach_-_geograph.org.uk_-_622866.jpg",
      "title": "Robin Lucas / Newgale Beach, via Wikimedia Commons",
      "caption": "Newgale Beach. The pebble bank runs the whole length of Newgale beach, which at low tide is composed entirely of firm sand."
    }
  ],
  "distance_km": 6.5,
  "description": "This walk follows a lovely section of the Pembrokeshire Coast Path from Solva to Newgale. The route runs for about 4 miles along a waymarked, undulating coastal path. The walk starts from Solva Harbour and heads south towards St Elvis Rock. You then head east to the headland at Dinas Fawr. There is a footpath that heads out across the headland but do take care if you follow this path. There's great views towards the islands of Green Scar and Ramsey Island from here. Pretty heather can also be found in this area at the right times of year. The route continues east past the sister headland of Dinas Fach, before passing a series of caves and arriving at Newgale. Here you'll find a wonderful 2 mile stretch of beach which is popular with windsurfers, surfers and canoeists throughout the summer months. Newgale also marks the boundary between English and Welsh-speaking Pembrokeshire, with the next beach north of Newgale being called Pen-y-Cwm. To continue your walking in the area you could try the Solva Harbour Walk. The Solva to St Davids Coastal Walk takes you in the other direction along the coast path.",
  "video_url": "https://www.youtube.com/embed/GeOi4q_hn1Y",
  "postcode": "SA62 6UT",
  "district": "Solfach / Solva",
  "county": "Sir Benfro - Pembrokeshire",
  "region": "Wales",
  "country": "Wales"
}