{
  "objectID": "46a1e3028f153ba776c5aef2f3e05ce2",
  "created_at": "2024-12-18T11:27:17.467776+00:00",
  "ref": "kinver-edge-walking-route",
  "title": "Kinver Edge Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/95/Path_on_Kinver_Edge_-_geograph.org.uk_-_1700721.jpg",
  "nearby": [
    {
      "description": "Worcestershire Way",
      "objectID": "bc88cb9ede89bd9038772fa0235ccd90",
      "ref": "worcestershire-way-walking-route"
    },
    {
      "description": "North Worcestershire Path",
      "objectID": "3ba181e4b3ed581e600a12f6dea8b88f",
      "ref": "north-worcestershire-path-walking-route"
    },
    {
      "description": "Staffordshire Way",
      "objectID": "0f4ae85e999427bc5e24f5738eb8e2d1",
      "ref": "staffordshire-way-walking-route"
    },
    {
      "description": "Kingsford Country Park",
      "objectID": "7f3770e2d54910c0e6bb092912af1b15",
      "ref": "kingsford-country-park-walking-route"
    },
    {
      "description": "Kidderminster",
      "objectID": "b09bce69a44612919e0eb8cfe0f0762d",
      "ref": "kidderminster-walking-route"
    },
    {
      "description": "Kinver Canal Walk",
      "objectID": "7e12913cbab4f545d1f5a25bbb1a656c",
      "ref": "kinver-canal-walk-walking-route"
    },
    {
      "description": "Wombourne Railway Walk",
      "objectID": "37c0cd74db3f71c2f8ea51e533c71534",
      "ref": "wombourne-railway-walk-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/5E4B231B0D618DBD8025811800729FEE/$FILE/Kinver Edge.gpx",
  "_geoloc": {
    "lat": 52.4502295185,
    "lng": -2.2433310772
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Path_on_Kinver_Edge_-_geograph.org.uk_-_1700721.jpg",
      "title": "P L Chadwick / Path on Kinver Edge",
      "caption": "Path on Kinver Edge. A scheme to regenerate the original rare lowland heathland on this part of Kinver Edge is under way, which involves removing most of the trees in this area and allowing animals to graze for some months of the year. This will result in more heather coverage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Pillbox_on_Kinver_Edge_-_geograph.org.uk_-_1702064.jpg",
      "title": "P L Chadwick / Pillbox on Kinver Edge",
      "caption": "Pillbox on the edge. This sealed up pillbox dates from World War II, and apparently was intended for use by the Home Guard. It snuggles up to the massive rampart of Kinver Edge Hillfort, an iron age defence structure probably two thousand or more years older. The design and brick construction of the pillbox is quite different from the concrete ones found along parts of the River Thames, and elsewhere."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Kinver_Edge_-_geograph.org.uk_-_1702151.jpg/256px-Kinver_Edge_-_geograph.org.uk_-_1702151.jpg",
      "title": "P L Chadwick / Kinver Edge",
      "caption": "During some months of the year, animals are being allowed to graze the regenerated areas of heathland. The fence and kissing gate are there to ensure animals don't cross into areas where they shouldn't be."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Foxgloves_at_Kinver_Edge_-_geograph.org.uk_-_847995.jpg",
      "title": "Mat Fascione / Foxgloves at Kinver Edge",
      "caption": "Foxgloves and a country view on a glorious summer day in 2008"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Sandstone_rock_at_Kinver_Edge_-_geograph.org.uk_-_847988.jpg",
      "title": "Mat Fascione / Sandstone rock at Kinver Edge",
      "caption": "Sandstone rock at Kinver Edge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Another_view_from_Kinver_Edge_-_geograph.org.uk_-_495811.jpg",
      "title": "Mat Fascione / Another view from Kinver Edge",
      "caption": "Viewpoint at the site. Looking south across Staffordshire into Worcestershire, the town in the centre of the picture is Kidderminster, and the Malvern Hills are visible on the horizon. Kidderminster is 5 miles away and the Malvern Hills are nearly 30 miles distant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Bonfire_waggon%2C_Kinver_Edge_-_geograph.org.uk_-_1700739.jpg",
      "title": "P L Chadwick / Bonfire waggon, Kinver Edge",
      "caption": "Bonfire waggon. As part of the regeneration of the heathland, a lot of scrub and trees need to be removed. As there are no roads near this point, the most realistic method of dealing with this waste is by burning. Instead of having bonfires on the ground, which can cause damage, the bonfires are instead held in this ancient looking waggon. It would be interesting to know its origins."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/View_of_the_War_Memorial_at_Kinver_Edge_-_geograph.org.uk_-_495800.jpg",
      "title": "Mat Fascione / View of the War Memorial at Kinver Edge",
      "caption": "View of the War Memorial"
    }
  ],
  "distance_km": 4.0,
  "description": "This National Trust owned woodland escarpment has miles of good walking trails to try. It's excellent walking country with lovely heathland, woodland trails and magnificent views over the surrounding Staffordshire and Worcestershire countryside. The sandstone ridge also includes an Iron Age Hill Fort and fascinating red sandstone formations. You can stop and admire the views from a number of seats dotted along the ridge top path. This circular walk around the site starts from the parking area off Compton Road next to the Holy Austin Rock. You then follow a nice way marked trail along Kinver Edge to Nanny's Rock. You can actually explore this fascinating sandstone rock house with its five empty rooms and the 'devil's' chimney. Just after Nanny's Rock the path heads north east through some pretty bluebell woods before returning to Holy Austin Rock House. This rock house has been restored by the National Trust so you can see how it would have looked when people lived in them. The houses are carved right into the rock and were inhabited right up until the 1960s. The area is great for wildlife watching with highlights including green hairstreak butterflies, willow warbler and cuckoo. It's also great for flora with yellow gorse and lovely purple heather in the late summer months. The long distance Staffordshire Way , Worcestershire Way and North Worcestershire Path all pass the site. You can easily pick up any of these trails to extend your walking in the area. Heading south will take you through Kingsford Country Park to Drakelow where there is a small multivallate Iron Age hillfort. Continuing along the Worcestershire Way will take you to Shatterford Lakes Wildlife Sanctuary, Eymore Wood and Trimpley Reservoir. Heading north from the edge along the Staffordshire Way will take you to Enville. Cookley village on the River Stour can be also be easily reached by descending along the North Worcestershire Path. These are all nice places to visit if you feel like stretching your legs further. For cyclists National Cycle Network Route 54 passes through Cookley just to the east of the site. If you are coming from Kidderminster you could follow the route north to Cookley and then follow country lanes east to each Kinver Edge.",
  "video_url": "https://www.youtube.com/embed/lKhxXlcHPXM",
  "postcode": "DY7 6DL",
  "district": "Kinver",
  "county": "Staffordshire",
  "region": "West Midlands",
  "country": "England"
}