{
  "created_at": "2025-01-06T04:04:52.161511+00:00",
  "objectID": "46c94bc7e88fd3c3e8a18ed615016024",
  "ref": "wooler-common-walking-route",
  "title": "Wooler Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/The_St_Cuthbert%27s_Way_near_Wooler_-_geograph.org.uk_-_444972.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/46c94bc7e88fd3c3e8a18ed615016024.gpx",
  "_geoloc": {
    "lat": 55.5475228264,
    "lng": -2.0117403504
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/The_St_Cuthbert%27s_Way_near_Wooler_-_geograph.org.uk_-_444972.jpg",
      "title": "Walter Baxter / The St Cuthbert's Way near Wooler",
      "caption": "The St Cuthbert's Way near Wooler"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Public_bridleway_to_Wooler_Common_-_geograph.org.uk_-_444975.jpg",
      "title": "Walter Baxter / Public bridleway to Wooler Common",
      "caption": "Public bridleway to Wooler Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Hill_farmland_near_Wooler_-_geograph.org.uk_-_444979.jpg",
      "title": "Walter Baxter / Hill farmland near Wooler",
      "caption": "Hill farmland near Wooler"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_public_bridleway_to_Broadstruther_-_geograph.org.uk_-_449150.jpg",
      "title": "Walter Baxter / The public bridleway to Broadstruther",
      "caption": "The public bridleway to Broadstruther"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Lake_near_Wooler_Common_-_geograph.org.uk_-_1420417.jpg",
      "title": "Stephen Craven / Lake near Wooler Common",
      "caption": "Lake near Wooler Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Footbridge_over_the_Humbleton_Burn_-_geograph.org.uk_-_1420436.jpg",
      "title": "Stephen Craven / Footbridge over the Humbleton Burn",
      "caption": "Footbridge over the Humbleton Burn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Access_ramp_to_Wooler_Common_nature_trail_-_geograph.org.uk_-_1420429.jpg",
      "title": "Stephen Craven / Access ramp to Wooler Common nature trail",
      "caption": "Access ramp to Wooler Common nature trail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Red_barn_at_Wooler_Common_-_geograph.org.uk_-_1420976.jpg",
      "title": "Stephen Craven / Red barn at Wooler Common",
      "caption": "Red barn at Wooler Common"
    }
  ],
  "distance_km": 6.0,
  "description": "Explore this attractive area of woodland and common land on this walk in the Northumberland National Park. It's a very peaceful area with lovely views of the Cheviot Hills, two pretty ponds and an easy access trail to try. The town of Wooler is a popular base for walkers with direct access to the Cheviot Hills. The common is also a short walk from the town centre. Just follow the St Cuthbert's Way long distance trail south west and you soon come to the site. You'll pass the King's Chair Hill and Kenterdale Hill before picking up a lovely trail along the Humbleton Burn. There's some moderate climbing involved with the route reaching a height of over 700ft. From the high points there are splendid views over the surrounding hills and countryside. To extend your walking in the area you could climb to Humbleton Hill for views towards the Scottish Hills and the Northumberland. It's a fairly short, steep climb from the town and includes the remains of an Iron Age Hillfort. You could also continue west along the St Cuthbert's Way and visit Yeavering Bell with its a late-prehistoric Hill fort. St Cuthberts Cave can also be reached by following the trail north east from the town. The monks of Lindisfarne reputedly brought St. Cuthbert's body to the site in AD875 following Viking raids on the Island. Near the cave there's also the peaceful woodland trails and steep rock climbing cliffs in the adjacent Kyloe Woods. The Cheviot is also not too far from Wooler Common. If you head south west along the nearby Harthope Burn it will take you to Langleeford where our circular walk to the summit begins. From here you can also climb Hedgehope Hill. A few miles to the north of the town you can enjoy a visit to Roughting Linn waterfall.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into nearby Wooler and there's a good range of pubs and cafes. The Anchor Inn is a good choice with a friendly atmosphere and very good food at reasonable prices. You can find it on Cheviot St with a postcode of NE71 6LN. It's also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles south east of the town and there's a cluster of interesting sites to visit. You can enjoy peaceful woodland trails in Hepburn Woods and climb to the Iron Age Hill Fort at Ros Castle for excellent views over the area. The splendid Chillingham Castle is also near here. The 13th century castle is said to be the most haunted in Britain. It's surrounded by gardens, lakes and fountains with easy footpaths to explore on. Just a few miles to the west you can explore the beautiful College Valley where you can enjoy waterside trails along the College Burn to the pretty Hethpool Linn waterfall. For more walking ideas in the area see the Cheviots Walks and Northumberland Walks pages."
    }
  ],
  "district": "Wooler",
  "county": "Northumberland",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}