{
  "created_at": "2025-01-06T00:23:20.424637+00:00",
  "objectID": "46d26f93cec316cefa1767305d53e310",
  "ref": "alston-walking-route",
  "title": "Alston Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Alston_-_geograph.org.uk_-_30084.jpg",
  "nearby": [
    {
      "description": "South Tyne Trail",
      "objectID": "5175f9ea7b30694bc74925113568a0e9",
      "ref": "south-tyne-trail-walking-and-cycle-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Allendale",
      "objectID": "eb803feb2a7d6f01d2ae82e5b8254a49",
      "ref": "allendale-walking-route"
    },
    {
      "description": "Isaac's Tea Trail",
      "objectID": "908046917efdc700cc21b8f6af5d2844",
      "ref": "isaacs-tea-trail-walking-route"
    },
    {
      "description": "Ashgill Force",
      "objectID": "e3f4814ed655d7f66c32019a18269553",
      "ref": "ashgill-force-walking-route"
    },
    {
      "description": "Haydon Bridge",
      "objectID": "d685b88c2e2fa33c526f519cc7dd9fc0",
      "ref": "haydon-bridge-walking-route"
    },
    {
      "description": "Allenheads",
      "objectID": "a0f7105253ce541885b196ed11906bb7",
      "ref": "allenheads-walking-route"
    },
    {
      "description": "Garrigill",
      "objectID": "f6fd4664e90465d61b8a1e6461475b3a",
      "ref": "garrigill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/46d26f93cec316cefa1767305d53e310.gpx",
  "_geoloc": {
    "lat": 54.8152968866,
    "lng": -2.4423601317
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Alston_-_geograph.org.uk_-_30084.jpg",
      "title": "Carl Bendelow / Alston",
      "caption": "Alston market square in the summer of 2005."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Alston_Market_Cross_-_geograph.org.uk_-_1745507.jpg/256px-Alston_Market_Cross_-_geograph.org.uk_-_1745507.jpg",
      "title": "Malc McDonald / Alston Market Cross",
      "caption": "Alston Market Cross This is a replica, built to replace the original which was destroyed by a lorry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Alston_Post_Office._-_geograph.org.uk_-_132452.jpg",
      "title": "Colin Smith / Alston Post Office.",
      "caption": "lston Post Office. This is taken looking downhill and north towards the church and market place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Confluence_of_Rivers_South_Tyne_and_Nent_-_geograph.org.uk_-_170351.jpg",
      "title": "Brian Norman / Confluence of Rivers South Tyne and Nent",
      "caption": "Confluence of Rivers South Tyne and Nent. The rivers meet just north of Alston station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Angel_Inn%2C_Alston.jpg",
      "title": "Mike Quinn / The Angel Inn",
      "caption": "Photograph of the Angel Inn. A historic pub worth a visit in the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Alston_Station_-_geograph.org.uk_-_1533588.jpg",
      "title": "George Ford / Alston Station",
      "caption": "Alston Station. Locomotive Thomas Edmonton pulling a train into Alston Station on the South Tyne Railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/The_River_South_Tyne_near_Kirkhaugh_-_geograph.org.uk_-_590834.jpg",
      "title": "Mike Quinn / The River South Tyne near Kirkhaugh",
      "caption": "The River South Tyne near Kirkhaugh"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/River_South_Tyne_and_Alston_Arches_Viaduct_-_geograph.org.uk_-_574546.jpg",
      "title": "Stephen McKay / River South Tyne and Alston Arches Viaduct",
      "caption": "River South Tyne and Alston Arches Viaduct. The river flows over this weir immediately after passing under the former railway viaduct. The railway was opened in 1852, primarily to serve the lead-mines around Alston. It was finally closed in 1976 - surprisingly late for a line serving such a deeply rural area."
    }
  ],
  "distance_km": 9.7,
  "description": "This Cumbrian market town is located in a lovely spot on the River South Tyne. The historic town has a charming cobbled main street with a market cross and many interesting old buildings including a 17th century pub of some note. It's also notable as one of the highest elevation towns in the country, at about 1000 feet (300 m) above sea level. This walk from the town uses sections of the South Tyne Trail and the Pennine Way to create a circular walk around the area. The walk starts in the town at the train station and follows the South Tyne Trail north west along the South Tynedale Railway and the River South Tyne. At Kirkhaugh you turn south west to pick up the Pennine Way and follow it to Whitley Castle Roman Fort. You then climb past Whitlow and Wanwoodhill to Harbut Lodge. This section rises to a height of over 1000 feet with fine views over the area. Just south of Harbut Lodge you cross the river to return to Alston.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The 17th century Angel Inn is a good choice for some post walk refreshments. It dates all the way back to 1611 and has a charming interior. You can find the old inn on Front Street with a postcode of CA9 3HU for your sat navs. Alston rail station on the heritage railway also has a nice cafe with a good choice of meals and snacks. It's a fine place to stop at while enjoying views of the old steam trains."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and river trails on the route are great for dog walking. There is a moderate climb on the way so your dog does need to be in reasonable shape. The Angel Inn mentioned above is also dog friendly. The South Tynedale railway mentioned above is also very dog friendly. They will provide a dog treat and also have shop selling locally made Wellybix biscuits which come in a delicious range of flavours. Dogs are welcome in all of the areas including the cafes, Discovery Centre and Engineering Workshop Viewing Gallery. Water bowls can be found at Alston station too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The South Tynedale Steam Railway is a great way to further explore the area. The heritage steam trains run northwards for almost 5 miles from Alston in Cumbria, past the original terminus at Gilderdale, on through Kirkhaugh and Lintley to the village of Slaggyford. The circular Isaac's Tea Trail also runs through the town. You could pick this up to visit the pretty village of Allendale where there are some nice walks along the River East Allen. Head south along the South Tyne Trail and you will some to the attractive village of Garrigill and the impressive Ashgill Force waterfall. There's a nice path along the Ash Gill with a series of cascades and the falls themselves which plunge 55ft over a rocky shelf. Near here there's the Nenthead mining heritage centre where you can learn all about the lead and zinc mining history of the North Pennines. There's also mine entrances, dumps, old buildings, reservoirs and some rare plants growing on the metal-rich mine dumps. The village can be reached by following a pleasant country lane north east for just over 2 miles. Just east of Nenthead there's also Allenheads where you will find more ruined mines, a heritage centre and a decent pub dating back to 1770. For more walking ideas in the area see the North Pennines Walks and Cumbria Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/o3eeBUkvDSs",
  "postcode": "CA9 3HN",
  "district": "Alston",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A686, The Butts, Alston Moor, Alston, Westmorland and Furness, England, CA9 3HN, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "trail",
    "river",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}