{
  "created_at": "2025-01-05T23:33:18.809432+00:00",
  "objectID": "46ebb284b2a1f53811a28182f1b7dd1b",
  "ref": "acle-and-the-river-bure-walking-route",
  "title": "Acle and the River Bure Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8b/River_Bure_Near_Acle_-_geograph.org.uk_-_1081175.jpg",
  "nearby": [
    {
      "description": "Breydon Water",
      "objectID": "a5575adf79cf173931ae942ede3a2bac",
      "ref": "breydon-water-walking-route"
    },
    {
      "description": "Ranworth Broad",
      "objectID": "507405a48a05a2c658a833abfb2d7f1e",
      "ref": "ranworth-broad-walking-route"
    },
    {
      "description": "Burlingham Woods",
      "objectID": "684beff1a2e69fe8758c8f9f7cfdcf8f",
      "ref": "burlingham-woods-walking-route"
    },
    {
      "description": "Strumpshaw Fen",
      "objectID": "35421d1e018fded6911eae2b62d5d8bc",
      "ref": "strumpshaw-fen-walking-route"
    },
    {
      "description": "Brundall",
      "objectID": "c6bad2a03005020a7933ec14f12dafec",
      "ref": "brundall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/46ebb284b2a1f53811a28182f1b7dd1b.gpx",
  "_geoloc": {
    "lat": 52.6407348395,
    "lng": 1.5582398054
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/River_Bure_Near_Acle_-_geograph.org.uk_-_1081175.jpg",
      "title": "Andy Jamieson / River Bure Near Acle",
      "caption": "River Bure Near Acle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Acle_Dyke_-_geograph.org.uk_-_802864.jpg",
      "title": "Pierre Terre / Acle Dyke",
      "caption": "Acle Dyke"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/St_Edmund%27s_church_-_geograph.org.uk_-_817194.jpg",
      "title": "Evelyn Simak / St Edmund's church",
      "caption": "The noteworthy St Edmund's church in Acle. St Edmund's church has a Norman round tower with a bell stage dating from the same time. The church has been restored but some medieval survivals remain, the probably most noteworthy being the 15th century font, the inscription of which gives the precise date of 1410. The rood screen dado panels are painted red and green and bear the stencilled monogram of St Edmund. Another treasure of this church is a large graffito across the north chancel wall which dates from a time when many villagers were killed by the then raging pestilence. Having been restored, the script is now protected behind glass. Beneath it a brass to Thomas Stone, who was vicar here during the reign of James I, has been mounted on the wall. This is the only 17th century brass to a minister in Norfolk. The church is open every day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Wherries_on_the_River_Bure_near_Acle_-_geograph.org.uk_-_1052133.jpg",
      "title": "Andy Jamieson / Wherries on the River Bure near Acle",
      "caption": "Wherries on the River Bure near Acle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/River_Bure%2C_Calthorpe_Level_Marsh_-_geograph.org.uk_-_802960.jpg",
      "title": "Pierre Terre / River Bure, Calthorpe Level Marsh",
      "caption": "River Bure, Calthorpe Level Marsh. Looking downstream across a horseshoe bend in the river. In the distance is Marsh Farm, just inside the next square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Footpath_along_the_River_Bure_-_geograph.org.uk_-_1496640.jpg",
      "title": "Evelyn Simak / Footpath along the River Bure",
      "caption": "Footpath along the River Bure"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/The_Weavers_Way_from_Halvergate_to_Acle_-_geograph.org.uk_-_1480240.jpg",
      "title": "Evelyn Simak / The Weavers Way from Halvergate to Acle",
      "caption": "The Weavers Way from Halvergate to Acle. The barn conversion seen in the background is located in the adjacent grid square. The Weavers Way is a long-distance footpath which links Cromer with Great Yarmouth; the path has a length of 90 kilometres and passes through the Norfolk Broads."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/View_towards_Tunstall_Dyke_mill_from_the_northeast_-_geograph.org.uk_-_821988.jpg",
      "title": "Evelyn Simak / View towards Tunstall Dyke mill from the northeast",
      "caption": "View towards Tunstall Dyke mill from the northeast. A short distance further to the east, on the other side of Tunstall dyke, there is what is left of Norfolk's last remaining 18th century timber smock mill"
    }
  ],
  "distance_km": 8.0,
  "description": "This circular walk explores the Bure Valley around the pretty Norfolk market town of Acle. It's a beautiful area with lots of water loving wildlife to look out for. Starting on the eastern edge of the town you follow the Weavers' Way south to Damgate Marshes before turning east along the Tunstall Dyke. You soon come to the River Bure where you pick up the riverside footpaths towards Stokesby. Here you turn west and follow the river back to Acle. If you would like to extend your walk you could follow the river east from Acle to Great Yarmouth. It's about a 10 mile walk to the coast with the river dotted with lots of pretty drainage mills. At Great Yarmouth you can enjoy more waterside paths along the beautiful Breydon Water. Also nearby is a circular walk around Fleggburgh and Filby Broad. If you head north along the Bure you will soon come to Acle Bridge where there is a nice waterside pub. Keep going and you will soon come to Hickling Broad where there is a huge variety of wildlife to look out for.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Weavers Way Circular Walk starts from Acle and takes you along the waymarked path to Breydon Water before returning along the River Bure. It also visits the partially ruined church in Tunstall and the village of Halvergate. Head a few miles north west and you can visit the lovely Ranworth Broad. There's a nature reserve here with a visitor centre, woodland, reed beds, a boardwalk and a huge variety of birdlife to see. There's also the noteworthy 16th century church of St Mary to visit in the village of Ranworth. The church has a 100ft tower which you can climb for excellent views over the area. Just a couple of miles to the west there's Burlingham where you can explore the peaceful trails around Burlingham Woods. It's a lovely place for a stroll with carpets of snowdrops in Ferbruary and lots of bluebells in the spring months. There's also the interesting ancient ruins of the 14th century St Peter church to see in this area. Near here you'll also find the RSPB's Strumpshaw Fen. There's some lovely trails here with River Yare views, marshland, lakes, orchid-rich meadows and lots of birdlife to see. For more walking ideas in the area see the Norfolk Broads Walks page."
    }
  ],
  "district": "Broadland",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Boat Dyke Lane, Acle, Broadland, Norfolk, England, NR13 3QP, United Kingdom",
  "postcode": "NR13 3QP",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "marsh"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "drainage mills",
    "broads"
  ],
  "facilities": [
    "pub/cafe",
    "waterside"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}