{
  "created_at": "2025-01-06T02:04:03.025755+00:00",
  "objectID": "470cd0633dc23ea5bd94f476c2ccc155",
  "ref": "little-chalfont-walking-route",
  "title": "Little Chalfont Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Clock_shop_and_the_Sugar_Loaf_in_Little_Chalfont%2C_Buckinghamshire_-_geograph-3186484.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/470cd0633dc23ea5bd94f476c2ccc155.gpx",
  "_geoloc": {
    "lat": 51.6682824465,
    "lng": -0.5596075635
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Clock_shop_and_the_Sugar_Loaf_in_Little_Chalfont%2C_Buckinghamshire_-_geograph-3186484.jpg",
      "title": "Des Blenkinsopp / Clock Shop & The Sugar Loaf",
      "caption": "Clock shop and the Sugar Loaf in Little Chalfont, Buckinghamshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Nightingales_Corner%2C_Little_Chalfont_-_geograph.org.uk_-_988796.jpg",
      "title": "Jonathan Billinger / Nightingales Corner, Little Chalfont",
      "caption": "Nightingales Corner, Little Chalfont"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/River_Chess_-_geograph.org.uk_-_1150468.jpg",
      "title": "Graham Horn / River Chess",
      "caption": "River Chess. Below Latimer Park Farm, which has a lake formed from the River Chess, it appears that another small lake has been created here, as the river is wider than one would expect."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Latimer_House_-_geograph.org.uk_-_139070.jpg",
      "title": "Nigel Cox / Latimer House",
      "caption": "Latimer House. Latimer House. Built in 1838 and replacing an old manor house on the site, this was originally the home of Lord Chesham. From 1947 to 1983 it was used as the Joint Services Staff College, which existed to train officers to fill joint command and staff appointments by studying modern war on a joint service basis and by widening their knowledge of inter-service problems."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Latimer%2C_River_Chess_and_Great_Water_-_geograph.org.uk_-_139084.jpg",
      "title": "Nigel Cox / Latimer: River Chess & Great Water",
      "caption": "Latimer: River Chess & Great Water. The weir at the downstream end of Latimer Park's Great Water lake is on the right, with the River Chess on the left, viewed looking upstream from the Flaunden Bottom road bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/River_Chess_at_Chenies_Bottom_-_geograph.org.uk_-_730390.jpg",
      "title": "Nigel Cox / River Chess at Chenies Bottom",
      "caption": "River Chess at Chenies Bottom. Viewed looking downstream from the bridge on the road to Flaunden with water meadows on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Chenies_-_geograph.org.uk_-_139218.jpg",
      "title": "Nigel Cox / Chenies",
      "caption": "Chenies village. Viewed looking westwards across the village green. The village pump is visible to the left of the old style road sign, and the house in the distance has a plaque indicating that it was built in 1857."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Chenies_-_The_Manor_House_-_geograph.org.uk_-_139226.jpg",
      "title": "Nigel Cox / Chenies: The Manor House",
      "caption": "Chenies. The Manor House, a popular local attraction. The fine Tudor House is a Grade I listed building and is surrounded by award-winning gardens. Original 13th Century features including a Medieval well, a dungeon and a reputed priest hole. You can tour the house and garden for a fee, from April to October."
    }
  ],
  "distance_km": 6.5,
  "description": "This attractive Buckinghamshire village is part of the 'Chalfonts' along with Chalfont St Giles and Chalfont St Peter. There's some lovely Chilterns countryside, riverside trails and the local Little Chalfont Nature Park for walkers to explore. This circular walk from the village takes you along the River Chess to the nearby Chenies village and manor house. The walk starts at the Chalfont and Latimer train station where you can pick up the Chess Valley Walk. Follow the waymarked trail north and it will take you up to the river, passing through West Wood on the way. Follow the river path east and it will take you past Latimer to Chenies Bottom where you cross the river and head into Chenies village. Here you'll find the Tudor Chenies Manor House which is open to the public during the summer months. The route then heads south west past Old Hanging Wood before heading through Little Chalfont to return to the train station. You can extend the walk by heading a short distance south west of the station to visit Little Chalfont Nature Park. The lovely little park includes a rare wild flower meadow, old woodlands and relics of its past as a farm and a cherry orchard. There's information boards where you can learn about the variety of flora and fauna at the site. You can find them on Cokes Lane at postcode HP7 9QB for sat navs.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near the train station you'll find The Metropolitan. The beautifully restored pub serves high quality food and has a nice garden area and patio to sit out in. You can find them at Chalfont Station Rd, HP7 9PN."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Chilterns Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ghLm3MLVNMs",
  "postcode": "HP6 6PX",
  "district": "Little Chalfont",
  "county": "Buckinghamshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}