{
  "objectID": "474236a5de67a39c66bc8ebc62314f36",
  "created_at": "2024-12-18T01:29:44.614552+00:00",
  "ref": "bridgwater-bay-national-nature-reserve-walking-route",
  "title": "Bridgwater Bay National Nature Reserve Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/af/Tower_of_the_Winds%2C_bird_hide_near_Stert_point_-_geograph.org.uk_-_1356369.jpg",
  "nearby": [
    {
      "description": "River Parret Trail",
      "objectID": "1b25fa6dc78efa7cac7abfa6629880aa",
      "ref": "river-parret-trail-walking-route"
    },
    {
      "description": "Steart Marshes",
      "objectID": "48cc4d4305f20202a4e9426784adfaba",
      "ref": "steart-marshes-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/607B8FC43D2C94BC8025800F003AFB90/$FILE/Bridgwater Bay National Nature Reserve.gpx",
  "_geoloc": {
    "lat": 51.2080877137,
    "lng": -3.0387204359
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Tower_of_the_Winds%2C_bird_hide_near_Stert_point_-_geograph.org.uk_-_1356369.jpg",
      "title": "Ken Grainger / Tower of the Winds, bird hide near Stert point, via Wikimedia Commons",
      "caption": "Tower of the Winds, bird hide near Stert point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Stert_Point_-_geograph.org.uk_-_1356384.jpg",
      "title": "Ken Grainger / Stert Point, via Wikimedia Commons",
      "caption": "View of the bay from Stert Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/No_landing_sign%2C_Stert_Point_-_geograph.org.uk_-_1008092.jpg",
      "title": "Roger Cornfoot / No landing sign, Stert Point, via Wikimedia Commons",
      "caption": "No landing sign on the pebble beach, Stert Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/A_beach_near_Steart_and_Stert_Flats_-_geograph.org.uk_-_918753.jpg",
      "title": "Brian Robert Marshall / A beach near Steart and Stert Flats, via Wikimedia Commons",
      "caption": "A beach near Steart and Stert Flats The viewpoint is Wall Common. Beyond the beach is Stert Flats, a nature reserve, starting to be covered by the incoming tide. The lighthouse at the left is at the mouth of the River Brue."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Mouth_of_the_River_Parrett_-_geograph.org.uk_-_22062.jpg",
      "title": "Richard Baker / Mouth of the River Parrett, via Wikimedia Commons",
      "caption": "Mouth of the River Parrett. Taken from Steart, looking NE, showing the southern end of Steart Island with Burnham-on-Sea and Brent Knoll in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Marsh_and_mudflats%2C_Steart_-_geograph.org.uk_-_276562.jpg",
      "title": "Keith Allison / Marsh and mudflats, Steart, via Wikimedia Commons",
      "caption": "Marsh and mudflats, Steart Marsh and mudflats in the corner of the square, looking north-west towards Stert Flats. Viewed from the nearby floodbank footpath."
    }
  ],
  "distance_km": 2.5,
  "description": "Explore this beautiful nature reserve on this short walk in the Somerset Levels. The reserve is situated on the mouth of the River Parrett with lovely views over the estuary to Stert Island and Burnham-on-Sea. It consists of extensive areas of mudflats, sand banks, reed beds and saltmarshes attracting a large number of birds. Look out for shelduck, curlew, redshank and oystercatcher from the excellent elevated bird hide. There is also an abundance of interesting flora with wildflowers and plants including Somerset hair grass,wild thyme, horseshoe vetch and birds-foot-trefoil. Steart Marshes nature reserve is also located on the south side of the peninsula with otters, egrets, owls waders and wildfowl to look out for. The River Parret Trail starts from Bridgwater Bay so you can pick this up to extend your walking in the area. The lovely waterside trail heads south to the nearby village of Combwich and then on to Bridgwater. This walk start from the Steart car park but you could also start from Combwich or Bridgwater and follow the River Parret Trail to the reserve. You could also head west along the estuary towards Hinckley Point Nuclear Power Station. It's a lovely walk with great views of the Sterte Flats and Catsford Common.",
  "video_url": "https://player.vimeo.com/video/105002312",
  "postcode": "TA5 2PX",
  "district": "Steart",
  "county": "Somerset",
  "region": "South West",
  "country": "England"
}