{
  "objectID": "47650aa25f6e18ce9418670a16f9443c",
  "created_at": "2024-12-18T23:13:03.921631+00:00",
  "ref": "south-staffordshire-railway-walk-walking-and-cycle-route",
  "title": "South Staffordshire Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/01/South_Staffordshire_Railway_Walk_-_geograph.org.uk_-_280519.jpg",
  "nearby": [
    {
      "description": "Wombourne Railway Walk",
      "objectID": "37c0cd74db3f71c2f8ea51e533c71534",
      "ref": "wombourne-railway-walk-walking-route"
    },
    {
      "description": "Kingswinford Railway Walk",
      "objectID": "f818f7b396a3e20db2584255fc7ffa34",
      "ref": "kingswinford-railway-walk-walking-route"
    },
    {
      "description": "Himley Hall",
      "objectID": "cfdf8670e3de3230963f6be019ca1764",
      "ref": "himley-hall-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/BA034BECA5B851E48625859D0046B29A/$FILE/South Staffordshire Railway Walk.gpx",
  "_geoloc": {
    "lat": 52.60772926,
    "lng": -2.1505065046
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/South_Staffordshire_Railway_Walk_-_geograph.org.uk_-_280519.jpg",
      "title": "John M / South Staffordshire Railway Walk",
      "caption": "Started in 1912 this GWR line opened in 1925 serving the western side of Dudley and Wolverhampton. The passenger service was shortlived finishing in 1932. The line was used for freight only except for a short period following D-Day when evacuation trains brought the wounded to the hospitals in the area. The final train ran on 24th June 1965. It is now used as a railway walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/South_Staffordshire_Railway_Walk%2C_Himley_Station_-_geograph.org.uk_-_633192.jpg",
      "title": "Roger  Kidd / South Staffordshire Railway Walk, Himley Station",
      "caption": "Himley Station. The branch line joining Wolverhampton with Stourbridge Junction closed in 1965. It is now part of an extended leisure walkway which includes a nature reserve and a maintained area of deciduous woodland, both open to the public. Here at Himley Station, the platform, about 150 yards in length is on the right. One of several picnic areas opens out by a car park on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Pine_Trees_on_the_South_Staffordshire_Railway_Walk_-_geograph.org.uk_-_634180.jpg",
      "title": "Roger  Kidd / Pine Trees on the South Staffordshire Railway Walk",
      "caption": "Pine Trees on the South Staffordshire Railway Walk. If you drive from Wolverhampton towards Kidderminster on the A449, a straight avenue of pine trees dominates the skyline on the right as you cross the B4176 at Himley. These trees line the route of the defunct Wolverhampton to Stourbridge railway line on a long embankment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/South_Staffordshire_Railway_Walk_at_Wombourne_-_geograph.org.uk_-_628769.jpg",
      "title": "Roger  Kidd / South Staffordshire Railway Walk at Wombourne",
      "caption": "Trail view at Wombourne. The two intrepid cyclists on this cool and breezy December morning have enjoyed coffee at the former Wombourne (Bratch) Station, now a tea room especially popular on summer weekends."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Steps_to_the_Railway_Walk%2C_Himley%2C_Staffordshire_-_geograph.org.uk_-_643050.jpg",
      "title": "Roger  Kidd / Steps to the Railway Walk, Himley, Staffordshire",
      "caption": "Steps to the Railway Walk, Himley, Staffordshire. There is easy pedestrian access up sturdy steps from the A449 road to the South Staffordshire Railway Walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Kingswinford_Railway_Walk_-_geograph.org.uk_-_287937.jpg",
      "title": "John M / Kingswinford Railway Walk",
      "caption": "Near Kingswinford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Smestow_Brook_in_the_Valley_Park_-_geograph.org.uk_-_408732.jpg",
      "title": "John M / Smestow Brook in the Valley Park",
      "caption": "Smestow Brook in the Valley Park. The Smestow Brook flows down towards Compton. The Brook rises near the centre of Wolverhampton and flows down to the Stour below Stourbridge. On the outskirts of town it looks somewhat different to how it smells!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Smestow_Valley_Nature_Walk%2C_Wolverhampton_-_geograph.org.uk_-_623979.jpg",
      "title": "Roger  Kidd / Smestow Valley Nature Walk, Wolverhampton",
      "caption": "Smestow Valley Nature Walk, Wolverhampton This part of the excellent recreational area known as Smestow Valley Nature Reserve is looking (from near Meccano Bridge) north-east along the former railway line"
    }
  ],
  "distance_km": 17.7,
  "description": "This easy route follows a dismantled railway line from Wolverhampton to Pensett. It runs for about 11 miles along the old Wolverhampton to Dudley railway line. The line was closed in 1965 but is now a leisure route suitable for walkers and cyclists. Along the way there's some nice woodland sections, a nature reserve and views of the local river and canal. The route starts at Aldersley Stadium, just to the north west of the centre of Wolverhampton. The trail then heads south west, running alongside the Smestow Brook and the River Stour. This opening section passes Newbridge, the Smestow Valley Park Nature Reserve and Compton. The nature reserve is particularly pretty with peaceful trails and lots of flora and fauna to look out for. You then leave the river and head through Castlecroft and Lower Penn to Wombourne . This is a popular and scenic area which includes the lovely Bratch Locks on the Staffordshire and Worcestershire Canal . There is also a nice cafe for a pit stop. The route continues south through Wombourne before passing through the woodland of the Himley Plantation. Here you branch round to the east, passing Himley and Kingswinford before finishing at Pensett, just north of Brierley Hill.",
  "video_url": "https://www.youtube.com/embed/pxYYdWzs0jQ",
  "district": "Wolverhampton",
  "region": "West Midlands",
  "country": "England"
}