{
  "created_at": "2025-01-06T04:53:16.128457+00:00",
  "objectID": "47915094402f026d119940fe0df24241",
  "ref": "richmond-park-walking-and-cycle-route",
  "title": "Richmond Park Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Cyclist_in_Richmond_Park_-_geograph.org.uk_-_909993.jpg",
  "nearby": [
    {
      "description": "Beverley Brook Walk",
      "objectID": "cb9d2caf633adf2bfe8a4d5041043d5c",
      "ref": "beverley-brook-walk-walking-route"
    },
    {
      "description": "Capital Ring",
      "objectID": "ec2dd412bf73a76208eeb393c1b23372",
      "ref": "capital-ring-walking-route"
    },
    {
      "description": "Ham House Richmond",
      "objectID": "267b3c34ca0951989aa9511c3185eec1",
      "ref": "ham-house-richmond-walking-route"
    },
    {
      "description": "Wimbledon Common",
      "objectID": "c9e8708094a0c9c7bc62a5df5a345470",
      "ref": "wimbledon-common-walking-and-cycle-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Syon Park",
      "objectID": "a2c41ac78b5a5ad1107a3c8848aebf94",
      "ref": "syon-park-walking-route"
    },
    {
      "description": "Kew Gardens",
      "objectID": "b7330e22fe8a2bef187c9686f9a9070b",
      "ref": "kew-gardens-walking-route"
    },
    {
      "description": "Crane Park",
      "objectID": "85912f23d80d3889bd46ea6e2eddeec4",
      "ref": "crane-park-walking-route"
    },
    {
      "description": "Cranford Country Park",
      "objectID": "c8dc00862dc6feeb50524bdf98d7a06e",
      "ref": "cranford-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/47915094402f026d119940fe0df24241.gpx",
  "_geoloc": {
    "lat": 51.4426098903,
    "lng": -0.2934390306
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Cyclist_in_Richmond_Park_-_geograph.org.uk_-_909993.jpg",
      "title": "David Hawgood / Cyclist in Richmond Park",
      "caption": "Cyclist in Richmond Park. There is a gravel path around Richmond Park, just outside the roads, available to cyclists but with a 10 mph speed limit. Faster cyclists can use the roads."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Richmond_Park_-_geograph.org.uk_-_676200.jpg",
      "title": "Nigel Cox / Richmond Park",
      "caption": "Richmond Park covers almost 1,000 hectares and is designated as a National Nature Reserve (NNR), a Site of Special Scientific Interest (SSSI) and a Special Area of Conservation (SAC). Here a dead tree has been left in situ to provide a particular environment for certain species of mammals, birds and insects."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Deer_in_Richmond_Park_-_geograph.org.uk_-_507397.jpg",
      "title": "Colin Smith / Deer in Richmond Park",
      "caption": "Deer in Richmond Park. Fallow and Red Deer live in the grass and woodland of Richmond Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Richmond_Park_-_geograph.org.uk_-_676695.jpg",
      "title": "Nigel Cox / Richmond Park",
      "caption": "This was taken looking along the north eastern boundary of the park towards Adam's Pond and East Sheen Gate. Richmond Park covers almost 1,000 hectares and is designated as a National Nature Reserve (NNR), a Site of Special Scientific Interest (SSSI) and a Special Area of Conservation (SAC)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Pembroke_Lodge_car_park%2C_Richmond_Park_-_geograph.org.uk_-_909982.jpg",
      "title": "David Hawgood / Pembroke Lodge car park, Richmond Park",
      "caption": "Pembroke Lodge car park. Cars of walkers, cyclists, visitors to the cafe and restaurant, and guests at a wedding in Pembroke Lodge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Cafe_in_Richmond_Park_-_geograph.org.uk_-_692263.jpg",
      "title": "Stephen Craven / Cafe in Richmond Park",
      "caption": "Cafe in the park. The wooden building in this photo is the cafe near the Roehampton Gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Pen_Ponds%2C_Richmond_Park_-_geograph.org.uk_-_17621.jpg",
      "title": "steve / Pen Ponds, Richmond Park",
      "caption": "Pen Ponds. Popular area to feed the duck and gulls. This is the southern of two large ponds"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/The_White_Lodge%2C_Richmond_Park_-_geograph.org.uk_-_17626.jpg",
      "title": "steve / The White Lodge, Richmond Park",
      "caption": "The White Lodge. This was built in 1729 for George II, it now houses the Royal Ballet School and was the childhood home of Bertrand Russell."
    }
  ],
  "distance_km": 11.0,
  "description": "Enjoy miles of super cycling and walking trails in this large deer park in London. Richmond Park is the largest of London's Royal Parks at 955 hectares or 2,360 acres. For cyclists National Cycle Network Route 4 and the circular Tamsin Trail run through the park on roads and well surfaced off road tracks. The Tamsin Trail - The route below shows this cycling and walking trail which runs around the perimeter of the park on lovely resurfaced paths. It's a very popular route as it provides a great, largely traffic free ride in London. On it you'll pass woodland and ponds with a section along the pretty Beverley Brook. Cycles are available for hire near Roehampton Gate and, at peak times, near Pembroke Lodge in the north west corner of the park. If you're on foot you could head to the beautiful Isabella Plantation. Here you'll find a 40 acre woodland garden with evergreen azaleas, ponds, Rhododendrons and Camellias. There's also the delightful Pen Ponds. The ponds are divided by a causeway which you can walk along and look out for a variety of birdlife. If you'd like to continue your walk you could pick up the Capital Ring which runs through the park. One good option is to follow the trail to the nearby Wimbledon Common. Or you could head to Ham House at the western side of the park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "This route starts/finishes from Pembroke Lodge on the north western side of the park where you'll find the Petersham Park Car Park. If you have time the Grade II listed lodge is well worth exploring. The photogenic Georgian Mansion includes 11 acres of beautifully landscaped grounds and gardens. It's situated in the highest spot in the park and includes the King Henry's Mound viewpoint where there is a protected view of St Paul's Cathedral in the City. The has an interesting history, having been the residence of the British prime minister Lord John Russell and the childhood home of his grandson, the philosopher Bertrand Russell. The site also includes a lovely cafe where you can enjoy a delicious cream tea after your exercise. You can find the mansion at a postcode of TW10 5HX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland trails are ideal for dog walking so you're bound to see other owners on your visit. You are asked to please keep them on leads near the deer, in the Isabella Plantation and around Pen Ponds. Dogs are not permitted at Pembroke Lodge and Gardens."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the north western end of the park you could exit to visit the attractive town of Richmond. Here you could pick up the Thames Path National Trail and enjoy a lovely cycle or walk along the riverside trail. If you were to follow it north you could visit Syon Park and the wonderful botanical gardens at Kew Gardens. The popular Crane Park is located just to the west in Twickenham. The peaceful park includes an informative visitor centre, cafe, woodland trails along the River Crane, lots of wildlife and the interesting 18th century Shot Tower. Just north of here you can also reach the historic Cranford Country Park on the riverside trail. For more walking ideas in the area see the London Walks page."
    }
  ],
  "postcode": "TW10 5HX",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Tamsin Trail, Petersham, London Borough of Richmond upon Thames, London, Greater London, England, TW10 5HX, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "waterfront"
  ],
  "points_of_interest": [
    "gardens",
    "bird watching",
    "historical sites"
  ],
  "facilities": [
    "cycle hire",
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}