{
  "created_at": "2025-01-06T04:41:04.653693+00:00",
  "objectID": "479b428bfe6e07a11348304217ee7a32",
  "ref": "mersey-way-walking-route",
  "title": "Mersey Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Mersey_Way_beside_old_Liverpool_Airport_-_geograph.org.uk_-_493534.jpg",
  "nearby": [
    {
      "description": "Liverpool City Walk",
      "objectID": "529576ea092df8d6c0c53a002ffadc38",
      "ref": "liverpool-city-walk-walking-and-cycle-route"
    },
    {
      "description": "Speke Hall",
      "objectID": "e3dfa01fd178f1c058f4bedcc2f053ac",
      "ref": "speke-hall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/479b428bfe6e07a11348304217ee7a32.gpx",
  "_geoloc": {
    "lat": 53.4007302255,
    "lng": -2.4922085241
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Mersey_Way_beside_old_Liverpool_Airport_-_geograph.org.uk_-_493534.jpg",
      "title": "Mike Harris / Mersey Way beside old Liverpool Airport, via Wikimedia Commons",
      "caption": "Mersey Way beside old Liverpool Airport. The Mersey Way beside old Liverpool Airport - new boat house under construction in distance and a distant glimpse of the Mersey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/River_Mersey_at_end_of_Brunswick_Street%2C_Garston_-_geograph.org.uk_-_493529.jpg",
      "title": "Mike Harris / River Mersey at end of Brunswick Street, Garston, via Wikimedia Commons",
      "caption": "River Mersey at end of Brunswick Street, Garston. Salt marsh and the view across the river to the Stanlow oil refineries and the chemical works on Helsby Marsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Dungeon_Banks_on_the_Mersey_-_geograph.org.uk_-_683753.jpg",
      "title": "Sue Adair / Dungeon Banks on the Mersey, via Wikimedia Commons",
      "caption": "Dungeon Banks near John Lennon Airport towards the Liverpool end of the walk. A favourite spot for wading birds, taken from the clifftop looking towards Hale Lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/River_Mersey%2CDungeon_Bank_-_geograph.org.uk_-_28120.jpg",
      "title": "Sharon Crowther / River Mersey,Dungeon Bank, via Wikimedia Commons",
      "caption": "River Mersey,Dungeon Bank. Looking towards Hale Village on the Mersey Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/The_Mersey_Way_at_Hale_-_geograph.org.uk_-_683780.jpg",
      "title": "Sue Adair / The Mersey Way at Hale",
      "caption": "The signpost and gate at the end of Hale stretch of the Way. The path here turns left away from the river along Within Way through Hale Village and around the Duck Decoy which can only be accessed by permit. It returns to the riverbank at Pickerings Pasture local nature reserve. There are extensive views towards Widnes and over to the Cheshire Hills and also down river as far as Wales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Mersey_Way%2C_Widnes_-_geograph.org.uk_-_40644.jpg/256px-Mersey_Way%2C_Widnes_-_geograph.org.uk_-_40644.jpg",
      "title": "Sue Adair / Mersey Way, Widnes",
      "caption": "Widnes. Looking back from Westbank along the Way to Pickering's Pasture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Spike_Island_Widnes_-_geograph.org.uk_-_291463.jpg",
      "title": "Alan Pennington / Spike Island Widnes",
      "caption": "Spike Island Widnes. Looking from the St.Helens canal towards the River Mersey and across to the other side of the river is the Manchester Ship Canal, to the right of this picture is the Widnes Runcorn road bridge and next to that the railway bridge, both just out of sight. Access to the river Mersey by the boats in Spike Island is still possible but as the river is tidal this is only possible with the tidal conditions. Up until the early 1960s the river could be crossed by a few vehicles and foot passengers on the old transporter bridge. The transporter was a massive steel structured bridge high above the water, a moving platform was hung from the main structure and was pulled across the river slung some 70 feet below the main frame of the bridge. It was like a giant moving swing, and it felt like a swing whenever you travelled on it. Only a small number of vehicles could be carried on each crossing of the river, but back then the traffic requiring to cross from one bank to the other was far smaller than today's hustle & bustle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/View_of_the_Mersey_from_Speke_Hall_-_geograph.org.uk_-_48002.jpg",
      "title": "Sue Adair / View of the Mersey from Speke Hall, via Wikimedia Commons",
      "caption": "View of the Mersey from Speke Hall. The earthern mound of the bund surrounding Speke Hall offers extensive views of the Mersey basin and North Wales across the airport runway. The known history of the manor of Speke, or 'Spec' (brushwood in Old English), goes back to the Domesday survey of 1086 which records that it was one of several properties held by Uctred in 1066. When Adelaide Watt came into her inheritance of Speke Hall, she set about developing a huge new farm complex, and was determined that such an historic property should be preserved for all time, irrespective of the massive amount of industrial development that was fast spreading out from the city. Having made a limited provision in her will to save the house, the estate was sold after she died in 1921, and the farm complex transformed into an aerodrome. It is amazingly surreal to be wandering along the uneven corridors of the hall, quietly absorbed in the atmosphere of a romantic Elizabethan courtyard house, when suddenly the throaty sounds of a 21st century jet rudely interrupts the visions of a more genteel way of life."
    }
  ],
  "distance_km": 35.0,
  "description": "Follow the River Mersey from Warrington to Liverpool on this waterside walk through Cheshire and Merseyside. The trail is often walked in two stages with the first section running from Warrington to Widnes, passing Paddington Meadows Nature Reserve, Spike Island and Victoria Park on the way. The second stage runs from Widnes to Liverpool, passing the Runcorn-Widnes Bridge and John Lennon airport, before finishing at Garston. Here you will find the lovely Speke Hall and Garston Nature Reserve. There are fine views across the Mersey Estuary and lots of wading birds to look out for here. Near here you'll also pass the splendidly positioned Hale Lighthouse. The lighthouse dates back to 1906 and sits just to the south of the interesting village of Hale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Speke Hall at the end of the route has a lovely National Trust cafe where you can refresh yourself. You can enjoy a cream tea here in the outdoor seating area in the attractive courtyard if the weather is fine. Near Hale Head you could take a slight detour from the path to visit Hale village and the Childe of Hale public house. The pub is named after John Middleton, a local giant, born in the village in the 16th century. He is thought to have been one of the tallest people in history at over 9 feet tall. Today the associated pub serves quality food and has a good sized garden area for warmer days. You can find them opposite the war memorial at 6 Church End with a postcode of L24 4AX for your sat navs. They are also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Merseyside Walks page."
    }
  ],
  "county": "Warrington",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mersey Way, Rixton-with-Glazebrook, Warrington, England, WA3 6EA, United Kingdom",
  "postcode": "WA3 6EA",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "waterfront",
    "nature"
  ],
  "points_of_interest": [
    "nature reserve",
    "lighthouse",
    "village"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "bird watching"
  ]
}