{
  "created_at": "2025-01-06T00:43:48.088645+00:00",
  "objectID": "481e93a3a1876a7e9b88f71447f7c076",
  "ref": "adderbury-lakes-walking-route",
  "title": "Adderbury Lakes Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Adderbury_Lake_%28the_northern_end%29_%28geograph_2935627%29.jpg/512px-Adderbury_Lake_%28the_northern_end%29_%28geograph_2935627%29.jpg",
  "nearby": [
    {
      "description": "Kings Sutton",
      "objectID": "a382bcc99c7feea82a8934a09adef0f0",
      "ref": "kings-sutton-walking-route"
    },
    {
      "description": "Aynho",
      "objectID": "b8dbfb386bbe911ff0b2a9aa1270784f",
      "ref": "aynho-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/481e93a3a1876a7e9b88f71447f7c076.gpx",
  "_geoloc": {
    "lat": 52.01735773,
    "lng": -1.30220711
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Adderbury_Lake_%28the_northern_end%29_%28geograph_2935627%29.jpg/512px-Adderbury_Lake_%28the_northern_end%29_%28geograph_2935627%29.jpg",
      "title": "Dave Favis-Mortlock / Adderbury Lake (the northern end)",
      "caption": "Adderbury Lake (the northern end). The site consists of two interconnected lakes fed by local streams and springs, which step gently down a clay-lined valley and eventually lead to the Sor Brook. In the nineteenth century, the lakes were part of the ornamental garden of Adderbury House. After a long period of neglect, they were restored in the 1980s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Adderbury_Lake_%28the_southern_end%29_%28geograph_2935624%29.jpg/512px-Adderbury_Lake_%28the_southern_end%29_%28geograph_2935624%29.jpg",
      "title": "Dave Favis-Mortlock / Adderbury Lake (the southern end)",
      "caption": "Adderbury Lake (the southern end)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/The_waterfall_that_links_the_Adderbury_Lakes_%28geograph_2935625%29.jpg/256px-The_waterfall_that_links_the_Adderbury_Lakes_%28geograph_2935625%29.jpg?20200403213638",
      "title": "Dave Favis-Mortlock / The waterfall that links the Adderbury Lakes",
      "caption": "The waterfall that links the Adderbury Lakes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Summer_in_Adderbury_village_centre_-_geograph.org.uk_-_1460866.jpg?20110302094145",
      "title": "Basher Eyre / Summer in Adderbury village centre",
      "caption": "Summer in Adderbury village centre. East and West Adderbury are divided by the south- and then east-flowing Sor Brook, a tributary of the Cherwell River. Sor Brook rises at Ratley and Upton in Warwickshire and joins the Cherwell between Adderbury and Aynho, Northamptonshire. The Cherwell River forms the eastern boundary of the parish. The Oxford Canal, located beyond the Cherwell, characterises the far eastern part of the parish."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Spring_comes_to_Adderbury_-_geograph.org.uk_-_5607818.jpg?20231025035144",
      "title": "Spring comes to Adderbury by Chris Brown, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Spring comes to Adderbury. Church in the background. The Church of England parish church of Saint Mary the Virgin is in East Adderbury. It is a Grade I listed building, is one of the largest parish churches in Oxfordshire and architecturally is one of the most important. It is nicknamed the Cathedral of the Feldon. Near St Mary's Parish Church, there is a tithe barn originally built for New College, Oxford. Jennifer Sherwood, in the 1970s, dated the barn mainly to the 14th century. However, English Heritage suggests the earliest parts of the building date back to 1422. The barn features ashlar marlstone walls and a roof made of Stonesfield slate. It was reduced in length and partly rebuilt in the 17th century. Around 1877, it underwent further alterations by Lawrence Palk, 1st Baron Haldon. The barn shares architectural similarities with tithe barns at Swalcliffe and Upper Heyford, both also constructed for New College in the early 15th century. Despite its post-Medieval modifications, it is classified as a Grade II listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Adderbury-The_Bell_Inn_-_geograph.org.uk_-_5704861.jpg/512px-Adderbury-The_Bell_Inn_-_geograph.org.uk_-_5704861.jpg?20231110111431",
      "title": "Adderbury-The Bell Inn by Ian Rob, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Bell Inn in the village. Adderbury is renowned for its honey-coloured limestone cottages and houses, particularly in the older parts of the village. East Adderbury is home to a 16th-century manor house distinguished by its diamond-patterned brick chimney-stacks. Another notable building is The Grange, constructed in 1684 by John Bloxham of Banbury for Sir Thomas Cobb, the first Baronet of Banbury."
    }
  ],
  "distance_km": 1.0,
  "description": "Enjoy a short walk around this pretty nature reserve in the Oxfordshire village of Adderbury. There's a nice footpath around the lakes with lots of interesting flora and fauna to look out for on the way. Keep your eyes peeled for mallard ducks, moorhens, kingfishers, goldcrests, long tailed tits and nuthatch. The reserve is located just to the east of the village centre of Adderbury. Here you can extend your walking on the Adderbury Circular Walk. The walk makes use of various public footpaths surrounding the village with nice views of the Sor Brook and the surrounding countryside",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into the village and you could enjoy some post walk refreshments at The Bell Inn. The inn includes a cosy interior with a welcoming fire for the winter months. Outside there is a nice enclosed patio beer garden overlooking the church. You can find them on the High Street at postcode OX17 3LS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are allowed on the site but must be kept on short leads. The pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area just head east and you will soon come to the Oxford Canal Walk. There's more easy waterside trails to along the towpath here. The circular Kings Sutton Walk starts from the nearby settlement to the east. It visits the village, the lakes and the Oxford canal. Just to the south east there's neighbouring Aynho where you can explore the 17th century Aynho Park Estate. There's also a fine canalside pub to visit in this area. For more walking ideas in the area see the Oxfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/uzWhgVsIy_c?si=wzN9s622BDEaFPDP",
  "postcode": "OX17 3FD",
  "district": "Cherwell",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Long Wall, East Adderbury, Adderbury, Cherwell, Oxfordshire, England, OX17 3FD, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "nature",
    "views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}