{
  "created_at": "2025-01-06T00:14:56.211426+00:00",
  "objectID": "4853248e6d9337542f46e9169c04ce50",
  "ref": "wood-of-cree-walking-route",
  "title": "Wood Of Cree Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Car_Park_at_Cordorcan_Bridge_-_geograph.org.uk_-_3913809.jpg/512px-Car_Park_at_Cordorcan_Bridge_-_geograph.org.uk_-_3913809.jpg",
  "nearby": [
    {
      "description": "Newton Stewart to Gatehouse of Fleet",
      "objectID": "86851acb2b2690c620d4cb93b14a07d8",
      "ref": "newton-stewart-to-gatehouse-of-fleet-cycle-route"
    },
    {
      "description": "Galloway Forest Park",
      "objectID": "b8b62cdd25d65f260e350d9c1ab6d069",
      "ref": "galloway-forest-park-walking-and-cycle-route"
    },
    {
      "description": "Newton Stewart Riverside Walk",
      "objectID": "658c26f384710a5733f878300fc2febe",
      "ref": "newton-stewart-riverside-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4853248e6d9337542f46e9169c04ce50.gpx",
  "_geoloc": {
    "lat": 55.00586,
    "lng": -4.53258
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Car_Park_at_Cordorcan_Bridge_-_geograph.org.uk_-_3913809.jpg/512px-Car_Park_at_Cordorcan_Bridge_-_geograph.org.uk_-_3913809.jpg",
      "title": "Car Park at Cordorcan Bridge by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Car Park at Cordorcan Bridge. The Royal Society for the Protection of Birds (RSPB) made a significant conservation effort in 2006 by acquiring the neighboring Barclye Farm, encompassing approximately 996 acres of land. Their purpose was to expand the Wood of Cree nature reserve by an additional 670 acres, effectively extending the woodlands and preserving a more extensive area of deciduous forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Waterfall_in_the_Wood_of_Cree_-_geograph.org.uk_-_519231.jpg",
      "title": "Mark McKie / Waterfall in the Wood of Cree",
      "caption": "Waterfall in the Wood of Cree. The expansion project will offer the public the opportunity to explore a continuous stretch of approximately 18 kilometers within this lush deciduous forest. It's a remarkable endeavor in biodiversity conservation and offers an even more extensive and uninterrupted natural environment for visitors to enjoy and appreciate. This effort not only safeguards the woodland's ecology but also enhances the experience for those who wish to immerse themselves in the beauty of this natural habitat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/The_Otter_Pool_on_the_River_Cree%2C_Galloway_-_geograph.org.uk_-_1588613.jpg",
      "title": "Anthony O'Neil / The Otter Pool on the River Cree, Galloway",
      "caption": "The Otter Pool on the River Cree, Galloway. This protected area of river supports a population of otters which can be observed from a viewing platform reached via a short footpath running north from the carparking area for the Wood of Cree. Although very peaceful here, it is only fifteen minutes by car from the centre of Newton Stewart."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Mossy_trees_in_the_Wood_of_Cree_-_geograph.org.uk_-_3741369.jpg/512px-Mossy_trees_in_the_Wood_of_Cree_-_geograph.org.uk_-_3741369.jpg",
      "title": "Mossy trees in the Wood of Cree by Anthony O'Neil, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mossy trees in the Wood of Cree"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Ruined_cottage_at_Cordorcan%2C_Galloway_Forest_-_geograph.org.uk_-_1589100.jpg",
      "title": "Anthony O'Neil / Ruined cottage at Cordorcan, Galloway Forest",
      "caption": "Ruined cottage at Cordorcan, Galloway Forest. This, and several other derelict cottages, are just off the track leading north-eastwards from the end of the Wood of Cree \"Scrubland Walk\". Clearly, this was once a small, remote community."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Waterfall_in_the_Wood_of_Cree%2C_Galloway_Forest_-_geograph.org.uk_-_1589063.jpg",
      "title": "Anthony O'Neil / Waterfall in the Wood of Cree, Galloway Forest",
      "caption": "Waterfall. Here, the Cordorcan Burn, which forms the south-eastern boundary of the Wood, is in spate after heavy rain in the Galloway Hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/The_Otter_Platform%2C_Wood_of_Cree_-_geograph.org.uk_-_3913778.jpg/512px-The_Otter_Platform%2C_Wood_of_Cree_-_geograph.org.uk_-_3913778.jpg",
      "title": "The Otter Platform, Wood of Cree by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Otter Platform, Wood of Cree"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Path_from_the_Otter_Pool%2C_Wood_of_Cree_-_geograph.org.uk_-_3913794.jpg/512px-Path_from_the_Otter_Pool%2C_Wood_of_Cree_-_geograph.org.uk_-_3913794.jpg",
      "title": "Path from the Otter Pool, Wood of Cree by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path from the Otter Pool, Wood of Cree"
    }
  ],
  "distance_km": 1.7,
  "description": "This circular walk visits the Wood Of Cree nature reserve near Newton Stewart in Dumfries and Galloway. The expansive woods are Southern Scotland's largest ancient woodland and include a wide range of bird species and carpets of bluebells in the spring. There's also picturesque streams and waterfalls to see. The River Cree runs through the area and includes an otter platform where you can look out for these river dwelling animals. Other wildlife includes Red Squirrels and birds including Redstarts, Leisler’s Bats, and Garden Warblers. The walk starts from the car park at Cordorcan Bridge on the western side of the woods.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south into Newton Stewart and you could visit The Cree Inn. Address is Creebridge, Newton Stewart DG8 6NP."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are a fine place for a dog walk. During the ground-nesting bird breeding season (1 April to 15 August) and in areas with livestock, you are asked to keep your dog on a short lead and clean up after them. The Cree Inn mentioned above is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "More information about the wildlife and habitats: As the largest ancient woodland in southern Scotland, the wood offers an abundance of natural beauty and wildlife experiences throughout the year. In the spring, the forest floor comes to life with a carpet of bluebells, creating a picturesque scene accompanied by the melodious sounds of Pied Flycatchers and warblers. It's also an ideal location to catch sight of Willow Tits, as well as Barn and Tawny Owls. During the summer months, the Wood of Cree becomes a seasonal home to a variety of migratory birds, including Redstarts, Pied Flycatchers, and Wood Warblers, which travel from Africa to make the reserve their summer residence. The woodland is a sanctuary for bats, with up to eight different bat species inhabiting the area, including the elusive Leisler's Bat. The diverse landscape, which includes wood pasture, open moorland, wet floodplain woodland, fen and grassland, and scrub, provides a range of habitats for wildlife. This diversity leads to encounters with unique species such as Black Grouse, Willow Tit, Whinchat, Grasshopper Warbler, and the distinctive call of the Cuckoo. Additionally, the rivers in the area offer the possibility of spotting an otter, adding to the rich tapestry of wildlife that calls the Wood of Cree home. Whether you're a bird enthusiast, a bat admirer, or simply a nature lover, this ancient woodland has something special to offer all those who explore its natural wonders."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rjFVDFcioq8?si=uQt_N2uxpFNXhoPy",
  "county": "Dumfries and Galloway",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dumfries and Galloway, Alba / Scotland, DG8 6SP, United Kingdom",
  "postcode": "DG8 6SP",
  "district": null,
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "waterfalls",
    "nature reserve"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}