{
  "objectID": "48f6a9b17b84ff1044fbaa992ad230d9",
  "created_at": "2024-12-18T11:24:36.862406+00:00",
  "ref": "leith-hill-walking-route",
  "title": "Leith Hill Tower Circular Woodland Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/View_from_Leith_Hill_Tower_-_geograph.org.uk_-_658341.jpg",
  "nearby": [
    {
      "description": "Holmbury Hill",
      "objectID": "8bade7bd53e95f611791d7fda5c907a6",
      "ref": "holmbury-hill-walking-route"
    },
    {
      "description": "Devil's Punch Bowl",
      "objectID": "877f31f2fb0e7126f1419866653789ab",
      "ref": "devils-punch-bowl-walking-and-cycle-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Abinger Common",
      "objectID": "cbbfe861d4988621af770748e8083ed5",
      "ref": "abinger-common-walking-route"
    },
    {
      "description": "Ockley to Leith Hill",
      "objectID": "554b3ff03e58e4cf3241ac6ed873efb2",
      "ref": "ockley-to-leith-hill-walking-route"
    },
    {
      "description": "Betchworth",
      "objectID": "49a8dfa05747c9165f36c9d292b339a5",
      "ref": "betchworth-walking-route"
    },
    {
      "description": "Friday Street",
      "objectID": "b3ff91772988e6b175ba57f909058a6c",
      "ref": "friday-street-walking-route"
    },
    {
      "description": "Brockham",
      "objectID": "263d3edaedbd061bfe1bad4fe84ace85",
      "ref": "brockham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/48f6a9b17b84ff1044fbaa992ad230d9.gpx",
  "_geoloc": {
    "lat": 51.1774709906,
    "lng": -0.3844295438
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/View_from_Leith_Hill_Tower_-_geograph.org.uk_-_658341.jpg",
      "title": "Ian Capper [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View from Leith Hill Tower. At the summit of Leith Hill stands an 18th-century Gothic tower, originally known as \"Prospect House.\" Built by Richard Hull of Leith Hill Place between 1764 and 1765, the tower was intended to elevate the hill's height to over 1,000 feet (305 metres) and offer expansive views. The tower stands 19.5 metres (64 feet) tall and was designed with two furnished rooms. Hull provided visitors with prospect glasses for viewing distant landmarks such as London and the English Channel, about 25 miles (40 km) away. After Hull's death in 1772, he was buried at the base of the tower. The building fell into disrepair, and over time, it was filled with rubble and concrete, and its access was blocked. In 1864, William John Evelyn of Wotton House undertook efforts to restore the tower. Due to the extensive concrete filling, he added a turreted side tower to provide access to the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Leith_Hill_Tower_-_geograph.org.uk_-_842097.jpg",
      "title": "Keith Evans [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Leith Hill Tower. Today, the restored Leith Hill Tower features a viewpoint indicator to commemorate Walker Miles, an early advocate of the Rambler's movement. On clear days, the tower offers views across up to 13 counties. The National Trust completed the restoration in 1984, which included removing the rubble, adding safety features, and converting the lower part into a servery. The tower is open to the public daily, with varied opening times depending on the day of the week, and features a display on its history."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Surrey_south_downs.jpg",
      "title": "Graham Pritchard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View from Leith Hill Tower, looking SE across the Weald of Sussex towards the South Downs. The area is part of the Leith Hill Place estate, once home to the famous composer Ralph Vaughan Williams."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/WalkerMilesPlaque3_02-05-2013_15-09-35.jpg/512px-WalkerMilesPlaque3_02-05-2013_15-09-35.jpg",
      "title": "Alan666wsg [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Direction indicator tablets at the top of Leith hill tower. Placed in commemoration of 'Walker Miles'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Surrey_north_downs.jpg",
      "title": "Graham Pritchard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View from Leith Hill Tower looking north across the North Downs towards SW London."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Azeleas_Leith_Hill.jpg/512px-Azeleas_Leith_Hill.jpg",
      "title": "PgH-R [Public domain], via Wikimedia Commons",
      "caption": "Mixed Azaleas on Leith Hill in May. The walk up Leith Hill towards the tower passes through Mosses Wood, a 69-acre forest known for its impressive collection of trees. Many of the trees in the wood are pines, some of which were planted in the mid-1800s by Alexander Hargreaves Brown, a local resident with an interest in forestry. The wood provides a pleasant and shaded path for hikers, making the ascent to the tower more enjoyable. As you walk, you'll notice a mix of tree species and the quiet beauty of this well-preserved woodland area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Bench_View%2C_Leith_Hill%2C_Surrey_-_geograph.org.uk_-_1403821.jpg",
      "title": "Peter Trimming / Bench View, Leith Hill, Surrey, via Wikimedia Commons",
      "caption": "Bench View, Leith Hill, Surrey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Greensand_Way_at_Leith_Hill_-_geograph.org.uk_-_979285.jpg",
      "title": "Shazz / Greensand Way at Leith Hill, via Wikimedia Commons",
      "caption": "Greensand Way at Leith Hill"
    }
  ],
  "distance_km": 6.0,
  "description": "Climb to the highest point in the South East on this challenging circular walk in the Surrey Hills AONB. The route runs for a distance of about 3.5 miles with some moderate climbs on the way. Leith Hill is located near Dorking and is also the highest point on the Greensand Ridge, reaching a height of 294 metres (965 ft) above sea level. On the summit of Leith Hill is an 18th century Gothic tower, with panoramic views northwards to London and south to the English Channel. The area is run by the National Trust so the tower has been restored and contains a viewing point with a telescope and refreshments at the Tower servery. There are self guided trails through woodland, farmland and parkland. Also be sure to visit the Rhododendron Wood, particularly in the spring months when the colours are simply stunning. The walk begins at the car park on the western side of the hill and takes you to the high point on the Greensand Way long distance footpath. You then head towards Coldharbour and Whiteberry Hill, crossing Wotton Common, before returning to the car park. If you'd like to continue your walking in the area then you could head to the nearby village of Holmbury St Mary and climb Holmbury Hill for great views over the Weald of Sussex. The expansive Winterfold Forest with its miles of walking and mountain bike trails can also be found in this area. You could also try our circular walk around Abinger Common and Wotton Common. There's miles of good woodland trails, ponds and streams to enjoy here.",
  "video_url": "https://www.youtube.com/embed/gld5EkAdfTY?si=IOtt-egXjo--WoJF",
  "postcode": "RH5 6LU",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}