{
  "created_at": "2025-01-06T08:43:54.944305+00:00",
  "objectID": "492cd4408250e9940bcb188da210c06e",
  "ref": "norber-erratics-walking-route",
  "title": "Norber Erratics Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Norber_erratics_-_geograph.org.uk_-_1503375.jpg",
  "nearby": [
    {
      "description": "Ingleborough Mountain",
      "objectID": "3a3bc42c97847e6fc1fe51d994dbc143",
      "ref": "ingleborough-mountain-walking-route"
    },
    {
      "description": "Clapham Yorkshire",
      "objectID": "be59991f7ef1bc136f0a81fbc0d7eeaa",
      "ref": "clapham-yorkshire-walking-route"
    },
    {
      "description": "Austwick",
      "objectID": "71211c1c6d3131c940dd9f8c85578495",
      "ref": "austwick-walking-route"
    },
    {
      "description": "Giggleswick",
      "objectID": "966e1991f6aaa7e4aa3c66074c4d192c",
      "ref": "giggleswick-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/492cd4408250e9940bcb188da210c06e.gpx",
  "_geoloc": {
    "lat": 54.1125041413,
    "lng": -2.3559497626
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Norber_erratics_-_geograph.org.uk_-_1503375.jpg",
      "title": "Gordon Hatton / Norber erratics, via Wikimedia Commons",
      "caption": "Erratic Ordovician greywacke boulders sit on Carboniferous limestone plinths on the hillside at Norber. This group of interest due to the sapling growing from a tiny patch of soil trapped in a groove on one of the boulders"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Norber_erratic_-_geograph.org.uk_-_1249876.jpg",
      "title": "Ian Taylor / Norber erratic, via Wikimedia Commons",
      "caption": "The slate erratics tend to be smaller higher up the slope. In this instance, the underlying limestone is more obvious."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/The_Norber_erratics_-_geograph.org.uk_-_6893.jpg",
      "title": "Val Vannet / The Norber erratics, via Wikimedia Commons",
      "caption": "The 'erratics' are boulders dropped by passing glaciers. They lie on a bedrock of limestone which has weathered down through the action of rainwater dissolving the rock - except below the boulders where the rock is protected."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Glacial_erratic%2C_Norber_-_geograph.org.uk_-_1503289.jpg",
      "title": "Gordon Hatton / Glacial erratic, Norber, via Wikimedia Commons",
      "caption": "Glacial erratic, Norber One of the famous Norber erratics, which are scattered across the fellside in the southern part of this square. The valley of Crummack Dale [part of which can be seen in the background] has exposures of Ordovician flags and grits, some of which were plucked from the valley floor during the last glaciation and dumped a couple of miles away on top of Carboniferous limestone on this fellside. One wonders just how many geography students have been brought here to see the erratics over the decades."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Austwick_Bridge_-_geograph.org.uk_-_409268.jpg",
      "title": "david speers / Austwick Bridge, via Wikimedia Commons",
      "caption": "Austwick Bridge at Austwick village,crossing the beck beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/A_seat_with_a_view_in_Austwick_-_geograph.org.uk_-_1726392.jpg",
      "title": "John S Turner / A seat with a view in Austwick, via Wikimedia Commons",
      "caption": "A seat with a view in Austwick. This seat is on the corner of Townhead Lane and the road from Austwick to Helwith Bridge. The expansive view in the opposite direction is excellent, especially on a sunny day"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/View_to_Oxenber_Wood_-_geograph.org.uk_-_1726254.jpg",
      "title": "John S Turner / View to Oxenber Wood, via Wikimedia Commons",
      "caption": "View to Oxenber Wood. The view from the end of Townhead Lane across the fields towards the prominent Oxenber Wood. Oxenber Wood is an SSSI and has areas of limestone pavement as well as trees. Parts of the wood have Common Rights for grazing stock, and Austwick Parishioners may collect sticks and stones"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/View_towards_Moughton_Nab_-_geograph.org.uk_-_1726380.jpg",
      "title": "John S Turner / View towards Moughton Nab, via Wikimedia Commons",
      "caption": "Austwick. Looking along the Austwick Beck valley in the direction of Moughton Nab."
    }
  ],
  "distance_km": 3.0,
  "description": "This walk climbs to this geologically significant set of glacial erratic boulders in the Yorkshire Dales. The Norber erratics can be reached from the nearby village of Austwick. It's a short but quite challenging climb from the village to the rocks which are situated on the southern slopes of Ingleborough Mountain. The fascinating boulders were probably deposited by melting ice sheets at the end of the last ice age, around 12,000 years ago. The walk exposes you to some fine limestone scenery with wonderful views to be enjoyed from the high points. The boulders are dramtically placed with the far reaching dales scenery making a striking backdrop for any photographer. This walk starts in Austwick and takes you north to the boulders on good footpaths. You could also start from the nearby village of Clapham. The walk can be extended by heading north to Thwaite Scars, Crummack Dale and Moughton Scars. Just to the north of Moughton Scars you can pick up the trail to Ingleborough Mountain at Sulber Nick. After your exercise you can refresh yourself in the local pub in Austwick. To further extend your walking in the area you can head west to Clapham where you can enjoy a stroll along Clapham Lake and Clapham Beck to the wonderful Ingleborough Show Cave. See our Clapham Walk for full details.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the west of Austwick is the village of Clapham. Here you could head to the interesting Old Manor House. The historic mullioned farmhouse was built in 1640 and has since been renovated to house the Clapham Bunkhouse (Group Accommodation) and The Reading Room Cafe/Bar licensed to sell hot food, alcohol, arts, crafts and gifts. It's got a great menu and sells some fine real ales. You can find it on Church Avenue at postcode LA2 8EQ.The New Inn is another good option, set in an 18th-century coaching inn overlooking the Clapham Beck (Postcode:LA2 8HH). There's also the Game Cock in Austwick which is a traditional Dales pub on the village green, serving good British food with a French/Mediterranean twist (postcode: LA2 8BB)."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HYumbgIqWoA",
  "postcode": "LA2 8BN",
  "district": "Austwick",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Austwick, North Yorkshire, York and North Yorkshire, England, LA2 8BN, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "limestone"
  ],
  "points_of_interest": [
    "viewpoints",
    "natural scenery"
  ],
  "facilities": [
    "pub",
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}