{
  "created_at": "2025-01-05T23:53:50.806232+00:00",
  "objectID": "493137a1f89d53ded8551b18e6bb3af1",
  "ref": "hornsea-mere-walking-route",
  "title": "Hornsea Mere Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/52/Hornsea_Mere_from_the_Footpath_to_Hornsea_-_geograph.org.uk_-_1335105.jpg",
  "nearby": [
    {
      "description": "Spurn Point",
      "objectID": "db5a31ae1b9ae138d73bd401a31de1a7",
      "ref": "spurn-point-walking-route"
    },
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "Hull to Hornsea",
      "objectID": "b485e11ac65f19c6d8e366659f3e0db3",
      "ref": "hull-to-hornsea-cycle-route"
    },
    {
      "description": "Tophill Low",
      "objectID": "76fd0f54fc0a4dd891276e726f6d066f",
      "ref": "tophill-low-walking-route"
    },
    {
      "description": "Brandesburton",
      "objectID": "5fbff958c6c8c24edef4fec1a118fa98",
      "ref": "brandesburton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/493137a1f89d53ded8551b18e6bb3af1.gpx",
  "_geoloc": {
    "lat": 53.9017518322,
    "lng": -0.1778829305
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Hornsea_Mere_from_the_Footpath_to_Hornsea_-_geograph.org.uk_-_1335105.jpg",
      "title": "Andy Beecroft [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The mere from the Footpath to the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Hornsea_mere_-_geograph.org.uk_-_541103.jpg",
      "title": "John Poyser [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The scenic lake in late summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Hornsea_Mere_-_geograph.org.uk_-_1348350.jpg",
      "title": "JThomas / Hornsea Mere",
      "caption": "Canadian geese and swans with the church in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Hornsea_Mere_-_geograph.org.uk_-_2613003.jpg/512px-Hornsea_Mere_-_geograph.org.uk_-_2613003.jpg",
      "title": "Hornsea Mere by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rowboats on the lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Promenade%2C_Hornsea_-_geograph.org.uk_-_2005153.jpg",
      "title": "Promenade, Hornsea by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Promenade, Hornsea. Head east from the mere and you could enjoy a pleasant stroll along the prom and the beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Hornsea_Pottery_-_geograph.org.uk_-_515979.jpg",
      "title": "Paul Glazzard / Hornsea Pottery",
      "caption": "Bungee-assisted trampolining at Hornsea Freeport Shopping Village. In 1953 Colin and Desmond Rawson purchased the brick and tile works at Edenfield House off Marlborough Avenue, Hornsea, and moved their four year old pottery business here from Market Place the following year. In 1955 they established the Hornsea Pottery Co. Ltd., employing nearly 200 people by the mid 1960s and 300 by the early '70s. As well as tours of the pottery, visitor attractions included a wildfowl lake, birds of prey, pony rides, a collection of cars and a small zoo. Local opposition to more expansion plans caused the firm to open another factory in Lancaster but the company went into receivership in 1984 and then changed hands several times before closing in 2000. The Freeport Shopping Village was opened on the Hornsea site in 1994."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Kirkholme_Nab%2C_Hornsea_Mere_-_geograph.org.uk_-_515920.jpg",
      "title": "Paul Glazzard / Kirkholme Nab, Hornsea Mere",
      "caption": "Looking northeast towards the café and rowing boat hire on the Kirkholme Nab peninsula at the mere. Owned by Wassand Estate Trust and leased to the Hornsea Mere Marine Company, the mere is the largest natural lake in Yorkshire and has been used for recreational purposes such as fishing and boating since the 1880s. By 1887 the Hornsea Mere & Hotel Co. had obtained a lease for fishing and boating and by 1892 more than twenty yachts were kept here. Tennis courts were built near the boathouse by 1908 and modern day facilities include a café, rowing boat hire and a 'crazy golf' course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Lund%2C_Hornsea_-_geograph.org.uk_-_612240.jpg",
      "title": "Paul Glazzard / Lund, Hornsea",
      "caption": "Lund. Pasture south of the lake on the footpath between Wassand Park and Southorpe, looking north-northeast from the parish boundary between Seaton and Hornsea at the southeast corner of Decoy Plantation."
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy a walk along this lovely freshwater lake in the seaside town of Hornsea. At 2 miles long and 0.75 miles wide it is the largest freshwater lake in Yorkshire. You can pick up a public footpath from Hull Road at the south eastern side of the water. It will take you through fields on the southern side of the lake with nice views across the water to the surrounding woodland and countryside. The path continues around the western side of the lake past Springfield Wood and Low Wood. At the eastern end of the lake there's a nice cafe overlooking the area. It's a great place for birdwatching with gadwalls, goldeneyes and tufted ducks to look out for on the water. Also keep your eyes peeled for reed warblers in the reedbeds. You can extend your walking in the area by picking up the Trans Pennine Trail and the Hornsea Rail Trail. It's an excellent cycling and walking route along a dismantled railway that will take you all the way to Hull. If you wish to continue birdwatching then look no further than the fantastic Spurn Point. The wonderful coastal nature reserve is located just south of Withernsea and consists of beaches, sand dunes and thousands of coastal birds.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route forms part of the Hornsea Triangle Walk, a circular hike that you can use to extend your walk. It heads south to Goxhill before following the Hornsea Road on the northern side of the mere. A few miles to the west you can continue your waterside walking around the Tophill Low Nature Reserve. The reserve includes two pretty reservoirs and easy footpaths along the River Hull. It's another great place for birdwatching with several hides dotted around the site. Near here is also the worthy vlllage of Brandesburton with its medieval church and historic 16th century pub A few miles to the north there's the worthy village of Skipsea where you can explore the photogenic ruins of the 11th century Skipsea Castle. Just to the south there's Burton Constable where you'll find an historic old hall surrounded by Capability Brown landscaped parkland and gardens."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cAOhSL6u550",
  "postcode": "HU18 1RW",
  "district": "Hornsea",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hull Road, Hornsea, East Riding of Yorkshire, England, HU18 1RW, United Kingdom",
  "state": "England"
}