{
  "created_at": "2025-01-06T00:15:33.228225+00:00",
  "objectID": "493c97517db66a4daa76c71ec7387fb0",
  "ref": "redruth-walking-route",
  "title": "Redruth Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Fore_Street%2C_Redruth_-_geograph.org.uk_-_1360436.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/493c97517db66a4daa76c71ec7387fb0.gpx",
  "_geoloc": {
    "lat": 50.2323755971,
    "lng": -5.2268032651
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Fore_Street%2C_Redruth_-_geograph.org.uk_-_1360436.jpg",
      "title": "Helen Wilkinson / Fore Street, Redruth",
      "caption": "Fore Street, an outdoor market on Murdock Day 2009."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Cornish_Miner_Statue%2C_Redruth_-_geograph.org.uk_-_1903992.jpg/512px-Cornish_Miner_Statue%2C_Redruth_-_geograph.org.uk_-_1903992.jpg",
      "title": "Tom Jolliffe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cornish Miner Statue, Redruth. The Redruth Public Realm Working Party's Mining Art Group commissioned this bronze sculpture of a Cornish miner by David Annand. It stands that two metres tall and was erected in April 2008. It is a wonderfully dramatic artefact, expressing energy, power and in one sense immense optimism (in its stance and positioning). From another point of view, one might associate it with a kind of crucifixion, which might symbolise the fate of the ordinary miners not only in Cornwall, but everywhere. However one interprets it, it is a dominant feature in the centre of the Redruth and demands a response."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Mini_Tin_Mine_marks_road_in_to_Redruth_-_geograph.org.uk_-_1441433.jpg",
      "title": "Amanda King / Mini Tin Mine marks road in to Redruth",
      "caption": "Mini Tin Mine marks road in to Redruth. This is a small replica of a tin mine just outside the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Basset_De_Dunstanville_monument_over_Carn_Brea_-_geograph.org.uk_-_1048513.jpg/256px-Basset_De_Dunstanville_monument_over_Carn_Brea_-_geograph.org.uk_-_1048513.jpg",
      "title": "stuart crewes / Basset De Dunstanville monument over Carn Brea",
      "caption": "Basset De Dunstanville monument over Carn Brea. View taking in the monument and castle as well as the general granite landscape of the hilltop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Redruth_Town_Centre_from_the_West_-_geograph.org.uk_-_97840.jpg",
      "title": "Tony Atkin / Redruth Town Centre from the West",
      "caption": "Redruth Town Centre from the West"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/The_View_from_Carn_Brea_-_geograph.org.uk_-_354870.jpg",
      "title": "Tony Atkin / The View from Carn Brea",
      "caption": "The View from Carn Brea. Looking north over the landscape between Camborne and Redruth. The darker blue just beyond the land horizon is the sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Daubuz%27_Engine_House_at_South_Wheal_Francis_-_geograph.org.uk_-_534684.jpg/256px-Daubuz%27_Engine_House_at_South_Wheal_Francis_-_geograph.org.uk_-_534684.jpg",
      "title": "Tony Atkin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Daubuz' Engine House at South Wheal Francis. This engine house used to contain a 30 inch winding engine which was also capable of performing pumping duties. It operated between 1880 and 1918."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Entrance_to_the_King_Edward_Mine_Museum_with_Chickens_-_geograph.org.uk_-_529256.jpg",
      "title": "Tony Atkin / Entrance to the King Edward Mine Museum with Chickens",
      "caption": "Entrance to the King Edward Mine Museum with Chickens. Getting the tin ore to the surface was only the start of the process of producing the \"black tin\", an ore concentrate good enough to be smelted to produce ingots of \"white tin\". The problem was that the ore (cassiterite) does not occur in large pure lumps but is mixed in with other minerals in the vein. To remove this waste material involves a complicated processes of crushing and separation with the aid of water by several different types of machinery. This museum preserves the buildings and machinery which used to perform these operations. It offers a fascinating insight into an industry now vanished from Cornwall and into the means of industrial production in an age before electricity. The museum is located at the western end of the route, south of Camborne."
    }
  ],
  "distance_km": 14.0,
  "description": "This Cornish town has some nice walking trails exploring the settlement's rich mining history. There's also some local hill climbs where you can enjoy views towards the nearby coast. This circular walk from the town climbs to the hill fort at Carn Brea before picking up the Great Flat Lode Trail and exploring the mining heritage of the area. The route starts at Redruth train station and follows roads west to Carn Brea village. From here you can climb to the hill fort at Carn Brea and enjoy wonderful views over the surrounding area to the coast. There's also an historic castle with a fine restaraunt. The route then heads west towards Camborne, passing the Tramways centre before turning south to Carn Arthen and Carn Entral. The trail takes you through Higher Condurrow to the disused Greenville Mines. Here you turn north east to Newton Moor, Treskillard and Carnkie before turning north to return to the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "For some really delicious fish and chips head to Greg & Lou's. You can find them ay 9 Higher Fore Street with a postcode of TR15 2AJ for your sat navs. For a great pub atmosphere head to the Miners Arms. They have an outdoor area and a good selection of drinks. You can find them at 20 Plain-An-Gwarry, TR15 1JB."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the south eastern outskirts of the town you'll find the splendid Carn Marth. The hill is a fine place to explore with another excellent viewpoint, a pretty quarry lake and an outdoor ampitheatre which runs performances during summer.Near here there's another amphitheatre to explore at Gwennap Pit. The site has some historical significance having been used by Methodist preacher John Wesley preached several times between 1762 and 1789. Just a few miles to the east there's some great walking and mountain bike trails to be found at the Poldice Valley. The area has a wonderful moon like appearance with the historic Poldice Mine buildings adding to the atmospheric landscape. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nYzhpDVO-mU",
  "district": "Redruth",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bond Street, Redruth, Cornwall, England, TR15 2QA, United Kingdom",
  "postcode": "TR15 2QA",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "restaurant"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}