{
  "created_at": "2025-01-06T03:49:32.849606+00:00",
  "objectID": "4a398d104e67a104c8bf1d14d54a4a47",
  "ref": "around-corby-walking-route",
  "title": "Walk Around Corby Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/East_Carlton_Countryside_Park_%28geograph_1979443%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4a398d104e67a104c8bf1d14d54a4a47.gpx",
  "_geoloc": {
    "lat": 52.4959985132,
    "lng": -0.7752675529
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/East_Carlton_Countryside_Park_%28geograph_1979443%29.jpg",
      "title": "Jim Smillie / East Carlton Countryside Park",
      "caption": "East Carlton Countryside Park - route start"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Rockingham_Castle_Wall_Geograph-4481904-by-Richard-Humphrey.jpg/512px-Rockingham_Castle_Wall_Geograph-4481904-by-Richard-Humphrey.jpg",
      "title": "Richard Humphrey / Looking over the wall - Rockingham Castle",
      "caption": "Rockingham Castle Wall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Kirby_Hall_-_geograph.org.uk_-_1429610.jpg",
      "title": "Keith Evans / Kirby Hall",
      "caption": "Kirby Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Rockingham_Castle_entrance.jpg",
      "title": "Brian Coleman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rockingham Castle entrance. Rockingham Castle formerly a royal castle and hunting lodge, now the family home of the Saunders Watson family, in Rockingham Forest on the northern edge of the English county of Northamptonshire a mile to the north of Corby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Corby_Boating_Lake_-_geograph.org.uk_-_72866.jpg",
      "title": "Nigel Cox / Corby Boating Lake",
      "caption": "Corby Boating Lake. Viewed looking north-eastwards from the southern end, in 2002 this was certainly a popular lake for anglers and model boat enthusiasts, but despite its name I don't think that the general public were allowed to take to the water...! This pleasant park is a nice place for a stroll in the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Corby%2C_UK_-_panoramio.jpg/256px-Corby%2C_UK_-_panoramio.jpg",
      "title": "Dmitrij M, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "West Glebe Park - located just to the north east of the town centre."
    }
  ],
  "distance_km": 50.0,
  "description": "This is a delightful 31 mile circular walk which visits a number of pretty villages and parks around the town of Corby in Northamptonshire. You start off at East Carlton Park on the edge of the Welland Valley and follow the path through a series of pretty villages including Wilbarston, Geddington, Great Oakley, Gretton, Rockingham, Stanion and Brigstock. Walk highlights include a visit to the 17th century Elizabethan House at Kirby Hall. The Great Hall and state rooms are impressive as are the surrounding grounds of the estate. Rockingham Castle is another major attraction on route. Built on the instruction of William the Conqueror, the castle's Great Hall and Long Gallery are particularly noteworthy, while the 18 acre gardens are also well worth exploring. Scroll down for a list of walks near Corby.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the north east there's some excellent mountain bike trails and walking routes to be found at Wakerley Woods and Fineshade Woods. Near here you'll also find the noteworthy Harringworth Welland Viaduct. The Grade II listed viaduct is about a kilometre long, and was completed in 1878. It contains 82 arches and is notable as the longest masonry viaduct across a valley in Britain. Just to the east of Fineshade you'll find the pretty village of King's Cliffe where you can pick up the Kings Cliffe Railway Walk. The easy trail runs along a now disused railway line to the east of the village. King's Cliffe is also a pleasant place for a stroll with a Norman church, picturesque 17th century almshouses and nice views of the Willow Brook, a tributary of the River Nene. There's also a fine old 18th century pub for refreshments afterwards. Near here there's also Blatherwycke Lake to explore. There's some lovely waterside trails with lots of birdlife to see on the water at this scenic spot. For more walking ideas in the area see the Northamptonshire Walks page."
    }
  ],
  "postcode": "LE16 8YA",
  "district": "East Carlton",
  "county": "North Northamptonshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "East Carlton Country Park, East Carlton, North Northamptonshire, England, LE16 8YA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "historic"
  ],
  "points_of_interest": [
    "historic houses",
    "gardens",
    "castles"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}