{
  "objectID": "4a86996316d33281651e2101a1b1f84a",
  "created_at": "2024-12-18T11:32:20.693796+00:00",
  "ref": "worthing-walking-route",
  "title": "Worthing Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Storrington_Rise_Car_Park_at_base_of_Cissbury_Ring%2C_Findon_-_geograph.org.uk_-_4476.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/3E804E18C0881782862585C1004AF522/$FILE/Worthing.gpx",
  "_geoloc": {
    "lat": 50.8579804252,
    "lng": -0.3977333144
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Storrington_Rise_Car_Park_at_base_of_Cissbury_Ring%2C_Findon_-_geograph.org.uk_-_4476.jpg",
      "title": "Pam Brophy / Storrington Rise Car Park at base of Cissbury Ring: Findon",
      "caption": "Start of the walk at Storrington Rise Car Park at base of Cissbury Ring: Findon. Situated in the NE corner of the grid square, the walk to the ring starts here and in less than one kilometre one gets to the ring."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Workings_at_Cissbury_Ring_-_geograph.org.uk_-_1326767.jpg",
      "title": "Graham Horn [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Workings at Cissbury Ring. This is the south-western side and lowest part of the ring. The depression seen here is the site of one of the former flint mines. These would have been dug as deep pits through the layers of chalk and poor flint to a good seam of flint about 30 feet below. This would have been worked out horizontally, and hauled to the surface here, within the safety of the ring fortifications. Flints were used as tools and weapons. This was all stone age stuff, 5,000 years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Steyning_Bowl_-_geograph.org.uk_-_20019.jpg",
      "title": "Chris Shaw / Steyning Bowl",
      "caption": "Steyning Bowl. This bowl shape valley is an impressive feature dominating the gridsquare - taken from North to south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Beeding_Bridge_-_geograph.org.uk_-_572551.jpg",
      "title": "Bob Parkes / Beeding Bridge",
      "caption": "Beeding Bridge. The roadbridge, the footbridge over the River Adur."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Bramber_Castle._-_geograph.org.uk_-_175385.jpg",
      "title": "Colin Smith / Bramber Castle.",
      "caption": "Bramber Castle. This is the only major remain of the Norman castle. It received very heavy damage during the English Civil War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Worthing_seafront_-_geograph.org.uk_-_1352751.jpg",
      "title": "Paul Gillett / Worthing seafront",
      "caption": "Worthing seafront"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Worthing_esplanade_-_geograph.org.uk_-_1460747.jpg",
      "title": "Paul Gillett / Worthing esplanade",
      "caption": "Worthing esplanade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Worthing_Seafront-geograph-5417864-by-Stephen-McKay.jpg/512px-Worthing_Seafront-geograph-5417864-by-Stephen-McKay.jpg",
      "title": "Stephen McKay / Worthing Seafront",
      "caption": "Worthing Seafront. The warm weather and uninterrupted blue sky make for a colourful relaxed scene as people amble along here beside Marine Parade with the dodgems on the right."
    }
  ],
  "distance_km": 18.2,
  "description": "This circular walk explores the South Downs to the north of this West Sussex seaside town. On the way you'll pass an Iron Age Hillfort, enjoy riverside paths along the River Adur and pay a visit to Bramber Castle . The route uses sections of the South Downs Way and the Monarch's Way , two waymarked trails which run through the area. The walk starts from the Storrington Rise car park in the Findon Valley area of the town. From here you can pick up footpaths taking you up onto the South Downs. Follow the trail east and you can visit the historic hillfort at Cissbury Ring where there are fine views to enjoy. After exploring the fort you pick up the Monarch's Way and follow it north east to the attractive bowl shaped valley at Steyning Bowl. Near here you can pick up the South Downs Way and head east towards Botolphs where you can pick up a riverside path along the River Adur. Follow the path north and will take you to Upper Beeding and the historic Bramber Castle. The castle ruins date all the way back to the 11th century and the site includes a church which is still in use today. After exploring the castle the route picks up the Monarch's Way again and follows it west towards Steyning Bowl and Canada Bottom. After passing Cissbury Ring again you descend back to the car park.",
  "district": "Worthing",
  "county": "West Sussex",
  "region": "South East",
  "country": "England"
}