{
  "created_at": "2025-01-06T02:05:01.845647+00:00",
  "objectID": "4aa8bf2a4b782e60f3ff19ca34863d9e",
  "ref": "pegsdon-hills-walking-route",
  "title": "Pegsdon Hills Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Trig_Point_-_geograph.org.uk_-_1215299.jpg",
  "nearby": [
    {
      "description": "Hitchin",
      "objectID": "5ca3b508e6a3512b04c71780d3fd92a9",
      "ref": "hitchin-walking-route"
    },
    {
      "description": "Icknield Way Path",
      "objectID": "e96b8caef019982483e720c1ec5927d6",
      "ref": "icknield-way-path-walking-route"
    },
    {
      "description": "Barton Hills",
      "objectID": "cdd3b7316bd936932b90be8af9718105",
      "ref": "barton-hills-walking-route"
    },
    {
      "description": "Sharpenhoe Clappers",
      "objectID": "2418109b2b738e3dde40db414a9c980c",
      "ref": "sharpenhoe-clappers-walking-route"
    },
    {
      "description": "Ickleford",
      "objectID": "b72139a03c4d062f936c155c036eb492",
      "ref": "ickleford-river-and-nature-reserve-circular-walk-walking-route"
    },
    {
      "description": "Pirton",
      "objectID": "581c7c175564c083278564a79ef2bbf1",
      "ref": "pirton-walking-route"
    },
    {
      "description": "Toddington",
      "objectID": "eb6d9126a3bd854061dae891f9996ea7",
      "ref": "toddington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4aa8bf2a4b782e60f3ff19ca34863d9e.gpx",
  "_geoloc": {
    "lat": 51.9572953862,
    "lng": -0.3537832367
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Trig_Point_-_geograph.org.uk_-_1215299.jpg",
      "title": "Dennis simpson / Trig Point",
      "caption": "Trig Point on Deacon Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Permissive_Path_-_geograph.org.uk_-_1215309.jpg",
      "title": "Dennis simpson / Permissive Path",
      "caption": "Permissive Path. Footpath leading along the top of the hill to the top of Deacon Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Time_for_a_drink_-_geograph.org.uk_-_1216064.jpg",
      "title": "Dennis simpson / Time for a drink",
      "caption": "Time for a drink. Cattle gathered round a watering trough. As you descend Deacon Hill you naturally come to a large field. There is a permissive path all the way around the field. The cattle were in that field gathered round a water trough. You can see the hill in the background of the image. It's about 200 yards south of the Hitchin Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Tree_Lined_Path_-_geograph.org.uk_-_1215306.jpg",
      "title": "Dennis simpson / Tree Lined Path",
      "caption": "Tree Lined Path. The Icknield Way Path - seen from Deacon Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Car_Park_at_Icknield_Way_on_the_B655_-_geograph.org.uk_-_533547.jpg",
      "title": "David Sands / Car Park at Icknield Way on the B655",
      "caption": "Car Park at Icknield Way on the B655 Deacon Hill is seen in the distance from this small car park near Pegsdon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Rifle_Range_-_Disused_-_geograph.org.uk_-_1235129.jpg",
      "title": "Dennis simpson / Rifle Range - Disused",
      "caption": "Disused Rifle Range in the Pegsdon Hills. Apparently the earthworks cut across the bottom of the valley are the butts of a disused rifle range, which was used during the 17th and 18th century. There is a information board at the point where the \"earthworks\" visible in the map square meets the Icknield Way Path, that explains a bit more."
    }
  ],
  "distance_km": 4.0,
  "description": "Enjoy a climb to Deacon Hill and enjoy wonderful views over the Chilterns on this walk in the Pegsdon Hills. The hills are also a designated nature reserve so there's lots of intersting flora and fauna to see as well. There's a series of footpaths to follow across the site where you will find chalk hills and wildflower meadows with orchids and moschatels. In the summer months the flowers attract butterflies such as dingy and grizzled skippers. There are fine views of the surrounding Chiltern Hills from the high points which reach nearly 172 metres at Deacon Hill. Start the walk from the car park on the Pirton Road just to the east of the site. From here you can pick up the Icknield Way Path and follow it towards Deacon Hill where there's a trig point and wonderful views to enjoy. The route then follows other footpaths across the hills before picking up the Icknield Way to return you to the car park. On your walk you may see a deer and various birds including skylark, buzzard and fieldfare. The hills are located close to the town of Hitchin. You can follow our Hitchin Walk from the town as an alternative start point. The circular Pirton Walk is another good option. The Barton Hills and Sharpenhoe Clappers are located nearby and are great options for continuing your walking in the area. Barton Hills is a lovely nature reserve with downland, chalk grassland and beech woodland to explore. You can pick up the John Bunyan Trail just to the west of Pegsdon Hills and follow it to Barton Hills. The popular chalk escarpment at Sharpenhoe Clappers includes and Iron Age Hillfort and views of the Smithcombe Hills.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Live and Let Live is located in a nice position at the foot of the hills. They do very good food with good views of the hills from the bar and restaurant area. You can find the pub on the Pegsdon Way in the nearby village of Hexton with a postcode of SG5 3JX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a lovely place to take your dog for a walk but it's probably best to keep them on leads due to the sheep and cattle in the area. The Live and Let Live pub mentioned above is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The hills are located just to the west of the town of Letchworth where you can try the circular Letchworth Walk. This uses a section of the epic Icknield Way Path to visit the town's Norton Common and the nearby villages of Ickleford and Pirton. For more walking ideas in the area see the Chilterns Walks and Hertfordshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Rw8dDrFOWJw",
  "county": "Central Bedfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pirton Road, Shillington, Central Bedfordshire, England, SG5 3JU, United Kingdom",
  "postcode": "SG5 3JU",
  "district": "Shillington",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "chalk hills",
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "nature reserve",
    "views",
    "trig point"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}