{
  "created_at": "2025-01-06T00:55:37.483697+00:00",
  "objectID": "4b642d5f559dc68f8cc6adf9da1f5b5d",
  "ref": "thatcham-discovery-centre-walking-route",
  "title": "Thatcham Discovery Centre - Lakes and Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Thatcham_Discovery_Centre%2C_Seating_Area_-_geograph.org.uk_-_37520.jpg",
  "nearby": [
    {
      "description": "Greenham Common",
      "objectID": "4c927dc924ac38c4d88aabbf3acf2906",
      "ref": "greenham-common-walking-route"
    },
    {
      "description": "Bucklebury Common",
      "objectID": "527fc0c92bca5b3e8d9a977b2a04a03f",
      "ref": "bucklebury-common-walking-and-cycle-route"
    },
    {
      "description": "Bowdown Woods",
      "objectID": "7e4fc4b236132f3a6b9728b27538038f",
      "ref": "bowdown-woods-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4b642d5f559dc68f8cc6adf9da1f5b5d.gpx",
  "_geoloc": {
    "lat": 51.4013016497,
    "lng": -1.2738579026
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Thatcham_Discovery_Centre%2C_Seating_Area_-_geograph.org.uk_-_37520.jpg",
      "title": "Chris Collard / Thatcham Discovery Centre, Seating Area, via Wikimedia Commons",
      "caption": "Thatcham Discovery Centre, Seating Area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Thatcham_Nature_Discovery_Centre_-_geograph.org.uk_-_9568.jpg",
      "title": "Pam Brophy / Thatcham Nature Discovery Centre, via Wikimedia Commons",
      "caption": "Thatcham Nature Discovery Centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Kennet_and_Avon_Canal_near_Thatcham_-_geograph.org.uk_-_333249.jpg",
      "title": "Graham Horn / Kennet and Avon Canal near Thatcham, via Wikimedia Commons",
      "caption": "Kennet and Avon Canal near Thatcham Part of a mile of straight canal, near Thatcham, therefore popular with local walkers. This was one of the last sections of restored canal to be ready for use in 1990."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Thatcham_Lake_-_geograph.org.uk_-_9569.jpg",
      "title": "Pam Brophy / Thatcham Lake, via Wikimedia Commons",
      "caption": "Thatcham Lake. This is a view of the east side of the lake looking across towards the discovery centre. There are benches all around the lake and areas where children can play. This section is situated on the east side of Jubilee Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Thatcham_Nature_Discovery_Centre_-_geograph.org.uk_-_9568.jpg",
      "title": "Pam Brophy / Thatcham Nature Discovery Centre, via Wikimedia Commons",
      "caption": "This grid square consists entirely of lakes and largely undeveloped land that has been turned into a nature discovery centre with a variety of water birds and visited by many schools. It is a good place for walking dogs and it also has a playground for children. This view is of \"Thatcham Lake\" taken from the west side of the lake at the discovery centre building situated in the north eastern section of the grid square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Discovery_Centre_and_Thatcham_Lake_-_geograph.org.uk_-_9571.jpg",
      "title": "Pam Brophy / Discovery Centre and Thatcham Lake, via Wikimedia Commons",
      "caption": "Discovery Centre and Thatcham Lake. This section of the reedbed reserve has been developed into an educational centre and is visited by schools. This is a view from the west side of the lake, situated in the north eastern quadrant of the square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Thatcham_Reedbeds_Nature_Reserve_-_geograph.org.uk_-_9490.jpg",
      "title": "Pam Brophy / Thatcham Reedbeds Nature Reserve, via Wikimedia Commons",
      "caption": "Thatcham Reedbeds Nature Reserve. This picture was taken from next to the bird hide in the nature reserve, looking more or less west across the very small pond which is not marked on the OS Map, but is marked on the Reserve's Map. The pond lies between the stream and the path, in the north eastern section of the grid square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Thatcham_Station_and_the_Kennet_and_Avon_Canal_-_geograph.org.uk_-_1502.jpg",
      "title": "Pam Brophy / Thatcham Station and the Kennet and Avon Canal, via Wikimedia Commons",
      "caption": "Thatcham Station and the Kennet and Avon Canal. The station and bridge over the canal are situated in the south eastern quadrant of the grid square."
    }
  ],
  "distance_km": 2.0,
  "description": "This delightful nature reserve in Thatcham is the perfect place for an easy waterside stroll in Berkshire. There are well laid out footpaths taking you to several lakes, reedbeds, along the Kennet and Avon Canal and to the Thatcham Community Orchard. There are very good facilities with a car park, bird hides, picnic area, a lakeside cafe and an excellent visitor centre with interactive wildlife and natural history displays. The reserve is a great place for wildlife. Look out for birds including fieldfare and redwing. The wildflowers attract various butterflies such as garden tiger, butterbur, waved black, holly blue, and gatekeeper. The reserve is also accessible by public transport. You could follow the canal from Thatcham train station which is located just a mile to the east. To extend your walk you could head south of the reserve to Bowdown Woods and Greenham Common. At Bowdown Woods Nature Reserve you will find exceptionally rich woodland and a variety of wildlife including birds, reptiles, dragonflies and butterflies. Greenham Common is covered in heather and gorse and has nice wide footpaths to follow. There's also wildflower filled grasslands and wetland areas which attract dragonflies and birdlife. The woods and common are located just half a mile south of Thatcham Discovery Centre. Just to the north east there's miles of trails in the expansive Bucklebury Common .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The reserve has a nice lakeside cafe where you can enjoy refreshments after your walk. There's seats outside with nice views over the lake, so perfect for a fine day.You could also head into Thatcham village and visit the King's Head. It's a lovely, recently refurbished old Pub, with a wonderful Beer Garden and Garden Bar. The pub is also dog friendly and can be found it at 59 Broadway with a postcode of RG193HP for your sat navs.If you were to head short distance south you could visit the old control tower on Greenham Common. The 1950's building has been unused for almost 3 decades, but now it has been restored as a visitor centre, museum and community cafe. The cafe offers hot drinks and a variety of delicious cakes, pastries and more. There's also an observation deck where you can enjoy views across what was one of the longest runways in Western Europe. On the south side of Buckleberry Common you will find the excellent Cottage Inn. The friendly pub has a great atmosphere, and serves good home cooked food. There's also a splendid outdoor area which includes a paddock with farm animals. It's a lovely place to sit out in during the summer. You can find the pub on 26 Broad Lane with a postcode of RG7 6QJ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome at the nature reserve but should be kept under close control and are not allowed in the lake."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GqLp0OM5TN8",
  "postcode": "RG19 3AZ",
  "district": "Thatcham",
  "county": "West Berkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Thatcham Reedbed Nature Reserve, Lower Way, Thatcham, West Berkshire, England, RG19 3AZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "grasslands",
    "wetland"
  ],
  "points_of_interest": [
    "orchard",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "bird hides",
    "picnic area",
    "cafe",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}