{
  "created_at": "2025-01-06T18:41:07.356961+00:00",
  "objectID": "4bb69eb82f2b28146e5b577251c09ba2",
  "ref": "mull-of-galloway-trail-walking-route",
  "title": "Mull Of Galloway Trail Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Mull_of_Galloway_Trail_near_East_Tarbet_-_geograph.org.uk_-_3620905.jpg/512px-Mull_of_Galloway_Trail_near_East_Tarbet_-_geograph.org.uk_-_3620905.jpg?20220626190700",
  "nearby": [
    {
      "description": "Loch Ryan",
      "objectID": "acd4eca4b5ed135a9393de9e1608182b",
      "ref": "loch-ryan-walking-route"
    },
    {
      "description": "Ayrshire Coastal Path",
      "objectID": "b0d91ef3de8063faa322d7cbb16c0a6e",
      "ref": "ayrshire-coastal-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4bb69eb82f2b28146e5b577251c09ba2.gpx",
  "_geoloc": {
    "lat": 54.6354184,
    "lng": -4.8599604
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Mull_of_Galloway_Trail_near_East_Tarbet_-_geograph.org.uk_-_3620905.jpg/512px-Mull_of_Galloway_Trail_near_East_Tarbet_-_geograph.org.uk_-_3620905.jpg?20220626190700",
      "title": "Mull of Galloway Trail near East Tarbet by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mull of Galloway Trail near East Tarbet. The Mull of Galloway is renowned for its natural beauty and ecological importance. The promontory is one of the few remaining sections of unspoiled coastal habitat in Galloway, supporting a wide variety of plant and animal species. The area is managed as a nature reserve by the Royal Society for the Protection of Birds (RSPB)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Mull_of_Galloway_Trail_near_Portlennie_-_geograph.org.uk_-_3621449.jpg/512px-Mull_of_Galloway_Trail_near_Portlennie_-_geograph.org.uk_-_3621449.jpg?20220626214935",
      "title": "Mull of Galloway Trail near Portlennie by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mull of Galloway Trail near Portlennie"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Mull_of_Galloway_Trail_-_geograph.org.uk_-_3433239.jpg/512px-Mull_of_Galloway_Trail_-_geograph.org.uk_-_3433239.jpg?20220425213055",
      "title": "Mull of Galloway Trail by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mull of Galloway Trail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Mull_of_Galloway_Lighthouse.jpg/512px-Mull_of_Galloway_Lighthouse.jpg?20141201183409",
      "title": "Krzysztof Hryniewski, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "The Mull features an operational lighthouse, built in 1830 by Robert Stevenson, a prominent engineer. The tower stands at 26 metres (85 feet) high, and its light is positioned 99 metres (325 feet) above sea level, visible up to 28 nautical miles away. This lighthouse, along with the keepers' cottages, has been designated as a Category A listed building due to its historical and architectural significance. During World War II, the Mull of Galloway was the site of an aviation accident when a French pilot, Cladius Echallier, tragically crashed into the lighthouse while flying a Beaufighter in 1944. Today, the lighthouse is automated, and part of the site has been transformed into a visitor centre managed by the South Rhins Community Development Trust. The area also boasts the \"Gallie Craig\" café, built in 2004, which offers stunning views of Northern Ireland and the Isle of Man. The café is integrated into the landscape with a turf roof, reflecting the region’s natural aesthetic. In 2013, the Mull of Galloway Trust, through a community buyout, purchased land and buildings around the lighthouse (excluding the tower), securing the area's future for community use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Loch_Ryan%2C_Stranraer_-_geograph.org.uk_-_5395959.jpg/512px-Loch_Ryan%2C_Stranraer_-_geograph.org.uk_-_5395959.jpg?20230906015739",
      "title": "Loch Ryan, Stranraer by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Loch Ryan is a sea loch located in the southwest of Scotland, known for its strategic significance as a natural harbour. It serves as a key point for ferry services between Scotland and Northern Ireland due to its calm and sheltered waters. Historically, the loch has played a vital role in both civilian and military maritime activities, offering a safe harbour in what can otherwise be a treacherous area for sea travel. The largest settlement along Loch Ryan is the town of Stranraer, which traditionally operated as a major ferry port. However, in more recent times, ferry operations have shifted to Cairnryan, a smaller village located further north on the loch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Loch_Ryan_Coastal_Path_-_geograph.org.uk_-_5769086.jpg/512px-Loch_Ryan_Coastal_Path_-_geograph.org.uk_-_5769086.jpg?20231120040432",
      "title": "Loch Ryan Coastal Path by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Loch Ryan Coastal Path at Cairnryan. Cairnryan now hosts two ferry terminals that provide regular services to Northern Ireland, linking Scotland with the ports of Belfast and Larne. These ferry routes are crucial for both passenger and freight transport between the two regions. Loch Ryan's geography, with its deep and sheltered waters, has made it an ideal location for these operations, supporting the continued economic link between Scotland and Northern Ireland. In addition to its modern use, Loch Ryan has historical significance dating back to World War II when it served as a base for naval operations. The loch's sheltered conditions made it a safe haven for military ships during the war. Today, while its primary function is for commercial ferry traffic, Loch Ryan remains a site of both historical and strategic maritime importance."
    }
  ],
  "distance_km": 59.0,
  "description": "This waymarked long distance walk is designated as one of Scotland's Great Trails by NatureScot. It runs from the the southernmost point of Scotland at the Mull Of Galloway to Glenapp near Loch Ryan. The route runs for just over 36 miles beginning at the car park at the Mull Of Galloway. You then head north along the coastal path to Drummore, Chapel Rossan Bay and Sandhead Bay. From here the route continues through the countryside to Stranraer. The final section of the trail then runs along the Loch Ryan Coastal Path from Stranraer to Glenapp. There's some fine waterside trails and lovely views across the lake to enjoy here. On the route you can look out for wildlife including Roe Deer and Red Squirrel. At the northern end of the walk the trail also links with the Ayrshire Coastal Path .",
  "details": [],
  "video_url": "https://www.youtube.com/embed/Db49yd38Yho?si=gLEIavI201n4b8-K",
  "county": "Dumfries and Galloway",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dumfries and Galloway, Alba / Scotland, DG9 9HP, United Kingdom",
  "postcode": "DG9 9HP",
  "district": null,
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "wildlife",
    "views"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}