{
  "created_at": "2025-01-06T01:49:35.703963+00:00",
  "objectID": "4c2f64ca4fc2f9c7b3dcbe8366b01df1",
  "ref": "helmsdale-walking-route",
  "title": "Helmsdale Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/68/Helmsdale_Harbour_-_geograph.org.uk_-_6868396.jpg?20241021144019",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4c2f64ca4fc2f9c7b3dcbe8366b01df1.gpx",
  "_geoloc": {
    "lat": 58.1145913587,
    "lng": -3.6490447281
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Helmsdale_Harbour_-_geograph.org.uk_-_6868396.jpg?20241021144019",
      "title": "Helmsdale Harbour by Graham Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Helmsdale Harbour. Helmsdale, widely known today for its excellent salmon fishing, originally thrived thanks to the herring boom of the 19th century. The Timespan Heritage Centre in the village offers a look into the region's history with immersive displays and audio-visual exhibits, covering periods from ancient history through to more recent events. A short trip up the Strath of Kildonan leads to Baille an Or and Suisgill, locations tied to the \"Great Sutherland Gold Rush\" of 1869. It began when Robert Gilchrist, who had spent 17 years in the Australian gold fields, made the first gold discovery upon returning home. This sparked a rush of prospectors to the area, and a small shanty town quickly formed. Although the boom was short-lived, traces of gold are occasionally still found. Each year, Helmsdale also hosts traditional Highland Games, held in a stunning setting overlooking the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/River_Helmsdale_from_Telford%27s_Bridge_-_geograph.org.uk_-_2443048.jpg/512px-River_Helmsdale_from_Telford%27s_Bridge_-_geograph.org.uk_-_2443048.jpg?20210805145603",
      "title": "River Helmsdale from Telford's Bridge by John MacKenzie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Helmsdale from Telford's Bridge. The river also known as the River Ullie (Scottish Gaelic: Ilidh / Abhainn Ilidh), is a major eastward-flowing river in the Highlands of Scotland, primarily in the Sutherland region. Originating from Loch Badanloch, the river travels southeast through the Strath of Kildonan (or Strath Ullie), collecting waters from several tributaries along its course. Key tributaries include the Bannock Burn on its left side and the Abhainn na Frithe on its right, with additional significant inflows from the Suisgill Burn (left bank) and Craggie Water (right bank). The river passes Loch Achnamoine about 1.5 km downstream from Loch Badanloch before finally emptying into the Moray Firth on the North Sea, at the coastal town of Helmsdale. Loch Badanloch is part of a network of interconnected lochs, alongside Loch nan Clàr and Loch Rimsdale, which gather water from the southern Flow Country moors, receiving streams like the Allt an Lòin Tharsuinn, Allt Lòn a' Chùil, and Rimsdale Burn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/River_Helmsdale_-_geograph.org.uk_-_2938590.jpg?20211225152529",
      "title": "River Helmsdale by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Helmsdale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Caen_from_bend_in_River_Helmsdale_-_geograph.org.uk_-_1558888.jpg?20110303124304",
      "title": "Sarah McGuire / Caen from bend in River Helmsdale",
      "caption": "Caen from bend in River Helmsdale"
    }
  ],
  "distance_km": 7.0,
  "description": "This walk visits the pretty village of Helmsdale on the east coast of Sutherland. The route takes you along the River Helmsdale which discharges into the Moray Firth at Helmsdale. The walk starts at the picturesque harbour and heads north past the village. The riverside path will then take you north towards Caen Hill with splendid views to the surrounding hills and countryside. You can continue your walking through the Strath of Kildonan by heading west.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south west along the coast and you can pick up the Brora to Golspie Walk along the John O' Groats trail. In this area you can also visit the picturesque Loch Brora. To the north there's the delightful Latheronwheel Fairy Glen, a charming woodland area filled with whimsical \"fairy\" touches created by local volunteers."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lAPlBsz-XGQ?si=xEdH2YwXa3L_-oy9",
  "district": "Helmsdale",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Helmsdale Harbour, Shore Street, Helmsdale, Highland, Alba / Scotland, KW8 6JU, United Kingdom",
  "postcode": "KW8 6JU",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "views",
    "countryside"
  ],
  "facilities": [],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}