{
  "created_at": "2025-01-06T01:42:05.710427+00:00",
  "objectID": "4c4f94ed7b35262450026a6e7e6324ae",
  "ref": "blaenau-ffestiniog-walking-route",
  "title": "Blaenau Ffestiniog Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Blaenau_Ffestiniog%2C_Bethania_-_geograph.org.uk_-_88366.jpg",
  "nearby": [
    {
      "description": "Porthmadog",
      "objectID": "60c8bc483eb6a76916b013f860dfbbe9",
      "ref": "porthmadog-walking-route"
    },
    {
      "description": "Gwydyr Forest",
      "objectID": "be46934496ec81ce829d24f1ec6992de",
      "ref": "gwydyr-forest-walking-and-cycle-route"
    },
    {
      "description": "Cwmorthin",
      "objectID": "7be7f2a58c239220174f281a4f12a890",
      "ref": "cwmorthin-walking-route"
    },
    {
      "description": "Maentwrog",
      "objectID": "07e3895f3298199db8ed1bdee18ee48b",
      "ref": "maentwrog-walking-route"
    },
    {
      "description": "Cwm Penmachno",
      "objectID": "c35a060e89f4b21f62828ee3fee25c03",
      "ref": "cwm-penmachno-walking-route"
    },
    {
      "description": "Llyn Stwlan Dam",
      "objectID": "28b843c3981e2928a9fa06fe9bbe4d12",
      "ref": "llyn-stwlan-dam-walking-route"
    },
    {
      "description": "Tanygrisiau",
      "objectID": "3f2448c6451101bbfd616cfc4c7ad65f",
      "ref": "tanygrisiau-walking-route"
    },
    {
      "description": "Llan Ffestiniog",
      "objectID": "5e789dc9c313a6e316321e4debb76dc4",
      "ref": "llan-ffestiniog-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4c4f94ed7b35262450026a6e7e6324ae.gpx",
  "_geoloc": {
    "lat": 52.9881197015,
    "lng": -3.927153303
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Blaenau_Ffestiniog%2C_Bethania_-_geograph.org.uk_-_88366.jpg",
      "title": "Martin Bodman / Blaenau Ffestiniog: Bethania",
      "caption": "Blaenau Ffestiniog: Bethania. A slate mill, then a woollen mill, Pant-yr-ynn, now a house conversion, survives above the street on the right-hand side. It was powered by the stream that provides the waterfall and the overshot waterwheel survives"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Melin_Pant-yr-Ynn_Slate_Mill%2C_Bethania_-_geograph.org.uk_-_569791.jpg",
      "title": "Eric Jones / Melin Pant-yr-Ynn Slate Mill, Bethania",
      "caption": "Melin Pant-yr-Ynn Slate Mill, Bethania. Pant-yr-Ynn means \"hollow of the ash (trees)\". This was the earliest slate mill to be established in the Blaenau area. Later, it was converted into a woollen mill and only closed in 1964. Sited below the waterfall, its still operative 24' diameter wheel is powered by the fast flowing waters of Afon Du-bach (\"little black stream\"). The listed Grade II building is now an artist's studio, but is open by arrangement to visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Llyn_y_Manod_-_geograph.org.uk_-_561274.jpg",
      "title": "Eric Jones / Llyn y Manod",
      "caption": "Llyn y Manod is a deep, dark and, often, sunless lake. Nevertheless, it has traditionally been regarded as a good trout fishing lake. It has an area of 8.3ha."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/A_party_of_walkers_on_the_eastern_shore_of_Llyn_y_Manod_-_geograph.org.uk_-_561429.jpg",
      "title": "Eric Jones / A party of walkers on the eastern shore of Llyn y Manod",
      "caption": "A party of walkers on the eastern shore of Llyn y Manod. These walkers are following an old quarryman's track through Bwlch y Manod."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Llyn_Bowydd_-_geograph.org.uk_-_211150.jpg",
      "title": "Vivien and Geoff Crowder / Llyn Bowydd",
      "caption": "Llyn Bowydd. Llyn Bowydd and Llyn Newydd from the upper northern slopes of Manod Mawr. The peak at middle right is Moel Penamnen with the Snowdon massif and the Glyder range beyond in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/View_south_across_Llyn_Newydd_-_geograph.org.uk_-_559897.jpg",
      "title": "Eric Jones / View south across Llyn Newydd",
      "caption": "View south across Llyn Newydd. This 12 acre reservoir was formed in the 1860s, when mountain streams were dammed, to provide water for the Maen Offeren Slate Quarry. The lake is bordered by a blanket bog."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Railway_bridge%2C_houses_and_hillside%2C_Blaenau_Ffestiniog_%28geograph_4054363%29.jpg/512px-Railway_bridge%2C_houses_and_hillside%2C_Blaenau_Ffestiniog_%28geograph_4054363%29.jpg",
      "title": "Andrew Hill / Railway bridge, houses and hillside, Blaenau Ffestiniog",
      "caption": "Railway bridge, houses and hillside, Blaenau Ffestiniog. View to the bridge linking Newborough Street and Maenofferen Street from the Glynllifon Street bridge, with the obligatory slate mountain backdrop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Slate_Quarry_Train%2C_Blaenau_Ffestiniog%2C_Gwynedd_-_geograph.org.uk_-_56440.jpg",
      "title": "Anthony Brunning / Slate Quarry Train, Blaenau Ffestiniog, Gwynedd",
      "caption": "Slate Quarry Train. Slate Quarry Train now in the car park in the centre of Blaenau Ffestiniog."
    }
  ],
  "distance_km": 8.5,
  "description": "This old slate mining town is located in Gwynedd in the Snowdonia National Park. It is a popular visitor destination with attractions including the heritage Ffestiniog Railway and the fascinating Llechwedd Slate Caverns. For walkers there are several good trails to try in the surrounding hills and mountains. This circular walk explores the area to the east of the town. On the trail you'll visit lovely waterfalls and several pretty lakes with fine views over Snowdonia to enjoy from the high points. The walk starts from Bethania, just to the south east of the train station and town centre. From here you can follow footpaths north east to the waterfall. The path continues east to visit Llyn Y Manod, the first of several attractive lakes on the route. You then turn north to pass a series of lakes including Llyn Glas, Llyn Du Bach, Llyn y Drum-boeth, Llyn Bowydd and Llyn Newydd. These last two lakes are somewhat larger than the others and are set in a beautiful, elevated position above the town. They sit on the slopes of Manod Mawr, where you can enjoy wonderful views to Moel Penamnen, the Snowdon massif and the Glyder range of mountains. The path then branches round to the west, towards Moel Bowydd, skirting the edge of the Maen-offeren Quarries. You then descend south to reenter the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Y Manod is a good choice for some post walk refreshments. The friendly pub has a good range of beers and can be found on the High Street in Bethania at postcode LL41 4DB. For a bite to eat head to the Meirion Vaults where there's a good menu and a cosy fireplace. You can find it on the High Street at postcode LL41 3AE."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country walks around the town are popular with dog walkers. Both the Meirion Vaults and Y Manod pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Ffestiniog Railway is one of the major attractions of the area and a must for train enthusiasts. The heritage railway runs from the harbour at Porthmadog to Blaenau Ffestiniog, travelling through forested and mountainous scenery. You could catch the railway to nearby Tanygrisiau and visit its pretty reservoir where there is a circular walk to follow. At Moel Bowydd on the route you can take a small detour to the north west to visit the Llechwedd Slate Caverns. Here you can find out about the history of slate quarrying in the town and specifically the Llechwedd quarry in which it is located. The chief attraction is the Deep Mine Tour which has the steepest narrow gauge railway in the UK and travels over 500 feet underground to the disused slate caverns. You can find the caverns at postcode LL41 3NB for your sat navs. To the north of the town you can visit one of the significant historical sites in the area at Dolwyddelan Castle. There are excellent views of the surrounding mountains from the ruins of the 13th century fortress. The circular walk also visits the village of Dolwyddelan and the lovely Afon Lledr Valley. Near here there's also the expansive Gwydyr Forest where the are miles of good walking and cycling trails.  Head west of the town and you can pick up the Cwmorthin Walk. There's a lovely trail here taking you to the old Cwmorthin Quarry and Llyn Cwmorthin. On the way there's a pretty stream, mountains, Japansese gardens, waterfalls and more interesting mining history as well. If you catch the railway west you can pick up the Maentwrog Walk. Here you'll find the beautiful Plas Tan y Bwlch Gardens at the Snowdonia National Park environmental studies centre. It's a fine place for a walk with the picturesque Llyn Mair to see as well. Near here there's the challenging climb to Cnicht. This can be started from the neighbouring village of Croesor which lies a few miles to the west. The summit commands some wonderful views to the coast at Porthmadog. To the east there's Cwm Penmachno where you can explore a number of striking slate quarries, enjoy views of the River Machno and visit the pretty Llyn Bowydd. You can use the long distance Snowdonia Slate Trail to visit the site. Head south and there's the neighbouring village of Llan Ffestiniog where you can visit the Afon Cynfal gorge and the photogenic Cynfal waterfalls. For more walks in the area see the Snowdonia Walks page."
    }
  ],
  "postcode": "LL41 4DN",
  "district": "Manod",
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Quarry Incline, Bethania, Ffestiniog, Manod, Gwynedd, Cymru / Wales, LL41 4DN, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "lake"
  ],
  "points_of_interest": [
    "waterfalls",
    "lakes",
    "mountain views"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}