{
  "created_at": "2025-01-05T23:43:20.380162+00:00",
  "objectID": "4c927dc924ac38c4d88aabbf3acf2906",
  "ref": "greenham-common-walking-route",
  "title": "Greenham Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Greenham_Common_-_geograph.org.uk_-_1187531.jpg",
  "nearby": [
    {
      "description": "Newbury",
      "objectID": "2bedb25bc8a0b75f6f9e132912aaa9e4",
      "ref": "newbury-walking-route"
    },
    {
      "description": "Thatcham Discovery Centre",
      "objectID": "4b642d5f559dc68f8cc6adf9da1f5b5d",
      "ref": "thatcham-discovery-centre-walking-route"
    },
    {
      "description": "Tadley",
      "objectID": "c11a34c7f7ecc82c86b7d64912bcd4bb",
      "ref": "tadley-walking-route"
    },
    {
      "description": "Pamber Forest",
      "objectID": "0507ba8cf41ade81f621a8201cc25b82",
      "ref": "pamber-forest-walking-and-cycle-route"
    },
    {
      "description": "Silchester",
      "objectID": "ed1238cf5d354acdac24254a0ed80919",
      "ref": "silchester-walking-route"
    },
    {
      "description": "Aldermaston",
      "objectID": "ae64fb1d26f9c9c619496e1ca01d055c",
      "ref": "aldermaston-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4c927dc924ac38c4d88aabbf3acf2906.gpx",
  "_geoloc": {
    "lat": 51.38222748,
    "lng": -1.28458499
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Greenham_Common_-_geograph.org.uk_-_1187531.jpg",
      "title": "Graham Horn / Greenham Common, via Wikimedia Commons",
      "caption": "Cyclists on the common. The former airfield has reverted to heathland and common use. On the former taxiways cycle and footpaths and wildlife ponds have been created. Cycling is probably more popular than walking because of the size of the area and the good cycle paths. This is about halfway along the northern taxiway looking east-south-east, using a telephoto lens to foreshorten the view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Greenham_Common_-_geograph.org.uk_-_1187352.jpg",
      "title": "Graham Horn / Greenham Common, via Wikimedia Commons",
      "caption": "Cattle grazing on the common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Greenham_Common_-_geograph.org.uk_-_1187356.jpg",
      "title": "Graham Horn / Greenham Common, via Wikimedia Commons",
      "caption": "This is the northern taxiway, looking west-north-west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Greenham_Common_-_geograph.org.uk_-_1187358.jpg",
      "title": "Graham Horn / Greenham Common, via Wikimedia Commons",
      "caption": "This is the northern taxiway, looking east-south-east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Greenham_Common_-_geograph.org.uk_-_1187348.jpg",
      "title": "Graham Horn / Greenham Common, via Wikimedia Commons",
      "caption": "This photo is looking across the former runway (it ran across the picture) towards the former administrative buildings on the south side, now a business park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Greenham_Common_-_geograph.org.uk_-_10646.jpg",
      "title": "Pam Brophy / Greenham Common, via Wikimedia Commons",
      "caption": "This section of the common is at the control tower and parking area. This building is closest to the road and more or less north of the control tower. The picture was taken more or less from the south west side of the building. Greenham Common has been declared an area of scientific interest and played a role in the second world war."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Greenham_Common_-_geograph.org.uk_-_1267.jpg",
      "title": "Brendan and Ruth McCartney / Greenham Common, via Wikimedia Commons",
      "caption": "Part of the leisure complex built on the old Greenham Common Airbase."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Greenham_Common_-_geograph.org.uk_-_1187345.jpg",
      "title": "Graham Horn / Greenham Common, via Wikimedia Commons",
      "caption": "This is taken looking towards one of the footpaths"
    }
  ],
  "distance_km": 7.0,
  "description": "Explore the Greenham and Cookham Commons on this circular walk near Newbury. Greenham Common is a former Royal Air Force station. Opened in 1942, it was used by both the Royal Air Force and United States Army Air Forces during the Second World War and the United States Air Force during the Cold War. Today this large green space is ideal for a long walk or cycle ride in peaceful surroundings. The expansive area of heathland is covered in heather and gorse and has nice wide footpaths to follow. There's also wildflower filled grasslands and wetland areas which attract dragonflies and birdlife. Look out for horses and ponies roaming the common too. This walk starts from the car park on Bury's Bank Road and takes you around the central area of the common. At the northern end of the common you will find Bowdown Woods Nature Reserve. Here you will find exceptionally rich woodland and a variety of wildlife including birds, reptiles, dragonflies and butterflies. To extend your walk from the common you could head north through Bowdown Woods to the lovely Thatcham Discovery Centre where there are splendid waterside footpaths to try.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The 1950's Control Tower has been unused for almost 3 decades, but now it has been restored as a visitor centre, museum and community cafe. The cafe offers hot drinks and a variety of delicious cakes, pastries and more. There's also an observation deck where you can enjoy views across what was one of the longest runways in Western Europe. If you head a short distance north from the common to the Thatcham Discovery Centre you will find a nice lakeside cafe where you can enjoy refreshments. There's seats outside with nice views over the lake, so perfect for a fine day.You could also head into Thatcham village and visit the King's Head. It's a lovely, recently refurbished old Pub, with a wonderful Beer Garden and Garden Bar. The pub is also dog friendly and can be found it at 59 Broadway with a postcode of RG193HP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and you will likely see several other dogs on your walk. There is some grazing cattle though so it's a good idea to put them on the lead in these areas."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east there's the worthy town of Tadley where you can enjoy woodland trails around the expansive Pamber Forest before heading to the ancient Roman Fort at Silchester. Just north of Newbury you can visit the historic Donnington Castle and enjoy a walk around the attractive heathland of Snelsmore Common Country Park. For more walking ideas in the area see the Berkshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gi0jWY8wCbo",
  "county": "West Berkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Greenham Control Tower, Bury's Bank Road, Greenham, West Berkshire, England, RG19 8BZ, United Kingdom",
  "postcode": "RG19 8BZ",
  "district": "Greenham",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "heathland",
    "woodland",
    "grasslands",
    "wetland"
  ],
  "points_of_interest": [
    "wildflower areas",
    "wildlife viewing",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}