{
  "created_at": "2025-01-06T10:29:02.521385+00:00",
  "objectID": "4cab9d2af35271ec543a823910425ec5",
  "ref": "corndon-hill-walking-route",
  "title": "Corndon Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Westwards_from_Corndon_towards_Montgomery_-_geograph.org.uk_-_1123741.jpg",
  "nearby": [
    {
      "description": "Mitchell's Fold Stone Circle",
      "objectID": "7285439f0e3a99ffb0428e71a3526366",
      "ref": "mitchells-fold-stone-circle-walking-route"
    },
    {
      "description": "Bishop's Castle Ring",
      "objectID": "3a171237b6bd28054eb29c25de999600",
      "ref": "bishops-castle-ring-walking-route"
    },
    {
      "description": "Stiperstones",
      "objectID": "eed05945e064e42101a206a3a832088f",
      "ref": "stiperstones-walking-route"
    },
    {
      "description": "Shropshire Way",
      "objectID": "1b9df3ce4782005d5d9dee4e5a37b1f7",
      "ref": "shropshire-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4cab9d2af35271ec543a823910425ec5.gpx",
  "_geoloc": {
    "lat": 52.575920572,
    "lng": -3.030435193
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Westwards_from_Corndon_towards_Montgomery_-_geograph.org.uk_-_1123741.jpg",
      "title": "Richard Law [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Trig Point at the summit. The hill is surrounded on three sides by the county of Shropshire, standing as a prominent landmark along the England–Wales border. The distinct western edge of Corndon Hill seems to create a distinct hill and is referred to locally as Lan Fawr (Welsh for 'Big Hill')."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Stiperstones_ridge_from_Corndon_Hill_-_geograph.org.uk_-_1499006.jpg",
      "title": "Jeremy Bolwell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stiperstones ridge from Corndon Hill. The summit offers breathtaking panoramic views, making it a significant landmark for the surrounding countryside and nearby towns like Montgomery. It lies in proximity to villages such as Church Stoke and Hyssington."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Mitchell%27s_Fold_on_Stapeley_Hill_from_Corndon_Hill_summit_-_geograph.org.uk_-_1499014.jpg",
      "title": "Jeremy Bolwell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Looking towards Mitchell's Fold and Stapeley Hill. The hill is geologically situated within the Shropshire Hills range, primarily extending to the north, east, and south of the summit. To the immediate west lies the Vale of Montgomery and the River Severn, while the Cambrian Mountains are visible beyond to the far west. To the northeast are the Stiperstones and Shelve, while the east features Caer Caradoc and the Long Mynd."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Cairn_at_summit_of_Corndon_Hill_-_geograph.org.uk_-_652738.jpg",
      "title": "John Clift [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cairn and wonderful far reaching summit views. Near the summit of the hill, there is a significant Bronze Age cairn, accompanied by several others in the surrounding area. These circular stone burial cairns are prevalent across most Welsh summits and typically date from around 2500 BC to approximately 700 BC, marking the transition from bronze to iron tools and goods. They often contain one or more cremation urns, housed within a stone cyst or box within the mound. Adjacent to the hill, within Shropshire and Powys, are the Bronze Age stone circles of Mitchell's Fold and The Whetstones, the latter mostly destroyed. Another nearby circle in Shropshire is the Hoarstones. Approximately 4 miles (6.4 km) east of the hill lies Offa's Dyke, constructed during the 8th century to delineate the border between Wales and England (or Mercia)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Old_quarry_workings%2C_Corndon_Hill_-_geograph.org.uk_-_3210634.jpg/512px-Old_quarry_workings%2C_Corndon_Hill_-_geograph.org.uk_-_3210634.jpg",
      "title": "Old quarry workings, Corndon Hill by Dave Croker, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Old quarry workings, Corndon Hill. The flagstone quarries of Corndon are located on the southwestern inclines of Corndon Hill and have origins dating back to medieval times. Even when viewed from above, these quarries remain a prominent aspect of the landscape. Within this region, the modified Hope Shales from the Ordovician Period, situated on the periphery of the dolerite (diabase), yield finely laminated flagstones. These flagstones were extensively used in construction along the Shropshire–Montgomeryshire border. Today, only a handful of structures still feature these flagstones as roofing slates, notable examples being the Old Post Office at Church Stoke and the porch of Hurdley Farmhouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Sunlight_near_Corndon_Hill_-_geograph.org.uk_-_3210644.jpg/512px-Sunlight_near_Corndon_Hill_-_geograph.org.uk_-_3210644.jpg",
      "title": "Sunlight near Corndon Hill by Dave Croker, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sunlight near Corndon Hill"
    }
  ],
  "distance_km": 4.0,
  "description": "Climb to this prominent hill in Powys and enjoy wonderful views over the Long Mynd and Stiperstones on this lovely walk on the Wales-England border. You can start the walk from a parking area just north of the hill, near the Mitchell's Fold stone circle. From here it is a short walk to the hill summit which stands at a height of 1,683 ft. The view from here is first class with the Shropshire Hills and Welsh Mountains stretching out in front of you for miles. On a clear day the Clee Hills, Severn Valley, Clwydian Hills, Cheshire Plain, Cadair Idris, the Rhinogs and the Black Mountains are all in focus. After taking in the view you can return the same way or turn it into a longer circular walk by descending south east and then south from the summit. The footpath then loops round to Lan Fawr near Priest Weston before returning to the car park. The walk to Mitchell's Fold Stone Circle starts from the same car park so you can easily visit the fascinating Bronze Age stones at the same time. Corndon Hill is located just a few miles west of the wonderful Stiperstones Nature Reserve. It's a great place to continue your walking with its craggy rock outcrops, gorgeous heather heathland and more wonderful views from the elevated position. The long distance Shropshire Way also runs nearby and is another great way to explore this beautiful area on foot. Also of interest is the Bishop's Castle Ring long distance footpath. It passes just to the west of the hill and will take you on a tour of the countryside and hills surrounding the Shropshire market town of Bishop's Castle.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/MKsetg9-qD8?si=A0yxwQiyg0IDaTte",
  "county": "Shropshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Weston Road, Heightley, Chirbury with Brompton, Priest Weston, Shropshire, England, SY15 6DD, United Kingdom",
  "postcode": "SY15 6DD",
  "district": "Priest Weston",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "heathland",
    "hill"
  ],
  "points_of_interest": [
    "stone circle",
    "views",
    "nature reserve",
    "footpath"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}