{
  "created_at": "2025-01-06T05:02:59.917206+00:00",
  "objectID": "4d81da8d7c9bd8656e90bfb5836f3537",
  "ref": "hartlepool-walking-route",
  "title": "Hartlepool Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Buildings_at_Hartlepool_Historic_Quay_-_geograph.org.uk_-_318313.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4d81da8d7c9bd8656e90bfb5836f3537.gpx",
  "_geoloc": {
    "lat": 54.6892156956,
    "lng": -1.2054828743
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Buildings_at_Hartlepool_Historic_Quay_-_geograph.org.uk_-_318313.jpg",
      "title": "Oliver Dixon / Buildings at Hartlepool Historic Quay",
      "caption": "Buildings at Hartlepool Historic Quay HMS Trincomalee beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Navigation_light_Hartlepool_South_Pier._-_geograph.org.uk_-_496369.jpg",
      "title": "Steve F / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Navigation light Hartlepool South Pier. Solar powered navigation light."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Sea_Defences%2C_Carr_House_Sands_-_geograph.org.uk_-_568539.jpg",
      "title": "Mick Garratt / Sea Defences, Carr House Sands",
      "caption": "Sea Defences, Carr House Sands. View north to Hartlepool. About an hour to high tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/View_from_Newburn_Bridge_-_geograph.org.uk_-_86889_%28cropped%29.jpg",
      "title": "Colin Coates / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "View from Newburn Bridge. This is the site of the old railways sheds in West Hartlepool. The site had a turntable, which if it had been saved would have been a tourist goldmine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Pond%2C_Teesmouth_National_Nature_Reserve_-_geograph.org.uk_-_568558.jpg",
      "title": "Mick Garratt / Pond, Teesmouth National Nature Reserve",
      "caption": "Pond, Teesmouth National Nature Reserve. The players are on the Seaton Carew Golf Course. On the left is the nuclear power station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Teesmouth_National_Nature_Reserve_-_geograph.org.uk_-_568561.jpg",
      "title": "Mick Garratt / Teesmouth National Nature Reserve",
      "caption": "Teesmouth National Nature Reserve. Looking across the sweep of North Gare Sands towards the breakwater. Incoming tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Tees_Mouth_-_geograph.org.uk_-_74878.jpg",
      "title": "Uncredited / Tees Mouth",
      "caption": "Tees Mouth. Right at the end of the North Gare Sands at the mouth of the River Tees is a stretch of sand which is uncovered at low tide. Although you are right opposite petrochemical plants, you are still able to be in touch with nature. In this photo a seal is in the water, checking out the men and their dog."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/HMS_Trincomalee%28Hartlepool_Historic_Quay%29_-_geograph.org.uk_-_209088.jpg",
      "title": "James Hearton / HMS Trincomalee(Hartlepool Historic Quay)",
      "caption": "HMS Trincomalee at the Hartlepool Historic Quay. The ship was built in India for the Royal Navy in 1817."
    }
  ],
  "distance_km": 16.5,
  "description": "This town on the north east coast has some nice walks to try along its beaches, nature reserve and old quay. This coastal walk from the town takes you to the Teesmouth National Nature Reserve, located a few miles south of the town. Along the way there's beaches, sand dunes and views of Hartlepool Bay and Tees Bay. The walk starts at Hartlepool's fascinating Historic Quay where there are old ships and a wonderful naval museum. From here you can pick up a shared cycling and walking trail and follow it south along Hartlepool Bay to Hewburn Bridge and Carr House Sands. The route continues along Seaton Sands and Tees Bay before strolling out onto the North Gare Breakwater. Here you will find North Gare Sands and the Teesmouth National Nature Reserve. The reserve has some lovely beaches, sand dunes and lots of birdlife to see. During the winter months Knot from Greenland and the Canadian Arctic, Shelduck, Teal and Sanderling are seen. In spring, Ringed Plover, Lapwing, Oystercatcher and Snipe nest. The reserve is also unusual as it is surrounded by one of the largest concentrations of heavy industry in Britain including Hartlepool Power Station. You can then follow a circular footpath around the golf course at Seaton Snook before following the same paths back into Hartlepool.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near the start/end of the walk you can head to Jackson's Wharf for some refreshments. The pub is in a great location next to Hartlepool Marina, with a perfect view of HMS Trincomalee, Britain’s oldest floating warship. The wooden frigate, is the unofficial symbol of Hartlepool and makes a great backdrop for a some alfresco dining on the patio area of the pub. You can find the pub at postcode TS24 0XN for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal paths and beaches are great for dog walking. The Jackson's Wharf pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "After you walk head to the historic quay and visit the Royal Naval Museum. The museum allows you to travel back in time at the 18th century seaport. You can see how tradesmen like tailors, printers and instrument makers earned a wage and how people spent their leisure time playing traditional games. Knowledgeable staff will explain the history and workings of the HMS Trincomalee and provide a wonderful cannon demonstration. You can pick up the Durham Coastal Footpath at Hart, just to the north west of the town. The waymarked trail will take you up to one of the walking highlights of the area at the lovely Castle Eden Dene Nature Reserve. Continuing along the path will take you to the coastal town of Seaham."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CydG8lYOrik",
  "district": "Hartlepool",
  "county": "Hartlepool",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}