{
  "created_at": "2025-01-06T00:50:12.485381+00:00",
  "objectID": "4da120a7ef87f252e6c1abacfb7398cc",
  "ref": "buck-mills-to-clovelly-walk-walking-route",
  "title": "Bucks Mills to Clovelly Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/A_stream_runs_through_Buck%27s_Mills_-_geograph.org.uk_-_1386990.jpg/256px-A_stream_runs_through_Buck%27s_Mills_-_geograph.org.uk_-_1386990.jpg",
  "nearby": [
    {
      "description": "Westward Ho",
      "objectID": "05481e8b17dbf5b6d16e62919c01edd7",
      "ref": "westward-ho-walking-route"
    },
    {
      "description": "Hartland Point",
      "objectID": "a9689c8bb7541e8e80c23603b27b6397",
      "ref": "hartland-point-walking-route"
    },
    {
      "description": "Brownsham Wood",
      "objectID": "cad32d92bffe2ed8fdcee0bc47f53fb8",
      "ref": "brownsham-wood-walking-route"
    },
    {
      "description": "Codden Hill",
      "objectID": "e261fd6f2fd28a05bb6ee962ca7ae5a3",
      "ref": "codden-hill-walking-route"
    },
    {
      "description": "Westward Ho to Clovelly",
      "objectID": "914352c101da576a6f0116e6f11d5190",
      "ref": "westward-ho-to-clovelly-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4da120a7ef87f252e6c1abacfb7398cc.gpx",
  "_geoloc": {
    "lat": 50.985095827,
    "lng": -4.3397714446
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/A_stream_runs_through_Buck%27s_Mills_-_geograph.org.uk_-_1386990.jpg/256px-A_stream_runs_through_Buck%27s_Mills_-_geograph.org.uk_-_1386990.jpg",
      "title": "Steve Daniels / A stream runs through Buck's Mills, via Wikimedia Commons",
      "caption": "A stream runs through Buck's Mills"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Buck%27s_Mills_-_geograph.org.uk_-_1431392.jpg",
      "title": "Philip Halling / Buck's Mills, via Wikimedia Commons",
      "caption": "Buck's Mills Houses in the quiet north Devon seaside hamlet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Parkham%2C_Buck%27s_Mills_-_geograph.org.uk_-_36625.jpg",
      "title": "Martin Bodman / Parkham: Buck's Mills, via Wikimedia Commons",
      "caption": "Parkham: Buck's Mills. Seen from the South West Coast Path. Hartland Point in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Footpath_to_Buck%27s_Mills_-_geograph.org.uk_-_1595993.jpg",
      "title": "Eirian Evans / Footpath to Buck's Mills, via Wikimedia Commons",
      "caption": "Footpath and information board at the parking area at Buck's Mills. Buck's Mills was formerly a fishing village and the mill was a corn mill powered by the stream that runs through the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Waterfall_at_Buck%27s_Mills_-_geograph.org.uk_-_1387020.jpg",
      "title": "Steve Daniels / Waterfall at Buck's Mills, via Wikimedia Commons",
      "caption": "Waterfall, Buck's Mills. The stream running through Buck's Mills makes a dramatic exit to the sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Bideford_Bay_Clovelly.jpg",
      "title": "Richard Croft / Harbour view, via Wikimedia Commons",
      "caption": "Bideford Bay Clovelly"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Clovelly_-_geograph.org.uk_-_875917.jpg",
      "title": "Richard Croft / Clovelly, via Wikimedia Commons",
      "caption": "Clovelly View from the end of the quay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Clovelly_-_geograph.org.uk_-_29616.jpg",
      "title": "John Clive Nicholson [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Clovelly"
    }
  ],
  "distance_km": 6.5,
  "description": "This walk follows the coastal path from Bucks Mills to Clovelly in North Devon. On the way you'll enjoy nice woodland trails through the Bucks and Keivells Nature Reserve and enjoy lovely views of Barnstaple Bay. The route runs fors just over 4 miles on an undulating path, with some climbs on the way. The walk starts from the Bucks Mills Reserve car park where you can pick up footpaths heading north to join the South West Coast Path. There's a stream that runs through the village and falls over the cliff edge in a waterfall onto the beach which has large pebbles and hard sandstone formations. From the coast path the route then heads west past the Bideford Bay Holiday Village and Barton Wood. You'll walk along the Hobby Drive which is a nice peaceful woodland trail which leads you all the way to Clovelly. Here you will find a lovely harbour, a steep pedestrianised cobbled main street and fine views over the Bristol Channel. The village is also known for its donkeys, giving rides to visitors’ children during the summer months and posing for photographs in the street. To continue your walking from Bucks Mills you could follow the coast path east to Westward Ho with more details on the Westward Ho to Clovelly Walk. In this area you can also visit Northam Burrows Country Park. The park includes fine views over the estuary of the River Torridge with 600 acres of grassy coastal plain, salt marsh, sand dunes and grasslands. If you were to head west you would come to Brownsham Wood where you can enjoy a circular walk visiting Mouth Mill beach and the impressive Blackchurch Rock. The lovely Hartland Point is located a little further west.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Cottage Team Rooms in Clovelly for some refreshments at the end of your walk. This delightful village tea shop is full of period charm. Outside, the sunny sheltered courtyard offers you spectacular views across Bideford Bay and the garden overflows with colourful cottage flowers and exotics. You can find the tea rooms on the High St with a postcode of EX39 5TE for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Clovelly we recommend a visit to the donkey stables and Clovelly pottery. They are situated next to each other in the Lower Yard Workshops just below Clovelly Visitor Centre, before you walk down the famous cobbled street of the village. The pottery offers an extensive range of his quality, beautifully glazed hand-thrown pots. The workshop also offers a choice of ceramics from several West County potters. Just to the east of Buck's Mills you will find Peppercombe Castle. Here you will find an Iron Age Hillfort and the small stream of Peppercombe Water which is a little over a kilometre long, but its valley is relatively deep. It ends in a waterfall consisting in a series of cascades, each between 0.5 and 1.5 metres high, that have formed due to the unequal hardness of the different beds of the underlying rock. The area is also geologically significant, with distinctive red cliffs that extend for about 2 km inland. Just to the south of nearby Barnstaple you can enjoy a climb to the viewpoint on Codden Hill from the village of Bishop's Tawton. Here you'll find the monument to Caroline Thorpe, wife of local MP Jeremy Thorpe who became embroiled in the Thorpe scandal of the 1970s. There's also some splendid views over the area and waterside trails along the pretty Venn Stream to enjoy."
    }
  ],
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bucks Mills Car Park, Atlantic Highway, Waytown, Parkham, Bucks Mills, Torridge, Devon, England, EX39 5QQ, United Kingdom",
  "postcode": "EX39 5QQ",
  "district": "Torridge",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "coastal",
    "beach"
  ],
  "points_of_interest": [
    "views",
    "harbour",
    "village",
    "country park",
    "beach"
  ],
  "facilities": [
    "car park",
    "dog friendly",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}