{
  "objectID": "4ded77191ee311b9a0b02c6824395e8c",
  "created_at": "2024-12-20T12:56:44.824127+00:00",
  "ref": "wylam-walking-route",
  "title": "Wylam Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Wylam_Green_-_geograph.org.uk_-_1065849.jpg",
  "nearby": [
    {
      "description": "Hadrian's Wall Path",
      "objectID": "25270502c1c6b89b9bc84cfcdd28ab2c",
      "ref": "hadrians-wall-path-walking-route"
    },
    {
      "description": "Whittle Dene Reservoir",
      "objectID": "3d3409af55409a80af70b70eb3510e03",
      "ref": "whittle-dene-reservoir-walking-route"
    },
    {
      "description": "Tyne Riverside Country Park",
      "objectID": "04d8764a367a1de64fa21b7296a69728",
      "ref": "tyne-riverside-country-park-walking-and-cycle-route"
    },
    {
      "description": "Newburn to Wylam Walk",
      "objectID": "807d1951bafb2e690dff2a1055c826b1",
      "ref": "newburn-to-wylam-walk-walking-route"
    },
    {
      "description": "Gateshead",
      "objectID": "880618cfa186bd38d425a388fec77d96",
      "ref": "gateshead-walking-route"
    },
    {
      "description": "Keelmans Way",
      "objectID": "2209e7f09f3609111dff1931b2bf0042",
      "ref": "keelmans-way-walking-and-cycle-route"
    },
    {
      "description": "Ovingham",
      "objectID": "0bed60f53c90b33d8b44572710047edd",
      "ref": "ovingham-walking-route"
    },
    {
      "description": "River Tyne Trail",
      "objectID": "b0b0ed51ef52f30d8ba672598201345b",
      "ref": "river-tyne-trail-walking-route"
    },
    {
      "description": "Clara Vale",
      "objectID": "5604396101084511ee0307c1196d4874",
      "ref": "clara-vale-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/30F8208B9D4EF4E58625866D0073F3C3/$FILE/Wylam.gpx",
  "_geoloc": {
    "lat": 54.9760282916,
    "lng": -1.815107886
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Wylam_Green_-_geograph.org.uk_-_1065849.jpg",
      "title": "Mike Quinn / Wylam Green",
      "caption": "Wylam Green. Shows the location of a Victorian postbox, including the war memorial and the bridge over the River Tyne beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/The_Wylam_Wagonway_-_geograph.org.uk_-_1558247.jpg",
      "title": "Andrew Curtis / The Wylam Wagonway",
      "caption": "The Wylam Wagonway. At one time this was the route of the road between Newcastle and Hexham, preceding both the Military Road and the A69. A waggonway linking Wylam colliery with the coal staithes at Lemington was built alongside it before 1763, one of the earliest on Tyneside. Wagons were drawn by horses along wooden rails. Iron rails and two steam locomotives made by William Hedley, Wylam Dilly and Puffing Billy were in use by 1815. George Stephenson was born by the waggonway and went on to develop further locomotives that were to revolutionise railways for passenger transport. The waggonway is now part of Hadrian's Way path, which turns right at this signpost, and a national cycle route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/George_Stephenson%27s_cottage_-_geograph.org.uk_-_5428.jpg",
      "title": "Ken Brown / George Stephenson's cottage",
      "caption": "George Stephenson's cottage. This small stone cottage, built around 1750, has earned a place in history by being the birthplace of railway pioneer George Stephenson. Stephenson was born here in 1781, and went on to make his name at nearby Wylam colliery. The cottage was once home to four pitmen's families, and the room in which Stephenson was born, and in which the whole family lived can be seen today, furnished in period style."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/River_Tyne_below_Wylam_Bridge_-_geograph.org.uk_-_1726708.jpg/512px-River_Tyne_below_Wylam_Bridge_-_geograph.org.uk_-_1726708.jpg",
      "title": "Andrew Curtis / River Tyne below Wylam Bridge",
      "caption": "River Tyne below Wylam Bridge. The bridge is a wrought iron structure built by the Scotswood, Newburn and Wylam Railway Company in 1876 to link the North Wylam Loop with the Newcastle and Carlisle Railway. Many of the trains which used the bridge carried coal from the collieries at Newburn and Walbottle westwards to Carlisle. The line was closed in 1968 and the bridge later purchased by Northumberland County Council. It was restored in 1997 with help from the Heritage Lottery Fund."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/War_Memorial%2C_Heddon_on_the_Wall_-_geograph.org.uk_-_1121006.jpg",
      "title": "Andrew Curtis / War Memorial, Heddon on the Wall",
      "caption": "War Memorial, Heddon on the Wall. The War Memorial was erected in 1922 to honour those men of the village who lost their lives in the Great War of 1914-1918. Names of those from the 1939-1945 War were added later. The small Memorial Park was built on a site originally occupied by the village pond, in memory of the two sons of Sir James and Lady Knott."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Vindobala_Roman_Fort%2C_Rudchester_-_geograph.org.uk_-_2465993.jpg/512px-Vindobala_Roman_Fort%2C_Rudchester_-_geograph.org.uk_-_2465993.jpg",
      "title": "Andrew Curtis / Vindobala Roman Fort, Rudchester",
      "caption": "Vindobala Roman Fort, Rudchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Whittle_Dene_Reservoir_-_geograph.org.uk_-_1035866.jpg",
      "title": "Les Hull / Whittle Dene Reservoir",
      "caption": "Whittle Dene Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Ovingham_bridge_-_geograph.org.uk_-_1043930.jpg",
      "title": "Mike Quinn / Ovingham bridge",
      "caption": "Ovingham bridge"
    }
  ],
  "distance_km": 20.0,
  "description": "This pleasant riverside village is located in a lovely spot, a few miles west of Newcastle. The interesting village has strong connections to the early years of the railway with pioneers George Stephenson and Timothy Hackworth born in the area. It's a popular place for walkers and cyclists with good surfaced trails along the river and the Hadrian's Wall Path running along the historic wall to the north of the village. This circular walk from Wylam visits some of the highlights of the area including Stephenson's Cottage, the village of Heddon on the Wall, Hadrian's Wall Path, Vindobala Roman Fort, Whittle Dene Reservoir, Tyne Riverside Country Park and the neighbouring village of Ovingham. The walk starts in the village and starts by heading east along the river to Stephenson's Cottage, the birthplace of railway pioneer, George Stephenson. It's now a National Trust property where you can learn all about his early life and the Stephenson gauge', the basis for the standard gauge used by most of the world's railways. He also designed the Locomotion No. 1, which was the first steam locomotive to carry passengers on a public rail line, the Stockton and Darlington Railway in 1825. Just after passing the cottage you turn north to follow countryside footpaths to Heddon on the Wall. Here you turn west to follow Hadrian's Wall to the Vindobala Roman Fort where there is an information board detailing the history of the site. The name Vindobala means “White Strength” with the troops recruited from a coastal tribe of Lower Germany. From here you continue west to Harlow Hill and the Whittle Dene Reservoir where there are lovely views across the water to the surrounding hills. A footpath then heads south to Welton Hall and Whittle Dene before coming to Ovingham village. Here you'll find the western end of the popular Tyne Riverside Country Park where there are nice trails and facilities. You then follow a riverside trail east to return to Wylam.",
  "postcode": "NE41 8DZ",
  "district": "Wylam",
  "county": "Northumberland",
  "region": "North East",
  "country": "England"
}