{
  "objectID": "4e501e54b0e6ba994eef0efda8665d36",
  "created_at": "2024-12-18T16:48:36.667110+00:00",
  "ref": "ribble-estuary-walking-route",
  "title": "Ribble Estuary Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/09/Salt_marsh_on_the_Ribble_estuary_-_geograph.org.uk_-_611881.jpg",
  "nearby": [
    {
      "description": "Fairhaven Lake",
      "objectID": "72151b8609897b0cc348a49864ae88f7",
      "ref": "fairhaven-lake-walking-route"
    },
    {
      "description": "Lytham Hall",
      "objectID": "4744cc69cbcd22af958a6ec85db694b0",
      "ref": "lytham-hall-walking-route"
    },
    {
      "description": "Lancashire Coastal Way",
      "objectID": "0684fc813b4fb3da164391e5f4840e2e",
      "ref": "lancashire-coastal-way-walking-route"
    },
    {
      "description": "Hesketh Bank",
      "objectID": "3a7d9b25d7e8b6d79ebdcf0fb0a0916b",
      "ref": "hesketh-bank-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/FB041A3AA20AFE828025802C00716A84/$FILE/Ribble Estuary.gpx",
  "_geoloc": {
    "lat": 53.7386933659,
    "lng": -3.0004124201
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Salt_marsh_on_the_Ribble_estuary_-_geograph.org.uk_-_611881.jpg",
      "title": "Mr T / Salt marsh on the Ribble estuary, via Wikimedia Commons",
      "caption": "Salt marsh on the Ribble estuary at Lytham with the windmill in the background. You have to tread carefully around here as the grasses do a very good job of hiding deep holes in the ground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Ribble_Estuary_National_Nature_Reserve_-_geograph.org.uk_-_1366049.jpg",
      "title": "Simon Huguet / Ribble Estuary National Nature Reserve, via Wikimedia Commons",
      "caption": "Ribble Estuary National Nature Reserve Looking across the tidal flats towards Warton on the other side of the estuary. The reserve extends to over 4500 ha and is home to many breeding birds in summer and an estimated 150,000 plus over-wintering wildfowl. The land is managed with a huge herd of over 700 cattle in summer to keep the sward in the right condition for the birds. Due to the fragility of parts of the site and the risk of disturbance to the birds, not to mention the speed of the incoming tides at certain times of year, access is limited to rights of way and permit holders."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Fairhaven_Lake_-_geograph.org.uk_-_1724875.jpg",
      "title": "Peter Teal / Fairhaven Lake, via Wikimedia Commons",
      "caption": "Fairhaven Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Lytham%2C_over_Fairhaven_Lake_to_the_sea_-_geograph.org.uk_-_923098.jpg",
      "title": "Chris Downer / Lytham: over Fairhaven Lake to the sea, via Wikimedia Commons",
      "caption": "Lytham, over Fairhaven Lake to the sea and Southport. On a clear day you can see Anglesey and the Welsh Mountains."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/The_pond_in_Lowther_Gardens_-_geograph.org.uk_-_2836348.jpg/512px-The_pond_in_Lowther_Gardens_-_geograph.org.uk_-_2836348.jpg",
      "title": "The pond in Lowther Gardens by Steve Daniels, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The pond in Lowther Gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Lytham_Jetty%2C_Ribble_Estuary_-_geograph.org.uk_-_2570619.jpg/512px-Lytham_Jetty%2C_Ribble_Estuary_-_geograph.org.uk_-_2570619.jpg",
      "title": "Lytham Jetty, Ribble Estuary by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lytham Jetty, Ribble Estuary. View to Southport."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Lytham_RNLI_station_at_sunset_-_geograph.org.uk_-_33240.jpg",
      "title": "Roger May / Lytham RNLI station at sunset",
      "caption": "Lytham RNLI station at sunset"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/The_promenade_on_Lancashire_Coastal_Way_-_geograph.org.uk_-_2628268.jpg/512px-The_promenade_on_Lancashire_Coastal_Way_-_geograph.org.uk_-_2628268.jpg",
      "title": "The promenade on Lancashire Coastal Way by Raymond Knapman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The promenade on Lancashire Coastal Way. Looking towards Ansdell."
    }
  ],
  "distance_km": 8.5,
  "description": "Explore the most important river estuary in the UK on this coastal walk in Lytham St Annes. The Ribble Estuary attracts hundreds of thousands of birds each year. It's a special place with changing tides, lots of wildlife and nice views towards Southport and the Welsh Hills. The walk starts from the RSPB Ribble Discovery Centre at Fairhaven Lake. The centre is a great place to learn about the birds that visit the lake and estuary. You can park at the lakeside car park or catch a train to the nearby Ansdell and Fairhaven train station. The route then follows the lakeside path towards Granny's Bay before picking up the Lancashire Coastal Way to take you to Lytham. You can follow the nice surfaced footpath or take an alternative route through the sand dunes. You continue along the promenade to Lytham where you can take a small detour to the pretty Lowther Gardens. Here you'll find attractive woodland, a rose garden and a pond with a statue and fountain. After crossing the road to the sea front you continue to the iconic Lytham windmill. The mill was built at the beginning of the 19th century and is open to the public in the summer months. It contains a museum which explains the history and practice of flour milling. After leaving the mill you can enjoy a stroll along Lytham jetty. It's quite a long jetty and at low tide you can walk right to the end and enjoy an even better view of the birdlife in the estuary. Look out for herons, curlew, redshank, shellduck and dunlin. The walk then returns to the fairhaven lake car park the same way. To extend your walking in this lovely area you can continue along the Lancashire Coastal Way in either direction. Heading east will take you along the River Ribble towards Warton and Freckleton. This section has nice views over the river and surrounding countryside with birds such as Lapwing and Little Egret to look out for. There's also lots of wildflowers in the summer which attract butterflies and other birds. If you head west you will come to St Annes and Blackpool. Also nearby is the delightful Lytham Hall. The old hall is surrounded by attractive woodland and parkland with nice footpaths to follow around the site.",
  "video_url": "https://www.youtube.com/embed/ykKwNrzonwo",
  "postcode": "FY8 1BD",
  "district": "Lytham St Anne's",
  "county": "Lancashire",
  "region": "North West",
  "country": "England"
}