{
  "created_at": "2025-01-06T01:53:08.812916+00:00",
  "objectID": "4e6979b8f48359cc89c559c237f4e75f",
  "ref": "kingley-vale-national-nature-reserve-walking-route",
  "title": "Kingley Vale Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/13/Yew_woods%2C_Kingley_Vale_-_geograph.org.uk_-_763626.jpg",
  "nearby": [
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Stansted Park",
      "objectID": "f8696125872eaec13b75a3d0cd41035f",
      "ref": "stansted-park-walking-route"
    },
    {
      "description": "Chichester Canal",
      "objectID": "1e8bcd65c69dc75467ac241ecc43c213",
      "ref": "chichester-canal-walking-route"
    },
    {
      "description": "Chichester Harbour",
      "objectID": "4533e7ff5a4e6194eb25a8f820743ee4",
      "ref": "chichester-harbour-walking-route"
    },
    {
      "description": "West Dean and East Dean",
      "objectID": "fbfc85678a45670a82a28c7c1406388e",
      "ref": "west-dean-and-east-dean-walking-route"
    },
    {
      "description": "West Dean Estate",
      "objectID": "03f0bf03fd9ccd8dbd603b23aba39b07",
      "ref": "west-dean-estate-walking-route"
    },
    {
      "description": "South Harting",
      "objectID": "d7e2e4e086cc0fcd2bb82b6e9d321b9a",
      "ref": "south-harting-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4e6979b8f48359cc89c559c237f4e75f.gpx",
  "_geoloc": {
    "lat": 50.8732729756,
    "lng": -0.8297459736
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Yew_woods%2C_Kingley_Vale_-_geograph.org.uk_-_763626.jpg",
      "title": "Jim Champion / Yew woods, Kingley Vale",
      "caption": "Light and shade in a yew wood at Kingley Vale, West Sussex. The black post on the right is a 'nature trail' route marker. The trail leads through the older yews, up through the younger yews on the hillside up to the barrows on Bow Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Footpath_to_West_Stoke_car_park_-_geograph.org.uk_-_763681.jpg",
      "title": "Jim Champion / Footpath to West Stoke car park",
      "caption": "Footpath to West Stoke car park. This footpath leads from Kingley Vale NNR to the public car park at West Stoke, and is lovingly fenced in on both sides with barbed wire. A sign at the far end of the path instructs cyclists to use the bridleway to Kingley Vale (a little further to the west) but the tyre tracks on the path are a sign that the sign is routinely ignored."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/The_Devil%27s_Humps_-_geograph.org.uk_-_9292.jpg",
      "title": "Martyn Pattison / The Devil's Humps",
      "caption": "The Devil's Humps. These are two of four large iron/bronze age barrows atop Bow Hill. On the south side of this hill is an ancient Yew forest, Kingley Vale, a legend tells that this was the burial site of Danish kings killed in battle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/The_Tansley_Stone%2C_Kingley_Vale_-_geograph.org.uk_-_1503530.jpg",
      "title": "Simon Huguet / The Tansley Stone, Kingley Vale",
      "caption": "The Tansley Stone. The vale is a Site of Special Scientific Interest and National Nature Reserve, renowned for its groves of yew trees and the species rich scrub and chalk grassland in between. Taken on the top of the Reserve this stone commemorates Sir Arthur Tansley, an English botanist and a pioneer in the science of ecology."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Sunken_lane%2C_Kingley_Vale_-_geograph.org.uk_-_1503612.jpg",
      "title": "Simon Huguet / Sunken lane, Kingley Vale",
      "caption": "Sunken lane. Under the dense and interlocking yew trees little or nothing grows, and with little to attract birds or animals those parts of the woods have an eerie stillness."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Kingley_Vale_-_geograph.org.uk_-_1503550.jpg",
      "title": "Simon Huguet / Kingley Vale",
      "caption": "View from the vale. Looking towards Chichester from the footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Kingley_Vale_-_geograph.org.uk_-_1503510.jpg",
      "title": "Simon Huguet / Kingley Vale",
      "caption": "Taken from the top of the Reserve from near the Tansley Stone looking across the site towards West Stoke with Fareham and the English Channel beyond in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Main_entrance_to_Kingley_Vale_Nature_Reserve_-_geograph.org.uk_-_1095982.jpg",
      "title": "Shazz / Main entrance to Kingley Vale Nature Reserve",
      "caption": "Main entrance to the reserve. The wooden sculpture and information hut are here."
    }
  ],
  "distance_km": 7.0,
  "description": "Enjoy a walk around this interesting and beautiful Nature Reserve in the South Downs, near Chichester. There are well defined paths with fabulous views over the South Downs towards the south coast. The reserve also contains one of the finest yew forests in Europe, including a grove of ancient trees which are among the oldest living things in Britain. If you have time you could continue your walk west along the Monarch's Way to Stoughton where you can buy refreshments at the local pub. Near you will find Stansted Park where you will find a fine 1800 acre park surrounding the Edwardian Stansted House. It's a great place to extend your walk with nice trails to follow around the park and through the adjacent Stansted Forest.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Horse and Groom is located just to the south of the car park in the village of East Ashling. The 17th century pub is housed in an historic former blacksmith’s shop. There's a charming interior with a number of decorative items including a striking metre-high bronze horse and jockey sculpture in the entrance hall, an 1840 chestnut serving table from the mountainous area of Andalusia in southern Spain, and an apple green baker’s counter bar that was bought from the Cognac region of France. They serve good quality food in the dining room which includes a number of early 20th century paintings and contemporary art. Outside there's also a lovely garden area for warmer days. You can find them at postcode PO18 9AX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The vale is a splendid place for a dog walk so expect to see other owners on your visit. The Horse and Groom mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south east from the site and you will soon come to the delightful town of Chichester. Here you can pick up the Chichester Canal Walk and the Chichester Harbour Walk. Just to the east of the site you could pick up the Centurion Way. This easy shared cycling and walking trail runs along the old Midhurst and Chichester railway to Chichester via the River Lavant Valley. Head north and you could visit a splendid viewpoint at Harting Down. There's also the nearby village of South Harting where you could pay a visit to the National Trust's Uppark. Here you'll find a fine 17th century Georgian House surrounded by lovely gardens with views of the English Channel. The author H.G Wells stayed in the house during the late 19th century. The class divisions he observed here inspired his socialist views which later manifested themselves in work such as 'The Time Machine'. You can find the house at postcode GU31 5QR. For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/riXKKW3TUKw",
  "postcode": "PO18 9BE",
  "district": "West Stoke",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}