{
  "created_at": "2025-01-06T03:40:23.369059+00:00",
  "objectID": "4ec25792c59af617651075d4b11f0f18",
  "ref": "wrexham-walking-route",
  "title": "Walk Around Wrexham Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Afon_Clywedog_in_Erddig_Park_-_geograph.org.uk_-_51774.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4ec25792c59af617651075d4b11f0f18.gpx",
  "_geoloc": {
    "lat": 53.036509639,
    "lng": -3.007269563
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Afon_Clywedog_in_Erddig_Park_-_geograph.org.uk_-_51774.jpg",
      "title": "John Haynes / Afon Clywedog in Erddig Park",
      "caption": "Afon Clywedog in Erddig Park. The Afon Clywedog flows through the National Trust property by Wrecsam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Erddig_%22_Cup_and_Saucer_%22_-_geograph.org.uk_-_1550049.jpg",
      "title": "Geoff Evans / Erddig \" Cup & Saucer \"",
      "caption": "Erddig \" Cup & Saucer \" The lower part of the Hydraulic Ram which provided water for the Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/The_Old_Rectory_near_Marchwiel_Hall_-_geograph.org.uk_-_65686.jpg",
      "title": "John Haynes / The Old Rectory near Marchwiel Hall",
      "caption": "The Old Rectory near Marchwiel Hall. Huge house that was a reflection of the stipend of the rector in this parish."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Bryn-y-grog_farm_and_Marchwiel_reservoir_earthworks_-_geograph.org.uk_-_65655.jpg",
      "title": "John Haynes / Bryn-y-grog farm & Marchwiel reservoir earthworks",
      "caption": "Bryn-y-grog farm & Marchwiel reservoir earthworks. Bryn-y-grog farm and Hall are now an \"Antiques Centre\", also in the left of the picture can be seen the earthworks for Marchwiel reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/The_Kings_Mill_Wrecsam_-_geograph.org.uk_-_65631.jpg",
      "title": "John Haynes / The Kings Mill Wrecsam",
      "caption": "The Kings Mill Wrecsam"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Hafod_Wood_within_Erddig_Park_near_Wrecsam_-_geograph.org.uk_-_65680.jpg",
      "title": "John Haynes / Hafod Wood within Erddig Park near Wrecsam",
      "caption": "Hafod Wood within Erddig Park near Wrecsam. The wood is part of the National Trust Erddig Estate and is \"in hand\". Work is being carried out within the wood to ensure that the mature trees are slowly replaced with regenerated tree saplings so that the wood will be there for my great Grandchildren."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Bridge_over_the_Clywedog_-_geograph.org.uk_-_1704188.jpg",
      "title": "Geoff Evans / Bridge over the Clywedog",
      "caption": "Bridge over the Clywedog. The river crossing to Y Ddol."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Church_Street%2C_Wrexham_%28geograph_3755262%29.jpg",
      "title": "Richard Hoare / Church Street, Wrexham",
      "caption": "Church Street, Wrexham"
    }
  ],
  "distance_km": 8.0,
  "description": "This circular walk explores the countryside to the south of Wrexham. On the way you'll enjoy riverside trails and a visit to the National Trust's Erddig Hall and Country Park. The walk starts at the public car park at Felin Puleston at the south western edge of the town, on the Ruabon Road. From here you can pick up public footpaths heading south and then east around Erdigg Park.The 1,200-acre estate is one of the highlights of the area. It surrounds the historic 18th century Erddig Hall and includes peaceful woodland and pretty gardens. The trails will then take you east past Marchwiel Hall before turning north to pass Marchwiel Reservoir. Eventually you come to the old King's Mills where you pick up the Clywedog Trail. This waymarked walking trail will take you west along the river to return you to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kings Mills pub is located on the route at the north eastern tip. They do very good food and have a nice outdoor area if the weather is good. You can find the pub at a postcode of LL13 0NS."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a great dog walk. In Erddig Park there are some areas with livestock so please keep them on a lead here."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Wrexham continue west along the Clywedog Trail to visit Nant Mill Country Park. There's nice woodland trails and a visitor centre named after the historic corn mill located at the site. The trail will take you all the way to the Minera Lead Mines and Country Park. The park includes a museum detailing the interesting industrial past of the Clywedog Valley. Also of interest is the delightful Alyn Waters Country Park, the historic Chirk Castle and the expansive woodland at Llandegla Forest. Near here you'll find Nant-y-Ffrith where there's a splendid wooded gorge with streams, caves and a significant waterfall. Head a few miles south of the town and you can visit another major highlight of the area at the Pontcysyllte Aqueduct. It's the longest and highest aqueduct in Britain and includes waterside walking along the Llangollen Canal. In the town a visit to the Grade I listed St Giles' Church is recommended. The 14th century building is 180-feet long, and the largest medieval Parish Church in Wales. It includes a magnificent tower with ornate medieval carvings including those of an arrow and a deer, the attributes of Saint Giles. It is traditionally regarded as one of the Seven Wonders of Wales. To the east there's the interesting village of Farndon. The village includes a noteworthy medieval bridge which spans the River Dee, connecting England to Holt in Wales. The Bishop Bennet Way and the Marches Way run past the settlement."
    }
  ],
  "postcode": "LL13 7RF",
  "district": "Wrexham",
  "county": "Wrexham",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Felin Puleston Outdoor Centre, Ruabon Road, Puleston Industrial Estate, Offa, Wrexham, Cymru / Wales, LL13 7RF, United Kingdom",
  "state": "Cymru / Wales"
}