{
  "created_at": "2025-01-06T03:35:12.695461+00:00",
  "objectID": "4efa64d62ebcd5313a1463ad7df62014",
  "ref": "midshires-way-walking-route",
  "title": "Midshires Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Salcey_Forest_-_geograph.org.uk_-_88201.jpg",
  "nearby": [
    {
      "description": "Shining Tor and Cats Tor",
      "objectID": "c48873bb2cdf8510bf5b66effb7c04ad",
      "ref": "shining-tor-and-cats-tor-walking-route"
    },
    {
      "description": "Hanslope Circular Ride",
      "objectID": "2b0aa8df1c7ec43f97cba465cac03e5e",
      "ref": "hanslope-circular-ride-walking-and-cycle-route"
    },
    {
      "description": "Milton Keynes to Northampton",
      "objectID": "cd786dc83acd162da9d9ccc80d36cdc8",
      "ref": "milton-keynes-to-northampton-cycle-route"
    },
    {
      "description": "The Swan's Way",
      "objectID": "4eec1bda3116fb5ff4bbadfb29314104",
      "ref": "the-swans-way-walking-and-cycle-route"
    },
    {
      "description": "Salcey Forest",
      "objectID": "79b3ae7b0c34b7c1854fb5eef2c86c5b",
      "ref": "salcey-forest-walking-and-cycle-route"
    },
    {
      "description": "Waddesdon Manor",
      "objectID": "765e8c2fb65160597c46f356bdd2f87e",
      "ref": "waddesdon-manor-walking-route"
    },
    {
      "description": "Arbor Low",
      "objectID": "2333e94a5e373ff76e46ed761173e6ae",
      "ref": "arbor-low-walking-route"
    },
    {
      "description": "Vernon and Woodbank Park",
      "objectID": "35e8c2d70587f75ca9493782377fcff1",
      "ref": "vernon-and-woodbank-park-walking-route"
    },
    {
      "description": "Peak Forest Canal",
      "objectID": "58bd76853a36b9a324b3b4952d4ee4a5",
      "ref": "peak-forest-canal-walking-route"
    },
    {
      "description": "Around Belper",
      "objectID": "31e8995f65a3684fb7f10cd5eea3ff66",
      "ref": "around-belper-walking-route"
    },
    {
      "description": "Harlestone Firs Forest Walk",
      "objectID": "f9a8f88833bfe3b3a31057028a5c0a98",
      "ref": "harlestone-firs-forest-walk-walking-route"
    },
    {
      "description": "Bledlow Ridge",
      "objectID": "fcd4cfcc4004fee505739725d2174555",
      "ref": "bledlow-ridge-walking-route"
    },
    {
      "description": "The Ridgeway",
      "objectID": "2384cde76809687efb1a502a57345f61",
      "ref": "the-ridgeway-walking-route"
    },
    {
      "description": "Kegworth",
      "objectID": "04863232c16407064a0a524946dadd07",
      "ref": "kegworth-walking-route"
    },
    {
      "description": "Aylesbury Ring",
      "objectID": "7341401f0c1ececc44346b20fdc92dc9",
      "ref": "aylesbury-ring-walking-route"
    },
    {
      "description": "Brassington",
      "objectID": "c6c406c05a7d6c5db26a8d4c6fc44ecd",
      "ref": "brassington-walking-route"
    },
    {
      "description": "Pennine Cycleway",
      "objectID": "e0c353fccc4ac5dbe93a976156f9c8e2",
      "ref": "pennine-cycleway-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4efa64d62ebcd5313a1463ad7df62014.gpx",
  "_geoloc": {
    "lat": 51.7044689266,
    "lng": -0.887071847
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Salcey_Forest_-_geograph.org.uk_-_88201.jpg",
      "title": "John Eggins / Salcey Forest, via Wikimedia Commons",
      "caption": "Salcey Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Sawley_Marina_-_geograph.org.uk_-_585458.jpg",
      "title": "J147 / Sawley Marina, via Wikimedia Commons",
      "caption": "Sawley Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Church_Lane%2C_Morley_-_geograph.org.uk_-_866032.jpg",
      "title": "Jonathan Billinger / Church Lane, Morley",
      "caption": "Church Lane, Morley. The lane continues east past Spring Oak Farm as part of both the Midshires Way and the Centenary Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Midshires_Way_-_geograph.org.uk_-_422674.jpg",
      "title": "Jonathan Billinger / Midshires Way",
      "caption": "Midshires Way. A route linking southern and northern England, connecting the Ridgeway in the Chilterns with the Trans Pennine Trail on the edge of the Pennines via historic estates, farmland and the Peak District National Park. This section in Northamptonshire is near Roade. The plants on the left are the notorious Japanese Knotweed, which the farmer needs to get on and spray!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/The_Midshires_Way_-_geograph.org.uk_-_208443.jpg",
      "title": "Kokai / The Midshires Way",
      "caption": "This section of the path is through Harlestone Heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Path_to_Bunny_old_Wood_on_The_Midshires_Way_-_geograph.org.uk_-_1335415.jpg",
      "title": "Andy Jamieson / Path to Bunny old Wood on The Midshires Way",
      "caption": "Path to Bunny old Wood near Wysall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Parsley_Hay_Car_Park_-_View_of_Midshires_Way_-_geograph.org.uk_-_723057.jpg",
      "title": "Alan Heardman / Parsley Hay Car Park - View of Midshires Way",
      "caption": "Parsley Hay village car park with a view of the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Bridge_Lodge_at_Eythrope%2C_from_the_Midshires_Way_-_geograph.org.uk_-_1494307.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridge Lodge at Eythrope. Eythrope is a hamlet and country house - the Eythrope Pavilion - located to the south east of the village of Waddesdon. The hamlet name is Anglo Saxon in origin, and means \"island farm\", referring to an island in the River Thame that flows by the hamlet. The architect of this fine country house was probably George Devey (1820\u00961886), a specialist in lodges, cottages and country mansions, whose distinctive style included the use of tiles and timbering on external walls. A favourite architect of the Rothschilds, he received numerous commissions from family members (as did fellow architect William Huckvale at Tring, another practitioner of tiles and timbering)."
    }
  ],
  "distance_km": 362.0,
  "description": "This route follows public bridleways and quiet country lanes through Middle England, from Bledlow, near Aylesbury in Buckinghamshire, to Stockport in Greater Manchester. The path links The Ridgeway National Trail with the Trans Pennine Trail passing through the countryside of Buckinghamshire, Northamptonshire, Leicesteshire, Nottinghamshire and the Derbyshire Peak District National Park. Highlights include waterside sections along the Grand Union Canal, the Peak Forest Canal and the River Ouse. There is a splendid wooded section through Salcey Forest near Northampton where you could try the Tree Top Trail. There are also terrific views of the Derbyshire Dales, and a lovely section around Fernilee Reservoir and Errwood Reservoir in the Peak District. The walk is waymarked with a white disc featuring two acorns.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "We recommend stopping for refreshments at the delightful Sawley Bridge Marina. The marina is notable as the largest Inland Marina in the United Kingdom with a water space of 23 acres. It's a lovely spot with lots of boats and a nice cafe. The cafe has a good menu and outdoor seating with views of the marina. Near Northampton you could stop off in Lower Harlestone at the Fox and Hounds. The main draw here is a lovely country pub garden where you can sit outside on warmer days. Inside there's a warm and spacious interior serving great gastro pub food. You can find them at a postcode of NN7 4EW for your sat navs. In the pretty village of Kegworth you'll pass along a delightful canalised section of the River Soar. Next to the river there's the The Anchor Inn for a pit stop. They serve good quality food and have some outdoor seating for warmer weather. You can find them on Station Road at postcode DE74 2FR your sat navs. In Quainton you could stop off at the The George and Dragon. The 18th century pub has a charming interior with a quarry tiled floor, inglenook fireplaces and beams. Outside there's a nice garden area overlooking the village green and windmill. You can find them next to the green at postcode HP22 4AR for your sat navs. The settlement is also worth exploring an old windmill, a picturesque village green, a 14th century church and a row of 17th century almshouses. To the north of the village there's also an excellent viewpoint at Quainton Hill which the route crosses. Slightly off the trail in Derbyshire there's the worthy village of Brassington where you'll find the Olde Gate Inn. The historic inn dates back to the 17th century and is Grade II listed. Bonnie Prince Charlie’s soldiers were billeted at the inn on their march to London, and some of the oak beams came from ships of the Spanish Armada. It's been named Britain’s cosiest pub by The Times with its charming interior and roaring fires. Outside there's a lovely large garden area with fine views. They serve high quality gastro food and have a good selection of ales. You can find them on Well Street with a postcode of DE4 4HJ​ for your sat navs. The attractive village is a pleasant place for a stroll too, with several centuries old limestone cottages, a church dating from the Norman period and a notable Tudor house built in 1615. In Chelmorton there's the Church Inn. The fine stone pub dates back to 1742 and sits opposite the village church which dates from the 11th century. There's roaring open fires in the winter, a beautiful sun trap of a beer garden and patio for summer al fresco dining. You can find them at postcode SK17 9SL for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Northampton the Way passes through the noteworthy Harlestone Firs Forest Walk. This popular woodland area contains miles of peaceful trails on Lord Spencer's Althorp Estate. Near the woods you can also visit Althorp House, the childhood home of Princess Diana. Here you can learn about 500 years of history and explore the beautiful grounds and gardens. The house is just slightly north of the trail as you pass through Harlestone village. Around Eythrope you can pick up the circular Haddenham Walk which uses part of the Aylesbury Ring and the Thame Valley Walk to visit Dinton, Nether Winchendon and Cuddington. The route starts from Haddenham where there's a pretty duck pond, a fine old church and quaint thatched cottages to see. The route passes along part of the epic Pennine Cycleway which can be used to further extend your outing."
    }
  ],
  "county": "Oxfordshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}