{
  "created_at": "2025-01-06T01:32:38.039367+00:00",
  "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
  "ref": "sussex-border-path-walking-route",
  "title": "Sussex Border Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/The_Sussex_Border_Path_-_geograph.org.uk_-_11010.jpg",
  "nearby": [
    {
      "description": "Bewl Water",
      "objectID": "e016f27e7e61d59b93cae067b96b5347",
      "ref": "bewl-water-walking-and-cycle-route"
    },
    {
      "description": "Serpent Trail",
      "objectID": "98f5c162ad30cbe58662827924002061",
      "ref": "serpent-trail-walking-route"
    },
    {
      "description": "Black Down",
      "objectID": "d13d828818d1e801d378aaf4cb507128",
      "ref": "black-down-walking-and-cycle-route"
    },
    {
      "description": "Weir Wood Reservoir",
      "objectID": "0b309b378313695321c3294d557de7ca",
      "ref": "weir-wood-reservoir-walking-route"
    },
    {
      "description": "Bodiam Castle",
      "objectID": "3fabf07f813132bc1f97724d49e0d4fa",
      "ref": "bodiam-castle-walking-route"
    },
    {
      "description": "Marley Common",
      "objectID": "fe2aafb35f896af21adbfe47446ff1c8",
      "ref": "marley-common-walking-route"
    },
    {
      "description": "Liss",
      "objectID": "8babad3e7ee63144b35134ad4cadb1e5",
      "ref": "liss-walking-route"
    },
    {
      "description": "Tandridge Border Path",
      "objectID": "d459ddbfee9908a6fe4cf5b6a6b742c6",
      "ref": "tandridge-border-path-walking-route"
    },
    {
      "description": "South Harting",
      "objectID": "d7e2e4e086cc0fcd2bb82b6e9d321b9a",
      "ref": "south-harting-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4f7a4ec8abc2fadf21d3ae98a91fb943.gpx",
  "_geoloc": {
    "lat": 50.8462084779,
    "lng": -0.9295609579
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/The_Sussex_Border_Path_-_geograph.org.uk_-_11010.jpg",
      "title": "Martyn Pattison / The Sussex Border Path",
      "caption": "This was taken looking North near Durleigh Marsh farm. the Sussex/Hampshire border is about 1 mile to the West (left). There are arable farm fields on both sides of the path, with woodland about 1km straight ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Towards_South_hill_-_geograph.org.uk_-_388599.jpg",
      "title": "Peter Cox / Towards South hill",
      "caption": "Towards South hill. Taken from the Path this looks down the valley towards the A23 and the Pylons. The chalk track leading up from the Pylons, past South hill farm, can be seen centre top. The remains (one wall) of North heath barn are just to the left of the image."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Sussex_Border_Path_-_geograph.org.uk_-_1524647.jpg",
      "title": "Colin Smith / Sussex Border Path",
      "caption": "Fingerposts on the trail. Wide track with clay surface passing through the southern edge of Downlands Wood, mainly deciduous trees with many beech, oak and sweet chestnuts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Sussex_Border_Path_-_geograph.org.uk_-_1445928.jpg",
      "title": "Simon Carey / Sussex Border Path",
      "caption": "Grassy footpath running through an unnamed field north of Ditchling."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Sussex_Border_Path_-_geograph.org.uk_-_1518792.jpg",
      "title": "Colin Smith / Sussex Border Path",
      "caption": "Leaving the residential area of Durfold Wood. This is in a relatively unpopulated part of the Low Weald."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Sussex_Border_Path_-_geograph.org.uk_-_225710.jpg",
      "title": "Nigel Freeman / Sussex Border Path",
      "caption": "This is near the Hunters Lodge Fisheries lakes. The Sussex Border Path follows the inland border of Sussex from Thorney Island on the coast near Chichester to Rye in East Sussex."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Sussex_Border_Path_-_geograph.org.uk_-_1640375.jpg",
      "title": "Simon Carey / Sussex Border Path",
      "caption": "Running along the right hand side of the field on the western side of East Hill with the northern slope of Varncombe Hill in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Sussex_Border_Path_-_geograph.org.uk_-_1628557.jpg",
      "title": "Simon Carey / Sussex Border Path",
      "caption": "Heading north west from the crossroads of bridleways on Varncombe Hill. The grid square ends beyond the first line of bushes in the distance which also marks the northern administrative boundary of Brighton & Hove council. The path heads to Saddlescombe which lies in a dip beyond the next hill whilst a line of bushes on the left marks the course of Saddlescombe Road."
    }
  ],
  "distance_km": 220.0,
  "description": "A fabulous long distance walk following the Sussex county border from Thorney Island in West Sussex to Rye in East Sussex. You begin on Thorney Island with a lovely section along the coast from Emsworth. The route then heads through the South Downs to South Harting and Liphook before continuing to Gospel Green, Rudgwick, Gatwick Airport, Horley and East Grinstead. You then head through the beautiful High Weald, passing Groombridge, Bewl Water and Northiam before finishing in Rye. The walk is well waymarked throughout. Route highlights include a climb to the highest point on the South Downs at Black Down in West Sussex. You'll also visit the lovely Weir Wood Reservoir and the interesting Bodiam Castle .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In East Grinstead The Ship Inn is a good choice for a pit stop. They do very good food and have an attractive interior with a cosy fire for cold days. If the weather is fine there's a nice terraced garden outside too. You can find the pub on Ship Street at a postcode of RH19 4EG for your sat navs. In Horley, near Gatwick airport, you'll find one of the oldest pubs in the country at Ye Olde Six Bells. It dates from the early 15th century and is located in a lovely spot next to the River Mole. Inside there's a cosy beamed interior with a large inglenook fireplace, stone flags and low beams. The pub rests on wooden piles, some of which date from the year 827. They serve country pub classics and also have a nice riverside garden area to relax in on warmer days. They are dog friendly and you can find them on Church Road with a postcode of RH6 8AD for your sat navs. The pretty village of Horsted Keynes includes a notable Grade I listed church and a fine old pub in the shape of The Green Man. The historic pub is located in a lovely spot next to the village green. They serve a lovely Sunday roast and have a nice outdoor seating area for warmer weather. You can find them at postcode RH17 7AS for your sat navs. In Hassocks there's the Friar's Oak, which is a former coaching inn of some note. The Tudor style pub is nicely situated overlooking a golf course, and named after a large oak tree where monks used to give out alms. It was also used by Sir Arthur Conan Doyle as the setting for his novel Rodney Stone. They serve good quality food and have a nice garden area for warmer weather. You can find them at London Road with postcode BN6 9NA. The village also has a train station so is a good spot for accessing part of the trail by public transport. In Liphook there's the 17th century Deers Hut to investigate. The historic pub is set in a former Queen Anne Hunting Lodge dating back to the 1600's. They serve a delicious Sunday lunch and have a lovely garden to sit out in on warmer days. You can find them at Longmoor Rd, Griggs Green, GU30 7PD."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The trail links up with the Tandridge Border Path around East Grinstead. The long distance circular walk explores the Tandridge District on a waymarked footpath."
    }
  ],
  "postcode": "PO10 8AU",
  "district": "Chichester",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Sussex Brewery, 36, Main Road, Hermitage, Southbourne, Chichester, West Sussex, England, PO10 8AU, United Kingdom",
  "state": "England"
}