{
  "created_at": "2025-01-06T01:11:13.891675+00:00",
  "objectID": "4fa5171c1fc893f0e489624cae535e9a",
  "ref": "queens-view-loch-tummel-walking-route",
  "title": "Loch Tummel Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Queen%27s_View%2C_Loch_Tummel_-_geograph.org.uk_-_9404.jpg",
  "nearby": [
    {
      "description": "Falls of Bruar",
      "objectID": "99a75c263a38da2fa755640bdd088581",
      "ref": "falls-of-bruar-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4fa5171c1fc893f0e489624cae535e9a.gpx",
  "_geoloc": {
    "lat": 56.7167607582,
    "lng": -3.8600020032
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Queen%27s_View%2C_Loch_Tummel_-_geograph.org.uk_-_9404.jpg",
      "title": "Anne Burgess / Queen's View, Loch Tummel, via Wikimedia Commons",
      "caption": "Queen's View, Loch Tummel. Unlike most of the other Queen's Views, this one didn't get its name from Queen Victoria. It is said to have been a favourite view of Queen Isabella, first wife of King Robert the Bruce. In her day, however, there was no loch - Loch Tummel was created by a hydro-electric dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Queens_View_-_Loch_Tummel.jpg",
      "title": "Val Vannet, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "This view west along Loch Tummel is a popular beauty spot. Queen Victoria picnicked here on 3rd October 1866 and records her appreciation of the view in her diary. However, the view she admired was not this one! The construction of nearby Clunie Dam for HEP generation resulted in the level of the Loch rising considerably in the post Victorian period. The conical mountain in the distance is Schiehallion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/The_Queen%27s_View%2C_Loch_Tummel%2C_taken_1965_-_geograph.org.uk_-_744724.jpg/512px-The_Queen%27s_View%2C_Loch_Tummel%2C_taken_1965_-_geograph.org.uk_-_744724.jpg",
      "title": "Christine Matthews / The Queen's View, Loch Tummel, taken 1965, via Wikimedia Commons",
      "caption": "Black and white photo taken in 1965 from the viewpoint. One of the outstanding beauty spots in all of Scotland is the Queen\u0092s View where a panorama of lake and mountain scenery stretches westwards as far as the Glen Coe hills, on clear days. Unfortunately it was misty when this image was taken"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Ring_Fort_Allean_Forest_-_geograph.org.uk_-_50303.jpg",
      "title": "Bob Allan / Ring Fort Allean Forest, via Wikimedia Commons",
      "caption": "Ring Fort Allean Forest. Looking from Ring Fort in Allean forest, Perthshire towards Schiehallion."
    }
  ],
  "distance_km": 6.0,
  "description": "Visit Queen's View for one of the best views in Britain on this short walk in Perthshire, Scotland. The viewpoint overlooks the beautiful Loch Tummel with the mountain of Schiehallion making a wonderful backdrop. Queen Victoria made the area famous in 1866 when she visited with her servant John Brown. After strolling along the viewpoint you can extend your walk by exploring the woodland trails in Allean Forest. Here you'll find attractive woodland, sculptures and pretty flowers such as fox gloves and sorrell flowers. The surrounding Tay Forest Park is huge so there is plenty to explore in the area. As well as the miles of woodland trails the park include several pretty lochs including Loch Bhac and Lochan Nan Nighean. The area also includes a cafe, Forest Park information centre and picnic tables. If you'd like to explore Loch Tummel by bike then you could follow the nice country lane on the southern side of the water.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The excellent visitor centre has a nice cafe where you can relax after your walk. There's a good menu and outdoor seating for fine days."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a few miles to the north there's another major local highlight at the stunning Falls of Bruar. The lovely wooded gorge includes beautiful waterfalls, several deep black pools, stone bridges, viewpoints and picnic spots. There's also the House of Bruar department store where there's an excellent food hall for refreshments. To the east there's the Linn Of Tummel, a picturesque spot at the confluence of the rivers Garry and Tummel. The National Trust owned area has some nice woodland trails with pine martens and other wildlife to look out for. To the south west you can explore the beautiful and peaceful Glen Lyon. The route takes you along the River Lyon to Loch Lyon with a visit to the lovely post office cafe in Bridge of Balgie at the start."
    }
  ],
  "video_url": "https://www.youtube.com/embed/R-1s9oRKkYM",
  "postcode": "PH16 5NR",
  "county": "Perth and Kinross",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B8019, Perth and Kinross, Alba / Scotland, PH16 5NR, United Kingdom",
  "district": null,
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake"
  ],
  "points_of_interest": [
    "sculptures",
    "flower gardens",
    "mountain views"
  ],
  "facilities": [
    "cafe",
    "visitor center",
    "picnic tables"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}