{
  "created_at": "2025-01-06T00:15:20.939973+00:00",
  "objectID": "4fb0ed5cf4147af0231ae663ddce946a",
  "ref": "colwyn-bay-walking-route",
  "title": "Colwyn Bay Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/71/Colwyn_Bay_-_geograph.org.uk_-_1415845.jpg",
  "nearby": [
    {
      "description": "Little Orme",
      "objectID": "44352f1015b1306dd3018acc7b9a8590",
      "ref": "little-orme-walking-route"
    },
    {
      "description": "North Wales Path",
      "objectID": "a4a9223258d8388fae4cf17727878867",
      "ref": "north-wales-path-walking-route"
    },
    {
      "description": "Great Orme Country Park",
      "objectID": "1c72b4e22941355f32aeff3b75327266",
      "ref": "great-orme-country-park-walking-route"
    },
    {
      "description": "Abergele",
      "objectID": "56987e6710470ff6dc5837f8df572ae6",
      "ref": "abergele-walking-route"
    },
    {
      "description": "Llanfair Talhaiarn",
      "objectID": "974d04d34e90dce7c96563da9c2cdac4",
      "ref": "llanfair-talhaiarn-walking-route"
    },
    {
      "description": "Gwrych Castle",
      "objectID": "d0bb825e96393d829f5bc15116c47268",
      "ref": "gwrych-castle-walking-route"
    },
    {
      "description": "Rhyd y Foel",
      "objectID": "46071f0121cc97ad8c4cdc0997db81a5",
      "ref": "rhyd-y-foel-walking-route"
    },
    {
      "description": "Llannefydd",
      "objectID": "f18cb20cbd8442ae6e10561bcb338493",
      "ref": "llannefydd-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/4/4fb0ed5cf4147af0231ae663ddce946a.gpx",
  "_geoloc": {
    "lat": 53.2971037702,
    "lng": -3.7252967455
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Colwyn_Bay_-_geograph.org.uk_-_1415845.jpg",
      "title": "Bob Abell / Colwyn Bay, via Wikimedia Commons",
      "caption": "Colwyn Bay. From Eirias Park Showing the pier, with Rhos on Sea behind and the Great and Little Ormes in the far distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Farmland_above_Colwyn_Bay_-_geograph.org.uk_-_217896.jpg",
      "title": "Terry Hughes / Farmland above Colwyn Bay, via Wikimedia Commons",
      "caption": "Farmland above Colwyn Bay. Sheep grazing in a field Southwest of Llanelian-yn-Rhos taken from grid reference SH 85322 76274. Old Colwyn can be seen in the distance to the Northeast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Colwyn_Bay_-_geograph.org.uk_-_1055314.jpg",
      "title": "Graham Taylor / Colwyn Bay, via Wikimedia Commons",
      "caption": "Colwyn Bay The beach, Victoria Pier, seating on the promenade, and the photographers shadow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Rhos_on_Sea_-_geograph.org.uk_-_1055372.jpg",
      "title": "Graham Taylor / Rhos on Sea, via Wikimedia Commons",
      "caption": "Rhos on Sea. The promenade and 'The Cayley' refreshment kiosk. Notice the double rainbow on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/View_SE_from_Little_Orme_-_geograph.org.uk_-_425583.jpg",
      "title": "Bryn Roberts / View SE from Little Orme, via Wikimedia Commons",
      "caption": "View SE from Little Orme SE view which includes Penrhyn Bay, Rhos Point and Colwyn Bay. Mynydd Marian (Llysfaen) is also seen beyond Colwyn Bay, with the Clwydian Hills in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Mochdre_from_Bryn_Euryn_-_geograph.org.uk_-_823230.jpg",
      "title": "Terry Hughes / Mochdre from Bryn Euryn, via Wikimedia Commons",
      "caption": "Mochdre from Bryn Euryn. A southwesterly view of the town of Mochdre from near the summit of Bryn Euryn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Bryn_Euryn_Trig_Pillar_-_geograph.org.uk_-_822687.jpg",
      "title": "Terry Hughes / Bryn Euryn Trig Pillar, via Wikimedia Commons",
      "caption": "Bryn Euryn Trig Pillar. The Bryn Euryn Triangulation Pillar looking in a northwesterly direction towards the Great Orme in the far distance.Bryn Euryn is also the site of a sixth century fortification"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Grazing_land_at_Bryn_Euryn_-_geograph.org.uk_-_327646.jpg",
      "title": "Peter Craine / Grazing land at Bryn Euryn, via Wikimedia Commons",
      "caption": "Grazing land at Bryn Euryn Facing the hill at Ffrithuchaf. The village centre right is Gwytherin and the mountains of snowdonia beyond."
    }
  ],
  "distance_km": 16.0,
  "description": "This lovely coastal walk in Colwyn Bay takes you to some of the highlights of this lovely area. You'll vist the beautiful Penrhyn Bay, the wonderful headland of Little Orme, and the splendid viewpoint at the Bryn Euryn Nature Reserve. The route runs for about 10 miles with some flat paths and moderate climbs on the way. The walk starts at the train station in Colwyn Bay where you can pick up the North Wales Path nearby. Follow the waymarked trail north west and it will take you past Rhos on Sea to Penrhyn Bay where there are some beautiful beaches. The route then climbs to Little Orme, the little brother of the more famous Great Orme. On the pretty headland you will find limestone grassland and exposed limestone cliffs formed over 320 million years ago. It's great for flora and fauna with breeding fulmars and rock-rose orchids to look out for on the way. From the elevated position of the headland there are also fabulous views back down to the coast. After rounding the headland the route then descends back to the coast path and heads back to Rhos on Sea. Here you can follow a road west and visit the delightful Bryn Euryn. There's a short climb to the top of the limestone hill where you'll find a 6th century hillfort and fine views over Colwyn Bay below. The site also includes an historic 15th century house, lots of wildflowers in summer and a variety of butterflies to look out for. After exploring the site the route descends back to Rhos before picking up the coast path and returning to Colwyn Bay.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's lots of good options for refreshments in Colwyn Bay. Pen-y-Bryn has a lovely garden with sea views to enjoy. The friendly pub does very good food and has a fine interior with open-fire and vintage decor. You can find the pub on Pen-y-Bryn Road, Upper Colwyn Bay, with a postcode of LL29 6DD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The beaches on the route are a great place to take your dog. Your pooch will also enjoy the climbs as well. The Pen-y-Bryn pub mentioned above is also dog friendly and will provide water and treats!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could head east to Abergele and try our nice circular walk around the town. The walk visits the interesting Gwrych Castle where there's a 19th century house and pretty gardens to explore. On the western side of the castle there's the small village of Rhyd y Foel where you can enjoy a climb to the Pen y Corddyn Mawr hill fort. There's photogenic limestone scenery and more fine views over the River Dulas valley from this interesting ancient site."
    }
  ],
  "postcode": "LL29 8DY",
  "district": "Colwyn Bay",
  "county": "Conwy",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Promenade, Colwyn Bay, Conwy, Cymru / Wales, LL29 8DY, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "limestone"
  ],
  "points_of_interest": [
    "hillfort",
    "historic house",
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}