{
  "created_at": "2025-01-06T03:53:36.692349+00:00",
  "objectID": "c05f9420da1585c8ee021b38920ce490",
  "ref": "tewin-walking-route",
  "title": "Tewin Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Tewin_Village_Green_-_geograph.org.uk_-_141080.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c05f9420da1585c8ee021b38920ce490.gpx",
  "_geoloc": {
    "lat": 51.814748434,
    "lng": -0.1507964404
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Tewin_Village_Green_-_geograph.org.uk_-_141080.jpg",
      "title": "Martin Addison / Tewin Village Green",
      "caption": "Tewin Village Green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/St_Peter%2C_Tewin%2C_Herts_-_geograph.org.uk_-_365742.jpg",
      "title": "John Salmon / St Peter, Tewin, Herts",
      "caption": "St Peter, Tewin, Herts"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Mimram_River_Near_Tewin_-_geograph.org.uk_-_130244.jpg",
      "title": "Melvyn Cousins / Mimram River Near Tewin",
      "caption": "Mimram River Near Tewin"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Tewin%2C_The_village_sign_-_geograph.org.uk_-_1554248.jpg",
      "title": "Nigel Cox / Tewin: The village sign",
      "caption": "Tewin: The village sign. The sign is actually a Millennium commemoration too with the year 2000 prominent in the display. The main feature in the picture on the sign is the River Mimram. The village of Tewin is actually set some distance away and up the valley slopes from the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/River_Mimram_near_Poplars_Green_-_geograph.org.uk_-_1319730.jpg",
      "title": "Nigel Cox / River Mimram near Poplars Green",
      "caption": "River Mimram near Poplars Green. This is a kingfisher's eye view of the Mimram as it gently passes through Poplars Green. The landowner has graciously granted permissive access to the public to the meadows on either side of the river here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Bacon%27s_Farm_-_geograph.org.uk_-_166012.jpg",
      "title": "Steve Bayley / Bacon's Farm",
      "caption": "Bacon's Farm to the east of the village. On the other side of the farmhouse there live a flock of chickens. The eggs are sold from an honesty-box by the gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Bramfieldbury_-_geograph.org.uk_-_166013.jpg",
      "title": "Steve Bayley / Bramfieldbury",
      "caption": "Bramfieldbury. This house may be on the site of the dwelling-house said to have been built by Robert Ware, bursar of St. Albans, at Bramfield. It is generally called Bramfieldbury or Nancy Bury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Westend_Farmland_-_geograph.org.uk_-_228947.jpg/256px-Westend_Farmland_-_geograph.org.uk_-_228947.jpg",
      "title": "Martin Addison / Westend Farmland",
      "caption": "Westend Farmland. Farmland to the south of Bramfield. The oak tree in the foreground has fully developed acorns. Beyond the near boundary, the field has a new crop, possibly winter wheat, growing. The small dot near the centre of the photo is a pair of joggers on the bridleway that cuts diagonally across the field."
    }
  ],
  "distance_km": 17.0,
  "description": "This pleasant Hertfordshire based village is located near Welwyn Garden City and Hertford. The rural settlement is surrounded by woodland and countryside with several waymarked walking trails to explore. The village itself is typical of England with an old Church, two pubs, a village green, a red telephone box and a shop. This route from Tewin uses sections of the Hertfordshire Chain Walk and the Lea Valley Walk to create a circular walk around the village. There's also an optional short detour to visit Hertford Castle. The walk starts in the village and follows a public footpath south east past Lamb Dell Wood, Flexleys Wood and Marden Hill where you pick up the Hertfordshire Chain Walk. Follow the waymarked footpath south east and it will take you to Birch Green, crossing the River Mimram before passing through the woodland around Brocket Hill. At Birch Green you can pick up the Lea Valley Walk and follow it east into Hertford where you can explore the historic castle. The route then retraces its steps to Hertingfordbury where you pass through the village and head north to Blakemore Wood and Lady Hughe's Wood. You continue north west through Selebroom Wood to the expansive Bramfield Park Wood. From here you pick up a country lane to take you past Tewin Hill and return you to the village. Just to the south you can take a small detour to visit Tewin Bury Farm. The hotel estate is well worth a visit with trails along the River Mimram, picturesque gardens, the Tewin Nature Reserve and the Grade I listed St Peter's Church to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rose & Crown is a nice village tavern where you can enjoy some post walk refreshment. The oak-beamed pub serves good quality food and has an excellent selection of real ales. You can find them at Upper Green Rd, AL6 0LE."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails make for a fine dog walk and the Rose and Crown mentioned above is also dofg friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into nearby Welwyn and you could visit the River Lea, Sherrardspark Wood, the Ayot Greenway and the 126 acre Stanborough Park. Just to the north west of the town you will find the noteworthy village of Ayot St Lawrence. The village is notable for its connections with the playwright George Bernard Shaw and is the site of Shaw's Corner, his old residence. There's also a ruined 12th century church and a lovely pub which dates from the 14th century to see here. Near here there's Codicote where you can visit the nearby Hoo Park and enjoy some pretty bluebell woods and a rather fine old bridge over the River Mimram. The village is also very attractive with several timber framed buildings and a historic 16th century pub to admire.  Just to the north there's neighbouring Watton at Stone where you can visit the Woodhall Estate and enjoy riverside trails along the River Beane. For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tM5Q-01FBeA",
  "postcode": "SG14 2NE",
  "district": "East Hertfordshire",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hertford Road, Tewin, East Hertfordshire, Hertfordshire, England, SG14 2NE, United Kingdom",
  "state": "England"
}