{
  "created_at": "2025-01-06T00:17:09.405698+00:00",
  "objectID": "c0fda359d29d5b1e4f913b3211975a1c",
  "ref": "bishops-waltham-walking-route",
  "title": "Bishop's Waltham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/00/Ruined_Palace_at_Bishop%27s_Waltham_-_geograph.org.uk_-_431977.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c0fda359d29d5b1e4f913b3211975a1c.gpx",
  "_geoloc": {
    "lat": 50.9517284314,
    "lng": -1.2160394594
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Ruined_Palace_at_Bishop%27s_Waltham_-_geograph.org.uk_-_431977.jpg",
      "title": "Colin Smith / Ruined Palace at Bishop's Waltham",
      "caption": "Ruined Palace at Bishop's Waltham. Substantial remains from the former Bishop of Winchester's palace are open to visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Bakehouse%2C_Bishop%27s_Palace%2C_Bishops_Waltham_-_geograph.org.uk_-_457949.jpg",
      "title": "Humphrey Bolton / Bakehouse, Bishop's Palace, Bishops Waltham",
      "caption": "This was the bakehouse and brewhouse, built in 1378-81 by Bishop Wykeham and heightened in 1439-41 by Bishop Beaufort."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Pond_near_Bishop%27s_Waltham_Palace_-_geograph.org.uk_-_1358925.jpg",
      "title": "Chris Wimbush / Pond near Bishop's Waltham Palace",
      "caption": "Pond near Bishop's Waltham Palace"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Downland%2C_Upper_Upham_-_geograph.org.uk_-_248620.jpg",
      "title": "Andrew Smith / Downland, Upper Upham",
      "caption": "Downland, Upper Upham. Below is a little copse to the northwest of Aldbourne Warren. Beyond rises Sugar Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/The_Crown_pub%2C_Bishop%27s_Waltham_-_geograph.org.uk_-_226739.jpg",
      "title": "Peter Facey / The Crown pub, Bishop's Waltham",
      "caption": "The Crown pub, Bishop's Waltham. This large pub forms the south end of the High Street. Photographer is standing in Basingwell Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/The_millpond_and_Bishop%27s_Palace_Ruins%2C_Bishop%27s_Waltham_-_geograph.org.uk_-_25006.jpg",
      "title": "Jim Champion / The millpond and Bishop's Palace Ruins, Bishop's Waltham",
      "caption": "The millpond and Bishop's Palace Ruins, Bishop's Waltham. This is the pond that once fed the mill at Bishop's Waltham. The ruins of the Bishop's Palace are in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Bishop%27s_Waltham_Railway_Path_-_geograph.org.uk_-_842748.jpg/256px-Bishop%27s_Waltham_Railway_Path_-_geograph.org.uk_-_842748.jpg",
      "title": "Peter Facey / Bishop's Waltham Railway Path",
      "caption": "Bishop's Waltham Railway Path. View of the tree lined path near the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Remains_of_Bishop%27s_Waltham_to_Botley_branch_railway_line_-_geograph.org.uk_-_842720.jpg",
      "title": "Peter Facey / Remains of Bishop's Waltham to Botley branch railway line",
      "caption": "Remains of Bishop's Waltham to Botley branch railway line. These level crossing gates are within a few yards of Station Roundabout which is built on the site of the former station. A plaque reads \"In 1863 a branch line was opened from Bishop's Waltham to the London and South Western Railway's station at Botley, on the Eastleigh to Fareham line. The branch line was never really viable and, with increasing road competition, passenger trains were withdrawn in January 1933. Goods services lingered on for another 29 years, until the line was closed completely in April 1962\". More recently, the first 1.5 miles of the line south of here has been made into a footpath by the Bishop's Waltham Society and others."
    }
  ],
  "distance_km": 11.5,
  "description": "This Hampshire based medieval market town has some nice walks to try in the surrounding South Downs countryside. This circular walk takes you around Bishop's Waltham on some of the waymarked walking trails that branch off into the surrounding countryside. It runs for about 7 miles and includes some small hill climbs on the way. From the high points there are some lovely views over the South Downs. The walk starts from Bishop's Waltham Palace at the southern end of the town. The atmospheric ruins date all the way back to 1135. From here you can pick up the Allan King's Way and follow the trail south west along the Bishop's Waltham Railway path. This tree lined path runs along a disused railway towards Brooklands Farm where you turn north to the village of Upham. Here you pick up the Monarch's Way and head east toward Street End. Here you turn south to follow public footpaths back to the town, passing Vernon Hill House on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Barleycorn Inn for some refreshments after your walk. They do great food and have a lovely large garden area if the weather is fine. There's a charming interior with low beamed ceilings, white wood paneled walls and vintage local photos. You can find the pub at Lower Basingwell Street with a postcode of SO32 1AJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Barleycorn Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Monarch's Way also runs through the area. You could pick it up and follow it west towards the fantastic Marwell Zoo. The zoo is home to over 1,200 animals of 135 species and located just a few miles north west of the town. The Pilgrim's Trail is another waymarked footpath passing through the town. The historical trail is another fine option for exploring the area around Bishop's Waltham. For a nice pub walk in the area head east to Dundridge and try the Hampshire Bowman and Droxford Walk. The circular walk takes you from the popular pub to the nearby village of Droxford. The 19th century historic pub has a nice garden outdoors and a real fire indoors for colder days. The pub is dog friendly too if you have your canine friend with you. In Droxford you can also pick up the Meon Valley Trail, a shared cycling and walking trail taking you along the River Meon to Wickham, West Meon and Meonstoke. For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SAYKkDknNB4",
  "district": "Bishop's Waltham",
  "county": "Hampshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}