{
  "created_at": "2025-01-05T23:39:23.190178+00:00",
  "objectID": "c105fc1cc5ae62e258222c69386313d0",
  "ref": "brill-walking-route",
  "title": "Brill Windmill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/09/The_village_green%2C_Brill_-_geograph.org.uk_-_1437296.jpg",
  "nearby": [
    {
      "description": "Bernwood Jubilee Way",
      "objectID": "edcc89f3ee45ba3830f4a6b3498272b5",
      "ref": "bernwood-jubilee-way-walking-route"
    },
    {
      "description": "Piddington",
      "objectID": "498d7f7e7fa5a5f050920fdfc52e4172",
      "ref": "piddington-walking-route"
    },
    {
      "description": "Bicester",
      "objectID": "41d8efa189cbc27d063501af109e3898",
      "ref": "bicester-walking-route"
    },
    {
      "description": "Cross Bucks Way",
      "objectID": "cf736d2df666648b4fc81915d1a065f9",
      "ref": "cross-bucks-way-walking-route"
    },
    {
      "description": "Waddesdon Manor",
      "objectID": "765e8c2fb65160597c46f356bdd2f87e",
      "ref": "waddesdon-manor-walking-route"
    },
    {
      "description": "Pitstone Windmill",
      "objectID": "22345e9dcc1d1d342878a58d4f94c9b0",
      "ref": "pitstone-windmill-walking-route"
    },
    {
      "description": "Tramway Trail",
      "objectID": "724d2478db0a564db5672878e7fd8ce5",
      "ref": "tramway-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c105fc1cc5ae62e258222c69386313d0.gpx",
  "_geoloc": {
    "lat": 51.8202266359,
    "lng": -1.0518028483
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/The_village_green%2C_Brill_-_geograph.org.uk_-_1437296.jpg",
      "title": "Kurt C / The village green, Brill",
      "caption": "A simple shot of the village green at Brill. There are actually two village greens here, the second 'official' green is just out of view down the road in the left-hand background. The traditional cottages shown here are very typical in character for this part of West Buckinghamshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Brill_village_from_Brill_Common_-_geograph.org.uk_-_538330.jpg",
      "title": "Alan Murray-Rust / Brill village from Brill Common",
      "caption": "Brill village from Brill Common. You can see that a mixture of building styles is evident in this part of the village. Taken from near the windmill on the Common. Photo dates from the summer of 2007."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/The_Common%2C_Brill_-_geograph.org.uk_-_1437256.jpg",
      "title": "Kurt C / The Common, Brill",
      "caption": "The Common. A popular scene of Brill Common, a bumpy and lumpy series of folds and naturally formed mounds, which surround the famous windmill. I believe this picture was taken shortly after this common was 're-opened' to the public, having been closed off to protect the area from modest erosion caused by people walking over its mounds. The road in the background leads (left) to Muswell Hill and the minor crossroads below."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/A_Field_near_Brill_-_geograph.org.uk_-_35477.jpg",
      "title": "Hywel Williams / A Field near Brill",
      "caption": "A Field next to Rushbeds Wood. This field used to have several railway sidings as part of the Brill Tramway. As well as sidings, a short branch nearby led to brickworks (now a sawmill) which created many of the bricks used in the construction of nearby Waddesdon Manor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Brill_Windmill_-_geograph.org.uk_-_1604063.jpg",
      "title": "Cameraman / Brill Windmill",
      "caption": "Brill Windmill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/The_rear_of_Brill_Windmill_after_restoration_-_geograph.org.uk_-_1414322.jpg",
      "title": "Steve Daniels / The rear of Brill Windmill after restoration",
      "caption": "The rear of Brill Windmill after restoration"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Ludgershall_St_Mary%27s_Church%2C_Bucks_-_geograph.org.uk_-_186299.jpg",
      "title": "ChurchCrawler / Ludgershall St Mary's Church, Bucks",
      "caption": "Ludgershall St Mary's Church, Bucks. This delightful church is famous for the carvings on the pillar capitals."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/All_Saints%2C_Brill%2C_Bucks_-_geograph.org.uk_-_333914.jpg",
      "title": "John Salmon / All Saints, Brill, Bucks",
      "caption": "All Saints, church in Brill. The church was built early in the 12th century, and its nave and chancel remain essentially Norman structures."
    }
  ],
  "distance_km": 6.0,
  "description": "This hill top Bucks village is in a great location for sweeping views and country walks. This walk from the village visits the famous windmill before heading to the nearby Rushbeds Nature Reserve and the neighbouring village of Ludgershall. The walk starts in the village centre and heads north west to visit the windmill. This 17th century mill is one of the earliest and best preserved examples of a post mill in the country. There's also some excellent views over the surrounding countryside from the elevated position of the mill. The area includes Brill Common which is characterised by a number of unusual bumps and grassy mounds. After exploring the windmill site you continue north along a footpath to meet with a country lane. Turn east and you can follow the quiet lane to where it meets with the Bernwood Jubilee Way. This waymarked trail will then take you north east to the Rushbeds Nature Reserve where there are some peaceful woodland trails. There's also lots of woodland birds and different types of butterfly to see in the summer months. The trail then continues north through the countryside to Ludgershall. Here you can enjoy refreshments before returning to Brill on the same paths. You can turn it into a circular walk by heading west to Piddington and then turning south to climb Muswell Hill for wonderful views over the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Pointer is a fine village pub dating back to the 18th century. They do excellent food with meat supplied by the butchers next door. In good weather you can eat outside in the pleasant garden area. You can find them in the village centre at 27 Church Street with a postcode of HP18 9RT for your sat navs. Next to the windmill you'll find The Pheasant. It's located in a lovely spot, perched on a hill with views over windmill. You can find them at 39 Windmill Street with a postcode of HP18 9TG."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a nice dog walk and the two pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue north along the Bernwood Jubilee Way it will take you to Marsh Gibbon where you can pick up the Cross Bucks Way. This can be followed to nearby Twyford. The pretty Grebe Lake is near here where there are some good birdwatching opportunites. The circular path also bends round to visit Waddesdon Manor which is another highlight of the area. To the north of the manor there's also the pretty village of Quainton. The settlement is well worth a visit with an old windmill, a picturesque village green, a 14th century church, a row of 17th century almshouses and a rather fine 1700s pub to visit. To the north of the village there's also an excellent viewpoint at Quainton Hill. Near here you can pick up the Tramway Trail which explores the route of the old Brill Tramway. Head a few miles east and you can visit another historic site at Pitstone Windmill. The market town of Bicester is also nearby. For more walking ideas in the area see the Buckinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/JBMOGX7XX9U",
  "postcode": "HP18 9ST",
  "district": "Brill",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "High Street, Brill, Buckinghamshire, England, HP18 9ST, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "countryside"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}