{
  "objectID": "c191b8bcfcdefb30850661ffd3ff9954",
  "created_at": "2024-12-19T09:44:50.243316+00:00",
  "ref": "shepperton-walking-route",
  "title": "Shepperton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Shepperton_Large_white_house_near_Shepperton_Ferry_with_extensive_private_river-bank_downstream_1981345_09114ba0.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/B37459BA23BC785F862586980051AC2B/$FILE/Shepperton.gpx",
  "_geoloc": {
    "lat": 51.3890939451,
    "lng": -0.4479168964
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Shepperton_Large_white_house_near_Shepperton_Ferry_with_extensive_private_river-bank_downstream_1981345_09114ba0.jpg",
      "title": "Ben Brooksbank / Large white house near Shepperton Ferry, with extensive private river-bank downstream",
      "caption": "Manor House upstream by 500 metres or so from Shepperton Ferry, next to Church Square, with extensive private river-bank downstream. Manor House, Church Lane, Shepperton, viewed from a boat not entering Desborough Channel but continuing along a winding, tree-lined and natural banks section of the River Thames. As shown by the record flood photograph in February 2014 on the Geograph project, its elevation spared the manor by over a metre from the flooding but flooded much of Desborough Island opposite."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Shepperton%2C_The_Crossroads_public_house_-_geograph.org.uk_-_1079034.jpg",
      "title": "Nigel Cox / Shepperton: The Crossroads public house",
      "caption": "Shepperton: The Crossroads public house Remove the modern single storey front extension and behind is one of the oldest buildings in this part of Shepperton, the former Railway Hotel, built shortly after the arrival of the railway in 1864 and certainly shown on the 1872 Edition of the Ordnance Survey mapping. At that time the railway station and the hotel were the only buildings in the area and it is evident that this part of Shepperton was subsequently developed solely because of the proximity of the railway route to London, the old village of Shepperton being some distance away to the south-west. At some stage the pub became the Crossroads and it does now occupy a prominent location at the junction of Laleham Road, Old Charlton Road, Green Lane and the High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Old_Shepperton_Square_%28geograph_4204348%29.jpg/512px-Old_Shepperton_Square_%28geograph_4204348%29.jpg",
      "title": "Len Williams / Old Shepperton Square",
      "caption": "Old Shepperton Square. With the Anchor pub and St Nicholas church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Marina_at_Shepperton_Lock_on_the_Thames_-_panoramio.jpg/512px-Marina_at_Shepperton_Lock_on_the_Thames_-_panoramio.jpg",
      "title": "Maxwell Hamilton, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Marina at Shepperton Lock on the Thames"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/River_Thames%2C_Shepperton_Lock_-_geograph.org.uk_-_75840.jpg",
      "title": "Nigel Cox / River Thames: Shepperton Lock",
      "caption": "River Thames, Shepperton Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Shepperton%2C_King%27s_Head_-_geograph.org.uk_-_558734.jpg",
      "title": "Chris Downer / Shepperton: King’s Head",
      "caption": "The King'\u0092s Head is a fifteenth-century inn on Church Square, Old Shepperton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Shepperton%2C_a_skew-whiff_shop_-_geograph.org.uk_-_558731.jpg",
      "title": "Chris Downer / Shepperton: a skew-whiff shop",
      "caption": "Shepperton: a skew-whiff shop. The right-hand of these three shops is rather higgledy-piggledy, while the left hand one may well have been the village post office before the main hub of activity moved northeast to the present-day centre of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Point_Meadow%2C_Desborough_Island_%28geograph_5874899%29.jpg/512px-Point_Meadow%2C_Desborough_Island_%28geograph_5874899%29.jpg",
      "title": "Mike Quinn / Point Meadow, Desborough Island",
      "caption": "Point Meadow, Desborough Island"
    }
  ],
  "distance_km": 6.0,
  "description": "This Surrey based village sits in a nice spot on a lovely section of the River Thames. There's much to enjoy with the historic Old Shepperton and the picturesque area around Shepperton Lock on the river. The village is also home to the famous Shepperton Film Studios. This circular walk from the village takes you along the river to Halliford Mere, Desborough Island and Walton Bridge. The walk starts from the public car park on the Las Palmas Estate. You could also start from the train station which is about a 10 minute walk from the river. From the car park you pick up the Thames Path National Trail and head west to visit Halliford Mere. The route then heads south to the river passing through Old Shepperton where there are a number of interesting shops and buildings around an attractive square. At the river you can catch a little ferry over to the other side in Weybridge . This pedestrian ferry service has operated almost continuously for over 500 years. From Weybridge you head east and then north, following a riverside path through Desborough Island. You then cross the bridge at Walton on Thames to Lower Halliford. Around here you could pay a visit to the Shepperton Marina which lies just to the east. This route heads west to return you to the finish point back at the car park.",
  "video_url": "https://www.youtube.com/embed/WOzulX4b6TY",
  "postcode": "TW17 9HJ",
  "district": "Shepperton",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}