{
  "created_at": "2025-01-06T00:01:13.916583+00:00",
  "objectID": "c1df1439d6a34052643520ae577ba499",
  "ref": "southwold-walking-route",
  "title": "Southwold Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Southwold_Pier_-_geograph.org.uk_-_1073261.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c1df1439d6a34052643520ae577ba499.gpx",
  "_geoloc": {
    "lat": 52.3327664746,
    "lng": 1.6863932787
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Southwold_Pier_-_geograph.org.uk_-_1073261.jpg",
      "title": "Bob Jones / Southwold Pier",
      "caption": "Southwold Pier. Looking south from the beach towards this restored pier. It was rebuilt and opened in 2001 following severe storm damage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Southwold_-_geograph.org.uk_-_2510.jpg/256px-Southwold_-_geograph.org.uk_-_2510.jpg",
      "title": "mym / Southwold",
      "caption": "The Sole Bay Inn, right by the gate of Adnams."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Southwold_Harbour_-_geograph.org.uk_-_18120.jpg",
      "title": "Sarah Maidment / Southwold Harbour",
      "caption": "Southwold Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Beach_huts%2C_Southwold_-_geograph.org.uk_-_1745199.jpg",
      "title": "Chris Gunns / Beach huts, Southwold",
      "caption": "Beach huts, Southwold"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Village_green%2C_Walberswick_-_geograph.org.uk_-_2911716.jpg/512px-Village_green%2C_Walberswick_-_geograph.org.uk_-_2911716.jpg",
      "title": "Village green, Walberswick by nick macneill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Village green, Walberswick"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Mudflats_at_Walberswick_-_geograph.org.uk_-_2077835.jpg",
      "title": "Mudflats at Walberswick by Adrian S Pye, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mudflats at Walberswick"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Remains_of_the_Southwold_Harbour_Branch_-_geograph.org.uk_-_1758861.jpg",
      "title": "Ashley Dace / Remains of the Southwold Harbour Branch",
      "caption": "The last remains of the Southwold Railway harbour branch. A solitary buffer stop remains along with one stretch of rail. The harbour branch was opened in 1914 to increase freight on the 3ft line. However with the collapse of the fishing industry the plan failed. Plus the growth of road transport meant a more convenient means of getting fish to market. The railway closed for good in 1929 after 50 years of operation. The remains are directly opposite the sailing club"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Dunes_-_geograph.org.uk_-_192564.jpg",
      "title": "Eileen Henderson / Dunes",
      "caption": "Dunes. To the south of Southwold, the sandy beach is backed by dunes. In the background of the photo can be seen the lighthouse, with the pier beyond."
    }
  ],
  "distance_km": 9.5,
  "description": "This lovely circular walk takes you from the coastal town of Southwold to the nearby village of Walberswick in the Suffolk Coast and Heaths Area of Outstanding Natural Beauty. There's much to enjoy in this area with coastal views, pretty beaches and riverside paths along the River Blyth. The walk starts by the pier in the popular town of Southwold. The pier is 90 metres (620 ft) long with an adjacent model boat pond. From the pier you follow the Suffolk Coast Path south towards the River Blyth, passing the sand and shingle beach and the Grade II listed lighthouse. You can catch a ferry over the river but this walks follows the river path towards Woodsend Marshes before crossing the bridge and heading to Walberswick. Here you have the option of continuing along the Dunwich River to Dunwich Forest and the lovely Suffolk Coast National Nature Reserve. The area around the village makes up the Suffolk Coast National Nature Reserve, a protected area of 1,340 hectares (3,300 acres) with a range of wetland and heathland habitats. Consequently the area is great for birdwatching with March Harrier, Bearded Tit, Water Rail and Bittern to look out for. After exploring the village and enjoying refreshments at one of the pubs or cafes you follow the river back to Woodsend Marshes where there is a nice footpath to follow through Busscreek Marshes. You then follow the Buss Creek back to the pier and the finish point. The Sandlings Walk long distance footpath starts in Southwold so you could pick this up to extend your walking in the area. It takes you through the Suffolk Coast and Heaths Area of Outstanding Natural Beauty from the town to Ipswich. Also nearby is Minsmere Nature Reserve and Dunwich Heath which are great for peaceful walks and wildlife. You could also try the Kessingland to Southwold Walk which runs along the coast path, passing the village of Covehithe with its interesting ruined church.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Dunwich to Walberswick Walk is a good option for continuing your exercise around the town. The 7 mile circular walk visits Walberswick before returning to Dunwich along the beach. The circular Blythburgh Walk starts at the nearby village and visits the Westwood Marshes, Walberswick and Dunwich Forest. The village is located just to the north west of Walberswick and includes trails along the River Blyth and a noteworthy 14th century church which is lit at night. There's also a notable 16th century pub with an excellent garden area overlooking the estuary. If you followed the Blyth river west from the settlement you will soon come to the neighbouring town of Halesworth. This town has some interesting history with a walk down the central Thoroughfare highly recommended. The pedestrianised area includes many buildings dating back to the sixteenth century. For more walking ideas in the area see the Suffolk Coast and Heaths Walks and the Suffolk Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/yEnw_1F3tCo",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Southwold, East Suffolk, Suffolk, England, IP18 6BN, United Kingdom",
  "postcode": "IP18 6BN",
  "district": "East Suffolk",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "river",
    "marshes"
  ],
  "points_of_interest": [
    "beach",
    "lighthouse",
    "nature reserve",
    "village"
  ],
  "facilities": [
    "pub/cafe",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "bird watching"
  ]
}