{
  "created_at": "2025-01-06T18:46:49.464741+00:00",
  "objectID": "c2773ce772637640ab06d27776f8471b",
  "ref": "dun-beag-broch-walking-route",
  "title": "Dun Beag Broch Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Dun_Beag_Broch_-_geograph.org.uk_-_2944691.jpg/512px-Dun_Beag_Broch_-_geograph.org.uk_-_2944691.jpg?20211226191521",
  "nearby": [
    {
      "description": "Waternish Point",
      "objectID": "a8a5510ba4219ccb672e35d73961f9b8",
      "ref": "waternish-point-walking-route"
    },
    {
      "description": "Coral Beach",
      "objectID": "acf1ad3aeb5658f4d8c495e3e2dbe7be",
      "ref": "coral-beach-walking-route"
    },
    {
      "description": "Dunvegan Castle",
      "objectID": "e1f480f7aa997d9c5374d263793c9117",
      "ref": "dunvegan-castle-walking-route"
    },
    {
      "description": "Talisker Bay Beach",
      "objectID": "6b45aa6fe219565dc4733c4789cd3c5a",
      "ref": "talisker-bay-beach-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c2773ce772637640ab06d27776f8471b.gpx",
  "_geoloc": {
    "lat": 57.35907,
    "lng": -6.42868
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Dun_Beag_Broch_-_geograph.org.uk_-_2944691.jpg/512px-Dun_Beag_Broch_-_geograph.org.uk_-_2944691.jpg?20211226191521",
      "title": "Dun Beag Broch by David Hutchison, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dun Beag Broch is one of the best-preserved examples of a broch in Scotland. These ancient stone structures, dating back to the Iron Age, typically served multiple purposes, including habitation and possible defensive capabilities. Dun Beag, specifically, is notable for its impressive construction, featuring walls that are approximately 4.3 metres thick and an interior diameter of around 11 metres. The entrance is accessed through a narrow passage, and the broch includes a small chamber and a stone staircase leading to the upper levels"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Dun_Beag_20080429_02.jpg?20080809125707",
      "title": "Otter, CC BY-SA 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>, via Wikimedia Commons",
      "caption": "Historically, Dun Beag has attracted significant archaeological interest. Excavations in the early 20th century uncovered various artefacts, including pottery and coins from later periods, indicating it was occupied or visited well beyond the Iron Age. Originally, Dun Beag would have stood much taller, potentially reaching over 10 metres, and likely featured a thatched roof, making it a prominent landmark in the landscape."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Interior_of_Dun_Beag_Broch.JPG/512px-Interior_of_Dun_Beag_Broch.JPG?20130901131530",
      "title": "Nessy-Pic, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Interior"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/The_Dun_Beag_Broch_on_Skye.jpg/512px-The_Dun_Beag_Broch_on_Skye.jpg?20200925114644",
      "title": "Mark Longair, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": ""
    }
  ],
  "distance_km": 0.8,
  "description": "This walk visits the ancient Dun Beag Broch on the Isle of Skye. Dun Beag is one of the best-preserved examples of a broch in Scotland. There is a car park just to the south of the site where you can start your walk. From here follow footpaths north east up to the Iron Age remains of the broch. From the elevated ancient ruins there are some splendid views to the coast and surrounding hills. To continue your walking in the area head south east to visit the delightful Fairy Pools .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could continue your outing by heading to Neist Point, the most westerly point on the Duirinish peninsula. The historic Dunvegan Castle and Gardens can also be found in this area. Just to the south there's the lovely Talisker Bay Beach. Here you will find a lovely, quiet beach with some impressive sea stacks and views to a waterfall."
    },
    {
      "subtitle": "Visitor Reviews",
      "content": "\"A hidden gem. The history is super interesting (it's so old!) and the views are astounding. On a clear day you can so so far and the variety of landscapes are stunning. There is a small car park opposite the broch that allows for a few cars. This can often be full of campervans instead but hopefully you can find space. You do need to be able to walk a small distance. There is a slightly longer but easier path that passes to the left of the broch and around its back. Alternatively, you can climb it's front but be wary of damaging the historical remains. You can walk along the top of this broch, but I would suggest being careful about where you walk and try not to dislodge any stones. This broch has survived thousands of years and hopefully will last a few more.\" \"Dun Beag is a charming broch that encapsulates historical significance. It’s easily accessible and boasts stunning views of the landscape, making it an ideal stop for visitors.\"  \"Many find exploring the well-preserved structure a fascinating glimpse into Iron Age life.\"  \"The impressive stonework highlights the architectural skills of ancient Scotland, while the serene surroundings enhance the experience.\"  \"A hidden gem! The broch is set on a hill, providing breathtaking views. It’s remarkable to think about the people who lived there centuries ago.\""
    }
  ],
  "video_url": "https://www.youtube.com/embed/qWCvOUkHGU8?si=NApVpAVj92fLbq3H",
  "district": "Struan",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A863, Struanmore, Struan, Highland, Alba / Scotland, IV56 8FB, United Kingdom",
  "postcode": "IV56 8FB",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "hillside",
    "coastal"
  ],
  "points_of_interest": [
    "historical site",
    "ruins",
    "viewpoint"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}