{
  "created_at": "2025-01-06T00:21:06.817000+00:00",
  "objectID": "c2842c18a1748c05da48a380cf88413f",
  "ref": "barnstaple-walking-route",
  "title": "Walk around Barnstaple Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Barnstaple%2C_towards_the_High_Street_-_geograph.org.uk_-_405156.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c2842c18a1748c05da48a380cf88413f.gpx",
  "_geoloc": {
    "lat": 51.0784570284,
    "lng": -4.0587622681
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Barnstaple%2C_towards_the_High_Street_-_geograph.org.uk_-_405156.jpg",
      "title": "Martin Bodman / Barnstaple: towards the High Street, via Wikimedia Commons",
      "caption": "Barnstaple: towards the High Street In Joy Street, looking west-south-west. West Devon clay probably provided the material for the light-coloured bricks used on the building on the right"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/The_new_Taw_Bridge_-_geograph.org.uk_-_1357932.jpg",
      "title": "Philip Halling / The new Taw Bridge, via Wikimedia Commons",
      "caption": "The new Taw Bridge viewed here from the cycleway was opened in May 2007 and carries Barnstaple's western by-pass over the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Penrose_Almshouses%2C_Litchdon_Street%2C_Barnstaple_%28geograph_2572479%29.jpg/256px-Penrose_Almshouses%2C_Litchdon_Street%2C_Barnstaple_%28geograph_2572479%29.jpg",
      "title": "Roger A Smith / Penrose Almshouses, Litchdon Street, Barnstaple, via Wikimedia Commons",
      "caption": "Penrose Almshouses, Litchdon Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/River_Yeo%2C_Barnstaple_-_geograph.org.uk_-_1346468.jpg",
      "title": "Derek Harper / River Yeo, Barnstaple, via Wikimedia Commons",
      "caption": "River Yeo, Barnstaple. The last, tidal, reach of the Yeo before it joins the Taw just past the Civic Centre on the left. On the far side is Rolle's Quay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/River_Taw%2C_Barnstaple_-_geograph.org.uk_-_218223.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Taw, Barnstaple, near to Sticklepath, Devon, Great Britain. Viewed from the Long Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/RumshamBridge_OnRiverTaw_BarnstapleDevon.JPG/256px-RumshamBridge_OnRiverTaw_BarnstapleDevon.JPG",
      "title": "(Lobsterthermidor (talk) 11:58, 4 May 2014 (UTC)) [Public domain], via Wikimedia Commons",
      "caption": "Rumsham Bridge (foreground) over River Taw, North Devon, looking downstream from Bishops Tawton with Barnstaple in background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/The_new_Taw_Bridge_and_River_Taw%2C_Barnstaple_-_geograph.org.uk_-_1353184.jpg/256px-The_new_Taw_Bridge_and_River_Taw%2C_Barnstaple_-_geograph.org.uk_-_1353184.jpg",
      "title": "Philip Halling / The new Taw Bridge and River Taw, Barnstaple, via Wikimedia Commons",
      "caption": "The new Taw Bridge over the River Taw at Barnstaple is silhouetted by the evening sun"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Queen_Anne%27s_Walk%2C_Barnstaple_-_geograph.org.uk_-_275649.jpg",
      "title": "Maurice Clements / Queen Anne's Walk, Barnstaple, via Wikimedia Commons",
      "caption": "Queen Anne's Walk, Barnstaple A Grade 1 listed building completed in 1713 as a merchant's exchange. Under the statue of Queen Anne in the centre is the Tome Stone, where bargains and deals were struck (\"on the nail\") in front of witnesses. The area in front of the walk was the site of \"The Great Quay\" in Elizabethan times and Barnstaple provided 5 ships against the Spanish Armada. Today the building houses the Barnstaple Heritage Centre and the area in front is inset with a mosaic depicting Barnstaple's history."
    }
  ],
  "distance_km": 4.0,
  "description": "This walk makes use of three of the waymarked trails which pass through the town. You'll follow sections of the Barnstaple Heritage Trail, the Tarka Trail and the Macmillan Way to explore the town before enjoying riverside footpaths along the River Taw. The walk starts in the town centre where you can pick up the Barnstaple Heritage Trail which takes you to some of the significant buildings in the town. Highlights include the Queen Anne's Walk (formerly The Mercantile Exchange), completed in 1713 as a meeting place for the town's merchants. Today the building houses the Barnstaple Heritage Centre and the area in front is inset with a mosaic depicting Barnstaple's history. There's also the noteworthy Dodderidgian Library which was founded in 1667 and is a Grade II listed building. It represents one of the earliest town libraries in England which continues in existence since its foundation. After exploring the town the route picks up riverside footpaths along the River Taw. You'll pass Barnstaple Long Bridge an interesting medieval bridge which links the town with Tawstock. The path heads south east along the Tarka Trail, leading you through Rock Park, before crossing the river on a footbridge. On the other side of the river you pick up the Macmillan Way and follow it north to Barnstaple Long Bridge which you then cross. From here it is a short walk back into the town where the route finishes. To continue your walking around the town pick up the South West Coast Path and head west to visit the lovely settlements of Appledore, Instow and Bideford. There's lovely walks here along the River Torridge and through the nearby Northam Burrows Country Park .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south of the town you can enjoy a climb to the viewpoint on Codden Hill from the neighbouring village of Bishop's Tawton. Here you'll find the monument to Caroline Thorpe, wife of local MP Jeremy Thorpe who became embroiled in the Thorpe scandal of the 1970s. There's also some splendid views over the area and waterside trails along the pretty Venn Stream to enjoy. If you follow the Tarka Trail south west from the town it will take you to nearby Great Torrington. The historic town is well worth a visit with a number of listed buildings, riverside trails and a splendid viewpoint on Castle Hill to enjoy. A few miles to the south there's the little village of Umberleigh where there's pleasant walks along the River Taw and views of the Railway Viaduct. The village has a train station on the Tarka Line between Portsmouth Arms and Chapelton."
    }
  ],
  "postcode": "EX31 1HG",
  "district": "North Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Scoff's Original, Boutport Street, Fort Hill, Barnstaple, North Devon, Devon, England, EX31 1HG, United Kingdom",
  "state": "England"
}