{
  "created_at": "2025-01-06T04:19:16.183636+00:00",
  "objectID": "c2aac15bf602a0f263fb0a830fe33277",
  "ref": "north-dorset-trailway-walking-and-cycle-route",
  "title": "North Dorset Trailway Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b8/North_Dorset_Trailway_-_geograph.org.uk_-_378936.jpg",
  "nearby": [
    {
      "description": "Sturminster Newton",
      "objectID": "ba4d6688eb4e8a6e137d00cf99792fce",
      "ref": "sturminster-newton-walking-route"
    },
    {
      "description": "Blandford Forum",
      "objectID": "8d7545b7b5624e04c20e9913e45a56b1",
      "ref": "blandford-forum-walking-route"
    },
    {
      "description": "Spetisbury",
      "objectID": "145bd917f7ae4b6166c17b4772a5babc",
      "ref": "spetisbury-walking-route"
    },
    {
      "description": "Corfe Mullen",
      "objectID": "bc8d34be0c0f0675064853156ef8d7f3",
      "ref": "corfe-mullen-walking-route"
    },
    {
      "description": "Delph Woods",
      "objectID": "34aedd2c5c18e669341832f39c2618f5",
      "ref": "delph-woods-walking-route"
    },
    {
      "description": "Bere Regis",
      "objectID": "484b2496e59470091d2bf52f7198b816",
      "ref": "bere-regis-walking-route"
    },
    {
      "description": "National Cycle Route 25",
      "objectID": "3d1b646a96dc345670286a6e3c37b536",
      "ref": "national-cycle-route-25"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c2aac15bf602a0f263fb0a830fe33277.gpx",
  "_geoloc": {
    "lat": 50.9272542873,
    "lng": -2.3045451029
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/North_Dorset_Trailway_-_geograph.org.uk_-_378936.jpg",
      "title": "Marilyn Peddle [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "North Dorset Trailway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Hambledon_Hill_from_North_Dorset_Trailway_20080107.jpg/256px-Hambledon_Hill_from_North_Dorset_Trailway_20080107.jpg",
      "title": "By Marilyn Peddle, North Dorset, England (flickr.com) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Hambledon Hill from North Dorset Trailway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/North_Dorset_Trailway_south_of_Sturminster_Newton_-_geograph.org.uk_-_942479.jpg",
      "title": "A-M-Jervis [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "North Dorset Trailway south of Sturminster Newton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/North_Dorset_Trailway%2C_Sturminster_Newton_-_geograph.org.uk_-_942370.jpg",
      "title": "A-M-Jervis [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Sturminster Newton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/St_Hubert%27s_Church%2C_Corfe_Mullen_-_geograph.org.uk_-_963367.jpg",
      "title": "A-M-Jervis / St Hubert's Church, Corfe Mullen",
      "caption": "St Hubert's Church, Corfe Mullen. Taken from the footpath newly opened in October 2007 as part of the North Dorset Trailway, whereby, somewhat belatedly since the line here was closed completely in the 1970s, the Somerset & Dorset joint railway is being slowly converted into a long-distance footpath. The former trackbed of the railway is in the foreground; most of the bridge across the stream has been removed. The pretty Delph Woods nature reserve can also be accessed near here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Railwaymen%27s_cottages%2C_Knoll_Lane%2C_Corfe_Mullen_-_geograph.org.uk_-_963370.jpg",
      "title": "A-M-Jervis / Railwaymen's cottages, Knoll Lane, Corfe Mullen",
      "caption": "Railwaymen's cottages, Knoll Lane, Corfe Mullen. In these cottages once lived the families of signalmen who worked in the signal box that would have controlled this level crossing on the former Somerset & Dorset Joint Railway. In connection with the recent conversion of this section of the line into a horse-rider's path as part of the Trailway, the level crossing gates were restored. The horse-path passes to the right of the wooden fence, the actual trackbed having become part of the cottagers' garden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/North_Dorset_Trailway_at_Bailey_Gate_Crossing_-_geograph.org.uk_-_981892.jpg",
      "title": "A-M-Jervis / North Dorset Trailway at Bailey Gate Crossing",
      "caption": "North Dorset Trailway at Bailey Gate Crossing. The Somerset & Dorset Railway crossed the main A31 (Wimborne - Bere Regis) road at Bailey Gate level crossing, the name coming from a turnpike gate to the west where this road crossed the A350 Poole - Blandford Forum road. In October 2007 the course of the railway south-east from the level crossing and seen here was formally opened as a horse-path, with the intention that it shall be available for walkers and cyclists as well when money can be found for surfacing. Previously there were a signal box and railwaymen's cottage behind the fence to the left but now there is only the modern bungalow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/North_Dorset_Trailway_near_Corfe_Mullen_-_geograph.org.uk_-_982339.jpg",
      "title": "A-M-Jervis / North Dorset Trailway near Corfe Mullen",
      "caption": "Near Corfe Mullen. If you go down in the woods today, between the A31 Wimborne - Bere Regis road and Brog Street, about 500 metres east of Corfe Mullen parish church, you will find this dead straight leafy path. Between 1860 and 1932 it carried passenger trains between Blandford and Wimborne and rails survived on this stretch to serve a sand quarry until about 1970. Today it is part of the North Dorset Trailway, a walking, cycling and horse-riding route gradually being constructed by the local council along the line of the Somerset & Dorset Railway. In 1893 most trains by this route, which then extended north to Bath, were transferred to a new line, seen as an embankment behind the trees on the left, to avoid a reversal at Wimborne when heading to or from Poole and the then young seaside resort of Bournemouth."
    }
  ],
  "distance_km": 20.7,
  "description": "This splendid walking and cycling path runs along a dismantled railway line from Sturminster Newton to Spetisbury in Dorset. The path has regular views of the River Stour following it for most of the route. You will pass through a series of pretty villages and towns including Sturminster Newton, Stourpaine and Blandford Forum before finishing at Crawford Castle at Spetisbury. On the way there's nice views of the nearby Hod Hill and Hambledon Hill which is a great place to enjoy views over the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route we recommend popping into the White Horse Inn in Stourpaine for some refreshments. It's a quaint pub of some note, dating back to the early 18th Century. Today, the inside provides an open-plan layout with a bar, restaurant, shop, post office, games room, wood burning stoves & an open fire. The external provides a covered outdoor decking area at the rear and a seating area out the front for warm summer days. There's also a village shop within the pub with a deli counter which sells a variety of delicious, fresh products. You can find the pub in the village at postcode DT11 8TA for your sat navs.In Blandford head to the Crown Hotel in the town centre. The pub/hotel is set in a redbrick Georgian property near to the interesting Blandford Town Museum. Highlights include a lounge with leather sofas and a fireplace, and a garden with a terrace seating to relax in on the warmer days. You can find it on West St at postcode DT11 7AJ. Near Spetisbury at the start/end of the route there's the Anchor Inn in the pretty riverside village of Shapwick. It's a lovely pub with a good menu and some outdoor seating for fine days. You can find the at a postcode of DT11 9LB for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Spetisbury you will pass the Spetisbury Rings Iron Age Hill Fort. You can climb to the top of the ancient fort for some lovely views over the area. The trail is part of Sustrans National Cycle Route 25 which runs from Longleat in Wiltshire to Bournemouth on the Dorset south coast. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Sx6PXJcW1NQ",
  "postcode": "DT10 1BA",
  "district": "Sturminster Newton",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Station Road, Sturminster Newton, Dorset, England, DT10 1BA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "villages",
    "towns",
    "views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}