{
  "created_at": "2025-01-06T04:37:56.048696+00:00",
  "objectID": "c31e845a6332436c2fb0c0ed71482064",
  "ref": "stroud-walking-route",
  "title": "Stroud Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/98/Ebley_Mill%2C_Stroud_-_geograph.org.uk_-_1631671.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c31e845a6332436c2fb0c0ed71482064.gpx",
  "_geoloc": {
    "lat": 51.7437369912,
    "lng": -2.220466323
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Ebley_Mill%2C_Stroud_-_geograph.org.uk_-_1631671.jpg",
      "title": "Roger May / Ebley Mill, Stroud",
      "caption": "Ebley Mill, Stroud. Ebley Mill, which is the headquarters of Stroud District Council, shot from the canal towpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Wallbridge_Upper_Lock_-_geograph.org.uk_-_1052894.jpg",
      "title": "David Stowell / Wallbridge Upper Lock",
      "caption": "Wallbridge Upper Lock. Restoration of this lock was completed in 1994 however it awaits the completion of the current Cotswold Canal Partnership restoration scheme before it will see much traffic. Although part of the Thames & Severn Canal it is built to Stroudwater Canal dimensions to allow traffic from the River Severn to reach the inland port at Brimscombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Confluence_with_Painswick_Stream_-_geograph.org.uk_-_1052890.jpg",
      "title": "David Stowell / Confluence with Painswick Stream",
      "caption": "Confluence with Painswick Stream. The Painswick Stream flows into the Stroudwater Canal from the left of the picture at this point. Originally this would simply have provided part of the canal's water supply however as part of a 1956 scheme it now forms part of a flood relief scheme in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Lodgemore_Swing_Bridge_-_geograph.org.uk_-_1052889.jpg",
      "title": "David Stowell / Lodgemore Swing Bridge",
      "caption": "Lodgemore Swing Bridge. Another of the four swing bridges over the Stroudwater Canal that will be replaced as part of the current restoration programme. The current structure dates from 1928 and is actual on a skew of 40 degrees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Ruscombe_Brook_-_geograph.org.uk_-_719347.jpg/256px-Ruscombe_Brook_-_geograph.org.uk_-_719347.jpg",
      "title": "Fran Sinclair / Ruscombe Brook",
      "caption": "Ruscombe Brook. The brook disgorges from the pond at The Lawns into the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Stroudwater_Canal_above_Dudbridge_Lock_-_geograph.org.uk_-_1052886.jpg",
      "title": "David Stowell / Stroudwater Canal above Dudbridge Lock",
      "caption": "Canal above Dudbridge Lock. A pleasant, almost rural stretch of the canal with Marling School Playing Fields on the left beyond the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Stroudwater_canal_east_of_Ryeford_Road_north%2C_Stonehouse_-_geograph.org.uk_-_932263.jpg",
      "title": "Brian Robert Marshall / Stroudwater canal east of Ryeford Road north, Stonehouse",
      "caption": "Canal east of Ryeford Road north, Stonehouse. The canal provides a habitat for ducks, coots, moorhens and duckweed, a lot of duckweed. At the right is an industrial estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Ryeford_Swing_Bridge_-_geograph.org.uk_-_1052877.jpg",
      "title": "David Stowell / Ryeford Swing Bridge",
      "caption": "Ryeford Swing Bridge. This small pedestrian swing bridge crosses the Stroudwater Canal in a picturesque location and provides access to properties on the offside of the canal."
    }
  ],
  "distance_km": 8.0,
  "description": "The market town of Stroud has several long distance walking trails running through it and a number of woods, parks and hill climbs to try. As such it's a fantastic place for walkers and makes a great base for exploring this lovely area of the Cotswolds. This route is a popular walk along the Stroudwater Canal to the village of King's Stanley using a section of the Cotswold Canals Walk and the Cotswold Way National Trail. The walk starts in the centre of Stroud, near the train station. Here you can pick up the canal towpath and follow it west to Cainscross. The path continues to Ryeford where you head south on the Cotswold Way to King's Stanley. Here you can visit the 12th century parish church of St George before heading back to the town. You can extend the walk by continuing along the trail south to Middleyard where you will find Pen Hill and Pen Woods. Just to the east of King's Stanley you can enjoy more walking trails across Selsley Common with its variety of flora and fauna. For nice circular walks near Stroud try the Slad Valley Walk or explore Rodborough Common, just to the south of the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Fleece on the western side of Rodborough Common is located just to the south of the town near Rodborough Common. The pub is set in a 250 year-old former coaching inn and is walker friendly. There's also a nice outdoor terrace where you can relax during the warmer months. You can find it on Rooksmoor Hill at postcode GL5 5NB. Also consider the Bell Inn in nearby Selsley. It's a pub of some note dating from the 16th Century and also grade two listed. The pub can now boast listings in The Good Food Guide, and The Good Pub Guide as well as 2AA rosettes for their food. In the summer months you can sit outside and enjoy fine views of the surrounding countryside. In the winter there's roaring log burners to warm you up after your chilly walk!"
    }
  ],
  "video_url": "https://www.youtube.com/embed/F9vTeHwDsz4",
  "district": "Stroud",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dr Newton's Way, Stroud, Rodborough, Stroud, Gloucestershire, England, GL5 3JX, United Kingdom",
  "postcode": "GL5 3JX",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "woodland",
    "common"
  ],
  "points_of_interest": [
    "church",
    "woods",
    "common"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}