{
  "created_at": "2025-01-06T01:11:38.056521+00:00",
  "objectID": "c3886c5b033518f0c71f53da0cdab959",
  "ref": "wyming-brook-walking-route",
  "title": "Wyming Brook Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Wyming_Brook_-_geograph.org.uk_-_1760854.jpg",
  "nearby": [
    {
      "description": "Rivelin Valley Nature Trail",
      "objectID": "d9331ba3b02f10e13bcb51f1056c8805",
      "ref": "rivelin-valley-nature-trail-walking-route"
    },
    {
      "description": "Redmires Reservoir",
      "objectID": "bcd6cccaa66f54aa578439a7a5da6292",
      "ref": "redmires-reservoir-walking-route"
    },
    {
      "description": "Rivelin Dams",
      "objectID": "401599bf016a8da22abf93fabfb7e457",
      "ref": "rivelin-dams-walking-route"
    },
    {
      "description": "Lodge Moor",
      "objectID": "ae239807012db02980630d44821cea1f",
      "ref": "lodge-moor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c3886c5b033518f0c71f53da0cdab959.gpx",
  "_geoloc": {
    "lat": 53.3687769232,
    "lng": -1.5973010538
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Wyming_Brook_-_geograph.org.uk_-_1760854.jpg",
      "title": "Chris Wimbush / Wyming Brook, via Wikimedia Commons",
      "caption": "View of the brook and a little wooden footbridge. The river flows almost its entire length within the Wyming Brook Nature Reserve, a Site of Special Scientific Interest which is managed by the Wildlife Trust for Sheffield and Rotherham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Wyming_Brook_Nature_Reserve_-_geograph.org.uk_-_1379403.jpg",
      "title": "Alan Heardman / Wyming Brook Nature Reserve, via Wikimedia Commons",
      "caption": "Entrance to the reserve. A steep footpath accompanies the brook, while a bridleway known as Wyming Brook Drive traverses the nature reserve from north to south. The footpath can be quite steep, with both the path and the brook descending over 100 meters within a kilometer. The surroundings are wooded near the bottom and more open near the top, offering views of the Rivelin Valley. Red cedar, eastern hemlock, Douglas fir, red pine, sitka, sweet chestnut, black alder, oak, and rowan trees line the brook. Wildlife in the vicinity of Wyming Brook includes moths such as the common lutestring and northern spinach, as well as birds like the dipper and the crossbill. Additionally, the Peak District Boundary Walk passes through the nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Wyming_Brook_-_Stepping_Stones_-_geograph.org.uk_-_1438495.jpg",
      "title": "Alan Heardman / Wyming Brook - Stepping Stones, via Wikimedia Commons",
      "caption": "Wyming Brook stepping stones on a sunny summer day. Historically, the region was reserved solely for the nobility, forming part of the hunting and hawking grounds of Rivelin Chase. Positioned above and to the west of the watercourse on Ash Cabin Flat lies an embanked stone circle, which dates back to the Bronze Age."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Wyming_Brook_Farm%2C_Soughley_Lane_-_geograph.org.uk_-_1408433.jpg",
      "title": "Martin Speck / Wyming Brook Farm, Soughley Lane, via Wikimedia Commons",
      "caption": "Wyming Brook Farm, Soughley Lane. In 2023, larch trees within the nature reserve were discovered to be infected with a non-native fungus-like disease known as Phytophthora ramorum. Following this finding, the Forestry Commission issued a Statutory Plant Health Notice to the Sheffield and Rotherham Wildlife Trust, instructing them to remove the infected trees. Additionally, chestnut trees, which are also susceptible to ramorum, will be felled as a precautionary measure. In September 2023, the wildlife trust commenced a four-month program to cut down over 1,000 trees affected by the disease. However, in October 2023, campaigners expressed concern, stating that the removal of trees would result in 'a post-apocalyptic landscape.' They launched a petition urging Sheffield Council, the landowner, to challenge the Statutory Plant Health Notice and cease tree felling activities. Sheffield Council responded by emphasizing that they are legally obligated to comply with the notice."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Rivelin_Dams_-_geograph.org.uk_-_1709700.jpg",
      "title": "Karl and Ali / Rivelin Dams",
      "caption": "Rivelin Dams at the northern end of the brook. Here the brook makes its way through the the Rivelin tunnel before it flows into the lower of the Rivelin Dams. The dams are owned by Yorkshire Water and provide water to 319,000 people as well as compensation water for the River Rivelin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Footpath_towards_Redmires_Lower_Reservoir_-_geograph.org.uk_-_1760850.jpg",
      "title": "Chris Wimbush / Footpath towards Redmires Lower Reservoir",
      "caption": "Footpath towards Redmires Lower Reservoir. Located at the southern end of the brook you will find a series of three reservoirs. They are fed from the Hallam Moors by various small streams including Fairthorn Clough. The three reservoirs are named Upper, Middle and Lower and were built between 1833 and 1854 to provide clean drinking water via an open water course which led to the Hadfield Dam situated in Crookes, following the devastating Sheffield cholera epidemic of 1832. There are more good bird watching opportunities around the lakes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Wyming_Brook_in_Redmires_Plantation_-_geograph.org.uk_-_2104284.jpg",
      "title": "Wyming Brook in Redmires Plantation by Peter Barr, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wyming Brook in Redmires Plantation. Yorkshire Water, the owner of land adjacent to the nature reserve, has also initiated preventative measures to stop the spread of ramorum by felling trees. Furthermore, an area containing sitka spruce and douglas fir trees, planted in the 1950s and considered to have minimal value for wildlife, has been cleared with the intention of replacing them with native broadleaf woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Gritstone_outcrop_at_Wyming_Brook_-_geograph.org.uk_-_2994943.jpg/256px-Gritstone_outcrop_at_Wyming_Brook_-_geograph.org.uk_-_2994943.jpg",
      "title": "Gritstone outcrop at Wyming Brook by David Lally, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gritstone outcrop. There's some interesting geology on the walk, including these rocky outcrops."
    }
  ],
  "distance_km": 1.5,
  "description": "Enjoy a waterside walk through the pretty Wyming Brook Nature Reserve on this route near Sheffield. The popular footpath takes you through peaceful woodland with a babbling brook, mossy crags, stone steps and wooden bridges. You can start your walk from the car park off Redmires Road just north of the lower reservoir and the Redmires woodland plantation. You then head north through the reserve to Rivelin Dams. The area is also a designated nature reserve with lots of interesting flora and fauna. Look out for birds including crossbills, redstarts, wood warblers and pied flycatchers as you make your way along the popular trail. If you prefer the walk could also be started from the Rivelin Lower Reservoir car park and completed from north to south. You could also turn it into a circular walk by heading east along Wyming Brook Drive to Reddicar Clough and then The brook links Redmires Reservoir and the Rivelin Dams so it's easy to extend your walk. Wyming Brook Drive runs just south of Rivelin Dams and is a good track for walking with more attractive woodland. You're also not far from the Rivelin Valley Nature Trail. It's a similar walk taking you through a wooded gorge with a rushing river.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Three Merry Lads pub is located just a short distance to the east of the site. It's a great place for refreshments with a good menu and a nice beer garden with lovely views of the surrounding countryside. The fine Georgian pub can be found about half a mile from the reserve at 610 Redmires Road with a postcode of S10 4LJ for your sat navs. Also to the south east is the lovely Forge Dam where there is a nice cafe overlooking a pretty lake. There's a good range of meals and snacks with outdoor seating for finer days. It's postcode is S10 3TE."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reserve is a nice place to take your dog for a walk and the Three Merry Lads pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The brook is located very close to one of the highlights of the Peak District at Stanage Edge. If you head west, past Redmires Reservoirs and across Hallam Moors you will come to the Edge where there are interesting rock formations and wonderful views over the area. The circular walk from Lodge Moor visits the brook from the car park just to the east. The route also visits Rivelin Dams and Redmires Reservoir."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_KGKA8JjpcY",
  "postcode": "S10 4QX",
  "region": "South Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wyming Brook Drive, Sheffield, South Yorkshire, England, S10 4QX, United Kingdom",
  "district": "Sheffield",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "nature reserve",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "track"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}