{
  "created_at": "2025-01-06T08:18:40.879377+00:00",
  "objectID": "c38e73b94078d0efed9218e2b430bb5b",
  "ref": "alderley-edge-walking-route",
  "title": "Alderley Edge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Alderley_Edge_mine.jpg",
  "nearby": [
    {
      "description": "Wizard Trail",
      "objectID": "c40b9779e63e8c04066ed42d6981207f",
      "ref": "wizard-trail-cycle-route"
    },
    {
      "description": "Hare Hill",
      "objectID": "d97b40ec93b4d8fedf4db90c85599641",
      "ref": "hare-hill-walking-route"
    },
    {
      "description": "Stockport",
      "objectID": "88c4ff9b091096382136f8b4a32877b3",
      "ref": "stockport-walking-route"
    },
    {
      "description": "Wilmslow",
      "objectID": "b3c20fcbf39ca7a31b70cdd59fba5c91",
      "ref": "wilmslow-walking-route"
    },
    {
      "description": "Mobberley",
      "objectID": "c438ca0df3d66ea63b8f681ee598de57",
      "ref": "mobberley-walking-route"
    },
    {
      "description": "Mottram Hall",
      "objectID": "ac3691a68638c1bb1e41b501dd7a9e3e",
      "ref": "mottram-hall-walking-route"
    },
    {
      "description": "Lindow Common",
      "objectID": "ae878ba22ce8ae6d01b2352e4e15dad2",
      "ref": "lindow-common-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c38e73b94078d0efed9218e2b430bb5b.gpx",
  "_geoloc": {
    "lat": 53.3038038927,
    "lng": -2.2362309216
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Alderley_Edge_mine.jpg",
      "title": "Stuart and Fiona Jackson [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Edge Alderley Edge - The Edge has a long history for mining - lots of mine shafts, and tunnels in the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Alderley_Edge_-_geograph.org.uk_-_1227280.jpg",
      "title": "Elliott Simpson / Alderley Edge, via Wikimedia Commons",
      "caption": "People sit and relax on the rocks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Alderley_Edge_-_geograph.org.uk_-_12990.jpg",
      "title": "Richard Webb / Alderley Edge, via Wikimedia Commons",
      "caption": "Woodland on Alderley Edge. The hill here was worked for copper, there are many pits and mounds from the mining days."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/%27Druid%27s_Circle%27_The_Edge%2C_Alderley_Edge_-_geograph.org.uk_-_43508.jpg",
      "title": "Andrew Huggett / ‘Druid’s Circle’ The Edge, Alderley Edge, via Wikimedia Commons",
      "caption": "'Druid's Circle'. This is a folly stone circle probably placed here in the 19th century"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Church_Quarry%2C_Alderley_Edge_-_geograph.org.uk_-_1600695.jpg",
      "title": "Dave Dunford / Church Quarry, Alderley Edge",
      "caption": "Church Quarry. Reached via a path behind the Wizard Tea Rooms, the quarry contains a trial level which can be explored."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/View_from_Alderley_Edge_towards_the_Pennines_-_geograph.org.uk_-_181996.jpg",
      "title": "Brian Abbott / View from Alderley Edge towards the Pennines",
      "caption": "Wonderful view from Alderley Edge towards the Pennines on a lovely bright day"
    }
  ],
  "distance_km": 7.0,
  "description": "This lovely circular walk explores the beautiful National Trust owned area of Alderley Edge. Starting at Alderley Edge train station you climb to a sandstone escarpment, where there are fabulous over the Cheshire Plain to the Peak District. You return through a delightful wooded area, passing a waterfall, before arriving back at Alderley Edge train station. The National Trust have also devised a number of other walking trails which you can pick up from the Wizard Tea-Room. These include the Miners Ramble which explores the age-old mining history of the Edge. The Wizard Trail also starts from the edge and will take you to the the Wizard's well, the 15th century Alderley mill and National Trust owned Hare Hill. You can follow a permissive path south to Hare Hill to extend the walk. It's about a 1.5 mile walk south east from the edge and includes beautiful gardens with 70 varieties of rhododendron, azaleas, hollies, and hostas. The centrepiece is a walled garden containing a pergola and wire sculptures.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Wizard Tea Room is a fine place for refreshments after your walk. The family run cafe is housed in a beautiful National Trust building. They serve tea, coffee & homemade food from locally sourced suppliers. There is also a nice outdoor seating area if the weather is fine. You can find them at Macclesfield Rd, Nether Alderley with a postcode of SK10 4UB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails at the site are ideal for dog walking, so you'll probably bump into several other owners on your visit. The tea rooms mentioned above are also dog friendly inside and out."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The village has a train station located a short walk from the site. You can catch the train here direct from Manchester Piccadilly via Stockport. Head north from the village and you can pick up the Wilmslow Walk. This visits the popular Carrs Park before following the River Bollin to the nearby Styal Country Park and Woods. A few miles west you will find the worthy village of Mobberley. This pretty little settlement includes a 13th century church and several splendid village pubs. To the east the worthy village of Prestbury is well worth a visit. The village includes several listed timber framed buildings, a 17th century pub, a picturesque churchyard and views of the River Bollin. Look out for famous faces too as it is one of the most desirable places to live in the north with many celebrities and footballers purchasing expensive properties in the area. Near Prestbury there's the Grade II listed Mottram Hall to explore. The estate includes 270 acres of beautiful landscaped gardens surrounding a fine 18th century hall which now operates as a hotel. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PZ6kkV-eOEo",
  "postcode": "SK9 7PY",
  "district": "Alderley Edge",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bridgford House Parking, Heyes Lane, Alderley Edge, Cheshire East, England, SK9 7PY, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "sandstone"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "waterfall"
  ],
  "facilities": [
    "visitor center",
    "tea room",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}