{
  "created_at": "2025-01-06T04:04:45.790659+00:00",
  "objectID": "c40330a4ead0f7379fa002422bf978cc",
  "ref": "wiveliscombe-walking-route",
  "title": "Wiveliscombe Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f4/High_Street%2C_Wiveliscombe_-_geograph.org.uk_-_1519949.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c40330a4ead0f7379fa002422bf978cc.gpx",
  "_geoloc": {
    "lat": 51.0423301053,
    "lng": -3.3122001838
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/High_Street%2C_Wiveliscombe_-_geograph.org.uk_-_1519949.jpg",
      "title": "Derek Harper / High Street, Wiveliscombe",
      "caption": "High Street, Wiveliscombe. Buildings on the east side of the street as it climbs from Cheapside to The Square. The sandstone buildings at numbers 9 and 11 date from about 1800"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/West_Deane_Way_-_geograph.org.uk_-_1518266.jpg",
      "title": "Derek Harper / West Deane Way",
      "caption": "West Deane Way. With the course of the way lying across the meadow (during which it crosses one watercourse) to the right corner by the trees (where it bridges another). The end of a piece of tall brick wall, presumably part of a former barn, protrudes darkly from the hedge on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Meadow_near_Wiveliscombe_-_geograph.org.uk_-_1518297.jpg",
      "title": "Derek Harper / Meadow near Wiveliscombe",
      "caption": "Meadow near Wiveliscombe. The eastern end of Rushy meadow, seen from the West Deane Way close to the southeastern corner. The Way climbs the field above it, to the right of the hedge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Rushy_meadow_near_Wiveliscombe_-_geograph.org.uk_-_1518250.jpg",
      "title": "Derek Harper / Rushy meadow near Wiveliscombe",
      "caption": "Rushy meadow near the village. Crossed by the West Deane Way, which heads left of the scene. Through the meadow flows a very small tributary of the Hillfarrance Brook."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Industrial_area%2C_Wiveliscombe_-_geograph.org.uk_-_1519223.jpg",
      "title": "Derek Harper / Industrial area, Wiveliscombe",
      "caption": "Industrial area, Wiveliscombe A view from near the old brewery over light industrial and commercial premises on Old Brewery Road and Ford Road, to the northeast of the town centre, with housing extending up Ridge Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Wiveliscombe_Without%2C_public_path_in_Oakhampton_Wood_-_geograph.org.uk_-_132929.jpg",
      "title": "Martin Bodman / Wiveliscombe Without: public path in Oakhampton Wood",
      "caption": "Wiveliscombe Without: public path in Oakhampton Wood. A steep descent from the disused slate quarry at Oakhampton leads to a ford and on to Combe Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Sandy_Lane%2C_Langley_-_geograph.org.uk_-_1517535.jpg",
      "title": "Derek Harper / Sandy Lane, Langley",
      "caption": "Sandy Lane, Langley. A sandstone cliff beside the byway. This must have been a significant route north of Wiveliscombe towards Brompton Ralph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Cruwys%27s_Cross%2C_Langley_Marsh_-_geograph.org.uk_-_2143890.jpg/512px-Cruwys%27s_Cross%2C_Langley_Marsh_-_geograph.org.uk_-_2143890.jpg",
      "title": "Cruwys's Cross, Langley Marsh by Roger Cornfoot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cruwys's Cross, Langley Marsh"
    }
  ],
  "distance_km": 6.4,
  "description": "This historic market town is located near Taunton in the county of Somerset. For walkers there's a popular long distance waymarked trail, the nearby Clatworthy Reservoir and Brendon Hills to explore. The town also sit on the edge of the Exmoor National Park where there are numerous walking opportunities in beautiful surroundings. This circular walk from the town visits the woods at Whitefield before heading to the neighbouring village of Langley. You then head to the Neolithic hillfort at King's Castle which lies just to the east of the settlement. The opening section of the walk uses part of the long distance West Deane Way which runs through the village. The walk can also be followed west towards Maundown to extend your walking around Wiveliscombe.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the town you could enjoy some post exercise rest and refreshment at the Bear Inn. They serve good home cooked food and have a lovely large garden area for warmer weather. You can find them on North Street at postcode TA4 2JY for your sat navs. The pub is also dog friendly if you have your canine friend with you. On the walk you could make a pit stop in Langley Marsh where you'll find the noteworthy Three Horseshoes. The historic country pub dates all the way back to the 17th century. It sits in a lovely spot at the foot of the Brendon Hills and has an attractive interior with cosy fires. There's also a good pub garden and a very good menu. The inn can be found at a postcode of TA4 2UL for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Exmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BFUcHK-jvcs",
  "district": "Wiveliscombe",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Courthouse Interiors, The Square, Hartswell, Wiveliscombe, Somerset, England, TA4 2JT, United Kingdom",
  "postcode": "TA4 2JT",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}