{
  "created_at": "2025-01-06T01:05:47.037709+00:00",
  "objectID": "c4587bb6ae521f6ddcc6987f975a0918",
  "ref": "runcorn-walking-route",
  "title": "Walks in Runcorn Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Ponies_on_Weston_Road%2C_Runcorn_Hill_-_geograph.org.uk_-_490087.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c4587bb6ae521f6ddcc6987f975a0918.gpx",
  "_geoloc": {
    "lat": 53.3298553582,
    "lng": -2.7400959945
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Ponies_on_Weston_Road%2C_Runcorn_Hill_-_geograph.org.uk_-_490087.jpg",
      "title": "Sue Adair / Ponies on Weston Road, Runcorn Hill",
      "caption": "Ponies on Weston Road, with the ICI chimneys and the river Mersey in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Carving%2C_Runcorn_Hill_-_geograph.org.uk_-_650311.jpg/256px-Carving%2C_Runcorn_Hill_-_geograph.org.uk_-_650311.jpg",
      "title": "Sue Adair / Carving, Runcorn Hill",
      "caption": "A carving of local woodland animals by Angela Stillwell on Runcorn Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Runcorn_Hill_and_Pipelines_at_Weston_Point_-_geograph.org.uk_-_422612.jpg",
      "title": "Sue Adair / Runcorn Hill and Pipelines at Weston Point",
      "caption": "Runcorn Hill and Pipelines at Weston Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/The_Prospect_Inn%2C_Runcorn_Hill_-_geograph.org.uk_-_490065.jpg",
      "title": "Sue Adair / The Prospect Inn, Runcorn Hill",
      "caption": "The Prospect Inn on Weston Road, situated on Runcorn Hill with great views of the Mersey, the Wirral and North Wales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Quarry_Workers_Cottages%2C_Highlands_Road_-_geograph.org.uk_-_598364.jpg",
      "title": "Sue Adair / Quarry Workers Cottages, Highlands Road",
      "caption": "Quarry Workers Cottages, Highlands Road Quarry Workers Cottages, Highlands Road, dating from the 1800's. The quarry extended right up to the front doors by 1860. Runcorn Hill visitor centre and recreation ground stand on top of 35,000 tonnes of quarry spoil which was used to backfill the quarry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Chemical_Works_Weston_Point.jpg",
      "title": "Sue Adair, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "ICI, Weston Point from the hill. The vast ICI plant on the banks of the river Mersey as viewed from Weston Road on the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Frog%27s_Mouth_Quarry%2C_Runcorn_Hill_-_geograph.org.uk_-_598352.jpg",
      "title": "Sue Adair / Frog's Mouth Quarry, Runcorn Hill",
      "caption": "Frog's Mouth Quarry. Runcorn is perched at the northerly end of an outcrop of sandstone which overlooks the River Mersey, a reminder that deserts covered this area 250 million years ago. A series of red sandstone quarries dating back to 1734 litter the hill. This one was known as \"Frog's mouth\" and is popular with climbers. Extraction from this quarry ceased around 1850 and it was then gradually filled with the spoil of the newer quarries. The present level of the ground is about one third of the depth when it was a working quarry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Bowling_Green%2C_Runcorn_Hill_-_geograph.org.uk_-_598356.jpg",
      "title": "Sue Adair / Bowling Green, Runcorn Hill",
      "caption": "Bowling Green"
    }
  ],
  "distance_km": 1.3,
  "description": "This port town in Cheshire is located next to the Mersey Estuary in Halton. There's lots of good waterside walking along the canals and river which run through the area around the town. This circular walk in the town explores Runcorn Hill where there are some fine views towards the Mersey Estuary. The hill is located just to the south of the train station and includes a car park as well. The site was originally a sandstone quarry but has now been converted into a local nature reserve with woodland, sandstone quarry clifs, heathland and parkland trails. There's good facilties with a visitor centre and cafe for refreshment. Just north east of the park you can continue your walking in the town on Wigg Island. This park and nature reserve sits in an interesting location, between the River Mersey and the Manchester Ship Canal .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's an on site cafe at the hill but if you'd prefer a pub lunch then the Prospect Inn is close at hand. The popular pub does a fine Sunday roast and was awarded Halton CAMRA Pub Of The Year in 2012. You can find them on Weston Road at postcode WA7 4LD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a popular place for dog walkers so you'll probably see other owners on your visit. The prospect inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you cross the Runcorn Bridge you can pick up the Widnes Walk. This will take you along the Mersey Way to two local highlights at Hale Lighthouse and Speke Hall. To the east there's waterside trails along the Cheshire Ring Canal Walk. The town is also the spot where the Trent and Mersey Canal links with the Bridgewater Canal.  Head south and there's the popular climb to Frodsham Hill to try. Head east and you'll find the worthy village of Daresbury. The village is notable as the birthplace of of Alice's Adventures in Wonderland author Lewis Carroll who was born there in 1832. It includes the Lewis Carroll visitor centre where you can learn all about his life and try the 'Lewis Carroll's Boyhood Walk' which runs from Daresbury church to the site of the parsonage, passing through fields and lanes that the young Carroll would have known. For more walking ideas in the area see the Cheshire Walks and the Merseyside Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/0se8rQ19DRE",
  "district": "Runcorn",
  "county": "Halton",
  "region": "Liverpool City Region",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "79a, Highlands Road, Westfield, Runcorn Heath, Weston, Runcorn, Halton, Liverpool City Region, England, WA7 4PT, United Kingdom",
  "postcode": "WA7 4PT",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland",
    "river"
  ],
  "points_of_interest": [
    "views",
    "nature reserve"
  ],
  "facilities": [
    "visitor center",
    "cafe",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}