{
  "created_at": "2025-01-06T03:25:38.686470+00:00",
  "objectID": "c47b5760ae8158674a200d8e87072dc9",
  "ref": "ilkley-moor-walking-route",
  "title": "Ilkley Moor Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/28/Cowper%27s_Cross%2C_Ilkley_Moor_-_geograph.org.uk_-_48269.jpg",
  "nearby": [
    {
      "description": "Cow and Calf and Twelve Apostles",
      "objectID": "efffa2845b204a8c8931afd9859949b2",
      "ref": "cow-and-calf-and-twelve-apostles-walking-route"
    },
    {
      "description": "Dales Way",
      "objectID": "605d1dad48e02d248ecb985988bc777c",
      "ref": "dales-way-walking-route"
    },
    {
      "description": "Ebor Way",
      "objectID": "460b6eaefa835488435e3937ef49f82d",
      "ref": "ebor-way-walking-route"
    },
    {
      "description": "Ilkley Riverside Walk",
      "objectID": "676294fae5e9cad68c07032bb09add56",
      "ref": "ilkley-riverside-walk-walking-route"
    },
    {
      "description": "Ilkley to Addingham",
      "objectID": "bba1c515c357c904f4cdb48c20dcb18f",
      "ref": "ilkley-to-addingham-walking-route"
    },
    {
      "description": "Shipley Glen",
      "objectID": "fd5590a126ab1af86659bfab27a70b5c",
      "ref": "shipley-glen-walking-route"
    },
    {
      "description": "Baildon Moor",
      "objectID": "97bbafde0bce261b061b1da60a4845b8",
      "ref": "baildon-moor-walking-and-cycle-route"
    },
    {
      "description": "Saltaire",
      "objectID": "8bf4e7a98d229c95d272714d9ad8eeeb",
      "ref": "saltaire-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c47b5760ae8158674a200d8e87072dc9.gpx",
  "_geoloc": {
    "lat": 53.9162174258,
    "lng": -1.8007860458
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Cowper%27s_Cross%2C_Ilkley_Moor_-_geograph.org.uk_-_48269.jpg",
      "title": "David Spencer / Cowper's Cross, Ilkley Moor",
      "caption": "Cowper's Cross. The inscription on the base reads 'ILB. IM. 1803'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Willy_Hall%27s_Spout_-_Ilkley_Moor_-_geograph.org.uk_-_1629209.jpg/256px-Willy_Hall%27s_Spout_-_Ilkley_Moor_-_geograph.org.uk_-_1629209.jpg",
      "title": "Hugh Chappell / Willy Hall's Spout - Ilkley Moor",
      "caption": "Willy Hall's Spout waterfall. On the northern side of the moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Rock_outcrop_Ilkley_Moor_-_geograph.org.uk_-_1020371.jpg",
      "title": "Gordon Hatton / Rock outcrop Ilkley Moor",
      "caption": "Rock outcrop Ilkley Moor known as the Pancake Stone. The view is looking north west towards the Cow and Calf."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Green_Crag%2C_Ilkley_Moor_-_geograph.org.uk_-_44780.jpg",
      "title": "David Spencer / Green Crag, Ilkley Moor",
      "caption": "Green Crag. Outcrop of rock with view northwards to Denton Moor on the other side of Wharfedale. Just visible dead centre is a carving that reads 'W M 1781'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Thimble_Stones%2C_Ilkley_Moor_-_geograph.org.uk_-_1252089.jpg",
      "title": "Rob Bainbridge / Thimble Stones, Ilkley Moor",
      "caption": "Thimble Stones"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Grainings_Head%2C_Ilkley_Moor_-_geograph.org.uk_-_48274.jpg",
      "title": "David Spencer / Grainings Head, Ilkley Moor",
      "caption": "Grainings Head. Bracken covered stream heads dissect the northern slopes of the moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Below_Ilkley_Moor_-_geograph.org.uk_-_1332270.jpg",
      "title": "Colin Smith / Below Ilkley Moor",
      "caption": "Below the moor. The gentle hillside descends from the moor to the town. The roads follow the contours to left and right of photograph. In the background is the Cow and Calf Hotel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/North_side_of_Ilkley_Moor_-_geograph.org.uk_-_1020365.jpg",
      "title": "Gordon Hatton / North side of Ilkley Moor",
      "caption": "North side of the moor. Looking across a corner of an old quarry and beyond the hidden gill of Backstone Beck towards High Crag and Addingham High Moor."
    }
  ],
  "distance_km": 8.0,
  "description": "Visit this geologically fascinating area of West Yorkshire on this challenging and atmospheric circular walk on Ilkley Moor. The moor is in an elevated position above the town with attractive moorland and wonderful views over the surrounding countryside. It's a beautiful place with pretty heather in the summer and a myriad of different footpaths to follow. Ilkley Moor is located just to the south of the town of Ilkley so you could easily reach it from the bus or train station in the centre of the town. Then follow the Dales Way Link south to take you onto the moor. This route, however, starts from the Cow and Calf car park on Hangingstone Road. Near here you will find the well known Cow and Calf rocks. This striking rock formation consists of a large rock and a smaller one, sitting next to each other like a cow and its calf. From the rocks follow the paths west across the moor to Cranshaw Thorn Hill and Keighley Road, where you turn south to Whetstone Gate. The route then turns east to take you to another of the major landmarks on the moor. The Twelve Apostles is a fascinating Bronze Age stone circle with 12 stones made from the local millstone grit. After leaving the Twelve Apostles you head north back towards the car park passing the Backstones stone circle on the way. After your exercise you can enjoy refreshments at the excellent Cow and Calf pub. For an alternative circular walk which visits Backstone Beck, Lanshaw Dam and Burley Moor see the Cow and Calf and Twelve Apostles Walk. The moor is also crossed by two excellent long distance walking trails. You could pick up the Dales Way Link and follow it north through Ilkley where it meets the Dales Way. This will take you along the River Wharfe towards Bolton Abbey and Addingham on our Ilkley Riverside Walk. Follow it south and it will take you across Bingley Moor to Saltaire, Baildon Moor and Shipley. The Ebor Way also crosses the moor. You could follow it to the site from nearby Menston. For cyclists the West Yorkshire Cycle route runs along the eastern fringe of the moor.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "By the Cow and Calf site there's some good options for refreshments including the popular Rock Cafe. They have a decent selection of meals and snacks which you can enjoy with a view over the moor. The 19th century Cow and Calf pub is also on the eastern fringes of the moor. They serve good quality pub grub and have a fine garden area for warmer weather. You can find them on the Hangingstone Road at postcode LS29 8BT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The moorland trails make for a fine dog walk. Both the Rock Cafe and the pub mentioned above are also dog friendly. There are some rules surrounding ground nesting birds and the sheep on the moor. Please click here for more information."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Burley in Wharfedale Walk visits the moor from the train station at the nearby settlement. The village itself is well worth exploring with a delightful village green and some historic old buildings on the Main Street. It's located just a couple of miles north east of the Cow and Calf Rocks on the eastern edge of the moor. The Dales High Way crosses the moor. This long distance waymarked trail explores many of the highlights of the Dales, running from Saltaire to Appleby-in-Westmorland for a distance of approximately 90 miles. For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/DKAhcZO0M20",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hangingstone Road, Ben Rhydding, Ilkley, Bradford, West Yorkshire, England, LS29 8RF, United Kingdom",
  "postcode": "LS29 8RF",
  "district": "Bradford",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "rock"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "stone circles"
  ],
  "facilities": [
    "car park",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}