{
  "created_at": "2025-01-06T00:13:40.021517+00:00",
  "objectID": "c48fb23e27feeeea185d149ec0d0b06d",
  "ref": "pentewan-trail-walking-and-cycle-route",
  "title": "Pentewan Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Bike_hire%2C_Pentewan_-_geograph.org.uk_-_1389629.jpg",
  "nearby": [
    {
      "description": "Lost Gardens of Heligan",
      "objectID": "7341db414faccd0638034c6c5fa430c9",
      "ref": "lost-gardens-of-heligan-walking-route"
    },
    {
      "description": "Mevagissey",
      "objectID": "218ad351954d52da1e29bb640bfe039f",
      "ref": "mevagissey-walking-route"
    },
    {
      "description": "St Austell",
      "objectID": "98d74e84776e6797473d79b3f91c678e",
      "ref": "st-austell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c48fb23e27feeeea185d149ec0d0b06d.gpx",
  "_geoloc": {
    "lat": 50.3373322338,
    "lng": -4.7900884801
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Bike_hire%2C_Pentewan_-_geograph.org.uk_-_1389629.jpg",
      "title": "Derek Harper / Bike hire, Pentewan",
      "caption": "Bike hire, Pentewan. At the southern end of the Pentewan Valley Trail; in the background is West End, by the St Austell River bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Road_bridge_over_cycleway_nr._Heligan_-_geograph.org.uk_-_493327.jpg",
      "title": "Peter Goodwin / Road bridge over cycleway nr. Heligan",
      "caption": "Road bridge over cycleway near Heligan. This stretch of National Cycleway route 3 links St Austell to Heligan gardens and Mevagissey. Here it takes riders and walkers beneath traffic approaching the gardens by the main access road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Footbridge_by_Nansladron_-_geograph.org.uk_-_1215327.jpg",
      "title": "John Gibson / Footbridge by Nansladron",
      "caption": "Footbridge by Nansladron. Modern footbridge over the St Austell (or White) River, providing access from Nansladron to the Pentewan Trail and King's Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/St_Austell_River_and_Pentewan_Railway_trail_-_geograph.org.uk_-_1215303.jpg",
      "title": "John Gibson / St Austell River and Pentewan Railway trail",
      "caption": "St Austell River and Pentewan Railway trail. The route of the old 2'6\" gauge Pentewan railway provides a pleasant walk along the river from London Apprentice to the harbour at Pentewan. The railway opened in 1829 to support the china clay industry. It was horse-powered until 1874, after which steam locomotives took over. The line closed in 1916 when heavy silting closed the harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Track_junction%2C_King%27s_Wood_-_geograph.org.uk_-_1389884.jpg",
      "title": "Derek Harper / Track junction, King's Wood",
      "caption": "Track junction, King's Wood. The trail joins a made-up track through King's Wood, although, according to the maps, it is here actually in Peckhill Wood or Shepherdshill Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Erosion%2C_St_Austell_River_-_geograph.org.uk_-_1215313.jpg",
      "title": "John Gibson / Erosion, St Austell River",
      "caption": "Erosion, St Austell River. Serious erosion of both banks of the river at this point is starting to threaten the farm road on the right and the trail just out of shot on the left. Erosion is a constant problem on the White River and various remedies have been tried, with varying degrees of success."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Living_Sculpture_-_geograph.org.uk_-_50462.jpg",
      "title": "Lee Jones / Living Sculpture",
      "caption": "Living Sculpture. Lost Gardens of Heligan"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Mevagissey_Harbour_-_geograph.org.uk_-_1388980.jpg",
      "title": "Derek Harper / Mevagissey Harbour",
      "caption": "Mevagissey Harbour. An archetypal Cornish fishing village. \"There are currently 63 registered fishing vessels in the harbour worked by 69 fishermen\" Mevagissey . In the background, houses rise on The Cliff above East Wharf."
    }
  ],
  "distance_km": 11.0,
  "description": "The Pentewan trail is a lovely traffic free cycle and walking path running from St Austell to Mevagissey. The trail follows National Cycle Route 3 along an old railway line and the St Austell River for part of the way and also includes a woodland section through King's Wood. There is also a short detour to the beautiful Lost Gardens of Heligan which boasts 200 acres of gardens including Victorian Productive Gardens, romantic Pleasure Grounds, and a lush sub-tropical Jungle. From Heligan the path descends to the finish point at the lovely harbour at Mevagissey. Also please note that at King's Wood there is the option of heading to the beach and harbour at Pentewan.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At one end of the route there's the Sharksfin in Mevagissey. The pub is ideally located next to the quay with lovely views across village's impressive harbour. They do excellent seafood including a particularly popular fish and chips. The interior is very attractive too, being decorated with works by local artists. You can find them at a postcode of PL26 6QU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is a nice one to do with your dog though there are likely to be quite a few cyclists so it's best to keep them under control. The Sharksfin mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Mevagissey Walk uses part of the trail and the coastal path to create a circular walk around the village. The picturesque fishing village is also well worth exploring with its photogenic harbour and interesting narrow streets full of quaint old shops and pretty cottages. In St Austell you could enjoy a stroll around the lovely Pinetum Gardens. The 30-acre garden is home to one of the largest plant collections in the county.  For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZP0pQVUKNwY",
  "postcode": "PL25 4SZ",
  "district": "St. Austell",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Eastbourne Road, St. Austell, Cornwall, England, PL25 4SZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "coastal"
  ],
  "points_of_interest": [
    "gardens",
    "harbour",
    "woodland"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "cycling",
    "walking"
  ]
}