{
  "created_at": "2025-01-06T04:39:40.543432+00:00",
  "objectID": "c4a7bb1d1caa3313a2c2fa2ea39a1c1d",
  "ref": "gors-fawr-stone-circle-walking-route",
  "title": "Gors Fawr Stone Circle Walk  Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/24/Gors_Fawr_and_Carn_Menyn_-_geograph.org.uk_-_1404584.jpg",
  "nearby": [
    {
      "description": "Foel Cwmcerwyn",
      "objectID": "cd2892de3bb88a2e954a5a1e783ddf17",
      "ref": "foel-cwmcerwyn-walking-route"
    },
    {
      "description": "Pentre Ifan",
      "objectID": "eabad2547faa8d2c95e0c29f62d9badb",
      "ref": "pentre-ifan-walking-route"
    },
    {
      "description": "Preseli Hills Golden Road",
      "objectID": "5e196dcea8877c3280ce4e837a046270",
      "ref": "preseli-hills-golden-road-walking-route"
    },
    {
      "description": "Carn Ingli",
      "objectID": "68fae655afb7734403ad971b1f7946f1",
      "ref": "carn-ingli-walking-route"
    },
    {
      "description": "Foel Eryr",
      "objectID": "339cf5558b6d9184f72ec40d01e35136",
      "ref": "foel-eryr-walking-route"
    },
    {
      "description": "Foel Drygarn",
      "objectID": "94d0f41efd585c10dec64c9563f8f592",
      "ref": "foel-drygarn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c4a7bb1d1caa3313a2c2fa2ea39a1c1d.gpx",
  "_geoloc": {
    "lat": 51.9327250531,
    "lng": -4.7117616994
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Gors_Fawr_and_Carn_Menyn_-_geograph.org.uk_-_1404584.jpg",
      "title": "ceridwen / Gors Fawr and Carn Menyn",
      "caption": "Gors Fawr and Carn Menyn. An impressive cloudscape on a day of volatile summer weather. The sky in this wide open moorland is as much a presence as the surrounding hills, with light and shadow transforming the landscape in an endless dance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Looking_NNE_from_Gors_Fawr_stone_circle_-_geograph.org.uk_-_1041040.jpg",
      "title": "Richard Law / Looking NNE from Gors Fawr stone circle",
      "caption": "Looking NNE from Gors Fawr stone circle. View over the stone circle to the eastern end of the main Mynydd Preseli, with the rocky summit outcrops of Carn Menyn in the background. Given that Carn Menyn is thought to be the source of the 'bluestone' dolerite stones at Stonehenge, it seems quite plausible that it's also the source of the rocks for many of the circles and other features in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Standing_stones_at_Gors_Fawr_-_geograph.org.uk_-_1404620.jpg",
      "title": "ceridwen / Standing stones at Gors Fawr",
      "caption": "There is a suggestion that these two megaliths may have been part of an avenue leading to the stone circle. The ground is swampy (Gors Fawr means Big Bog) and sheep-cropped now but the landscape would have been very different in prehistoric times - presumably with much more vegetation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Western_standing_stone_at_Gors_Fawr_-_geograph.org.uk_-_1404611.jpg",
      "title": "ceridwen / Western standing stone at Gors Fawr",
      "caption": "Western standing stone at Gors Fawr. The stone is seen here with a sightline to Talfynydd to the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Cofio-remembering_Waldo_Williams_-_geograph.org.uk_-_1404260.jpg",
      "title": "ceridwen / Cofio/remembering Waldo Williams",
      "caption": "Cofio/remembering Waldo Williams. The upright bluestone on Rhos Fach near Mynachlogddu was erected in memory of the great Welsh Nationalist, poet, pacifist, and Quaker who lived and taught in the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Bluestone_pillar_on_Rhos_Fach_-_geograph.org.uk_-_2589396.jpg/512px-Bluestone_pillar_on_Rhos_Fach_-_geograph.org.uk_-_2589396.jpg",
      "title": "Bluestone pillar on Rhos Fach by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bluestone pillar on Rhos Fach"
    }
  ],
  "distance_km": 1.4,
  "description": "This walk visits a fascinating ancient site in the Preseli Hills of Pembrokershire. The stones are located just to the south of the village of Mynachlog-ddu. You can park in a lay bay close to the stones and then follow a footpath to the site. Here you will find 16 stones up to 1m or so high, including bluestones. The area has connections to Stonehenge as bluestones of various types originated around the prehistoric stone quarries of Carn Meini. The tranquil area also provides fine views of the surrounding hills and countryside. Look out for wildlife including Red Kite, Yellow Hammer and Snipe. Just to the north you could also visit the Waldo Williams memorial stone. Williams was one of the eminent Welsh language poets of the 20th century and came from nearby Mynachlogddu. In this area there's also a Preseli Bluestone monolith. This stone was quarried in Carn Menyn, the rocky outcrop in the distance, and was erected to commemorate the origin of Stonehenge’s beautiful bluestone monoliths. To contine your walking in the area there's the climb to the fine viewpoints at Foel Eryr, and Foel Cwmcerwyn, the highest point in the Presili Hills. The ancient hillfort at Foel Drygarn is also located just to the north east.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In nearby Rosebush there's Rosebush Quarry to explore. The site's unusual landscape includes hidden pools, an arched underground tunnel, steep cliff faces, heath, grassland and pine trees. Near the village of Brynberian there's more ancient history to discover at the Waun Mawn Standing Stones. The Neolithic stone circle may have supplied stones to Stonehenge supporting a hypothesis of migration of both people and animals from Wales to Stonehenge. There are more fine views from the top of the hill next to the atmospheric stones. You can find the site about 2 miles south west of Brynberian. A little further to the north there's Pentre Ifan. Here you will find the most well preserved neolithic dolmen in Wales. To the north west there's the climb to Carn Ingli in the Preseli Hills. It's a worthy climb with a number of fascinating ancient sites dating from the Iron Age and the Bronze Age. There's also some glorious views to the coast from the summit."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gSVT95pm3kk",
  "postcode": "SA66 7SE",
  "county": "Pembrokeshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mynachlog-Ddu, Mynachlogddu, Pembrokeshire, Cymru / Wales, SA66 7SE, United Kingdom",
  "district": "Mynachlogddu",
  "state": "Cymru / Wales"
}