{
  "created_at": "2025-01-06T02:33:14.651507+00:00",
  "objectID": "c4d84921196f376387c6bdfc5508d52f",
  "ref": "towton-battlefield-walking-route",
  "title": "Towton Battlefield Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Renshaw_Woods_Track_-_geograph.org.uk_-_270776.jpg",
  "nearby": [
    {
      "description": "Jorvic Way",
      "objectID": "7a353e892d2c506a9cebc22a31e84d8a",
      "ref": "jorvic-way-walking-route"
    },
    {
      "description": "Ebor Way",
      "objectID": "460b6eaefa835488435e3937ef49f82d",
      "ref": "ebor-way-walking-route"
    },
    {
      "description": "Tadcaster Viaduct Walk",
      "objectID": "44e5492f8b5b979c55e7e27436548937",
      "ref": "tadcaster-viaduct-walk-walking-route"
    },
    {
      "description": "Lotherton Hall Estate",
      "objectID": "e25e4d911f6c64482bbcd52fd364c665",
      "ref": "lotherton-hall-estate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c4d84921196f376387c6bdfc5508d52f.gpx",
  "_geoloc": {
    "lat": 53.8506989323,
    "lng": -1.2645449006
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Renshaw_Woods_Track_-_geograph.org.uk_-_270776.jpg",
      "title": "Darren Haddock / Renshaw Woods Track",
      "caption": "Renshaw Woods Track"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Farmland_-_geograph.org.uk_-_271805.jpg",
      "title": "Darren Haddock / Farmland",
      "caption": "Farmland. By the B1217 looking towards Renshaw Woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/The_road_to_victory_for_the_Yorkists_-_geograph.org.uk_-_788197.jpg",
      "title": "Steve F [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "The road to victory for the Yorkists"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Lord_Dacre%27s_cross_-_geograph.org.uk_-_1007967.jpg",
      "title": "David Pickersgill / Lord Dacre's cross",
      "caption": "Lord Dacre's cross. Commemorates the Battle of Towton, much of which took place across the fields in the background. The cross and its neighbouring holly bush are prominent landmarks in their hedgeless surroundings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/The_Battle_of_Towton_-_geograph.org.uk_-_3536394.jpg",
      "title": "The Battle of Towton by Andy Farrington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "An information board at the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Towton_-_geograph.org.uk_-_2680956.jpg",
      "title": "Towton by Andy Farrington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Towton village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Walking_the_Trail_-_geograph.org.uk_-_3536808.jpg",
      "title": "Walking the Trail by Andy Farrington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Walking the Trail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Saxton_Grange%2C_Saxton_-_geograph.org.uk_-_151404.jpg",
      "title": "RichTea, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Saxton Grange, Saxton"
    }
  ],
  "distance_km": 6.2,
  "description": "This historical walk explores the site of the Battle of Towton which was fought on 29 March 1461 near the Yorkshire village of Towton. It was a significant battle during the English Wars of the Roses, fought between the houses of Lancaster and York for control of the English throne. The battle resulted in an overwhelming victory for the Yorkists and a subsequent change of monarchs, with the victor Edward of York (becoming King Edward IV) displacing Henry VI as king. The route runs for about 4 miles on a series of reasonably flat footpaths and roadside paths. You can start the walk from Towton village and head west on the Old London Road to meet up with the Towton Battlefield Trail. The signposted trail includes a number of information boards detaling the events of the terrible battle. Follow the trail south past Renshaw Wood to Bloody Meadow, next to the Cock Beck. The meadow was so named after the violent battle which was probably the largest and bloodiest battle ever fought on English soil. A newsletter circulated a week after the battle reported that 28,000 died on the battlefield. Near here you will also see the Towton Cross which was erected on the battlefield to commemorate the event. After exploring the site you return to the village along the quiet B road. Here you can enjoy refreshments at the very fine Rockingham Arms pub. The village is located just to the south of Tadcaster. Here you can continue your walking by picking up the Jorvic Way or the Ebor Way long distance footpaths. There's nice waterside trails along the River Wharfe to try, with a visit to the impressive Tadcaster Viaduct also recommended.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head west of Saxton and you will soon come to the Crooked Billet. The pub does lovely home cooked food and is famous for its giant Yorkshire puddings. There's also a nice garden area for warmer days. You can find the inn just west of Saxton village at a postcode of LS24 9QN for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of Saxton you'll find another highlight of the area at the Lotherton Hall Estate. The fine Edwardian house is surrounded by beautiful parkland with woodland, a deer park and a bird garden to see. The circular Aberford Walk starts in the nearby village and explores the surrounding countryside before visiting the hall. Just north of the village you can pick up the Hazlewood Castle Walk and visit the nearby country estate. Here you'll find expansive bluebell woods and a mountain bike trail located to the west of the 18th century mansion which is now run as a hotel. The castle overlooked the battlefield and also provided refuge for Catholic priests during the persecution of Catholics through the reign of Henry VIII.Parlington Woods on the historic Parlington Hall Estate can be visited near here. Just north of the woods you can also explore the villages of Barwick-in-Elmet and Thorner. Here you could visit Bramham Park where there are hundreds of acres of parkland, gardens, woodland and countryside to explore. The landscaped park surrounds the historic 18th century Bramham House which is a Grade I listed building."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zTsVJ1HOpCg",
  "district": "Towton",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}