{
  "created_at": "2025-01-06T02:22:29.786407+00:00",
  "objectID": "c54cea16d5da30895a5aa92bddde126f",
  "ref": "parlick-and-fair-snape-fell-walking-route",
  "title": "Parlick and Fair Snape Fell Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Parlick_Fell_%28geograph_3344091%29.jpg/512px-Parlick_Fell_%28geograph_3344091%29.jpg",
  "nearby": [
    {
      "description": "Beacon Fell Country Park",
      "objectID": "59eac5e7d245ffa44a8c3a34737a93e3",
      "ref": "beacon-fell-country-park-walking-route"
    },
    {
      "description": "Longridge Fell",
      "objectID": "39cc1405ba33a9bac245bce4aff10c38",
      "ref": "longridge-fell-walking-route"
    },
    {
      "description": "Bleasdale Circle",
      "objectID": "abb0eaed16e898433f88bd62257e6603",
      "ref": "bleasdale-circle-walking-route"
    },
    {
      "description": "Calder Vale",
      "objectID": "18e90661494cce56b0096fbbb9322271",
      "ref": "calder-vale-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c54cea16d5da30895a5aa92bddde126f.gpx",
  "_geoloc": {
    "lat": 53.8931322919,
    "lng": -2.6085757437
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Parlick_Fell_%28geograph_3344091%29.jpg/512px-Parlick_Fell_%28geograph_3344091%29.jpg",
      "title": "Rude Health / Parlick Fell",
      "caption": "The large summit cairn of Parlick Fell with a widespread view to the bulk of Fair Snape Fell. The fell stands at 432 metres and is a P34 hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Stone_framed_Dusk_-_Kemple_End%2C_Beacon_Fell%2C_Parlick._-_geograph.org.uk_-_1652865.jpg",
      "title": "Tom Howard / Stone framed Dusk - Kemple End, Beacon Fell, Parlick.",
      "caption": "Stone framed Dusk - Kemple End, Beacon Fell, Parlick. This photo was taken at 4.32pm looking through the stone frame at the top of the steps next to Clitheroe Castle Keep. In the dusk from left to right we see Kemple End (the local name for the eastern end of Longridge Fell), the small hump in the centre is Beacon Fell which looks like a whale back when seen closer rising out of the lower land around. Lastly we have Parlick. Snow is on the ground which can be seen on the roofs of the houses in the town of Clitheroe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/View_from_Parlick_-_geograph.org.uk_-_542133.jpg",
      "title": "wfmillar / View from Parlick",
      "caption": "View from Parlick Looking over Fell Foot to Longridge Fell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Parlick_from_Fair_Snape_Fell_7948.jpg",
      "title": "Stephen Dawson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A view back to Parlick from Fair Snape Fell"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Cairn_on_Fair_Snape_Fell_-_geograph.org.uk_-_1713383.jpg/512px-Cairn_on_Fair_Snape_Fell_-_geograph.org.uk_-_1713383.jpg",
      "title": "Bill Boaden / Cairn on Fair Snape Fell",
      "caption": "Cairn on Fair Snape Fell. This is at the other end of the summit plateau, but is marginally higher than the trig point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Destination_Ahead_-_geograph.org.uk_-_1126326.jpg",
      "title": "John Darch / Destination Ahead",
      "caption": "The track over Blindhurst Fell makes a beeline for the summit of Parlick."
    }
  ],
  "distance_km": 7.0,
  "description": "This walk from Parlick Fell to Fair Snape Fell is considered one of the loveliest in the Forest of Bowland. The walk takes place on a very good footpath with wonderful views over the surrounding countryside from the high points. The walk starts at the parking area on Startifants Lane and climbs to Parlick Fell. You continue north to Fair Snape, passing Bindhurst Fell on the way. The summit stands at 520 m (1,710 ft) and commands wonderful views over Londridge Fell and Beacon Fell. The walk can also be started from the nearby village of Chipping. It's located about 2 miles south east of Parlick Fell and is a great place to stop for refreshments. If you'd like to continue your walking in the area then you could head to the nearby Beacon Fell Country Park for more wonderful views and woodland trails.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you head into nearby Chippping you could pay a visit to The Sun Inn for some post walk refreshment. The 17th century village pub includes a wood-fired pizza barn and a nice garden area. You can find them at 2 Windy Street with postcode PR3 2GD for your sat navs. There's also the friendly Tillotsons Arms on Talbot Street. The two roomed, beamed pub was built in 1836 and also has a garden area for warmer weather."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The climb is a good one for fit dogs and the Sun Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the south east there's the popular climb to Longridge Fell. There are good views to the distinctive hill from the summit of Parlick. Just to the west of Parlick you can pay a visit to the peaceful and atmospheric Bleasdale Circle. This Bronze Age circular earthwork is thought to be aligned with the sunrise of the Summer Solstice. Near here there's a bit of a hidden gem at Brock Bottom. Here you'll find a scenic picnic site next to the babbling River Brock. There's nice riverside trails and old mill ruins to see in this picturesque area. For more walking ideas in the area see the Forest of Bowland Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/a-Z-DvQBx78",
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Chipping, Ribble Valley, Lancashire, England, PR3 2NQ, United Kingdom",
  "postcode": "PR3 2NQ",
  "district": "Ribble Valley",
  "state": "England"
}