{
  "created_at": "2025-01-06T01:24:52.168334+00:00",
  "objectID": "c655ad75b91663f6b9f62d43b269491e",
  "ref": "chirk-castle-walking-and-cycle-route",
  "title": "Chirk Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/44/Chirk_Castle_-_geograph.org.uk_-_708265.jpg",
  "nearby": [
    {
      "description": "Chirk to Llangollen Canal Walk",
      "objectID": "27d7d9883158727469de2ff72575736b",
      "ref": "chirk-to-llangollen-canal-walk-walking-route"
    },
    {
      "description": "Offa's Dyke Path",
      "objectID": "0ee8e8143856fd9ce9c8286e5ac3ebbd",
      "ref": "offas-dyke-path-walking-route"
    },
    {
      "description": "Llanarmon Dyffryn Ceiriog",
      "objectID": "5aecbdcaa915ff3198c32caf96c9c4b7",
      "ref": "llanarmon-dyffryn-ceiriog-walking-route"
    },
    {
      "description": "Upper Ceiriog Valley Walk",
      "objectID": "eb6d6163669fa1b107c94550fa358dcb",
      "ref": "upper-ceiriog-trail-walking-and-cycle-route"
    },
    {
      "description": "Glyn Ceiriog",
      "objectID": "6babf28dd6c1d2534af627c723bd820c",
      "ref": "glyn-ceiriog-walking-route"
    },
    {
      "description": "Erbistock",
      "objectID": "a270605e3032a8797bda5ef8ed82e31c",
      "ref": "erbistock-walking-route"
    },
    {
      "description": "Nant Y Pandy",
      "objectID": "28771c5eda53d9830836922bd7555a67",
      "ref": "nant-y-pandy-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c655ad75b91663f6b9f62d43b269491e.gpx",
  "_geoloc": {
    "lat": 52.9356242345,
    "lng": -3.0914082944
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Chirk_Castle_-_geograph.org.uk_-_708265.jpg",
      "title": "Raymond Knapman / Chirk Castle",
      "caption": "Chirk Castle. The castle was built in 1295 by Roger Mortimer de Chirk, uncle of Roger Mortimer, 1st Earl of March as part of King Edward I's chain of fortresses across the north of Wales. It guards the entrance to the Ceiriog Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Chirk_Castle_-_geograph.org.uk_-_28853.jpg",
      "title": "Dave Smethurst / Chirk Castle",
      "caption": "Beautiful gardens and woods around the castle. A panoramic view of the park by Thomas Badeslade, published in 1742, shows the resulting grand baroque layout of formal gardens and avenues. This included formal gardens to the east of the castle, with a walled outer courtyard and kitchen gardens to the north. Most of this layout was swept away by extensive landscaping in the 1760s and 70s, undertaken by William Emes, on behalf of Richard Myddelton, including the construction of a ha-ha and the removal of the Davies gates to be re-erected at the New Hall entrance.These works were largely responsible for the present-day appearance of the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Chirk_Castle_-_geograph.org.uk_-_294486.jpg",
      "title": "RAY JONES / Chirk Castle",
      "caption": "Ornamental gateway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Chirk_Castle_Park_-_geograph.org.uk_-_543855.jpg",
      "title": "Trevor Rickard / Chirk Castle Park",
      "caption": "Chirk Castle Park. View eastwards from the ha-ha at the bottom of the garden. The steam is coming from the Cadbury factory near Chirk station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Chirk_Castle_gardens_-_geograph.org.uk_-_5394803.jpg/512px-Chirk_Castle_gardens_-_geograph.org.uk_-_5394803.jpg",
      "title": "Chirk Castle gardens by Chris Gunns, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The property is notable for its gardens, with clipped yew hedges, herbaceous borders, rock gardens and terraces and surrounded by 18th-century parkland. This parkland was originally laid out as a deer park in the 14th century. From the early 17th century there were both formal and kitchen gardens adjacent to the castle, probably on the eastern side. The gardens continued to develop after the English Civil War, including the construction of an outer courtyard to the north, surrounded by stone walls with a wrought-iron gateway. By 1719 the courtyard had been turfed over and the gates replaced by a magnificent set of wrought-iron gates and gate screen made by Robert and John Davies of Bersham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Entrance_to_Chirk_Castle_-_geograph.org.uk_-_4636875.jpg/512px-Entrance_to_Chirk_Castle_-_geograph.org.uk_-_4636875.jpg",
      "title": "Entrance to Chirk Castle by Jeff Buck, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Entrance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Offa%27s_Dyke_below_Chirk_Castle_-_geograph.org.uk_-_4430913.jpg",
      "title": "Offa's Dyke below Chirk Castle by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Offa's Dyke below Chirk Castle. A prominent feature of the park is the earthwork of Offa's Dyke, which passes within 200 yards of the castle. This is shown on the Badeslade drawing, labelled as ‘King Offa’s Ditch’, with the ornamental lake beyond. The earthwork was partly submerged by the creation of the lake. In 2018 and 2018 the Clwyd-Powys Archaeological Trust excavated a section across Offa's Dyke here, and found substantial remains of the ditch and bank. The parkland landscape had partly been responsible for preserving the remains of the Dyke."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Paths_and_bench_in_woodland_at_Chirk_Castle_-_geograph.org.uk_-_2995210.jpg",
      "title": "Paths and bench in woodland at Chirk Castle by Mick Malpass, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Paths and bench in woodland at Chirk Castle"
    }
  ],
  "distance_km": 4.0,
  "description": "Explore the gardens an wider estate surrounding this 13th century castle in Wrexham. The estate is a mixture of pasture and woodland and covers 460 acres with a number of well maintained footpaths to follow. The award-winning gardens cover 5.5 acres with lawns, herbaceous borders, rose, shrub and rock gardens, and a wooded pleasure ground. From the terrace overlooking the 18th century ha-ha there are stunning views over the Cheshire and Salop plains. You can extend your walking in the area by heading east from the castle and trying the Chirk to Llangollen Canal Walk. This passes the famous Pontcysyllte Aqueduct where you can also pick up the Panorama Walk which will take you up to the lovely World's End .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site courtyard cafe is a lovely place for refreshments after your walk. There's a good range of snacks and meals with some outdoor seating for finer days."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The expansive estate is great for dog walking but it's advised to keep them on leads."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Chirk train station is a short distance from the castle so it's quite easy to come by public transport if you prefer. The station is on the Shrewsbury to Chester Line 21 miles (34 km) north of Shrewsbury. There is an hourly northbound service to Holyhead via Wrexham General and Chester. There's also an hourly southbound service to Shrewsbury. Just to the south you can visit the Chirk Aqueduct and the adjacent viaduct. You can access the site by heading through the Chirk Tunnel just to the west of the train station. There are some glorious views over the River Ceiriog Valley from the top of the elevated structure. Crossing the aqueduct will take you across the border into England. In Chirk you can continue your walking by picking up a nice waymarked walking trail along the River Ceiriog. If you follow it west it links up with the Offa's Dyke Path National Trail. You could follow this epic trail north to visit Warren Wood, just to the west of the castle. Head south and it will take you to Selattyn Hill. To the west you can visit the villages of Glyn Ceiriog and Llanarmon Dyffryn Ceiriog where you can explore the beautiful Upper Ceiriog Valley and enjoy a waterside walk along Nant Y Pandy. The splendid Berwyn Mountains can also be explored on the North Berwyn Way in this area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jPsYbTNGdRo",
  "postcode": "SY10 7NA",
  "county": "Wrexham",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Castle Road, Fish Farm, Chirk, Wrexham, Cymru / Wales, SY10 7NA, United Kingdom",
  "district": "Chirk",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "views",
    "gardens"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}