{
  "created_at": "2025-01-06T04:52:57.534722+00:00",
  "objectID": "c6578b2e1d19ac4985bfee5bda5c407a",
  "ref": "west-bridgford-walking-route",
  "title": "West Bridgford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Wilford_Suspension_Bridge_0365.JPG/512px-Wilford_Suspension_Bridge_0365.JPG",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c6578b2e1d19ac4985bfee5bda5c407a.gpx",
  "_geoloc": {
    "lat": 52.9252484879,
    "lng": -1.1640617878
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Wilford_Suspension_Bridge_0365.JPG/512px-Wilford_Suspension_Bridge_0365.JPG",
      "title": "Photograph by Clem Rutter, Rochester, Kent. (www.clemrutter.net)., CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Wilford Suspension Bridge is a combined pedestrian footbridge and aqueduct which crosses the River Trent linking the town of West Bridgford to the Meadows in the city of Nottingham. It also carries a gas main."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Nottingham_War_Memorial_0370.JPG/512px-Nottingham_War_Memorial_0370.JPG",
      "title": "Photograph by Clem Rutter, Rochester, Kent. (www.clemrutter.net)., CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "The City War Memorial, Nottingham is the main War Memorial for the City of Nottingham, It is located the Meadows opposite West Bridgford. It was designed by T. Wallis Gordon, Nottingham City Engineer and Surveyor. The foundation stone was laid 1 August 1923. To the east is the River Trent, and to the west the Memorial Gardens with fountains and a statue of Queen Victoria."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Bridge_over_River_Trent_West_Bridgford_-_geograph.org.uk_-_1129319.jpg",
      "title": "David Colyer / Bridge over River Trent West Bridgford",
      "caption": "Bridge over River Trent West Bridgford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/In_Colwick_Country_Park%2C_looking_towards_Colwick_Hall_-_geograph.org.uk_-_651490.jpg",
      "title": "Alan Murray-Rust / In Colwick Country Park, looking towards Colwick Hall",
      "caption": "In Colwick Country Park, looking towards Colwick Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Pleasure_boats_on_the_river_-_geograph.org.uk_-_785203.jpg",
      "title": "Kate Jewell / Pleasure boats on the river",
      "caption": "Pleasure boats on the river"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Skylarks_Nature_Reserve_-_geograph.org.uk_-_1386202.jpg",
      "title": "Alan Murray-Rust / Skylarks Nature Reserve",
      "caption": "Skylarks Nature Reserve at Holme Pierrepont. This section of the country park attached to the National Water Sports Centre has been specifically developed as a nature reserve, based on an old gravel pit. In this section the open water has largely been taken over by reed bed growth. These three pleasure boats ply their trade up and down the River Trent between Wilford and Stoke Bardolf."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/National_Water_Sports_Centre_-_geograph.org.uk_-_1760565.jpg",
      "title": "JThomas / National Water Sports Centre",
      "caption": "National Water Sports Centre, Holme Pierrepont"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Winding_hole%2C_Grantham_Canal_-_geograph.org.uk_-_1801447.jpg",
      "title": "Kate Jewell / Winding hole, Grantham Canal",
      "caption": "Winding hole, Grantham Canal. Viewed from the towpath on the West Bridgford side of the canal at Gamston Bridge. Winding holes, wider semi circular basins, were provided along canals to allow the long narrow boats space to turn round. The word is correctly pronounced with a short \"i\" to rhyme with \"tinned\", it derives from the practice of using the prevailing wind to assist with the turn."
    }
  ],
  "distance_km": 16.5,
  "description": "This Nottinghamshire based market town is located just south of the city of Nottingham. The town is positioned next to the River Trent and includes a number of Victorian buildings and a medieval church. This walk follows a section of the Trent Valley Way east along the riverside path to Colwick Country Park and Holme Pierrepont Country Park. The parks are a lovely place for a stroll and include large lakes, meadows, the National Watersports centre and a nature reserve with lots of wildlife to see. The walk can be extended by continuing east along the river to visit the pretty villages of Radcliffe on Trent Shelford, Gunthorpe, Burton Joyce, Rolleston and Fiskerton. In Radcliffe you can try the Radcliffe on Trent Cliff Walk which takes you along an elevated tree lined path above the river. The area also includes the Rockley Memorial Park where you'll find lovely gardens in a peaceful setting.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk you could stop off at the Waterside Bar. They are located in a fine spot next to the river so you can sit outside on the terrace and enjoy a lovely view on warmer days. You can find them at 1 Bridgford House with a postcode of NG2 5GJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you were to head west along the river path it would take you to the Attenborough Nature Reserve where there's lots of water loving wildlife to see. On the eastern side of the town you can pick up the Grantham Canal and enjoy another waterside walk to the nearby Cotgrave Country Park. From here the canal can be followed to Hickling where there's a fine 18th century canalside pub. For more walking ideas in the area see the Nottinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tGRw4ZOIZ-c",
  "postcode": "NG11 7GD",
  "district": "City of Nottingham",
  "county": null,
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Clifton Lane, Wilford, City of Nottingham, East Midlands, England, NG11 7GD, United Kingdom",
  "state": "England"
}