{
  "created_at": "2025-01-06T03:06:27.883295+00:00",
  "objectID": "c664dd8905988bf737daef21f67285ba",
  "ref": "bickerton-hill-and-maiden-castle-walking-route",
  "title": "Bickerton Hill and Maiden Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/58/Musket%27s_Hole%2C_Bickerton_Hill_-_geograph.org.uk_-_183741.jpg",
  "nearby": [
    {
      "description": "Peckforton Castle and Peckforton Hills",
      "objectID": "3647f3b43e5157163d7ebd8099beae48",
      "ref": "peckforton-castle-and-peckforton-hills-walking-route"
    },
    {
      "description": "Bulkeley Hill",
      "objectID": "a65bda537579a54a7bd09df8e283fd9e",
      "ref": "bulkeley-hill-walking-route"
    },
    {
      "description": "Sandstone Trail",
      "objectID": "820c3e87805731081e451f661a9e79d4",
      "ref": "sandstone-trail-walking-route"
    },
    {
      "description": "Tattenhall",
      "objectID": "5382e8aac3168bf32619fad7557341a5",
      "ref": "tattenhall-walking-route"
    },
    {
      "description": "Wrenbury",
      "objectID": "dd81bbe44f7a23e65a54efe7b01e7972",
      "ref": "wrenbury-walking-route"
    },
    {
      "description": "Cholmondeley",
      "objectID": "4efa7d2134b47884c1f86ad2e115b026",
      "ref": "cholmondeley-walking-route"
    },
    {
      "description": "Malpas",
      "objectID": "b0f699d8ed63c9ba51df884742dd41a1",
      "ref": "malpas-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c664dd8905988bf737daef21f67285ba.gpx",
  "_geoloc": {
    "lat": 53.06756217,
    "lng": -2.75627017
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Musket%27s_Hole%2C_Bickerton_Hill_-_geograph.org.uk_-_183741.jpg",
      "title": "Espresso Addict / Musket's Hole, Bickerton Hill",
      "caption": "Musket's Hole, Bickerton Hill. Cattle below Musket's Hole on the northern of the hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Pasture_on_Bickerton_Hill_-_geograph.org.uk_-_184892.jpg",
      "title": "Espresso Addict / Pasture on Bickerton Hill",
      "caption": "Pasture on the hill. Rolling cattle pasture studded with mature deciduous trees, on the southern side of Bickerton Hill. The Cheshire plain stretches out in the distance, with the village of Bickerton hidden by the contours"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Lowland_heath_on_Bickerton_Hill_-_geograph.org.uk_-_184890.jpg",
      "title": "Espresso Addict / Lowland heath on Bickerton Hill",
      "caption": "Lowland heath on Bickerton Hill. Lowland heath with bilberry, heather and bracken, with occasional birch trees, on the summit of the hill. The ramparts of the iron age hill fort, Maiden Castle, are just off the left side of this view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Sandstone_Trail_on_Bickerton_Hill_-_geograph.org.uk_-_316788.jpg/256px-Sandstone_Trail_on_Bickerton_Hill_-_geograph.org.uk_-_316788.jpg",
      "title": "Espresso Addict / Sandstone Trail on Bickerton Hill",
      "caption": "Sandstone Trail on Bickerton Hill. The Sandstone Trail at this point forms a sunken track, with open grassland to the east (right) and heathland with scattered birches to the west (left). View northwards, near the crossroads with a minor path, on a sunny autumn morning"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Birch_woods_in_autumn_-_geograph.org.uk_-_313167.jpg/256px-Birch_woods_in_autumn_-_geograph.org.uk_-_313167.jpg",
      "title": "Espresso Addict / Birch woods in autumn",
      "caption": "Birch woods in autumn. The northern of the two peaks of Bickerton Hill is clothed in loose mixed deciduous woodland, mainly birch but with occasional oaks, rhododendron and other species. Underfoot is a mixture of dead leaves and dying bracken. This is the view on a sunny autumn morning in 2006"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Outer_rampart_of_Maiden_Castle_-_geograph.org.uk_-_184889.jpg",
      "title": "Espresso Addict / Outer rampart of Maiden Castle",
      "caption": "View of the outer rampart of Maiden Castle. This is the outer of the double ring of ramparts of the iron age hill fort. The National Trust sign on the left describes the fort: 'The area in front of you is Maiden Castle, a hill-fort of the iron age which has two ramparts, each with an external ditch, with a cliff forming the western edge of the settlement. There is a single entrance, with inturned defensive banks, into the interior. The ramparts were formed of stone and earth, held together with timber lacing. Scientific data suggests that the hill-fort was occupied around two thousand years ago.'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Panorama_from_Maiden_Castle_viewpoint_-_geograph.org.uk_-_185340.jpg/256px-Panorama_from_Maiden_Castle_viewpoint_-_geograph.org.uk_-_185340.jpg",
      "title": "Espresso Addict / Panorama from Maiden Castle viewpoint",
      "caption": "Panorama from Maiden Castle viewpoint. The viewpoint on the crags by the iron age fort of Maiden Castle gives a good view across pasture land of Harthill (left), Burwardsley Hill (centre) and the northern Bickerton Hill (right). The village of Brown Knowl is just to the left of the frame"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Ramparts_of_Maiden_Castle_-_geograph.org.uk_-_184888.jpg",
      "title": "Espresso Addict [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Ramparts of Maiden Castle"
    }
  ],
  "distance_km": 3.5,
  "description": "This walk uses part of the Sandstone Trail to visit Maiden Castle Iron Age hill fort and Bickerton Hill. It's a lovely area with the hills covered in pretty heather, bilberry bushes and yellow gorse. You'll reach a height of over 700ft with wonderful views over the Cheshire countryside to enjoy. The area is managed by the National Trust so there are good footpaths and conveniently located car parks. You can start your walk from the car park off the Old Coach Road near the village of Duckington. From here pick up the Sandstone Trail and climb through woodland to Larkton Hill and Maiden Castle. The hill fort dates from 600 BC commanding a fine view over the Cheshire Plain. From the fort you continue east to Gallantry Bank before turning north to climb to Raw Head, the highest point on the Bickerton Hills. Raw Head stands at a height of 227 m (745 ft) with more great views to enjoy from here. The area is well known for its varied flora and fauna. The attractive woodland areas consist of silver birch, aspen, holly, rowan, sessile oak and wild cherry trees. Look out for a wide variety of butterflies such as gatekeeper, red admiral, speckled wood and tortoiseshell. Interesting bird sightings include buzzard, kestrel, jay, long-tailed tit, magpie, nuthatch, raven, treecreeper and green woodpeckers. To extend your walk you can continue east along the Sandstone Trail to Bulkeley Hill and then explore the Peckforton Hills .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The aptly named Bickerton Poacher is conveniently located just to the east of the hill. It's a friendly pub with a good menu and an outdoor seating area for finer days. It's a nice place to relax and enjoy the view after your exercise. Indoors there's a cosy interior with a skittle alley if you fancy a game. They also do good quality accommodation and have a camp site if you need to stay over. You can find the pub on the Wrexham Rd, Bulkeley, with a postcode of SY14 8BE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and the surrounding woodland make for a very fine dog walk. The Bickerton Poacher pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can turn it into a longer circular walk by heading to Harthill and following country lanes south west to Brown Knowl. For a shorter circular walk head south along a country lane near Bickerton Farm at the foot of the hill. This will take you through Bickerton where you can pick up the Sandstone Trail and follow it north through Hether Wood back to the car park. The circular Burwardsley Walk starts from the nearby village and climbs to the hill as well as exploring the Peckforton Hills, Beeston Castle and the nearby Bulkeley Hill. A few miles to the west you will find the pleasant village of Tattenhall. Here you can visit the noteworthy Ice Cream Farm, the largest ice cream shop in the world. The popular tourist attraction includes expansive children's play areas, farm animals and quad bikes. You can find them at Drumlan Hall, Newton Ln, CH3 9NE. To the west there's the interesting village of Farndon. The village includes a noteworthy medieval bridge which spans the River Dee, connecting England to Holt in Wales. The Bishop Bennet Way and the Marches Way run past the settlement. Just to the south east you'll find Cholmondeley where you can explore the 19th century Cholmondeley Castle. The castle is surrounded by 70 acres of beautiful parkland and gardens with an arboretum, herbaceous borders and a fine viewpoint to enjoy. Near here there's also the market town of Malpas with its timber framed properties and noteworthy 14th century church. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/o7B4l5kcv_E",
  "postcode": "SY14 8LH",
  "county": "Cheshire West and Chester",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Allmans Lane, Duckington, Brown Knowl, Cheshire West and Chester, England, SY14 8LH, United Kingdom",
  "district": "Brown Knowl",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}