{
  "created_at": "2025-01-06T03:19:52.613422+00:00",
  "objectID": "c66dc2dddbf098368a268d4e522f9e20",
  "ref": "weybourne-walking-route",
  "title": "Weybourne Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Weybourne_Station_-_Platform_1_-_geograph.org.uk_-_748999.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c66dc2dddbf098368a268d4e522f9e20.gpx",
  "_geoloc": {
    "lat": 52.9435544859,
    "lng": 1.1390194885
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Weybourne_Station_-_Platform_1_-_geograph.org.uk_-_748999.jpg",
      "title": "Evelyn Simak / Weybourne Station - Platform 1",
      "caption": "Weybourne Station - Platform 1. The main station building, built in 1900 and opened in 1901, is largely in its original form but the waiting room on Platform 1 (seen here at right) is a replica of the original building which once stood here. The signal box (seen here at left) came from Holt, the footbridge is 'imported' also. During WWII the station served the large Army camp that used to be on the site now occupied by the Muckleburgh collection. Weybourne station is famous as the location of the \"Dad's Army\" episode \"Royal Train\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/N%C2%BA34081_92_SQUADRON_arriving_at_Weybourne_Station_-_geograph.org.uk_-_749016.jpg",
      "title": "Evelyn Simak / Nº34081 92 SQUADRON arriving at Weybourne Station",
      "caption": "Nº34081 92 SQUADRON arriving at Weybourne Station. This locomotive is a restored ex-British Railways Bulleid 'Battle of Britain' class pacific locomotive Nº34081 92 SQUADRON, so named after the Spitfire squadron that was based at Biggin Hill during the Battle of Britain in 1940. This locomotive entered service in September 1948 and was withdrawn in August 1964 and it is now owned by the Battle of Britain Locomotive Society. The Midland & Great Northern Joint Railway network once covered the map of Norfolk. The section between Sheringham and Holt (opened 1887, closed 1964) was saved by enthusiasts and re-opened in stages from 1976 onwards. Today, as the Poppy Line, it is one of Britain's foremost heritage railways, carrying over 126,000 passengers a year. The railway was built by William Marriott, who took the role of unpaid Assistant Engineer and was later offered a permanent post as Engineer by Wilkinson & Jarvis, the railway contractor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Track_past_Weybourne_Mill_-_geograph.org.uk_-_748892.jpg",
      "title": "Evelyn Simak / Track past Weybourne Mill",
      "caption": "Track past Weybourne Mill. This track turns off the A149 (Sheringham Road), providing access to cottages located on the headland further to the north. Weybourne mill is a five-storey red brick tower mill; it was built in 1850 and once had a white boat shaped cap with a petticoat, an 8-bladed fan, a gallery and a second floor stage. During the 1920s the mill was extensively restored; all machinery was removed and the roof raised. In 1969 new sails, which were lower than the roofline, were installed. The mill, presently without sails, is now a private dwelling house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/View_west_along_the_coast_-_geograph.org.uk_-_748946.jpg",
      "title": "Evelyn Simak / View west along the coast",
      "caption": "View west along the coast. The view was taken from the Norfolk Coast Path/Peddars Way, from the headland between Weybourne and Sheringham, here called The Spinney. Fishermen's tractors can be seen on the beach below Weybourne Hope in mid-distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Footpath_to_Weybourne_Road_-_geograph.org.uk_-_747659.jpg",
      "title": "Evelyn Simak / Footpath to Weybourne Road",
      "caption": "Footpath to Weybourne Road. The path leads from the A149 to the headland further to the north; the bridge carries the footpath over the North Norfolk Railway line; in the background the strong wind is blowing sand, lifted from the adjacent field, across the path. This bridge (it has the number 304) has three segmental brick arch spans and carries a public footpath and farm access over the line. The centre span is for a single line of track only, unlike the other overbridges on the railway. The roadway is unsurfaced and this has allowed water to seep into the structure and has resulted in the brickwork being severely damaged by frost action and precautionary strapping was placed around the piers by BR in the 1960's."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Perched_on_the_edge_-_geograph.org.uk_-_748931.jpg",
      "title": "Evelyn Simak / Perched on the edge",
      "caption": "Perched on the edge. A row of cottages on the headland between Weybourne and Sheringham, quite close to the eroding cliffs. The Norfolk Coast Path/Peddars Way leads past here"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Weybourne_beach_after_the_high_surge_%281%29_-_geograph.org.uk_-_613828.jpg",
      "title": "Evelyn Simak / Weybourne beach after the high surge (1)",
      "caption": "Weybourne beach after the high surge. Sea defences were breached in many areas along the east coast by the unusually high surge on 9th November 2007. Sections of dunes, cliffs and beaches were scoured away by the force of the waves. Here at Weybourne part of the pebble beach has been pushed landwards."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/All_Saints_Church_%281%29_-_geograph.org.uk_-_614155.jpg",
      "title": "Evelyn Simak / All Saints Church (1)",
      "caption": "All Saints Church viewed from the junction of Holt Road with the A149 (Sheringham Road). What appears to be another tower at the east end of the church (at right) is part of the ruin of a 12th century priory."
    }
  ],
  "distance_km": 2.7,
  "description": "This delightful little village is located between Cley and Sheringham on the Norfolk coast. Set within the Norfolk Coast AONB it's a splendid place to start a walk with coast, heathland, woodland and farmland to explore on a number of footpaths. This short circular walk from the village visits Weybourne Beach on the coast before heading to the historic Weybourne Windmill. The Grade II listed windmill was built in 1850 and consists of five storeys built from red brick. You'll also pass All Saints church where there's the ruins of the 12th century priory to see. Part of the route uses the Peddars Way and Norfolk Coast Path which you can use to extend your walking in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ship Inn is a nice place for post walk refreshment in the village. They have a fine dining room and a good bar area with 150 different types of gin to choose from! There's also a garden area for warmer days. You can find them at postcode NR25 7SZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a fine dog walk and the Ship mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Salthouse Circular Walk passes the village. You could pick this up and enjoy a climb to Kelling Heath where there are some fine trails and excellent views over the area. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/0Dfq-bYS3tA",
  "district": "North Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Camelot, 9, Home Farm Rise, Abbey Farm, Weybourne, North Norfolk, Norfolk, England, NR25 7SP, United Kingdom",
  "postcode": "NR25 7SP",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland",
    "farmland"
  ],
  "points_of_interest": [
    "historical sites",
    "church",
    "windmill"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}