{
  "created_at": "2025-01-06T05:13:34.417619+00:00",
  "objectID": "c678306dc727717f796c9fc00cf81038",
  "ref": "black-and-white-village-trail-walking-route",
  "title": "Black and White Village Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Leominster_Priory.jpg/512px-Leominster_Priory.jpg",
  "nearby": [
    {
      "description": "Leominster",
      "objectID": "98a575107d24ff077bcdde09eba6e774",
      "ref": "leominster-walking-route"
    },
    {
      "description": "Kington",
      "objectID": "81980bfb64aabe86f6f3fa3f725e3a88",
      "ref": "kington-walking-route"
    },
    {
      "description": "Pembridge",
      "objectID": "4eefd78d4e254f6654040d258a9045c0",
      "ref": "pembridge-walking-route"
    },
    {
      "description": "Weobley",
      "objectID": "ace5eb26c4ca7b54a7b5ec2e31f684fe",
      "ref": "weobley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c678306dc727717f796c9fc00cf81038.gpx",
  "_geoloc": {
    "lat": 52.2262891956,
    "lng": -2.7317400136
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Leominster_Priory.jpg/512px-Leominster_Priory.jpg",
      "title": "By Tony Grist (Photographer's own files) [Public domain], via Wikimedia Commons",
      "caption": "The 13th century Leominster Priory"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Orchard_Cottage%2C_Dilwyn_-_geograph.org.uk_-_1764564.jpg/512px-Orchard_Cottage%2C_Dilwyn_-_geograph.org.uk_-_1764564.jpg",
      "title": "Philip Pankhurst / Orchard Cottage, Dilwyn",
      "caption": "A view of the black and white Orchard Cottage in the village of Dilwyn. It's located next to the church and below the main road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Weobley_Village_-_geograph.org.uk_-_89509.jpg",
      "title": "P Fletcher / Weobley Village",
      "caption": "Weobley Village. Lovely view of the historic homes with the noteworthy church in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/The_hollow_Eardisley_Oak_-_geograph.org.uk_-_1232115.jpg/256px-The_hollow_Eardisley_Oak_-_geograph.org.uk_-_1232115.jpg",
      "title": "John Palmer / The hollow Eardisley Oak",
      "caption": "The hollow Eardisley Oak. Ancient oaks are usually hollow, and a small person can easily climb inside this one. The hollow interior is not man-made, it is actually caused by fungi, the most invasive of which is called the \"poor man's Beefsteak\" (Fistulina hepatica) whose fruiting bodies are sometimes seen growing on the bark of the tree during the Autumn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Pembridge._-_geograph.org.uk_-_150517.jpg",
      "title": "Colin Smith / Pembridge.",
      "caption": "Pembridge ancient houses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Eardisland_-_geograph.org.uk_-_364020.jpg",
      "title": "Philip Halling / Eardisland",
      "caption": "Eardisland Late winter sunshine in the village of Eardisland. In the background is the bridge over the river Arrow."
    }
  ],
  "distance_km": 69.0,
  "description": "This splendid circular walking trail visits a series of lovely Herefordshire towns and villages. It's named after the wonderful old timber framed buildings you can see in the settlements on the route. On the way there's also splendid rolling countryside and riverside trails along the River Arrow to enjoy. The walk starts at the train station in Leominster and first heads south west to Ivingtonbury, Coldharbour, Stretford Court before coming to the village of Dilwyn. It's a lovely little village with a green surrounded by the black and white cottages typical of the area. There's also the interesting Old Forge Gallery & Tea Room if you fancy a pit stop. The route continues a short distance to visit Weobley where there's an old church with a notable spire and The Ley, a Grade-I listed farmhouse dating to 1589 which lies just to the west of the village. From here you continue west to Sarnesfield Coppice, Meer Common, Woonton, Almeley and Eardisley. Of interest here is the exquisite 12th century font in the village church and a 900 year old hollow Great Oak. From here you head north, passing through the woodland at Hollywell Dingle before coming to Woodbrook and the market town of Kington. The town is an excellent base for walkers with the Mortimer Trail and the Offa's Dyke Path passing by. There's also the beautiful Hergest Croft gardens where there's a unique collection of over 5,000 rare plants, trees and shrubs. From Kington you head east along the River Arrow before passing through Lyonshall Park Wood with its Tramway Pool. Continue south east and you will come to Holme Marsh where you turn north east to Moorcot and Nutfield before coming to Pembridge. Here you will pass the photogenic Duppa's Almshouses in Bridge Street, founded in 1661. There's also the old church which includes a 13th century chancel. From here you can follow a footpath east along the river to Eardisland. It's a another lovely little place with an old stone bridge over the river which runs past the little cottages in the village. The next stage takes you north east towards Kingsland and Cobnash. Here you pick up a section along the Pinsley Brook which will lead you back towards Leominster.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The King's House restaurant in Pembridge is a historic inn well worth some investigation. The timber framed inn dates from the 1400s, having previously been a merchant's house. You can find them on East Street at a postcode of HR6 9HB for your sat navs. There's also The New Inn where there's good pub food and an outdoor seating area. This is located on the Market Square at a postcode of HR6 9DT. In neighbouring Eardisland there's The Cross Inn. The friendly pub has a good menu and a nice garden area. You can find them at postcode HR6 9BW. In Weobley there's The Sal to consider. The Grade II listed pub includes a fine interior with an oak-beamed bar. They serve delicious food and can be found at Market Pitch, HR4 8SJ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Kington you can pick up the Hergest Ridge Walk. The wonderful ridge runs between Kington and the little village of Gladestry in Powys, Wales. There are some excellent views over the area from the elevated ridge. The trail runs close to the worthy village of Shobdon. Here you can explore Shobdon Park, the Shobdon Court Estate and the pretty Pearl Lake which is the largest natural body of water in Herefordshire. There's also a fine 18th century pub to visit in the village. For more walking ideas in the area see the Herefordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cbAuH8TO1mE",
  "postcode": "HR6 8AU",
  "district": "Leominster",
  "county": "Herefordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Worcester Road, Leominster, Herefordshire, England, HR6 8AU, United Kingdom",
  "state": "England"
}