{
  "created_at": "2025-01-06T08:18:03.677911+00:00",
  "objectID": "c67c5b510a6b7c8ff0a010f9f8314c07",
  "ref": "selsley-common-walking-route",
  "title": "Selsley Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Cows_on_Selsley_Common_-_geograph.org.uk_-_192472.jpg",
  "nearby": [
    {
      "description": "Rodborough Common",
      "objectID": "dade778dcb7e6a2d03a842a75abc5023",
      "ref": "rodborough-common-walking-route"
    },
    {
      "description": "Woodchester Park",
      "objectID": "e7cd467bce60066811409e6dc0accda3",
      "ref": "woodchester-park-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Stroud",
      "objectID": "c31e845a6332436c2fb0c0ed71482064",
      "ref": "stroud-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c67c5b510a6b7c8ff0a010f9f8314c07.gpx",
  "_geoloc": {
    "lat": 51.7224173348,
    "lng": -2.2505468424
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Cows_on_Selsley_Common_-_geograph.org.uk_-_192472.jpg",
      "title": "Sharon Loxton / Cows on Selsley Common, via Wikimedia Commons",
      "caption": "Cows on Selsley Common. With so much land to roam on, these cows have chosen to find pasture perilously close to the B4066. Cattle grids placed a strategic locations prevent the cattle from straying from the commonland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Selsley_Common_just_before_sunset_-_geograph.org.uk_-_371950.jpg",
      "title": "Symon Parsley / Selsley Common just before sunset, via Wikimedia Commons",
      "caption": "Selsley Common just before sunset"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Selsley_Common_-_geograph.org.uk_-_361592.jpg",
      "title": "Symon Parsley / Selsley Common, via Wikimedia Commons",
      "caption": "View from a high point on the common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Selsley_Common_and_Hill_-_geograph.org.uk_-_433973.jpg",
      "title": "Graham Thomas / Selsley Common and Hill, via Wikimedia Commons",
      "caption": "Looking towards Selsley Common and Selsley Hill from the western edge of Rodborough Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Selsley_Common_looking_to_Rodborough%2C_Stroud_-_geograph.org.uk_-_1640195.jpg",
      "title": "Roger May / Selsley Common looking to Rodborough, Stroud, via Wikimedia Commons",
      "caption": "Looking across to the parish of Rodborough on the edge of Stroud in Gloucestershire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Pen_Hill_from_Selsley_Common_at_sundown_-_geograph.org.uk_-_546647.jpg",
      "title": "Jess / Pen Hill from Selsley Common at sundown, via Wikimedia Commons",
      "caption": "Pen Hill from Selsley Common at sundown. Lovely misty view of Pen Hill woods with the Severn Valley beyond."
    }
  ],
  "distance_km": 3.0,
  "description": "This large open area near Stroud has miles of footpaths and wonderful panoramic views over the Cotswolds. It covers 97 acres and consists of wide open grassland with a variety of rare flora and fauna. Look out for wildflowers and orchids including the Green-winged Orchid and Fragrant Orchid. Butterflies such as Small Blue, Grayling and the Duke of Burgundy Fritillary fly around the flowers in the summer months. The common is in an elevated position above Stroud so there are far ranging views to enjoy. On a clear day you can see the Malvern Hills, the Welsh Hills and the River Severn. The area is very popular with walkers, paragliders and hang gliders. This circular walk starts from the car park at the southern end of the common but you could also follow the the Cotswold Way from Stroud. You can follow the trail from the town centre along the Stroudwater Canal before turning south near Ebley, towards the common. The Cotswold Way runs across the common so if you would like to extend your walk you could follow this trail west into Pen Hill Wood and Stanley Wood. Also nearby is the delightful Rodborough Common and Woodchester Park which has similar trails and viewpoints. The common is located just to the west of Woodchester so you could also start your walk from here.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the Bell Inn in Selsley for some post walk refreshments. It's a pub of some note dating from the 16th Century and also grade two listed. The pub can now boast listings in The Good Food Guide, and The Good Pub Guide as well as 2AA rosettes for their food. In the summer months you can sit outside and enjoy fine views of the surrounding countryside. In the winter there's roaring log burners to warm you up after your chilly walk!"
    },
    {
      "subtitle": "Dog Walking",
      "content": "The common is very popular with dog walkers and the Bell Inn mentioned above is also dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Yyi4r3cLpMo",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}