{
  "created_at": "2025-01-06T01:36:18.353390+00:00",
  "objectID": "c6d7e07d583ffede8c4978d121620231",
  "ref": "letchworth-walking-route",
  "title": "Letchworth Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/63/Old_cottages_on_Letchworth_Lane_-_geograph.org.uk_-_1353971.jpg",
  "nearby": [
    {
      "description": "Icknield Way Path",
      "objectID": "e96b8caef019982483e720c1ec5927d6",
      "ref": "icknield-way-path-walking-route"
    },
    {
      "description": "Hitchin",
      "objectID": "5ca3b508e6a3512b04c71780d3fd92a9",
      "ref": "hitchin-walking-route"
    },
    {
      "description": "Barton Hills",
      "objectID": "cdd3b7316bd936932b90be8af9718105",
      "ref": "barton-hills-walking-route"
    },
    {
      "description": "Stevenage Outer Orbital Path",
      "objectID": "e4d689b5f10f3eb043b2b5d6bd70969e",
      "ref": "stevenage-outer-orbital-path-walking-route"
    },
    {
      "description": "Stotfold",
      "objectID": "c1c944fa5ecb5ac2fe4c20dcd7a72a28",
      "ref": "stotfold-walking-route"
    },
    {
      "description": "Kingfisher Way",
      "objectID": "20f1de8b99433f9ecf39c18261234586",
      "ref": "kingfisher-way-walking-route"
    },
    {
      "description": "Ickleford",
      "objectID": "b72139a03c4d062f936c155c036eb492",
      "ref": "ickleford-river-and-nature-reserve-circular-walk-walking-route"
    },
    {
      "description": "Henlow",
      "objectID": "6e09c2e74beb16493a3f1891438dd4ed",
      "ref": "henlow-walking-route"
    },
    {
      "description": "Pirton",
      "objectID": "581c7c175564c083278564a79ef2bbf1",
      "ref": "pirton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c6d7e07d583ffede8c4978d121620231.gpx",
  "_geoloc": {
    "lat": 51.9801236126,
    "lng": -0.2306326888
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Old_cottages_on_Letchworth_Lane_-_geograph.org.uk_-_1353971.jpg",
      "title": "Robert Edwards / Old cottages on Letchworth Lane",
      "caption": "Old cottages on Letchworth Lane. These two timber-framed cottages stand next to the old parish church of Letchworth. The names of the cottages are Hall Farm East and Hall Farm West, which suggests that the building may have originally been a farmhouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Norton_Common_-_geograph.org.uk_-_30959.jpg",
      "title": "Robin Hall / Norton Common",
      "caption": "Norton Common. In the middle of Letchworth is a large common. There are black squirrels here. Some people think that they are pigment mutations of greys but they seem to be much smaller than greys to me."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Ickleford_Green_-_geograph.org.uk_-_89056.jpg",
      "title": "Humphrey Bolton / Ickleford Green",
      "caption": "Ickleford Green. Ickleford has a neat and pleasant green, with an old water pump and a village sign."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Footpath_on_Oughtonhead_Common_-_geograph.org.uk_-_245102.jpg",
      "title": "OLU / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Footpath on Oughtonhead Common, near to Ickleford, Hertfordshire, Great Britain. Beside the river Oughton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/River_Hiz%2C_Ickleford_-_geograph.org.uk_-_89058.jpg",
      "title": "Humphrey Bolton / River Hiz, Ickleford",
      "caption": "River Hiz, Ickleford. This is taken from the bridge next to the ford on the Icknield Way from which the village presumably takes its name."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Ivy_Cottage%2C_Pirton_-_geograph.org.uk_-_89388.jpg",
      "title": "Humphrey Bolton / Ivy Cottage, Pirton",
      "caption": "Ivy Cottage, Pirton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Snowdrops_and_Pirton_church_%28geograph_3342062%29.jpg/512px-Snowdrops_and_Pirton_church_%28geograph_3342062%29.jpg",
      "title": "Philip Halling / Snowdrops and Pirton church",
      "caption": "Snowdrops and Pirton church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Pirton_Court_-_geograph.org.uk_-_1564282.jpg",
      "title": "Philip Halling / Pirton Court",
      "caption": "Pirton Court Pirton Court viewed from the folly 'Pirton Castle', the tower of Pirton Church can be seen in the middle distance on the left."
    }
  ],
  "distance_km": 16.0,
  "description": "Letchworth Garden City is located in Hertfordshire near to Hitchin and Stevenage. Walking highlights include the epic Icknield Way Path, the nearby Chiltern Hills, Norton Common and river paths along the River Oughton near the town. This circular walk from the town uses a section of the Icknield Way Path to visit the nearby villages of Ickleford and Pirton. The walk starts at the train station and then heads north to skirt the edge of Norton Common. The common is a local nature reserve with woodland and a nature reserve. You can take a detour from the route to further explore the footpaths on the common. The route then heads west through the town along the Icknield Way to Ickleford. This pretty village has a nice village green with views of the River Hiz which passes through the area. Just after passing through the village you could turn south to visit the Oughtonhead Common Nature reserve. There's trails here along the River Oughton with lots of wildlife to look out for. The walk continues west along Westmill Lane before turning north west to visit the village of Pirton. The little village has lots of pretty old cottages and an interesting old church, rebuilt in 1877, but with the remains of its 12th-century tower. After exploring the village you turn east to follow Hambridge Lane into the countryside towards Ickleford. You then turn north east to follow an alternative path through Cadwell before returning to Letchworth on bridle tracks.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The 18th century Three Horseshoes is a good choice for some post walk refreshments. The old coaching inn does very good food and also have a lovely country garden to sit out in during the summer months. You can find the pub at 102 Norton Road with a postcode of SG6 1AG for your sat navs. The history of this area is also interesting with the church of St Nicholas opposite the pub dating back to 1109. On the route you could stop off at Ickleford at the historic Old George. The pub dates back to the 15th century and includes a fine interior with an ancient inglenook fireplace. Outside there's a lovely courtyard garden and a terrace with fine views of the old village church. You can find them on the Arlesey Road at postcode SG5 3UX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a nice dog walk and the Three Horseshoes pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The town is close Hitchin where you can try the circular Hitchin Walk which visits the lovely Pegsdon Hills. The expansive Barton Hills is also located close to the town. There's miles of walking trails here with excellent views from the hill tops. To the south of Letchworth you can pick up the Stevenage Circular Walk. This waymarked trail explores the countryside and villages surrounding the town. Just to the north you could visit the delightful Stotfold Mill on the River Ivel. The historic mill includes a nature reserve positioned on the long distance Kingfisher Way. To the north west is the small town of Arlesey where you can explore the Arlesey Old Moat Nature Reserve on the River Hiz. Near here there's Henlow where there's a noteworthy 12th century church and the Champneys Health farm which is used by the rich and famous. For more walking ideas in the area see the Chilterns Walks and Hertfordshire Walks pages."
    }
  ],
  "district": "North Hertfordshire",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bridge Road, Westbury Estate, North Hertfordshire, Hertfordshire, England, SG6 3SB, United Kingdom",
  "postcode": "SG6 3SB",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "nature reserve",
    "village green",
    "historic church"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}