{
  "created_at": "2025-01-06T01:53:36.242519+00:00",
  "objectID": "c72c8c5008e823c614cd04061aea6f44",
  "ref": "loweswater-walking-route",
  "title": "Loweswater Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/27/Southern_shore_of_Loweswater_-_geograph.org.uk_-_630059.jpg",
  "nearby": [
    {
      "description": "Crummock Water",
      "objectID": "778948ecf18acc2fa4dcc7adb47b1ed1",
      "ref": "crummock-water-walking-route"
    },
    {
      "description": "Buttermere",
      "objectID": "9e5cd22c37b1be41a492341eb97fe4f6",
      "ref": "buttermere-walking-route"
    },
    {
      "description": "Cogra Moss",
      "objectID": "d0ac17807dba808bdad1e590e9aabb2b",
      "ref": "cogra-moss-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c72c8c5008e823c614cd04061aea6f44.gpx",
  "_geoloc": {
    "lat": 54.5768738181,
    "lng": -3.3397366995
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Southern_shore_of_Loweswater_-_geograph.org.uk_-_630059.jpg",
      "title": "Trevor Rickard / Southern shore of Loweswater, via Wikimedia Commons",
      "caption": "Southern shore of Loweswater. View north-east towards Low Fell. One of the quieter lakeside spots."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Loweswater_geograph-3495681-by-Ben-Brooksbank.jpg/512px-Loweswater_geograph-3495681-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Southward over Loweswater. On that day in July 1986 it was not raining so from the road from Waterend to Loweswater village there was this wonderful scene: ahead on the left is Grassmoor (2,749 ft.), beyond it are the Buttermere Fells and then perhaps Great Gable (2,948 ft.)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Kirkstile_inn%2C_Loweswater_-_geograph.org.uk_-_86791.jpg",
      "title": "Humphrey Bolton / Kirkstile inn, Loweswater, via Wikimedia Commons",
      "caption": "Kirkstile inn, Loweswater. A good place to visit after a walk! It has its own brewhouse. Melbreak is the hill in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Loweswater_-_geograph.org.uk_-_510328.jpg",
      "title": "mauldy / Loweswater, via Wikimedia Commons",
      "caption": "Loweswater from path to Maggie's Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Loweswater_-_geograph.org.uk_-_549645.jpg",
      "title": "Tom Pennington / Loweswater, via Wikimedia Commons",
      "caption": "Gorgeous view over the lake on a summer day"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/North_West_End_of_Loweswater_-_geograph.org.uk_-_509156.jpg",
      "title": "Andy Beecroft / North West End of Loweswater, via Wikimedia Commons",
      "caption": "North West End"
    }
  ],
  "distance_km": 6.0,
  "description": "Follow the lakeside path around this beautiful lake in the Lake District National Park. The circular walk starts at the car park in Loweswater at the south eastern end of the lake (postcode:CA13 0RU). The route includes a woodland stretch through Holme Wood where you can visit the beautiful Holme Force Waterfall. It's just to the west of the path and worth a small detour. The lake is surrounded by a number of fells with Mellbreak, Gavel Fell, Blake Fell, Hen Comb and Burnbank Fell to the south. To the north lies the Fellbarrow range. It's one of the more peaceful spots in the national park with tourists heading for some of the larger nearby lakes. To the east of the lake there's Loweswater Fell where you can enjoy fine views over the area. Both Crummock Water and Buttermere are close by so you could continue your outing by visiting one or both of these lakes. About 2 miles to the south west you will find Cogra Moss. This small reservoir has some lovely woodland trails to follow through the forestry plantations surrounding the water. This route is devised for walkers but cyclists can cycle along the National Cycle Network route on the eastern side of the lake for a delightful waterside ride.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kirkstile Inn in Loweswater is a great place to go for refreshments after your walk. They do excellent food and there is a nice garden with wonderful views of the surrounding fells. It's a lovely place to to sit outside and enjoy a drink on warmer days. The pub provides fine accommodation if you need to stay over and is also dog friendly. You can find it at postcode CA13 0RU.  Pictured above the wonderfully located Kirkstile Inn at Loweswater village. On the left Grassmoor can be seen in the background. On the right the old church can be seen with Mellbreak rising above the pub too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's two more public car parks at the other end of the lake if you'd prefer to start from there. There's one at Waterend and one near Loweswater Hall. These car parks are good starting point for the climb to Loweswater Fell which rises aboven the lake on the north eastern side. The fell rises to a height of 423 m (1,388 ft).  Pictured above is Loweswater or Low Fell. On the left the fell as viewed across the lake, from the lakeside track through Holme Wood which sits on the lake's western side. On the right is the summit cairn on the fell. At the Waterend end of the lake there's also some good accommodation if you'd like to stay in the area. The Grange Country House is a lovely place with wonderful views across the lake from the rooms. It's dog friendly and can be found just a stones throw from the north western end of the lake at postcode CA13 0SU. The lake is owned by the National Trust and rowing boats can be rented to use on the lake."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CExkNRwuI7s",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Foulsyke, Loweswater, Cumberland, England, CA13 0RU, United Kingdom",
  "postcode": "CA13 0RU",
  "district": "Loweswater",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake"
  ],
  "points_of_interest": [
    "waterfall",
    "fells",
    "forestry plantations"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}