{
  "objectID": "c75f868f176373f1ec830c3066f0a719",
  "created_at": "2024-12-19T09:32:09.643400+00:00",
  "ref": "cheltenham-circular-footpath-walking-route",
  "title": "Cheltenham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Part_of_Pitville_Park_from_the_terrace_of_Pitville_Pump_Room%2C_Cheltenham_-_geograph.org.uk_-_1363475.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/4265D6F32533AA0F8025783D003B7025/$FILE/Cheltenham Circular Footpath.gpx",
  "_geoloc": {
    "lat": 51.9120001336,
    "lng": -2.0665065799
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Part_of_Pitville_Park_from_the_terrace_of_Pitville_Pump_Room%2C_Cheltenham_-_geograph.org.uk_-_1363475.jpg",
      "title": "Brian Robert Marshall / Part of Pitville Park from the terrace of Pitville Pump Room, Cheltenham",
      "caption": "Part of Pitville Park from the terrace of Pitville Pump Room, Cheltenham. Rather a pleasant view from here. The high ground in the distance is the Cotswold escarpment down which the A435 carries traffic into southern Cheltenham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Dowdeswell_Reservoir_-_geograph.org.uk_-_43900.jpg",
      "title": "Terry Jacombs / Dowdeswell Reservoir",
      "caption": "Dowdeswell Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/View_north_from_Hartley_Hill_-_geograph.org.uk_-_638761.jpg",
      "title": "Trevor Rickard / View north from Hartley Hill",
      "caption": "View north from Hartley Hill From the Cotswold Way with Sandy Lane at the bottom of the hill and Cheltenham beyond. Lilley Brook golf course to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/The_Devil%27s_Chimney_-_geograph.org.uk_-_638752.jpg",
      "title": "Trevor Rickard / The Devil's Chimney",
      "caption": "The Devil's Chimney. View northwards towards Cheltenham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/The_Bell%2C_Shurdington_%28geograph_6191831%29.jpg/512px-The_Bell%2C_Shurdington_%28geograph_6191831%29.jpg",
      "title": "Jaggery / The Bell, Shurdington",
      "caption": "The Bell, Shurdington. The pub alongside the A46 is one of two in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Pasture_south_of_Elmstone_Hardwicke_-_geograph.org.uk_-_898229.jpg",
      "title": "Pauline Eccles / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Pasture south of Elmstone Hardwicke. Looking lush and green with clover patches."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Footpath%2C_Lineover_Woods_-_geograph.org.uk_-_181257.jpg/256px-Footpath%2C_Lineover_Woods_-_geograph.org.uk_-_181257.jpg",
      "title": "Rob Farrow / Footpath, Lineover Woods",
      "caption": "Footpath, Lineover Woods. One of numerous pathways through Lineover Woods which are maintained by the admirable Woodland Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Uckington_and_Elmstone_Hardwicke_Village_Hall_-_geograph.org.uk_-_898148.jpg",
      "title": "Pauline Eccles / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Uckington and Elmstone Hardwicke Village Hall"
    }
  ],
  "distance_km": 40.0,
  "description": "Situated on the edge of the Cotswolds this large spa town is a fantastic base for walkers. There's woods, hill climbs, reservoirs and several waymarked trails running through the beautiful countryside that surrounds the Gloucestershire town. This circular walk was devised by Cheltenham Borough Council and takes you around the town giving wonderful views of the Cotswolds escarpment. The walk starts and ends near Pittville Park and passes Cheltenham racecourse and the pretty Dowdeswell Reservoir . The route starts from the Pitville Park just to the north of the town centre. The ornamental park has a magnificent Pump Room and lakes. The Grade I listed Pump Room was the last and largest of the spa buildings to be built in Cheltenham. From the park you head north past Cheltenham racecourse. The course hosts the the Cheltenham Festival, held in March, which features several Grade I races including the Cheltenham Gold Cup, Champion Hurdle, Queen Mother Champion Chase, Ryanair Chase and the Stayers' Hurdle. Follow the footpaths round the racecourse and then head south through Prestbury, Oakley and Charlton Kings to Dowdeswell Reservoir. There's some nice waterside trails here with woodland paths in the adjacent Dowdeswell Wood and Lineover Wood as well. The route then turns west past as series of hills including Wistley Hill, Hartley Hill and Leckhampton Hill . Here you'll pass close to the Devil’s Chimney, an iconic Cotswold landmark. This unusual limestone rock formation stands above a disused quarry in Leckhampton. It's a picturesque spot with fabulous countryside views providing a wonderful backdrop to the chimney. The route continues west through Chargrove Oak to the village of Shurdington where there are a couple of nice pubs to stop at. From here you head north along the eastern outskirts of the town, passing Fiddler's Green, Uckington and Elmstone Hardwicke. From here you turn east through Swindon and Wymans Brook before returning to Pitville Park where the walk finishes.",
  "district": "Cheltenham",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England"
}