{
  "created_at": "2025-01-06T01:11:59.468070+00:00",
  "objectID": "c7b8c1bca6fbd4e77e5b71e851dba4a5",
  "ref": "high-weald-landscape-trail-walking-route",
  "title": "High Weald Landscape Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Sheepwash_Ghyll%2C_St_Leonard%27s_Forest_-_geograph.org.uk_-_413076.jpg",
  "nearby": [
    {
      "description": "Standen House",
      "objectID": "fc358e6047824ea418280039158516b3",
      "ref": "standen-house-walking-route"
    },
    {
      "description": "Wakehurst Place",
      "objectID": "0edceeb510652720fe9a279375556adc",
      "ref": "wakehurst-place-walking-route"
    },
    {
      "description": "Tonbridge",
      "objectID": "845b2d21023c0e96b027ae1a9f03ede7",
      "ref": "tonbridge-walking-route"
    },
    {
      "description": "Pembury",
      "objectID": "7114da0687b29f8c8fb888ff7da55353",
      "ref": "pembury-walking-route"
    },
    {
      "description": "St Leonard's Forest",
      "objectID": "738fc2eb8a1a6f1ee75690b36c366267",
      "ref": "st-leonards-forest-walking-and-cycle-route"
    },
    {
      "description": "Tenterden",
      "objectID": "12a3a5fd31cb98081341737059fa4634",
      "ref": "tenterden-walking-route"
    },
    {
      "description": "Ardingly Reservoir",
      "objectID": "ddc1247dbb53d0bf77a93005b5a7ed58",
      "ref": "ardingly-reservoir-walking-route"
    },
    {
      "description": "Cranbrook",
      "objectID": "2d46880195c0d7833ef8f4fabe198fb2",
      "ref": "cranbrook-walking-route"
    },
    {
      "description": "Goudhurst",
      "objectID": "1e804d3a58bde6c6f4498179907c73a0",
      "ref": "goudhurst-walking-route"
    },
    {
      "description": "Handcross",
      "objectID": "d3e0c2a85b9926967a78d3369972e122",
      "ref": "handcross-walking-route"
    },
    {
      "description": "Nymans Gardens",
      "objectID": "ad62fe56a710c2c5f431ba3d3d77a2f4",
      "ref": "nymans-gardens-walking-route"
    },
    {
      "description": "Lindfield",
      "objectID": "c3cbbcf0bff982ce91aa8ca94631dfcd",
      "ref": "lindfield-walking-route"
    },
    {
      "description": "Matfield",
      "objectID": "5ccf457e45e169e54c2904641b6c06a5",
      "ref": "matfield-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c7b8c1bca6fbd4e77e5b71e851dba4a5.gpx",
  "_geoloc": {
    "lat": 51.0659030073,
    "lng": -0.319027785
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Sheepwash_Ghyll%2C_St_Leonard%27s_Forest_-_geograph.org.uk_-_413076.jpg",
      "title": "Peter Cox / Sheepwash Ghyll, St Leonard's Forest, via Wikimedia Commons",
      "caption": "Sheepwash Ghyll, St Leonard's Forest. Sheepwash Ghyll has cut a deep ravine running over a base of sandstone often forming small 'waterfalls' as here and providing a ford for the footpath going up Scragged Oak Hill (to the right). Sheepwash Ghyll flows out of Whitevane Pond, about 1.5km to the north of this photo, through Roosthole Pond and as Goldings stream into (Birchen) Mill Pond. Flowing out of (Birchen) Mill Pond and under the A281 it emerges as the river Arun on its way to the sea at Littlehampton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Smallhythe_Place_-_geograph.org.uk_-_14479.jpg",
      "title": "Vernon Dunhill / Smallhythe Place, via Wikimedia Commons",
      "caption": "Smallhythe Place near Tenterden. Home of the Victorian actress Ellen Terry"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Borde_Hill_-_geograph.org.uk_-_1597599.jpg",
      "title": "Michael FORD [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Borde Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Wakehurst_Place_-_geograph.org.uk_-_35019.jpg",
      "title": "john spivey / Wakehurst Place, via Wikimedia Commons",
      "caption": "Wakehurst Place"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Goudhurst_Village_Pond_-_geograph.org.uk_-_84152.jpg",
      "title": "Brian Bailey / Goudhurst Village Pond",
      "caption": "Goudhurst Village Pond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_High_Weald_Landscape_Trail_leads_past_The_Park_-_geograph.org.uk_-_1501019.jpg",
      "title": "David Anstiss / The High Weald Landscape Trail leads past The Park",
      "caption": "The High Weald Landscape Trail leads past The Park in Cranbrook. The long distance path heads from Cranbrook past land around Oak Hill Manor. In the background it turns right (see other walkers) heading towards Baker's Cross."
    }
  ],
  "distance_km": 151.0,
  "description": "Explore the High Weald AONB on this fabulous 90 mile walk that links the ridge-top villages and historic gardens for which the area is famous. The walk starts at the rail station in Horsham, West Sussex, and heads east to Rye in East Sussex. Walk highlights include",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village of Ardingly there's the noteworthy Gardeners Arms to stop at for some on route refreshments. Dating back to the 17th Century, the pub is cosy in the winter, with roaring log fires and traditional oak beams. In the summer months you can sit outside in the beautiful garden. Here you can see their grape vines and may also spot a deer if you are lucky. You can find the pub on Selsfield Road with a postcode of RH17 6TJ. In East Grinstead The Ship Inn is a good choice for a pit stop. They do very good food and have an attractive interior with a cosy fire for cold days. If the weather is fine there's a nice terraced garden outside too. You can find the pub on Ship Street at a postcode of RH19 4EG for your sat navs. The small town of Cranbrook is a nice place for a pit stop and a stroll. Here you'll find Larkin's Alehouse. This excellent micropub has a fine range of ales and ciders to sample. It's a friendly, award winning place with a lovely garden to sit out in. You can find them on the High Street at postcode TN17 3EB. After your refrfeshment you could enjoy a stroll around the interesting town where there's several medieval buildings, a notable church known as the 'Cathedral of the Weald' and a very photogenic working windmill. Goudhurst is right on the route and has couple of fine pubs to try. There's The Peacock Inn which has a lovely large garden area where you can relax on warmer days. You can find them at postcode TN17 2PB. There's also the Goudhurst Inn where they serve particularly delicious pizzas. They also have a fine patio area for the summer. They are located on Cranbrook Road at postcode TN17 1DX for your sat navs. The elevated village centre is a special place as well. It commands fine views over the area and also includes a picturesque village pond, rows of ancient cottages and a noteworthy 14th century church. In Bolney there's the locally well known Bolney Stage. It's hundreds of years old and includes a characterful interior with huge inglenook fireplaces, ancient flagstones, crooked beams and comfortable old furniture. Outside there's a large garden area where you can enjoy a fine meal. You can find them on the London Road at postcode RH17 5RL. While here you could also pay a visit to the impressive Bolney Wine Estate. Here you can enjoy guided tours of the vineyard and learn all about the history of the wine making process. There's also a fine cafe here which provides an alternative pit stop. The pretty village is also worth exploring with a noteworthy 12th century church and several listed buildings to admire."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At Handcross you could pay a visit to the National Trust's Nymans Gardens. The beautiful gardens are one of the highlights on the trail."
    }
  ],
  "video_url": "https://www.youtube.com/embed/EqJMg14ZVYs",
  "district": "Horsham",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}