{
  "created_at": "2025-01-06T00:11:31.852641+00:00",
  "objectID": "c7ee763ae44c4d8a2c7ae45b247451bf",
  "ref": "marlow-walking-route",
  "title": "Marlow Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/17/Thames_river_at_Marlow_-_geograph.org.uk_-_1419794.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c7ee763ae44c4d8a2c7ae45b247451bf.gpx",
  "_geoloc": {
    "lat": 51.5686071182,
    "lng": -0.7732399799
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Thames_river_at_Marlow_-_geograph.org.uk_-_1419794.jpg",
      "title": "Chad Nyhus / Thames river at Marlow",
      "caption": "Thames river at Marlow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Marlow_Millennium_Maze%2C_Marlow%2C_Buckinghamshire_-_geograph.org.uk_-_2556571.jpg/512px-Marlow_Millennium_Maze%2C_Marlow%2C_Buckinghamshire_-_geograph.org.uk_-_2556571.jpg",
      "title": "Marlow Millennium Maze, Marlow, Buckinghamshire by Christine Matthews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Marlow Millennium Maze. The maze features four mosaic's representing significant moments in the town's histor suchs as the Vikings sailing up the Thames 1,000 years ago and Sir Steve Redgrave's Olympic triumph in 2,000."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Underneath_Marlow_Suspension_Bridge%2C_Marlow%2C_Buckinghamshire_-_geograph.org.uk_-_2556833.jpg/512px-Underneath_Marlow_Suspension_Bridge%2C_Marlow%2C_Buckinghamshire_-_geograph.org.uk_-_2556833.jpg",
      "title": "Underneath Marlow Suspension Bridge, Marlow, Buckinghamshire by Christine Matthews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Underneath Marlow Suspension Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Cricket_Match%2C_Marlow%2C_Buckinghamshire_-_geograph.org.uk_-_2556515.jpg/512px-Cricket_Match%2C_Marlow%2C_Buckinghamshire_-_geograph.org.uk_-_2556515.jpg",
      "title": "Cricket Match, Marlow, Buckinghamshire by Christine Matthews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cricket Match"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Park_and_Spire_-_geograph.org.uk_-_649855.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Park and Spire. View across Higginson Park towards All Saints Church. The park is one of the town's highlights with lawns, statues, a maze, a cafe and formal flowerbeds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Sir_Steve_Redgrave_-_geograph.org.uk_-_649553.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sir Steve Redgrave. An important member of the local rowing fraternity! The statue stands outside Court Garden House over looking the Thames. Regrave won gold medals at five consecutive Olympic Games from 1984 to 2000."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Memorial_Marlow_-_geograph.org.uk_-_431792.jpg/512px-Memorial_Marlow_-_geograph.org.uk_-_431792.jpg",
      "title": "Jo Turner / Memorial Marlow",
      "caption": "Looking across Marlow Road to the Memorial and George & Dragon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Marlow_milepost_-_geograph.org.uk_-_3415282.jpg",
      "title": "Marlow milepost by Row17, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Milepost in the town centre"
    }
  ],
  "distance_km": 7.0,
  "description": "The riverside town of Marlow is a lovely spot for walking. With the Thames path and some lovely countryside and woodland there's lots of good options for walkers. This is a popular 4.5 mile walk from the town to the nearby village of Cookham. It's a particular lovely stretch of the Thames Path with the option of continuing onto Maidenhead if you have time. You can also turn it into a circular walk by heading north west past the golf course in Cookham to Coney Copse. Other public footpaths will then take you towards Quarry Wood and Marlow. At Cookham you also have the option of linking with the Beeches Way and following the path east to the splendid Burnham Beeches Nature Reserve. Our circular walk around the village takes you along the river before rounding Cock Marsh and the golf course. Around Cookham you can also cross the river and visit the National Trust owned Cliveden House or pay a visit to the pretty village of Bourne End .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Riverside Restaurant is a lovely location for some refreshments. There's a fine outdoor terrace which is ideal for warmer days. You can find it right next to Marlow Bridge at a postcode of SL7 1RG for your sat navs. The Two Brewers is also located near the river in Marlow. The 18th century pub does great food and also has a nice beer garden. You can find it on St. Peter Street at postcode SL7 1NQ. The 12th century Olde Bell Inn is located just to the west of the town in Hurley, and is one of the most significant pubs in the country. It is claimed to be the oldest hotel in the UK, and one of the oldest hotels in the world. The hotel is said to contain a secret tunnel leading to the village priory, which was used by John Lovelace, who was involved in the Glorious Revolution to overthrow King James II in the 17th century. The hotel was also used as a meeting point for Winston Churchill and Dwight D. Eisenhower during World War II. It's well worth exploring the whole site as other features include a kitchen garden, wildflower garden and a 16th century Tithe Barn. The inn is located close to Pinewood Studios and over the years, has seen a number of movie-star guests, including Mae West, Greta Garbo, Cary Grant, Errol Flynn, Elizabeth Taylor and Richard Burton."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Higginson Park in Marlow is a nice place to visit in the town. The popular park attracts 1,000,000 visitors a year and includes riverside views and access to open countryside. There are also many fine trees and large expanses of lawn with formal flowerbeds and a brick in grass maze. It's another good option for refreshments with a nice cafe. You can find the park on the western fringes of the town, next to the river. In nearby Hurley there's the Hurley Loop Walk which will take you south to the woodland trails in Ashley Hill Forest and the Hurley Chalk Pit Nature Reserve. Just to the east is the neighbouring village of Little Marlow. Here you can explore the wildlife rich Spade Oak Nature Reserve and visit the historic 14th century church and 16th century pub."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FTydy9wC6Jo",
  "district": "Marlow",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Passage, Marlow, Buckinghamshire, England, SL7 1NU, United Kingdom",
  "postcode": "SL7 1NU",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "pasture"
  ],
  "points_of_interest": [
    "nature reserve",
    "historic houses",
    "village"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}