{
  "created_at": "2025-01-06T00:02:26.272453+00:00",
  "objectID": "c8710cae72d7105dbf3f3fc8f79b4e53",
  "ref": "limestone-way-walking-route",
  "title": "Limestone Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bb/View_from_the_Limestone_Way_-_geograph.org.uk_-_1241531.jpg",
  "nearby": [
    {
      "description": "Cave Dale",
      "objectID": "ae98223848792a04804c73ecc3104ed1",
      "ref": "cave-dale-walking-route"
    },
    {
      "description": "Miller's Dale",
      "objectID": "b1b5451a34708ce105fcf182f5d6a29b",
      "ref": "millers-dale-walking-route"
    },
    {
      "description": "Lathkill Dale",
      "objectID": "586ae1269f7d3f0f4b7881990dcd4a66",
      "ref": "lathkill-dale-walking-route"
    },
    {
      "description": "Stanton Moor",
      "objectID": "0bf243bd5f27630246d7ca692c75b575",
      "ref": "stanton-moor-walking-route"
    },
    {
      "description": "High Tor Matlock",
      "objectID": "d83c1b7c1ab523ba9a2fd48d3a86a85b",
      "ref": "high-tor-matlock-walking-route"
    },
    {
      "description": "Matlock",
      "objectID": "dc3a16c29293ecbecb2300068010dd03",
      "ref": "matlock-walking-route"
    },
    {
      "description": "Tideswell",
      "objectID": "f8ddc4d5dd9e30cb727947ea3660c6b2",
      "ref": "tideswell-walking-route"
    },
    {
      "description": "Castleton Circular Walk",
      "objectID": "48e87203fdee5e2ebef39c8d5d7ad37e",
      "ref": "castleton-circular-walk-walking-route"
    },
    {
      "description": "Winnats Pass",
      "objectID": "aa6e40e604cdf93f1a9e019529346547",
      "ref": "winnats-pass-walking-route"
    },
    {
      "description": "Ellastone",
      "objectID": "810b1178c8b0550fbebf7a5da0e561c0",
      "ref": "ellastone-walking-route"
    },
    {
      "description": "Brassington",
      "objectID": "c6c406c05a7d6c5db26a8d4c6fc44ecd",
      "ref": "brassington-walking-route"
    },
    {
      "description": "Tissington Trail",
      "objectID": "b6e428f335e074a550ea488db65c3cd6",
      "ref": "tissington-trail-walking-and-cycle-route"
    },
    {
      "description": "Parwich",
      "objectID": "46119e1f2e44181301b63d04f17a3c50",
      "ref": "parwich-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c8710cae72d7105dbf3f3fc8f79b4e53.gpx",
  "_geoloc": {
    "lat": 53.3431932881,
    "lng": -1.7753700593
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/View_from_the_Limestone_Way_-_geograph.org.uk_-_1241531.jpg",
      "title": "Alan Heardman / View from the Limestone Way",
      "caption": "View from the trail just south of Youlgreave. Looking in the general direction of Mawstone Farm, the footpath can be seen veering off to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Limestone_Way_-_geograph.org.uk_-_413650.jpg",
      "title": "Mike Harris / Limestone Way",
      "caption": "The Limestone Way runs here along the lane at the boundary between Tideswell and Wheston. This is a little to the S of Limestone Way Farm. Where the lane vanishes in the distance the Limestone Way turns off right towards Dam Dale and Hay Dale while the Pennine Bridleway continues along the lane to Wheston. This is drystone wall and sheep country - although modern farming practice means that the grassland is much \"improved\" and the natural flora of the native moorland is pretty much gone in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Limestone_Way_at_the_top_of_Cave_Dale_-_geograph.org.uk_-_416014.jpg",
      "title": "Mike Harris / Limestone Way at the top of Cave Dale",
      "caption": "The trail view at the top of Cave Dale above Castleton. The path ahead very soon descends steeply through rocky Cave Dale and past Peveril Castle on its way into Castleton village and the northern terminus of the Limestone Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Limestone_Way_at_the_bottom_of_Cave_Dale_-_geograph.org.uk_-_416908.jpg",
      "title": "Mike Harris / Limestone Way at the bottom of Cave Dale",
      "caption": "A walker makes their way down a rocky path on the trail. View is at the bottom of Cave Dale, Castleton, approaching the village and its northern terminus. Although the image barely shows it the village is very near - the village church is only 300 metres ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/On_the_Limestone_Way_-_geograph.org.uk_-_416008.jpg",
      "title": "Mike Harris / On the Limestone Way",
      "caption": "Near Hurd Low above Castleton where it crosses high sheep pasture near old lead mine workings before descending Cave Dale into the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Limestone_Way_approaching_Mount_Pleasant_Farm_-_geograph.org.uk_-_413644.jpg",
      "title": "Mike Harris / Limestone Way approaching Mount Pleasant Farm",
      "caption": "Approaching Mount Pleasant Farm, Tideswell"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/View_towards_Mam_Tor_-_geograph.org.uk_-_409137.jpg",
      "title": "Mike Harris / View towards Mam Tor",
      "caption": "View towards Mam Tor from the footpath just east of Oxlow House, near the top of Winnats Pass. The metalled track in the foreground is the drive (an ORPA) to Rowter Farm and beyond to the Limestone Way. The footpath is a grassy track south across moorland to the (disused) Slitherstone (lead) Mine and beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Stile_on_Limestone_Way_-_geograph.org.uk_-_1625265.jpg",
      "title": "Peter Barr / Stile on Limestone Way",
      "caption": "Stile on Limestone Way"
    }
  ],
  "distance_km": 74.0,
  "description": "Travel through the beautiful Peak District National Park on this walk through Derbyshire and into Staffordshire. The walk starts at Castleton, passing through the scenic Cave Dale and past the remains of Peverill Castle. You continue south through the stunning Monk's Dale and Miller's Dale, where you cross the River Wye. The next stage takes you through Flagg and Monyash where you will pass close to the beautiful Lathkill Dale. It's pretty river, limestone cliffs and waterfalls mean it's worth a small detour to the route. You continue to Youlgreave, where you enter Bradford Dale for a pleasant waterside stretch before heading on to Brassington, Parwich and Tissington. Here you will find the splendid 17th century Tissington Hall and gardens which are well worth a visit. The route also connects with the Tissington Trail here. This popular cycling and walking trail runs along a disused railway line. From Tissington you continue through Thorpe, crossing the River Dove and then following it to the finish point at Rocester.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk head to the Bull's Head in Monyash on Church St, DE45 1JH. The historic country pub has a blazing log fire to warm you after a winter walk or a lovely beer garden to sit out and relax in during the summer.Also on Church Street you'll find the splendid Old Smithy tearooms at postcode DE45 1JH. The cafe is housed within the former village blacksmiths in a building full of character and over 250 years old. Another nice place to dwell is the historic village of Winster. Here you'll find the 17th century Old Market Hall which is one of the highlights of the area. The building is owned by the National Trust and was the first to be acquired by the charity back in 1906 for the princly sum of £50. At the hall you'll find a series of interpretation panels detailing the history of the village and a scale model of Winster. Near here there's The Old Bowling Green, a fine village pub of some note. The pub dates back to 1472, and has a charming interior with a cosy fire. You can find the inn close to the Old Market Hall at postcode DE4 2DS for your sat navs. In Matlock the Sycamore Inn is a good choice. It's set in an old coaching inn and does excellent home-cooked food. There's also a lovely garden area which includes a boules pitch. It's a fine place to relax on a summer day. You can find them at postcode DE4 3HZ for your sat navs. In Ellastone there's the splendid Duncombe Arms. The 1850s inn has a charming interior with blazing fires. Outside there's a lovely large garden area to relax in on warmer days. You can find them on the Main Road at postcode DE6 2GZ. The pretty Staffordshire village is also worthy of exploration with a 16th century church, the site of a 12th century ruined abbey and nice trails along the River Dove. In Brassington there's the noteworthy Olde Gate Inn. The historic inn dates back to the 17th century and is Grade II listed. Bonnie Prince Charlie’s soldiers were billeted at the inn on their march to London, and some of the oak beams came from ships of the Spanish Armada. It's been named Britain’s cosiest pub by The Times with its charming interior and roaring fires. Outside there's a lovely large garden area with fine views. They serve high quality gastro food and have a good selection of ales. You can find them on Well Street with a postcode of DE4 4HJ​ for your sat navs. The attractive village is a pleasant place for a stroll too, with several centuries old limestone cottages, a church dating from the Norman period and a notable Tudor house built in 1615. In the historic village of Parwich there's the noteworthy Sycamore Inn to try. The limestone inn dates all the way back to the 1600s and is in a lovely spot close to the pretty village green. They serve good quality home cooked food and a fine ranges of ales. You can find them at postcode DE6 1QL for your sat navs. The inn also serves as the village shop so you can pick up various bits and bobs here too. Near Matlock in Bonsall there's The Kings Head at 62 Yeoman Street, DE4 2AA. It's an attractive stone pub with Batemans real ales, home cooked food and a hidden beer garden. There's also The Barley Mow at postcode DE4 2AY."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Peak District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mgK3Fe7KCUk",
  "district": "High Peak",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "1530, Cross Street, Castleton, High Peak, Derbyshire, East Midlands, England, S33 8WH, United Kingdom",
  "postcode": "S33 8WH",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "limestone"
  ],
  "points_of_interest": [
    "castle",
    "dale",
    "trail"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "pub/cafe"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}