{
  "created_at": "2025-01-06T01:44:27.303523+00:00",
  "objectID": "c8d32d89ca24d6ce2b2a0c959fea1329",
  "ref": "cissbury-ring-walking-route",
  "title": "Cissbury Ring Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Cissbury_Ring_rampart_5.JPG/512px-Cissbury_Ring_rampart_5.JPG",
  "nearby": [
    {
      "description": "Clapham Wood",
      "objectID": "74be985779665723dfeb920edab7b887",
      "ref": "clapham-wood-walking-route"
    },
    {
      "description": "Chanctonbury Ring",
      "objectID": "363ee78a1c92cc96afd9561d72428d2c",
      "ref": "chanctonbury-ring-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c8d32d89ca24d6ce2b2a0c959fea1329.gpx",
  "_geoloc": {
    "lat": 50.8578162968,
    "lng": -0.397241648
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Cissbury_Ring_rampart_5.JPG/512px-Cissbury_Ring_rampart_5.JPG",
      "title": "By Simon Burchell (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Cissbury Ring rampart. The site of the fort contains a Neolithic mine, one of the first flint mines in Britain. Around 270 shafts were dug into Cissbury hill over around 300 years of use.  From the top, you can see Selsey, Chichester Cathedral, the Spinnaker Tower and the Isle of Wight to the west. To the east, there are fine views to Brighton, the Seven Sisters and Beachy Head. The fort is the highest point in the borough of Worthing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Workings_at_Cissbury_Ring_-_geograph.org.uk_-_1326767.jpg",
      "title": "Graham Horn [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Workings at Cissbury Ring. This is the south-western side and lowest part of the ring. The depression seen here is the site of one of the former flint mines. These would have been dug as deep pits through the layers of chalk and poor flint to a good seam of flint about 30 feet below. This would have been worked out horizontally, and hauled to the surface here, within the safety of the ring fortifications. Flints were used as tools and weapons. This was all stone age stuff, 5,000 years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Cissbury_Ring_-_geograph.org.uk_-_18380.jpg",
      "title": "Chris Shaw / Cissbury Ring",
      "caption": "This is the SW corner of the ancient hill fort - looking West across to Salvington Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Below_Cissbury_Ring_-_geograph.org.uk_-_1326717.jpg",
      "title": "Graham Horn / Below Cissbury Ring",
      "caption": "Below Cissbury Ring. A bridleway descends the north-eastern slope of Cissbury Ring, overlooking Canada Bottom to the north with a view towards Chanctonbury Ring and the South Downs Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Easternmost_part_of_Cissbury_Ring_-_geograph.org.uk_-_868795.jpg",
      "title": "Slbs / Easternmost part of Cissbury Ring",
      "caption": "Easternmost part of Cissbury Ring Looking north towards Chanctonbury Ring (which is visible on the horizon just to the left of the steps)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Bridleways_below_Cissbury_Ring_-_geograph.org.uk_-_1326789.jpg",
      "title": "Graham Horn / Bridleways below Cissbury Ring",
      "caption": "Bridleways below Cissbury Ring. This part of the South Downs has an extensive network of bridleways."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Findon_High_Street_-_geograph.org.uk_-_4329847.jpg/512px-Findon_High_Street_-_geograph.org.uk_-_4329847.jpg?20230125140310",
      "title": "Findon High Street by Christopher Hilton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Findon High Street and local pubs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Seat_by_tree_on_Cissbury_Ring_ramparts_-_geograph.org.uk_-_2639877.jpg/512px-Seat_by_tree_on_Cissbury_Ring_ramparts_-_geograph.org.uk_-_2639877.jpg?20210917195852",
      "title": "Seat by tree on Cissbury Ring ramparts by Dave Spicer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Seat by tree on Cissbury Ring ramparts"
    }
  ],
  "distance_km": 3.0,
  "description": "Visit this historic hill fort in West Sussex and enjoy terrific views over the South Downs countryside on this circular walk. It's a very beautiful place with rolling hills, patches of woodland, wildlife-rich chalk grassland, wildflowers in the summer and a series of good footpaths and tracks to guide your around the area. At 60 acres the fill fort is the second largest in England, dating back to around 250 BC. It also contains a Neolithic mine, one of the first flint mines in Britain. You can start the walk from the Storrington Rise car park which is less than a mile west of the hill. Then climb east towards the hill fort which stands at a height of around 600ft. The area is wonderful for flora and fauna in the summer months. Look out for bee orchids, field fleawort and round-headed rampion. Around the wildflowers you will see many different types of pretty butterfly. Keep your eyes peeled for chalkhill blues, dark-green fritillaries and marbled whites. The area is located just north of Worthing so you could walk there from the town. You can follow a bridleway from the outskirts across Findon Valley to reach the site. The Monarch's Way long distance footpath passes just to the north of the hill so you could pick this up to extend your walk. If you head east you could visit Bramber Castle and Upper Beeding on the River Adur. The The South Downs Way also passes close to the site. There's lots of different bridleways you can pick up around the hill too. You can follow them across Canada Bottom and Tenants Hill for more great views over Worthing to the coast. If you follow the paths north you will soon come to Chanctonbury Ring Hill Fort. The fort dates from the early Iron Age and at a height of 238 metres (781 ft) commands fine views of the area. Also nearby is the mysterious Clapham Wood near the village of Clapham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you head west from the hill into the village of Findon you'll find several good pubs and cafes for post walk refreshments. The Findon Manor Hotel is set in an interesting 18th century building and includes 2 acres of lovely gardens. It has an interesting history having started its life as the village Rectory. The centre portion of the building was then built in 1584, and around 1728 the east wing was added and the west end was built in 1773. There's two restaurants and the Snooty Fox Bar which provides a warm, casual, cosy atmosphere for guests and non-residents to relax in. The bar faces the lawned garden allowing guests to sit outside and enjoy the country air. You can find the hotel on the High Street with a postcode of BN14 0TA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and surrounding woods are ideal for a dog walk so you will probably see plenty of other owners on a fine day. The Findon Manor Hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Worthing Walk visits the fort before continuing onto visit the ruins at the 11th century Bramber Castle, just to the east of the fort. For more walking ideas in the area see the Sussex Walks and South Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/VM2W0i5CQCs?si=Sop4VLkJSgHPgmoV",
  "district": "Worthing",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Storrington Rise CP, Storrington Rise, Findon Valley, Worthing, West Sussex, England, BN14 0HT, United Kingdom",
  "postcode": "BN14 0HT",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "footpaths",
    "bridleways"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}