{
  "created_at": "2025-01-06T04:49:28.001664+00:00",
  "objectID": "c8d5b3b26a6b05f4901cfed442d6b116",
  "ref": "forth-and-clyde-canal-walking-and-cycle-route",
  "title": "Forth and Clyde Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Lock_27%2C_Forth_and_Clyde_Canal_%28geograph_4935918%29.jpg/512px-Lock_27%2C_Forth_and_Clyde_Canal_%28geograph_4935918%29.jpg",
  "nearby": [
    {
      "description": "Glasgow Canal Walk",
      "objectID": "dafa788321c13a56932dd1aad1840304",
      "ref": "glasgow-canal-walk-walking-route"
    },
    {
      "description": "Kelvin Walkway",
      "objectID": "c2ae751a35f7d8c74e3e1b0690be3acc",
      "ref": "kelvin-walkway-walking-route"
    },
    {
      "description": "Union Canal",
      "objectID": "77b1ab0368473322069a55d3775070fc",
      "ref": "union-canal-walking-and-cycle-route"
    },
    {
      "description": "Glasgow to Balloch",
      "objectID": "d7f9ada8033939b744599bb1ce48873a",
      "ref": "glasgow-to-balloch-cycle-route"
    },
    {
      "description": "Glasgow to Edinburgh",
      "objectID": "c9b91884418d7d9f7dfe38d4173924f4",
      "ref": "glasgow-to-edinburgh-walking-and-cycle-route"
    },
    {
      "description": "Loch Humphrey",
      "objectID": "1886f0c70dfde03cb8b99b19f95c893c",
      "ref": "loch-humphrey-walking-route"
    },
    {
      "description": "Falkirk Wheel to Kelpies Walk",
      "objectID": "9a8c28b7629c13b7b72b844711771e8c",
      "ref": "falkirk-wheel-to-kelpies-walk-walking-route"
    },
    {
      "description": "Falkirk",
      "objectID": "6d144b0719975f6250140a9ab7594f4c",
      "ref": "falkirk-walking-route"
    },
    {
      "description": "Callendar Park",
      "objectID": "00a54ac23d832a6d50a873c17df044a0",
      "ref": "callendar-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c8d5b3b26a6b05f4901cfed442d6b116.gpx",
  "_geoloc": {
    "lat": 55.9315816251,
    "lng": -4.492231462
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Lock_27%2C_Forth_and_Clyde_Canal_%28geograph_4935918%29.jpg/512px-Lock_27%2C_Forth_and_Clyde_Canal_%28geograph_4935918%29.jpg",
      "title": "Jonathan Thacker / Lock 27, Forth and Clyde Canal, via Wikimedia Commons",
      "caption": "Lock 27 in Anniesland. You can see the pub of the same name in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Forth_and_Clyde_Canal_-_geograph.org.uk_-_1515104.jpg",
      "title": "Mark Nightingale / Forth and Clyde Canal, via Wikimedia Commons",
      "caption": "The forth and Clyde Canal viewed from a little west of the Kelvin Acqueduct. The River Kelvin runs below the narrow section of the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Forth_and_Clyde_Canal_-_geograph.org.uk_-_845841.jpg",
      "title": "Stephen Sweeney / Forth and Clyde Canal, via Wikimedia Commons",
      "caption": "To the east of Linnvale, looking to Great Western Retail Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Forth_and_Clyde_Canal_-_geograph.org.uk_-_11036.jpg",
      "title": "Ruth Harris / Forth and Clyde Canal, via Wikimedia Commons",
      "caption": "Narrowboats moored on the Forth and Clyde canal, not far from the Falkirk Wheel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/The_Falkirk_Wheel_-_geograph.org.uk_-_5873.jpg",
      "title": "Nick Leverton / The Falkirk Wheel, via Wikimedia Commons",
      "caption": "The Falkirk Wheel. Falkirk Boat Lift, aka the Falkirk Wheel, was opened in 2002 to reconnect the Forth and Clyde Canal with the Union Canal for the first time in 40 years. The world's only rotating boat lift, it was built by Butterley Engineering of Derbyshire. The Wheel leads onto an aqueduct and through a brand new canal tunnel to reach the higher course of the Union Canal, and replaces a long-disappeared flight of locks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/The_Falkirk_Wheel_-_geograph.org.uk_-_1081519.jpg",
      "title": "Simon Palmer / The Falkirk Wheel, via Wikimedia Commons",
      "caption": "Another view of the Falkirk Wheel. A stunning piece of contemporary canal engineering, the wheel is designed to connect the Forth and Clyde and Union canals"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Townhead_Bridge%2C_Kirkintilloch_-_geograph.org.uk_-_422250.jpg",
      "title": "Raymond Okonski / Townhead Bridge, Kirkintilloch",
      "caption": "Townhead Bridge in Kirkintilloch, pictured in May 2007. This bridge over the Forth & Clyde canal used to be a lifting bridge, but after the canal was cut by the building of the A80 dual carriageway at Castlecary, councils took great delight in infilling sections of the canal, and Townhead was no exception. The canal was culverted at this point and the gap infilled. When news of the reopening became a reality some 35 years later, the culvert was removed and a new bridge built to span the canal once more. To save money, no provision was made for the towpath to remain with the canal alignment, and walkers and cyclists must now use the ramp to reach road level to cross it. The only saving grace is that the council did provide a set of pedestrian crossing lights here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Hillhead_Swing_Bridge_-_geograph.org.uk_-_422498.jpg",
      "title": "Raymond Okonski / Hillhead Swing Bridge",
      "caption": "Hillhead Swing Bridge between Kirkintilloch and Bishopbriggs - just outside Glasgow. This 1930\u0092s former swing bridge on the Forth & Clyde Canal at Kirkintilloch was refurbished and re-commissioned as an opening bridge. Work on the re-opening project started in April 2000 and was completed in January 2001. The mechanical and electrical operating equipment and the control system were reinstated and the control building was rebuilt in its original style. The bridge pivots ('swings') out of the way to let boats pass."
    }
  ],
  "distance_km": 56.0,
  "description": "Follow the towpath of the Forth and Clyde Canal from Bowling to Falkirk on this super cycling and walking route. The route follows National Cycle Network Routes 7 and 754 so is well signed throughout. At Falkirk you can link up with the Union Canal which will take you into Edinburgh. As such you can cross central Scotland from Glasgow to Edinburgh on traffic free canalside paths. You start off at the Bowling Basin near to Bowling train station on the Glasgow suburban line. The path then heads through Clydebank and the outskirts of Glasgow, crossing the four-arched 120 metre long Kelvin Aqueduct and the Kelvin Walkway as you go. From the Aqueduct you continue to the town of Kirkintilloch passing Cadder, Bishopbriggs, a Roman Fort and the pretty Possil Loch on the way. From Kirkintilloch you continue to the nearby town of Kilsyth, passing along the River Kelvin and Dumbreck Nature Reserve. The final leg runs from Kilsyth to Falkirk, passing Bonnybridge and the Antonine Wall - a Roman turf and stone fortification bisecting Scotland. On the outskirts of Falkirk you'll come to the Falkirk Wheel - this rotating boat lift connects the Forth and Clyde Canal with the Union Canal lifting boats from the basin to the aqueduct 24 metres above. See the video below for a full description of this fascinating tourist attraction. After the Falkirk Wheel you complete the trip by passing along the canal into Falkirk and finishing at Falkirk train station. The canal forms part of our Glasgow to Balloch Cycle Route which takes you from the city centre to the banks of Loch Lomond on nice traffic free paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At Dawsholm Park you'll pass Lock 27 where you'll find a nice canalside pub. There's an outdoor seating area right next to the water with lovely views. It's a great place to stop and relax during the summer months. The pub also has a good menu, a fine looking modern interior and is also dog friendly. You can find it right next to the canal in Anniesland at postcode G13 1JT. You could also leave the canal here and enjoy a stroll around the adjacent Dawsholm Park. The park covers an area of 81.5 acres, and consists mostly of woodland, with some grass and wildflower meadows in the southeast area of the park.  For a classic old pub in the city head to The Old Toll Bar in Kinning Park. This 19th century pub has a wonderfully restored interior with ornate wood panelling, antique photography, decorative mirrors and hand-painted stained glass windows. The place is very friendly and full of character and charm. You can find the pub on the southern side of the river in Kinning Park at 1 Paisley Rd West, with a postcode of G51 1LF for your sat navs. Near Kirkintilloch you'll pass The Stables. This Georgian canalside pub has a great menu and an outdoor seating area with views of the canal. The Stables was built to serve the watermen and horses using the Forth and Clyde Canal. When the canal was first built the boats that used it were pulled by horses, as a horse could go a few miles before needing a rest stables were built along the route. You can find the pub at Kirkintilloch with a postcode of G66 1RH for your sat navs. The pub is also very dog friendly with treats and water bowls provided. For more details on this section of the canal see the Kirkintilloch to Bishopbriggs Canal Walk page."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the start you can take a small detour to visit Callendar Park, just south of Falkirk. The 14th century French chateau styled house is surrounded by lovely parkland and woodland with a fascinating museum and a Roman Antonine Wall to see as well. Just north of Bowling you could pay a visit to Loch Humphrey. This tranquil loch has some nice waterside trails and views of the surrounding Kilpatrick Hills. At Banton you could take a small detour to visit Banton Loch on the lovely Colzium Estate near Kilsyth. The loch is also known as Townhead Reservoir and was built in 1773 as a feeder loch for the canal. The estate includes some peaceful waterside trails and the historic Colzium House. In the grounds there's a ruined 16th century castle and some beautiful gardens to admire. The Clyde Walkway is another great waterside option running through Glasgow. This will take you to Strathclyde Loch Country Park, Chatelherault Country Park and the photogenic ruins of the historic 13th century Bothwell Castle."
    }
  ],
  "district": "Bowling",
  "county": "West Dunbartonshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dumbarton Road, Auchentorlie House, Bowling, West Dunbartonshire, Alba / Scotland, G60 5BL, United Kingdom",
  "postcode": "G60 5BL",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "urban"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "aqueduct",
    "fortification"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "train station"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}