{
  "created_at": "2025-01-06T01:16:17.834401+00:00",
  "objectID": "c8e8760e9d540adb1e06a14e671d1399",
  "ref": "hartland-quay-walking-route",
  "title": "Hartland Quay Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/92/Car_park_at_Hartland_Quay_-_geograph.org.uk_-_506300.jpg",
  "nearby": [
    {
      "description": "Hartland Point",
      "objectID": "a9689c8bb7541e8e80c23603b27b6397",
      "ref": "hartland-point-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Brownsham Wood",
      "objectID": "cad32d92bffe2ed8fdcee0bc47f53fb8",
      "ref": "brownsham-wood-walking-route"
    },
    {
      "description": "Morwenstow",
      "objectID": "0df0e8807ee77f4fd89f2909ebc5094a",
      "ref": "morwenstow-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c8e8760e9d540adb1e06a14e671d1399.gpx",
  "_geoloc": {
    "lat": 50.9948144346,
    "lng": -4.5293483636
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Car_park_at_Hartland_Quay_-_geograph.org.uk_-_506300.jpg",
      "title": "Derek Harper / Car park at Hartland Quay",
      "caption": "Car park at Hartland Quay. One of Britain's more dramatically located car parks, overlooking Cowhouse Race at Hartland Quay. Seen from the coast path, here following Hartland Footpath 14 on its steep descent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Rocks_north_of_Hartland_Quay_-_geograph.org.uk_-_506276.jpg",
      "title": "Derek Harper / Rocks north of Hartland Quay",
      "caption": "Rocks north of Hartland Quay. Sharp rocks with an almost vertical dip below Warren Cliff. The curving beach below is Broad Beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Screda_Point_-_geograph.org.uk_-_506330.jpg",
      "title": "Derek Harper / Screda Point",
      "caption": "Screda Point. This is the bay immediately south of the quay, with the headland and rocks of Screda Point jutting out on its southern side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Long_Furlong_-_geograph.org.uk_-_505499.jpg",
      "title": "Derek Harper / Long Furlong",
      "caption": "Long Furlong. The farmyard barns have been converted into holiday cottages at this attractive spot on the lane to the Quay. The chimneys indicate the age of the farmhouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Waterfall_below_St._Catherine%27s_Tor_-_geograph.org.uk_-_506702.jpg/256px-Waterfall_below_St._Catherine%27s_Tor_-_geograph.org.uk_-_506702.jpg",
      "title": "Derek Harper / Waterfall below St. Catherine’s Tor",
      "caption": "Waterfall below St. Catherine\u0092s Tor. Coastal erosion has chopped away both sides of a valley which circles the headland known as St. Catherine\u0092s Tor, and this waterfall on Wargery Water is one of total of 33 (Steers: \"Coastline of England & Wales\",1946) along this coast that have been created by the resultant hanging valleys. According to Steers, Wargery Water originally continued northwards on the inland side of Screda Point and the Quay, so that its valley has been interrupted at numerous points by the sea. Below is Childspit Beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Tide%27s_in_at_Hartland_Quay_-_geograph.org.uk_-_1332895.jpg",
      "title": "Pauline Eccles, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tide's in at the Quay. Looking NNE along the coast from the slipway to the spectacularly folded and faulted Warren Cliff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Hartland_Quay_Hotel_-_geograph.org.uk_-_1519984.jpg",
      "title": "Steve Daniels / Hartland Quay Hotel",
      "caption": "Hartland Quay Hotel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Speke%27s_Mill_Beach_-_geograph.org.uk_-_506802.jpg/256px-Speke%27s_Mill_Beach_-_geograph.org.uk_-_506802.jpg",
      "title": "Derek Harper / Speke's Mill Beach",
      "caption": "Speke's Mill Beach. Seen from the cut-off valley below St. Catherine's Tor. The two headlands are Brownspear Point and Longpeak."
    }
  ],
  "distance_km": 6.0,
  "description": "This circular walk around the Hartland Peninsula takes in some beautiful coastal views, interesting rock formations, plunging waterfalls and the little village of Stoke. There are great views towards Lundy Island and a variety of sea birds to look out for along the way. The walk starts at the Hartland Quay car park and heads south along the coast passing Screda Point, St Catherine's Point, St Catherine's Tor and Speke's Mill. There are pretty streams, waterfalls and in the summer months various pretty plants suchs as yellow flag irises, foxgloves and campion. At Speke's Mill Mouth you head inland through the countryside to Lymebridge before turning north towards the village of Stoke. The village has a 14th century church and tea rooms where you can stop for refreshments. From Stoke it is a short walk back to the Hartland Quay car park although you could take a short detour to visit the fascinating Hartland Abbey. The 12th century abbey has lovely grounds and gardens with the Abbey River flowing through. To extend your walk you can follow the South West Coast Path north to Hartland Point where you will pass the 19th century lighthouse. There's also dramatic cliffs and views of the shipwreck Johanna at this spot where the Bristol Channel meets the Atlantic Ocean.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the Hartland Quay Hotel for some post walk refreshment. Inside there's a nice bar and some interesting memorabilia charting the history of the area. There's also a good outdoor seating area where you can enjoy a meal with wonderful views. You can find them at postcode EX39 6DU."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a bracing dog walk and the hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you can enjoy some lovely waterside trails around the Tamar Lakes near Holsworthy. Head south along the coast path and you could visit the Welcombe and Marsland Valleys Nature Reserve and Morwenstow. The area is run by the National Trust and includes some fine cliff top trails. It's also historically significant with a thousand year old church, a 14th century farm and the noteworthy Hawker's Hut. This unusual structure sits in a photogenic spot and was built using driftwood by local vicar and poet Rev. Robert Stephen Hawker.  For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/glqG5f4zlWs",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beach Path, Hartland, Torridge, Devon, England, EX39 6DB, United Kingdom",
  "postcode": "EX39 6DB",
  "district": "Torridge",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "natural features"
  ],
  "facilities": [
    "car park",
    "tea rooms",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}