{
  "created_at": "2025-01-06T01:10:36.937513+00:00",
  "objectID": "c8f3fefe14d76428c762cb3872e28420",
  "ref": "coventry-canal-walking-and-cycle-route",
  "title": "Coventry Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Warehouses%2C_Coventry_canal_basin_-_geograph.org.uk_-_372842.jpg",
  "nearby": [
    {
      "description": "Ashby Canal",
      "objectID": "31dbc014e341c34576674a452f27b82c",
      "ref": "ashby-canal-walking-route"
    },
    {
      "description": "Lichfield Canal",
      "objectID": "05776ff7a9a60325fd0903d0a23cface",
      "ref": "lichfield-canal-walking-route"
    },
    {
      "description": "Lichfield City Walk",
      "objectID": "1e21b179b83477712b121640794ba73c",
      "ref": "lichfield-city-walk-walking-route"
    },
    {
      "description": "Nuneaton Rotary Walk",
      "objectID": "6b94f2fa94f832e4f1f118afde5e457c",
      "ref": "nuneaton-rotary-walk-walking-route"
    },
    {
      "description": "Pooley Country Park",
      "objectID": "6bf9eecb4fd710a49077bc17101e519e",
      "ref": "pooley-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c8f3fefe14d76428c762cb3872e28420.gpx",
  "_geoloc": {
    "lat": 52.4132640948,
    "lng": -1.5114126922
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Warehouses%2C_Coventry_canal_basin_-_geograph.org.uk_-_372842.jpg",
      "title": "E Gammie / Warehouses, Coventry canal basin",
      "caption": "Warehouses, Coventry canal basin. Looking across the 2 arms of the canal basin, terminus of the Coventry Canal, towards the warehouses which border Leicester Row. These once stored foodstuffs, grain and cement, but are now used as offices. The tower block behind is the Axa office block on Corporation Street/Bishop Street and the pyramid is the top of the tower block at the junction of Smithford Way with Corporation Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Coventry_Canal_Basin_-_statue_of_James_Brindley_%2823726307828%29.jpg/512px-Coventry_Canal_Basin_-_statue_of_James_Brindley_%2823726307828%29.jpg",
      "title": "Elliott Brown from Birmingham, United Kingdom / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "A look around the Coventry Canal Basin at the end / start of the Coventry Canal. The canal is just north of the Coventry Ring Road. And the basin itself runs alongside Leicester Row. The towpath near the canal warehouses on the right is a dead end, so you have to head over to the towpath on the left. That ends near the bridge but you can head over the bridge on Draper's Fields and re-enter the towpath on Leicester Row. The bronze statue of James Brindley by James Butler is shown here as well as a fingerpost pointing to Fradley, Birmingham and Braunston. Brindley was one of the most notable engineers of the 18th century. In total, throughout his life Brindley built 365 miles (587 km) of canals and many watermills, including the Staffordshire and Worcestershire Canal, the Coventry Canal, the Oxford Canal and numerous others, and he also constructed the watermill at Leek, now the Brindley Water Museum."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Coventry_Canal_aqueduct_over_River_Tame_-_geograph.org.uk_-_703552.jpg",
      "title": "Rob Farrow / Coventry Canal aqueduct over River Tame",
      "caption": "Coventry Canal aqueduct over River Tame. Quite unusual seeing water being carried over water, this aqueduct is on the Coventry Canal just a few hundred yards after it has branched off from the Birmingham & Fazeley Canal near Fazeley Junction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Fazeley_Junction_-_geograph.org.uk_-_703609.jpg/256px-Fazeley_Junction_-_geograph.org.uk_-_703609.jpg",
      "title": "Rob Farrow / Fazeley Junction",
      "caption": "Fazeley Junction. Canada Geese in the foreground and Mallard ducks behind them swim nonchalantly about on this canal junction. Ahead, through the bridge the Birmingham & Fazeley Canal heads to Birmingham, off to the right the same canal heads off to join the Trent & Mersey Canal at Fradley Junction. To the left the Coventry Canal departs eastwards. However if you follow the B & F on the map from this point towards the T & M, about halfway to Fradley it gets called the Coventry Canal. The bridge, mill and chapel seen here are all in the adjacent square to the south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Atherstone_Locks_No_2%2C_Coventry_Canal%2C_Warwickshire_-_geograph.org.uk_-_1139336.jpg",
      "title": "Roger Kidd / Atherstone Locks No 2, Coventry Canal, Warwickshire",
      "caption": "Atherstone Locks No 2, Coventry Canal, Warwickshire. A particularly attractive section of the canal near the small market town of Atherstone. This is the second lock of a flight of eleven lowering the water level by eighty feet (24.4 metres) over about two miles (three kilometres). As the canal company had run out of money by 1771 when it reached Atherstone on its course from Coventry, these locks and the rest of the route were constructed later, eventually arriving at Fazeley in 1790."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Coventry_Canal%2C_Brookhay_-_geograph.org.uk_-_266214.jpg",
      "title": "Geoff Pick / Coventry Canal, Brookhay",
      "caption": "Brookhay view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Dunstall_Bridge%2C_Coventry_Canal_-_geograph.org.uk_-_2635.jpg",
      "title": "Nick Atty / Dunstall Bridge, Coventry Canal",
      "caption": "Dunstall Bridge. Typical of the Bridges built by the Birmingham and Fazeley company along this stretch of canal, the bridge almost glows in the evening light"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Coventry_Canal%2C_Mancetter_-_geograph.org.uk_-_103991.jpg",
      "title": "John Winterbottom / Coventry Canal, Mancetter",
      "caption": "View north-northwest along the canal south of Mancetter, Warwickshire, toward bridge No 35 at Quarry Farm"
    }
  ],
  "distance_km": 61.0,
  "description": "Enjoy waterside cycling and walking along the 38 mile long Coventry Canal towpath. Walkers can follow the whole of the route while cyclists can enjoy lovely sections through Coventry and from Marston Junction to Nuneaton. The canal runs from the centre of Coventry to Fradley Juction, passing through Bedworth, Nuneaton, Atherstone, Polesworth and Tamworth. Highlights along the canal include the vibrant Coventry Canal Basin with its shops, businesses and art gallery. You'll also pass the splendid Hartshill Country Park which has miles of footpaths and wonderful views over the Anker Valley. There's also some wonderful countryside to enjoy and a series of artworks by local artists on the Arts Trail from the Basin to Hawkesbury Junction. At the end of the route at Fradley Junction there is a nature reserve with excellent bird watching opportunities. The canal links with the Ashby Canal just north of Bedworth and with the Trent and Mersyet Canal at the end of the route at Fradley Juction near Lichfield. Around here you can also pick up the Lichfield Canal through the city.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One nice place to stop on the route is The Kings Head at Atherstone. The pub is located in a great spot next to the canal and includes a lovely garden area with views over the water. They have a good menu and can be found close to the train station on Old Watling St with a postcode of CV9 2PA for your sat navs. It's also dog friendly if you have your canine friend with you. Near Alvecote and Polesworth you'll find the lovely Pooley Country Park. The canal runs through the park which includes a number of pretty lakes and the historic ruins of a Benedictine priory. There's also a nice on site tea room where you could stop off for some rest and refreshment."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west of the city there's the villages of Berkswell,Hampton in Arden and Balsall Common to visit. The former is particularly noteworthy with its Norman church, Grade II listed 16th century inn and the Berkswell Windmill which dates back to 1826. The epic Heart of England Way can also be picked up in this area. The canal makes up part of National Cycle Route 52 which can be followed north towards Nuneaton, Coalville and Loughborough. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "postcode": "CV1 4LH",
  "district": "Coventry",
  "region": "West Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Thomas Yeoman House, Leicester Row, Bishopsgate Green, Hillfields, Daimler Green, Coventry, West Midlands, England, CV1 4LH, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "canal towpath",
    "countryside",
    "woodland"
  ],
  "points_of_interest": [
    "artworks",
    "nature reserve",
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "visitor center",
    "dog friendly",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling",
    "bird watching"
  ]
}