{
  "created_at": "2025-01-06T01:11:32.287659+00:00",
  "objectID": "c8f7b32c4ebbfba8441ab595c62e2271",
  "ref": "old-pale-hill-walking-route",
  "title": "Old Pale Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Old_Pale_Hill_%2822978713131%29.jpg/512px-Old_Pale_Hill_%2822978713131%29.jpg",
  "nearby": [
    {
      "description": "Delamere Forest",
      "objectID": "d6a99d793c1db1e6f0b2cd04e60f7ae8",
      "ref": "delamere-forest-walking-and-cycle-route"
    },
    {
      "description": "Sandstone Trail",
      "objectID": "820c3e87805731081e451f661a9e79d4",
      "ref": "sandstone-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c8f7b32c4ebbfba8441ab595c62e2271.gpx",
  "_geoloc": {
    "lat": 53.2286449244,
    "lng": -2.6666329908
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Old_Pale_Hill_%2822978713131%29.jpg/512px-Old_Pale_Hill_%2822978713131%29.jpg",
      "title": "Alex Liivet from Chester, United Kingdom / CC0",
      "caption": "Highest point of the Mid Cheshire Ridge. 176 metres high and overlooking Delamere Forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Old_Pale_Hill_%2822779570870%29.jpg/512px-Old_Pale_Hill_%2822779570870%29.jpg",
      "title": "Alex Liivet from Chester, United Kingdom / CC0",
      "caption": "Old Pale Hill summit"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/2019-09-03_%22Old_Pale%22_viewpoint.jpg/512px-2019-09-03_%22Old_Pale%22_viewpoint.jpg",
      "title": "Wildlife Terry / CC0",
      "caption": "Stone marker on the hill top"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Delamere._View_from_Pale_Heights._-_geograph.org.uk_-_207829.jpg",
      "title": "Mike Harris / Delamere. View from Pale Heights.",
      "caption": "Delamere. View from Old Pale Heights. Taken from the western slope just below the radio masts. View due north towards the Mersey. Fiddlers Ferry power station clearly visible 17 km away, with the Pennines beyond."
    }
  ],
  "distance_km": 5.7,
  "description": "This circular walk climbs to the viewpoint at Old Pale Hill in Delamere Forest. The walk starts from Delamere train station but you could also start it at the visitor centre car park nearer to the hill. From here you head south west up to Pale Heights where there are fabulous panoramic views over the area. On a clear day you can see the Manchester skyline, Merseyside and and the mountains of North Wales. In all seven counties are visible from here including Cheshire, Derbyshire, Lancashire, Shropshire and Staffordshire in England, and Denbighshire and Flintshire in Wales. At the top there's also a stone marker displaying the elevation of 176 metres which is the high point of the northern mass of the Mid Cheshire Ridge. There's also three transmitter masts which carry radio, television and telephone signals. After taking in the views the route descends to the north, following woodland trails to the pretty Blakemere Moss Lake. There's a nice trail heading east along the lake which will take you back to the train station.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The start point for this this walk is Delamere train station which offers an easy way for visitors to reach the forest by public transport. The station is 9½ miles (15 km) east of Chester on the Mid-Cheshire Line. There is an hourly service each way between Chester and Manchester in each direction. Hatchmere Lake is located just to the north of Blakemere Moss and a nice way to extend your walk. The mere is also a nature reserve run by the Cheshire Wildlife Trust. Here you can look out for a variety of interesting birds including great crested grebe, reed bunting and willow warbler. The reserve also includes the surrounding fens, wet woodland and wet heath with many rare plants to see as well. You can find the site at a postcode of WA6 6NY with the reserve accessed via a footpath off Ashton Road in the village, just as you enter the forest. Dogs on leads are permitted at the mere. The circular Kelsall Walk starts from the nearby village. It uses a section of the Eddisbury Way and the Sandstone Trail to visit Delamere Forest before heading up to Old Pale Hill. You can pick up the Baker Way in Delamere Forest. The easy path will take you to Chester with a pleasant stretch along the Shropshire Union Canal. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/0bfS7O2vhXA",
  "district": null,
  "county": "Cheshire West and Chester",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Station House Cafe, Station Road, Delamere and Oakmere, Cheshire West and Chester, England, CW8 2HZ, United Kingdom",
  "postcode": "CW8 2HZ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake"
  ],
  "points_of_interest": [
    "viewpoint",
    "lake"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}