{
  "created_at": "2025-01-06T11:05:59.975077+00:00",
  "objectID": "c914ca1dd7f18937c96001a39c4e2fce",
  "ref": "imber-range-perimeter-path-walking-route",
  "title": "Imber Range Perimeter Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Imber_Range_Perimeter_Path_-_geograph.org.uk_-_538986.jpg",
  "nearby": [
    {
      "description": "Westbury White Horse",
      "objectID": "ec48d6976520c8bb9d93d0a7ddbd3b0a",
      "ref": "westbury-white-horse-walking-route"
    },
    {
      "description": "Salisbury Plain",
      "objectID": "3fdec00b122e35f35a2eeb86a2c810f7",
      "ref": "salisbury-plain-walking-route"
    },
    {
      "description": "Trowbridge Park and River Walk",
      "objectID": "d4ac385601adcbfd4b10682750a183df",
      "ref": "trowbridge-park-and-river-walk-walking-route"
    },
    {
      "description": "Battlesbury Hill",
      "objectID": "a2399b04eb41c54340b264c0c63d7b11",
      "ref": "battlesbury-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c914ca1dd7f18937c96001a39c4e2fce.gpx",
  "_geoloc": {
    "lat": 51.2577630405,
    "lng": -2.1549470349
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Imber_Range_Perimeter_Path_-_geograph.org.uk_-_538986.jpg",
      "title": "Graham Horn / Imber Range Perimeter Path",
      "caption": "Descending towards Field Barn. The restricted area is to the left, but is mainly sheep grazing land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Stoke_Hill_triangulation_point_-_geograph.org.uk_-_367786.jpg",
      "title": "Phil Williams / Stoke Hill triangulation point",
      "caption": "Stoke Hill triangulation point. A view looking to the southwestfrom the Imber Range Perimeter Path, towards the triangulation point on Stoke Hill. The pillar seems to have suffered some damage, from the scrapes on the side, I would guess from a tracked vehicle. Tottenham Wood can be seen on the skyline to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/The_view_from_Westbury_Down_-_geograph.org.uk_-_87537.jpg",
      "title": "Phil Williams / The view from Westbury Down",
      "caption": "The view from Westbury Down. Looking northwest over cropland from the Imber Range Perimeter Path on Westbury Down. The Large cement works, destination of the chalk extracted from the nearby excavation, can be seen at left centre. Trowbridge, the county town of Wiltshire, can be seen in the middle distance at right centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Tributary_of_the_River_Wylye_-_geograph.org.uk_-_384929.jpg",
      "title": "Phil Williams / Tributary of the River Wylye",
      "caption": "Tributary of the River Wylye. A view looking to the southeast along a small tributary of the River Wylye. The white railings in the background marks the culvert where the stream passes under the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Wardens_Down_-_geograph.org.uk_-_373395.jpg",
      "title": "Phil Williams / Wardens Down",
      "caption": "Wardens Down A view looking to the south towards Wardens Down, with the slopes of High Down on the left. The majority of this OS grid square lies within the Salisbury Plain Training Area (SPTA) to which there is little public access. The area shown falls within the Imber Firing Range and is photographed from the barbed wire fence which forms the limit of public access, just off the Imber Range Perimeter Path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Cottages_near_East_Hill_Farm_-_geograph.org.uk_-_384932.jpg",
      "title": "Phil Williams / Cottages near East Hill Farm",
      "caption": "Cottages near East Hill Farm. A view looking to the east along the Path towards a row of cottages near East hill farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Field_of_dandelions_-_geograph.org.uk_-_424097.jpg",
      "title": "Doug Lee / Field of dandelions",
      "caption": "Field of dandelions. The open land between the path perimeter to the north and the line of trees here has been left ungrazed and untended."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/From_the_Imber_Range_Perimeter_Path_-_geograph.org.uk_-_535076.jpg",
      "title": "Graham Horn / From the Imber Range Perimeter Path",
      "caption": "From the path at Upton Cow Down, looking towards Dilton Middle Down in the centre of the square. This is on one edge of the Imber Range, and the Imber Range Perimeter Path does exactly what it says on the tin. Notices, like the one on the right, abound. However, the farmland in the middle distance is within the range; there are special exemptions for a number of farms on the perimeter."
    }
  ],
  "distance_km": 48.0,
  "description": "This circular walking path takes you around the perimeter of a military training firing range located on Salisbury Plain. It's an interesting landscape with oceans of chalk grassland and a fascinating prehistoric history. It starts and ends near Westbury and passes through Tilshead, Chitterne and the outskirts of Warminster. Points of interest include the National Trust's White Barrow - a large Neolithic long barrow near Tilshead and the Westbury White Horse on the Salisbury Plain escarpment dating from 1778. You will also pass the MOD's urban warfare training centre at Copehill Down near Chitterne. The unusual site was constructed in 1988 to resemble a Bavarian German village, providing troops with a simulated backdrop when training for European operations. There's much to enjoy on this walk, including terrific views across Salisbury Plain and the Wiltshire and Somerset countryside from the Battlesbury Hill Iron Age fort. Wild orchids and wide variety of birdlife are also common in the summer months. For a full guide to the path from the MOD please click here",
  "details": [],
  "video_url": "https://www.youtube.com/embed/_t5AWBMFE9I",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}