{
  "created_at": "2025-01-06T04:13:09.451124+00:00",
  "objectID": "c9194925c918207b744af74f4a01ded2",
  "ref": "rufus-stone-walking-route",
  "title": "Rufus Stone Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/35/The_Rufus_Stone_-_geograph.org.uk_-_1432228.jpg",
  "nearby": [
    {
      "description": "Minstead",
      "objectID": "d4c63a4b38ac2a434d1f2ee4bce752a5",
      "ref": "minstead-walking-route"
    },
    {
      "description": "Furzey Gardens",
      "objectID": "a19083a5b087cb4ca77a06d9d41e99ca",
      "ref": "furzey-gardens-walking-route"
    },
    {
      "description": "Acres Down",
      "objectID": "b2b9888789d1f10cfda8211dc5acb2b7",
      "ref": "acres-down-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c9194925c918207b744af74f4a01ded2.gpx",
  "_geoloc": {
    "lat": 50.9115089108,
    "lng": -1.6161884042
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/The_Rufus_Stone_-_geograph.org.uk_-_1432228.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Rufus Stone. The Rufus Stone was erected by Earl De La Warr in 1745 and marks the presumed spot where William II was killed by an arrow fired by Walter Tyrrell, while hunting on 2nd August 1100. The killing was said to be accidental. The King's youngest brother, Henry, hearing of his brother's death, rode to Winchester, seized the treasury and had himself proclaimed king by the barons, forestalling the claims of his eldest brother, Robert of Normandy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Confluence_of_two_streams_NW_of_Malwood_Farm%2C_New_Forest_-_geograph.org.uk_-_792235.jpg",
      "title": "Peter Facey / Confluence of two streams NW of Malwood Farm, New Forest",
      "caption": "Confluence of two streams NW of Malwood Farm. One stream is running diagonally from left foreground to centre of picture, where it joins the other which runs left to right across the middle of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/The_Sir_Walter_Tyrrell_Public_House_-_geograph.org.uk_-_332637.jpg",
      "title": "Gillian Moy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Sir Walter Tyrrell Public House. Just a few yards from the Rufus Stone, this pub is aptly named, after the gentleman who apparently shot the arrow that killed King Rufus."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Ford_across_the_stream_north_of_Malwood_Farm%2C_New_Forest_-_geograph.org.uk_-_206694.jpg/256px-Ford_across_the_stream_north_of_Malwood_Farm%2C_New_Forest_-_geograph.org.uk_-_206694.jpg",
      "title": "Jim Champion / Ford across the stream north of Malwood Farm, New Forest",
      "caption": "Ford across the stream north of Malwood Farm. This stream descends from Castle Malwood down to Canterton Manor - a concrete ford has been installed here on the northern edge of Malwood Farm. The farm buildings can be seen in the distance across the field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Pony_grazing_in_Bignell_Wood%2C_New_Forest_-_geograph.org.uk_-_135768.jpg/256px-Pony_grazing_in_Bignell_Wood%2C_New_Forest_-_geograph.org.uk_-_135768.jpg",
      "title": "Jim Champion / Pony grazing in Bignell Wood, New Forest",
      "caption": "Pony grazing in Bignell Wood. This picture is from the western part of Bignell Wood, which contains many moss-covered oaks and beeches, along with the usual understorey of holly. There are numerous wet glades and clearings and, since it is part of the open Forest, it is all well-browsed by the wandering commoners' ponies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/The_bridge_at_Wittensford%2C_New_Forest_-_geograph.org.uk_-_92935.jpg",
      "title": "Jim Champion / The bridge at Wittensford, New Forest",
      "caption": "The bridge at Wittensford. This bridge carries the B3079 over the stream at Wittensford, which was (presumably) once a ford. The B3079 connects Bramshaw and Brook with Cadnam, and this bridge is about half a mile from Junction 1 of the M27. There is an old road sign at the right end of the bridge railings, with Minstead to the left and Bramshaw to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Greys_Farm%2C_Lower_Canterton%2C_New_Forest_-_geograph.org.uk_-_135601.jpg",
      "title": "Jim Champion / Greys Farm, Lower Canterton, New Forest",
      "caption": "Greys Farm, Lower Canterton. The southernmost dwelling in the hamlet of Lower Canterton, Greys Farm looks out onto the unenclosed woodland and the site of a former royal hunting lodge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Forestry_Commission_Signage_for_the_Rufus_Stone.jpg/512px-Forestry_Commission_Signage_for_the_Rufus_Stone.jpg",
      "title": "Ethan Doyle White, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "The Forestry Commission Signage for the Rufus Stone with the car park in the background"
    }
  ],
  "distance_km": 4.2,
  "description": "This walk visits the historic Rufus Stone in the New Forest. It's a very peaceful spot which marks the spot where King William II (William Rufus) was killed in a hunting accident. There's a monument here to the incident, a picnic area and some nice peaceful walking trails to follow through the surrounding woodland. The walk starts from the car park next to the stone at a postcode of SO43 7HN. The route then heads north east to visit the nearby Bignell Wood and Wittensford Bridge. You then return to the car park on the same paths though you could extend the walk by heading west to visit the adjacent Castle Malwood Walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Sir Walter Tyrrell is the ideal place to go to after visiting the stone. It's aptly named after the Anglo-Norman nobleman who apparently shot the arrow that killed King Rufus. They have a very good menu and a cosy interior with log fires. Outdoors there's a garden area for finer weather. You can find the pub just a short stroll north from the stone at a postcode of SO43 7HD."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails around the stone are ideal for a walk with your dog. The Sir Walter Tyrrell mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The stone is located just north of the pretty village of Minstead. Here you'll find a delightful village green, thatched cottages, a popular local pub and a historic 13th century church. The Minstead Walk starts from here and visits the stone and the beautiful Furzey Gardens. It's a nice way to visit the site and take in another local highlight. A few miles west of the village there's the Bolderwood Deer Sanctuary which is also well worth a visit. You can reach it on the Acres Down Walk which additionally visits the pretty streams and woodland of the Highland Water Inclosure. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/oWrQQq5dvrU",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rufus Stone, A31, Seaman's Corner, Minstead, New Forest, Hampshire, England, SO43 7PE, United Kingdom",
  "postcode": "SO43 7PE",
  "district": "New Forest",
  "state": "England"
}