{
  "created_at": "2025-01-06T02:31:52.161257+00:00",
  "objectID": "c968492b0ebd6be938d4dba86492f658",
  "ref": "priddy-walking-route",
  "title": "Priddy Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Swildon%27s_Hole_-_geograph.org.uk_-_1448070.jpg/256px-Swildon%27s_Hole_-_geograph.org.uk_-_1448070.jpg",
  "nearby": [
    {
      "description": "Ebbor Gorge",
      "objectID": "32931dfba66cac09cb4c1c9fd5c02561",
      "ref": "ebbor-gorge-walking-route"
    },
    {
      "description": "Wells",
      "objectID": "50e2bd4649d6df8c9de037c0c79f7f57",
      "ref": "wells-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "West Mendip Way",
      "objectID": "ae4e6d155e5bd663f57deea08ad1ed66",
      "ref": "west-mendip-way-walking-route"
    },
    {
      "description": "Draycott Sleights",
      "objectID": "aafde175a764df9e398d7085ad8221fa",
      "ref": "draycott-sleights-walking-route"
    },
    {
      "description": "Cheddar Gorge",
      "objectID": "670588568e5784bafdbeb40078ef6507",
      "ref": "cheddar-gorge-walking-route"
    },
    {
      "description": "Cheddar Reservoir",
      "objectID": "e10c903d2daf1b8614b1867cc5a3e388",
      "ref": "cheddar-reservoir-walking-route"
    },
    {
      "description": "Butcombe Trail",
      "objectID": "f9d69b7c2eab3ffec6672d002aadf36a",
      "ref": "butcombe-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c968492b0ebd6be938d4dba86492f658.gpx",
  "_geoloc": {
    "lat": 51.2589894869,
    "lng": -2.679588169
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Swildon%27s_Hole_-_geograph.org.uk_-_1448070.jpg/256px-Swildon%27s_Hole_-_geograph.org.uk_-_1448070.jpg",
      "title": "Sharon Loxton / Swildon's Hole",
      "caption": "Swildon's Hole. Inside the stone blockhouse is a small triangular hole in the ground, and this is the entrance to Swildon's Hole. The cave contains an active streamway which eventually resurges at Wookey Hole Caves. This was proved in the 1930s by the use of dyes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Bronze_Age_Barrows_-_geograph.org.uk_-_1448193.jpg",
      "title": "Sharon Loxton / Bronze Age Barrows",
      "caption": "Bronze Age Barrows. In the foreground is a Bowl Barrow. This is one of a pair of bowl barrows (the phtographer was standing on the other) which, along with 7 other round barrows, make up Priddy Nine Barrows. In the distance is Ashen Hill and 6 of the 8 Ashen Hill Barrows can be seen there silhoueted against the wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Ashen_Hill_Barrows_-_geograph.org.uk_-_921604.jpg",
      "title": "Ken Grainger / Ashen Hill Barrows",
      "caption": "Ashen Hill Barrows. An important Bronze Age cemetery on a wide hilltop in the Mendips, with extensive views over Somerset in all directions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Priddy_Green_from_Wells_Road_-_geograph.org.uk_-_1257785.jpg",
      "title": "Maurice Pullin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Priddy Green from Wells Road. This is what they said about Priddy in 1868: \"PRIDDY, a parish in the hundred of Wells Forum, county Somerset, 5 miles N.W. of Wells, its post town. The village, which is of small extent, and wholly agricultural, lies in a small hollow near the summit of the Mendip range of hills, at an elevation of nearly 1,000 feet above sea-level. A great portion of the land is in pasture. The soil is of a light nature, with a subsoil of limestone. A Roman camp exists in the neighbourhood, and there are traces of numerous lead and silver mines, supposed to have been worked by the Romans and Britons.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Stockhill_Car_Park_-_geograph.org.uk_-_1720286.jpg/512px-Stockhill_Car_Park_-_geograph.org.uk_-_1720286.jpg",
      "title": "ROGER ROBERTS / Stockhill Car Park",
      "caption": "Stockhill Car Park. Stockhill Woods taken from North Hill. The woods are located to the east of the village near the Priddy Mineries reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Sheep_hurdles_at_Priddy%2C_Mendip_Hills%2C_Somerset_-_geograph.org.uk_-_61968.jpg",
      "title": "Patrick Mackie / Sheep hurdles at Priddy, Mendip Hills, Somerset",
      "caption": "Sheep hurdles at Priddy, Mendip Hills, Somerset. The notice on the side of the stack reads as follows (typographical error faithfully reproduced!). \"These hurdles are a symbolic reconstruction of the collection which were stored here to form the pens for the sheep fair which moved from Wells to Priddy in 1348 at the outbreak of the Black Death. The fair is now held annually on the nearest Wednesday to the original date of 21th August.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Top_of_Ebbor_Gorge_-_geograph.org.uk_-_1281212.jpg",
      "title": "Rick Crowley / Top of Ebbor Gorge",
      "caption": "Top of Ebbor Gorge. The picture is taken from the signposted view point at the top end of the gorge on the red sign posted route. There is a serious drop into the gorge a few feet in front of the photographer. In the distance on the skyline the Glastonbury Tor and Ruin of St Michael's Church on its summit can just be seen as a pinprick."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Wookey_Hole%2C_footbridge_in_the_park._-_geograph.org.uk_-_1206634.jpg",
      "title": "Ken Grainger / Wookey Hole, footbridge in the park.",
      "caption": "Wookey Hole, footbridge in the park."
    }
  ],
  "distance_km": 12.3,
  "description": "This Somerset based village is a fine place to start a walk with some fascinating ancient sites, wildlife rich nature reserves and murky limestone caverns to explore. There's also some fine country walking in the surrounding Mendips Hills to enjoy. The village sits at an elevation of nearly 1,000 feet (300 m) above sea-level, meaning it is located at one of the highest points in the hills. This circular walk from the village visits some of the local highlights including the ancient Priddy Nine Barrows, the Priddy Mineries Nature Reserve, the Ebbor Gorge National Nature Reserve and the mysterious Wookey Hole near Wells. The walk starts in the village and heads north towards Townsend and the Priddy Pool. Here you pick up Nine Barrows Lane and follow it north east towards Cranmore view. From here you can pick up a footpath heading south to Priddy Nine Barrows. The Barrows are a Bronze Age cemetery and are on open ground at just over 300m above sea level. From the elevated position there are splendid views over the Somerset countryside. The route continues south through the Priddy Mineries where there's a series of pools and lots of wildlife to look out for. Here you pick up the Monarch's Way and continue south to Dursdon Wood and the Ebbor Gorge. This scenic limestone gorge inlcludes streams, woodland and a wide variety of plants and flowers. In the gorge you can pick up the West Mendip Way and follow the waymarked footpath towards Wookey Hole and the Wookey Hole Caves attraction. For a fee you can explore the caves which have been used by humans for around 45,000 years. The route then continues north along the West Mendip way to take you back to Priddy, via Dursdon Drove and Pelting Drove.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village there's the Queen Victoria Inn for some post walk refreshment. The 19th century pub includes original features such as wonderful flagstone flooring, huge fireplaces and beamed ceilings. The friendly pub serves good quality food and has a fine selection of ales as well. They also have a nice garden area to sit out in if the weather is fine. You can find them at Pelting Drove with a postcode of BA5 3BA for your sat navs. The Butcombe Trail also runs through the village. The waymarked circular walk visits several of the prettiest villages and the finest pubs in the Mendips."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and country trails make for a fine dog walk. There are some steep high points in the Ebbor Gorge where it's best to keep them on leads. The Queen Victoria Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west of the village you can continue your walking around Draycott Sleights Nature Reserve. The spectacular Cheddar Gorge, the historic town of Axbridge and the picturesque Cheddar Reservoir are also only a few miles north west. Just to the south is the village of Wedmore where you could vist the old coaching inn which dates back to the 1700s. Our walk from here visits the reservoir and the gorge by following the River Axe from the village. The Westhay Moor Nature Reserve is also located near here. The reserve is part of wider Avalon Marshes and includes a series of footpaths running around a number of pretty lakes. The area is great for bird watching with a variety of wetland birds visiting site. For more walking ideas in the area see the Mendip Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BoxKW_9CA2E",
  "postcode": "BA5 3BP",
  "district": "Priddy",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Townsend, Priddy, Somerset, England, BA5 3BP, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserves",
    "viewpoints"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}