{
  "objectID": "c9ca81fd1023b84efb93890cfb2f0221",
  "created_at": "2024-12-18T09:32:24.796823+00:00",
  "ref": "hassocks-walking-route",
  "title": "Hassocks Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Friars_Oak_Inn%2C_Hassocks_-_geograph.org.uk_-_57252.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/c9ca81fd1023b84efb93890cfb2f0221.gpx",
  "_geoloc": {
    "lat": 50.9247130618,
    "lng": -0.1444391587
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Friars_Oak_Inn%2C_Hassocks_-_geograph.org.uk_-_57252.jpg",
      "title": "Simon Carey / Friars Oak Inn, Hassocks",
      "caption": "Friars Oak Inn, Hassocks. The Inn was built circa 1900 replacing an older one of the same name that had been erected sometime in the late 18th/early 19th century to serve a London-Brighton turnpike that passed along the course of the current A273. It also has a literary connection appearing in Conan Doyle's story 'Rodney Stone'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Station_Cottages%2C_Hassocks_-_geograph.org.uk_-_57057.jpg",
      "title": "Simon Carey / Station Cottages, Hassocks",
      "caption": "Station Cottages. Looking West from the entrance of Hassocks station. Built in the mid 19th century for railway workers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Adastra_Park%2C_Keymer_-_geograph.org.uk_-_2158569.jpg/512px-Adastra_Park%2C_Keymer_-_geograph.org.uk_-_2158569.jpg",
      "title": "Adastra Park, Keymer by Paul Gillett, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Adastra Park. This large open space is located on the eastern side of the village and includes the Garden of Remembrance, the Community Pavilion, football pitches, a cricket pitch, a bowling green, tennis courts, a skate park, children’s play areas, and adult fitness equipment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Ditchling_-_geograph.org.uk_-_67195.jpg",
      "title": "Simon Carey / Ditchling",
      "caption": "Ditchling village. The crossroads at the centre of Ditchling. South Street leads to Brighton via Clayton or Ditchling Beacon, West Street heads towards Keymer, High Street (to the right) goes north to Haywards Heath whilst Lewes Road where the picture was taken speaks for itself. The South Street/High Street route was the part of the original London-Brighton turnpike constructed in 1770. I believe the blue car is a Rolls Royce though I have no idea of make or model."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Ditchling_from_Ditchling_Beacon_-_geograph.org.uk_-_48438.jpg",
      "title": "Simon Carey / Ditchling from Ditchling Beacon",
      "caption": "Ditchling from Ditchling Beacon. Taken from above the nature reserve looking north towards the village of Ditchling. The junction at the bottom of the hill is where Beacon Road crosses with Underhill Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/View_from_Ditchling_Nature_Reserve_-_geograph.org.uk_-_614162.jpg",
      "title": "Simon Carey / View from Ditchling Nature Reserve",
      "caption": "View from Ditchling Nature Reserve. The nearest field is still in this square beyond that in the distance is the combined villages of Keymer and Hassocks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Jack_and_Jill_-_geograph.org.uk_-_684714.jpg/256px-Jack_and_Jill_-_geograph.org.uk_-_684714.jpg",
      "title": "Simon Carey / Jack & Jill",
      "caption": "Jack & Jill Clayton windmills, just south of the village.Viewed from the car park as the sun sets beyond the Downs. Jack is in the background and its history can be found at 682937. Jill is the post mill in the foreground and is actually the older of the two having been built in 1821 in Dyke Road in Brighton. Known as Lashmars mill it was purchased by the then owner of Jack in 1852 to increase his milling production. The windmill was dismantled, moved by oxen and reassembled on the site. It stopped working in 1906. Since 1978 it has been restored by a team volunteers and is open to the public most weekends from May to September."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Quarry%2C_Wolstonbury_Hill_-_geograph.org.uk_-_1637853.jpg",
      "title": "Simon Carey / Quarry, Wolstonbury Hill",
      "caption": "Quarry, Wolstonbury Hill. Looking down into a disused chalk quarry on the north western side of the old bronze age fort. To the left is the northern escarpment of the South Downs with the tree fringed crown of Chanctonbury Ring prominent centre left. The clear skies also enable a fine view towards Blackdown Hill on the Sussex/Hampshire border in the far distance to the right. Of the wooded areas, Newtimber and Park Woods are beyond the working quarry to the left whilst Shaves Wood is to the right."
    }
  ],
  "distance_km": 16.5,
  "description": "This West Sussex based village is in a great location for exploring some of the local highlights of the South Downs. There's also some history with a noteworthy Anglo-Saxon church and a fine former coaching inn for refreshments afterwards. This circular walk from the town visits Wolstonbury Hill, the Clayton Windmills and the popular Ditchling Beacon. The walk starts from the train station and heads east to Keymer and Ditchling village. Here you pick up the Sussex Border Path and follow the waymarked footpath south to the Ditchling Beacon Nature Reserve where there's a wide variety of wildlife to see. If you head east from here along The South Downs Way it will take you up to Ditchling Beacon where there are excellent views over the Downs. After enjoying the views you head west along the South Downs Way towards the Clayton Windmills. These are something of a local Hassocks landmark and are known as Jack and Jill. Continue west past Wellcombe Bottom and you will soon come to Wolstonbury Hill, another excellent viewpoint in the area. The route then descends to the north to follow New Way Lane into Hurstpierpoint. From here you head east past Hurst Wickham Stables before coming into Hassocks.",
  "video_url": "https://www.youtube.com/embed/11jRPs_J7uc",
  "postcode": "BN6 8HN",
  "district": "Hassocks",
  "county": "West Sussex",
  "region": "South East",
  "country": "England"
}