{
  "created_at": "2025-01-06T00:42:37.663463+00:00",
  "objectID": "ca373e657eaa0c0ca3db46accdb7d189",
  "ref": "padarn-country-park-walking-route",
  "title": "Padarn Country Park and Llyn Padarn Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Llyn_Padarn_-_geograph.org.uk_-_468156.jpg",
  "nearby": [
    {
      "description": "Moel Eilio",
      "objectID": "38b6ee87739d9b6ca960822746b9b987",
      "ref": "moel-eilio-walking-route"
    },
    {
      "description": "Llanberis Waterfall",
      "objectID": "59ef522b82e2d791946c2b2090c131d3",
      "ref": "llanberis-waterfall-walking-route"
    },
    {
      "description": "Llanberis Lake",
      "objectID": "d252da2ca59e60e2f4dd9a57ead03f05",
      "ref": "llanberis-lake-walking-route"
    },
    {
      "description": "Dinorwic Quarry",
      "objectID": "c661f97ed6e33688c015d75d4aa6dba2",
      "ref": "dinorwic-quarry-walking-route"
    },
    {
      "description": "Bethesda",
      "objectID": "334da2148a2a32b6e8697c91698b21db",
      "ref": "bethesda-walking-route"
    },
    {
      "description": "Lon Las Peris",
      "objectID": "99b4d57b6f2f36310e5d3ff763df99a8",
      "ref": "lon-las-peris-cycle-route"
    },
    {
      "description": "Marchlyn Mawr",
      "objectID": "f521f4fa640d9cdd1e07df6358b8bd99",
      "ref": "marchlyn-mawr-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/ca373e657eaa0c0ca3db46accdb7d189.gpx",
  "_geoloc": {
    "lat": 53.1222095359,
    "lng": -4.1140229832
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Llyn_Padarn_-_geograph.org.uk_-_468156.jpg",
      "title": "Trevor Rickard / Llyn Padarn",
      "caption": "Llyn Padarn. Llanberis village is just behind the trees in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Model_boat_enthusiasts_on_the_shores_of_Llyn_Padarn_-_geograph.org.uk_-_684031.jpg",
      "title": "Eric Jones / Model boat enthusiasts on the shores of Llyn Padarn",
      "caption": "Model boat enthusiasts on the shores of Llyn Padarn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/The_Snowdon_Star_on_Llyn_Padarn_-_geograph.org.uk_-_240232.jpg",
      "title": "Eric Jones / The Snowdon Star on Llyn Padarn",
      "caption": "The Snowdon Star on Llyn Padarn. This vessel, formerly known as the 'Southampton Star', was built in 1947. It is 13.7m long and has a gross tonnage of 12.00t. For some years now, despite initial protests from a powerful angling lobby, the Snowdon Star has been engaged in taking visitors on excursions along the lake from its base at Llanberis. It also provides a ferry service between the village and the Padarn Country Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Rock_outcrops_of_the_Pre-Cambrian_Padarn_ridge_seen_across_Llyn_Padarn_-_geograph.org.uk_-_480653.jpg",
      "title": "Eric Jones / Rock outcrops of the Pre-Cambrian Padarn ridge seen across Llyn Padarn",
      "caption": "Rock outcrops of the Pre-Cambrian Padarn ridge seen across Llyn Padarn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Llyn_Padarn_and_Snowdon_-_geograph.org.uk_-_77179.jpg",
      "title": "Chris Plunkett / Llyn Padarn and Snowdon",
      "caption": "Stunning view across the lake to Snowdon. A view,roughly facing south east taken from Padarn country park, with the pyramidical summit of Snowdon just visible in the distance [centre]."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Lower_end_of_Llyn_Padarn_-_geograph.org.uk_-_536545.jpg",
      "title": "Eric Jones / Lower end of Llyn Padarn",
      "caption": "Lower end of the lake with old stone bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/National_Slate_Museum_-_geograph.org.uk_-_464123.jpg",
      "title": "Trevor Rickard / National Slate Museum",
      "caption": "National Slate Museum. Museum buildings on the left. The Museum is located at Gilfach Ddu in the 19th-century workshops of the now disused Dinorwic quarry, within the Country Park. The site includes the multi-media display, 'To Steal a Mountain', showing the lives and work of the men who quarried slate here. There's also the largest working waterwheel in mainland Britain, which is available for viewing via several walkways. The ponds are connected with Llyn Padarn on the right and are used for canoeing lessons."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Llanberis_Lake_Railway_-_geograph.org.uk_-_774662.jpg",
      "title": "John Firth / Llanberis Lake Railway",
      "caption": "Llanberis Lake Railway. The narrow gauge heritage railway runs for about 2.5 miles along the northern shore of Llyn Padarn."
    }
  ],
  "distance_km": 4.0,
  "description": "This country park in Snowdonia has a number of splendid way-marked walking trails to follow. There are 800 acres to explore through oak woodland and along lakeside paths. The beautiful Llyn Padarn is the centrepiece of the park. You can stroll along the lakeside or catch the Llanberis Lake Railway which runs along the easten edge of the lake. It's a splendid 1 hour ride with views of the 13th century Dolbadarn Castle and the twin lakes of Llyn Padarn and Llyn Peris. Mount Snowdon, the highest peak in England and Wales makes a wonderful backdrop. To continue your walking in the area you could visit the spectacular Llanberis Waterfall. It is located just to the south of the country park and has a nice footpath running to the 100ft high falls. For splendid views of the area you could try the climb to Moel Eilio from Llanberis. For cyclists there's Lon Las Peris on the western side of the water. The surfaced trail runs along a tree lined path on the old railway line.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Llanberis on the western side of the lake and there's lots of fine refreshment options. On the High Street you'll find The Heights. This friendly pub is popular with walkers who have been climbing the hills and mountains surrounding the town. There's an attractive interior and a beer garden to sit out in on finer days. They have a good selection of ales, a decent menu and are also dog friendly. You can find the pub at postcode LL55 4HB."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park, lake and surrounding woodland are ideal for dog walking and you can also have them off leash in most areas. The Heights Pub mentioned above also welcomes dogs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head to the other side of the lake and you can try the circular Llanberis Lake Walk. There's some nice lakeside footpaths here taking you to the photogenic Dolbadarn Castle which dates from the early 13th century. On the fringes of the park there's the fascinating Dinorwic Quarry to explore. At one time the quarry was the second largest slate quarry in the world. You can pick up the tramway trail footpath across the site just north of the visitor centre. The quarry is one of the significant sites on the Snowdonia Slate Trail which runs through the area. The circular long distance trail can be used to visit several of the other historic mining areas located in the World Heritage Site. Heading north along the trail would take you to Bethesda where you could visit the Penrhyn Quarry which was the largest slate quarry in the world during the 19th century. Heading south along the trail would take you to Dorothea Quarry where you'll find the remains of the old mining houses and a series of scenic lakes including Llyn Nantlle Uchaf. For more walking ideas in the area see the Snowdonia Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hJQwuHRCO9o",
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Glan-y-Bala Tunnel, Llanddeiniolen, Llanberis, Gwynedd, Cymru / Wales, LL55 4TY, United Kingdom",
  "postcode": "LL55 4TY",
  "district": "Llanberis",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "1 hour",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "waterfall"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "wheelchair accessible",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}