{
  "created_at": "2025-01-06T00:42:46.710585+00:00",
  "objectID": "ca98d53eb035b1793d8a78c8e54f12ce",
  "ref": "east-grinstead-walking-route",
  "title": "East Grinstead Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Cromwell_House%2C_High_Street%2C_East_Grinstead_%28geograph_4524264%29.jpg/512px-Cromwell_House%2C_High_Street%2C_East_Grinstead_%28geograph_4524264%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/ca98d53eb035b1793d8a78c8e54f12ce.gpx",
  "_geoloc": {
    "lat": 51.1264005458,
    "lng": -0.0155807526
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Cromwell_House%2C_High_Street%2C_East_Grinstead_%28geograph_4524264%29.jpg/512px-Cromwell_House%2C_High_Street%2C_East_Grinstead_%28geograph_4524264%29.jpg",
      "title": "Jo Turner / Cromwell House, High Street, East Grinstead",
      "caption": "Cromwell House, High Street, East Grinstead. This building dates from the 19th century and is Grade II listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Sackville_College._East_Grinstead_-_geograph.org.uk_-_44018.jpg",
      "title": "Simon Carey / Sackville College. East Grinstead",
      "caption": "Sackville College. East Grinstead. Originally built as Jacobean Almshouses in 1609"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Standen_House%2C_Saint_Hill_-_geograph.org.uk_-_1191110.jpg",
      "title": "Peter Trimming / Standen House, Saint Hill",
      "caption": "Standen House, Saint Hill. View from the south of this attractive National Trust house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Garden_at_Standen_House_-_geograph.org.uk_-_1191129.jpg",
      "title": "Peter Trimming / Garden at Standen House",
      "caption": "Garden at Standen House. An attractive bench in front of an extensive dry stone wall lend character to this quiet, and shady, lower part of the garden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Weir_Wood_Reservoir_-_geograph.org.uk_-_6827.jpg",
      "title": "Darren Hill / Weir Wood Reservoir",
      "caption": "Weir Wood Reservoir. Taken from the part of Legsheath Lane that was built to divert a route around the south western part of the reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/NCN_Millennium_Milepost_MP42_East_Grinstead.jpeg/256px-NCN_Millennium_Milepost_MP42_East_Grinstead.jpeg",
      "title": "Peter Trimming / Forest Way, East Grinstead",
      "caption": "NCN Millennium Milepost MP42 East Grinstead"
    }
  ],
  "distance_km": 11.5,
  "description": "The town of East Grinstead is located in the Mid Sussex District of West Sussex. It's nicely situated on the edge of the High Weald AONB where there are great opportunities for walking. It's also located close to a number of historic houses and a splendid reservoir and nature reserve. This circular walk from the town uses the High Weald Landscape Trail, the Sussex Border Path and the Forest Way to visit the nearby Weir Wood Reservoir. The route runs for about 7 miles with countryside, woodland and waterside footpaths to enjoy on the way. There's also a visit to the National Trust's lovely Standen House. The walk starts at the train station and heads through the town along the High Weald Landscape Trail. You then head south through the countryside to Dunning's Wood before coming to Standen House. The house dates from the 19th century and includes gardens, parkland and bluebell woodland. Shortly after leaving the house you'll come to the expansive Weir Wood Reservoir. The western end of the 280 acre reservoir is a protected nature reserve and bird sanctuary. You can follow the Sussex Border Path east along the water before heading north east to meet up with the Forest Way. This shared cycling and walking path will take you north west back into the town centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ship Inn is a good choice for some post walk refreshments. They do very good food and have an attractive interior with a cosy fire for cold days. If the weather is fine there's a nice terraced garden outside too. You can find the pub on Ship Street at a postcode of RH19 4EG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area around the town is great for dog walking and the Ship Inn pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can catch regular trains to the town from both London Bridge and London Victoria. The journey time is about an hour. The popular Worth Way also starts from the town. This shared cycling and walking trail runs along a disused railway line to Crawley Down and Crawley. The villages of Ashurst Wood and Forest Row are located a few miles to the south east. Here you can pick up trails leading into the expansive Ashdown Forest. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "postcode": "RH19 1EG",
  "district": "East Grinstead",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}