{
  "created_at": "2025-01-06T00:56:28.726948+00:00",
  "objectID": "ca9fb2465435f03106946d42ab42ebba",
  "ref": "hambleton-hills-walking-route",
  "title": "Hambleton Hills Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Gormire_Lake_-_geograph.org.uk_-_582956.jpg",
  "nearby": [
    {
      "description": "Boltby Forest",
      "objectID": "52c969abf5b859364575700a0963acfd",
      "ref": "boltby-forest-walking-and-cycle-route"
    },
    {
      "description": "Lyke Wake Walk",
      "objectID": "8c5ab288050adb29c1f906c939876934",
      "ref": "lyke-wake-walk-walking-route"
    },
    {
      "description": "Cleveland Way",
      "objectID": "9d56c63c556a167d04b175f1b86b24e0",
      "ref": "cleveland-way-walking-route"
    },
    {
      "description": "Sutton Bank and the Kilburn White Horse",
      "objectID": "bf3ea0255e6bc853b03708e82e87f2ca",
      "ref": "sutton-bank-and-the-kilburn-white-horse-walking-route"
    },
    {
      "description": "Gormire Lake",
      "objectID": "8cf825b3ca9b1c19ca5029041bfbb144",
      "ref": "gormire-lake-walking-route"
    },
    {
      "description": "Byland Abbey",
      "objectID": "94d761967c0c3eb23216161af3fcde6d",
      "ref": "byland-abbey-walking-route"
    },
    {
      "description": "Osmotherley",
      "objectID": "99b20497260212644949d9f5b2126525",
      "ref": "osmotherley-walking-route"
    },
    {
      "description": "Oulston Reservoir",
      "objectID": "548569ba90e6e3884d981bcb771283af",
      "ref": "oulston-reservoir-walking-route"
    },
    {
      "description": "Crayke",
      "objectID": "beb3cc76ac57206e3d995370073fe1b4",
      "ref": "crayke-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/ca9fb2465435f03106946d42ab42ebba.gpx",
  "_geoloc": {
    "lat": 54.2245295361,
    "lng": -1.2126646743
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Gormire_Lake_-_geograph.org.uk_-_582956.jpg",
      "title": "Stephen McCulloch [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Gormire Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Sutton_Bank_MMB_18.jpg/512px-Sutton_Bank_MMB_18.jpg",
      "title": "By mattbuck (category) (Own work by mattbuck.) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0) or CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "View from Sutton Bank"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/On_the_edge_of_Hambleton_Down_-_geograph.org.uk_-_1628368.jpg",
      "title": "Gordon Hatton / On the edge of Hambleton Down",
      "caption": "A wintery scene on the edge of Hambleton Down. Taken above the Cleveland Way path and looking north along the scarp edge towards Boltby Forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Boltby_Scar_from_the_Cleveland_Way_-_geograph.org.uk_-_1802978.jpg/512px-Boltby_Scar_from_the_Cleveland_Way_-_geograph.org.uk_-_1802978.jpg",
      "title": "Philip Barker / Boltby Scar from the Cleveland Way",
      "caption": "Boltby Scar from the Cleveland Way. This photograph shows a view of a section of Boltby Scar taken from the Cleveland Way long-distance footpath as it passes by Hambleton Mosses. A part of South Woods can be seen on the right-hand side of the image. A gate (leading to the footpath that goes to the junction of Cleveland Road and Wethercote Lane) is just visible to the left of the trees seen on the horizon. The picture was taken looking in a southerly direction towards Hill Fort Windypit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Boltby_Quarry_and_High_Barn_-_geograph.org.uk_-_582701.jpg",
      "title": "Graham Horn / Boltby Quarry and High Barn",
      "caption": "Boltby Quarry and High Barn. Boltby Quarry, one of the many disused limestone quarries in the area, extends across the foreground. Behind, on the plateau, is the well-named High Barn with its shelterbelt of trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Heathland_above_the_Whitestone_Cliff_-_geograph.org.uk_-_863204.jpg",
      "title": "Gordon Hatton / Heathland above the Whitestone Cliff",
      "caption": "Heathland above the Whitestone Cliff. From the top of the Whitestone Cliff, most cameras are pointed westwards to take in the superb view, but in the opposite direction is an attractive area of heathland with heather, bilberry and a scattering of trees. In places the Jurassic limestones are overlain with grits and sandstones which favour acid loving heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Cleveland_Way_on_Little_Moor_-_geograph.org.uk_-_582723.jpg",
      "title": "Graham Horn / Cleveland Way on Little Moor",
      "caption": "Cleveland Way on Little Moor. The Cleveland Way long distance path follows the plateau of the Hambleton Hills for many miles. It is all easy walking along a wide turfed drove road as typified here in the view north from Little Moor towards Black Hambleton Moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Track_junction_at_White_Gill_Head_-_geograph.org.uk_-_1766394.jpg/512px-Track_junction_at_White_Gill_Head_-_geograph.org.uk_-_1766394.jpg",
      "title": "Philip Barker / Track junction at White Gill Head",
      "caption": "Track junction at White Gill Head. This photograph shows a view of a track junction at White Gill Head. The track in the foreground (and coming in from the left-hand side of the picture is the Cleveland Way long-distance footpath. The path joining from the right-hand side of the image comes from Harker Yates Ridge and circles almost completely around Arden Great Moor. The picture was taken looking in a northerly direction towards Locker Low Moor."
    }
  ],
  "distance_km": 32.0,
  "description": "This walk explores the Hambleton Hills range on the western edge of the North York Moors. You'll visit the highest points on the hills with splendid views over the Vale of Mowbray, the River Rye Valley and the Vale of York. The route makes use of the Cleveland Way national trail for the duration of the walk. Start your walk at the Kilburn White Horse car park and then head north past the iconic hill figure to the splendid Sutton Bank passing Roulston Scar on the way. The hill at Sutton Bank is the site of one of the most important prehistoric monuments in the region, an Iron Age hill fort dating from about 400 BC. You continue past Gormire Lake and Hambleton Down before skirting the eastern edge of Boltby Forest. From here you head between Kepwick Moor and Arden Great Moor before coming to Black Hambleton which rises to a height of 1,308 feet (400 m). Take a while to enjoy the fabulous views over the surrounding moorland and woodland before returning on the same footpath. The video below shows an alternative circular route around Black Hambleton with nice views of Kepwick Moor. If you continue for a few miles north from Black Hambleton you will come to Osmotherley where you can pick up the Lyke Wake Walk. At the southern end of the hills you can also visit the splendid Byland Abbey and the pretty Oulston Reservoir .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Travel south from the hills and you will soon come to Coxwold on the edge of the Howardian Hills. The village is notable as the location where the author Laurence Sterne wrote the well known novel 'The Life and Opinions of Tristram Shandy'. You can learn about his life and works at the museum at Shandy Hall, where he wrote some of his most famous novels during the 18th century. In the village you can pick up the circular Coxwold Walk which visits Newburgh Priory and Shandy Hall before heading to Byland Abbey. The priory is another historic highlight of the area dating back to 1145. The grounds are a lovely place for a stroll with a water garden, hand crafted topiary, a walled garden, woodland and a large lake. The village also contains an excellent local pub, dating back to the 17th century. A few miles to the north you can visit the worthy village of Hawnby and enjoy a climb to the splendid viewpoint at Hawnby Hill. There's wonderful views over Ryedale from this elevated spot. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xGJAWWnR32E",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "White Horse of Kilburn, Low Town Bank Road, Kilburn High and Low, Oldstead, North Yorkshire, York and North Yorkshire, England, YO61 4AN, United Kingdom",
  "postcode": "YO61 4AN",
  "district": "Oldstead",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "woodland"
  ],
  "points_of_interest": [
    "hill figure",
    "prehistoric monument",
    "lake"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}