{
  "created_at": "2025-01-06T00:30:31.788650+00:00",
  "objectID": "cb1cdeecae1cebfeda0946c32b595e29",
  "ref": "flitwick-walking-route",
  "title": "Flitwick Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Mill_race%2C_wheel_and_old_mill%2C_Flitwick_-_geograph.org.uk_-_1517014.jpg/256px-Mill_race%2C_wheel_and_old_mill%2C_Flitwick_-_geograph.org.uk_-_1517014.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cb1cdeecae1cebfeda0946c32b595e29.gpx",
  "_geoloc": {
    "lat": 52.0039899551,
    "lng": -0.4935707683
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Mill_race%2C_wheel_and_old_mill%2C_Flitwick_-_geograph.org.uk_-_1517014.jpg/256px-Mill_race%2C_wheel_and_old_mill%2C_Flitwick_-_geograph.org.uk_-_1517014.jpg",
      "title": "Rob Farrow / Mill race, wheel and old mill, Flitwick",
      "caption": "Mill race, wheel and old mill, Flitwick. A close view of the disused and (I believe) converted water mill. This photo was taken looking over the bridge that allows the water of the mill race to flow under Greenfield Road having originally turned the Water wheel adjoining the old mill. A low wooden footbridge can be seen crossing the leat here in front of the mill. This water wheel once supplied power to the mill, though it looks as though it's been a number of years since it last turned. Perhaps with the growth of interest in renewable energy resources, it could be harnessed up to an electricity generator and have a new lease of life. Behind the wheel can be seen the wooden railing atop a little footbridge which crosses the mill race here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Flitwick_Moor_-_geograph.org.uk_-_2377862.jpg/512px-Flitwick_Moor_-_geograph.org.uk_-_2377862.jpg",
      "title": "Flitwick Moor by Paul Buckingham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Flitwick Moor. A Site of Special Scientific Interest and the largest area of wetland in Bedfordshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/On_the_two_moors_heritage_trail._-_geograph.org.uk_-_1316919.jpg",
      "title": "Dennis simpson / On the two moors heritage trail.",
      "caption": "On the two moors heritage trail on Flitwick Moor. Footbridge across a small stream Raised walkway lifts you out of the wetlands surrounding."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Pond%2C_Flitton_Moor_-_geograph.org.uk_-_2377869.jpg/512px-Pond%2C_Flitton_Moor_-_geograph.org.uk_-_2377869.jpg",
      "title": "Pond, Flitton Moor by Paul Buckingham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pond, Flitton Moor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flitwick_Manor_-_geograph.org.uk_-_2359439.jpg/512px-Flitwick_Manor_-_geograph.org.uk_-_2359439.jpg",
      "title": "Flitwick Manor by Barry Ephgrave, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Flitwick Manor. The Grade II listed house dates from 1632 and is now a hotel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Flitton_Village_Hall_-_geograph.org.uk_-_871490.jpg",
      "title": "Nigel Cox / Flitton Village Hall",
      "caption": "Flitton Village Hall. The Hall is on a sharp bend in the High Street opposite the Church. To the stranger whether this is the 'Flitton & Greenfield Village Hall' mentioned in various places on the internet is a moot point as all the mapping websites point to a location about 500 metres south of here. However the online Flitton Conservation Area brochure refers to this building as 'The Village Hall' so... The road verge in front of the Hall is occupied by all sorts of village street furniture paraphernalia. Visible are the village postbox, the postman's letter storage cabinet, a water company marker headstone, the village sign, the parish notice board, a K6 telephone box, a road sign, a litter bin and a telegraph pole. The logo on the left side of village sign contains the date 1951 and commemorates 'The Festival of Britain' of that year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Parish_Church_of_St_Peter_and_St_Paul%2C_Flitwick_%28geograph_4299764%29.jpg/512px-Parish_Church_of_St_Peter_and_St_Paul%2C_Flitwick_%28geograph_4299764%29.jpg",
      "title": "Mark Anderson / Parish Church of St Peter and St Paul, Flitwick",
      "caption": "Parish Church of St Peter and St Paul"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/River_Flit_-_geograph.org.uk_-_1517076.jpg",
      "title": "Rob Farrow / River Flit",
      "caption": "River Flit"
    }
  ],
  "distance_km": 6.5,
  "description": "This Bedfordshire based town sits in a nice location on the River Flit, near Bedford and Ampthill. Landmarks in the town include a medieval church and the Georgian Flitwick Manor, which is Grade II listed. This circular walk from the town explores Flitwick Moor Nature Reserve before heading to the neighbouring village of Flitton. The walk starts in the town centre, near to the train station. From here you head east to Flitwick Mill before coming to the moor. There's some nice woodland trails and views of the River Flit to be found here. It's good for wildlife too with various woodland birds and muntjac deer to look out for. The route continues north east past Greenfield before reaching Flitton. The village is notable for the De Grey Mausoleum. The English Heritage run site is one of the largest sepulchral chapels in the country. The Grade I listed Mausoleum contains over twenty monuments to the de Grey family who lived in nearby Wrest Park. Here you head west across the attractive Flitton Moor to Ruxox House. At these point the route links with the John Bunyan Trail, a long distance trail which you can follow south west back to Flitwick.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village The Crown is a good choice for post walk refreshment. They have a good menu and a lovely large garden area for warmer days. You can find them on Station Road at postcode MK45 1LA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The moor and woodland are a fine place for a dog walk. The Crown mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north there's Ampthill Park where you can enjoy a climb to the Greensand Ridge for wonderful views over the county. For more walking ideas in the area see the Bedfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4Yn-0oDDkOg",
  "postcode": "MK45 1DP",
  "district": "Flitwick",
  "county": "Central Bedfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}