{
  "objectID": "cb44af7278b158aa6d613f987bd452f4",
  "created_at": "2024-12-18T01:20:02.532764+00:00",
  "ref": "dibden-inclosure-walking-route",
  "title": "Dibden Inclosure Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Ponies_grazing_in_Dibden_Inclosure%2C_New_Forest_-_geograph.org.uk_-_215097.jpg",
  "nearby": [
    {
      "description": "Beaulieu River",
      "objectID": "0252332f3b21d5a4605d753840f0209c",
      "ref": "beaulieu-river-walking-route"
    },
    {
      "description": "Solent Way",
      "objectID": "eaa121d258e86ee84d70f570788add37",
      "ref": "solent-way-walking-route"
    },
    {
      "description": "Beaulieu Heath",
      "objectID": "79a58b4f603e92d79f03ef88668b7c58",
      "ref": "beaulieu-heath-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/052EB66EAB59DDF2852580AC004D8253/$FILE/Dibden Enclosure.gpx",
  "_geoloc": {
    "lat": 50.8498151656,
    "lng": -1.4235791051
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Ponies_grazing_in_Dibden_Inclosure%2C_New_Forest_-_geograph.org.uk_-_215097.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ponies grazing in Dibden Inclosure. The original purpose in enclosing an Inclosure is to exclude the commoners' stock (ponies and cattle) from an area so that new trees are allowed to grow to maturity. Once the trees became established the inclosure was \"thrown open\" to allow the stock back in (since it was originally taken in the 1960s at their expense, to the dismay of the commoners). Unfortunately coniferous plantations have little value as pasture woodland, although there is some grass along the edges of the rides through the trees and that is what these ponies are feeding on."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Dibden_Bottom%2C_New_Forest_-_geograph.org.uk_-_32388.jpg/256px-Dibden_Bottom%2C_New_Forest_-_geograph.org.uk_-_32388.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dibden Bottom and pretty summer heather, New Forest. Most of this grid square is wet heathland, an area known as Dibden Bottom. This view is from the high ground at the SE corner of the square, where the paths lead down to a substantial footbridge across the boggiest part of the heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Coniferous_trees_in_the_Dibden_Inclosure%2C_New_Forest_-_geograph.org.uk_-_32395.jpg",
      "title": "Jim Champion / Coniferous trees in the Dibden Inclosure, New Forest",
      "caption": "Coniferous trees. A typical view along one of the paths through the Dibden Inclosure on the eastern edge of the New Forest. The Inclosures are areas of land set aside for commercial timber production. This one is relatively new (1960s), and is thus not shown on the 1940s OS map. Terry Heathcote's \"Discovering the New Forest\" says that various deciduous trees were planted on the perimeter of the inclosure as a cosmetic screen, with the bulk being varieties of pine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Power_lines_between_the_Dibden_Inclosure_and_the_Hythe_by-pass%2C_New_Forest_-_geograph.org.uk_-_32396.jpg",
      "title": "Jim Champion / Power lines between the Dibden Inclosure and the Hythe by-pass, New Forest",
      "caption": "Power lines between the inclosure and the Hythe by-pass. Looking NW along the clearing between the Dibden Inclosure (left) and the Hythe by-pass (right). The power lines, which connect Fawley Power Station to the national grid, were there before either the inclosure or the by-pass, so perhaps this gap must have been deliberately left for safety reasons? There are some groups that consider these power lines an intrusion on the beauty of the Forest, representative of the use of the Forest as a soft option for the location of \"unsightly infrastructure\". Still, if you want electricity... are underground cables viable?"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Footbridge_and_path_north_of_the_Dibden_Inclosure%2C_New_Forest_-_geograph.org.uk_-_203809.jpg/256px-Footbridge_and_path_north_of_the_Dibden_Inclosure%2C_New_Forest_-_geograph.org.uk_-_203809.jpg",
      "title": "Jim Champion / Footbridge and path north of the Dibden Inclosure, New Forest",
      "caption": "Footbridge and path north of the Dibden Inclosure. The conifers on the left probably mark the northern end of the Inclosure, although the plantation is no longer fenced in. The trees were planted on the eastern edge of the Forest heathland to screen the industrial/residential developments of \"The Waterside\". The paths on this side of the heath are well-used by local residents (usually dog walkers) from Dibden Purlieu and Marchwood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Dibden_Bottom%2C_New_Forest_-_geograph.org.uk_-_203822.jpg",
      "title": "Jim Champion / Dibden Bottom, New Forest",
      "caption": "Looking southeast across Dibden Bottom from the edge of a stream. In the foreground is a small stream-side oak tree and bog myrtle. In the distance is Horestone Hill and the conifers of the Dibden Inclosure. The Bottom is a boggy heathland area, although it dries up a little in the summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Footbridge_and_pylons_near_Buttsash%2C_New_Forest_-_geograph.org.uk_-_217491.jpg",
      "title": "Jim Champion / Footbridge and pylons near Buttsash, New Forest",
      "caption": "Footbridge and pylons near Buttsash. This strip of heathland is on the eastern edge of the Crown lands of the New Forest, between the Fawley Inclosure and the Hythe by-pass (A326). It is an area well-used by joggers and dog-walkers from Dibden and Buttsash - a jogger is having a rest at the top of the incline in the centre of the photo. The stream in the foreground drains a pond on a piece of annexed heathland on the northern side of the by-pass."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Horse_and_rider_on_Yew_Tree_Heath%2C_New_Forest_-_geograph.org.uk_-_184346.jpg",
      "title": "Jim Champion / Horse and rider on Yew Tree Heath, New Forest",
      "caption": "Horse and rider on Yew Tree Heath. This view is a short distance east of the Decoy Pond Farm riding and livery stables. This path across the lower slopes of the heath has worn through to the sandy soil below. In the distance are the trees alongside the Beaulieu River, beyond that the conifers of the Dibden Inclosure and in the far distance the stacks of Fawley Refinery and Calshot Power Station."
    }
  ],
  "distance_km": 2.5,
  "description": "This area of the New Forest is a popular spot for walkers. You can start your walk from the car park just off the Beaulieu Road near the village of Dibden Purlieu. From here you can pick up some really nice trails around the enclosure. The area has some pretty streams and ponds with great views across the forest from the high points. Also look out for lovely heather in the late summer and new forest ponies which like to roam around Dibden Bottom. The area is a popular spot with dog walkers with free parking and an off lead area. If you'd like to reach the area by bike then National Cycle Network Route 2 passes through Dibden Purlieu from Hythe. It's easy to extend your walking across Beaulieu Heath by picking up the Solent Way long distance trail. It runs right past the Dibden car park and will take you towards Hythe in one direction and Beaulieu in the other. Here you can enjoy a lovely waterside walk along the Beaulieu River .",
  "video_url": "https://www.youtube.com/embed/dQrCWd20rB0",
  "postcode": "SO45 4PR",
  "district": "Dibden Purlieu",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}