{
  "created_at": "2025-01-06T02:14:13.369028+00:00",
  "objectID": "cb45b765c0e0b6ad61a26671e13e3f9f",
  "ref": "bassenthwaite-lake-walking-route",
  "title": "Bassenthwaite Lake Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Bassenthwaite_Lake_-_geograph.org.uk_-_327927.jpg",
  "nearby": [
    {
      "description": "Dodd Wood",
      "objectID": "564c61ba625613481bfbfdf4b6748e0a",
      "ref": "dodd-wood-walking-route"
    },
    {
      "description": "Whinlatter Forest Park",
      "objectID": "7e45a5d5839ef13bbb31e14df327ce99",
      "ref": "whinlatter-forest-park-walking-and-cycle-route"
    },
    {
      "description": "Allerdale Ramble",
      "objectID": "641f71c34743ce206179b03c5da3b722",
      "ref": "allerdale-ramble-walking-route"
    },
    {
      "description": "Skiddaw",
      "objectID": "015e5ff7eb509951ba5af68c1b3baec6",
      "ref": "skiddaw-walking-route"
    },
    {
      "description": "Binsey Fell",
      "objectID": "e0245d791a64432c2acd25f32c84d6fc",
      "ref": "binsey-fell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cb45b765c0e0b6ad61a26671e13e3f9f.gpx",
  "_geoloc": {
    "lat": 54.6013216359,
    "lng": -3.1349982999
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Bassenthwaite_Lake_-_geograph.org.uk_-_327927.jpg",
      "title": "Bob Jenkins / Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "Looking across the lake to Skiddaw on a lovely day"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Scarness_Bay%2C_Bassenthwaite_Lake_-_geograph.org.uk_-_943075.jpg",
      "title": "Philip Halling / Scarness Bay, Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "View across Scarness Bay and Bassenthwaite Lake to Barf."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Near_Broadness_Farm%2C_Bassenthwaite_Lake_-_geograph.org.uk_-_607827.jpg",
      "title": "Oliver Dixon / Near Broadness Farm, Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "Near Broadness Farm. An impromptu picnic site with fireplace on the shores of Bassenthwaite Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Boulders_on_the_shore_of_Bassenthwaite_Lake_-_geograph.org.uk_-_1247652.jpg",
      "title": "Philip Halling / Boulders on the shore of Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "Boulders on the shore of the lake to the south of Scarness Bay. Lakelands north-western fells can be seen on the far shore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Above_Bassenthwaite_Lake_-_geograph.org.uk_-_1070327.jpg",
      "title": "Michael Graham / Above Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "Above the Lake. Looking over the Lake towards Barf near Derwent Foot"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Bowness_Bay%2C_Bassenthwaite_Lake_-_geograph.org.uk_-_1247685.jpg",
      "title": "Philip Halling / Bowness Bay, Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "Ullock Pike and Dodd viewed across the lake's Bowness Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Southern_end_Bassenthwaite_Lake._-_geograph.org.uk_-_555747.jpg",
      "title": "Harold Potts / Southern end Bassenthwaite Lake., via Wikimedia Commons",
      "caption": "Southern end Bassenthwaite Lake. It's been said that Derwentwater and Bass Lake were joined at one time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Lakeshore_with_driftwood_-_Bassenthwaite_Lake_-_geograph.org.uk_-_368224.jpg",
      "title": "Jerry Evans / Lakeshore with driftwood - Bassenthwaite Lake, via Wikimedia Commons",
      "caption": "Lakeshore with driftwood"
    }
  ],
  "distance_km": 24.0,
  "description": "This walk takes you to the lovely Bassenthwaite Lake from Keswick in the Lake District. It makes use of the Allerdale Ramble so the path is generally well defined and way-marked. You start off in the popular town of Keswick and soon pick up the River Derwent where you can enjoy a long riverside section to Thornthwaite Forest. You then follow peaceful woodland trails through Dodd Wood before another waterside section along Bassenthwaite Lake. You return through the forest and then on to Applethwaite and Milbeck before returning to Keswick. There are fabulous views of Skiddaw to enjoy all along the walk. In Dodd Wood you can visit Dodd Fell summit and look out for the Bassenthwaite Ospreys from the viewpoints. The lake is located on the edge of the expansive Whinlatter Forest Park where you can extend your exercise on one of the many cycling and walking trails.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Old Sawmill Tearoom for some post walk refreshments. The delightful tearoom was originally a working sawmill until 1970 and it was converted to its present use in 1981. The walls are hung with saws and the original saw blade is still here. You can read about the local history of Dodd Wood and the Mirehouse estate while you enjoy morning coffee, light lunch or afternoon tea. The wood burning stove is stoked up in the colder months, and in summer picnic tables overlook Bassenthwaite Lake. The tea room is wonderfully positioned at the foot of Dodd Fell just to the east of Mirehouse. You can find it at a postcode of CA12 4QE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake and the surrounding woods make for an excellent dog walk. The Old Sawmill tea rooms mentioned above are also dog friendly and will provide water bowls."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Next to the lake you will find the noteworthy St Bega’s Church. The church dates from pre-Norman times and includes a 14th century lead crucifix and a font dating from 1300. The tranquil church is well worth a visit if you have time. A booklet describing the history of the church can be obtained from the Dodd Wood Old Sawmill Tearoom.   Pictured above, the church and chuchyard of the historic St Begas Church. The church is located in the grounds of the lovely Mirehouse and Gardens. Mirehouse was owned by the Spedding family, who regularly entertained the likes of Thomas Carlyle, Edward Fitzgerald and Lord Tennyson. It was named 2017 visitor attraction of the year at the Cumbria Tourism Awards. On the site you can explore the historic house, stroll the picturesque gardens and visit the lakeshore and woodland playgrounds. There's a number of walks with a Family Nature Trail, a woodland trail with Scots Pine and a Poetry Walk. This uses a section of the terraced garden known as “Canada” and is an ongoing commemoration of the unique literary connections that Mirehouse has had over the years. Just above the house is a viewpoint where you can look out for Osprey soaring above the lake.  Pictured above left, Mirehouse. On the right the stunning view to the SW from the Osprey viewpoint which sits above the Mirehouse car park. You can see red squirrels here, as well as many different species of birds. There are mounted telescopes provided which are very powerful. Just over 2 miles north east of the lake you'll find the noteworthy Binsey Fell. The small fell is a worthy climb and the most northern of the Wainwright's. On the western side of the lake there's the circular walk to Sale Fell to try. The gentle climb is less well known but still a worthy Wainwright to climb. The area near the fell includes the 17th century Pheasant Inn, one of the oldest inns in the Lake District."
    }
  ],
  "video_url": "https://www.youtube.com/embed/DCoUQCYyBoQ",
  "district": "Keswick",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brundleholm Cottage, Victoria Street, Keswick, Cumberland, England, CA12 5LP, United Kingdom",
  "postcode": "CA12 5LP",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "waterfront",
    "forest"
  ],
  "points_of_interest": [
    "viewpoints",
    "summit"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}