{
  "created_at": "2025-01-06T02:13:49.323056+00:00",
  "objectID": "cb6a7287ea281d933efef82ab4608634",
  "ref": "dollis-valley-green-walk-walking-route",
  "title": "Dollis Valley Green Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Dollis_Valley_Green_Walk_-_geograph.org.uk_-_870970.jpg",
  "nearby": [
    {
      "description": "Hampstead Heath",
      "objectID": "7454be7653cb8e4ef0870c2419e7356a",
      "ref": "hampstead-heath-walking-and-cycle-route"
    },
    {
      "description": "Scratchwood and Moat Mount Open Space",
      "objectID": "c33bad5e196d28ec0d7a45db42513dc2",
      "ref": "scratchwood-and-moat-mount-open-space-walking-route"
    },
    {
      "description": "Claremont Park",
      "objectID": "1a51b20953e04fefd015d305afb423d8",
      "ref": "claremont-park-walking-route"
    },
    {
      "description": "Aldenham Country Park",
      "objectID": "5005f5a89830a9c2f9851c8c480f75cf",
      "ref": "aldenham-country-park-walking-and-cycle-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Totteridge",
      "objectID": "f93907899b910124b0a161321069298e",
      "ref": "totteridge-walking-route"
    },
    {
      "description": "Pymmes Brook Trail",
      "objectID": "8aaaa3816e9e2b329c3b5a53049d1e2a",
      "ref": "pymmes-brook-trail-walking-route"
    },
    {
      "description": "Enfield",
      "objectID": "13baca9cfcce8f494dc698c77578e4f4",
      "ref": "enfield-walking-route"
    },
    {
      "description": "Hadley Wood",
      "objectID": "10fd34911347bedaa673de35bd8d5ffa",
      "ref": "hadley-wood-walking-route"
    },
    {
      "description": "Mill Hill",
      "objectID": "4dfe07ef862b5309ebb1f1f9785aeb4b",
      "ref": "mill-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cb6a7287ea281d933efef82ab4608634.gpx",
  "_geoloc": {
    "lat": 51.6323597031,
    "lng": -0.2531207015
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Dollis_Valley_Green_Walk_-_geograph.org.uk_-_870970.jpg",
      "title": "Martin Addison / Dollis Valley Green Walk",
      "caption": "A well wooded section of the walk though the path is well maintained. Photo taken near Mill Hill in mid summer. The walk follows a scenic route along the brook, extending across the London Borough of Barnet. Originally developed in the 1930s as the Brookside Walk, it was an initiative led by Finchley Councillor Alfred Pike. The trail originally traced the path of Mutton Brook westward before merging with the Dollis Brook, continuing north to Wyatts Farm Open Space near the Finchley boundary. In collaboration with the Countryside Commission (now Natural England) and the Countryside Management Service, the London Borough of Barnet later expanded and transformed the walk into the Dollis Valley Greenwalk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Dollis_Valley_Green_Walk_-_geograph.org.uk_-_871362.jpg/256px-Dollis_Valley_Green_Walk_-_geograph.org.uk_-_871362.jpg",
      "title": "Martin Addison / Dollis Valley Green Walk",
      "caption": "This bridge carries the walk across Dollis Brook to join Dollis Road. The black and white bollards mark the closed off end of Thornfield Avenue. The brook is a tributary of the River Brent, which is itself a tributary of the River Thames. On the walk look out for wildlife including kingfishers, grey wagtails, and moorhens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Dollis_Valley_Green_Walk_-_geograph.org.uk_-_870839.jpg",
      "title": "Martin Addison / Dollis Valley Green Walk",
      "caption": "The bollards in the distance are located at Waverley Grove. Dollis Brook is out of sight on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Dollis_Valley_Green_Walk_-_geograph.org.uk_-_449025.jpg",
      "title": "Martin Addison / Dollis Valley Green Walk",
      "caption": "A footpath along the brook through a section of parkland between Argyle Road and Southover Way. In 2009, the Greenwalk received a £400,000 grant from the Mayor of London's Help a London Park Scheme after a successful public vote. This funding was used for a wide range of improvements, such as enhancing footpaths and cycle routes, adding lighting and signage, and upgrading accessibility. It also supported habitat creation, including wetlands and reedbeds, as well as the preservation of hay meadows. The overall aim was to make the walk more enjoyable and educational by adding information boards and points of interest throughout the route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Dollis_Valley_Green_Walk_-_geograph.org.uk_-_871025.jpg",
      "title": "Martin Addison / Dollis Valley Green Walk",
      "caption": "Seen here passing behind the back garden fences of Claremont Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Viaduct_over_Dollis_Road_-_geograph.org.uk_-_6092627.jpg/512px-Viaduct_over_Dollis_Road_-_geograph.org.uk_-_6092627.jpg?20240108184555",
      "title": "Viaduct over Dollis Road by Peter S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dollis Brook Viaduct. The structure carries the London Underground's Northern line from Mill Hill East station to Finchley Central station. It is notable as the highest point on the London Underground above ground level, reaching a height of nearly 60 feet (18 m)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Cycling_Along_the_Dollis_Valley_-_geograph.org.uk_-_1071117.jpg",
      "title": "Martin Addison / Cycling Along the Dollis Valley",
      "caption": "Cycling Along the Dollis Valley. A cycle path runs alongside Dollis Brook and the Dollis Valley Green Walk through Brook Farm Open Space."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Footbridge_over_Dollis_Brook_-_geograph.org.uk_-_385694.jpg",
      "title": "Martin Addison / Footbridge over Dollis Brook",
      "caption": "Footbridge over Dollis Brook. The footbridge gives access to a footpath that crosses Brent Lodge Farm (in the distance) to join Mays Lane. The green walk continues on this (the south side) of the brook."
    }
  ],
  "distance_km": 17.0,
  "description": "This pleasant walk takes you from Mill Hill near Edgware in North London to the edge of Hampstead Heath along the Dollis Brook. You will pass through Scratchwood and Moat Mount Open Space and Barnet's Totteridge Fields Nature Reserve on this flat easy walk through North London. The route is good for flora and fauna too. Look out for herons, nesting swans, ducks and ducklings along the brook. There's also attractive woodland, wild garlic and wild flowers dotted along the pathway.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the end of the route there's the Parliament Hill Cafe on Hampstead Heath. It's in a nice location, next to the bandstand in the park. There's a good range of snack and an outdoor seating area to relax in warmer days. You can find it at postcode NW5 1QR for your sat navs. There's an abundance of fine cafes and pubs around the heath as well. One noteworthy place worth consideration is The Spaniards Inn. The pub dates from 1585 and has some interesting literary connections. John Keats apparently penned Ode to a Nightingale in the garden and the pub is also mentioned in Charles Dickens’ Pickwick Papers. There's an attractive interior with oak-panelled walls, chandeliers, beams and log fires. Outside there's a nice garden with a BBQ on warmer days. You can find the inn on Spaniards Road at the north western end of the heath. Postcode for your sat nav is NW3 7JJ. Also worthy of consideration is the The Orange Tree in Totteridge. It's in a lovely spot right next to the village pond where you can watch the birds on the water. There's an elegant interior and outdoor seating if the weather is good. You can find them at a postcode of N20 8NX for your sat navs. The village is also well worth exploring. It has a lovely rural feel with a pretty village green, a cricket pitch and some pleasant local countryside. There's also the Darland's Lake Nature Reserve where there are some lovely waterside trails and lots of wildlife to see."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The path makes for a nice walk with your dog with pockets of woodland along the way too. You'll probably pass several other dog walkers on the trail. The Spaniards Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route links with the London Loop at Scratchwood at the start. You could pick up this waymarked trail and follow it west to visit the lovely Aldenham Country Park. There's nice trails here around the lake and woodland in the park. Another brookside walk starts just to the east of the route in New Barnet. The Pymmes Brook Trail runs from Monken Hadley Common in Hadley Wood to Picket's Lock near Enfield. It's a similar route along one of the tributaries of the River Lea. For more walking ideas in the area see the London Walks and Hertfordshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KJn6Yp9235M",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dollis Valley Greenwalk, towards Barnet Way, London Borough of Barnet, London, Greater London, England, NW7 3AL, United Kingdom",
  "postcode": "NW7 3AL",
  "district": "London",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "nature reserve",
    "wildlife viewing"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}