{
  "created_at": "2025-01-06T01:01:51.691858+00:00",
  "objectID": "cb78aad3a88eb15226ddfd0fc37e895a",
  "ref": "branston-water-park-walking-route",
  "title": "Branston Water Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Lake_at_Branston_Water_Park_-_geograph.org.uk_-_1559440.jpg",
  "nearby": [
    {
      "description": "Burton on Trent to Barton under Needwood Canal Walk",
      "objectID": "0d3a1c7c29203b4f06d195cf39fc1564",
      "ref": "burton-on-trent-to-barton-under-needwood-canal-walk-walking-route"
    },
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Millennium Way",
      "objectID": "232a67d21e7ffb556ba3b97c7a8cc96f",
      "ref": "millenium-way-walking-route"
    },
    {
      "description": "Mercia Marina",
      "objectID": "d4504fd5d0d87039f350d4bf0b703f07",
      "ref": "mercia-marina-walking-route"
    },
    {
      "description": "National Forest Way",
      "objectID": "33273a16668d5733c3b1e311dffdbaed",
      "ref": "national-forest-way-walking-route"
    },
    {
      "description": "Badger Wood",
      "objectID": "8b4912e07ab8943ad3cbcc0b5327997f",
      "ref": "badger-wood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cb78aad3a88eb15226ddfd0fc37e895a.gpx",
  "_geoloc": {
    "lat": 52.7879738082,
    "lng": -1.6803411515
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Lake_at_Branston_Water_Park_-_geograph.org.uk_-_1559440.jpg",
      "title": "Trevor Rickard / Lake at Branston Water Park",
      "caption": "Lake at Branston Water Park. Looking down the whole length of the lake from the small spit at the eastern end. Branston Water Park is situated between the Trent and Mersey Canal and the A38 road just SW of Burton. The area was first quarried for aggregates during the 1930's. The quarry was then functional up until the 1950's when it started to become too costly to continue pumping out the water, since then the quarry has gradually filled up with a natural supply of water as the water table has gradually risen up to today's present level."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Waterfowl_on_Branston_Water_Park_-_geograph.org.uk_-_64205.jpg",
      "title": "Sue Adair / Waterfowl on Branston Water Park",
      "caption": "Geese pose for the camera by the lake in late summer. In 1989 the council started to make the site into an area suitable for the public to use for recreation. The Water Park has a number of different public users apart from tourists and bird watchers (the park has a naturally growing set of reed beds which are quite rare to Staffordshire). The clubs at present that use the water are the model boat club, fishermen and wind surfers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Picnic_tables_at_Branston_Water_Park_-_geograph.org.uk_-_1559436.jpg",
      "title": "Trevor Rickard / Picnic tables at Branston Water Park",
      "caption": "Picnic tables. At the end of a small spit of land looking south-west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Information_Board%2C_Branston_Water_Park._-_geograph.org.uk_-_2433990.jpg",
      "title": "Information Board, Branston Water Park. by Mick Malpass, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Information Board at the site. Details the flora and fauna you can see including the Great Spotted Woodpecker and Treecreeper."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Trent_and_Mersey_Canal_at_Branston%2C_Staffordshire_-_geograph.org.uk_-_1556397.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal at Branston, Staffordshire",
      "caption": "Trent and Mersey Canal at Branston, Staffordshire. Taken from Branston Bridge, No 34. Ahead, and to both sides of the canal is Branston Water Park, a group of large flooded former gravel pits."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Tatenhill_Lock_and_Bridge_near_Branston%2C_Staffordshire_-_geograph.org.uk_-_1552927.jpg",
      "title": "Roger Kidd / Tatenhill Lock and Bridge near Branston, Staffordshire",
      "caption": "Tatenhill Lock and Bridge near Branston, Staffordshire. This is the Trent and Mersey Canal at Bridge No 35, which carries a bridleway. The bottom mitre gates of Tatenhill Lock can be seen. This is not a deep lock, dropping the water level by just over one metre (3ft 7in). The Way for the Millennium, Staffordshire's extensive long distance public footpath, follows the towpath here."
    }
  ],
  "distance_km": 4.0,
  "description": "Enjoy woodland, wetland and meadow in this lovely park in Burton Upon Trent. The park is located a couple of miles from Burton-Upon-Trent town centre. You can follow the Trent and Mersey Canal all the way to the park from the town. The park is a great place for wildlife with lots of birds to look out for on the lakes. To extend your walk follow the canal south to the village of Barton under Needwood where there's a pretty marina.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Hub Cafe is located at the northern end of the site next to the car park. They serve a good range of refreshments which you can enjoy outside with a view of the lakes."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great location for dog walking so you'll probably meet other owners with their pets."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the eastern side of Burton you could pay a visit to the pretty Mercia Marina. The significant site is notable as Europe's largest inland marina and a great place for strolls and wildlife watching. The Yoxall and Needwood Forest Walk passes through the park. It explores the ancient Needwood Forest area of the National Forest, using the National Forest Way long distance trail. On the way it visits Alrewas and Fradley Junction, Barton Under Needwood and the Football Association's St George's Park National Football Centre. Just to the south there's the Rosliston Forestry Centre to explore. The centre provides a wealth of information on the area and also has on site bike hire. The surrounding parkland is well worth exploring too with woodland trails, meadows, ponds, lots of butterflies and some interesting sculptures to see. The Woodland Trust's Badger Wood can also be accessed in this area. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ySpDetsGVrg",
  "postcode": "DE14 3RF",
  "district": "East Staffordshire",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "5, Kingfisher Gardens, Branston, East Staffordshire, Staffordshire, England, DE14 3RF, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "wetland",
    "meadow"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "lakes"
  ],
  "facilities": [
    "canal access",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}