{
  "objectID": "cb9d2caf633adf2bfe8a4d5041043d5c",
  "created_at": "2024-12-19T23:28:21.404184+00:00",
  "ref": "beverley-brook-walk-walking-route",
  "title": "Beverley Brook Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/58/Beverley_Brook_-_geograph.org.uk_-_1453939.jpg",
  "nearby": [
    {
      "description": "Richmond Park",
      "objectID": "47915094402f026d119940fe0df24241",
      "ref": "richmond-park-walking-and-cycle-route"
    },
    {
      "description": "Ham House Richmond",
      "objectID": "267b3c34ca0951989aa9511c3185eec1",
      "ref": "ham-house-richmond-walking-route"
    },
    {
      "description": "Wimbledon Common",
      "objectID": "c9e8708094a0c9c7bc62a5df5a345470",
      "ref": "wimbledon-common-walking-and-cycle-route"
    },
    {
      "description": "Hogsmill River",
      "objectID": "bb7c414bd5cb87023eb36b42d968239e",
      "ref": "hogsmill-river-walking-route"
    },
    {
      "description": "Beverley Westwood",
      "objectID": "2646fd18ad9f2bf31fc75558c248a9a7",
      "ref": "beverley-westwood-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/77792F533179CA7480257A2B006F002D/$FILE/Beverley Brook.gpx",
  "_geoloc": {
    "lat": 51.4717125146,
    "lng": -0.223194047
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Beverley_Brook_-_geograph.org.uk_-_1453939.jpg",
      "title": "Derek Harper / Beverley Brook",
      "caption": "The brook, running towards the camera, emerges from woodland at Killcat Corner past pollarded willows. Hidden on the other bank is the Richmond Park Golf Course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Richmond_Park%2C_Beverley_Brook_-_geograph.org.uk_-_676358.jpg",
      "title": "Nigel Cox / Richmond Park: Beverley Brook",
      "caption": "Richmond Park. The Brook, which flows out into the River Thames near Barnes, forms the eastern boundary of the park here. The protective fencing around the trees is still in place even though the trees are well-established."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Beverley_Brook_in_Motspur_Park_-_geograph.org.uk_-_689497.jpg",
      "title": "Nigel Cox / Beverley Brook in Motspur Park",
      "caption": "Motspur Park. This was taken looking downstream from the Motspur Park / West Barnes Lane road bridge. The boundary between the London Boroughs of Merton, to the right, and Kingston upon Thames, to the left, runs down the centre of the brook at this location."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Beverley_Brook_at_Beverley_Bridge_-_geograph.org.uk_-_676081.jpg",
      "title": "Nigel Cox / Beverley Brook at Beverley Bridge",
      "caption": "Beverley Bridge. The bridge carries the A3 road over Beverley Brook here between Kingston Vale to the left and Putney Vale to the right. There has been a bridge here since historic times, but the current structure dates from the early eighteenth century when the road to Portsmouth from London became strategically important. It has been much altered and widened through the years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Beverley_Brook_-_geograph.org.uk_-_879625.jpg",
      "title": "Shaun Ferguson / Beverley Brook",
      "caption": "Near Roehampton Gate in Richmond Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/West_Barnes%2C_West_Barnes_Lane_and_Motspur_Park_-_geograph.org.uk_-_689530.jpg",
      "title": "Nigel Cox / West Barnes: West Barnes Lane and Motspur Park",
      "caption": "West Barnes Lane and Motspur Park. The bridge here carries the road over Beverley Brook. The white post against the bridge parapet is a boundary marker. It shows the boundary between the former Boroughs of Malden and Coombe to the left and Merton and Morden to the right. During the reorganization of local government in the 1960s, the former became part of the London Borough of Kingston upon Thames, and the latter became part of the London Borough of Merton. The current boundary between these Boroughs still follows the original line through the marker. The sign on the post on the left shows that you are entering the Royal Borough of Kingston upon Thames. The road changes its name from Motspur Park to West Barnes Lane either side of the boundary post."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Beverley_Brook_in_East_Sheen_-_geograph.org.uk_-_690992.jpg",
      "title": "Nigel Cox / Beverley Brook in East Sheen",
      "caption": "East Sheen. Looking downstream from the footbridge near Palewell Park, the brook is about three kilometres from its confluence with the River Thames here. As is usual with these London urban watercourses a local government boundary runs down the brook, or in this case on the right bank. The brook, and the land to the left, are in the London Borough of Richmond upon Thames, while the trees on the right and the land beyond are in the London Borough of Wandsworth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Beverley_Brook_on_Wimbledon_Common_-_geograph.org.uk_-_675709.jpg",
      "title": "Nigel Cox / Beverley Brook on Wimbledon Common",
      "caption": "Wimbledon Common. The brook forms the western boundary of the common, and is viewed here looking upstream."
    }
  ],
  "distance_km": 11.0,
  "description": "This walk follows the Beverley Brook from the River Thames at Putney to New Malden. The trail passes through Barnes Common, Richmond Park and Wimbledon Common, exposing you to some of South London's most attractive countryside. Walk highlights include the Beverley Meads and Fishpond Local Nature Reserve where Kingfishers and Mandarin Ducks may be seen. At Barnes you will pass near to the splendid Wildfowl and Wetlands Centre, where you can see a wide variety of wildlife including lapwings, little ringed plovers, great crested and little grebes, gadwall, mallards, pochards and tufted duck broods. There is also a section through the delightful Richmond Park where you can look out for the resident deer. The walk is easily accessible from the train station at New Malden or from the nearby East Putney Tube or Putney train station.",
  "video_url": "https://www.youtube.com/embed/cU_r7vyMkl8",
  "postcode": "SW15 1NB",
  "district": "Putney",
  "county": "Greater London",
  "region": "London",
  "country": "England"
}