{
  "created_at": "2025-01-06T00:11:28.848338+00:00",
  "objectID": "cbabb49fe5282d4dc06059d9ae73114b",
  "ref": "herefordshire-beacon-and-british-camp-walking-route",
  "title": "Herefordshire Beacon and British Camp Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/17/View_north_from_the_top_of_the_Herefordshire_Beacon_-_geograph.org.uk_-_479492.jpg",
  "nearby": [
    {
      "description": "Eastnor Deer Park",
      "objectID": "5820561b9671672a60c044f33397cd33",
      "ref": "eastnor-deer-park-walking-route"
    },
    {
      "description": "Worcestershire Way",
      "objectID": "bc88cb9ede89bd9038772fa0235ccd90",
      "ref": "worcestershire-way-walking-route"
    },
    {
      "description": "Geopark Way",
      "objectID": "00d9080523d54805b4f26f1c618625a7",
      "ref": "geopark-way-walking-route"
    },
    {
      "description": "Malvern Hills",
      "objectID": "e0218b46cc5b1e3547ff06616f1c7623",
      "ref": "malvern-hills-walking-route"
    },
    {
      "description": "Hanley Swan",
      "objectID": "679d14b04178b50890d151de68955347",
      "ref": "hanley-swan-walking-route"
    },
    {
      "description": "Castlemorton Common",
      "objectID": "37cdc30274a0702e9c121ed7789181d3",
      "ref": "castlemorton-common-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cbabb49fe5282d4dc06059d9ae73114b.gpx",
  "_geoloc": {
    "lat": 52.0610035592,
    "lng": -2.3471720636
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/View_north_from_the_top_of_the_Herefordshire_Beacon_-_geograph.org.uk_-_479492.jpg",
      "title": "Trevor Rickard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View north from the top of the Herefordshire Beacon. The Malvern Hills Conservators have built a series of steps on the main paths to this popular summit in an effort to prevent too much erosion by walkers. This construction uses the pinkish Malvern granite and is typical of repairs made all over the hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Path_below_British_Camp_-_geograph.org.uk_-_650692.jpg",
      "title": "Bob Embleton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Path below British Camp. The path roughly follows the contour line along the eastern slope of the hills providing easy access to the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Layers_of_defences_on_the_Hereford_Beacon_-_geograph.org.uk_-_450346.jpg",
      "title": "Trevor Rickard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Layers of defences on the Hereford Beacon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Path_to_the_Herefordshire_Beacon_-_geograph.org.uk_-_479500.jpg",
      "title": "Trevor Rickard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Path to the Herefordshire Beacon, with view down to British Camp Reservoir. Fairly new path repair on the southern flank of the Beacon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Eastern_Path_around_British_Camp_-_geograph.org.uk_-_650370.jpg",
      "title": "Bob Embleton / Eastern Path around British Camp",
      "caption": "Eastern Path around British Camp. The path is fairly level, taking visitors from the car park towards Clutter's Cave without having to climb over Herefordshire Beacon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Bracken_in_January%2C_Herefordshire_Beacon_-_geograph.org.uk_-_1135015.jpg",
      "title": "Bob Embleton / Bracken in January, Herefordshire Beacon",
      "caption": "Bracken in January on the Beacon. Last year's bracken has collapsed and turned to rust on the hillside. In the distance further peaks of the Malvern Hills march majestically northwards."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Clutter%27s_Cave%2C_Malvern_Hills_-_geograph.org.uk_-_649850.jpg",
      "title": "Pauline Eccles, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clutter's Cave. Hand hewn from granite and probably a medieval hermit's dwelling. Also known as Giant's Cave or Waum's Cave. A spring once lay beneath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Broad_Down_from_Herefordshire_Beacon_-_geograph.org.uk_-_519538.jpg",
      "title": "Bob Embleton / Broad Down from Herefordshire Beacon",
      "caption": "Broad Down. The early morning sunshine emphasises the tree coverage on the hillside. This was completely bare a few decades ago allowing the small quarries to be seen."
    }
  ],
  "distance_km": 2.5,
  "description": "This walk climbs to Herefordshire Beacon in the Malvern Hills Area of Outstanding Natural Beauty. As well as some splendid views the site includes the significant British Camp Iron Age Hillfort, first constructed in the 2nd century BC. The boundary between Herefordshire and Worcestershire also runs just past the hill to the east. The hill includes a few different footpaths which you can use to make a circular walk. You can start from the car park just to the north of the hill, off the A449. There's handy information boards here giving a detailed history of the camp. From the car park you can directly pick up a path to take you up to the top of the beacon. At the 338 m (1,109 ft) summit there are splendid views into the counties of Herefordshire, Worcestershire and Gloucestershire. Just to the west of the hill you can also see the lovely Eastnor Deer Park and mock 19th century castle. Follow the paths south through the earthworks and defensive ditches of British Camp to Millenium Hill, before descending on other paths to the car park. You could also pick up other trails to take you to the pretty British Camp Reservoir, just to the south east of the car park. You can pick up the Geopark Way long distance trail to further explore the Malvern Hills. Following the paths north will take you to the popular Worcestershire Beacon and the town of Great Malvern. If you head south you will soon come to Midsummer Hill where there is another Iron Age Hillfort and Scheduled Ancient Monument.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just below the hill on the eastern side you'll find Castlemorton Common. The expansive common is another popular local place for a walk with miles of trails, woodland, wildlife and great views back to the Malverns. Also to the east there's the delightful village of Hanley Swan. The picturesque settlement includes a pretty village green, a pond, a 17th century pub and walking trails to neighbouring Hanley Castle where you can see the remains of the ancient fort. The river trails and historic 16th century pub at Upton Upon Severn are also located in this area. For an alternative circular walk starting from the Colwall train station see the Colwall Walk. Here you can also visit the Colwall Park Hotel where you can enjoy a delicious afternoon tea in the beautiful hotel grounds."
    }
  ],
  "video_url": "https://www.youtube.com/embed/MVlwvLP30V4",
  "county": "County of Herefordshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}