{
  "created_at": "2025-01-06T00:01:20.083356+00:00",
  "objectID": "cbad80ab53aac46b5deba740f6b99dd0",
  "ref": "west-runton-walking-route",
  "title": "West Runton and Beeston Bump Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/83/West_Runton_Beach_-_geograph.org.uk_-_794895.jpg",
  "nearby": [
    {
      "description": "West Runton to Cromer Walk",
      "objectID": "3389081d416af4da46cb46bd0f6d3bca",
      "ref": "west-runton-to-cromer-walk-walking-route"
    },
    {
      "description": "Cromer to Mundesley Walk",
      "objectID": "af8455745f601d7222be0667bbd051b1",
      "ref": "cromer-to-mundesley-walk-walking-route"
    },
    {
      "description": "Cromer to Overstrand",
      "objectID": "4d06f4d5e111433208f88f17e19e25ae",
      "ref": "cromer-to-overstrand-walking-route"
    },
    {
      "description": "Kelling Heath",
      "objectID": "dcc5b570459b882a884a2ff9800dbc2c",
      "ref": "kelling-heath-walking-route"
    },
    {
      "description": "Cromer to Sheringham",
      "objectID": "00aa38d47847e18fcb357b1b3ebd6c6c",
      "ref": "cromer-to-sheringham-walking-route"
    },
    {
      "description": "Felbrigg Hall Park",
      "objectID": "7238b9d7e14818477cdb1d08cd52cb12",
      "ref": "felbrigg-hall-park-walking-route"
    },
    {
      "description": "Overstrand",
      "objectID": "7b9c8b9f69924c9e4a3ed329d55c112e",
      "ref": "overstrand-walking-route"
    },
    {
      "description": "West Runton To Sheringham Coastal Walk",
      "objectID": "8169a88523774ec03a8641d11ac95c7e",
      "ref": "west-runton-to-sheringham-coastal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cbad80ab53aac46b5deba740f6b99dd0.gpx",
  "_geoloc": {
    "lat": 52.9415135626,
    "lng": 1.2509954088
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/West_Runton_Beach_-_geograph.org.uk_-_794895.jpg",
      "title": "Evelyn Simak / West Runton Beach",
      "caption": "West Runton Beach. A vast expanse of beach and foreshore viewed in late afternoon sunshine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Beeston_Regis_and_the_Beeston_Bump_-_geograph.org.uk_-_1085575.jpg",
      "title": "Evelyn Simak / Beeston Regis and the Beeston Bump",
      "caption": "Beeston Regis and the Beeston Bump. Horses can be seen grazing the pastures in the foreground. This view was taken from the path which leads from Sandy Lane via the Roman Camp to the coastal village of Beeston Regis. Beeston Regis is located in an \"Area of Outstanding Natural Beauty\" which was formed by the retreating ice at the end of the ice age and sits within an area known as the \"Cromer Ridge\", consisting of wooded heath land to the south (owned by the National Trust) and cliffs and beaches facing the North Sea. Part of these cliffs is a hill called \"Beeston Bump\". Surrounded by the oaks and heather growing on Beeston Heath there is an enclosure named Roman Camp. It is adjoined by deep circular dips, called Hills and Holes, which are believed to date from prehistoric times. During Saxon-Norman and Roman times iron ore was dug here. Evidence of Roman habitation was found in 1859 when a complete set of quern stones (used for grinding grain) were discovered. The heath and woods are a favourite site for bird watchers and many paths and bridleways, including the Norfolk Coastal Path, are leading through it. There are also several caravan and camping parks nearby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/View_north_from_Beacon_Hill_-_geograph.org.uk_-_1085371.jpg",
      "title": "Evelyn Simak / View north from Beacon Hill",
      "caption": "View north from Beacon Hill. A beacon once used to stand on this hill which is the highest point in Norfolk (100 metres) and offers magnificent views down the steep wooded hills, towards the coastal villages of East Runton and Beeston Regis."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/As_high_as_you_can_get_in_Norfolk_-_geograph.org.uk_-_1085391.jpg",
      "title": "Evelyn Simak / As high as you can get in Norfolk",
      "caption": "As high as you can get in Norfolk. A beacon once used to stand on this hill, aptly named Beacon Hill. With a height of 100 metres it is the highest point in Norfolk and offers magnificent views down the steep wooded hills towards the coastal villages of East Runton and Beeston Regis. The land is now in the care of the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Beeston_Hill_-_geograph.org.uk_-_792759.jpg",
      "title": "Evelyn Simak / Beeston Hill",
      "caption": "Beeston Hill. Viewed across beach with skeleton revetments; with only the upright posts still in place they provide no protection from wave action. The cliffs beyond show signs of erosion, evidenced by the heaps of sand and other materials that have accumulated at the cliff base due to recent slides."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/View_west_towards_Beeston_Hill_-_geograph.org.uk_-_792789.jpg",
      "title": "Evelyn Simak / View west towards Beeston Hill",
      "caption": "View west towards Beeston Hill. The distinctive outcrop seen in mid distance, located between the skeleton of revetments and the cliff face, is a pillar entirely of chalk. Although chalk is a soft rock it is relatively more resistant to erosion than the other deposits. Chalk is composed of calcium carbonate from the remains of microscopic marine organisms that once lived in a warm shallow sea which covered this area between 62 and 132 million years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/The_path_to_St_Mary%27s_church_in_Beeston_-_geograph.org.uk_-_1830365.jpg",
      "title": "The path to St Mary's church in Beeston by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The path to St Mary's church in Beeston"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Looking_towards_West_Runton_from_the_Roman_Camp%2C_Norfolk_taken_1964_-_geograph.org.uk_-_806470.jpg",
      "title": "William Matthews / Looking towards West Runton from the Roman Camp, Norfolk taken 1964",
      "caption": "Looking towards West Runton from the Roman Camp, Norfolk taken 1964. Heather and bracken on the site of the Roman Camp near West Runton."
    }
  ],
  "distance_km": 7.5,
  "description": "This circular walk from the Norfolk village of West Runton takes you up to Beacon Hill, Beeston Regis Heath and Beeston Bump where there's some nice footpaths and a fine viewpoint. The walk starts at the car park in West Runton on the sea front. You can then pick up a country lane heading south towards Town Hill and Beacon Hill, passing the National Trust's Incleborough Hill on your left. Beacon Hill is notable as the highest point in the county of Norfolk, standing at a height of 103 metres (338 ft) above sea level. There's excellent views towards the coast here. At Beacon Hill you can pick up the Peddars Way and Norfolk Coast Path and follow the waymarked footpath west passing the site of a Roman Camp before coming to Beeston Regis Heath and Beeston Bump where there's more great views and pretty heather. The route then turns north to take you past Beeston Regis village and the remains of the old priory. You then come out at the coast near Sheringham where you can follow a path along the beach to return to West Runton.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could pick up the coastal path on the West Runton to Cromer Walk, the Cromer to Mundesley Walk and the Cromer to Overstrand Walk Just to the west of the Bump there's some nice trails around Salthouse and Kelling Heath. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/avcjCGYaFAI",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Water Lane, Runton, West Runton, North Norfolk, Norfolk, England, NR27 9QA, United Kingdom",
  "postcode": "NR27 9QA",
  "district": "North Norfolk",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "coastal"
  ],
  "points_of_interest": [
    "viewpoint",
    "Roman camp",
    "historical site"
  ],
  "facilities": [
    "car park",
    "pub/cafe",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}