{
  "created_at": "2025-01-06T04:43:01.670970+00:00",
  "objectID": "cbbd676bbbfefbf02d444be5af24feb3",
  "ref": "sheepscombe-walking-route",
  "title": "Sheepscombe Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ad/View_across_Sheepscombe_-_geograph.org.uk_-_1430688.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cbbd676bbbfefbf02d444be5af24feb3.gpx",
  "_geoloc": {
    "lat": 51.7915952488,
    "lng": -2.157121657
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/View_across_Sheepscombe_-_geograph.org.uk_-_1430688.jpg",
      "title": "Brian Robert Marshall / View across Sheepscombe",
      "caption": "View across Sheepscombe. The village has its origins in the 13th century. Like other towns and villages in this part of the Cotswolds it was a cloth-making centre. The last mill closed in 1839. Nowadays it is home to those of sufficient means to buy a property here. In the centre of the picture is St John the Apostle's church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/St_John_the_Apostle%27s_church%2C_Sheepscombe_-_geograph.org.uk_-_1430687.jpg",
      "title": "Brian Robert Marshall / St John the Apostle's church, Sheepscombe",
      "caption": "St John the Apostle's church, Sheepscombe. The church was built and opened in 1820. It was designed by John Wight, and later expanded in 1872 by Francis Niblett. It is constructed of limestone ashlar with a stone slate roof to coped gables. English Heritage has listed the church as Grade II for its special architectural and historic interest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Pool%2C_Workman%27s_Wood_-_geograph.org.uk_-_2440885.jpg/512px-Pool%2C_Workman%27s_Wood_-_geograph.org.uk_-_2440885.jpg",
      "title": "Pool, Workman's Wood by Christopher Hilton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pool, Workman's Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Butcher%27s_Arms%2C_Sheepscombe_-_geograph.org.uk_-_962402.jpg",
      "title": "Mike White / Butcher's Arms, Sheepscombe",
      "caption": "Butcher's Arms, Sheepscombe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Fortunes_Well%2C_Sheepscombe.jpg/512px-Fortunes_Well%2C_Sheepscombe.jpg",
      "title": "Dave.Dunford, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Fortunes Well, Sheepscombe. Since the early 17th century, Sheepscombe was engaged in cloth manufacturing, akin to many of the Cotswold towns in the vicinity, including its nearby neighbour Painswick. Its industrial zenith occurred during the late 18th and early 19th centuries, with the closure of the last mill taking place in 1839. Subsequently, Sheepscombe grappled with escalating poverty and a dwindling populace."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/War_memorial_in_Sheepscombe_-_geograph.org.uk_-_4723679.jpg",
      "title": "War memorial in Sheepscombe by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "War memorial in Sheepscombe. In the early part of the 20th century, Sheepscombe retained its rural, agrarian character; however, presently, akin to numerous Cotswold villages, it has evolved into an affluent and exclusive residential locale. The majority of its residents hail from the professional middle class, willing to pay a premium for the privilege of residing there. Nestled at the base of a steep valley, Sheepscombe proves relatively inaccessible, posing challenges for those devoid of private transportation."
    }
  ],
  "distance_km": 1.4,
  "description": "This walk visits the pretty village of Sheepscombe in the Gloucestershire section of the Cotswolds National Park. The village is a pleasant place for a stroll with pretty stone cottages and an interesting old church. There are also some fine walking trails heading into the surrounding woodlands and countryside. If you would like to extend your walk then you could visit the historic Prinknash Abbey Park or climb Painswick Beacon for wonderful views over the Cotswolds. Please scroll down for the full list of walks near and around Sheepscombe. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Butchers Arms is an historic pub of some note. The Sheepscombe Valley formerly constituted a segment of a Royal Deer Park utilised by King Henry VIII, with the inn's origins tracing back to circa 1670. Its nomenclature harks back to historical customs, where the remains of deer slain during hunting expeditions were suspended in what currently serves as the pub's bar area. Moreover, The Butchers Arms boasts a distinctive claim to fame. The intricately carved outdoor sign featuring a butcher enjoying a pint of ale whilst accompanied by a tethered pig is likely one of the most recognisable and frequently photographed pub signs across the nation. Affectionately dubbed \"Arfur,\" owing to an incident wherein he toppled from his post and fractured in two, he was diligently revitalised to his former glory in 2020 by two steadfast and skilled regulars. The pub also includes a lovely garden area where you can enjoy a meal with views over the countryside."
    }
  ],
  "video_url": "https://www.youtube.com/embed/778n9s3PUKk?si=D121gVs-xoM5cFRX",
  "postcode": "GL6 7RQ",
  "district": "Painswick",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Jacks Green, Painswick, Sheepscombe, Stroud, Gloucestershire, England, GL6 7RQ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "countryside"
  ],
  "points_of_interest": [
    "historic site",
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}