{
  "created_at": "2025-01-06T00:51:52.221610+00:00",
  "objectID": "cc0b33aa2579de4c6c1f105c11ed8988",
  "ref": "verulamium-park-walking-route",
  "title": "Verulamium Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Verulamium-Park-20060304-001.jpg/512px-Verulamium-Park-20060304-001.jpg",
  "nearby": [
    {
      "description": "Ver-Colne Valley Walk",
      "objectID": "f7138722c89c50ebe8e2d550faaa7443",
      "ref": "ver-colne-valley-walk-walking-route"
    },
    {
      "description": "Redbourn",
      "objectID": "1b0a4d2629b334e1de8b2e81b3118f76",
      "ref": "redbourn-walking-route"
    },
    {
      "description": "Sandridge",
      "objectID": "66024b23fb210dee5bd138981a8e4f74",
      "ref": "sandridge-walking-route"
    },
    {
      "description": "Heartwood Forest",
      "objectID": "607313ed9749a21978375cc5bf67e67e",
      "ref": "heartwood-forest-walking-and-cycle-route"
    },
    {
      "description": "Gorhambury Estate",
      "objectID": "ec69438498df663289159938c62b79be",
      "ref": "gorhambury-estate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc0b33aa2579de4c6c1f105c11ed8988.gpx",
  "_geoloc": {
    "lat": 51.7468632103,
    "lng": -0.3424317006
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Verulamium-Park-20060304-001.jpg/512px-Verulamium-Park-20060304-001.jpg",
      "title": "Gary Houston [CC0], via Wikimedia Commons",
      "caption": "Ice-covered lake in Verulamium Park, St Albans, UK."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Verulamium-Park-lake-bridge-20031026-002.jpg/512px-Verulamium-Park-lake-bridge-20031026-002.jpg",
      "title": "Gary Houston [CC0], via Wikimedia Commons",
      "caption": "The footbridge over the Verulamium Park lake, separating the main lake from the boating lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Inn-on-the-Park-St-Albans-20031112-019.jpg/512px-Inn-on-the-Park-St-Albans-20031112-019.jpg",
      "title": "Gary Houston [CC0], via Wikimedia Commons",
      "caption": "The Inn on the Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Verulamium-PS01.JPG/512px-Verulamium-PS01.JPG",
      "title": "Przemysław Sakrajda [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Verulamium footpath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/St_Albans%2C_The_Lake_in_Verulamium_Park_-_geograph.org.uk_-_1347000.jpg",
      "title": "Nigel Cox / St Albans: The Lake in Verulamium Park",
      "caption": "The Lake in the park. In the past the wall of the old Roman city of Verulamium would have been to the right, with the site of the former Roman Fish Pond straight ahead. The River Ver flows under the trees to the left, while in the foreground can be seen a moorhen and a couple of its chicks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/St_Albans%2C_Verulamium_Roman_Mosaic_and_Hypocaust_Museum_-_geograph.org.uk_-_1347309.jpg",
      "title": "Nigel Cox / St Albans: Verulamium Roman Mosaic & Hypocaust Museum",
      "caption": "Verulamium Roman Mosaic & Hypocaust Museum Sir Mortimer Wheeler and his wife Tessa uncovered the mosaic and hypocaust in this location during an archaeological investigation in Verulamium Park in the 1930s. The original brick museum building housing the mosaic was replaced by this new structure in 2004. The enclosing walls are faced with glass reinforced concrete panels imprinted with oyster shells, these having been used as building materials during Roman times, while the rosette-shaped openings in the walls are a visual allusion to the floral pattern of the mosaic. The building's tilted roof on the left opens up towards the park, reflecting the mosaic to the outside world via a mirror-faced soffit. The tower of The Cathedral and Abbey Church of Saint Alban can just be glimpsed above the trees to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/St_Albans%2C_Verulamium_Roman_Theatre_-_geograph.org.uk_-_1362740.jpg",
      "title": "Nigel Cox / St Albans: Verulamium Roman Theatre",
      "caption": "Roman Theatre. Parts of the earthworks associated with the Roman Theatre at Verulamium are visible here. These are between the Theatre itself and the Hemel Hempstead Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/St_Albans%2C_Verulamium_Roman_City_Wall_-_geograph.org.uk_-_1346797.jpg",
      "title": "Nigel Cox / St Albans: Verulamium Roman City Wall",
      "caption": "Roman City Wall. This is one of the surviving fragments of the Roman wall built around the city of Verulamium. Originally it extended for about 3.6 kilometres or about 2 miles around the city. This section formed part of the eastern defences of the settlement and was built between AD 256 and AD 270. It is constructed of mortared flint with red brick bonding. When it was first built it was about 5 metres high with a walkway on top protected by a 1.8 metre high parapet. It was about 3 metres wide at the base and this is the inside face."
    }
  ],
  "distance_km": 3.0,
  "description": "Explore over 100 acres of beautiful parkland and gardens on this short walk in St Albans. In the park you can follow waterside walking trails along the River Ver and the beautiful ornamental lakes. Look out for a variety of wildlife on the water including grey heron, mallards, swans, herons, great crested grebes, coots, pochards and tufted ducks. There is also a cycle path running through the centre of the park. The park has a fascinating history stretching back 2000 years. It is named after the Roman city of Verulamium on which it now stands. There are still large sections of the Roman city wall still intact and a fascinating museum where you can learn all about the history of the area. Other facilities include a children's splash park and an on site cafe for refreshments after your walk. The Ver-Colne Valley Walk passes through the park so there is scope for extending your walk. You can follow the path along the rivers Ver and Colne to Watford or Redbourn .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The walk to the Gorhambury Estate starts from the car park in the park. Follow the trail north west past the Roman theatre and it will take you across the scenic estate and past the 18th century Gorhambury House. The estate also includes the historicially significant Old Gorhambury House. The 16th century house is now a ruin run by English Heritage. On the northern side of the town you can visit the village of Sandridge in the Heartwood Forest. There's lots of fine woodland trails and a 17th century pub to visit in this area.  For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/60LrB-Aehqo",
  "postcode": "AL1 1DH",
  "district": "St Albans",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grove Road, St Stephens, St Albans, Hertfordshire, England, AL1 1DH, United Kingdom",
  "state": "England"
}