{
  "created_at": "2025-01-06T04:16:05.115571+00:00",
  "objectID": "cc0fc19f260d5cd701eff3508c0f9f29",
  "ref": "hergest-ridge-walking-route",
  "title": "Hergest Ridge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Ascending_Hergest_Ridge_-_geograph.org.uk_-_449130.jpg",
  "nearby": [
    {
      "description": "Mortimer Trail",
      "objectID": "a8d33ee7bcc070e783c5bb74104305b5",
      "ref": "mortimer-trail-walking-route"
    },
    {
      "description": "Offa's Dyke Path",
      "objectID": "0ee8e8143856fd9ce9c8286e5ac3ebbd",
      "ref": "offas-dyke-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc0fc19f260d5cd701eff3508c0f9f29.gpx",
  "_geoloc": {
    "lat": 52.2046972314,
    "lng": -3.0365337341
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Ascending_Hergest_Ridge_-_geograph.org.uk_-_449130.jpg",
      "title": "Chris Heaton / Ascending Hergest Ridge",
      "caption": "Ascending Hergest Ridge Following Offa's Dyke National Trail up the gradual incline of Hergest Ridge - immortalised by Mike Oldfield's music bearing the same name"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/The_Whetstone%2C_Hergest_Ridge_-_geograph.org.uk_-_438143.jpg",
      "title": "Tim Heaton / The Whetstone, Hergest Ridge",
      "caption": "The Whetstone, Hergest Ridge, the Umbrella gives scale. Presumably a glacial erratic. The name implies its use as a stone for sharpening metal tools. Welsh rocks - often metamorphosed volcanic ashes - were once widely used for this purpose."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Tarn_on_Hergest_Ridge_-_geograph.org.uk_-_15995.jpg",
      "title": "Richard Higgs / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Tarn on Hergest Ridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Pony_on_Hergest_Ridge_-_geograph.org.uk_-_1725487.jpg",
      "title": "Trevor Rickard / Pony on Hergest Ridge",
      "caption": "Pony on the Ridge. View north with Hanter Hill on the right and the Radnor Forest in the distance. These semi-wild hardy ponies graze the hill all-year-round. Not only can they cope with the freezing conditions, but they also chomp away at the gorse bushes all winter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/The_way_down_from_Hergest_Ridge_-_geograph.org.uk_-_22814.jpg",
      "title": "Bob Tinley / The way down from Hergest Ridge",
      "caption": "The way down from the Ridge. A delightful road leading off the Ridge into Gladestry"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_disused_racecourse_on_the_Hergest_Ridge_-_geograph.org.uk_-_1444713.jpg",
      "title": "Trevor Rickard / The disused racecourse on the Hergest Ridge",
      "caption": "The disused racecourse on the Ridge. From the hilltop looking north-east to the partially wooded Bradnor Hill, with Herrock Hill beyond to the left. This track is part of the oval-shaped Kington Racecourse on the Hergest Ridge, which is still clearly marked on the OS map. The racecourse started up in 1825 and held regular events until around 1880. It replaced an original course running around the top of Bradnor Hill, which began use in about 1770."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Offa%27s_Dyke_Path_crosses_the_old_racecourse_-_geograph.org.uk_-_1727616.jpg",
      "title": "Trevor Rickard / Offa's Dyke Path crosses the old racecourse",
      "caption": "Offa's Dyke Path crosses the old racecourse. View east with Bradnor Hill on the left. The way mark post with the acorn sign indicates that the long distance path heads east down the hill. The racecourse cuts across the main path here and is a popular walk, providing views in all directions as it circles the hilltop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/The_Hergest_Ridge_-_geograph.org.uk_-_1724238.jpg",
      "title": "Trevor Rickard / The Hergest Ridge",
      "caption": "View north-east up the spine of the ridge. Tracks in the snow indicate a couple of walkers and a single vehicle."
    }
  ],
  "distance_km": 6.5,
  "description": "Cross the Hergest Ridge on this splendid walk on the England Wales border. The ridge runs between Kington in Herefordshire to the little village of Gladestry in Powys, Wales. It's an exhilirating and beautiful way to cross the border between the two countries. The route runs for about 4 miles along the Offa's Dyke Path reaching a height of 426 m (1,398 ft). There are fabulous panoramic views of the Welsh Hills and English countryside as you make your way across the ridge. The beautiful area inspired the 1974 album 'Hergest Ridge' by the English musician Mike Oldfield. You can start the walk in the centre of Kington, picking up the trail on Ridgebourne Road and following it west up to the ridge. The route then passes Yeld Wood and Hanter Hill before descending into Gladestry where you can enjoy refreshments. The route also passes a disused Victorian circular country racecourse, popular between 1825 and 1846. You can still see the markings about half way along the ridge. To extend your walk you can continue along the path towards Newchurch. The Mortimer Trail also passes through Kington so you can also pick up this path and explore the Herefordshire countryside north of the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Royal Oak in Kington is a good choice for some refreshments after your walk. They do good home cooked food and have a nice large garden area to relax in on warmer days. You can find the pub on Church Street with a postcode of HR5 3BE for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking you could try the circular Kington Walk which visits Rushock Hill, Herrock Hill and the River Arrow.  For more walking ideas in the area see the Herefordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/0OCHaFgPhBI",
  "district": "Kington",
  "county": "County of Herefordshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}