{
  "created_at": "2025-01-06T09:14:00.487440+00:00",
  "objectID": "cc1ad1dce04225c45f904ca3ca1cb8d8",
  "ref": "peel-tower-walking-route",
  "title": "Peel Tower Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/90/Peel_Tower_-_geograph.org.uk_-_444207.jpg",
  "nearby": [
    {
      "description": "Calf Hey Reservoir",
      "objectID": "2631d333250fa2b0eb46511233d8496c",
      "ref": "calf-hey-reservoir-walking-route"
    },
    {
      "description": "Rossendale Way",
      "objectID": "86428bb01bf01a8eb2e0a003212a2f22",
      "ref": "rossendale-way-walking-route"
    },
    {
      "description": "Irwell Sculpture Trail",
      "objectID": "7b491815b9290d73a8137e8a38d25ec5",
      "ref": "irwell-sculpture-trail-walking-route"
    },
    {
      "description": "Burrs Country Park",
      "objectID": "6d4718dfe9b5900149c70f84c90eb03e",
      "ref": "burrs-country-park-walking-route"
    },
    {
      "description": "Holcombe Moor",
      "objectID": "1caaf602b60f5a08e1767d41d2856d09",
      "ref": "holcombe-moor-walking-route"
    },
    {
      "description": "Summerseat",
      "objectID": "9fecf42c6853e4fd34e6f45ab32b2dd0",
      "ref": "summerseat-walking-route"
    },
    {
      "description": "Ramsbottom",
      "objectID": "6e2284c42d1f1ef1bc5c3bf28132b703",
      "ref": "ramsbottom-walking-route"
    },
    {
      "description": "Redisher Wood",
      "objectID": "a1a1f69c43853a321f1503c5977ed7c5",
      "ref": "redisher-wood-walking-route"
    },
    {
      "description": "Stubbins Estate",
      "objectID": "16e53df672bc1b443dd6345b23910f57",
      "ref": "stubbins-estate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc1ad1dce04225c45f904ca3ca1cb8d8.gpx",
  "_geoloc": {
    "lat": 53.6420124245,
    "lng": -2.3328052072
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Peel_Tower_-_geograph.org.uk_-_444207.jpg",
      "title": "Paul Anderson / Peel Tower",
      "caption": "Peel Tower"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Peel_tower%2C_Holcombe_Hill_-_geograph.org.uk_-_464838.jpg",
      "title": "liz dawson / Peel tower, Holcombe Hill",
      "caption": "Peel tower, Holcombe Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Viewing_bench_below_Peel_Monument_-_geograph.org.uk_-_371073.jpg",
      "title": "liz dawson / Viewing bench below Peel Monument",
      "caption": "Viewing bench below Peel Monument"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Cottage_at_the_top_of_Holcombe_Hill_-_geograph.org.uk_-_371079.jpg",
      "title": "liz dawson / Cottage at the top of Holcombe Hill",
      "caption": "Cottage at the top of Holcombe Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Bank_Top_Farm%2C_Holcombe_Hill_-_geograph.org.uk_-_344062.jpg",
      "title": "liz dawson / Bank Top Farm, Holcombe Hill",
      "caption": "Bank Top Farm, Holcombe Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Quarlton_Heights_from_the_west_-_geograph.org.uk_-_585299.jpg",
      "title": "liz dawson / Quarlton Heights from the west",
      "caption": "Quarlton Heights from the west"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Head_of_Alden_Valley_-_geograph.org.uk_-_157709.jpg",
      "title": "Gillian Rimington / Head of Alden Valley",
      "caption": "Head of Alden Valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Alden_Brook_-_geograph.org.uk_-_417160.jpg",
      "title": "liz dawson / Alden Brook",
      "caption": "Alden Brook"
    }
  ],
  "distance_km": 13.0,
  "description": "This walk climbs to the Peel Monument on Holcombe Hill in Ramsbottom near Bury. The tower is dedicated to Sir Robert Peel, the 19th century Prime Minister considered the father of modern British policing. The impressive landmark stands at a height of 1,100 feet (335 m) above sea level, commanding wonderful views over the surrounding countryside and towns. This circular walk climbs to the tower before exploring the expansive Holcombe Moor. Start the walk from the car park just to the south east of the tower, on Lumb Carr Road. From here you head west, crossing Holcombe Old Road and Moorbottom Road. Turn to the south west and then climb up to the Millennium bench where you can sit and enjoy the views. From here you turn north and follow the paths up to the 128 feet (39 m) high monument. There's wonderful views over Manchester to North Wales from the elevated position of the monument. The route then leaves the tower to cross Holcombe Moor. You head west towards Quarlton Heights, before turning east to Beetle Hill. This section passes close to a military firing range, so take care around here. From Beetle Hill you descend towards Stubbins and Chatterton, where you follow the River Irwell south into Ramsbottom. Here you leave the river and head west to Holcombe and the finish point back at the car park. The last section passes the Shoulder of Mutton which is a great place for refreshments after your exercise. The pub is walker friendly and has a car park which can be used as an alternative start point. The walk uses a section of the Rossendale Way long distance footpath on Holcombe Moor. You can extend your walk by heading north along the trail to the nearby Ogden Reservoir and Calf Hey Reservoir. You could also pick up the Irwell Sculpture Trail in Ramsbottom. Following the trail south will take you along the River Irwell to Burrs Country Park and Bury .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Shoulder of Mutton pub is conveniently located in Holcombe village. The old traditional inn dates from 1751 and includes two nice beer gardens for warmer days. You can find the inn, near the car park, on Lumb Carr Road at postcode BL8 4LZ. The Eagle and Child in nearby Ramsbottom is a pub also worthy of some investigation. It was named Great British Pub Awards ‘Pub of the Year’ in September 2017 and has a whole host of other awards to its name. It's a pub with a social conscience targeting young people who are marginalised and need extra help such as young offenders and disabled young people. They're rated as one of the best food pubs in Greater Manchester, having consistently featured in all the main national newspapers ‘Top 50 Sunday Lunch’ features. One of the main attractions is a stunning Orangery dining room, with fine views across the Irwell valley to Holcombe. The expansive garden area includes an outdoor kitchen and bar, polytunnel, veg beds, compost beds, fruit shrubs and ornamental beds and a mini orchard with chickens. It's a lovely setting and the ideal place to round off your walk. You can find the pub in the town on Whalley Rd with a postcode of BL0 0DL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The tower and surrounding moorland are a good place for a dog walk. There is some livestock in the area so please keep your dog under control here. The Shoulder of Mutton Pub mentioned above is also very dog friendly and will provide treats and water for your pet."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative circular walk across the moor see our Holcombe Moor Walk. This visits the interesting site of the Pilgrim's Cross which dates all the way back to A.D. 1176 and was the site where Pilgrims to Whalley Abbey prayed and rested. There is also information here on the army firing times on the moor. Just south of Ramsbottom there's the worthy Redisher Wood to explore. In the woods there are peaceful woodland trails and water features including the Holcombe Brook, a picturesque lake and photogenic waterfalls. The circular Stubbins Estate Walk takes you to the Tentering Tower, a ruined industrial building on the eastern side of the moor. Just to the east there's the worthy village of Summerseat where there's an impressive six arched viaduct, historic old mills and a heritage railway station on the East Lancs railway."
    }
  ],
  "video_url": "https://www.youtube.com/embed/p0smxaaXL-o",
  "postcode": "BL0 9QG",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lumb Carr Road, Nuttall, Holcombe, Bury, Greater Manchester, England, BL0 9QG, United Kingdom",
  "district": "Bury",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "rural"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical landmarks",
    "scenic views"
  ],
  "facilities": [
    "car park",
    "pub/cafe",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}