{
  "created_at": "2025-01-06T01:21:56.502832+00:00",
  "objectID": "cc1d4fafac5ce4856d116ea165833604",
  "ref": "walthamstow-reservoirs-walking-and-cycle-route",
  "title": "Walthamstow Reservoirs, Marshes and Wetlands Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Walthamstow-Reservoir-747.JPG/512px-Walthamstow-Reservoir-747.JPG",
  "nearby": [
    {
      "description": "Pymmes Brook Trail",
      "objectID": "8aaaa3816e9e2b329c3b5a53049d1e2a",
      "ref": "pymmes-brook-trail-walking-route"
    },
    {
      "description": "Lea Valley Walk",
      "objectID": "af6db7140df05d5e84b785fb63202b0d",
      "ref": "lea-valley-walk-walking-route"
    },
    {
      "description": "Tottenham Marshes",
      "objectID": "b1e4489565bc6610f6557a797ec785f5",
      "ref": "tottenham-marshes-walking-and-cycle-route"
    },
    {
      "description": "Green Link Walk",
      "objectID": "0307081f862569a84e2737a278adc771",
      "ref": "green-link-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc1d4fafac5ce4856d116ea165833604.gpx",
  "_geoloc": {
    "lat": 51.5728292153,
    "lng": -0.0553217504
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Walthamstow-Reservoir-747.JPG/512px-Walthamstow-Reservoir-747.JPG",
      "title": "By ProfDEH (Original photo) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Walthamstow Reservoirs. General View"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Walthamstow-Reservoir-756.JPG/512px-Walthamstow-Reservoir-756.JPG",
      "title": "By ProfDEH (Original photo) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons",
      "caption": "Nice view of the footpath running along the water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Low_Maynard_Reservoir.jpg",
      "title": "David Hawgood, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Low Maynard reservoir, Lea Valley. View north from Ferry Lane, just within Waltham Forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Walthamstow_Coppermill_-_geograph.org.uk_-_1364697.jpg",
      "title": "Chris Allen / Walthamstow Coppermill",
      "caption": "Walthamstow Coppermill at the southern end of the reservoirs. This was a former oil mill and was acquired by the British Copper Company in 1808 for rolling copper ingots into sheets for general use and coinage. The site was water powered. Rolling mill ceased 1857 and bought by the East London Waterworks that used the wheel to pump water. It also added the tower to accommodate a Bull pumping engine. An ancient wooden crane is out of view to the left but appears overwhelmed by foliage. See A Guide to the Industrial Archaeology of Hertfordshire and the Lea Valley by Tim Smith and Bob Carr (2004)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Geograph-3189734-by-tony-waldron-Walthamstow.jpg/512px-Geograph-3189734-by-tony-waldron-Walthamstow.jpg",
      "title": "tony waldron / walthamstow reservoirs",
      "caption": "Walthamstow Wetlands near to Tottenham, Haringey. A view of the site in late summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Walthamstow_Marshes_-_geograph.org.uk_-_93325.jpg",
      "title": "John Davies / Walthamstow Marshes",
      "caption": "Walthamstow Marshes. This area of wetlands, now a nature reserve, is bounded to the west by the Lee Navigation and is crossed by the railway out of Liverpool Street on an embankment. This view is to the north-east taken from close to the railway bridge over the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Walthamstow_Marshes_-_geograph.org.uk_-_3294183.jpg",
      "title": "Walthamstow Marshes by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Walthamstow Marshes information board."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Pylons_in_the_Lea_Valley_-_geograph.org.uk_-_120845.jpg",
      "title": "Andrew Dann / Pylons in the Lea Valley",
      "caption": "The A406 North Circular road crosses the river, canal and various drainage channels. There are electricity pylons, gas holders, industrial estates and retail sheds. This picture was taken near a pumping station, close to Banbury reservoir and Costco."
    }
  ],
  "distance_km": 4.0,
  "description": "Enjoy a waterside walk or cycle along this series of reservoirs in the Walthamstow Wetlands Nature Reserve. A traffic free cycle path runs along the River Lea Navigation Canal from Walthamstow Marshes to Banbury Reservoir. It follows National Cycle route 1 along the Lea Valley Walk passing Lockwood Reservoir, High Maynard Reservoir, Low Maynard Reservoir, East Warwick Reservoir and West Warwick Reservoir. The route starts at the Lea Valley Springfield Marina and follows the flat path to Tottenham Marshes for about 3 miles. It's a nice easy walk or ride with the option of continuing to Lea Valley Park and the William Girling Reservoir. The area is great for wildlife with a heronry and various other water loving birds to look out for. These include pochard, tufted duck, coot, yellow wagtail, sedge warbler, great crested grebe and reed warbler. The area is also very popular with anglers providing both coarse fishing and fly fishing. You can extend your walk by picking up the Pymmes Brook Trail at William Girling Reservoir. The trail heads west towards Edmonton and Pymmes Park. If you continue north along the river you will come to the splendid River Lee Country Park where you will find a series of footpaths and cycle trails taking you to lakes, watercourses and open spaces.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just north of Banbury Reservoir there's The Old Hall Tavern next to the William Girling Reservoir in Chingford. There's a great menu and a lovely big garden area to sit out in if the weather is fine. You can find them at 200 Hall Lane with a postcode of E4 8EY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is nice for dog walking and the Old Hall Tavern mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the reservoirs you'll find the pretty Finsbury Park where's more lakeside trails. Here you can also pick up the popular Parkland Walk. The walk follows the course of an old railway line running between Finsbury Park and Alexandra Park. The whole route is actually a local nature reserve and a great place to see interesting flora and fauna in the city. The Green Link Walk passes the reservoirs. This waymarked trail takes you from the edge of Epping Forest to Peckham, passing a number of London's pleasant Green spaces on the way. For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/JgMmJ5uo0Z8",
  "district": "London",
  "county": "Greater London",
  "region": "London",
  "country": "England",
  "gazetteer_found": true
}