{
  "created_at": "2025-01-06T02:20:58.201004+00:00",
  "objectID": "cc316203dca3d92a16b5be91c504bdfd",
  "ref": "esk-valley-walk-walking-route",
  "title": "Esk Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/be/River_Esk_-_geograph.org.uk_-_199011.jpg",
  "nearby": [
    {
      "description": "Danby Beacon",
      "objectID": "07e3681df83e3e684b67d66c994f01e5",
      "ref": "danby-beacon-walking-route"
    },
    {
      "description": "Farndale Daffodil Walk",
      "objectID": "efa960535c52cace7b4f9cc5754e9e9b",
      "ref": "farndale-daffodil-walk-walking-route"
    },
    {
      "description": "Sleights to Whitby Walk",
      "objectID": "90bba544e9bf4c381867610c89daaf76",
      "ref": "sleights-to-whitby-walk-walking-route"
    },
    {
      "description": "Larpool Viaduct",
      "objectID": "7fb6f14958b832b55d1f934b45c7d576",
      "ref": "larpool-viaduct-walking-route"
    },
    {
      "description": "Egton Bridge",
      "objectID": "da062d3283f8529e97c89e34ed787195",
      "ref": "egton-bridge-walking-route"
    },
    {
      "description": "Glaisdale",
      "objectID": "d05ea860901ed312d2685753fcd14731",
      "ref": "glaisdale-walking-route"
    },
    {
      "description": "Lealholm",
      "objectID": "a71ab978b5f022060811a7a8b035b725",
      "ref": "lealholm-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc316203dca3d92a16b5be91c504bdfd.gpx",
  "_geoloc": {
    "lat": 54.4672226052,
    "lng": -0.9468008385
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/River_Esk_-_geograph.org.uk_-_199011.jpg",
      "title": "Margaret Clough / River Esk, via Wikimedia Commons",
      "caption": "River Esk near Sleights"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Floating_Drydock%2C_Parkol_Marine_-_geograph.org.uk_-_1401263.jpg",
      "title": "Mike Kirby / Floating Drydock, Parkol Marine, via Wikimedia Commons",
      "caption": "Floating Drydock, Parkol Marine with Whitby Abbey in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Bridleway_approaching_Hecks_Wood_-_geograph.org.uk_-_810337.jpg",
      "title": "Stephen McCulloch / Bridleway approaching Hecks Wood, via Wikimedia Commons",
      "caption": "Bridleway approaching Hecks Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Towards_Westerdale_Moor_and_Eskdale_-_geograph.org.uk_-_895166.jpg",
      "title": "Peter Church / Towards Westerdale Moor and Eskdale, via Wikimedia Commons",
      "caption": "Towards Westerdale Moor and Eskdale This view is north, and one of the options for the Lyke Wake Walk, followed this route, but with the need to avoid boot erosion, and the understandable desire to visit the Lion Inn at Blakey, most walkers now continue east along the disused railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Abandoned_Railway_Viaduct_over_the_River_Esk_at_Whitby_-_geograph.org.uk_-_1605143.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Larpool Viaduct. Abandoned Railway Viaduct over the River Esk at Whitby"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/River_Esk_and_Ruswarp_Bridge_-_geograph.org.uk_-_657892.jpg",
      "title": "Mick Garratt / River Esk and Ruswarp Bridge",
      "caption": "River Esk and Ruswarp Bridge. The village of Ruswarp is on the far bank with the tower of St. Bartholomew's church prominent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/River_Esk_at_Egton_Bridge_-_geograph.org.uk_-_1866434.jpg",
      "title": "River Esk at Egton Bridge by Tom Richardson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Esk at Egton Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/St_Hedda%27s_Church%2C_Egton_Bridge_-_geograph.org.uk_-_595835.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Hedda's Church, Egton Bridge. This magnificent church deserves its nickname 'Cathedral of the Moors'. St Hedda's has strong links with priest and martyr Nicholas Postgate who was born in this area and ministered to the Catholic population of this part of the moors."
    }
  ],
  "distance_km": 56.0,
  "description": "A stunning walk through the North York Moors National Park from Castleton to Whitby. The walk begins with a loop from Castleton which passes through Danby Head, Westerdale Moor, Farndale Moor and High Blakey Moor. You return to Castleton where you begin the next section through Esk Dale to Danby and then the climb to Danby Beacon. From here it leads to Leaholm, Glaisdale, Egton Bridge and Grosmont with several sections along the River Esk. The final section takes you through Sleights to the finish point at Whitby, on the North Sea. See the Sleights to Whitby Walk for more details on this nice section. The walk passes the North York Moors Railway which you can take for part of the route. The steam railway is a significant tourist attraction and may be the busiest steam heritage line in the world, carrying around 350,000 passengers in 2009.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near Whitby you could stop off at The Bridge Inn in the little village of Ruswarp. The pub has a lovely garden area by the river where you can sit and watch the old steam trains go by. It's a splendid place to relax with a drink on warmer days. They also do very good food and have a fine selection of ales. You can find them on the High Street at a postcode of YO21 1NJ for your sat navs. It's also dog friendly if you have your canine friend with you. Near here there's also the option of climbing to the Larpool Viaduct for views over the area. The impressive 13 arch structure was built in 1882 to carry the Scarborough & Whitby Railway over the River Esk. It's now owned by Sustrans and carries the Cinder Track, a shared cycling and walking trail runnning to Robin Hood's Bay. At the picturesque village of Egton Bridge there's the Postgate Inn to consider. The tradtional country inn dates back to 1860 and also provides bed and breakfast accommodation. The Inn was a regular feature in the popular TV series \"Heartbeat\" that was set in the North York Moors under its stage name \"The Black Dog”. They serve good quality food and have a nice garden area to relax in on warmer days. You can find them at postcode YO21 1UX for your sat navs. In Lealholm there's The Board Inn next to the village green. The stone built pub dates back to the 17th century and serves good quality locally sourced dishes. In the summer months you can sit outside on the riverside patio and enjoy a lovely view with your meal. You can find them in the heart of the village at postcode YO21 2AJ for your sat navs. They also provide rooms if you would like to stay in the area. The village is worth exploring too with picturesque stepping stones across the River and a photogenic old stone bridge."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you are doing the walk in early spring then be sure to try the Farndale Daffodil Walk as you pass through the area. This delighful circular walk explores the 'wild' daffodils of Farndale. The flowers are very well known in the area and attract large numbers of visitors in the spring. The River Dove also runs through the area with the pretty daffodils lining the riverbank. It's a pcituresque sight and well worth seeing if you have time to take a small detour from the route. Near Glaisdale look out for the Beggar's Bridge. The splendid packhorse bridge dates back to 1619 and is Grade II listed. For more walking ideas in the area see the Yorkshire Walks and North York Moors Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/uEv6S6Iga5E",
  "district": "Castleton",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bow Bridge Lane, Conn House Farm, Danby, Castleton, North Yorkshire, York and North Yorkshire, England, YO21 2EZ, United Kingdom",
  "postcode": "YO21 2EZ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "tourist attractions"
  ],
  "facilities": [
    "car park",
    "railway"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "rail transport"
  ]
}