{
  "created_at": "2025-01-06T03:31:57.276349+00:00",
  "objectID": "cc419b082b3e2b24e992ec637928d416",
  "ref": "cam-peak-dursley-walking-route",
  "title": "Cam Peak Dursley Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/View_from_Cam_Peak_-_geograph.org.uk_-_1476268.jpg",
  "nearby": [
    {
      "description": "Coaley Peak",
      "objectID": "3f01bdd8224ef0b4186ee31fc8572fc0",
      "ref": "coaley-peak-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Uley Bury",
      "objectID": "a688898a1823fa48ae271bd0b7ab1605",
      "ref": "uley-bury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc419b082b3e2b24e992ec637928d416.gpx",
  "_geoloc": {
    "lat": 51.6815476422,
    "lng": -2.3542079176
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/View_from_Cam_Peak_-_geograph.org.uk_-_1476268.jpg",
      "title": "Philip Halling / View from Cam Peak",
      "caption": "View from Cam Peak. View across the vale of Berkeley from the summit of Cam Peak or Peaked Down. The River Severn can be seen along with May Hill on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/View_from_Cam_Peak_towards_Ashmead_Green._-_geograph.org.uk_-_716135.jpg",
      "title": "Ken Wilkins / View from Cam Peak towards Ashmead Green.",
      "caption": "View from Cam Peak towards Ashmead Green. In the far distance, above Ashmead Green, May Hill can be seen beyond the River Severn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Information_Board_at_Cam_Peaked_Down%2C_near_Dursley%2C_Cotswolds_-_geograph.org.uk_-_1602153.jpg",
      "title": "Anthony O'Neil / Information Board at Cam Peaked Down, near Dursley, Cotswolds",
      "caption": "Information Board at Cam Peaked Down, near Dursley, Cotswolds The climb to the peak is short but steep and affords excellent views all around."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/View_from_Cam_Long_Down_-_geograph.org.uk_-_1476378.jpg",
      "title": "Philip Halling / View from Cam Long Down",
      "caption": "View from Cam Long Down. View towards the north and the vale of Gloucester from Cam Long Down. The Malvern Hills are on the horizon to the left."
    }
  ],
  "distance_km": 6.0,
  "description": "Enjoy a circular walk across Cam Long Down to Cam Peak on this lovely walk in Dursley. The down is on a splendid section of the Cotswold Escarpment with marvellous views, wildflower rich limestone grassland and attractive woodland. You can start the walk from the centre of Dursley and follow the Cotswold Way across the down. It climbs from the town to Cam Peak, reaching a height of over 700ft at the high points. From here there are really lovely views over the River Severn to the Forest of Dean, May Hill and the Welsh mountains. The route takes you over Cam Long Down with the option of continuing a little further east and visiting Uley Bury. This long, flat-topped hill is an impressive multi-vallate, scarp-edge Iron Age hill fort dating from around 300 BC. If you would prefer a shorter walk then you can start from the car park on the down. It's easy to extend your walk by continuing along the Cotswold Way. If you follow it north east you can visit Coaley Peak for more great views. Also nearby is the expansive Woodchester Park which includes a series of lakes and woodland trails.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking around the town try the longer Dursley Walk. This climbs Cam Long Down before visiting the Iron Age Hillfort at Uley Bury and Tudor Manor house at Owlpen. Just to the west you can visit the neighbouring town of Berkeley where you'll find the 12th century Berkeley Castle and the fascinating Edward Jenner Museum - the birthplace of vaccination. For more walking ideas in the area see the Cotswolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Vq8wlsYkU34",
  "postcode": "GL11 4HN",
  "district": "Dursley",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Market Place, Dursley, Stroud, Gloucestershire, England, GL11 4HN, United Kingdom",
  "state": "England"
}