{
  "created_at": "2025-01-06T02:21:47.481383+00:00",
  "objectID": "cc80d8223dc1ab491a43fb99446775b2",
  "ref": "northampton-canal-walk-walking-route",
  "title": "Northampton Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Northampton_Arm%2C_Grand_Union_Canal_-_geograph.org.uk_-_1497235.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cc80d8223dc1ab491a43fb99446775b2.gpx",
  "_geoloc": {
    "lat": 52.2333250381,
    "lng": -0.899932018
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Northampton_Arm%2C_Grand_Union_Canal_-_geograph.org.uk_-_1497235.jpg",
      "title": "Stephen McKay / Northampton Arm, Grand Union Canal, via Wikimedia Commons",
      "caption": "Northampton Arm, Grand Union Canal. A weed-choked stretch of canal allowing only single-file boat traffic. The bridge carrying the Northampton Ring Road can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Northampton_Arm%2C_Grand_Union_Canal%2C_Rothersthorpe_-_geograph.org.uk_-_1496942.jpg",
      "title": "Stephen McKay / Northampton Arm, Grand Union Canal, Rothersthorpe, via Wikimedia Commons",
      "caption": "Rothersthorpe. The drawbridge - this one is just below lock 10 - is one of three on the Northampton Arm. They have been restored but have no practical function and are locked out of use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/No_15_Lock%2C_Northampton_Arm%2C_Grand_Union_Canal_-_geograph.org.uk_-_1497242.jpg",
      "title": "Stephen McKay / No 15 Lock, Northampton Arm, Grand Union Canal, via Wikimedia Commons",
      "caption": "No 15 Lock. The Northampton Arm was built in 1815, connecting the Grand Union's main line at Gayton Junction and the River Nene, falling through 17 locks in five miles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/No_12_Lock%2C_Northampton_Arm%2C_Grand_Union_Canal_-_geograph.org.uk_-_1496931.jpg",
      "title": "Stephen McKay / No 12 Lock, Northampton Arm, Grand Union Canal, via Wikimedia Commons",
      "caption": "No 12 Lock. Few motorists on the M1 above this concrete tunnel are likely to be aware that they are travelling over the Rothersthorpe flight of locks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/No_16_Lock%2C_Northampton_Arm%2C_Grand_Union_Canal_-_geograph.org.uk_-_1497224.jpg",
      "title": "Stephen McKay / No 16 Lock, Northampton Arm, Grand Union Canal, via Wikimedia Commons",
      "caption": "No 16 Lock. The penultimate lock in the descent from Gayton Junction to the River Nene. This stretch of canal is not heavily used by pleasure boaters and the lock has a slightly neglected feel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/No_12_Lock%2C_Northampton_Arm%2C_Grand_Union_Canal_-_geograph.org.uk_-_1496926.jpg",
      "title": "Stephen McKay / No 12 Lock, Northampton Arm, Grand Union Canal, via Wikimedia Commons",
      "caption": "No 12 Lock, Northampton Arm, Grand Union Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Milepost_at_Gayton_Junction_-_geograph.org.uk_-_1496953.jpg",
      "title": "Stephen McKay / Milepost at Gayton Junction, via Wikimedia Commons",
      "caption": "Milepost at Gayton Junction. Almost 17 miles by the Grand Union main line to Braunston or just five - and 17 locks - down to the Nene at Northampton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Turnover_Bridge_near_to_Gayton_Junction_-_geograph.org.uk_-_1430214.jpg",
      "title": "Mike W Hallett / Turnover Bridge near to Gayton Junction, via Wikimedia Commons",
      "caption": "Turnover Bridge near to Gayton Junction. The towpath changes here from one side of the canal to the other. Turnover Bridge (47) is like two bridges back to back - one section for the road and one section for the towpath."
    }
  ],
  "distance_km": 8.0,
  "description": "This easy walk follow the Northampton Arm of the Grand Union Canal from the town centre to the countryside near Milton Malsor. It runs for a distance of about 5 miles along a nice flat path with views of the River Nene and the surrounding Northamptonshire countryside on the way. The walk starts the Towcester Bridge which runs over the River Nene and the canal in the town centre. Follow the towpath west and it will take you past Briar Hill Meadows and Duston Mill Reservoir. The canal continues south towards Rothersthorpe before coming to Gayton Junction where there is a nice marina at the end of the route. The village of Gayton is a short stroll from here so you could head there for refreshments. You can extend the walk at Gayton Junction by picking up the Grand Union Canal and heading west to Bugbrooke. Heading south east along the towpath will take you to Stoke Bruerne .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles north west of Northampton you'll find the Harlestone Firs Forest Walk. This popular woodland area contains miles of peaceful trails on Lord Spencer's Althorp Estate. Near the woods you can also visit Althorp House, the childhood home of Princess Diana. Here you can learn about 500 years of history and explore the beautiful grounds and gardens. The Nene Way also passes through the town. The lovely riverside trail could be followed east towards Cogenhoe and Wellingborough or west to Kislingbury. A few miles south east of the town there's the historic Castle Ashby. Here you'll find a fine manor house surrounded by 35 acres of parkland including Italian Gardens, an Orangery, an Arboretum and a series of pretty ponds.  Just to the east there's Sywell Country Park where there's a nice waterside trail around a pretty lake. On the southern side of the river and canal you will find Delapre Abbey Park. There's 500 acres of parkland, lakes, woodland and gardens to explore on this popular historic site. For more walking ideas in the area see the Northamptonshire Walks page."
    }
  ],
  "postcode": "NN1 1PJ",
  "district": "Northampton",
  "county": "West Northamptonshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "St Peters Way, St James' End, Northampton, West Northamptonshire, England, NN1 1PJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal path",
    "river"
  ],
  "points_of_interest": [
    "countryside views",
    "river views"
  ],
  "facilities": [
    "car park",
    "marina",
    "refreshments"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}