{
  "created_at": "2025-01-06T00:11:58.246223+00:00",
  "objectID": "cd1a41646f70692d1facadb6daac12e1",
  "ref": "godalming-walking-route",
  "title": "Godalming Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Godalming_Wharf_-_geograph.org.uk_-_511093.jpg",
  "nearby": [
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Downs Link",
      "objectID": "c71f2209e0279c5ed434c03995619c32",
      "ref": "downs-link-walking-and-cycle-route"
    },
    {
      "description": "Wey South Path",
      "objectID": "c73df34efb128fa3c8b0b0002d990b6a",
      "ref": "wey-south-path-walking-route"
    },
    {
      "description": "Guildford",
      "objectID": "7133164abc7ea9f4854c4b76c59492c0",
      "ref": "guildford-walking-route"
    },
    {
      "description": "Chiddingfold",
      "objectID": "a6db0d8bebbb05d03c70de5e5312ac3d",
      "ref": "chiddingfold-walking-route"
    },
    {
      "description": "Hydon's Ball and Hydon Heath",
      "objectID": "6b5b6398c98a8bde045d5164611cc2ff",
      "ref": "hydons-ball-and-hydon-heath-walking-route"
    },
    {
      "description": "Witley and Milford Common",
      "objectID": "12d0a928192e177956627e4407761818",
      "ref": "witley-and-milford-common-walking-route"
    },
    {
      "description": "River Wey Navigation",
      "objectID": "96275f96abad53c55093b675a2bd24ab",
      "ref": "river-wey-navigation-walking-and-cycle-route"
    },
    {
      "description": "Fox Way",
      "objectID": "c216f9e2ccbc1b29ac7c65339dc7f2f3",
      "ref": "fox-way-walking-route"
    },
    {
      "description": "Puttenham Common",
      "objectID": "478b16fb595a14fc69335a01acf178cc",
      "ref": "puttenham-common-walking-route"
    },
    {
      "description": "Chinthurst Hill",
      "objectID": "f475b8fb324c9f6b325936ae382fdd67",
      "ref": "chinthurst-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cd1a41646f70692d1facadb6daac12e1.gpx",
  "_geoloc": {
    "lat": 51.1879885909,
    "lng": -0.6079002194
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Godalming_Wharf_-_geograph.org.uk_-_511093.jpg",
      "title": "Maurice Pullin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Godalming Wharf. Trade in Godalming was greatly enhanced when, in the spring of 1764, the Godalming Navigation was opened, connecting the town to the already existing Wey Navigation at Guildford. The Wharf became a hive of activity as bulk goods such as timber were loaded on to barges there. Although this commercial trade has now ended, Godalming Wharf is today the most southerly navigable point on the main canal and river network of England and is very popular with users of pleasure craft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/The_Market_Hall%2C_Godalming_-_geograph.org.uk_-_148806.jpg",
      "title": "Humphrey Bolton / The Market Hall, Godalming",
      "caption": "The Market Hall, Godalming. Built in 1814 by John Perry, a local man and paid for by public subscription according to the plaque on the wall. The open arcaded ground floor was re-opened in 1955 after a long period of use as a Victorian lumber room and public convenience."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/River_Wey_at_Godalming_-_geograph.org.uk_-_146006.jpg",
      "title": "Humphrey Bolton / River Wey at Godalming",
      "caption": "River Wey at Godalming. At SU973441, seen from a small park next to the library. Farncombe on its hill is in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Church_of_St_Peter_and_St_Paul%2C_Godalming_-_geograph.org.uk_-_148787.jpg/256px-Church_of_St_Peter_and_St_Paul%2C_Godalming_-_geograph.org.uk_-_148787.jpg",
      "title": "Humphrey Bolton / Church of St Peter and St Paul, Godalming",
      "caption": "Church of St Peter and St Paul, Godalming. There are fragments of Saxon work, and the Normans built the central tower, on which is a lead spire of (probably) the 13C. This has a number of shallow V-sections formed from lead plates. The range of buildings in front of the tower are the south aisle, transept and south chapel, all added in the 12C and 13C. The church was extensively restored in the 19C."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/River_Wey_at_Godalming_-_geograph.org.uk_-_827225.jpg",
      "title": "Jonathan Billinger / River Wey at Godalming",
      "caption": "River Wey at Godalming. A tranquil scene adjacent to the Lammas Lands which separate Godalming town from Frith Hill and Farncombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/High_Street%2C_Godalming_-_geograph.org.uk_-_1378865.jpg",
      "title": "Colin Smith / High Street, Godalming",
      "caption": "High Street, Godalming. The modern road which by-passes the High Street has resulted in the latter being a pleasant street to walk in, largely devoid of traffic. There is also an interesting mix of architecture styles above the ground floor frontages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Pewley_Down_-_geograph.org.uk_-_625462.jpg",
      "title": "Colin Smith / Pewley Down",
      "caption": "Pewley Down, just north of the town. Seen from Tyting Farm looking westwards, this is the last hilltop on the North Downs ridge before it descends to the Wey Gap. The hilltop is taken over by upmarket houses. The fields on the scarp slope are farmed and the footpaths between them are well used by ramblers and riders."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/St_Martha%27s_Church_on_the_Hill_-_geograph.org.uk_-_1095585.jpg",
      "title": "John Godwin / St Martha's Church on the Hill",
      "caption": "St Martha's Church on the Hill"
    }
  ],
  "distance_km": 26.0,
  "description": "In the town there are many historic buildings with timer framed 16th century houses. This circular walk around the town visits several of the walking highlights of the area. You'll visit the River Wey Canal, Pewley Down, St Martha's Hill, Chilworth Gunpowder Mills, Blackheath Common and Winkworth Arboretum. The route makes use of three of the waymarked long distance trails which run through the area. You'll follow sections of the North Downs Way, Downs Link and Wey South Path as you make your way through the area. The walk starts just east of the train station on the canal and follows the Wey South Path north past Lammass Lands, Catteshall, Broadwater Park, Peasmarsh, Broadford and Shalford. On the outskirts of Guildford you pick up the North Downs way and head east before turning north east to climb to the viewpoint at Pewley Down. There's some nice views over the North Downs from this elevated spot near the town. The route then descends east to pick up the North Downs Way and follow it to St Martha's Hill. There's more great views here from the 574 feet (175 m) hill summit. The route then heads south toward Chilworth Manor where you can visit the historic Chilworth Gunpowder Mills. There are good trails here with information boards detailing the history of the now ruined mills. The site was an important supplier of gunpowder to the Government during the 17th, 18th and 19th centuries. From Chilworth you follow the Downs Link south to visit the expansive Blackheath Common and Forest. There's miles of trails here which are well used by both cyclists and walkers. On the common you will find a nice mix of lowland heathland, woodland and acid grassland. From the common you head west along a section of the waymarked Downs Link to Great Tangley Farm and Wonersh Common. Follow the trail south west and it will take you past Chinthurst Hill where there's a lovely nature reserve run by the Surrey Wildlife Trust. There's a folly and viewpoint at the top if you'd like to take a slight detour from the route. Near the hill you will pick up the Wey South Path again and follow it south east with views of the Wey and Arun Junction Canal. At Rookshill Farm you turn west to Thorncombe Street where you will pass the Winkworth Arboretum. The site is well worth a visit with surfaced footpaths, landscaped lakes, bluebell woods and over 1,000 different shrubs and trees to see. From Thorncombe Street the final section takes you north past Munstead Heath to return to Godalming.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Star is an historic pub of some note in the town. The building dates back to the 1700s and includes and charming 'Olde Worlde' interior. They serve very good food which you can enjoy in a lovely garden area on warmer days. You can find them at 17 Church Street with postcode GU7 1EL for your sat navs. The Inn on the Lake is another good option. There's a particularly lovely garden here and a great Sunday roast. You can find them on the Ockford Road at postcode GU7 1RH. On the route you could stop off at the historic The Grantley Arms in Wonersh. It's a delightful half-timbered pub dating back over 500 years. There's a cosy interior with a blazing real fire for colder weather. Outside there's a lovely heated garden area which is good for all seasons. They serve high quality food and can be found at postcode GU5 0PE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area on the route is ideal for dog walking with its abundance of woodland trails. The Inn on the Lake and The Grantley Arms mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The River Wey Navigation starts in the town and will take you along the canal towpath to Weybridge on the River Thames. It's a lovely easy cycle or walk to do from the town, taking you past several pretty villages and gardens. A few miles south of the town you can visit the neighbouring settlement of Chiddingfold. It's a place of some note with a pretty village green, a beautiful landscaped open garden and one of the oldest pubs in England. Also nearby is the National Trust's Hydon's Ball and Hydon Heath where there are some fine woodland trails and another viewpoint. In Elstead you'll find the Thursley National Nature Reserve, another local highlight worthy of consideration. The reserve has a network of footpaths and is considered one of the finest areas in the country for wildlife. For more walking ideas in the area see the Surrey Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4t0AwgNo1V0",
  "postcode": "GU7 3DU",
  "district": "Waverley",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Godalming United Church, Bridge Road, Farncombe, Godalming, Waverley, Surrey, England, GU7 3DU, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}