{
  "created_at": "2025-01-06T00:17:18.286715+00:00",
  "objectID": "cd2892de3bb88a2e954a5a1e783ddf17",
  "ref": "foel-cwmcerwyn-walking-route",
  "title": "Foel Cwmcerwyn Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/19/Trig_point_and_cairn_on_Foel_Cwmcerwyn_-_geograph.org.uk_-_61742.jpg",
  "nearby": [
    {
      "description": "Preseli Hills Golden Road",
      "objectID": "5e196dcea8877c3280ce4e837a046270",
      "ref": "preseli-hills-golden-road-walking-route"
    },
    {
      "description": "Pentre Ifan",
      "objectID": "eabad2547faa8d2c95e0c29f62d9badb",
      "ref": "pentre-ifan-walking-route"
    },
    {
      "description": "Gors Fawr Stone Circle",
      "objectID": "c4a7bb1d1caa3313a2c2fa2ea39a1c1d",
      "ref": "gors-fawr-stone-circle-walking-route"
    },
    {
      "description": "Rosebush Quarry",
      "objectID": "08fe1f955b1e838a4f76581c94b98f81",
      "ref": "rosebush-quarry-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cd2892de3bb88a2e954a5a1e783ddf17.gpx",
  "_geoloc": {
    "lat": 51.9547983714,
    "lng": -4.8030446882
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Trig_point_and_cairn_on_Foel_Cwmcerwyn_-_geograph.org.uk_-_61742.jpg",
      "title": "Nigel Davies / Trig point and cairn on Foel Cwmcerwyn",
      "caption": "Trig point and cairn on Foel Cwmcerwyn. Cairn and trig on summit provide a point of interest on the mountain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Foel_Cwmcerwyn._-_geograph.org.uk_-_27991.jpg",
      "title": "Richard Webb / Foel Cwmcerwyn.",
      "caption": "Foel Cwmcerwyn. Highest point in Pembrokeshire (536m), and the Preseli range. Looking south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Easterly_view%2C_from_Foel_Cwmcerwyn_-_geograph.org.uk_-_1001053.jpg",
      "title": "Roger Cornfoot / Easterly view, from Foel Cwmcerwyn",
      "caption": "Easterly view, from Foel Cwmcerwyn Looking towards Carn Sian."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Foel_Cwmcerwyn_from_Foel_Feddau_-_geograph.org.uk_-_1262914.jpg",
      "title": "Rob Bainbridge / Foel Cwmcerwyn from Foel Feddau",
      "caption": "Foel Cwmcerwyn from Foel Feddau"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Welsh_bog_by_Pantmaenog_Forest_-_geograph.org.uk_-_2586226.jpg/512px-Welsh_bog_by_Pantmaenog_Forest_-_geograph.org.uk_-_2586226.jpg",
      "title": "Welsh bog by Pantmaenog Forest by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Welsh bog by Pantmaenog Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Path_below_Pen_Cisty_in_the_Preseli_Hills_-_geograph.org.uk_-_3447750.jpg",
      "title": "Path below Pen Cisty in the Preseli Hills by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path below Pen Cisty in the Preseli Hills"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Edge_of_Preseli_forest_-_geograph.org.uk_-_1913653.jpg/512px-Edge_of_Preseli_forest_-_geograph.org.uk_-_1913653.jpg",
      "title": "Edge of Preseli forest by Rudi Winter, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Edge of Preseli forest just east of the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Car_park_at_Bwlch-gwynt_-_geograph.org.uk_-_930746.jpg",
      "title": "Dylan Moore / Car park at Bwlch-gwynt",
      "caption": "Car park at Bwlch-gwynt. You can start the walk from this roadside car park."
    }
  ],
  "distance_km": 6.0,
  "description": "Climb to the highest point in the Presili Hills on this challenging walk in Pembrokeshire. The hill stands at 1759 feet and commands wonderful views of the surrounding area. The walk starts at the Bwlch Gwynt car park on the B4329 and follows a woodland trail through the northern end of the Pantmeanog Forest before picking up a mountain track to the Foel Cwmcerwyn summit. Here you will find a trig point, a number of cairns and fabulous views. You can also reach the hill from the little village of Rosebush in the south-west. From the same car park you can also easily climb Foel Eryr. It's only about a half a mile climb from Bwlch Gwynt and makes a nice extension to the walk. Alternatively you could extend your walk by following the wonderful Preseli Hills Golden Road east to visit the Iron Age Hillfort at Foel Drygarn near Crymych.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the nearby village of Rosebush there's the noteworthy Tafarn Sinc for some post walk refreshments. The building dates back to 1876 and, unusually for pubs, is constructed of corrugated metal. It originally served the adjacent Rosebush railway station on the Maenclochog Railway, which opened in 1876. Both were built as part of the development of the slate quarry. In 2017, after the owners decided to sell, it was bought by a community group of local residents and other shareholders. The scheme was promoted by actor Rhys Ifans, who was born locally. The pub has a splendidly authentic interior with sawdust on the floorboards and lots of railway memorabilia. Outside there's a lovely garden area with views of the surrounding countryside. You can find them at postcode SA66 7QU for your sat navs. The inn is dog friendly and has a car parking area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There is an alternative route up to Foel Cwmcerwyn from Rosebush village if you prefer to start from there. You can follow a trail north east to the hill top from here. See the video below for more details. Just north of the village there's also Rosebush Quarry to explore. The site's unusual landscape includes hidden pools, an arched underground tunnel, steep cliff faces, heath, grassland and pine trees. Just to the west there's a circular walk to Foel Eryr. There's a Bronze Age cairn and a toposcope at the 468 metre high summit of this worthy hill. Just north of the parking area at Bwlch Gwynt are the Waun Mawn Standing Stones. The Neolithic stone circle may have supplied stones to Stonehenge supporting a hypothesis of migration of both people and animals from Wales to Stonehenge. There are more fine views from the top of the hill next to the atmospheric stones. A little further to the north there's more ancient history at Pentre Ifan. Here you will find the most well preserved neolithic dolmen in Wales. To the south east there's the Gors Fawr Stone Circle which dates from the late Neolithic or early Bronze Age. The fascinating ancient site includes fine views and wildlife including Red Kites. The stones can be found just to the south of the nearby village of Mynachlog-dd."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_VpRb19jp04",
  "county": "Sir Benfro - Pembrokeshire",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}