{
  "objectID": "cd3e914b9232b4a23b0d9a54eca184df",
  "created_at": "2024-12-19T07:30:28.920265+00:00",
  "ref": "blagdon-lake-walking-route",
  "title": "Blagdon Lake Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/17/Blagdon_Lake_-_geograph.org.uk_-_162078.jpg",
  "nearby": [
    {
      "description": "Chew Valley Lake",
      "objectID": "da3bcef561cd96e3cc03d51021886db7",
      "ref": "chew-valley-lake-walking-route"
    },
    {
      "description": "Two Rivers Way",
      "objectID": "9b0267da75d536c948959460dc124a94",
      "ref": "two-rivers-way-walking-route"
    },
    {
      "description": "Chew Magna",
      "objectID": "ee10a4743bfde84d05321244549d8a7d",
      "ref": "chew-magna-walking-route"
    },
    {
      "description": "Burrington Combe",
      "objectID": "6f87a804751abd58f5d3d2d4ae96d818",
      "ref": "burrington-combe-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cd3e914b9232b4a23b0d9a54eca184df.gpx",
  "_geoloc": {
    "lat": 51.346771168,
    "lng": -2.702744908
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Blagdon_Lake_-_geograph.org.uk_-_162078.jpg",
      "title": "Adrian and Janet Quantock / Blagdon Lake, via Wikimedia Commons",
      "caption": "Blagdon Lake 1. The lake was created by Bristol Water when it dammed the River Yeo. It was constructed from 1898 to 1905.  It was originally called the Yeo reservoir. The reservoir is renowned for its rich biodiversity. Managed by Bristol Water, the lake provides drinking water but is also a Site of Special Scientific Interest (SSSI) due to its importance for wildlife."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Blagdon_Lake_%28geograph_2623620%29.jpg",
      "title": "David Gearing / Blagdon Lake, via Wikimedia Commons",
      "caption": "Blagdon Lake 2. The habitats surrounding the lake include wetlands, grasslands, and woodlands, each supporting diverse plant life. Wetland vegetation along the shoreline includes reedbeds dominated by common reed (Phragmites australis), bulrush (Typha latifolia), and yellow flag iris (Iris pseudacorus). These plants help stabilise the lake's edges and provide habitat for birds and insects. In grassland areas, wildflowers such as buttercups, red clover, and oxeye daisies flourish, especially in summer. Woodland areas around the lake are home to trees like oak, ash, and hazel, alongside understorey plants like bluebells in spring and ferns throughout the year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Blagdon_Lake_spillway_%28geograph_2433727%29.jpg/512px-Blagdon_Lake_spillway_%28geograph_2433727%29.jpg",
      "title": "Trevor Rickard / Blagdon Lake spillway, via Wikimedia Commons",
      "caption": "Blagdon Lake spillway. The lake hosts numerous waterfowl, including tufted ducks, pochards, and great crested grebes. In winter, you can spot wigeon, teal, and shoveler ducks. Raptors like peregrine falcons and buzzards are often seen hunting over the area. The lake is especially famous for its population of herons, cormorants, and kingfishers. The rich plant life also attracts numerous insects, including dragonflies and damselflies that hover over the water in summer. Butterflies like small tortoiseshells and peacocks are often seen in the grasslands and woodlands."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Pump_House%2C_Blagdon_Lake._-_panoramio.jpg/512px-Pump_House%2C_Blagdon_Lake._-_panoramio.jpg",
      "title": "Robert Powell [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Pump House, Blagdon Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Blagdon_Lake_-_geograph.org.uk_-_520882.jpg",
      "title": "Geoff Lees / Blagdon Lake",
      "caption": "View from the New Inn car park in summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Blagdon_Pumping_Station._-_panoramio.jpg/512px-Blagdon_Pumping_Station._-_panoramio.jpg",
      "title": "Robert Powell, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Blagdon Pumping Station. This area includes a Visitor Centre with science and environment exhibits and hands-on displays. There is also a picnic area and a nature walking trail. Built in the early 1900s, it was designed as part of the infrastructure to support the water supply system managed by Bristol Water. The Pump House originally housed steam-powered engines that pumped water from the reservoir into the surrounding network for distribution to nearby areas, including Bristol. It is a striking example of Edwardian industrial architecture. Constructed with local stone, it features elegant design elements that blend functionality with aesthetic appeal. The building reflects the period's commitment to making even utilitarian structures visually appealing. Its tall chimney, once integral to the steam engines, is a distinctive landmark visible from across the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/The_tower_of_Blagdon_Church%2C_with_the_lake_in_background_%28geograph_2211583%29.jpg/512px-The_tower_of_Blagdon_Church%2C_with_the_lake_in_background_%28geograph_2211583%29.jpg",
      "title": "C P Smith / The tower of Blagdon Church, with the lake in background",
      "caption": "The tower of Blagdon Church, with the lake in background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Forecourt_of_the_Live_And_Let_Die_pub_next_to_the_A368_in_Blagdon_-_geograph.org.uk_-_2623614.jpg",
      "title": "Forecourt of the Live And Let Die pub next to the A368 in Blagdon by David Gearing, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Forecourt of the Live And Let Die pub next to the A368 in Blagdon village."
    }
  ],
  "distance_km": 1.5,
  "description": "Along the northern end of this large lake you'll find a lovely footpath running along the lake shore and through the lakeside woodland. On open days you can also visit the Discovery Wood where you can see roe deer, badgers, foxes and otters. There are nesting boxes for owls, tits and kestrels too. On the nature trail there are wildflower meadows with Green winged orchid, knapweeds, white ox-eye daisies and pink devils bit. There's also the Blagdon Pumping Station and Visitor Centre with science and environment exhibits, a picnic area and views of the impressive dam. You could also start your walk from the village of Blagdon and pick up a footpath heading east from the village to the lake. This trail will take you past Holt Farm to the southern edge of the lake. You can enjoy a long circular walk around the lake using country lanes and other public footpaths. If you would like to continue your walking in the area then you could head to the nearby Chew Valley Lake where there is a lovely circular nature trail to try. You could follow the waymarked Two Rivers Way east to visit the lake and the attractive village of Chew Magna. The climb to Beacon Batch on Black Down hill starts from the car park at nearby Burrington Combe. The hill is the highest point in the Mendips and provides great views over the lake from its elevated position.",
  "video_url": "https://www.youtube.com/embed/0v0Cf2j4Yr4",
  "district": "Butcombe",
  "county": "North Somerset",
  "region": "South West",
  "country": "England"
}