{
  "created_at": "2025-01-05T23:43:59.341635+00:00",
  "objectID": "cd9c5f6834f5f9d151843fbe0dfb5df2",
  "ref": "gargrave-walking-route",
  "title": "Gargrave Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/River_Aire_at_Gargrave_-_geograph.org.uk_-_1947372.jpg/512px-River_Aire_at_Gargrave_-_geograph.org.uk_-_1947372.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cd9c5f6834f5f9d151843fbe0dfb5df2.gpx",
  "_geoloc": {
    "lat": 53.9829817381,
    "lng": -2.1059389638
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/River_Aire_at_Gargrave_-_geograph.org.uk_-_1947372.jpg/512px-River_Aire_at_Gargrave_-_geograph.org.uk_-_1947372.jpg",
      "title": "River Aire at Gargrave by BC, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Aire at Gargrave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Gargrave_Bridge_-_geograph.org.uk_-_512824.jpg",
      "title": "Donnylad / Gargrave Bridge",
      "caption": "Gargrave Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Bus_stop_in_Gargrave_-_geograph.org.uk_-_2122431.jpg",
      "title": "Bus stop in Gargrave by Andrew Abbott, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bus stop in Gargrave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Lock_32_at_Gargrave_-_geograph.org.uk_-_2122380.jpg",
      "title": "Lock 32 at Gargrave by Andrew Abbott, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lock 32 at Gargrave. During the 1820s, Gargrave's primary industry was cotton manufacturing. Alongside the canal, numerous warehouses were erected to support this industry. The village's population during this period was 972, and it was home to several public houses, including notable ones such as the Masons Arms and the Swan Inn. These establishments played a significant role in the social life of the village and its industrial landscape during that era."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/St_Andrew%27s_Church%2C_Gargrave_-_geograph.org.uk_-_2572951.jpg/512px-St_Andrew%27s_Church%2C_Gargrave_-_geograph.org.uk_-_2572951.jpg",
      "title": "St Andrew's Church, Gargrave by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Andrew's Church. The parish church is dedicated to St. Andrew and was constructed in the year 1521. It underwent a restoration in 1852, although historical records suggest the presence of a church on this site long before this construction. Notably, one of the early rectors associated with the church was Robert of Newminster, who was born in the parish around the year 1100. A notable historical figure, former Chancellor of the Exchequer Iain Macleod, finds his final resting place in the south-east corner of the churchyard. This adds a touch of historical significance to the church and its surroundings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Masons_Arms%2C_Gargrave_-_geograph.org.uk_-_2967380.jpg",
      "title": "Masons Arms, Gargrave by Ian S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Masons Arms"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Gargrave_Station_-_geograph.org.uk_-_4807381.jpg",
      "title": "Gargrave Station by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gargrave Rail Station. The station was opened in 1849 and was established by the \"Little\" North Western Railway. This railway was subsequently acquired by the Midland Railway. The station maintains its historical character with the original stone shelters still present on each platform. However, the principal wooden station building has since found private usage, signifying its adaptation for other purposes in more recent times."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/War_Memorial%2C_Gargrave_-_geograph.org.uk_-_2790320.jpg/512px-War_Memorial%2C_Gargrave_-_geograph.org.uk_-_2790320.jpg",
      "title": "War Memorial, Gargrave by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "War Memorial and green"
    }
  ],
  "distance_km": 9.5,
  "description": "This circular walk explores the countryside and canals surrounding this popular village in the Yorkshire Dales. The route makes use of the Pennine Way and the towpath of the Leeds and Liverpool Canal to create a 6 mile round walk. It's a fairly gentle route with little climbing and splendid views of the surrounding Yorkshire Dales hills. You can start and end the walk from the centre of the village which is accessible by train or bus. The area around Gargrave is fantastic for walking and cycling. You could head to Barnoldswick by walking south along the canal or visit the splendid Malham Tarn Estate by heading north along the Pennine Way. You can also enjoy walk along the River Aire by following the Airedale Way which passes through the village. On our Skipton Canal Walk you can follow a lovely section of the Leeds and Liverpool to nearby Skipton.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Masons is a charming village pub located in a tranquil residential area across from St. Andrew's church and in close proximity to the railway station and the picturesque River Aire. The traditional establishment is known for its welcoming ambiance and features low oak-beamed ceilings adorned with horse brasses, creating a cosy and inviting atmosphere that appeals to both those looking for a drink or a meal. It is home to various local sports teams, adding to its community appeal. Additionally, there's a crown-green bowling green situated behind the pub, providing an opportunity for outdoor recreation. For those who enjoy a mental challenge, the pub hosts quiz nights on Sundays during the winter months, offering an entertaining pastime for patrons. It's also worth noting that The Masons is a member of Timothy Taylor's Champion Club, a recognition that underscores its commitment to providing quality beverages and service. You can find them at postcode BD23 3NL for your sat navs. The pub is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SK7TSJOLRLM?si=hhnUkqCUFWD02sYF",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Skipton Road, Gargrave, North Yorkshire, York and North Yorkshire, England, BD23 3LX, United Kingdom",
  "postcode": "BD23 3LX",
  "district": "Gargrave",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "rural"
  ],
  "points_of_interest": [
    "views",
    "natural landscapes"
  ],
  "facilities": [
    "car park",
    "accessible by train/bus"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}