{
  "created_at": "2025-01-06T04:34:01.484857+00:00",
  "objectID": "cdca9aea7e5cf4937525fdb2040b377c",
  "ref": "branscombe-to-beer-walking-route",
  "title": "Branscombe to Beer Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Branscombe_Mouth_-_geograph.org.uk_-_231469.jpg",
  "nearby": [
    {
      "description": "Seaton Marshes",
      "objectID": "3a1370854b11a912bf7da47cf50ff98b",
      "ref": "seaton-marshes-walking-route"
    },
    {
      "description": "Lyme Regis to Seaton Undercliff Walk",
      "objectID": "739b76d283016a4fd013ecf36f5f88bf",
      "ref": "lyme-regis-to-seaton-undercliff-walk-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Sidmouth to Branscombe Walk",
      "objectID": "96fba3428ffe517c151327908d9851c3",
      "ref": "sidmouth-to-branscombe-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cdca9aea7e5cf4937525fdb2040b377c.gpx",
  "_geoloc": {
    "lat": 50.692458457,
    "lng": -3.1369438389
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Branscombe_Mouth_-_geograph.org.uk_-_231469.jpg",
      "title": "Katy Walters [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A dog on the path near Branscombe Mouth. Here you'll find Branscombe Mouth Beach, a shingle beach with rock pools forming part of the East Devon and Dorset Jurassic Coast. To either side of the beach, the coast rises steeply to cliffs owned by the National Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Black_anchor_commemorates_the_Napoli_incident._-_panoramio.jpg/512px-Black_anchor_commemorates_the_Napoli_incident._-_panoramio.jpg",
      "title": "grumpylumixuser [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "This striking black anchor commemorates the Napoli incident. The anchor is from the MSC Napoli - the cargo ship beached off Branscombe's World Heritage Coast during 2007. It is a permanent memento of the ship's extended presence in the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Branscombe_geograph-4100560-by-Ben-Brooksbank.jpg/512px-Branscombe_geograph-4100560-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Branscombe view. Looking eastward on the shingle beach to Beer Head. The area is rich in biodiversity. In the spring and summer months, the coastal path is adorned with wildflowers such as thrift, sea campion, and wild carrot. Along the cliffs and wooded areas, you may encounter songbirds such as song thrushes, blackbirds, blackcaps, chiffchaffs, robins, wrens, and goldfinches."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Cliffs_above_Hooken_landslip_-_geograph.org.uk_-_242208.jpg",
      "title": "Derek Harper [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cliffs above Hooken landslip. Chalk overlying Upper Greensand in these cliffs east of Branscombe, with vegetation below on the landslip. Taken from the footpath above Hooken Beach, just to the west of the point where it enters the landslip. Along the route, walkers can observe a transition from Triassic red sandstone near Branscombe to Cretaceous chalk cliffs approaching Beer. This geological diversity is evident in formations such as the Hooken Cliffs, resulting from historic landslides that have created unique landscapes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Beer_Cliffs_from_Seaton_Seafront_-_geograph.org.uk_-_308118.jpg",
      "title": "Tony Atkin [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Beer Cliffs from Seaton Seafront. The cliffs provide nesting sites for peregrine falcons, whose distinctive calls can often be heard echoing along the coastline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Gull_and_boats%2C_Beer_-_geograph.org.uk_-_231511.jpg/256px-Gull_and_boats%2C_Beer_-_geograph.org.uk_-_231511.jpg",
      "title": "Katy Walters [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Gull and boats, Beer. The picture postcard village of Beer sits in a lovely spot on Lyme Bay. The shingle beach is flanked by white chalk cliffs and still boasts a small fleet of working fishing boats still bringing in their daily catches of mackerel. Above the beach there's the beautiful Jubilee Gardens. The gardens were created by the people of Beer to honour Queen Victoria’s Diamond Jubilee."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Gate_on_the_South_West_Coast_Path_-_geograph.org.uk_-_231500.jpg",
      "title": "Katy Walters [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Gate on the South West Coast Path. Here the SWCP leaves the clifftop to descend to Branscombe beach via the Hooken Landslide. During migration periods, the area serves as a stopover for species like tree pipits, yellow wagtails, wheatears, whinchats, and redstarts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Branscombe_Mouth_from_on_high_-_geograph.org.uk_-_231477.jpg",
      "title": "Katy Walters [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Branscombe Mouth from on high. More of this spread-out village is visible to the upper right."
    }
  ],
  "distance_km": 5.0,
  "description": "This is a popular coastal walk between the Devon villages of Branscombe and Beer. It takes you along the South West Coast Path with fantastic cliff tops views. Highlights on the walk include a visit to the National Trust's Manor Mill, the only remaining working mill in Branscombe. You'll also pass the stunning Hooken Cliffs, a Jurassic Coast UNESCO World Heritage Site. A slump in the Chalk cliffs in 1790 separated a 10-acre tract of land, now a wooded and sheltered habitat with chalk pinnacles on the seaward side. It's reached via a steep footpath leading from the clifftop to Branscombe Beach. The thick vegetation in the area is also a haven for wildlife. The walk starts at the car park in Branscombe, where there is a splendid old thatched forge where you can watch blacksmiths at work. There's also and old bakery which now serves as a tea room. After leaving the village you pass Manor Mill and head towards Branscombe Mouth on the coast. Here you pick up the coast path to take you past Hooken Beach and Hooken Cliffs, before arriving at Beer Head. Here you turn north past Pound's Pool, Arrat's Hil and Big Ledge. The route finishes in the pretty seaside village of Beer, where there are lovely views over Seaton Bay and Lyme Bay with a nice shingle beach and lots of fishing boats. Apart from a steep section at the start, the walk is fairly flat and takes place on good paths. It's about a 3 mile walk, so 6 miles there and back. To extend your walking in the area you can continue along the coast path to Seaton where you can pick up the Lyme Regis to Seaton Undercliff Walk. This will take you along the coast from Devon into Dorset. If you enjoy wildlife you can head to the nearby Seaton Marshes where there is a splendid tramway walk with lots of wildlife to look out for. Heading west takes you along the coast to Sidmouth on the Sidmouth to Beer Walk. It's a splendid undulating section of the path with Exmoor Ponies and more interesting geological features.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Anchor Inn in Beer is a nice place for some post walk refreshments. The main draw here is a lovely garden area with views of the coast. It's a good place to relax with a drink on a summer day. The inn is also dog friendly with water bowls placed outside. You can find the pub on Fore Street with a postcode of EX12 3ET for your sat navs. In Branscombe there's the Fountain Head. It dates all the way back to the 14th century and has a charming interior with real log fires. There's also outdoor seating with nice views of the surrounding countryside. They have a good selection local beers and a good menu if you are peckish. You can find the pub at postcode EX12 3BG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a nice walk to do with your dog and the Fountain Head pub mentioned above is also dog friendly. They also sell dog biscuits if your pet is feeling hungry."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Continue along the coast on the Seaton to Beer Walk and you can pick up the excellent Seaton Tramway. This popular attraction operates narrow gauge heritage trams between Seaton, Colyford and Colyton. There's fine views of the Axe Valley and the Axe Estuary on this scenic attraction. At the other end of the tramway you can try the circular Colyton Walk which takes you through the River Coly Valley on section of the East Devon Way long distance trail. You can also reach Branscombe from the nearby town of Sidmouth on the Sidmouth to Branscombe Walk. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nX2g8pcQvJU",
  "postcode": "EX12 3AU",
  "district": "East Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Street, Branscombe, East Devon, Devon, England, EX12 3AU, United Kingdom",
  "state": "England"
}