{
  "created_at": "2025-01-06T03:00:58.371291+00:00",
  "objectID": "cdca0d3533137d7e8241b41b0f2d56ef",
  "ref": "shearwater-lake-walking-route",
  "title": "Shearwater Lake Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a3/A_quiet_day_at_Shear_Water._-_geograph.org.uk_-_56554.jpg",
  "nearby": [
    {
      "description": "Heaven's Gate Longleat",
      "objectID": "afe87c050ed394dc3d6106ba2f3e5155",
      "ref": "heavens-gate-longleat-walking-route"
    },
    {
      "description": "Cley Hill",
      "objectID": "f9e00a5a027fca7279f1ee6f84df2b21",
      "ref": "cley-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cdca0d3533137d7e8241b41b0f2d56ef.gpx",
  "_geoloc": {
    "lat": 51.1774864199,
    "lng": -2.2103487573
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/A_quiet_day_at_Shear_Water._-_geograph.org.uk_-_56554.jpg",
      "title": "Phil Williams / A quiet day at Shear Water., via Wikimedia Commons",
      "caption": "A quiet day at Shear Water. This popular spot on the Longleat Estate can get very busy. The road leads to the sailing club boathouse, visible on the far bank at right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/A_winter%27s_day_Shearwater_-_geograph.org.uk_-_89624.jpg",
      "title": "Dave Imm / A winter's day Shearwater, via Wikimedia Commons",
      "caption": "A winter's day Shearwater"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/The_shore_of_Shear_Water_-_geograph.org.uk_-_2439408.jpg",
      "title": "The shore of Shear Water by David Gearing, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A spot of summer fishing on the shore of Shear Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Shear_Water_-_geograph.org.uk_-_56552.jpg",
      "title": "Phil Williams / Shear Water",
      "caption": "Entrance and sign on the eastern side of the lake."
    }
  ],
  "distance_km": 2.5,
  "description": "Enjoy an easy waterside walk along this pretty lake on the Longleat Estate. The lake is located near Warminster and has a nice walking trail running alongside the 37 acre lake. It's a lovely area for a picnic with the lake surrounded by attractive flora and fauna. Look out for little sailboats and various wildfowl on the lake and fish in the water. There are miles of woodland trails surrounding the lake so you can easily extend your walk here. One option would be to head west to Heaven's Gate for great views over the Longleat Estate. There is a car park right next to the lake so access is easy. You can also enjoy refreshments at the lakeside cafe. If you would like to continue your walking in the area then you could climb the nearby Cley Hill and enjoy wonderful views over West Wiltshire and Somerset.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The George Inn at the nearby village of Longbridge Deverill after your walk. The main attraction here is the lovely riverside garden, located next to the River Wylye. You can find it at postcode BA12 7DG, less than a mile south east of the lake. Also consider the Rose & Crown pub in Warminster. There's bar games, a good menu and a nice beer garden to sit out in during the summer months here. You can find it at 57 East St, with postcode: BA12 9BZ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east to Warminster you can pick up the Imber Range Perimeter Path. The circular route takes you around the MOD's Imber Range on Salisbury Plain. It includes a climb to the Battlesbury Hill Iron Age fort where there are some excellent views over the region."
    }
  ],
  "video_url": "https://www.youtube.com/embed/T8dGwWwn_NY",
  "postcode": "BA12 8AE",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}