{
  "objectID": "ce276044db31067704ba6aedc5049c23",
  "created_at": "2024-12-18T09:31:51.484357+00:00",
  "ref": "harrow-weald-common-walking-route",
  "title": "Harrow Weald Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Gilbert%27s_lake.jpg/512px-Gilbert%27s_lake.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/604EDF4DCE7FDE05802580A000076317/$FILE/Harrow Weald Common.gpx",
  "_geoloc": {
    "lat": 51.6206548731,
    "lng": -0.3499608548
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Gilbert%27s_lake.jpg/512px-Gilbert%27s_lake.jpg",
      "title": "Jack1956 [CC0], via Wikimedia Commons",
      "caption": "Gilbert's lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Harrow_Weald_Common_-_geograph.org.uk_-_1280841.jpg",
      "title": "David Kemp [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Woodland path on Harrow Weald Common. Taken on the London Loop Footpath looking south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Grim%27s_Dyke_Hotel%2C_from_the_garden._-_geograph.org.uk_-_311183.jpg",
      "title": "Christine Matthews / Grim's Dyke Hotel,  from the garden.",
      "caption": "Grim's Dyke Hotel, from the garden. Grim's Dyke is most famous for its association with the librettist, Sir William Schwenck Gilbert, the writing half of the Gilbert & Sullivan partnership, who lived in the house from 1890 to his death in 1911.\nThe name Grim's Dyke comes from an ancient defensive earthwork which runs from Pinner Hill to Bentley Priory.\nThe House was built there in 1870 for the Victorian Painter Frederick Goodall, who had bought 100 acres of land at Harrow Weald in 1856 but was unable to build for 12 years until the expiry of a lease. During that time he landscaped the area and planted trees, setting aside 30 acres parallel to the ancient earthwork for the house and gardens. Work started on the house in 1870 and was completed in 1872.\nThe house was designed by Norman Shaw, a well-known architect of the time who also designed the New Scotland Yard building.\nThe Gilberts bought the property in 1890. During his 21 years there, Gilbert made a number of changes to the house and grounds.\nHe planted trees and rhododendrons, developed the farm which was part of the estate, and built a number of greenhouses beyond the moat and over the dyke. There was a kitchen garden, orchard and vinery and, for Lady Gilbert who was a keen gardener, a sunken rose garden was constructed on the terrace above the moat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Garden_of_Grims_Dyke_Hotel%2C_Hatch_End_%28geograph_5359324%29.jpg/512px-Garden_of_Grims_Dyke_Hotel%2C_Hatch_End_%28geograph_5359324%29.jpg",
      "title": "Christine Matthews / Garden of Grim's Dyke Hotel, Hatch End",
      "caption": "Garden of Grims Dyke Hotel, Hatch End. Gilbert's greatest joy was the large lake he had excavated to the south of the house. It had an island in the middle and a changing hut and boathouse on the shore. Every day in the summer he would bathe there - a habit which eventually cost him his life.\nOn 29th May 1911 Gilbert invited two local girls to swim in the lake. He died attempting to help one of them when she got into difficulties.\nGilbert seems to have lived very happily at Grim's Dyke surrounded by animals and pets, of which there were a great number, many wandering freely about the house. He worked every day in the library where he could look out through the French windows onto the croquet lawn.\nLady Gilbert remained in the house until her death in 1936. Between 1963 and 1968 the house was used as a film and television location.\nIn 1970, when it was converted into a hotel, Grim's Dyke was designated a building of special architectural and historical interest. The present owners took over the property in 1996 when the Grade II listed building was extensively restored and refurbished in the country house style."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/The_London_Loop_on_Harrow_Weald_Common_-_geograph.org.uk_-_2410326.jpg/512px-The_London_Loop_on_Harrow_Weald_Common_-_geograph.org.uk_-_2410326.jpg",
      "title": "The London Loop on Harrow Weald Common by Des Blenkinsopp, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The London Loop on Harrow Weald Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Harrow_Weald_Common%2C_The_Kiln_Triangulation_Pillar_-_geograph.org.uk_-_2454161.jpg",
      "title": "Harrow Weald Common: The Kiln Triangulation Pillar by Nigel Cox, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Harrow Weald Common, The Kiln Triangulation Pillar"
    }
  ],
  "distance_km": 2.5,
  "description": "This area of common land in Harrow has some nice footpaths to try. There's 18 hectares to explore with woodland, heath and pasture. The common has a car park off Old Redding Road where you can pick up the trails. Head west and you will soon come to Gilberts Lake and Gilberts Orchard. You'll also pass Grim's Dyke, an ancient earthwork which runs for three miles between the common and Pinner Green. From the high points in the park there are nice views of Central London and the Chilterns. The Harrow Viewpoint on Old Redding is a popular spot and a great place to soak in the extensive views. The common is also great for interesting flora and fauna. Look out for magnificent redwoods, rhododendrons and marsh plants like yellow iris and willow scrub. Keep you eyes peeled for wildlife such as red fox, muntjac deer and a variety of butterflies in the summer months. The London Loop passes through the common so there is scope for extending your walk. If you head east you can visit Bentley Priory and Stanmore Common where there are more good walking trails to try. Heading west will take you to Oxhey Woods where there is a fine sculpture trail.",
  "video_url": "https://www.youtube.com/embed/0nNB-fFP1zI",
  "postcode": "HA3 6SQ",
  "district": "London",
  "county": "Greater London",
  "region": "London",
  "country": "England"
}