{
  "created_at": "2025-01-06T01:26:01.489112+00:00",
  "objectID": "ce8cc125db051e68ef2096d4c8ce5453",
  "ref": "chess-valley-walk-walking-route",
  "title": "Chess Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/36/Chess_Valley_Walk_-_geograph.org.uk_-_951238.jpg",
  "nearby": [
    {
      "description": "Chiltern Heritage Trail",
      "objectID": "539ce9f068b2bb535cfd77c1680974bf",
      "ref": "chiltern-heritage-trail-walking-route"
    },
    {
      "description": "Chesham",
      "objectID": "a98a222958bd2893d363ad761885dbf1",
      "ref": "chesham-walking-route"
    },
    {
      "description": "Chess Valley Circular Walk",
      "objectID": "8de86afcd105ea4be681a8fc8b308565",
      "ref": "chess-valley-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/ce8cc125db051e68ef2096d4c8ce5453.gpx",
  "_geoloc": {
    "lat": 51.7050297189,
    "lng": -0.6111931861
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Chess_Valley_Walk_-_geograph.org.uk_-_951238.jpg",
      "title": "Shaun Ferguson / Chess Valley Walk",
      "caption": "Signposts and footpath view at Higher Blackwell"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Footbridge_over_the_River_Chess_-_geograph.org.uk_-_951319.jpg",
      "title": "Shaun Ferguson / Footbridge over the River Chess",
      "caption": "Footbridge over the River Chess near Chorleywood House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Chorleywood_House_and_part_of_Chorleywood_House_Estate_-_geograph.org.uk_-_1765085.jpg/512px-Chorleywood_House_and_part_of_Chorleywood_House_Estate_-_geograph.org.uk_-_1765085.jpg",
      "title": "Graham Hale / Chorleywood House and part of Chorleywood House Estate",
      "caption": "Chorleywood House part of the 170 acre Chorleywood House Estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Chorleywood%2C_Chess_Valley_Walk_-_geograph.org.uk_-_700538.jpg",
      "title": "David Marsden / Chorleywood, Chess Valley Walk",
      "caption": "The Chilterns at their best. This is on the walk from Chorleywood House down to the Chess Valley, surely one of the most beautiful places in the south east of England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Chenies_Manor-geograph-3383079.jpg",
      "title": "Alexander P Kapp / Chenies Manor",
      "caption": "Chenies Manor. The historic house estate includes award winning gardens and original 13th Century features including a Medieval well, a dungeon and a reputed priest hole."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Chess_Valley_Walk_-_geograph.org.uk_-_951328.jpg",
      "title": "Shaun Ferguson / Chess Valley Walk",
      "caption": "The path nearing Solesbridge Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Chess_Valley_walk_-_geograph.org.uk_-_951275.jpg",
      "title": "Shaun Ferguson / Chess Valley walk",
      "caption": "River Chess near Mill Farm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/River_Chess_at_Chenies_-_geograph.org.uk_-_4675393.jpg",
      "title": "River Chess at Chenies by Malc McDonald, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Chess at Chenies"
    }
  ],
  "distance_km": 16.0,
  "description": "Follow the River Chess through the Chess Valley on this delightful trail through Buckinghamshire and Hertfordshire. The popular route runs for a duration of just under 10 miles along a fairly flat, waymarked footpath. You start at Chesham Station passing Latimer, Chenies and Loudwater before finishing at Rickmansworth Station. This is a nice easy waterside walk with plenty of attractive countryside and a series of quiet little villages to enjoy. It is also easily accessible with train stations at either end. Route highlights include the Grade I listed Chenies Manor House with its beautiful gardens and the splendid grounds of the Chorleywood House Estate near Loudwater. At Latimer you will also pass the impressive Latimer House, a red brick Tudor style mansion, which was designed by Edward Blore, and completed in 1838. The walk links with the long distance Chiltern Heritage Trail around Chenies so it's easy to extend your walk on this path. For a shorter walk you could try our route from Chesham which runs to Latimer before turning south to finish at the village of Little Chalfont. Here you can catch a train from Chalfont and Latimer station to take you back to Chesham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The pretty village of Chenies is a nice place for a pit stop on the walk. There's a couple of good pubs here including the Bedford Arms Hotel where there's a bar with a good atmosphere and a particularly lovely garden area. It's located at postcode WD3 6EQ. There's also The Red Lion to try in the village. The 16th century pub has a good menu and also includes an outdoor area for warmer days. You can find the pub in the village at a postcode of WD3 6ED for your sat navs. Near Chenies and Amersham you'll pass the picture postcard village of Sarratt. It's a delightful village which includes the popular The Cricketers next to the village green. They do a fine Sunday lunch and have a nice garden area to sit out in on warmer days. You can find them at postcode WD3 6AS for your sat navs. Near the train station in Little Chalfont you'll find The Metropolitan. The beautifully restored pub serves high quality food and has a nice garden area and patio to sit out in. You can find them at Chalfont Station Rd, HP7 9PN. Near here you could also pay a visit to the Little Chalfont Nature Park. The lovely little park includes a rare wild flower meadow, old woodlands and relics of its past as a farm and a cherry orchard. There's information boards where you can learn about the variety of flora and fauna at the site. You can find them on Cokes Lane at postcode HP7 9QB for sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The walk is a good one to do with your four legged friend with several pockets of woodland surrounding the river. The Red Lion mentioned above is also dog friendly and the Bedford Arms welcomes dogs in the outdoor area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative route you can try the Chess Valley Circular Walk. This can picked up at the Chorleywood or Chalfont and Latimer underground stations. It follows a section of this route and the Chiltern Way to create a circular walk around the area. For more walking ideas in the area see the Buckinghamshire Walks and the Hertfordshire Walks pages."
    }
  ],
  "postcode": "HP5 1DB",
  "district": "Chesham",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Discover The Chess Valley, Station Yard, Old Town, Chesham, Chesham and Villages Community Board, Buckinghamshire, England, HP5 1DB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "footpath",
    "countryside"
  ],
  "points_of_interest": [
    "historical sites",
    "villages",
    "gardens"
  ],
  "facilities": [
    "train station",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}