{
  "created_at": "2025-01-06T02:13:04.393903+00:00",
  "objectID": "ce9580ffc900fd36a3cca16ed209c29d",
  "ref": "brandon-country-park-walking-and-cycle-route",
  "title": "Brandon Walks - Brandon Country Park",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Brandon_Country_Park_-_geograph.org.uk_-_602715.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/ce9580ffc900fd36a3cca16ed209c29d.gpx",
  "_geoloc": {
    "lat": 52.4372445178,
    "lng": 0.6287551373
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Brandon_Country_Park_-_geograph.org.uk_-_602715.jpg",
      "title": "Bob Jones / Brandon Country Park",
      "caption": "Autumn tree. This tree, with its low horizontal branch, is a favourite for children to play on."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Brandon_Country_Park_Visitor_Centre_-_geograph.org.uk_-_31899.jpg",
      "title": "Bob Jones / Brandon Country Park Visitor Centre",
      "caption": "Brandon Country Park Visitor Centre. The country park has trees of many types and sizes and is managed jointly by Forest Heath District Council and Suffolk County Council."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Track_in_Brandon_Park_-_geograph.org.uk_-_1013008.jpg",
      "title": "Bob Jones / Track in Brandon Park",
      "caption": "Track in the park. The falling leaves are turning golden brown, lining the mown track which leads directly away from Brandon Park House, now the site of a BUPA nursing home."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Brandon_Park_House_-_geograph.org.uk_-_1013015.jpg",
      "title": "Bob Jones / Brandon Park House",
      "caption": "Brandon Park House was built by Edward Bliss in 1826. Originally the house possessed 21 bedrooms, an imposing entrance hall complete with organ, a billiard room and a library as well as a separate laundry, stables for 17 horses, garaging and a generator to provide electric lighting. It is now a BUPA nursing home."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Mausoleum_in_Brandon_Park_-_geograph.org.uk_-_600053.jpg",
      "title": "Bob Jones / Mausoleum in Brandon Park",
      "caption": "Mausoleum in Brandon Park. Edward Bliss, former High Sheriff of Suffolk, bought Brandon Park in 1820. He built the mausoleum so that he could be laid to rest on his own estate. He died in 1845 and his wife Sarah in 1859; both were interred in the mausoleum. When the estate was sold in 1903, the remains of both were moved to St Peter's churchyard in Brandon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Brandon_Park_lake_-_geograph.org.uk_-_1011872.jpg",
      "title": "Bob Jones / Brandon Park lake",
      "caption": "Park lake. This ornamental lake was created between 1820 and 1845 by Edward Bliss as an ornamental feature with a small rustic bridge, a water fountain and a summer house. The lake was redeveloped in 1992 to form a more natural habitat. It now attracts many toads, dragonflies and damselflies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/%27Oak_and_Rust%27_sculpture%2C_Brandon_Park_-_geograph.org.uk_-_1012005.jpg/256px-%27Oak_and_Rust%27_sculpture%2C_Brandon_Park_-_geograph.org.uk_-_1012005.jpg",
      "title": "Bob Jones / 'Oak & Rust' sculpture, Brandon Park",
      "caption": "'Oak & Rust' sculpture. This two-part sculpture, carved from a single log of Brecks' oak by Keith Rand in 2006, was commissioned by the Brecks Tourism Partnership to celebrate the unique character of the Brecks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Brandon_Park_Heath_-_geograph.org.uk_-_1011868.jpg",
      "title": "Bob Jones / Brandon Park Heath",
      "caption": "Park Heathland. These tree stumps give an eerie feel to this area, which has been cleared in recent years to restore the ancient heathland."
    }
  ],
  "distance_km": 11.0,
  "description": "A lovely cycle or walk around Brandon Country Park and the surrounding Thetford Forest in Suffolk. There are three waymarked, woodland walks while the Poacher Trail cycle route also starts out at Brandon Country Park. This is an intermediate ride waymarked with blue posts. The park has beautiful lakeside lawns, a delightful walled garden and an excellent visitor centre. You will then head into Thetford Forest along peaceful woodland trails before returning to Brandon Country Park. The park is located near to the small town of Brandon on the River Ouse. If you have time you could continue your walk along the nearby Little Ouse Path for a delightful waterside walk. Scroll down for a list of walks near and around Brandon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The park has a very good on site cafe selling a good range of meals and snacks."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails are ideal for dog walking so you're bound to see other owners on your visit. The Walled Garden area and tearoom are dog-free areas (except for assistance dogs)."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Hereward Way can be picked up just to the north of Brandon. You could follow the waymarked trail west along the river to the lovely Lakenheath Fen. This peaceful nature reserve is located on the Norfolk/Suffolk border. The reserve consists of a large area of wetland with reedbeds, grazing marshes and riverside paths along the River Little Ouse.  Just north of Brandon you can pick up the Grime's Graves and Weeting Castle Walk. This route visits two interesting English Heritage run historical sites in the area. The first is a prehistoric flint mine dug over 5000 years ago where you can descend on a ladder to view the fascinating pit. The route then visits nearby Weeting Castle where you'll find the ruins of a 12th century manor house. Both sites are well run with information boards detailing the history of the area. A few miles to the north you'll find the splendid Lynford Arboretum. It's a lovely place for a walk with woodland trails, pretty lakes and an impressive 19th century Sequoia Avenue to see. To the south there's the Elveden Estate where there's miles of walking trails surrounding the historic Georgian mansion. The estate also includes a number of fine shops selling quality produce, the excellent Elveden Courtyard restaurant and the Elveden Inn. The inn is considered to be the 'home of Guinness' in England as the estate is the seat of a direct descendant of the Guinness family. You can find them just a few miles north east of the walk in the village of Elveden at postcode IP24 3TJ. For more walking ideas in the county see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/NGxqdM6AU3U",
  "district": "West Suffolk",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bury Road, West Suffolk, Suffolk, England, IP27 0DT, United Kingdom",
  "postcode": "IP27 0DT",
  "state": "England"
}