{
  "objectID": "cede3a979f005bb987ba28ebfc24154e",
  "created_at": "2024-12-18T11:30:15.314372+00:00",
  "ref": "st-catherines-lighthouse-walking-route",
  "title": "St Catherine's Lighthouse Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Niton%2C_St._Catherine%27s_Point_lighthouse_-_geograph.org.uk_-_644591.jpg",
  "nearby": [
    {
      "description": "Isle of Wight Coast Path",
      "objectID": "4979849124ccb54d7e6cfffa6543ccb7",
      "ref": "isle-of-wight-coast-path-walking-route"
    },
    {
      "description": "Ventnor Downs",
      "objectID": "7941e97081774b4954f9fd69ffc232ec",
      "ref": "ventnor-downs-walking-route"
    },
    {
      "description": "Shanklin to Ventnor Coastal Walk",
      "objectID": "1dc3dbde1cf71399c5dd9cf429be8ab6",
      "ref": "shanklin-to-ventnor-coastal-walk-walking-route"
    },
    {
      "description": "Ventnor to Steephill Cove Walk",
      "objectID": "0cef630c1d7949c42c198c43ada45a07",
      "ref": "ventnor-to-steephill-cove-walk-walking-route"
    },
    {
      "description": "Devils Chimney Walk",
      "objectID": "4928cc787067f0ecb10c8481faeb4068",
      "ref": "devils-chimney-isle-of-wight-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/00CDF0E36A6702D680258006007A116E/$FILE/St Catherine's Lighthouse.gpx",
  "_geoloc": {
    "lat": 50.580296354,
    "lng": -1.3029336903
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Niton%2C_St._Catherine%27s_Point_lighthouse_-_geograph.org.uk_-_644591.jpg",
      "title": "Chris Downer [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "St. Catherine\u0092s Point lighthouse. On the southern tip of the Isle of Wight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/St._Catherine%27s_Point_lighthouse_-_geograph.org.uk_-_943410.jpg",
      "title": "Bob Embleton / St. Catherine's Point lighthouse, via Wikimedia Commons",
      "caption": "The present lighthouse was first lit in 1840. The elegant 120ft tower was affected by fog and so was reduced to the present height of 86ft in 1875."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Lighthouse_and_dwellings%2C_St_Catherine%27s_Point_-_geograph.org.uk_-_1414491.jpg",
      "title": "Derek Harper / Lighthouse and dwellings, St Catherine's Point, via Wikimedia Commons",
      "caption": "Lighthouse and dwellings, St Catherine's Point. The Lighthouse Dwellings to its east (left) are on a raised beach above the point. This view is from the top of West Cliff, which is the old sea cliff rising some 130 metres above the former beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Base_of_Old_Lighthouse_on_St_Catherine%27s_Hill_-_geograph.org.uk_-_75858.jpg",
      "title": "Bob Embleton / Base of Old Lighthouse on St Catherine's Hill, via Wikimedia Commons",
      "caption": "Base of Old Lighthouse on St Catherine's Hill to the north east of the current lighthouse. Begun in 1785 but abandoned before it was finished because the frequent fog at the site made it useless. Known as the mustard pot or the salt cellar (to go with St Catherine's tower being the pepperpot)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Lighthouse_at_St.Catherine%27s_Point-Isle_of_Wight_-_geograph.org.uk_-_726580.jpg",
      "title": "Colin Babb / Lighthouse at St.Catherine's Point-Isle of Wight, via Wikimedia Commons",
      "caption": "Lighthouse at St.Catherine's Point-Isle of Wight. View of the lighthouse taken while sailing around the Island. The south coast of the Island , at one time had at least four or five oar driven lifeboats. With the advent of the motor lifeboat it became possible for them to travel greater distances, and so not as many were required. This stretch of coast was notorious for the number of shipwrecks. It was very inhospitable for sailing ships."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/St._Catherine%27s_Point_-_geograph.org.uk_-_1414256.jpg",
      "title": "Derek Harper / St. Catherine's Point, via Wikimedia Commons",
      "caption": "Low crumbling cliffs at the edge of a raised beach. The actual point, on the left, which is the southernmost spot on the island and not wildly dramatic in itself, is in SZ5075 by about 10 metres."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Roundhead_of_St._Catherine%27s_breakwater_-_geograph.ci_-_214.jpg/256px-Roundhead_of_St._Catherine%27s_breakwater_-_geograph.ci_-_214.jpg",
      "title": "Bob Embleton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Roundhead of St. Catherine's breakwater. Work began on the breakwater in 1847 when Britain was fighting the Napolini wars and was completed with the construction of the large round end in 1855.\nIt was constructed by tipping a huge mound of rubble - a bund - on to the sea floor off the end of a wooden trestle.\nOn to this the walls of dressed stone blocks with rubble infill was built.\nThe plan was to have this northern breakwater accompanied by a southern one to create a huge \"refuge\" harbour from which the Royal Navy could challenge the French Fleet as soon as they left harbour.\nBy 1855 Britain and France had become allies against the Russians and the harbour was no longer needed.\nThe roundhead is some 606m out to sea and, after 150 years of buffeting by the sea, is beginning to subside.\nIt is thought the bund was not large enough and cavities have formed in the rubble inside the roundhead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Knowles_Farm%2C_St._Catherine%27s_Point%2C_Isle_of_Wight_-_geograph.org.uk_-_943403.jpg",
      "title": "Bob Embleton / Knowles Farm, St. Catherine's Point, Isle of Wight, via Wikimedia Commons",
      "caption": "Knowles Farm, St. Catherine's Point, Isle of Wight. Viewed from the entrance gates to the lighthouse."
    }
  ],
  "distance_km": 4.0,
  "description": "Visit the most southerly point on the Isle of Wight on this circular walk around St Catherine's Point and St Catherine's Down. It's a particularly lovely part of the island with steep cliffs, attractive woodland, grassland with wildflowers and stunning coastal views. The walk start from the Niton undercliff car park and follows footpaths down to St Catherine's Point via Knowles Farm. In 1901 Guglielmo Marconi, the inventor of the radiotelegraph system, succeeded in transmitting radio signals from Knowles Farm to the Lizard Radio Telegraph Station 186 miles away in Cornwall. The route continues around the impressive 19th century lighthouse, passing along the cliff towards Reeth Bay. Here you climb back to Knowles Farm and the car park passing the 16th century Buddle Inn. It's a charming Oldy Worlde Pub with outdoor seating and great views. It's roughly the half way point on the walk so an ideal place for refreshments! If you'd like to extend your walk you could pick up the Isle of Wight Coast Path and follow it to the nearby Ventnor Downs and St Boniface Down , the highest point on the island. You can visit the lighthouse by bike by following Regional Cycle Route 67 otherwise known as the 'Round the Island' route.",
  "video_url": "https://www.youtube.com/embed/2rvAONI7gVQ",
  "county": "Isle of Wight",
  "region": "South East",
  "country": "England"
}