{
  "created_at": "2025-01-06T04:53:52.620600+00:00",
  "objectID": "cedf66f196ad63bb77ad479cde21c934",
  "ref": "moretonhampstead-walking-route",
  "title": "Moretonhampstead Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/91/Moretonhampstead_-_geograph.org.uk_-_18291.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cedf66f196ad63bb77ad479cde21c934.gpx",
  "_geoloc": {
    "lat": 50.6630290045,
    "lng": -3.7619913484
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Moretonhampstead_-_geograph.org.uk_-_18291.jpg",
      "title": "Richard Knights / Moretonhampstead",
      "caption": "Moretonhampstead. Popular with tourists, but it has a vibrant local community, a superb butcher and 4 interesting pubs. Looking east along Court Street in this photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Moretonhampstead_tollhouse_-_geograph.org.uk_-_26821.jpg",
      "title": "Richard Knights / Moretonhampstead tollhouse",
      "caption": "The refurbished tollhouse on the Bovey Tracey - Moretonhampstead road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Standing_stone%2C_on_Butterdon_Down_-_geograph.org.uk_-_1115536.jpg",
      "title": "Roger Cornfoot / Standing stone, on Butterdon Down",
      "caption": "Standing stone, on Butterdon Down"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Moretonhampstead%2C_on_Cranbrook_Castle_-_geograph.org.uk_-_2090890.jpg",
      "title": "Moretonhampstead: on Cranbrook Castle by Martin Bodman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Moretonhampstead, on Cranbrook Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/River_Teign%2C_Fingle_Bridge_-_geograph.org.uk_-_438994.jpg",
      "title": "Nigel Cox / River Teign: Fingle Bridge",
      "caption": "Fingle Bridge. There has probably been a crossing point over the River Teign here since time immemorial as it is on the route that links Moretonhampstead with Drewsteignton and the north side of the river. The old narrow packhorse bridge with its triangular refuges has certainly been in existence since the 17th century. This is the upstream face viewed looking downstream with the roof of The Fingle Bridge Inn just visible over the top of the bridge parapet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Castle_Drogo_-_geograph.org.uk_-_1243376.jpg",
      "title": "Derek Harper / Castle Drogo",
      "caption": "Castle Drogo. The northeast wing of the castle. The granite building was constructed between 1911-30."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/River_Teign_near_Fingle_Bridge_-_geograph.org.uk_-_438265.jpg",
      "title": "Nigel Cox / River Teign near Fingle Bridge",
      "caption": "River Teign near Fingle Bridge. About 500 metres upstream of the bridge, with Hannicombe Wood on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Hannicombe_Wood_-_geograph.org.uk_-_742550.jpg",
      "title": "Stephen Craven / Hannicombe Wood",
      "caption": "Hannicombe Wood. This view across the Teign Valley shows the variety of shades of green in the deciduous and coniferous woods in early spring."
    }
  ],
  "distance_km": 16.5,
  "description": "This small Devon town is often described as the gateway to the Dartmoor National Park making it a fine place to start a walk. The market town also houses a number of historic buildings including the old Alms Houses and the Parish Church of St Andrew, which dates back to the 15th century. This walk from the town visits some of the area highlights including Fingle Bridge, Castle Drogo and Cranbrook Castle. The walk starts in the town centre and follows the Dartmoor Way north to Butterdown Down and Cranbrook where you can branch off to the right to climb Cranbrook Castle hillfort. The route continues north through Charles Wood to the iconic Fingle Bridge. This old packhorse bridge dates back to the 16th/17th century and is Grade II listed. From here you head north towards Prestonbury Castle before turning west to Piddledown Common and the splendid Castle Drogo. This National Trust run area includes fine parkland and gardens to explore. You then pick up a riverside path heading east along the River Teign through Hannicombe Wood. The route then retraces its steps to return to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the Union Inn for some post walk refreshment. It is the oldest tavern in the town, with a history stretching back several centuries. They serve good quality food and have a lovely garden and terrace area for the warmer months. You can find them on Ford Street at postcode TQ13 8LN for your sat navs. On the route you could stop off at the splendid Fingle Bridge Inn which is in a great location right next to the river. You can sit outside in the large garden area which overlooks the woods and the river, which is just a few feet away from the tables. On a fine day it's the perfect place to relax with a cream tea after your exercise. Inside there's a cosy interior with a stone hearth and wood ceiling beams. You can find the inn right next to the old bridge at postcode EX6 6PW for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and woodland trails on the route make for a fine dog walk. The Union Inn and the Fingle Bridge Inn mentioned above are both dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the south east there's more excellent woodland trails around Lustleigh Cleave. There's also some great waterside trails around the nearby Kennick Reservoir, Trenchford and Tottiford Reservoir. The lovely Becky Falls are also close to the town, and considered one of the National Park's premier beauty spots. The Wray Valley Trail starts in the village. The shared cycling and walking route runs along a disused railway line to Lustleigh and Bovey Tracey. To the south west is neighbouring North Bovey where you'll find a 14th century church, a notable 13th century pub, the fine Bovey Castle hotel and views of the River Bovey. For more walking ideas in the area see the Dartmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/cMMj5qYqM68",
  "district": "Moretonhampstead",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}