{
  "created_at": "2025-01-05T23:52:55.427739+00:00",
  "objectID": "cee2518d9f80e51200e3bf4574ab1d99",
  "ref": "lingfield-walking-route",
  "title": "Lingfield Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Lingfield_shops_-_geograph.org.uk_-_34557.jpg",
  "nearby": [
    {
      "description": "Edenbridge",
      "objectID": "088109d39ee0854867ed1a206f573066",
      "ref": "edenbridge-walking-route"
    },
    {
      "description": "Eden Valley Walk",
      "objectID": "d0484fb5b6a9140452e29b8d92a8be5b",
      "ref": "eden-valley-walk-walking-route"
    },
    {
      "description": "Staffhurst Wood",
      "objectID": "69f58b8e89d91387cad9995ae1ce0bc8",
      "ref": "staffhurst-wood-walking-route"
    },
    {
      "description": "East Grinstead",
      "objectID": "ca98d53eb035b1793d8a78c8e54f12ce",
      "ref": "east-grinstead-walking-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "High Weald Landscape Trail",
      "objectID": "c7b8c1bca6fbd4e77e5b71e851dba4a5",
      "ref": "high-weald-landscape-trail-walking-route"
    },
    {
      "description": "Chiddingstone",
      "objectID": "28f1203d8e9b9b5a030af6e47ee47733",
      "ref": "chiddingstone-walking-route"
    },
    {
      "description": "Hedgecourt Lake",
      "objectID": "a4fd36751912b051d6003a59592cc0a7",
      "ref": "hedgecourt-lake-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cee2518d9f80e51200e3bf4574ab1d99.gpx",
  "_geoloc": {
    "lat": 51.1761252327,
    "lng": -0.0082881777
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Lingfield_shops_-_geograph.org.uk_-_34557.jpg",
      "title": "Nigel Freeman / Lingfield shops",
      "caption": "Lingfield shops. Coming into the village for the north west Blindley Heath road the first thing that you notice are the mock tudor buildings"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Village_Cross_and_Cage%2C_Lingfield_%28geograph_1909337%29.jpg/256px-Village_Cross_and_Cage%2C_Lingfield_%28geograph_1909337%29.jpg",
      "title": "Richard Rogerson / Village Cross and Cage, Lingfield",
      "caption": "Village Cross and Cage, Lingfield. This monument in the village is significant both as the site of a standing cross and as that of the village lock-up. Together these form an important focal point near the centre of Lingfield. The structure dates back to the medieval period. The cage was last used in 1882 to hold a poacher."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Pollards_House_Pollards_Cottage%2C_Old_Town_House%2C_Church_House_and_spire_of_church%2C_Lingfield_geograph_1929778.jpg/512px-Pollards_House_Pollards_Cottage%2C_Old_Town_House%2C_Church_House_and_spire_of_church%2C_Lingfield_geograph_1929778.jpg",
      "title": "Peter Trimming / Lingfield, Surrey",
      "caption": "From left to right is the staggered square formed by higgledy-piggledy Grade I and Grade II listed buildings in Lingfield: Pollards House Pollards Cottage, Old Town House, Church House and in the centre background spire of the Grade I church. Dragon posts and dragon beams, alongside irregular leaded windows add to the well-surviving display of medieval architecture. The noteworthy Church of St. Peter and St. Paul was rebuilt in 1431, although the original 14th-century tower remains. Its collection of brasses and monuments are amongst the finest in England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Lingfield_Wildlife_Area_%284%29.jpg",
      "title": "Dudley Miles, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Lingfield Wildlife Area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/The_Wetlands_at_the_British_Wildlife_Centre._-_geograph.org.uk_-_1641783.jpg",
      "title": "Cameraman / The Wetlands at the British Wildlife Centre.",
      "caption": "The Wetlands at the British Wildlife Centre, near to Newchapel. The walkways were installed during 2008 and the area is now settling down very well."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Deer_at_the_British_Wildlife_Centre_-_geograph.org.uk_-_1766580.jpg/512px-Deer_at_the_British_Wildlife_Centre_-_geograph.org.uk_-_1766580.jpg",
      "title": "don cload / Deer at the British Wildlife Centre",
      "caption": "Deer at the British Wildlife Centre. The British Wildlife Centre keeps many species of deer including muntjac which have their own enclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Hedgecourt_Lake_-_geograph.org.uk_-_875895.jpg",
      "title": "Dr Neil Clifton / Hedgecourt Lake",
      "caption": "Hedgecourt Lake. Also known locally as Domewood Lake. This nature reserve is a tranquil place for a walk with birds to look out for on the water. The tree-fringed lake by Felbridge is used by anglers and yachtsmen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Footpath_alongside_a_field_of_maize%2C_Surrey_-_geograph.org.uk_-_210164.jpg",
      "title": "Dr Neil Clifton / Footpath alongside a field of maize, Surrey",
      "caption": "Footpath alongside a field of maize, Surrey"
    }
  ],
  "distance_km": 16.5,
  "description": "This attractive Surrey village has a number of local walking highlights including two nature reserves and a wonderful wildlife park. In the village there are also a number of photogenic tudor buildings, a historic Grade I listed church and several decent pubs to investigate. This circular walk from the village visits the Lingfield Wildlife Area, the British Wildlife Centre and the nature reserve at Hedgecourt Lake. The walk starts from the train station and heads west through the village to the Lingfield Common and Wildlife Area. This local area of grassland is a nice place for an easy stroll near the village centre. There's copses, a pond, a wetland area, hedges, meadows and a skateboard ramp to be found at the site. The route then heads north west through the countryside to Blindley Heath and Stanton's Hall. Here you turn south and then east to visit the wonderful British Wildlife Centre. At the attraction you'll find over 40 species of British wildlife, including foxes, red squirrels, red deer, roe deer, red weasels, badgers, river otters, hedgehogs, Scottish wildcats, and many more. There's also a wetlands area with a number of walkways and footpaths to follow around the site. From the centre you continue south to Frogit Heath before heading south west to visit Hedgecourt Lake. This pretty lake is run by Surrey Wildlife Trust as a Nature Reserve. The site includes and ancient mill pond which resulted from the damming of the upper Eden Brook. It is notable as the largest body of semi-natural open water in east Surrey. The reserve is a great place for wildlife with dragonflies and several bird species to see. After exploring the reserve the route turns north east to Wyre Mill Lake before heading through farmland to return to Lingfield.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Star Inn for some post walk refreshments. They do good food and have a lovely garden area for warmer weather. You can find them at postcode RH7 6AH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a nice dog walk though they are not allowed within the British Wildlife Centre. The Star Inn mentioned above is dog friendly however."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to head east from the village and pick up the Eden Valley Walk. This waymarked trail will take you along the River Eden to the neighbouring town of Edenbridge in Kent. On the Edenbridge Walk you can visit the splendid Hever Castle, Chiddingstone village and Penshurst Place. Just a few miles north east of the village you'll find Staffhurst Wood. These peaceful woods are particularly lovely in the spring when there are carpets of bluebells to see. To the south there's the town of East Grinstead where you can pick up the Sussex Border Path and the epic High Weald Landscape Trail. For more walking ideas in the area see the Surrey Walks and High Weald Walks pages."
    }
  ],
  "postcode": "RH7 6EH",
  "district": "Lingfield",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Eden Brook, Lingfield, Tandridge, Surrey, England, RH7 6EH, United Kingdom",
  "state": "England"
}