{
  "objectID": "cf927af2242cbbcd75fb3fc431388133",
  "created_at": "2024-12-18T09:57:43.775199+00:00",
  "ref": "edale-walking-route",
  "title": "Edale Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Edale_Church_-_geograph.org.uk_-_5308.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/238112C34266F6F78025811100819420/$FILE/Edale.gpx",
  "_geoloc": {
    "lat": 53.3703922782,
    "lng": -1.8172385152
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Edale_Church_-_geograph.org.uk_-_5308.jpg",
      "title": "Martin Clark / Edale Church",
      "caption": "Looking north to Edale Church, in the Peak District National Park, with Kinder plateau in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_Moorland_Centre_Edale_-_geograph.org.uk_-_591534.jpg",
      "title": "John Fielding / The Moorland Centre Edale",
      "caption": "The Moorland Centre. Replaces the National Park Information Centre and can be found by the side of Fieldhead Campsite (which is open all year round)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/The_Old_Nag%27s_Head%2C_Edale_-_geograph.org.uk_-_616481.jpg",
      "title": "George Tod / The Old Nag's Head, Edale",
      "caption": "The Old Nag's Head. This is the starting point of the Pennine Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Gibraltar_Bridge%2C_Edale_-_geograph.org.uk_-_495431.jpg",
      "title": "Jennifer Ward / Gibraltar Bridge, Edale",
      "caption": "Gibraltar Bridge. This bridge over Grindsbrook is part of an old packhorse route through the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Footbridge_crossing_the_Grinds_Brook_-_geograph.org.uk_-_949777.jpg",
      "title": "Arjen Bax / Footbridge crossing the Grinds Brook",
      "caption": "Footbridge crossing the Grinds Brook"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Crowden_Brook_at_Upper_Booth_-_geograph.org.uk_-_1443794.jpg",
      "title": "Peter Barr / Crowden Brook at Upper Booth",
      "caption": "Crowden Brook at Upper Booth"
    }
  ],
  "distance_km": 6.0,
  "description": "The village of Edale is a fantastic place for walkers wishing to explore this beautiful area of the Derbyshire Peak District. It is famously the start of the Pennine Way and is also regularly used as a base for climbing the wonderful Kinder Scout , the challenging stone steps of Jacob's Ladder and Kinder Downfall , the highest falls in the Peak District. Just to the south of the village are two more popular climbs to Mam Tor and Winnats Pass . The village is easy to reach by public transport with Edale train station accessible from both Sheffield and Manchester Piccadilly. There's also a good sized car park in the centre. Facilities are good with campsites, hotels, pubs and cafes. There is also an excellent visitor centre which will provide a wealth of information on all the walks, accommodation and public transport for the area. It is located at Fieldhead, postcode S33 7ZA. This easy circular walk explores the immediate area around the village, visiting the nearby hamlets of Upper Booth, Barber Booth and Ollerbrook Booth. It's a nice gentle walk to introduce you to the lovely Vale of Edale before you tackle the more challenging climbs mentioned above. The walk starts in the village and then heads west along the first section of the Pennine Way to Upper Booth. Along the way there's great views up to Mam Tor, Kinder Scout and Rushup Edge. The route then turns south east towards Barber Booth, passing close to the River Noe. You then head east back towards Edale with the option of visiting Ollerbrook Booth before finishing the walk. At the end of your walk you can visit the 16th-century Old Nag's Head pub for refreshments. To further extend your walking in the area, visit the nearby village of Castleton which is another great Peak District base for walkers. You can follow our Edale to Castleton Walk to reach the village. Just a few miles to the east of Edale is the hugely popular Derwent Valley. Here you will find the wonderful Ladybower Reservoir and Derwent Reservoir . You can also enjoy exhilarating ridge walks to Derwent Edge and Bamford Edge . You can use the google street view link below to explore the streets and pretty stone cottages of the village.",
  "video_url": "https://www.youtube.com/embed/DPjQsREj7uM",
  "postcode": "S33 7ZD",
  "district": "Edale",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}