{
  "created_at": "2025-01-06T00:29:25.599935+00:00",
  "objectID": "cfe06bfc630a817ec4f816223f21c4f8",
  "ref": "kingston-lacy-walking-route",
  "title": "Kingston Lacy Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Kingston_Lacy_-_geograph.org.uk_-_270810.jpg",
  "nearby": [
    {
      "description": "Wimborne",
      "objectID": "f745c78a06af6691aa3792f304c90c69",
      "ref": "wimborne-walking-route"
    },
    {
      "description": "Badbury Rings",
      "objectID": "8fd58c61401667325a7a2edc05c97744",
      "ref": "badbury-rings-walking-route"
    },
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "Sturminster Marshall",
      "objectID": "323bbf167e490d3d6874f617c47f2935",
      "ref": "sturminster-marshall-walking-route"
    },
    {
      "description": "Spetisbury",
      "objectID": "145bd917f7ae4b6166c17b4772a5babc",
      "ref": "spetisbury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cfe06bfc630a817ec4f816223f21c4f8.gpx",
  "_geoloc": {
    "lat": 50.8087922971,
    "lng": -2.0204235563
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Kingston_Lacy_-_geograph.org.uk_-_270810.jpg",
      "title": "Carol Walker / Kingston Lacy",
      "caption": "This elegant, 17th century, country mansion has been the home of the Bankes family for over 300 years, having replaced the ruined family seat at Corfe Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/The_Kingston_Lacy_Estate_-_geograph.org.uk_-_394784.jpg",
      "title": "Paul Whittington / The Kingston Lacy Estate",
      "caption": "Snowdrops on the estate. This was taken during the snowdrop event in February 2007, looking towards the avenue."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/The_Kingston_Lacy_Estate_-_geograph.org.uk_-_398673.jpg",
      "title": "Paul Whittington / The Kingston Lacy Estate",
      "caption": "This is taken looking west up the avenue of fir trees towards the House. The House can just be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/The_Kingston_Lacy_Estate_-_geograph.org.uk_-_331095.jpg",
      "title": "Paul Whittington / The Kingston Lacy Estate",
      "caption": "This photo is taken from the path near the sunken garden, looking east from the house down the avenue of Cedar trees. This area is not technically in the gardens of Kingston Lacy, but in the surrounding estate/parkland. Visitors are able to wander up and down the avenue but not on the lawn in the foreground, as this is private. This avenue is actually part of the 'Enchanted Garden' route in October."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Devon_Red_Cattle%2C_Kingston_Lacy_-_geograph.org.uk_-_884575.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Devon Red Cattle, Kingston Lacy in the summer of 2008. The Devon Red is a gentle, docile grazer causing minimal damage to grassland. They will graze and thrive on marginal land, and unimproved permanent pastures."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Carriage_Driving_at_Kingston_Lacy_-_geograph.org.uk_-_884470.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Carriage Driving at Kingston Lacy. Members of the Dorset Group of the British Driving Society warming up prior to an eight mile drive around the Kingston Lacy Estate and Badbury Rings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Coming_up_the_drive_to_Kingston_Lacy_House_-_geograph.org.uk_-_439544.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Turnouts coming up the drive before they parade on the lawns in front of Kingston Lacy House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Kingston_Lacy_Japanese_Tea_Garden_-_geograph.org.uk_-_426738.jpg",
      "title": "Ray Beer / Kingston Lacy Japanese Tea Garden",
      "caption": "Japanese Tea Garden"
    }
  ],
  "distance_km": 5.0,
  "description": "Explore the extensive parkland and gardens surrounding this lavish country mansion near Wimborne Minster in Dorset. Well laid out way-marked footpaths will take you across the wide lawns and through peaceful woodland to the beautiful Japanese Gardens with bamboo plants, granite lanterns and an authentic Japanese tea house. You can also follow the avenue of Lime trees to the arboretum known as Nursery Wood. Here you'll find a beautiful collection of azalea, camellia, rhododendron and flowering cherry trees. Other features in Kingston Lacy Park include the restored Victorian Kitchen Garden, the ancient Egyptian obelisk, the Rose Garden, the South Terrace, the Parterre, the Fernery and the Cedar Walk. You can also explore the Italian style house with its collection of ancient Egyptian artefacts and paintings including pictures by Rubens and Van Dyck. If you have time you could also explore the wider estate which covers 8500 acres. Highlights include the nearby Badbury Rings Iron Age hill fort and the delightful two and a half mile long Beech Avenue. The Stour Valley Way long distance walking trail also runs past the estate so you could pick this up and follow the River Stour into Wimborne Minster.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site Stables Cafe has a nice courtyard where you can sit outside and enjoy refreshments after your exercise. The Anchor Inn in nearby Shapwick is another good option. It's a lovely pub with a good menu and some outdoor seating for fine days. You can find the pub just west of the estate at a postcode of DT11 9LB for your sat navs. The little village of Shapwick is also a nice place for another stroll with the River Stour running through it. You could actually pick up the waymarked Stour Valley Way here and follow it towards Sturminster Marshall if you're still feeling energetic. The Red Lion in the pretty village has a particularly attractive garden with country views. Spetisbury is also near here and worthy of a visit. Here you can enjoy a climb to the Spetisbury Rings Iron Age Hill Fort. There are some lovely views over the area from the top of the ancient fort."
    },
    {
      "subtitle": "Dog Walking",
      "content": "With miles of woodland and parkland the estate is a great place to bring your dog for a walk. Please keep them on short leads though. The Stables courtyard cafe is also dog friendly and will provide treats for your pet."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east there's the pretty village of Witchampton where you can visit the 19th century watermill on the River Allen. It's a picturesque spot with a 15th century church and the nearby Crichel Park to see as well. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nueG2bNItRg",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Blandford Road, Hound Hill, Pamphill, Dorset, England, BH21 4ED, United Kingdom",
  "postcode": "BH21 4ED",
  "district": "Pamphill",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "garden",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "woodland",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}