{
  "created_at": "2025-01-06T01:01:16.049111+00:00",
  "objectID": "cfe2a1b11e3b61c7a09473e22818dbfa",
  "ref": "janets-foss-walking-route",
  "title": "Janet's Foss Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Footpath_to_Janet%27s_Foss_-_geograph.org.uk_-_1658311.jpg",
  "nearby": [
    {
      "description": "Settle Loop",
      "objectID": "66b6df5d33b4b0a60e0aec11a708bfc3",
      "ref": "settle-loop-walking-and-cycle-route"
    },
    {
      "description": "Gordale Scar",
      "objectID": "0407e97afd5906284ebb2f41c2627d75",
      "ref": "gordale-scar-walking-route"
    },
    {
      "description": "Malham Cove",
      "objectID": "f69ffccaf926b2bbfa4b17aed1fcadc5",
      "ref": "malham-cove-walking-route"
    },
    {
      "description": "Malham Tarn Estate",
      "objectID": "0e1b77883047f9f0f66863ff12a65c1c",
      "ref": "malham-tarn-estate-walking-and-cycle-route"
    },
    {
      "description": "Malham Cove",
      "objectID": "f69ffccaf926b2bbfa4b17aed1fcadc5",
      "ref": "malham-cove-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cfe2a1b11e3b61c7a09473e22818dbfa.gpx",
  "_geoloc": {
    "lat": 54.0598174907,
    "lng": -2.1536482128
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Footpath_to_Janet%27s_Foss_-_geograph.org.uk_-_1658311.jpg",
      "title": "Dr Neil Clifton / Footpath to Janet's Foss",
      "caption": "Footpath to Janet's Foss The path is seen near to where it passes Mantley Field Laithe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Near_Janet%27s_Foss_-_geograph.org.uk_-_502501.jpg",
      "title": "John S Turner / Near Janet's Foss",
      "caption": "Stile near the falls. This is the boundary of the National Trust land around Janet's Foss. The footpath exits on to the minor road that goes left towards Malham, and right towards Gordale Scar. Across the road are the ruins of a barn named as Stony Bank Laithe on large scale mapping. The valley in the distance leads towards the Gordale Scar waterfall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Janet%27s_Foss_-_geograph.org.uk_-_8419.jpg",
      "title": "Val Vannet / Janet's Foss",
      "caption": "View of the falls. This picturesque spot and the waterfall named after a local fairy is located near to Gordale Scar."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Tufa_Screen_at_Janet%27s_Foss_-_geograph.org.uk_-_503641.jpg",
      "title": "John S Turner / Tufa Screen at Janet's Foss",
      "caption": "Tufa Screen at the falls. Low water flow facilitated this close up of the tufa screen at the site. The information board explains that moss growing on the rock becomes calcified with limestone (calcium carbonate) deposited from the water, then more moss grows, and so on. The tufa is extremely fragile and should not be touched."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Janet%27s_Foss_-_geograph.org.uk_-_503623.jpg",
      "title": "John S Turner / Janet's Foss",
      "caption": "A view of the waterfall from the south side of the pool, which used to be used for sheep dipping. The stones in front of the camera form a line of stepping stones leading to the side of the waterfall. They are very smooth on top and could be dangerous in wet weather."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Footpath_to_Janet%27s_Foss_and_Yorkstone_Slabs_-_geograph.org.uk_-_505852.jpg",
      "title": "John S Turner / Footpath to Janet's Foss and Yorkstone Slabs",
      "caption": "Footpath to the falls and Yorkstone Slabs. This section of the path to the site is between Weet Close Bridge and Mantley Field Laith. The sign requests that walkers keep to 'The Riverside', and to encourage that yorkstone slabs are to be laid, which will sit more comfortably in the landscape than the existing crushed stone path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/The_top_of_Janet%27s_Foss_and_the_Pool_below_-_geograph.org.uk_-_503656.jpg",
      "title": "John S Turner / The top of Janet's Foss and the Pool below",
      "caption": "The top of the falls and the Pool below. The lower third of this photo is Gordale Beck as it plunges over the lip of the falls; the edge of the waterfall almost merges with the pool, which is several metres below."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Wild_Garlic_and_Footpath_to_Janet%27s_Foss_-_geograph.org.uk_-_502656.jpg",
      "title": "John S Turner / Wild Garlic and Footpath to Janet's Foss",
      "caption": "Wild Garlic and Footpath to the falls. Not far into the National Trust woodland near the site is this huge bank of wild garlic. The scent is unmistakeable."
    }
  ],
  "distance_km": 3.0,
  "description": "Visit this lovely waterfall on this short walk on the National Trust's Malham Tarn Estate. The falls are located just over a mile from the village of Malham. You can pick up a nice footpath which climbs alongside a pretty beck and through garlic scented woodland to the falls for just over a mile. To turn it into a circular walk you could return on Gordale Lane, on the western side of the falls. It's a popular and fairly easy walk, on well surfaced footpaths. It's well signposted, taking you along Malham Beck and the rushing waters of Gordale Beck. There's also some attractive waterside woodland trails and great views of the surrounding countryside to enjoy. You can extend your walk by continuing along the path to the wonderful Gordale Scar with its limestone cliffs and waterfalls. Continue north and you will soon come to Malham Tarn where there are walking and cycling trails around a large, glacial lake. The Settle Loop circular walking trail passes just to the west of Malham village so this is another good way of exploring the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Malham village head to The Lister Arms for some post walk refreshments. They do excellent home cooked food and have award-winning cask ales as well. The Lister home made pies are of particular note! They also have a lovely garden area to sit out in on warmer days. You can find them in a fine spot, just across from the village green at a postcode of BD23 4DB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The falls are a very nice place to visit with your dog so you'll probably see other owners with their pets on a fine day. You may want to keep them on leads in the areas where sheep are grazing. The Lister Arms pub mentioned above is very dog friendly in the bar area. They even make their own doggy biscuit treats!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area head to Malham Cove. The cove is a huge curved cliff formation of limestone rock with a vertical cliff face of about 260 feet high. It's a stunning sight and another of the highlights of the area. The Malham National Park Centre is a great place to visit for more information on this wonderful area. They have displays about the area, guide books, maps leaflets and a team of knowledgeable staff to advise you. You can also find out about watching the Peregrine Falcons that regularly nest at the Cove. You can find them at Chapel Gate in Malham village at postcode BD23 4DA for your sat navs. They also have a decent sized car park which acts as a great start point for many walks in the area. For more walking ideas see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KAR2uAnD3Pk",
  "district": "Malham",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}