{
  "objectID": "cfeba38b0b9d7c8e4fb65d9ef2ab2bb2",
  "created_at": "2024-12-18T13:54:11.007573+00:00",
  "ref": "hethersett-and-swardeston-country-walk-walking-route",
  "title": "Hethersett and Swardeston Country Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Bus_shelter_in_New_Road%2C_Hethersett_-_geograph.org.uk_-_2322551.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/c/cfeba38b0b9d7c8e4fb65d9ef2ab2bb2.gpx",
  "_geoloc": {
    "lat": 52.5983385449,
    "lng": 1.1838156049
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Bus_shelter_in_New_Road%2C_Hethersett_-_geograph.org.uk_-_2322551.jpg",
      "title": "Bus shelter in New Road, Hethersett by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bus shelter in New Road, Hethersett"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/The_derelict_station_in_Hethersett_-_geograph.org.uk_-_1607205.jpg",
      "title": "Evelyn Simak / The derelict station in Hethersett",
      "caption": "This derelict rail station at Hethersett is situated almost two kilometres distant from the heart of the town it once served, and cut off from it by the A11 road. The brick and flint single-storey station built in 1845 survives more or less as at closure, with the canopy and the platform goods store still in place. The station platforms have been removed. For some time the station buildings were used as part of a tyre store but they have since been abandoned and are now derelict. Hethersett station was on the Great Eastern Railway main line between Norwich-Thetford/Ely, and in the 1960s it was still served by 10 to 12 trains daily each way, the majority being Norwich-King's Lynn/Wells-next-the-Sea services. Deemed as surplus to requirements the station was closed in 1966 but trains are still travelling past here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/The_church_of_St_Remigius_in_Hethersett_-_geograph.org.uk_-_1746870.jpg",
      "title": "Evelyn Simak / The church of St Remigius in Hethersett",
      "caption": "The church of St Remigius in Hethersett. There are only five churches in England which are dedicated to St Remigius. The church of St Remigius as we see it today dates primarily from the 14th century. The chancel had been in ruins since the Reformation and was rebuilt in 1898 with the nave roof partially reconstructed at the same time, which gives the structure a somewhat unusual profile. The interior was extensively restored in Victorian times and the arcades decorated with scripture and floral motifs but the 14th century font has survived. The church windows contain a fine collection of 19th and early 20th century stained glass."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Path_on_Swardeston_Common_-_geograph.org.uk_-_2481160.jpg",
      "title": "Path on Swardeston Common by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path on Swardeston Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Public_footpath_to_Mulbarton_-_geograph.org.uk_-_1416216.jpg",
      "title": "Evelyn Simak / Public footpath to Mulbarton",
      "caption": "Public footpath to Mulbarton. This public footpath links Greenways and The Rosary in Mulbarton, further to the north. The wild flowers growing alongside the ditch seen at left provide food for many insects"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/The_tithe_barn_in_Mulbarton_-_geograph.org.uk_-_1586331.jpg",
      "title": "Evelyn Simak / The tithe barn in Mulbarton",
      "caption": "The tithe barn in Mulbarton. The former 140 ft long tithe barn on the edge of the Common used to be divided into hay barn, chaff cutting shed, corn barn, and a stable for four horses. It has since been converted into accommodation and The Coach House and Stable are two holiday flats incorporated in the western end of the building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/View_across_Long_Lane_towards_Mulbarton_Common_-_geograph.org.uk_-_1586120.jpg",
      "title": "Evelyn Simak / View across Long Lane towards Mulbarton Common",
      "caption": "View across Long Lane towards Mulbarton Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Long_Lane_past_Mulbarton_Common_-_geograph.org.uk_-_1586118.jpg",
      "title": "Evelyn Simak / Long Lane past Mulbarton Common",
      "caption": "Long Lane past Mulbarton Common"
    }
  ],
  "distance_km": 9.0,
  "description": "This village near Norwich has some nice surrounding countryside to explore on a number of footpaths. There's also a noteworthy 14th century church and the remains of the old 19th century rail station to see. This walk takes you along a section of the Upper Tas Valley Walk and the Tas Valley Way to the nearby villages of Swardeston and Mulbarton. The walks starts in the village where you can pick up the waymarked footpath and follow it south to Hethersett Hall and Ivy Farm near Ketteringham. Here you can visit the historic Ketteringham Hall which has some beautiful grounds and gardens accessible from the tea rooms. The route then turns east past Norwich Hill and Lower East Carleton before coming into Swardeston. Here there are some nice trails to follow across Swardeston common where there's wildflowers and ponds to see. After exploring the village the route continues south to Mulbarton, passing East Carleton on the way. There's another good sized area of common land here with some nice walking trails. For more details on the history of the village see the informative wikipedia page.",
  "postcode": "NR9 3AJ",
  "district": "Hethersett",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}