{
  "created_at": "2025-01-06T00:41:19.268239+00:00",
  "objectID": "6004e8b0ac8ca159efad3e2fed7d73fe",
  "ref": "lyndhurst-walking-route",
  "title": "Lyndhurst Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/War_Memorial_at_Bolton%27s_Bench%2C_Lyndhurst%2C_New_Forest_-_geograph.org.uk_-_35909.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6004e8b0ac8ca159efad3e2fed7d73fe.gpx",
  "_geoloc": {
    "lat": 50.8725240857,
    "lng": -1.5890444397
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/War_Memorial_at_Bolton%27s_Bench%2C_Lyndhurst%2C_New_Forest_-_geograph.org.uk_-_35909.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "War Memorial at Bolton's Bench, Lyndhurst, New Forest. The war memorial sits alongside the road past Bolton's Bench to the cemetery."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Knightwood_Oak%2C_New_Forest_-_geograph.org.uk_-_1300352.jpg",
      "title": "Stacey Harris [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Knightwood Oak, New Forest.There's a car oark and a peaceful picnic area at this historically signifcant site on the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Reptile_pods_Reptile_centre_New_Forest_Hampshire_-_geograph.org.uk_-_218516.jpg",
      "title": "Clive Perrin [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Reptile pods Reptile centre. Snakes,toads,frogs,and lizards live here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Deer_in_the_Bolderwood_Deer_Sanctuary_-_geograph.org.uk_-_333292.jpg",
      "title": "Gillian Moy [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Deer in the Bolderwood Deer Sanctuary"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/St_Michael_and_All_Angels%2C_Lyndhurst_-_geograph.org.uk_-_1508828.jpg/256px-St_Michael_and_All_Angels%2C_Lyndhurst_-_geograph.org.uk_-_1508828.jpg",
      "title": "Michael Ford, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Michael and All Angels parish church in th evillage. Alice Liddell, the inspiration for Alice in Lewis Carroll's Alice's Adventures in Wonderland, is buried there."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/New_Forest_Centre_-_geograph.org.uk_-_1329735.jpg",
      "title": "Trevor Harris / New Forest Centre",
      "caption": "New Forest Centre. This busy centre houses a library, a museum and the New Forest Visitor Centre."
    }
  ],
  "distance_km": 16.1,
  "description": "This walk visits some of the highlights of the Lyndhurst Area of the New Forest. The village is conviently located to visit a number of major attractions on foot. The 10 mile circular walk visits the New Forest Reptile Centre Trail, the Knightwood Oak and the Bolderwood Deer Sanctuary. The walk starts in Lyndhurst on Swan Green, just to the west of the village centre. Follow Cut Walk south west to Warwick Slade where you cross the Highland Water stream. Here you turn right to visit the New Forest Reptile Centre where there's a nice trail on well surfaced tree lined paths with a variety of wildlife to look out for. The centre has all of Britain's native lizards, snakes, frogs and toads. The route then passes through Wooson's Hill Inclosure before coming to the Bolderwood Deer Sanctuary. Here you will find a large herd of fallow deer with a viewing platform overlooking the meadow where the deer congregate. At Bolderwood you turn south, heading through the North Oakley Inclosure to the Knightwood Oak. The tree is over 500 years old and the largest oak tree in the New Forest. The route then returns to the village, passing the Reptile Centre and White Moor. Lyndhurst has an attractive high street with a number of good cafes and pubs where you can enjoy refreshments after your walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The New Forest Inn is a fine choice for some post walk refreshments. The 18th Century country pub does excellent food and has a lovely garden to relax in on sunny days. You can find them just west of the village at Emery Down with a postcode of SO43 7DY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails on the walk are ideal for dog walking. The Reptile Centre, deer sanctuary and New Forest Inn mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head just a couple of miles north west of Lyndhurst and you could visit Minstead. The unspoilt village includes a pretty village green, thatched cottages, a popular local pub and a historic 13th century church. The Minstead Walk visits Furzey Gardens before heading to the Rufus Stone just to the north east of the gardens. This historical stone apparently marks the spot where King William II was fatally wounded with an arrow, during a royal hunting outing in the Forest, in the year 1100. It's another local highlight with some nice tranquil walking trails and a picnic area. Just to the south east you'll find Denny Wood. It's a peaceful area of the forest with a campsite and good walking and cycling paths to try. Deer and ponies are often spotted here because of the tranquil nature of the area. Matley Wood and the Matley Bog nature reserve is also located near here. Here you'll find orchids, heather and views of the River Beaulieu. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stoney Cross Plain Road, Lyndhurst, Emery Down, New Forest, Hampshire, England, SO43 7DY, United Kingdom",
  "postcode": "SO43 7DY",
  "district": "New Forest",
  "state": "England"
}