{
  "created_at": "2025-01-06T00:07:08.626635+00:00",
  "objectID": "60177b109537918a13d4646a00a56e2b",
  "ref": "panorama-walk-barmouth-walking-route",
  "title": "Panorama Walk Barmouth Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/71/Barmouth_Bridge_-_geograph.org.uk_-_686401.jpg",
  "nearby": [
    {
      "description": "Barmouth to Fairbourne",
      "objectID": "790f2ea8d0c7c10f4d13f55af17c8551",
      "ref": "barmouth-to-fairbourne-walking-route"
    },
    {
      "description": "Mawddach Trail",
      "objectID": "e02916b5aa92bfacf3a1ccdc36a9baa0",
      "ref": "mawddach-trail-walking-and-cycle-route"
    },
    {
      "description": "Precipice Walk",
      "objectID": "9ec2f2c977032eee1270654ff68770df",
      "ref": "precipice-walk-dolgellau-walking-route"
    },
    {
      "description": "Arthog Waterfalls",
      "objectID": "ed147a5e9403ba07a2a159a430cf6c00",
      "ref": "arthog-waterfalls-walking-route"
    },
    {
      "description": "Llanbedr",
      "objectID": "f88e8a397b8bc302624cc5ca91148e69",
      "ref": "llanbedr-walking-route"
    },
    {
      "description": "Dinas Oleu",
      "objectID": "9578f37d81dec184386f9dbca5d1cd47",
      "ref": "dinas-oleu-walking-route"
    },
    {
      "description": "Dyffryn Ardudwy",
      "objectID": "4d1b72ad3021ee5a368ff79cb2bbfd31",
      "ref": "dyffryn-ardudwy-walking-route"
    },
    {
      "description": "Nantcol Waterfalls",
      "objectID": "beef3592cd830cec9291d8a7c1a35005",
      "ref": "nantcol-waterfalls-walk-walking-route"
    },
    {
      "description": "Llwyngwril",
      "objectID": "63ec077e07302809dd71de6f68133cd9",
      "ref": "llwyngwril-walking-route"
    },
    {
      "description": "New Precipice Walk",
      "objectID": "c0f5197b64291ab640c21e94409f357f",
      "ref": "new-precipice-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/60177b109537918a13d4646a00a56e2b.gpx",
  "_geoloc": {
    "lat": 52.7298958399,
    "lng": -4.0377052904
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Barmouth_Bridge_-_geograph.org.uk_-_686401.jpg",
      "title": "David C Williams [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Barmouth Bridge. This Grade II* listed structure, stands as a testament to engineering and serves as a crucial link for transportation in Wales. Spanning the estuary of the River Mawddach near Barmouth, this single-track wooden railway viaduct is an impressive 900 yards (820 m) in length, making it the longest timber viaduct in Wales and one of the oldest in regular use in Britain. Carrying the Cambrian Line, it plays a vital role in connecting regions. Originally designed for the Aberystwith and Welsh Coast Railway, construction of Barmouth Bridge commenced in 1864 and was completed in 1867. Recognized for its engineering brilliance, the bridge underwent intensive restoration between 1899 and 1902, addressing issues of severe corrosion on underwater sections of ironwork. In 1980, concerns arose about marine woodworm damage, prompting repairs between 1985 and 1986. Despite a brief closure and the introduction of restrictions, the viaduct remained a key tourist attraction. Barmouth Bridge connects Morfa Mawddach and Barmouth stations in Gwynedd, serving rail, cyclists, motorcyclists, and pedestrians. It forms part of the National Cycle Route 8, contributing to the regional transportation network. Tolls were historically collected for foot and cycle traffic until 2013, transitioning to a voluntary system in 2017. Originally designed to accommodate tall ships, the bridge incorporated a drawbridge, later replaced by a non-operational swing bridge between 1899 and 1902. The bridge, however, lacks provisions for road traffic."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Barmouth_Theatre_-_geograph.org.uk_-_462880.jpg",
      "title": "Trevor Rickard [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Barmouth Theatre. The building used to be a chapel but has been put to a new use"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Radio_Mast_overlooking_the_Mawddach_Estuary_-_geograph.org.uk_-_703207.jpg",
      "title": "David Bowen [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Radio Mast overlooking the Mawddach Estuary"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/View_towards_Barmouth_-_geograph.org.uk_-_715248.jpg",
      "title": "David Bowen [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View towards Barmouth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Fairbourne_spit_from_the_Barmouth_Panorama_viewpoint_%28geograph_2565306%29.jpg/512px-Fairbourne_spit_from_the_Barmouth_Panorama_viewpoint_%28geograph_2565306%29.jpg",
      "title": "Roger Davies [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Fairbourne Spit/Penrhyn Point at the mouth of the Mawddach River, Gwynedd, Northwest Wales, viewed from Barmouth 'Panorama' viewpoint."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Barmouth_Beach_-_geograph.org.uk_-_610710.jpg",
      "title": "George Tod [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Barmouth Beach. View from the beach of Barmouth with a backdrop of the mountains around Cadair Idris."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Mawddach_Estuary_from_Dinas_Oleu_-_geograph.org.uk_-_185788.jpg",
      "title": "Eirian Evans / Mawddach Estuary from Dinas Oleu",
      "caption": "Mawddach Estuary from Dinas Oleu. A view of the Mawddach Estuary taken from the Panorama Walk, near Barmouth. The barrage, built in the 1960's to connect the harbour with the dunes called Ynys y Brawd, can be seen in the centre of the picture. Three photographs have been used to create this panoramic view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Viewpoint_on_Dinas_Oleu_-_geograph.org.uk_-_185767.jpg",
      "title": "Eirian Evans / Viewpoint on Dinas Oleu",
      "caption": "Viewpoint on Dinas Oleu. Dinas Oleu, a mountainside east of Barmouth, was the first property to be donated to the National Trust, in 1895. This is a viewpoint looking out over Cardigan Bay."
    }
  ],
  "distance_km": 9.5,
  "description": "A classic circular walk around Barmouth climbing above the town for magnificent views over the Mawddach estuary and the Snowdonia National Park. Start your walk from the car park on Panorama Road, just to the north east of the town. From here you can pick up footpaths to take you up to the Panorama gardens, where there is a great viewpoint. The route then heads north to Cutiau where you turn west towards Llwynon. There follows a challenging climb up to Bwlch Llan which reaches a height of around 1100ft. Your efforts are rewarded with wide ranging views over the Cader Idris range and Cardigan Bay from the high points. The walk then heads to Ffridd Y Graig, Craig Y Gigfran and Dinas Oleu before descending to the sea front in Barmouth. The final section then passes along the pretty Barmouth Beach before climbing back to the finish point at the car park. To extend your walking in the area try the Barmouth to Fairbourne Walk which takes you across Barmouth Bridge to the village of Fairbourne. This uses part of the Mawddach Trail which takes you along the old Ruabon to Barmouth railway line on a brilliant cycling and walking trail. It will take you to Dolgellau where you can try the excellent Precipice Walk and the New Precipice Walk. On the opposite side of the estuary you can also visit the little village of Arthog and try the Arthog Waterfalls Walk. You could also try the long distance Taith Ardudwy Way which starts in the town and takes you through the Snowdonia National Park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Last Inn in Barmouth is a good choice for some post walk refreshments. The 15th Century Inn is one of Wales’ most famous pubs with traditional inglenooks and Ships Beams. The historic establishment also includes a natural spring waterfall and a famous mural of the harbours. They have a great menu and a nice outdoor area if the weather is good. You can find the inn on Church Street, with a postcode of LL42 1EL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The path is quite steep so it's only really suitable for fit dogs and it's probably best to keep them on leads at the high points. On the north eastern side of the trail there's some woodland areas which are nice for dog walking too. The Last Inn pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A visit to the lovely blue flag beach in Barmouth is highly recommended. There's lots of attractions here including a promenade train where you can take the weight off your feet. The walk across the 150 year old Barmouth Bridge is another must do activity in the area. There's fine views across the estuary from this marvellous old structure. Head north and you could pick up the Harlech Walk. This visits the village of Llanbedr, the River Artro Estuary and the Morfa Dyffryn Nature Reserve. The beautiful reserve includes huge sand dunes, seashore, saltmarsh and grassland with a wide variety of wildlife to look out for. Near the reserve there's also the village of Dyffryn Ardudwy where there's a train station for public transport access. There's also the fascinating Dyffryn Ardudwy Burial chamber to explore in the village. The ancient site includes a hut circle and a number of dolmen dating back over 6000 thousand years. Just to the east of Llanbedr there's also something of a hidden gem at the wonderful Nantcol Waterfalls. The area includes pleasant trails along the River Cwmnantcol with a series of rushing waterfalls to see along the way. There's also a circular walk around a small reservoir, just west of the falls. For more walking ideas in the area see the Snowdonia Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/b2OHPFSXu0w",
  "county": "Gwynedd - Gwynedd",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}