{
  "created_at": "2025-01-06T02:07:44.701285+00:00",
  "objectID": "6034b402234644bb629479108db20e86",
  "ref": "upminster-walking-route",
  "title": "Upminster Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Upminster_Park%2C_Upminster_-_geograph.org.uk_-_147569.jpg",
  "nearby": [
    {
      "description": "Ingrebourne Valley",
      "objectID": "d71a43a16d2e450fc548c34d967ee1ca",
      "ref": "ingrebourne-valley-walking-and-cycle-route"
    },
    {
      "description": "Hornchurch Country Park",
      "objectID": "730b167975a83dae3aa6331467803198",
      "ref": "hornchurch-country-park-walking-and-cycle-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Rainham Marshes",
      "objectID": "b595a8c365cc78a8dd40b5e895d79353",
      "ref": "rainham-marshes-walking-and-cycle-route"
    },
    {
      "description": "Havering Country Park",
      "objectID": "1de3e1e1f7bcb7ed065b3bd7c85256a6",
      "ref": "havering-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6034b402234644bb629479108db20e86.gpx",
  "_geoloc": {
    "lat": 51.5584280711,
    "lng": 0.2496273473
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Upminster_Park%2C_Upminster_-_geograph.org.uk_-_147569.jpg",
      "title": "John Winfield / Upminster Park, Upminster",
      "caption": "Upminster Park, Upminster"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Upminster_Windmill_-_geograph.org.uk_-_683216.jpg",
      "title": "Christine Matthews / Upminster Windmill",
      "caption": "Upminster windmill was built in 1803 by James Nokes, Upminster's smock mill continued in use until 1920s. After the death of Clement Abraham, in September 1935, his brothers and co-owners Thomas and Alfred offered it for sale. Essex County Council placed a preservation order on it in 1937, eventually acquiring the mill in 1940. thanks to a public appeal the mill was restored by 1950 but decayed again over the next decade. The adjoining mill buildings were demolished in 1960 but the mill received the necessary maintenance work a couple of years later, before passing to the London Borough of Havering in 1964."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Ingrebourne_Valley_Green_Way_%2CHornchurch%2C_Essex_-_geograph.org.uk_-_41798.jpg",
      "title": "John Winfield / Ingrebourne Valley Green Way ,Hornchurch, Essex",
      "caption": "Ingrebourne Valley Green Way, Hornchurch. Part of the Hornchurch Country Park, the Ingrebourne Valley Green Way forms part of the London Loop urban footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Flooded_gravel_pit%2C_Hornchurch_Country_Park_-_geograph.org.uk_-_1038949.jpg",
      "title": "David Kemp / Flooded gravel pit, Hornchurch Country Park",
      "caption": "Flooded gravel pit, Hornchurch Country Park. The Country Park is on the site of the former Hornchurch Aerodrome which having played an important role in both World Wars, closed in 1962. The area was then used in the 1970s for sand and gravel extraction. Work on the creation of the Country Park began in 1980. The buildings on the horizon are at St George's Hospital, Hornchurch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Parklands_lake_-_geograph.org.uk_-_747272.jpg/256px-Parklands_lake_-_geograph.org.uk_-_747272.jpg",
      "title": "Glyn Baker / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Parklands lake. This serpentine lake is in Parklands Corbets Tey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Cranham_Marsh_-_geograph.org.uk_-_791103.jpg/256px-Cranham_Marsh_-_geograph.org.uk_-_791103.jpg",
      "title": "Glyn Baker / Cranham Marsh",
      "caption": "Cranham Marsh. This is the gate to Cranham Marsh Nature Reserve. The reserve is managed by Essex Wildlife Trust. The marsh is a tiny fragment of the type of habitat that once covered much of south Essex. Some parts of the woodland on the reserve are thought to have remained as woodland since the time of the wildwood that covered all of southern England in prehistoric times. Quite something inside the M25!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Footpath_and_Bridleway%2C_Moor_Lane%2C_Cranham%2C_Essex_-_geograph.org.uk_-_1131279.jpg",
      "title": "John Salmon / Footpath & Bridleway, Moor Lane, Cranham, Essex",
      "caption": "Footpath and Bridleway, Moor Lane, Cranham, Essex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Ingrebourne_valley_north_of_Upminster_-_geograph.org.uk_-_1038923.jpg",
      "title": "David Kemp / Ingrebourne valley north of Upminster",
      "caption": "Ingrebourne valley north of Upminster. The trees on the right mark the course of the river. The valley itself is about one kilometre wide and provides a corridor of open countryside in an otherwise built-up area."
    }
  ],
  "distance_km": 17.8,
  "description": "This East London town is located in a nice spot in the London Borough of Havering. There's nice trails to follow into the surrounding countryside, some local country parks and riverside paths to try. It's easily accessible from central london with a train station and tube station. This circular walk explores the area around Upminster, visiting the Ingrebourne Valley, Hornchurch Country Park, Corbets Tey and Cranham. The walk starts from Upminster station on the London-Tilbury-Southend Line and the London Underground. There's also Upminster Bridge tube station which is on the district line. From here you can head west through the town to pick up the London Loop. On this opening section you'll pass the Grade II listed Upminster Windmill which was built in 1803. Follow the London Loop south west and it will take you to Hornchurch Country Park. Features in the park include the River Ingrebourne, grassland, a fishing lake and woodland paths. The park is also a Local Nature Reserve with marshes containing the largest freshwater reed bed in London. After exploring the park you then retrace your steps for about half a mile before following a footpath east towards Corbets Tey where there's the pretty Parklands Lake to see. The route then heads north east to follow trails to Cranham Marsh Nature Reserve and Cranham Hall. Footpaths then take you north, skirting the edge of Cranham before turning west to link up with the London Loop around Strawberry Farm. You can then follow the path south west to cross the Ingrebourne River before returning to the tube/train station.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Jobbers Rest is a good choice for some post walk refreshments. They have a good menu and a lovely garden area to sit out in on finer days. You can find them on St. Marys Lane with a postcode of RM14 3LT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails and parkland walks make this a nice route to do with your dog. The Jobbers Rest mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "From Hornchurch Park you could head south along the London Loop to Rainham and then onto the River Thames at Rainham Marshes. You could then enjoy some riverside trails along the Thames and look out for a variety of birdlife in the popular reserve. Just north east of the town there's Thorndon Country Park near Brentwood. Here you'll find miles of walking and cycling trails with an ancient deer park, grassland and three small lakes. Weald Country Park is also in Brentwood and has a lovely circular trail around a picturesque lake. Just east of Hornchurch there's the noteworthy Belhus Woods Country Park where you'll find lakes, wildflower meadows and bluebell woodland. For more walking ideas in the area see the London Walks page."
    }
  ],
  "postcode": "RM14 2TU",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "M&Co, Station Road, Upminster, London Borough of Havering, London, Greater London, England, RM14 2TU, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "lake",
    "farm"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}