{
  "objectID": "605c10f32c89ee8678b6f53a681eaca3",
  "created_at": "2024-12-18T16:54:07.675628+00:00",
  "ref": "montgomery-canal-walking-and-cycle-route",
  "title": "Montgomery Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Canal_Bridge_on_Montgomery_Canal_-_geograph.org.uk_-_781927.jpg",
  "nearby": [
    {
      "description": "Llangollen Canal",
      "objectID": "17c628d8a920bec4f253febceb624514",
      "ref": "llangollen-canal-walking-and-cycle-route"
    },
    {
      "description": "Powis Castle",
      "objectID": "cf6a40b6713840a6ecc08558caf0e7ad",
      "ref": "powis-castle-walking-route"
    },
    {
      "description": "Welshpool",
      "objectID": "98056822d9077a86a6bd39d9c2c45387",
      "ref": "welshpool-walking-route"
    },
    {
      "description": "Newtown",
      "objectID": "3037a53a48947cbc620d44d7d7386bf0",
      "ref": "newtown-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/2356F193D5107D2B80257EBC00824CF3/$FILE/Montgomery Canal.gpx",
  "_geoloc": {
    "lat": 52.5160007169,
    "lng": -3.3121619082
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Canal_Bridge_on_Montgomery_Canal_-_geograph.org.uk_-_781927.jpg",
      "title": "John Firth [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Canal Bridge on Montgomery Canal. At present, the canal is navigable for seven miles from Frankton to Gronwyn Bridge; however, the number of boats is restricted by agreement between the British Waterways Board and Natural England, a significant part of the canal being a Site of Special Scientific Interest in England and a Special Area of Conservation in Wales for its aquatic insect and plant life. To manage this, Frankton Locks are currently only open between 1200 and 1400 each day, with pre-booking necessary. Boaters may spend a minimum of 24 hours and a maximum of 14 days on the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Montgomery_Canal_at_Maesbury_Marsh.jpg",
      "title": "By Dave.Dunford at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Montgomery Canal at Maesbury Marsh"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Montgomery_Canal_approaching_Llanymynech_-_geograph.org.uk_-_836001.jpg",
      "title": "Chris Heaton / Montgomery Canal approaching Llanymynech",
      "caption": "Canal approaching Llanymynech. Approaching Llanymynech along the canal towpath from the west, which at this point has been adopted by the Offa's Dyke Path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Montgomery_Canal_-_geograph.org.uk_-_829808.jpg",
      "title": "Chris Heaton / Montgomery Canal",
      "caption": "The canal at the point where it swerves away from the A483 as it heads north towards Pool Quay. At this point the towpath has been adopted by the Offa's Dyke National Trail, and Severn Way Long Distance Footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Approaching_Carreghofa_Locks_-_geograph.org.uk_-_833202.jpg",
      "title": "Chris Heaton / Approaching Carreghofa Locks",
      "caption": "Approaching Carreghofa Locks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Canal_between_Buttington_and_Pool_Quay_-_geograph.org.uk_-_829794.jpg",
      "title": "Chris Heaton / Canal between Buttington and Pool Quay",
      "caption": "Canal between Buttington and Pool Quay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Frankton_Top_Lock%2C_Montgomery_Canal_-_geograph.org.uk_-_1001773.jpg",
      "title": "Stephen McKay / Frankton Top Lock, Montgomery Canal",
      "caption": "Frankton Top Lock. The Canal (technically the Montgomery branch of the Shropshire Union) starts at Frankton Junction and almost immediately descends through four locks, the top two of which are joined as a staircase. The canal, which was finally completed in 1819, did not serve Montgomery itself but ran to the Montgomeryshire towns of Welshpool and Newtown. Like most rural canals it was never a prosperous concern and traffic declined steeply after the First World War. It was eventually abandoned in 1936 following a serious breach which the company decided it was not worthwhile to repair; official closure came in 1944 by Act of Parliament. After that the canal deteriorated and had it not been for the determination of the Shropshire Union Canal Society it would have disappeared completely; nevertheless, from 1969 onwards a slow process of restoration has taken place which is at last nearing completion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Montgomery_Canal_from_Aston_Top_Lock_-_geograph.org.uk_-_1002115.jpg",
      "title": "Stephen McKay / Montgomery Canal from Aston Top Lock",
      "caption": "Canal from Aston Top Lock. Looking towards Queen's Head. Swans and their cygnets can swim around here seldom disturbed by passing boats on this very quiet canal."
    }
  ],
  "distance_km": 56.0,
  "description": "Enjoy easy waterside cycling and walking along the Montgomery Canal through Powys and Shropshire. The whole of the route can be walked while cyclists can enjoy the section from Newtown to Welshpool along National Cycle Network route 81. It's a great ride and suitable for families and people of all abilities. Starting in Newtown you follow the River Severn towards Llanllwchaiarn and the start of the canal. You then follow the towpath north passing the Pwll Penarth Nature Reserve and a series of pretty villages including Abermule and Berriew where the canal is carried over the River Rhiw aqueduct. The route continues to Welshpool passing Powis Castle and the Llyn Coed y Dinas Nature Reserve. It's a super section of the canal with wildlife such as otters and water voles to look out for. From Welshpool you continue north to Arddleen and Four Crosses where you cross the Vyrnwy Aqueduct. It's a highlight of the route with splendid views of the River Vyrnwy to enjoy. The route continues through Pant and Maesbury Marsh before finishing at Frankton Locks in Shropshire. Here you can pick up the Llangollen Canal and enjoy more waterside walking.",
  "video_url": "https://www.youtube.com/embed/Oi42nU2r2hM",
  "district": "Y Drenewydd / Newtown",
  "county": "Powys - Powys",
  "region": "Wales",
  "country": "Wales"
}