{
  "objectID": "60603fac8af6e66179117febecca9d58",
  "created_at": "2024-12-18T00:34:13.589080+00:00",
  "ref": "hawarden-castle-walking-route",
  "title": "Hawarden Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Hawarden_%27Old%27_Castle_-_geograph.org.uk_-_287719.jpg",
  "nearby": [
    {
      "description": "Wepre Park",
      "objectID": "9c38362680a6444930d6b8a8e15e6a85",
      "ref": "wepre-park-walking-route"
    },
    {
      "description": "Chester Millennium Greenway",
      "objectID": "524bb1239f0a39c72f1d865f17abcc0f",
      "ref": "chester-millennium-greenway-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/60603fac8af6e66179117febecca9d58.gpx",
  "_geoloc": {
    "lat": 53.1829706209,
    "lng": -3.0254766742
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Hawarden_%27Old%27_Castle_-_geograph.org.uk_-_287719.jpg",
      "title": "John S Turner / Hawarden 'Old' Castle, via Wikimedia Commons",
      "caption": "Hawarden 'Old' Castle. This ancient castle has an uncertain history, although, built as it is on a Norman Motte, it is probably at least 700 years old. It is located in the village of Hawarden within the parkland surrounding the former home of William Ewart Gladstone, Prime Minister"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/The_Glynne_Arms_Pub_opposite_Hawarden_Castle_Gates_-_geograph.org.uk_-_104837.jpg",
      "title": "chestertouristcom / The Glynne Arms Pub opposite Hawarden Castle Gates, via Wikimedia Commons",
      "caption": "The Glynne Arms Pub opposite Hawarden Castle Gates"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Former_Hawarden_bowling_green_-_geograph.org.uk_-_1496909.jpg",
      "title": "John S Turner / Former Hawarden bowling green, via Wikimedia Commons",
      "caption": "Former Hawarden bowling green. This derelict piece of land behind the wall, near the castle gates in Hawarden, is recorded as a bowling green on the 1881 O.S. map. However, the website of the Gladstone Bowling Club states that it was used as tennis courts prior to 1939; clearly it hasn't been used for anything recently. The Gladstone Bowling Club has an interesting history and now plays on a green at the Gladstone Playing Fields, Hawarden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Public_footpath_and_mill_dam_in_Hawarden_Park_-_geograph.org.uk_-_628802.jpg",
      "title": "John S Turner / Public footpath and mill dam in Hawarden Park, via Wikimedia Commons",
      "caption": "Public footpath and mill dam in Hawarden Park. The public footpath from Tinkersdale car park follows this curved line along the top of the old mill dam. The mill pond was to the right of the path. The old corn mill and chimney are to the left of the path and are completely hidden by the trees a short distance ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Broughton_Brook_and_the_mill_sluice_in_Hawarden_Park_-_geograph.org.uk_-_628568.jpg",
      "title": "John S Turner / Broughton Brook and the mill sluice in Hawarden Park, via Wikimedia Commons",
      "caption": "Broughton Brook and the mill sluice in Hawarden Park. Broughton Brook flows towards the camera here, through the ruined sluice gate, and under the footpath. The brook used to power the now ruined corn mill, and the higher ground to the right of the brook used to be the mill pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Woodland_in_Hawarden_Park_-_geograph.org.uk_-_628563.jpg",
      "title": "John S Turner / Woodland in Hawarden Park, via Wikimedia Commons",
      "caption": "Woodland in Hawarden Park. Viewed from the public footpath into Hawarden Park, the private track to the right used to lead down to the corn mill, which is now in ruins. The lower ground straight ahead used to be the mill pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Ruined_corn_mill_in_Hawarden_Park_-_geograph.org.uk_-_628830.jpg",
      "title": "John S Turner / Ruined corn mill in Hawarden Park, via Wikimedia Commons",
      "caption": "Ruined corn mill in Hawarden Park Another view of the ruined corn mill with the open parkland of Hawarden Park behind. I believe the small black hole is where the water flowed into the mill to power the waterwheel. What appears to be a rusty iron shaft protruding from a hole in the wall is in fact a small cut tree. The mill chimney is just on the left of the photo. Memories from Brian Bailey of Hawarden: \"50 years ago, the mill building was still complete but starting to collapse. I can confirm that the hole in the building is where the water was fed through to the overshot mill wheel, and it was possible then to climb across the wooden trough that fed the water across the gap and crawl through the hole to the mill wheel.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Rivet_bench_mark_by_Hawarden_car_park_-_geograph.org.uk_-_1395584.jpg/256px-Rivet_bench_mark_by_Hawarden_car_park_-_geograph.org.uk_-_1395584.jpg",
      "title": "John S Turner / Rivet bench mark by Hawarden car park, via Wikimedia Commons",
      "caption": "Rivet bench mark by Hawarden car park. This bench mark is easily missed at the end of these coping stones at the exit to the car park. The arrowhead is on the vertical end of the stone whilst the rivet is a few centimetres away on the top. There is a crack through the top of the cut mark."
    }
  ],
  "distance_km": 2.5,
  "description": "Explore the parkland and woodland surrounding this medieval castle near Hawarden in Flintshire. The ruins of the castle have an interesting history connected with the Welsh struggle for independence in the 13th century.  After exploring the ruins you can stroll through Hawarden Park and Bilberry Wood with woodland trails, pretty streams, attractive parkland and a large fish pond. There are also great views of the surrounding countryside of the Cheshire plain. Also on the site is the new Hawarden Castle, a manor house which in 1852 became the home of the Prime Minister W E Gladstone. Also of interest is the The Parish Church of St. Deiniol (of 13th century origin) and the neo-Gothic Gladstone library containing about 30000 of Gladstone's books. If you would like to continue your walking in the area then the nearby Wepre Park in Connah's Quay is a good option.",
  "video_url": "https://www.youtube.com/embed/mU__-ASOWk4",
  "county": "Sir y Fflint - Flintshire",
  "region": "Wales",
  "country": "Wales"
}