{
  "objectID": "60a74bc19413d893e882678ff38f7c0b",
  "created_at": "2024-12-18T19:11:54.376275+00:00",
  "ref": "saltram-park-walking-and-cycle-route",
  "title": "Saltram Park and the Plym Estuary Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Saltram_House_Car_park_-_geograph.org.uk_-_1247289.jpg",
  "nearby": [
    {
      "description": "Plymbridge Woods",
      "objectID": "3597b4983d48ed88e02df83387b7a65c",
      "ref": "plymbridge-woods-walking-and-cycle-route"
    },
    {
      "description": "West Devon Way",
      "objectID": "7743b069899a3f6f411a29a8707273a7",
      "ref": "west-devon-way-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/7D8818C14AB29C638025804E00656839/$FILE/Saltram Park.gpx",
  "_geoloc": {
    "lat": 50.3841569857,
    "lng": -4.0829784191
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Saltram_House_Car_park_-_geograph.org.uk_-_1247289.jpg",
      "title": "jeff collins / Saltram House Car park, via Wikimedia Commons",
      "caption": "Saltram House Car park. This Car park is always a busy place,this view is looking towards the Restaurant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/The_Coach_Washing_Pond_at_Saltram_House_-_geograph.org.uk_-_1194498.jpg",
      "title": "Adrian Platt / The Coach Washing Pond at Saltram House, via Wikimedia Commons",
      "caption": "The Coach Washing Pond. Many grand country houses had a pond to clean off the wheels and undercarriage of the coaches used by the Family and their visitors. Here, next door to the Stable Block and adjacent to the Carriage Houses, can be seen the circular pond used for this purpose. The coaches were driven down the cobbled ramp in the right foreground and round an island in the centre of the pond, and out back up the cobbled ramp to wash off the mud from the roads, before no doubt being dried and polished by an army of stable staff. Today the pond is fenced off, and has a resident population of ducks and other fowl. The building at the back has now been converted by the National Trust into a new restaurant for Saltram's visitors; previously it had housed for some years the last steam railway engine and other artefacts from the long closed nearby Lee Moor Tramway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Parkland_at_Saltram_-_geograph.org.uk_-_1247269.jpg",
      "title": "jeff collins / Parkland at Saltram, via Wikimedia Commons",
      "caption": "There are 500 acres of Parkland at Saltram.this view is looking towards the house,just visible on the left amongst the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/The_Stable_Block_at_Saltram_-_geograph.org.uk_-_1194563.jpg",
      "title": "Adrian Platt / The Stable Block at Saltram, via Wikimedia Commons",
      "caption": "The Stable Block. Above the north side of the Stable Block is a splendid clock and bell that would have announced the hours to the stable workers. The arch leads to the drive to the House, but the door is smaller than the arch and only suitable for pedestrians, perhaps changed at a later date. The horses were kept in the building to the left of the arch, in the north and west sides of the block, and the coach houses with staff housing above were in the east side. Much of the original partitioning for the individual stalls for the horses still exists as does the cobbled floor with its drainage channels. The trees towering above the block hid the Stables from the House, interestingly there appears to be no windows or doors on the house side of the Stables, no doubt the Parker family didn't want to see their servants or for their servants to see them !"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/The_Laira_by_Saltram_Point_-_geograph-2732892.jpg",
      "title": "Ruth Sharville / The Plym Estuary and beyond, from the tidal flats at the Saltram Estate, via Wikimedia Commons",
      "caption": "The Laira (the Plym Estuary) and beyond, from the tidal flats at the Saltram Estate"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Saltram_House_-_geograph.org.uk_-_1096719.jpg",
      "title": "Adrian Platt / Saltram House, via Wikimedia Commons",
      "caption": "Saltram House. The west side of the house, with trees turning on an autumn day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/The_garden_at_Saltram_-_geograph.org.uk_-_1194649.jpg",
      "title": "Adrian Platt / The garden at Saltram, via Wikimedia Commons",
      "caption": "The garden at Saltram. Daffodils are coming into flower alongside the avenue of lime trees in the garden. In the background is the west front of Saltram House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/The_Coach_Houses_at_Saltram_-_geograph.org.uk_-_1194615.jpg",
      "title": "Adrian Platt / The Coach Houses at Saltram, via Wikimedia Commons",
      "caption": "The Coach Houses at Saltram. Looking from the cobbled coach yard through the arch in the east side into the centre 1194563 of the Stable Block. The coach houses are now used by the National Trust as a shop, and the old staff accommodation above is used as offices."
    }
  ],
  "distance_km": 3.5,
  "description": "Enjoy a circular cycle or walk around Saltram Park and the River Plym estuary on this easy route in Plymouth. National Cycle Route 27 runs along a splendid traffic free trail through Saltram Wood and along the River Plym. There's also lots of walking trails to explore 500 acres of woodland, farmland, beaches, saltmarshes, meadows and river estuary. The West Devon Way runs past the estate so you could pick this up to extend your outing. If you follow it north you will come to Plymbridge Woods where there is a great family cycle trail along a disused railway line. The Plym Valley Trail starts at the park too. The shared cycling and walking trail will take you north to Clearbrook on a 7 mile traffic free trail.",
  "video_url": "https://www.youtube.com/embed/CCjHqCFdMQQ",
  "county": "City of Plymouth",
  "region": "South West",
  "country": "England"
}