{
  "created_at": "2025-01-06T01:13:13.123204+00:00",
  "objectID": "60ad5be456784c327958d71e8138036b",
  "ref": "bexhill-walking-route",
  "title": "Bexhill Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Boats_in_Egerton_Park_-_geograph.org.uk_-_1822100.jpg/512px-Boats_in_Egerton_Park_-_geograph.org.uk_-_1822100.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/60ad5be456784c327958d71e8138036b.gpx",
  "_geoloc": {
    "lat": 50.83711639,
    "lng": 0.4736756062
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Boats_in_Egerton_Park_-_geograph.org.uk_-_1822100.jpg/512px-Boats_in_Egerton_Park_-_geograph.org.uk_-_1822100.jpg",
      "title": "Boats in Egerton Park by Paul Gillett, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Boats in Egerton Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/The_Beach_at_Bexhill_-_geograph.org.uk_-_295353.jpg",
      "title": "Nigel Stickells / The Beach at Bexhill",
      "caption": "The Beach at Bexhill. Viewed adjacent to the promenade and nearby to the Clock Tower on Bexhill seafront. Eastbourne and Beachy Head are visible across the bay to the south-west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Devonshire_Square%2C_Bexhill_-_geograph.org.uk_-_629403.jpg",
      "title": "Bill Johnson / Devonshire Square, Bexhill",
      "caption": "Devonshire Square, Bexhill. A view looking west towards Western Road, taken from the railway overbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/The_Colonnade_Coffee_House_on_Bexhill_Seafront_-_geograph.org.uk_-_295372.jpg",
      "title": "Nigel Stickells / The Colonnade Coffee House on Bexhill Seafront",
      "caption": "The Colonnade Coffee House on the Seafront. The east wing of the Colonnade is turned over to a Coffee House, deserted here on a sunny winter's morning. The inscription shown above the right-hand opening records that the Colonnade was designed by the Architect, J B Wall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/The_Promenade%2C_South_Cliff%2C_Cooden%2C_Sussex_-_geograph.org.uk_-_36872.jpg",
      "title": "John Winfield / The Promenade, South Cliff, Cooden, Sussex",
      "caption": "The Promenade, South Cliff, Cooden, Sussex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Cooden_Beach_-_geograph.org.uk_-_1511139.jpg",
      "title": "Stacey Harris / Cooden Beach",
      "caption": "Cooden Beach"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Folly_in_Egerton_Park%2C_Bexhill_-_geograph.org.uk_-_305699.jpg/256px-Folly_in_Egerton_Park%2C_Bexhill_-_geograph.org.uk_-_305699.jpg",
      "title": "Nigel Stickells / Folly in Egerton Park, Bexhill",
      "caption": "Folly in Egerton Park. This decorative folly is on an island in a pleasure lake that extends to the north side of Egerton Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Bexhill_Old_Town_-_Looking_Northwest_-_geograph.org.uk_-_399966.jpg",
      "title": "Nigel Stickells / Bexhill Old Town - Looking Northwest",
      "caption": "Bexhill Old Town. A timbered framed historic building in the old section of the town."
    }
  ],
  "distance_km": 6.0,
  "description": "Bexhill-on-Sea is a pleasant seaside town located in East Sussex. The town includes some fine Edwardian and Victorian architecture, while for walkers there are nice coastal trails along the promenade and a fine local park to explore. Bexhill is also notable as the Birthplace of British Motor Racing as it was the location for the first motor race in the United Kingdom, in May 1902. This walk from Bexhill visits the town's Egerton Park before heading west along the coast to Cooden Beach. The walk starts on the promenade in Bexhill and heads west to visit the lovely Egerton Park. Here there's a boating lake, waterways and a model yacht lake as well. After exploring the park you return to the sea front and head west along the shingle beach to Cooden Rocks. There's another shingle beach here which is popular with kite surfers and windsurfers. The walk can be extended by continuing west to visit Norman's Bay, the site where the Norman army landed in 1066 before the Battle of Hastings. Just beyond that is the historic Pevensey Castle where they army stayed before proceeding to the battle.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Traffers Bar is a nice old fashioned place with a great Sunday roast. You can find them near the sea front at 19 Egerton Road, TN39 3HJ. The Town House is another good option. They have a large garden area to sit out in. You can find them at 1 London Rd, TN39 3JR."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The sea front is a nice place for a stroll with your dog but restrictions are in place on the beach from May through to September. Traffers Bar mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Towards the northern side of the town you could pick up the 1066 Country Walk Bexhill Link. This path will take you north to Crowhurst and Battle where you can link up with the epic 1066 Country Walk. If you head east along the coast you can pick up the Hastings Circular Walk and visit Hastings Country Park. You can also pick up the epic Saxon Shore Way here. If you head west along the coast you could visit the lovely Pevensey Bay and the historic Pevensey Castle. The Hastings To Bexhill route will take you east to Hastings on a lovely waterfront cycling and walking trail. It passes the noteworthy St. Leonards Gardens where there's some lovely footpaths, an ornamental pond, herbaceous plants, shrubs, bulbs, formal flower beds and trees. There's also some interesting architecture with villas surrounding the gardens, in Regency Gothic and cottage styles. It's a very pleasant place for a stroll and can be found at postcode TN38 0HQ. To the east is the Combe Valley Greenway. This shared cycle and walking route will take you through the lovely Combe Valley Countryside Park where you will find reedbed, fen, riverside paths, countryside trails, a nature reserve and a wide variety of wildlife."
    }
  ],
  "video_url": "https://www.youtube.com/embed/-6YKwE5Ko6g?start=35",
  "postcode": "TN40 1BN",
  "district": "Rother",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Central Parade, Central, Bexhill-on-Sea, Rother, East Sussex, England, TN40 1BN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "coastal",
    "beach"
  ],
  "points_of_interest": [
    "parks",
    "historical sites",
    "beaches"
  ],
  "facilities": [
    "car park",
    "boating lake",
    "model yacht lake",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}