{
  "created_at": "2025-01-06T11:06:30.327682+00:00",
  "objectID": "60bd01143b497409c9b7c270fde89862",
  "ref": "scrabo-tower-walking-route",
  "title": "Scrabo Tower Walk, Newtownards, County Down Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9e/A_Golden_harvest_from_Scrabo_Tower_-_geograph.org.uk_-_508099.jpg",
  "nearby": [
    {
      "description": "Comber Greenway",
      "objectID": "e2de33e1b617893768c48cb4f7ec3a76",
      "ref": "comber-greenway-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/60bd01143b497409c9b7c270fde89862.gpx",
  "_geoloc": {
    "lat": 54.5777883937,
    "lng": -5.7184397229
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/A_Golden_harvest_from_Scrabo_Tower_-_geograph.org.uk_-_508099.jpg",
      "title": "HENRY CLARK / A Golden harvest from Scrabo Tower, via Wikimedia Commons",
      "caption": "A Golden harvest from Scrabo Tower"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Scrabo_Tower_-_geograph.org.uk_-_781345.jpg/256px-Scrabo_Tower_-_geograph.org.uk_-_781345.jpg",
      "title": "Ross [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Scrabo Tower Designed by Charles Laynon, the tower was built in 1857 as a memorial to Charles Stewart, 3rd Marquess of Londonderry, who died in 1854. The design for the tower was held as a competition, with a strict limit of cost set at £2000. Lanyon's effort only came fourth in the competition but his design was chosen as it fell within the required budget - in actual fact the 135 foot tower was to cost £3010 to complete. The foundation stone was laid on March 6th 1857 in an elaborate ceremony attended by the new Marquess and Marchioness, the Bishop of Down and many of the county's gentry, preceded to the top of the hill by the Marquess's Highland piper. A jar was cemented into the foundations containing an inscribed scroll to the late Marquess, copies of local and national newspapers of the day, an Ordnance Survey map of County Down, coins of the realm and a list of 600 subscribers who contributed towards the cost of the tower - the list was headed by the Emperor Napoleon III of France."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Path_up_to_Scrabo_Tower_-_geograph.org.uk_-_1404408.jpg",
      "title": "Dean Molyneaux / Path up to Scrabo Tower, via Wikimedia Commons",
      "caption": "View of the surfaced footpath up to Scrabo Tower"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Bluebell_near_Scrabo_Tower_-_geograph.org.uk_-_780504.jpg",
      "title": "Ross [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Flowering bluebell in bright sunshine close to Scrabo Tower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Scrabo_Tower_near_Newtownards_%282%29_-_geograph.org.uk_-_472889.jpg",
      "title": "Albert Bridge / Scrabo Tower near Newtownards (2), via Wikimedia Commons",
      "caption": "The tower and hill are dominant features in an otherwise fairly flat landscape. This is the view from the Newtownards - Comber road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Scrabo_Tower_near_Newtownards_-_geograph.org.uk_-_347929.jpg",
      "title": "Albert Bridge / Scrabo Tower near Newtownards, via Wikimedia Commons",
      "caption": "Scrabo Tower near Newtownards Scrabo Tower stands on Scrabo hill off the Newtownards-Comber road. It was built on in 1857 as a memorial to Charles Stewart, 3rd Marquess of Londonderry, one of the Duke of Wellington's generals during the Napoleonic Wars. It has excellent views of Newtownards, Strangford Lough and surrounding countryside. There is a steep climb from the public car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Scrabo_Tower_near_Newtownards_%28detail%29_%284%29_-_geograph.org.uk_-_876007.jpg",
      "title": "Albert Bridge / Scrabo Tower near Newtownards (detail) (4), via Wikimedia Commons",
      "caption": "The top of the tower with the spiral staircase reached through the door in the middle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/A_view_from_Scrabo_-_geograph.org.uk_-_780494.jpg",
      "title": "Ross [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A view from Scrabo Scrabo Tower is an excellent viewpoint for large sections of northern County Down. This is the view south east across lands south of Newtownards, part of Strangford Lough and countryside on towards Killyleagh and Downpatrick. See also 6524048 for other views from Scrabo."
    }
  ],
  "distance_km": 1.0,
  "description": "Scrabo Hill and country park is located near Newtownards in County Down, Northern Ireland. You can follow footpaths to the top of the hill where you will find the well known landmark Scrabo Tower. The 19th century tower is 125 feet (38 m) high and visible for miles around. The views from the summit of Scrabo Hill extend to Strangford Lough, the Mourne Mountains and the Scottish coast. You can pick up the footpath from the car park. It's a short climb of less than half a mile but quite steep. After descending the hill you can continue to explore Scrabo Country Park. There are nice woodland trails through Killynether Woods with lots of bluebells in the springtime. To extend your walking in the area you pick up the Comber Greenway from nearby Comber. This cycling and walking trail runs along National Cycle Network route 99 and a disused railway line from Belfast to Comber.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/u3Roqv3Qkwc",
  "gazetteer_found": false
}