{
  "created_at": "2025-01-05T22:30:28.424252+00:00",
  "objectID": "60e51c91c762c43beeb987f658b14342",
  "ref": "crathorne-hall-walking-route",
  "title": "Crathorne Hall Woodland Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Crathorne_Hall1.jpg",
  "nearby": [
    {
      "description": "Yarm",
      "objectID": "0f3f43075cc7ab0391b5c83fb0051737",
      "ref": "yarm-walking-route"
    },
    {
      "description": "Tees Barrage Walk",
      "objectID": "33540dea304b2786028fcb254f358a58",
      "ref": "tees-barrage-walk-walking-route"
    },
    {
      "description": "Teesdale Way",
      "objectID": "bee1da20e3a1d771ea9f89b5a2d25ba9",
      "ref": "teesdale-way-walking-route"
    },
    {
      "description": "Coatham Woods",
      "objectID": "c6fc4a650a19198d900847878e4eb4cd",
      "ref": "coatham-woods-walking-route"
    },
    {
      "description": "Wynyard Woodland Park",
      "objectID": "1201a146e7aafb8baeb0f4d53fe699cf",
      "ref": "wynyard-woodland-park-walking-route"
    },
    {
      "description": "Cowpen Bewley Woodland Park",
      "objectID": "1a72f79dbef25a88eef72a0fa8621d65",
      "ref": "cowpen-bewley-woodland-park-walking-and-cycle-route"
    },
    {
      "description": "Hardwick Hall Country Park",
      "objectID": "5575a5b7b3affc2986b1cc57ecb5f447",
      "ref": "hardwick-hall-country-park-walking-and-cycle-route"
    },
    {
      "description": "Sedgefield",
      "objectID": "6521dd291fb4cc9516cba00054d3f4c4",
      "ref": "sedgefield-walking-route"
    },
    {
      "description": "Darlington",
      "objectID": "730d4a31b45fe124c234c5c46af3c1d0",
      "ref": "darlington-walking-route"
    },
    {
      "description": "Hurworth on Tees",
      "objectID": "d6d1cbed395d1aac2610249130b0d4f6",
      "ref": "hurworth-on-tees-walking-route"
    },
    {
      "description": "Billingham Beck Valley Country Park",
      "objectID": "028442dcedd41f11547be99fd7adea88",
      "ref": "billingham-beck-valley-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/60e51c91c762c43beeb987f658b14342.gpx",
  "_geoloc": {
    "lat": 54.4659351354,
    "lng": -1.3199781993
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Crathorne_Hall1.jpg",
      "title": "Mick Garratt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Crathorne Hall 1. The village is the ancestral home of the Crathorne family, tracing its roots back to Sir William de Crathorne, who was knighted by Edward II in 1327. Presently, the village is home to James Dugdale, 2nd Baron Crathorne. His family purchased the Crathorne estate in 1844 and rebuilt Crathorne Hall in 1906, maintaining ownership until 1977. The hall now operates as a country house hotel, owned by Hand Picked Hotels. Additionally, the village hosts Crathorne Cricket Club, which competes in the Langbaurgh League Second Division. James Lionel Dugdale (1862 - 1941) laid the foundation stone of Crathorne Hall in December 1903, with the house being completed in June 1906. It stands as the largest country house constructed during the reign of Edward VII. The architect was Sir Ernest George, known for his successful practice, who designed an imposing classical south facade overlooking the Leven Valley and an original courtyard with two bell towers at the corners on the north side, which serves as the main entrance. The builders, George Trollope & Sons, sourced high-quality stone from Shaw End Quarry near Whitby, operated by the Weatherill family. On most days, around a hundred men worked on site from 6:30 am to 6 pm. Wages were generous, with bricklayers earning 10 pence an hour and stonemasons earning a penny less due to their ability to work indoors more often, matching top London pay rates. The Dugdale family intended to move into Crathorne Hall immediately after the 1906 Epsom Derby. Their horse, Picton, born at Crathorne in 1903, was one of the best colts of his time and was entered into the race with high expectations. The contractor responsible for the electrical generator and fittings promised that every window in the Hall would be \"a blaze of light if Picton wins the Derby, even if it bursts this whole generating plant!\" Although Picton finished second, he set a new record time, ensuring the Hall was illuminated as promised."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Crathorne_Hall.jpg/256px-Crathorne_Hall.jpg",
      "title": "Elain Morgan, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Hall was constructed with 115 rooms, including 41 bedrooms. There were 26 live-in servants housed in the servant’s wing, which was built around a courtyard adjoining the main block on the east side. During the Victorian and Edwardian eras, houses increasingly featured rooms designated for specific purposes, such as ironing clothes, making biscuits and bread, or cleaning and polishing silver. This required servants with various skills and training. At Crathorne Hall, servants with 14 different skills and disciplines were needed to manage the various functions within the house. Some of these servants had titles that have since fallen out of use, such as Scullery Maid, Still-room Maid, and Odd Job Man. The Dugdale family, who had amassed wealth through the Lancashire cotton trade, purchased the Crathorne Estate in 1844, primarily for partridge shooting and trout fishing. However, it took several decades before the family moved there permanently."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Craythorne_Village_Hall_-_geograph.org.uk_-_193994.jpg",
      "title": "Nick W / Craythorne Village Hall",
      "caption": "Crathorne Village Hall. Nice old building with Memorial cross outside. During the two World Wars, Crathorne Hall and its adjoining buildings served different roles. In November 1914, Lionel and Violet Dugdale made these buildings available for a Voluntary Aid Detachment (VAD) Hospital for Belgian and British troops. Violet herself commanded this British Red Cross VAD, utilising her considerable skills as a nurse. During the Second World War, the Hall had 99 hospital beds, although they were never used. Additionally, there was an agreement with Imperial Chemical Industries that they would relocate to the Hall if they lost their headquarters on Teesside. Fortunately, their offices were not bombed, and neither was Crathorne Hall. However, the only wartime loss was the fine iron railings between high brick piers along the southern end of the kitchen garden. These were removed to be melted down for aircraft production. Ironically, within days of their removal, the order was withdrawn when it was discovered that the material was unsuitable for aircraft production. Sadly, many places like Crathorne across the country lost fine metalwork to no avail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Cottages_by_church%2C_Crathorn_02.jpg/512px-Cottages_by_church%2C_Crathorn_02.jpg",
      "title": "Mainlymazza, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Cottages by church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Field_by_Manor_House_farm%2C_Crathorne_-_geograph.org.uk_-_1900946.jpg/512px-Field_by_Manor_House_farm%2C_Crathorne_-_geograph.org.uk_-_1900946.jpg",
      "title": "Field by Manor House farm, Crathorne by Paul Buckingham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Field by Manor House farm, Crathorne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Crathorne_cottages.jpg/512px-Crathorne_cottages.jpg",
      "title": "Victuallers, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Crathorne cottages"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Front_lawn%2C_Crathorne_Hall_Hotel_-_geograph.org.uk_-_2953326.jpg/512px-Front_lawn%2C_Crathorne_Hall_Hotel_-_geograph.org.uk_-_2953326.jpg?20211228060301",
      "title": "Front lawn, Crathorne Hall Hotel by Stanley Howe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Front lawn, Crathorne Hall Hotel. The size of Crathorne Hall perhaps reflected Violet Dugdale’s ambitions to launch her son into politics and her daughter into an advantageous marriage. These ambitions were realised as her daughter, Beryl, married the Earl of Rothes at Crathorne in 1926, and her son, Thomas Lionel (1897-1977), became the Conservative MP for the Richmondshire Division in 1929. Seven years later, Thomas married Nancy Tennant, a talented painter whose works hang in the Hall. Nancy was born in 1904 when her father was eighty-one, being the last of his 16 children. After the deaths of Thomas’s parents during the war, he and Nancy moved into the Hall. Sir Thomas Dugdale, as he became in 1945, served as Minister of Agriculture in Winston Churchill’s post-war cabinet. He resigned in 1954 over the Crichel Down affair, accepting full responsibility for mistakes made by civil servants in his department. This resignation on principle is still frequently cited in the media as a rare instance of a cabinet minister taking such a step. In 1959, 30 years after becoming an MP, he was created a Peer and became the first Lord Crathorne, sitting in the House of Lords. Thomas Dugdale’s life as an MP meant that many distinguished political figures of the day visited Crathorne Hall. These visits were enhanced by the cooking of Mrs Davidson, who was renowned for her game dishes, home-made soups, and rich desserts and cakes. She started working at the Hall in 1910 and only retired when the family moved out in 1977. The Hall had an excellent wine cellar, with port being a favourite; when the butler, Mr Jefferys, suggested serving “the usual,” it referred to a bottle of Taylors 1927 vintage. Another feature of the Hall was nursery tea with Nanny Messenger and the Dugdale’s sons, James and David. Nanny treated all guests, including Prime Ministers, with the same benevolence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Topiary_work_and_budding_bluebells_-_geograph.org.uk_-_2953601.jpg/512px-Topiary_work_and_budding_bluebells_-_geograph.org.uk_-_2953601.jpg?20211228070336",
      "title": "Topiary work and budding bluebells by Stanley Howe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Topiary work and budding bluebells. Apart from political guests, the Hall hosted figures like Lord Mountbatten, who spent a weekend repairing the boys’ train set, and Group Captain Douglas Bader, the Battle of Britain hero, whose visits were always lively. The Queen Mother attended a lunch party in March 1968, and Prince Charles visited with racing driver Graham Hill in 1974. Nancy Crathorne spent much of the 1960s restoring and running the Georgian Theatre Royal in Richmond, with many performers, including Edith Evans, Sybil Thorndyke, Yehudi Menuhin, and Benjamin Britten, staying at the Hall. In 1963, the entire cast of the Cambridge University Footlights Review, which included John Cleese, Tim Brooke-Taylor, Graham Chapman, and Bill Oddie, stayed for a week when Nancy's son James played the drums. Crathorne Hall also served as the centre of an agricultural estate and was a hub for village activities. Regular events included church fetes, Christmas parties for children, and sports days for the village school, alongside various charity events. The coming-of-age parties were significant village events, including the delayed celebration for Lionel’s son Tom in 1918, who survived 18 months of fighting at the front during a time when life expectancy was often measured in weeks."
    }
  ],
  "distance_km": 1.5,
  "description": "This walk explores the grounds of the Edwardian Crathorne Hall near Yarm. The 15 acre hotel grounds are private but can be explored by guests of the hotel or you could enjoy afternoon tea and then go for a stroll. The grounds include some nice woodland trails and views of the River Leven which runs through the park. The woodland walk has been nicely laid out and includes signposting and a number of wooden sculptures. It's great for wildlife too with a number of birdwatching stations where you can look out for a variety of woodland birds. There's also public footpaths around the pretty Crathorne village and Park Wood to the east of the hotel.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north into Yarm and you could enjoy a riverside walk along the waymarked Teesdale Way. For similar trails head to the nearby Coatham Woods, Wynyard Woodland Park or Cowpen Bewley Woodland Park."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HcE3pr0IW90",
  "postcode": "TS15 0AY",
  "district": "Crathorne",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Thirsk Road, Crathorne, North Yorkshire, York and North Yorkshire, England, TS15 0AY, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "sculptures",
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "footpaths"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "bird watching"
  ]
}