{
  "created_at": "2025-01-06T04:34:21.658146+00:00",
  "objectID": "60f6fa5981e83bc94a2232e3996a0f8c",
  "ref": "old-man-of-coniston-walking-route",
  "title": "Old Man of Coniston Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Coniston_Village_-_geograph.org.uk_-_1544554.jpg",
  "nearby": [
    {
      "description": "Coniston to Langdale",
      "objectID": "1bc4c0ac530b2f0dd2dfd8070c3b6303",
      "ref": "coniston-to-langdale-walking-route"
    },
    {
      "description": "Coniston Water",
      "objectID": "8ff1601a87dc5e5765d676448785d23a",
      "ref": "coniston-water-walking-and-cycle-route"
    },
    {
      "description": "Circular Walk around Coniston",
      "objectID": "82133708782e081385a4e42715aaf18f",
      "ref": "circular-walk-around-coniston-walking-route"
    },
    {
      "description": "Old Man of Coniston Circular Walk",
      "objectID": "9e2da444f0ee3df639414d5a1dd12614",
      "ref": "old-man-of-coniston-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/60f6fa5981e83bc94a2232e3996a0f8c.gpx",
  "_geoloc": {
    "lat": 54.3681567584,
    "lng": -3.0769604162
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Coniston_Village_-_geograph.org.uk_-_1544554.jpg",
      "title": "Peter Trimming / Coniston Village",
      "caption": "Coniston Village. The main street pictured from the bridge over Church Beck. Long Crag, the lower part of Yew Pike, dominates the skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Crowberry_Haws%2C_Coniston_-_geograph.org.uk_-_1542976.jpg",
      "title": "Peter Trimming / Crowberry Haws, Coniston",
      "caption": "Crowberry Haws. Crowberry Haws is in the foreground. In the background, is Wetherlam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Low_Water_-_geograph.org.uk_-_1403484.jpg",
      "title": "Michael Graham / Low Water",
      "caption": "Low Water. Corrie tarn under Coniston Old Man"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Above_Stubthwaite_Crag_-_geograph.org.uk_-_1402124.jpg",
      "title": "Michael Graham / Above Stubthwaite Crag",
      "caption": "Ascending the Old Man on the path up to the Low Water Quarries"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/The_Old_Man_-_summit_platform_with_Dow_Crag_beyond_-_geograph.org.uk_-_1373126.jpg",
      "title": "Ian Greig / The Old Man - summit platform with Dow Crag beyond",
      "caption": "The Old Man summit platform with Dow Crag beyond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Cairn_on_Coniston_Old_Man_Summit_-_geograph.org.uk_-_1542334.jpg",
      "title": "Peter Trimming / Cairn on Coniston Old Man Summit",
      "caption": "Cairn on Coniston Old Man Summit. A walker stood at a convenient position, in order to add a sense of scale to the magnificent cairn which stands on a plinth made of larger stones. I don't think that he realised that he was in my picture! According to the OS maps, based on the trig point, just a few yards to the left of picture, the height of The Old Man of Coniston is 803m."
    }
  ],
  "distance_km": 7.5,
  "description": "Climb the 2,634 feet (803 m) high Old Man of Coniston on this strenuous walk in the Lake District. It's just under 5 miles there and back so should take about 3-4 hours to complete. The route starts at Coniston village and soon joins Church Beck which you follow for about a mile before heading past Crowberry Haws, Stubthwaite Crag and the dramatically positioned tarn of Low Water to the summit. Here you will find a combined slate platform and cairn with magnificent views of Coniston Water, the southern Lake District, Morecambe Bay, Blackpool Tower, Winter Hill in the Pennines, the Lancashire coast and the Isle of Man. This route is popular with tourists and offers a direct and picturesque path to the summit. For a longer route around the fell try our Old Man of Coniston Circular Walk. After scaling the summit of the Old Man it visits several of the surrounding fells including Dow Crag, Buck Pike, Brown Pike and Walna Scar. For probably the shortest/easiest route to the summit see the Old Man Of Coniston Easy Route page. This one starts from the parking area at Walna Scar Road, closer to the summit. To extend your walking in the area you could try our 16 mile Circular Walk around Coniston which visits the tarns, fells and forest surrounding the lake. You can also try the Coniston to Langdale Walk, the 2nd leg of the epic long distance Cumbria Way. A short distance to the west of the summit you will find Dow Crag which is another fine viewpoint. Our Dow Crag and Seathwaite Tarn circular walk explores the Seathwaite Fells with lovely views of the nearby Goat's Water.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bluebird Cafe is located right next to Coniston Water. It does a great range of meals and snacks. There's also a lovely outdoor seating area with fine views across the lake. You can find it in the village at a postcode of LA21 8AN."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZcIPSLWg_is",
  "district": "Coniston",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}