{
  "objectID": "610c6b9952f5ceb41c56e743f6ca8a2d",
  "created_at": "2024-12-18T12:46:45.209775+00:00",
  "ref": "derwent-edge-walking-route",
  "title": "Derwent Edge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Derwent_Edge_-_geograph.org.uk_-_1316992.jpg",
  "nearby": [
    {
      "description": "Derwent Reservoir",
      "objectID": "0ef7dbe8936cd47120af76f1c111942e",
      "ref": "derwent-reservoir-walking-route"
    },
    {
      "description": "Stanage Edge",
      "objectID": "aeb98b950a0ea11aa9ec2496476800f5",
      "ref": "stanage-edge-walking-route"
    },
    {
      "description": "Ladybower Reservoir",
      "objectID": "dc9cd529b4225315fc364c4fc05f43f3",
      "ref": "ladybower-reservoir-walking-route"
    },
    {
      "description": "Bamford Edge",
      "objectID": "e9cbbfc99fac4954d698e8166d81df0e",
      "ref": "bamford-edge-walking-route"
    },
    {
      "description": "Alport Castles",
      "objectID": "70e16df7e630144c37a160e7fb7251f3",
      "ref": "alport-castles-walking-route"
    },
    {
      "description": "Derwent Valley Heritage Way",
      "objectID": "13871570524b1197efa9f0e608a7b222",
      "ref": "derwent-valley-heritage-way-walking-route"
    },
    {
      "description": "Thornhill Trail",
      "objectID": "5772ea16f51968d8ad1ebfc30f44a7f4",
      "ref": "thornhill-trail-walking-and-cycle-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/C65648CA968B8EFD85258100005243DD/$FILE/Derwent Edge.gpx",
  "_geoloc": {
    "lat": 53.4015392705,
    "lng": -1.7424538586
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Derwent_Edge_-_geograph.org.uk_-_1316992.jpg",
      "title": "Jay Haywood [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Derwent Edge. The area is notable for its unusual gritstone tors and its glorious views of the the Dark Peak landscape. These features coupled with its proximity to the city of Sheffield have made it a popular site for walkers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Derwent_Salt_Cellar.JPG/512px-Derwent_Salt_Cellar.JPG",
      "title": "Rob Bendall [Attribution], via Wikimedia Commons",
      "caption": "Derwent Salt Cellar. The most recognisable of the unusually shaped gritstone tors on the edge. These have been formed by the actions of wind, rain and frost over many centuries."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/White_Tor_on_Derwent_Edge_-_geograph.org.uk_-_160742.jpg",
      "title": "Barry Hurst / White Tor on Derwent Edge, via Wikimedia Commons",
      "caption": "White Tor on Derwent Edge.  Looking south to the A57 bridge over Ladybower Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Footpath_Along_Derwent_Edge_-_geograph.org.uk_-_590486.jpg",
      "title": "Steve Partridge / Footpath Along Derwent Edge, via Wikimedia Commons",
      "caption": "Footpath Along Derwent Edge Looking south from near Back Tor. Notable points seen from here are Cakes of Bread, Dovestone Tor, Salt Cellar, White Tor and the Wheelstones."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/View_Southwest_from_Whinstone_Lee_Edge_-_geograph.org.uk_-_3036695.jpg",
      "title": "View Southwest from Whinstone Lee Edge by John Topping, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View Southwest from Whinstone Lee Edge. The popularity of the area has led to some footpath erosion. Some of the most affected parts of the edge between The Salt Cellar and Lost Lad Hillend have been paved with natural stone slabs to reduce further damage as part of the Lottery Paths Project."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Derwent_Edge_highway_-_geograph.org.uk_-_3592985.jpg/512px-Derwent_Edge_highway_-_geograph.org.uk_-_3592985.jpg",
      "title": "Derwent Edge highway by Ian Paterson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Derwent Edge highway with pretty heather in late summer. Much of the moorland has been designated as a Site of Special Scientific Interest (SSSI) because of its special vegetation and rare birds and animals. These include the Eurasian golden plover, red grouse, ring ouzel and mountain hare. Rare species of plants such as common cottongrass, mountain strawberry, and crowberry grow in the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Northeast_view_from_Dovestone_Tor_-_geograph.org.uk_-_3052925.jpg",
      "title": "Northeast view from Dovestone Tor by John Topping, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Northeast view from Dovestone Tor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Back_Tor%2C_the_summit_rocks_from_the_south_-_geograph.org.uk_-_3422526.jpg",
      "title": "Back Tor, the summit rocks from the south by Andrew Hill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Back Tor, the summit rocks from the south. An Ordnance Survey column marks the highest point of the Edge at Back Tor (538 metres, 1765 feet). Just north of here the edge extends into Howden Edge and enters the county of South Yorkshire."
    }
  ],
  "distance_km": 13.0,
  "description": "Climb to this wonderful Millstone Grit escarpment and enjoy fabulous views back down to the numerous beautiful reservoirs below. It's a challenging circular walk climbing to a height of over 1700ft around Back Tor. You will be rewarded with stunning far reaching views over the Peak District. The area is also full of interesting flora and fauna. Look out for rare plants such as common cottongrass, mountain strawberry and crowberry. Wildlife includes Eurasian golden plover, red grouse, ring ouzel and mountain hare. The walk starts from the Fairholmes car park in between Ladybower Reservoir and Derwent Reservoir. Here you will find a great visitor centre which makes an excellent base for exploring the Derwent Valley. The trail heads north along Derwent Reservoir towards the impressive Derwent Dam. Just after Abbey Bank you turn east and start the climb to Lost Lad Hill, crossing Little Howden Moor and Greystones Moss. At the summit of Lost Lad there's a toposcope showing the surrounding hills. You can also see up to Back Tor, the next destination on the walk. From here there are fabulous views over the reservoirs below, Stanage Edge and the Kinder Plateau. From Back Tor you head south to Dovestone Tor and along the fantastic ridge path towards Derwent Edge. Around here there are some wonderful geological formations including the impresive Salt Cellar stone. It has a striking resemblance to a certain condiment holder! Even more impressive are the Wheel Stones (or Coach and Horses) which resemble a coach and horses on the horizon when viewed from the A57 road to the south. Shortly after passing the Wheel Stones you turn west and descend back to Ladybower Reservoir. The final section takes you along the water back to the car park. The visitor centre has a good cafe where you can refresh yourself after your adventure. To extend your walking in the area you can follow the waterside trail along Ladybower Reservoir and visit Lower Ladybower Reservoir. If you are interested in more exhilarating climbs then look no further than Stanage Edge and Bamford Edge which are both nearby. For geology enthusiasts Alport Castles with its spectacular formation of rocks, is a must see.",
  "video_url": "https://www.youtube.com/embed/OCNTRRW4fys",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}