{
  "created_at": "2025-01-06T01:38:32.203868+00:00",
  "objectID": "61555704a9a0b0749fd1fc084e491f41",
  "ref": "avon-valley-path-walking-route",
  "title": "Avon Valley Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Bickton_-_View_towards_Fordingbridge_-_geograph.org.uk_-_1012383.jpg",
  "nearby": [
    {
      "description": "Blashford Lakes",
      "objectID": "0e83f77a355df3bfdb1ba2c207ecbae7",
      "ref": "blashford-lakes-walking-route"
    },
    {
      "description": "Salisbury Circular Walk",
      "objectID": "03cb8dc1b9a6194e29fb9564b8a79092",
      "ref": "salisbury-circular-walk-walking-route"
    },
    {
      "description": "Christchurch Harbour",
      "objectID": "8752182f29690fd1df755e404b4985ba",
      "ref": "christchurch-harbour-walking-route"
    },
    {
      "description": "Godshill",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/61555704a9a0b0749fd1fc084e491f41.gpx",
  "_geoloc": {
    "lat": 51.0650819111,
    "lng": -1.7985557921
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Bickton_-_View_towards_Fordingbridge_-_geograph.org.uk_-_1012383.jpg",
      "title": "Dave Bevis / Bickton - View towards Fordingbridge, via Wikimedia Commons",
      "caption": "Bickton - View towards Fordingbridge. The River Avon is in the foreground. The tower of St Mary's Church, Fordingbridge, can be seen in the middle distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/River_Avon_and_bridge_at_Fordingbridge.JPG/512px-River_Avon_and_bridge_at_Fordingbridge.JPG",
      "title": "(Wellington) [Public domain], via Wikimedia Commons",
      "caption": "River Avon and bridge at Fordingbridge. The bridge is 40 metres long and consists of seven stone arches. As such it is one of just two bridges with seven arches in the UK. It dates from the medieval period."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Ibsley_bridge_River_Avon_Hampshire_-_geograph.org.uk_-_158536.jpg",
      "title": "Clive Perrin / Ibsley bridge River Avon Hampshire, via Wikimedia Commons",
      "caption": "Ibsley bridge over the River Avon. Rebuilt from the foundations with two additional spans, by the County Council in 1930."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/River_Avon_near_Ibsley_-_geograph.org.uk_-_1281474.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Avon near Ibsley. The river rises in the Vale of Pewsey and flows through Wiltshire, Hampshire and Dorset to the sea at Christchurch. The river and its tributaries form one of the most diverse chalk stream systems in England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Spinnaker_Sailing_Club_on_Blashford_Lake_-_geograph.org.uk_-_804642.jpg",
      "title": "Peter Facey / Spinnaker Sailing Club on Blashford Lake",
      "caption": "Spinnaker Sailing Club on Blashford Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Christchurch_-_Harbour_-_geograph.org.uk_-_1763558.jpg",
      "title": "Chris Talbot / Christchurch - Harbour",
      "caption": "Christchurch Harbour at the end of the route"
    }
  ],
  "distance_km": 55.0,
  "description": "This wonderful river valley footpath takes you from Salisbury to Christchurch on the South Coast. You start by the magnificent cathedral in Salisbury and head south towards Downton. The path then continues through Woodgreen and Godshill Wood before you arrive at the lovely Hampshire town of Fordingbridge. The next section is a particularly pleasant waterside path taking you along the River Avon to Ibsley where the path passes through the Blashford Lakes which has a variety of wildlife to enjoy. The final section then follows the river into Christchurch where you finish at Christchurch Harbour and Priory .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Fordingbridge The George is a great place for a pit stop. The 18th Century pub is set on the banks of the River Avon overlooking \"The Great Bridge\". It is the town's oldest surviving inn, having been situated on this prime riverside site since at least 1593. You can sit outside in the garden area and enjoy fine views over the river with your meal. If the weather is good it's the perfect spot to relax and take in the surroundings. You can find them at 14 Bridge Street with a postcode of SP6 1AH for your sat navs. They are also dog friendly if you have your canine friend with you. Just south of Fordingbridge you'll find the little village of Ibsley where there's another noteworthy old pub to investigate. The Old Beams Inn dates all the way back to the 11th century and includes a picturesque thatched roof. The gastropub also includes front and rear gardens with a raised wooden terrace. Inside is cosy and comfortable with a log fire for the winter months. They are located very close to the river at Salisbury Road with a postcode of BH24 3PP. In the New Forest's Godshill there's the Fighting Cocks to consider. The inn serves great homemade food which you can enjoy outside in the garden area. Careful the donkeys and ponies don't steal your food though as there are generally quite a few of them milling around the pub! You can find them on Southampton Road at postcode SP6 2LL for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Dorset Walks, Hampshire Walks, Wiltshire Walks and New Forest Walks pages."
    }
  ],
  "district": "Salisbury",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}