{
  "created_at": "2025-01-06T03:48:45.942025+00:00",
  "objectID": "61889b16a103a11952a5e12db61d90e6",
  "ref": "boscastle-to-tintagel-walk-walking-route",
  "title": "Boscastle to Tintagel Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Entrance_to_the_harbour%2C_Boscastle_-_geograph.org.uk_-_1325014.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Crackington Haven",
      "objectID": "ca3b6107567323742761b9b416b4833f",
      "ref": "crackington-haven-walking-route"
    },
    {
      "description": "Boscastle to Crackington Haven Walk",
      "objectID": "aa53ddf17ccf1d05060530e074da73bf",
      "ref": "boscastle-to-crackington-haven-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/61889b16a103a11952a5e12db61d90e6.gpx",
  "_geoloc": {
    "lat": 50.6901038742,
    "lng": -4.6951494474
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Entrance_to_the_harbour%2C_Boscastle_-_geograph.org.uk_-_1325014.jpg",
      "title": "Humphrey Bolton / Entrance to the harbour, Boscastle, via Wikimedia Commons",
      "caption": "Entrance to the harbour, Boscastle The winding entrance might reduce the force of the waves during high sea levels and gales, but the rocks at the side and in the channel must be a hazard to shipping."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Forrabury_and_Minster%2C_Meachard_and_Penally_Point_-_geograph.org.uk_-_842702.jpg",
      "title": "Martin Bodman / Forrabury and Minster: Meachard and Penally Point, via Wikimedia Commons",
      "caption": "Forrabury and Minster: Meachard and Penally Point. Meachard is the island. The entrance to Boscastle harbour lies beyond the grass tussocks. Seen from the South West Coast Path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Grower_Rock_-_geograph.org.uk_-_1378404.jpg",
      "title": "Trevor Rickard / Grower Rock, via Wikimedia Commons",
      "caption": "Grower Rock, near to Trevalga, Cornwall, Great Britain. View north-east along the rugged coastline to the Grower Rock sea stack. Beyond is Willapark and Meachard island marking the entrance to Boscastle Harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Long_Island_-_geograph.org.uk_-_481279.jpg/512px-Long_Island_-_geograph.org.uk_-_481279.jpg",
      "title": "Trevor Rickard / Long Island, via Wikimedia Commons",
      "caption": "View to Long Island which lies just off Firebeacon Hill. Pretty heather in the foreground"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Headland_and_Barras_Nose_-_geograph.org.uk_-_218874.jpg",
      "title": "Pam Brophy / Headland and Barras Nose, via Wikimedia Commons",
      "caption": "Headland and Barras Nose. This headland, east of The Island which contains some of Tintagel castle, is viewed from the mainland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Sea_Stack_Tintagel_-_geograph.org.uk_-_687026.jpg",
      "title": "Ray Beer / Sea Stack Tintagel, via Wikimedia Commons",
      "caption": "A sea stack off Tintagel Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Tintagel_-_geograph.org.uk_-_401634.jpg",
      "title": "Lynda Poulter / Tintagel, via Wikimedia Commons",
      "caption": "The Tintagel castle ruins are on the cliffs on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Ruin%2C_Tintagel_-_geograph.org.uk_-_1384175.jpg/512px-Ruin%2C_Tintagel_-_geograph.org.uk_-_1384175.jpg",
      "title": "Humphrey Bolton / Ruin, Tintagel, via Wikimedia Commons",
      "caption": "Ruin, Tintagel. This is a short distance down from the ruined watermill, and might have been the miller's cottage. It is built 'back-to-earth', and has been repaired with bricks at some time."
    }
  ],
  "distance_km": 6.2,
  "description": "This is a popular coastal walk from the village of Boscastle to Tintagel in Cornwall. The route runs for a distance of 4 miles using a lovely section of the South West Coast Path. It's an undulating path, with a few climbs along the way. The walk starts from the parking area at the visitor centre in Bocastle. From here you can pick up the waymarked coast path and follow it to Bocastle Harbour. There's nice views over the picturesque harbour to Penally Point and the small rocky island Meachard. The route continues along the rugged coast around Grower Rock, Firebeacon Hill, Trambley Cove and Benoath Cove. The path then passes the striking headland of Barras Nose before coming to Tintagel. The castle ruins are in a spectacular location with the remaining ruins linked by a wonderful footbridge created by English Heritage (view the video below for more information on this). This allows people to enjoy a view which hasn't been seen for about 500 years as the original natural land bridge collapsed in the 15th century. It's a spectacular sight and one of the major highlights of the English Coast. The castle has a long association with legends related to King Arthur. This began in the 12th century when Geoffrey of Monmouth described Tintagel as the place of Arthur's conception in his fictionalized account of British history, Historia Regum Britanniae. After exploring the site you can stroll into the pretty Tintagel village, located just to the east of the castle. Here you can visit King Arthur's Hall which contains some works of art relating to the Arthurian legend and is now a popular visitor attraction for Arthurian enthusiasts.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's lots of great options for refreshments in Tintagel village. Charlie's can be found in the centre of the village and well worth a visit. It's a small, well established, family restaurant and delicatessen with great food and a nice outdoor seating area. You can find in an old 14th century cottage located on Fore St with a postcode of PL34 0DA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The castle is dog friendly but you are advised to keep them on short leads as there are a lots of steps and cliff edges."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you wanted to extend the walk you could continue south along the coast path and visit the lovely beach at Trebarwith Strand. It has 800m of sandy beach, contained by cliffs, in which natural caves are found. There's also the delightful St Nectan's Glen in nearby Trethevy. There's nice footpaths here with woodland, river paths and waterfalls to see. The glen's most prominent feature is St Nectan's Kieve, a spectacular sixty foot waterfall through a hole in the rocks. It's located about a mile north east of the village and one of the most popular tourist destinations in the area. If you continue north along the coast path you can pick up the circular Crackington Haven Walk. It's another popular local area for walking with fine cliff top views and a nice beach. There's good facilities too with a car park and a beach-side pub with sea views. The walk also includes a visit to the historic Norman church at the little hamlet of St Gennys. The Boscastle to Crackington Haven Walk will take you to the village, notably passing High Cliff, the highest point on the Cornish coast."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YCHjpbyuuLw",
  "postcode": "PL35 0AD",
  "district": "Boscastle",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Boat House, New Road, Forrabury and Minster, Boscastle, Cornwall, England, PL35 0AD, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "legends"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}