{
  "created_at": "2025-01-06T11:17:16.511006+00:00",
  "objectID": "61cfc88ddf55437e36dd6ba4bd900600",
  "ref": "the-cobbler-mountain-walking-route",
  "title": "The Cobbler Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cd/The_Cobbler_-_geograph.org.uk_-_11251.jpg",
  "nearby": [
    {
      "description": "Arrochar",
      "objectID": "fb200f019b2b9cebd69667572b581c59",
      "ref": "arrochar-walking-route"
    },
    {
      "description": "Loch Long",
      "objectID": "a6b84604bd22344bad9ce51128c201a2",
      "ref": "loch-long-walking-route"
    },
    {
      "description": "Ben Lomond",
      "objectID": "d42de9797300c992ac7398241540a16d",
      "ref": "ben-lomond-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/61cfc88ddf55437e36dd6ba4bd900600.gpx",
  "_geoloc": {
    "lat": 56.2068029166,
    "lng": -4.7509529849
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/The_Cobbler_-_geograph.org.uk_-_11251.jpg",
      "title": "Richard Webb / The Cobbler",
      "caption": "Taken from the Southeast ridge, on the way to climb the South top. The Cobbler (OS posh name Ben Arthur, which is almost never used) is an iconic Scottish hill. In a country obsessed with 3000' hills, the much lower Cobbler is still extremely popular, on account of its shape, exciting peaks and easy accessibility from Glasgow, by road or rail. The name is supposedly derived from a resemblance of a cobbler (North top, right) bent over his last (centre top). His wife, Jean (South top, left) looks on."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/The_summit_of_The_Cobbler._-_geograph.org.uk_-_11249.jpg",
      "title": "Richard Webb / The summit of The Cobbler.",
      "caption": "The summit. The weird peaks of the Cobbler are the remnants of a hill that has suffered landslips. Large quantities of rock have slipped away leaving a chain of three distinctive peaks. Here the central and highest peak is being climbed by its usual cunning route. It is not a rockclimb, but requires nerve and a head for heights. The climber is on a ledge which is accessed by crawling through a hole in the peak. At the end of the ledge a scramble up blocks leads to the tiny summit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/The_North_Peak_of_The_Cobbler._-_geograph.org.uk_-_11250.jpg",
      "title": "Richard Webb / The North Peak of The Cobbler.",
      "caption": "The North Peak. Of the three peaks, the north is the most spectacular. It is made of beaks of overhanging rock jutting over a void. The irony is that this is by far the easiest of the three to visit, and is a simple walk \"round the back\". However there are people in this photo who relish the challenge of those overhanging crags and are climbing the famous route Punsters Crack."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Monadh_Liath_-_geograph.org.uk_-_760227.jpg",
      "title": "Richard Webb / Monadh Liath",
      "caption": "Monadh Liath. Looking across Loch Long from Arrochar to the hillside beneath the Cobbler. This is now growing a second crop of trees. After the first generation was felled the chance was taken to build a path up to the Allt a' Bhalachain making access to the Cobbler a little less unpleasant on the calf muscles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/South_Peak_of_The_Cobbler_-_geograph.org.uk_-_1431248.jpg",
      "title": "Mark Nightingale / South Peak of The Cobbler",
      "caption": "South Peak. Much harder to attain than the other two peaks on The Cobbler: bring a rope!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/The_Needle_of_The_Cobbler_%28Ben_Arthur%29_-_geograph.org.uk_-_396218.jpg",
      "title": "David Neill / The Needle of The Cobbler (Ben Arthur)",
      "caption": "The Needle. The best known of the \"Arrochar Alps\". Climbing the final outcrop is known as \"threading the needle\" and was once used as a test of manhood for prospective clan chiefs. It involves wriggling through gaps, blind holds, and a fall of around 150 feet if you get it wrong."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Looking_down_the_Cobbler-Narnain_path_-_geograph.org.uk_-_1805022.jpg",
      "title": "Gordon Brown / Looking down the Cobbler/Narnain path",
      "caption": "Looking down the Cobbler/Narnain path. This path is beautifully engineered and goes all the way up to the Bealach a'Mhaim, before it divides into paths to The Cobbler, Ben Narnain and Ben Ime."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/A_climber_on_the_SE_cliffs_of_the_North_peak_of_Beinn_Artair_-_geograph.org.uk_-_1807703.jpg/512px-A_climber_on_the_SE_cliffs_of_the_North_peak_of_Beinn_Artair_-_geograph.org.uk_-_1807703.jpg",
      "title": "A climber on the SE cliffs of the North peak of Beinn Artair by Alan Murray Walsh, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A climber on the SE cliffs of the North peak of Beinn Artair"
    }
  ],
  "distance_km": 9.0,
  "description": "The Cobbler or Ben Arthur is one of the most popular climbs in the highlands. At 884 m (2,900 ft) it is not the highest of the Arrochar Alps but is considered the most spectacular. It gets its name from the distinctive, large rocky summit which look like a cobbler bending over his last. The walk begins at the car park at the eastern end of Loch Long near Arrochar. It then follows a well defined and partially waymarked path to the summit. The first section ascends through the woodland around Loch Long and climbs quite gently to the Narnain boulders which make a good resting point. You continue to a small Lochan where you turn left and ascend the stone steps. Shortly after you will come to the high point which requires turning right from the path. From here there are fabulous panoramic views across the Highlands, Loch Long, the Paps of Jura and Cuillins. The walk descends to rejoin the same path used for the ascent which you follow to the finish point.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the south east there's another hugely popular climb at Ben Lomond. There's wonderful views over Loch Lomond from this prominent munro. For more walking ideas in the area see the Loch Lomond and the Trossachs Walks page."
    }
  ],
  "postcode": "G83 7AP",
  "district": "Succoth",
  "county": "Argyll and Bute",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}