{
  "created_at": "2025-01-06T02:27:10.383329+00:00",
  "objectID": "61d46d01c2e5207fb35dce04e75fc225",
  "ref": "happisburgh-walking-route",
  "title": "Happisburgh Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/The_High_Light_at_Happisburgh_-_geograph.org.uk_-_978614.jpg",
  "nearby": [
    {
      "description": "Bacton Woods",
      "objectID": "87326631fb0a52509740b3bfcf9ee1fe",
      "ref": "bacton-woods-walking-and-cycle-route"
    },
    {
      "description": "Cromer to Mundesley Walk",
      "objectID": "af8455745f601d7222be0667bbd051b1",
      "ref": "cromer-to-mundesley-walk-walking-route"
    },
    {
      "description": "Mundesley",
      "objectID": "cb9c3854b947a1d494fb4105ff8ce0ca",
      "ref": "mundesley-walking-route"
    },
    {
      "description": "North Walsham and Dilham Canal",
      "objectID": "62985357e8c2c1ecd8e8b9591442e931",
      "ref": "north-walsham-and-dilham-canal-walking-route"
    },
    {
      "description": "Horsey Windpump and Horsey Mere",
      "objectID": "371970f0651307ba8d05d511a542270d",
      "ref": "horsey-windpump-and-horsey-mere-walking-route"
    },
    {
      "description": "Winterton on Sea",
      "objectID": "9251eccdacca90df6a1cf4c8ca2d363f",
      "ref": "winterton-on-sea-walking-route"
    },
    {
      "description": "Sea Palling",
      "objectID": "0fdda5d404866540f6aff9f6731e4f0e",
      "ref": "sea-palling-walking-route"
    },
    {
      "description": "Hemsby",
      "objectID": "d89c41067f9a565fe4b83e044f7d2a74",
      "ref": "hemsby-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/61d46d01c2e5207fb35dce04e75fc225.gpx",
  "_geoloc": {
    "lat": 52.8199594987,
    "lng": 1.5350499756
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/The_High_Light_at_Happisburgh_-_geograph.org.uk_-_978614.jpg",
      "title": "Evelyn Simak / The High Light at Happisburgh",
      "caption": "The High Light at Happisburgh - route start. Guarded by two WWII pillboxes (Defence of Britain database reference numbers S0000878 and S0000880). Happisburgh Lighthouse was built in 1790; it is the oldest working light in East Anglia, and the only independently run lighthouse in Great Britain. Two lighthouses were built after 70 sailing ships and 600 men were lost during a severe winter storm in 1789 - Low Light was situated on the cliftop but has since tumbled into the sea, and High Light, located 400 yards inland from it, which still stands. Its tower is 85ft tall and the lantern is 134ft above sea level. The Low Light was discontinued in 1883; the pair formed leading lights marking safe passage around the southern end of the treacherous Haisborogh Sands."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Happisburgh_Manor_-_geograph.org.uk_-_799594.jpg",
      "title": "Evelyn Simak / Happisburgh Manor",
      "caption": "Happisburgh Manor. Happisburgh Manor (St Marys) is a seminal Arts & Crafts house built in 1900 by Detmar Blow for the Cator family as a seaside villa."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Clay_outcrops_at_Low_Light_-_geograph.org.uk_-_978609.jpg/256px-Clay_outcrops_at_Low_Light_-_geograph.org.uk_-_978609.jpg",
      "title": "Evelyn Simak / Clay outcrops at Low Light",
      "caption": "Clay outcrops at Low Light. A walk along the clifftop path from Eccles on Sea to the village of Happisburgh, a short distance further to the northwest, provides evidence of coastal erosion; this stretch of coastline is called Low Light and it is unprotected from wave action. On the beach below outcrops of clay can be seen that have, so far, withstood the power of the waves. It won't take long before they too are being smoothed over and washed away. After the devastating floods in 1953, where 300 people lost their lives, the first sea defences were built and later extended, using greenheart and jarrah wood, combined with steel, for the groynes and revetments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Clifftop_path_to_Happisburgh_-_geograph.org.uk_-_978635.jpg",
      "title": "Evelyn Simak / Clifftop path to Happisburgh",
      "caption": "Clifftop path to Happisburgh. The path starts where Doggetts Lane ends; it leads from Eccles on Sea to the village of Happisburgh, the lighthouse of which can be seen in mid-distance, across a harvested cereal field"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/St_Mary%27s_Church%2C_Happisburgh_-_geograph.org.uk_-_34224.jpg",
      "title": "Katy Walters / St Mary's Church, Happisburgh",
      "caption": "St Mary's Church, Happisburgh. Questions have been raised as to the church's future safety, given the erosion rates in the area (see e.g. TG3830). The lighthouse in the background is also in TG3830. The church dates from the 15th century and includes a 110ft tower. You can climb to the top of the tower for wonderful views over the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/The_beach_at_Walcott_Gap_-_revisited_-_geograph.org.uk_-_719827.jpg",
      "title": "Evelyn Simak / The beach at Walcott Gap - revisited",
      "caption": "The beach at Walcott Gap. Looking northwest along Walcott beach towards grid square TG3633, which is described as having a land percentage of 1%. The southwestern-most edge of the square lies a short distance east of the seaward end of the groyne seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Village_sign%2C_Walcott_-_geograph.org.uk_-_1035895.jpg/256px-Village_sign%2C_Walcott_-_geograph.org.uk_-_1035895.jpg",
      "title": "Evelyn Simak / Village sign, Walcott",
      "caption": "Village sign, Walcott. The village sign is located beside the Coast Road, on the southern edge of Walcott The view was taken across a stubble field, in westerly direction towards Mill Common and Mill Common Road, the course of which is denoted by the line of trees seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Walcott_Hall_-_geograph.org.uk_-_566870.jpg",
      "title": "Evelyn Simak / Walcott Hall",
      "caption": "Walcott Hall - just west of the village. Originally there were two Halls in Walcott, East Hall and West Hall. The earliest mention of the Walcott family in northeast Norfolk is in East Hall. William de Edgefield's (1154 to 1189) mother, Maud de Walcott, granted two parts of the tithe of her lands in Walcott to the monks of Broomholm Priory in Bacton. In 1240 and possibly 1281, Thomas de Walcott held part of the advowson (income) of Walcott church and was lord of West Hall. The house depicted above appears to be the farmhouse."
    }
  ],
  "distance_km": 6.0,
  "description": "This pretty little village is located in a lovely spot on the Norfolk coast. It's a delightful place with a sandy secluded beach, a striking 18th century lighthouse and a historic 15th century church to see. The village also became archaeologically significant in 2010 when flint tools over 800,000 years old were unearthed. This is notable as the oldest evidence of human occupation anywhere in the UK. This circular walk from the village takes you along the coast to neighbouring Walcott before returning on inland footpaths. It's a flat, easy walk with lovely coast and country views throughout. The walk starts from Happisburgh Lighthouse before heading to the coastal path. You follow this north west along the beach to the village of Walcott. It's a nice cliff top path though you will notice the coastal erosion in this area. The route then leaves the coast and returns to Happisburgh on an inland public footpath passing Church Farm and St Mary's Church on the way.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The beach trails around the village are dog friendly so you'll probably see other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue north along the coastal path you will soon come to Bacton and Mundesley. It's a pretty village with another lovely beach and the Cromer to Mundesley Walk to try. Head inland and you could visit the interesting town of North Walsham where you can pick up the North Walsham and Dilham Canal. The peaceful woodland trails in Bacton Woods are also nearby. Head south along the cliff path and it will take you to Eccles on Sea and Sea Palling where there's a blue flag beach and sand dunes to explore. This section also has evidence of the severe coastal erosion in this area. Beyond Sea Palling there's one of the highlights of the area at Horsey Windpump and Horsey Mere. There's lovely lakeside paths and fine views over the area from the top of the windpump. You can also visit the worthy seaside villages Winterton on Sea and Hemsby from here. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/yEzqjI3Ka5M",
  "district": "Happisburgh",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}