{
  "created_at": "2025-01-06T00:32:20.760847+00:00",
  "objectID": "6249ed5f9d46bc3c4f9606d0a06ada68",
  "ref": "fleam-dyke-and-roman-road-walking-route",
  "title": "Fleam Dyke and Roman Road Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Edge_of_the_Fens_-_geograph.org.uk_-_1161129.jpg",
  "nearby": [
    {
      "description": "Wandlebury Country Park",
      "objectID": "d86ae8a474db0bb59dfdd11d4adb1b7a",
      "ref": "wandlebury-country-park-walking-route"
    },
    {
      "description": "Gog Magog Hills",
      "objectID": "6509fabe604a0870d8c384b14db027dd",
      "ref": "gog-magog-hills-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6249ed5f9d46bc3c4f9606d0a06ada68.gpx",
  "_geoloc": {
    "lat": 52.1705038361,
    "lng": 0.1816328025
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Edge_of_the_Fens_-_geograph.org.uk_-_1161129.jpg",
      "title": "Hugh Venables / Edge of the Fens",
      "caption": "Sloping chalky ground rising up from the edge of the Fens. Looking towards Fleam Dyke."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Fleam_Dyke_at_Mutlow_Hill_-_geograph.org.uk_-_1259231.jpg/256px-Fleam_Dyke_at_Mutlow_Hill_-_geograph.org.uk_-_1259231.jpg",
      "title": "Bob Jones / Fleam Dyke at Mutlow Hill",
      "caption": "Fleam Dyke at Mutlow. Hill Mutlow Hill is a Bronze Age burial mound. Excavations in the mid-19th century suggest that the Romans re-used Mutlow Hill as a shrine or sacred place. Mutlow Hill continued to be used as a meeting place in medieval times, from where its name derives - Old English 'Moot-Law' or meeting hill. Fleam Dyke crosses the top of the mound, supplementing its defensive role."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Fleam_Dyke_looking_NW_-_geograph.org.uk_-_1017317.jpg",
      "title": "Keith Edkins / Fleam Dyke looking NW",
      "caption": "Fleam Dyke looking NW. This quote is from the information notice boards at the site: \"Fleam Dyke is one of Cambridgeshire's most impressive earthworks and a rare surviving example of a chalk grassland environment. Excavations have shown that the Dyke began as a small rampart and ditch in the late 5th century AD. The ditch was enlarged and the rampart reinforced in the sixth century and again in the early 7th cenury. It was probably built by the East Anglian Saxons to control the Icknield Way, the ancient routeway into East Anglia from the west.\" The profile of the dyke is well displayed by the dry grass in the section featured in the photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Fleam_Dyke%2C_near_Fulbourn_-_geograph.org.uk_-_1259202.jpg/256px-Fleam_Dyke%2C_near_Fulbourn_-_geograph.org.uk_-_1259202.jpg",
      "title": "Bob Jones / Fleam Dyke, near Fulbourn",
      "caption": "Fleam Dyke, near Fulbourn. This earthwork runs for four miles in a north-west/south-east direction, between the villages of Fulbourn and Balsham. It is generally assumed to be Anglo-Saxon in origin, although archaeological finds of early and late Bronze Age origin seem to indicate that much older earthworks existed at this location. Fleam Dyke was originally much longer, but has been reduced in length over the years through farming activities. The dyke is one of a number of earthworks in South Cambridgeshire, designed to control and restrict the movement of people. The other earthworks in the vicinity are Devil's Dyke, Brent Ditch and Bran Ditch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Tree_on_the_line_of_Fleam_Dyke_-_geograph.org.uk_-_1017242.jpg",
      "title": "Keith Edkins / Tree on the line of Fleam Dyke",
      "caption": "Tree on the line of the Dyke. You can see one of the information notice boards at the foot of the tree."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Course_of_old_railway_near_Fleam_Dyke_-_geograph.org.uk_-_1017186.jpg",
      "title": "Keith Edkins / Course of old railway near Fleam Dyke",
      "caption": "Course of old railway near the Dyke. The first railway line to Newmarket was the Newmarket and Chesterford Railway Company. It opened in 1848 and closed in 1851 when the line from Newmarket to Cambridge was opened."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Fields_and_woods_near_Gunner%27s_Hall_-_geograph.org.uk_-_999661.jpg",
      "title": "Keith Edkins / Fields and woods near Gunner's Hall",
      "caption": "Fields and woods near Gunner's Hall on the Roman Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/View_NW_along_the_Roman_Road_-_geograph.org.uk_-_998788.jpg",
      "title": "Keith Edkins / View NW along the Roman Road",
      "caption": "View NW along the Roman Road near Wandlebury Country Park."
    }
  ],
  "distance_km": 40.0,
  "description": "This circular walk explores an area of chalk grassland woodland, and farmland using the Roman Road and Fleam Dyke just to the south east of Cambridge. The walk takes place on well-maintained footpaths, bridleways and byways through gently undulating countryside and is waymarked throughout. The route visits Horseheath, West Wickham and West Wratting. Both the Roman Road and Fleam Dyke are significant archaeological sites with sections that are classified as scheduled ancient monuments. The walk starts near Wandlebury Country Park so you could use the car park there.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near the start/end of the route you could pop into Wandlebury Park and enjoy a bite to eat at the on site pop up cafe. It is generally open on weekends during the daytime. You could also stop off in Fulbourn and visit the White Hart. It's a traditional English pub set in an old coaching inn and serving good quality home made food. They have a nice garden area and can be found at 1 Balsham Road with postcode CB21 5BZ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is a nice one to do with your dog and the White Hart mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend the walk you could enjoy a climb to the Iron Age Hillfort in Wandlebury Park. The hill is part of the Gog Magog Hills where there are more fine views and walking trails to try. Head into the nearby city of Cambridge and you could try the popular Cambridge Backs Walk which explores the historic university. Just a few miles to the west there's the worthy village of Haslingfield. Here you'll find pleasant walks along the River Rhee, rows of quaint thatched cottages, a church dating back to the 12th century and a noteworthy Tudor Manor House where Queen Elizabeth I stayed during the 16th century. Near here there's also the new settlement of Cambourne. There's some pleasant walks around this modern village with a lovely local nature reserve to explore. The wildlife rich reserve includes pretty lakes, wildflower meadows and wetland areas. On the walk you can also visit the ancient Bourn Windmill, the oldest surviving windmill in the United Kingdom. Just to the south there's also the stunning gardens at the historic Wimpole Hall. For more walking ideas in the area see the Cambridgeshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_f-Std9lzLU",
  "county": "Cambridgeshire",
  "region": "Cambridgeshire and Peterborough",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Roman Road, Fulbourn, Cambridge, Cambridgeshire, Cambridgeshire and Peterborough, England, CB22 3AB, United Kingdom",
  "postcode": "CB22 3AB",
  "district": "Cambridge",
  "state": "England"
}