{
  "created_at": "2025-01-06T00:45:10.454113+00:00",
  "objectID": "6284f1065f56634c402dcac5930eba55",
  "ref": "skipton-castle-walking-route",
  "title": "Skipton Castle Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Waterfall_in_to_River_Behind_Skipton_Castle_-_panoramio.jpg/512px-Waterfall_in_to_River_Behind_Skipton_Castle_-_panoramio.jpg",
  "nearby": [
    {
      "description": "Skipton Circular Walk",
      "objectID": "65cf73eba8d736c43551bad12a5c249d",
      "ref": "skipton-circular-walk-walking-route"
    },
    {
      "description": "Skipton Canal",
      "objectID": "df8f6462bb9007ff9a59befc5fa4f06b",
      "ref": "skipton-canal-walking-route"
    },
    {
      "description": "Embsay Reservoir",
      "objectID": "5fb461b9ca92b87916e78928d25156ce",
      "ref": "embsay-reservoir-walking-route"
    },
    {
      "description": "Silsden",
      "objectID": "32572dc65f518d88678873ba6b76c1f7",
      "ref": "silsden-walking-route"
    },
    {
      "description": "Sharp Haw",
      "objectID": "03fc712a8498d7dce9e6a85125f52d23",
      "ref": "sharp-haw-walking-route"
    },
    {
      "description": "Lady Anne's Way",
      "objectID": "010425956e7dd46f635509c1e3a9ba33",
      "ref": "lady-annes-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6284f1065f56634c402dcac5930eba55.gpx",
  "_geoloc": {
    "lat": 53.9654141582,
    "lng": -2.0136019818
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Waterfall_in_to_River_Behind_Skipton_Castle_-_panoramio.jpg/512px-Waterfall_in_to_River_Behind_Skipton_Castle_-_panoramio.jpg",
      "title": "Peter Hawes, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Waterfall into the river. Behind Skipton Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Round_Dam%2C_Skipton_Woods_-_geograph.org.uk_-_42339.jpg",
      "title": "rozinante / Round Dam, Skipton Woods",
      "caption": "Round Dam, Skipton Woods. The mill pond itself is apparently known as Round Dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Southern_end_of_Skipton_Wood.jpg",
      "title": "Rose and Trev Clough / Southern end of Skipton Woods",
      "caption": "Southern end of the woods. On the right is a leat (artificial water channel), built to feed a sawmill and corn mill. Just before the shed at the end of the leat there is an overflow which cascades down the slope to the Eller Beck at the left. These woods are owned by Skipton Castle and managed by the Woodland Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Path_leaving_Skipton_Wood.jpg",
      "title": "Rose and Trev Clough / Path leaving Skipton Woods",
      "caption": "Southern end of the woods, with the Eller Beck on the left. The overflow from a mill leat runs across the path near the gate. The remains of a footbridge which used to be there are lying on the bank, left of the dog in the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Skipton_Castle_-_geograph.org.uk_-_832643.jpg",
      "title": "Gerald England / Skipton Castle",
      "caption": "The ramparts of Skipton Castle as viewed from the Springs Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Path_through_Skipton_Wood.jpg",
      "title": "Bryan Pready / Path through Skipton Woods",
      "caption": "Autumn leaves on a footpath in the woods"
    }
  ],
  "distance_km": 2.5,
  "description": "Explore the grounds and woods surrounding this medieval castle in North Yorkshire. The walk takes you along the river which runs past the castle and then into the nearby Skipton Woods where you'll find pleasant woodland trails. You then head up to Park Hill where there are great views of the town and castle. You can also explore the castle grounds with the Tudor courtyard, 12th-century chapel, Conduit Court and twin-towered Norman gatehouse. To extend your walking in the Skipton area you can try our Skipton Canal Walk and enjoy a waterside stroll to Gargrave. The Skipton Circular Walk is another good local option. The route takes you into Airedale and climbs Sharp Haw Fell for wonderful views over the town and the surrounding Yorkshire Dales countryside. There's also a pleasant waterside section along the Leeds Liverpool Canal .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the castle grounds there are some delightful tea rooms for post walk refreshments. They do a good range of homemade meals and snacks. If you fancy a pub lunch then The Castle Inn is a good choice. The old pub dates back to the 19th century when it used to be a coaching inn. They have a good menu and a nice outdoor area for warmer weather. You can find them at 2 Mill Bridge with a postcode of BD23 1NJ for your sat navs. The Cock and Bottle is another worthy option in the town. The historic former coaching inn dates back to the 18th century and includes a charming old interior with a stone fireplace and wood-beamed ceiling. Outside there's a nice beer garden. You can find them at 30 Swadford St, BD23 1RD. The pub is dog friendly."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are ideal for dog walking and you're also allowed to take them around the castle grounds on leads. The Castle Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just north of the Skipton you'll find Embsay Reservoir. There's an easy circular trail to follow around this pretty little lake. You can also visit the Embsay and Bolton Abbey Railway at Embsay Railway Station. Here you can enjoy a ride on a vintage steam locomotive from Embsay via Draughton Sidings, Holywell and Stoneacre Loop to Bolton Abbey. The heritage railway is a great way to explore the area and view the lovely dales scenery from the comfort of a classic old rail carriage. It's one of the highlights of the Skipton area and makes a fine addition to your outing. The long distance Lady Anne's Way starts in Skipton. It runs through the Yorkshire Dales to Penrith, passing several historic buildings associated with Lady Anne Clifford. The noteworthy Noblewoman was a signficant restorer of many English castles during the 17th century."
    }
  ],
  "video_url": "https://www.youtube.com/embed/VuTQf-yNKt0",
  "postcode": "BD23 1AW",
  "district": "Skipton",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Chapel Hill, Middle Town, Skipton, North Yorkshire, York and North Yorkshire, England, BD23 1AW, United Kingdom",
  "state": "England"
}