{
  "created_at": "2025-01-06T05:02:27.353534+00:00",
  "objectID": "6285dcf3dd53424c50f7fe5ac4796961",
  "ref": "gisburn-forest-walking-and-cycle-route",
  "title": "Gisburn Forest Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Wall_enclosing_Part_of_Gisburn_Forest_-_geograph.org.uk_-_595642.jpg",
  "nearby": [
    {
      "description": "Stocks Reservoir",
      "objectID": "9dbde3ad06a87452a3afae0f429f77ae",
      "ref": "stocks-reservoir-walking-route"
    },
    {
      "description": "Hodder Way",
      "objectID": "785de2891ae51a453da399951b96e199",
      "ref": "hodder-way-walking-route"
    },
    {
      "description": "Sawley Abbey",
      "objectID": "ccc73a07c553d064972fbb2f5cac7aa3",
      "ref": "sawley-walking-route"
    },
    {
      "description": "Gisburn",
      "objectID": "dfdd5194063a274b9cec971ec7c6a40c",
      "ref": "gisburn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6285dcf3dd53424c50f7fe5ac4796961.gpx",
  "_geoloc": {
    "lat": 53.9994291558,
    "lng": -2.388469145
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Wall_enclosing_Part_of_Gisburn_Forest_-_geograph.org.uk_-_595642.jpg",
      "title": "Chris Heaton / Wall enclosing Part of Gisburn Forest, via Wikimedia Commons",
      "caption": "Wall enclosing Part of Gisburn Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Gisburn_Forest_-_geograph.org.uk_-_21109.jpg",
      "title": "andy / Gisburn Forest, via Wikimedia Commons",
      "caption": "One of the cycle trails in the forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Sawmill_in_Gisburn_Forest_-_geograph.org.uk_-_595663.jpg",
      "title": "Chris Heaton / Sawmill in Gisburn Forest, via Wikimedia Commons",
      "caption": "Sawmill in Gisburn Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Eastern_Edge_of_Gisburn_Forest_-_geograph.org.uk_-_595553.jpg",
      "title": "Chris Heaton / Eastern Edge of Gisburn Forest, via Wikimedia Commons",
      "caption": "Eastern Edge of the forest. Part of the eastern edge of Gisburn Forest - it is very large by English standards. This looks north beside Holden Moor to the small summit of Whelp Stone Crag."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Another_Scene_in_Gisburn_Forest_-_geograph.org.uk_-_595634.jpg",
      "title": "Chris Heaton / Another Scene in Gisburn Forest, via Wikimedia Commons",
      "caption": "This stretch of woodland juts out onto Holden Moor from the main body of the forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Scene_in_Gisburn_Forest_-_geograph.org.uk_-_595555.jpg",
      "title": "Chris Heaton / Scene in Gisburn Forest, via Wikimedia Commons",
      "caption": "Scene in Gisburn Forest. In the eastern confines of the forest - marked as Hesbert Hall Heights on the Ordnance Survey Map."
    }
  ],
  "distance_km": 6.5,
  "description": "Enjoy miles of wonderful woodland walking and cycling trails in this large forest in the Forest of Bowland. Mountain bikers can enjoy a moderate 9.5km blue grade trail and a more challenging red grade trail. Walkers can enjoy 5 waymarked walks of varying lengths and difficulty. In the forest you will find wide, well surfaced trails taking you through mixed woodland and conifer plantation with a wide variety of wildlife to look out for in one of the hides. There are also becks, streams and waterfalls. This easy circular route starts at the forest hub and takes you to Hesbert Hall before returning with a waterside section along Bottoms Beck and the lovely Stocks Reservoir. If you'd like to continue your walking in the area then you could try the Stocks Reservoir Walk which takes you all away around the reservoir. The Hodder Way long distance trail also runs past the western end of the forest. You could pick up the riverside path and follow it towards the splendid village of Dunsop Bridge and the wonderful Trough of Bowland .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Stocks Reservoir Cafe is conveniently located on the shores of the nearby lake. There's great views from the outdoor seating area looking north across the reservoir to Gisburn Forest. Near the cafe there's also a bird feeding station which is always a hive of activity. It's a lovely place to relax with a snack on a fine day. It's a few miles from the site but The Inn At Whitewell is a great place to visit if you are in the car. The beautiful inn sits in a wonderful location high on the banks of the River Hodder a few miles south west of the forest. It's a place of some note with a history stretching back hundreds of years. In the 1300’s the inn was just a small manor house, lived in by the keepers of the Royal forest. It was not until the 1700’s, that the building was transformed into a resting place where travellers en route to or from Lancaster could safely stay before continuing their perilous journey.  The inn has got a delightful interior and a nice outdoor seating area with views over the river. It's the ideal spot to rest your legs on a summer day. After your meal you can enjoy a stroll along the river where there are stepping stones and a waterfall nearby. You can find the inn a couple of miles south of Dunsop Bridge at postcode BB7 3AT.   Picture above: the Inn at Whitewell and the River Hodder stepping stones just below the inn."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The expansive forest is ideal for dog walking with miles of wide tracks to follow."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you have some time after your walk pay a visit to the nearby Bowland Wild Boar Park. The park is a highglight of the area with animal feeding, tractor rides, plays areas and a cafe. There's also some nice riverside walks along the River Hodder here too. There's lots of different animals in the park including Red Deer, Peacock, Ostriches, Emu and of course Wild Boar. You can explore the site on 7 different waymarked nature trails. It's a lovely place for a stroll with bluebell woods, sculptures and plenty of wildlife to look out for on the way.  The park is located in the heart of the Trough of Bowland situated about 2 miles from the picturesque village of Chipping, on the Chipping to Dunsop Bridge road. They are signposted clearly from Chipping and have a postcode of PR3 2QT for your sat navs.   Above: Views of the park with the River Hodder and a wooden sculpture on the right."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iOKu3szJ58E",
  "postcode": "BB7 4TS",
  "county": "Lancashire",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}