{
  "created_at": "2025-01-06T00:39:15.708794+00:00",
  "objectID": "62985357e8c2c1ecd8e8b9591442e931",
  "ref": "north-walsham-and-dilham-canal-walking-route",
  "title": "North Walsham and Dilham Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Between_river_and_drain_-_geograph.org.uk_-_1020797.jpg",
  "nearby": [
    {
      "description": "Paston Way",
      "objectID": "82ae62dc23f6c8a73bda9a588d8812da",
      "ref": "paston-way-walking-route"
    },
    {
      "description": "Bacton Woods",
      "objectID": "87326631fb0a52509740b3bfcf9ee1fe",
      "ref": "bacton-woods-walking-and-cycle-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Gunton Park",
      "objectID": "e6bbde2f1fdf54bf6388eebde68756ae",
      "ref": "gunton-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/62985357e8c2c1ecd8e8b9591442e931.gpx",
  "_geoloc": {
    "lat": 52.8377608967,
    "lng": 1.4086481515
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Between_river_and_drain_-_geograph.org.uk_-_1020797.jpg",
      "title": "Evelyn Simak / Between river and drain",
      "caption": "Between river and drain. The footbridge seen at right takes the circular walk over a drain which runs parallel to the River Ant and the canal (at left, very much overgrown). Here the walk changes direction to easterly and runs between the river and the drain before turning north and back towards the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Footpath_through_Pigney%27s_Wood_-_geograph.org.uk_-_720287.jpg/256px-Footpath_through_Pigney%27s_Wood_-_geograph.org.uk_-_720287.jpg",
      "title": "Evelyn Simak / Footpath through Pigney's Wood",
      "caption": "Footpath through Pigney's Wood. Pigney's Wood (marked as Pigrey's Wood on OS maps but all signs and information boards put up in the area give its name as Pigney's Wood) was purchased in 1992 by the North Norfolk Community Woodland Trust. It consists of 12 acres of meadowland adjoining the North Walsham and Dilham canal, 5 acres of existing woodland and approximately 35 acres of new woodland. A number of public footpaths traverse the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/North_Walsham_and_Dilham_Canal_-_geograph.org.uk_-_469663.jpg",
      "title": "Marcus de Figueiredo / North Walsham & Dilham Canal",
      "caption": "North Walsham and Dilham Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/North_Walsham_and_Dilham_Canal_-_geograph.org.uk_-_469668.jpg",
      "title": "Marcus de Figueiredo / North Walsham & Dilham Canal",
      "caption": "North Walsham and Dilham Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Wooden_footbridge_-_geograph.org.uk_-_1020825.jpg/256px-Wooden_footbridge_-_geograph.org.uk_-_1020825.jpg",
      "title": "Evelyn Simak / Wooden footbridge",
      "caption": "Wooden footbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/View_northwest_along_the_circular_walk_-_geograph.org.uk_-_1020817.jpg",
      "title": "Evelyn Simak / View northwest along the circular walk",
      "caption": "View northwest along the circular walk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Ebridge_Mill_-_geograph.org.uk_-_3929307.jpg",
      "title": "Evelyn Simak / Ebridge Mill seen across the restored mill pond",
      "caption": "Ebridge Mill before its conversion into housing seen across the restored mill pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Footbridge_over_Honing_Lock_-_geograph.org.uk_-_1050964.jpg",
      "title": "Evelyn Simak / Footbridge over Honing Lock",
      "caption": "Footbridge over Honing Lock. A section of the Weaver's Way crosses at the end of Lock Road. A path leads southwards from here, to a footbridge over the disused Honing lock and continuing alongside the canal and through St Villier's Fen until it reaches a pasture on Honing Common which it traverses. This path leads to Honing Road further to the southwest. The North Walsham and Dilham Canal runs parallel to the River Ant from above Wayford Bridge."
    }
  ],
  "distance_km": 2.2,
  "description": "Enjoy a short waterside stroll along the North Walsham and Dilham Canal on this easy Norfolk walk. The disused canal has a lovely footpath running from North Pigney's Wood nature reserve along the canal. Start the walk from the Pigney's Wood car park just off Hall Lane. It's located just to the north east of North Walsham town centre. From here you can pick up some nice woodland trails taking you through the woods to the canal. Follow the canalside footpath down to Bacton Road before returning on the same path. The nature reserve includes some nice features including wetland areas, carpets of bluebells in spring and a 450-year-old ancient oak tree. It's also great for wildlife with goldcrest, nuthatch, Cetti’s Warbler, dragonflies, butterflies, otter, water vole and badger to look out for. The Paston Way long distance trail runs through North Walsham to Pigney's Wood. You could start the walk from the town and follow the waymarked trail to the site. There's also the Weavers' Way which you can pick up in the town and follow south east towards Honing Bridge. Here you'll find another nice footpath along the canal, running towards Dilham. To extend your walk follow the Paston Way to Bacton on the Norfolk Coast. You could also visit Bacton Woods which is located just to the east of the town. The attractive woods have 30 species of tree, including Scots and Corsian Pine, Western Hemlock, Douglas Fir and Larch.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bluebell is located close to the route on the north western tip of North Walsham. They have a good menu and a lovely large garden area for warmer weather. You can find them at postcode NR28 0RA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The route is a nice one to do with your dog. Please keep them on leads or under close control in the Pigneys Wood area. A bin can be found in the parking area. The Bluebell mentioned above is dog friendly in the garden area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Gunton Park is located just a few miles north west of the town. There's a huge deer park and a 19th century working sawmill to see here. The picturesque thatched mill is notable as the only surviving water powered sawmill in Norfolk. The walk includes a visit to the excellent Gunton Arms pub where there are fine views over the estate. If you head east to the coast you the worthy village of Happisburgh. There's a lovely secluded beach, a striking 18th century lighthouse and a historic 15th century church to see here.  For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "postcode": "NR28 0SH",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pigney's Wood Nature Reserve, Hall Lane, Old Hall Street, Knapton, North Norfolk, Norfolk, England, NR28 0SH, United Kingdom",
  "district": "North Norfolk",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "canal"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}