{
  "objectID": "6321b4c73790bac4f9f4fff0a21ec1db",
  "created_at": "2024-12-18T22:45:29.433504+00:00",
  "ref": "lulworth-cove-to-durdle-door-walking-route",
  "title": "Lulworth Cove to Durdle Door Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/The_way_to_Durdle_Door_-_geograph.org.uk_-_368357.jpg",
  "nearby": [
    {
      "description": "Ringstead Bay",
      "objectID": "5f7adee5aa622a01a7e5be1676090941",
      "ref": "ringstead-bay-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Lulworth Range Walks",
      "objectID": "d1c3c67519dae8ca6c20e116a252abb3",
      "ref": "lulworth-range-walks-walking-route"
    },
    {
      "description": "Swanage to Lulworth Cove Walk",
      "objectID": "b75c9fdf8f6ee2cd07cd957b6e571d6d",
      "ref": "swanage-to-lulworth-cove-walk-walking-route"
    },
    {
      "description": "Tyneham",
      "objectID": "4255679db0e37f4767c6e0cd3dfd1f27",
      "ref": "tyneham-walking-route"
    },
    {
      "description": "Lulworth Castle",
      "objectID": "226db2e9f7af3ea435de762d90d70e72",
      "ref": "lulworth-castle-walking-route"
    },
    {
      "description": "Winfrith Newburgh",
      "objectID": "6c814cd6b82dba041eeb0bfb7a346691",
      "ref": "winfrith-newburgh-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/9236805C246930CC80257D5B00346CF8/$FILE/Lulworth Cove to Durdle Door.gpx",
  "_geoloc": {
    "lat": 50.6256883452,
    "lng": -2.2471295325
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/The_way_to_Durdle_Door_-_geograph.org.uk_-_368357.jpg",
      "title": "Rachel Hopper / The way to Durdle Door, via Wikimedia Commons",
      "caption": "The way to Durdle Door. The shape of the coastline surrounding Durdle Door is influenced by its geology, with the hardness of the rocks and local fault and fold patterns playing key roles. The arch has developed on a concordant coastline, where rock bands run parallel to the shoreline. The rock layers are nearly vertical, with narrow bands. Initially, a resistant band of Portland limestone ran along the shore, the same band seen further along the coast forming the narrow entrance to Lulworth Cove. Behind this lies a 120-metre band of softer, easily eroded rocks, followed by a stronger, thicker band of chalk forming the Purbeck Hills. These steeply dipping rocks are part of the Lulworth crumple, which is part of the broader Purbeck Monocline, formed during the mid-Cenozoic by the building of the Alps. There is limited historical documentation about the arch, though its name likely originated over a millennium ago. Descriptions from the late 18th century refer to the \"magnificent arch of Durdle-rock Door,\" while early 19th-century maps label it as \"Duddledoor\" or \"Durdle\" / \"Dudde Door.\" In 1811, the first Ordnance Survey map called it \"Dirdale Door.\" The term \"Durdle\" comes from the Old English word \"thirl,\" meaning to pierce, bore, or drill, which is derived from \"thyrel,\" meaning hole. Similar names in the area include Durlston Bay and Durlston Head to the east, as well as the Thurlestone, an arched rock in Devon to the west. The \"Door\" part of the name likely refers to the arched shape of the rock. In the late 19th century, it was even referred to as the \"Barn-door\" due to its size."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Durdle_Door_-_geograph.org.uk_-_375257.jpg",
      "title": "Michael Robinson / Durdle Door, via Wikimedia Commons",
      "caption": "Durdle Door from above. The limestone and chalk are closer at Durdle Door compared to Swanage, where the distance is over 2 miles. Along this coastline, most of the limestone has been eroded by sea action, leaving the small headland containing the arch. Erosion at the western end of the limestone band led to the formation of the arch. UNESCO teams monitor the condition of both the arch and the adjacent beach.\nThe 120-metre isthmus connecting the limestone to the chalk consists of a 50-metre band of Portland limestone, a narrow band of compressed Cretaceous Wealden clays and sands, and then narrow bands of greensand and sandstone. In Man O' War Bay, the Portland and Purbeck limestone band has not been entirely eroded, visible above the waves as Man O'War Rocks. Offshore to the west, the eroded limestone forms a line of small rocky islets called The Bull, The Blind Cow, The Cow, and The Calf.\nGiven the erosive nature of the coastline, occasional rockfalls and landslides occur, with a significant slide occurring just east of Durdle Door in April 2013, impacting a portion of the South West Coast Path.\nDurdle Door has served as a backdrop for various music videos, including Tears for Fears' \"Shout,\" Billy Ocean's \"Loverboy,\" Cliff Richard's \"Saviour's Day,\" and Bruce Dickinson's \"Tears of the Dragon.\" Additionally, the landscape around Durdle Door has been featured in several films, such as Wilde (1997), Nanny McPhee, and Far From The Madding Crowd (1967). In the Doctor Who episode \"The Power of the Doctor\" (2022), Durdle Door was where the Thirteenth Doctor regenerated into the Fourteenth Doctor. Moreover, Arthur Moule, a Dorset-born poet and missionary to China, wrote about Durdle Door in his 1879 book of poetry, Songs of Heaven and Home, expressing wonder at the timeless rhythm of the tides and the enduring presence of the arch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/West_Lulworth%2C_Lulworth_Cove_-_geograph.org.uk_-_532886.jpg",
      "title": "Chris Downer / West Lulworth: Lulworth Cove, via Wikimedia Commons",
      "caption": "West Lulworth, Lulworth Cove. Looking down on the Cove from the clifftop path that goes right round it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Lulworth_Beach_Cafe%2C_Lulworth_Cove_-_geograph.org.uk_-_885960.jpg",
      "title": "Nicholas Mutton / Lulworth Beach Cafe, Lulworth Cove, via Wikimedia Commons",
      "caption": "Lulworth Beach Cafe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/The_Castle_Inn%2C_West_Lulworth._-_geograph.org.uk_-_200990.jpg",
      "title": "Colin Smith / The Castle Inn, West Lulworth.",
      "caption": "The Castle Inn, West Lulworth. A thatched pub in this attractive Dorset village. A great place to rest and relax after your exercise."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Dungy_Head_-_geograph.org.uk_-_8513.jpg",
      "title": "Liz Martin / Dungy Head",
      "caption": "View down to the cove from Dungy Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Cliff_at_the_eastern_extreme_of_the_Scratchy_Bottom_embayment%2C_Durdle_Cove_-_geograph.org.uk_-_299715.jpg",
      "title": "Jim Champion / Cliff at the eastern extreme of the Scratchy Bottom embayment, Durdle Cove",
      "caption": "Cliff at the eastern extreme of the Scratchy Bottom embayment, Durdle Cove At the foot of the Scratchy Bottom valley there is an embayment into the chalk cliffs of Durdle Cove. This is the corner at the eastern end of the bay within a cove, exposing the chalk to the east of Scratchy Bottom. In the foreground some of the chalk of the wave-cut platform is exposed. The seams of flints in the chalk show that the strata are near-vertical. A slide-plane fault is also visible, running diagonally downwards from the top left. The chalk above the fault has moved a few metres to the left (north) - the result is that in Durdle Cove the chalk above the fault is softer than that below it and caves have formed above the fault."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Man_o_war_cove.jpg/256px-Man_o_war_cove.jpg",
      "title": "Jim Champion, CC BY-SA 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>, via Wikimedia Commons",
      "caption": "Man o'War Cove. Looking down into the cove from the path on the cliffs, with Durdle Door just peeking over the neck on the right. The near-vertical strata of the headland are quite obvious in this picture. The Isle of Portland looms on the horizon above the headland."
    }
  ],
  "distance_km": 6.5,
  "description": "Take in two of the Jurassic Coast's most spectacular natural features on this short walk in Dorset. The walk starts at the picturesque village of West Lulworth where you will find rows of pretty cottages and the Castle Inn - one of the oldest pubs in Dorset dating from the 16th Century.  The trail then takes you to the coast and the beautiful Lulworth Cove. This sheltered bay is enclosed almost in a circle and was formed 10,000 years ago by the combined forces of a river and the sea. Next to the cove you will pass the West Lulworth Heritage Centre which contains a museum about the coast and the village. From the cove you follow the South West Coast Path west towards Durdle Door.  This spectacular natural limestone arch also has an adjacent beach and caves. The walk then takes you back to West Lulworth along countryside walking trails. There is ample parking at Lulworth Cove. If you are coming by public transport you could get the train to Wool and then a connecting bus to the cove. The walk can be extended by heading a few miles west and visiting the beautiful Ringstead Bay and Osmington Mills on the longer Lulworth Cove to Osmington Mills Coastal Walk . To visit the cove from the nearby resort of Swanage you can try the Swanage to Lulworth Cove Walk which also visits the nearby marine reserve at Kimmeridge Bay. You could also try the Lulworth Range Walks which visits the deserted village of Tyneham before heading along the coast at Brandy Bay and Worbarrow Bay.",
  "video_url": "https://www.youtube.com/embed/arO8Y2Njxio",
  "postcode": "BH20 5RN",
  "district": "West Lulworth",
  "county": "Dorset",
  "region": "South West",
  "country": "England"
}