{
  "created_at": "2025-01-05T23:23:57.217916+00:00",
  "objectID": "64204fcee4b36194880d415e920046c9",
  "ref": "marlow-to-henley-walking-route",
  "title": "Marlow to Henley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/MarlowLock01.JPG/512px-MarlowLock01.JPG",
  "nearby": [
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Marlow",
      "objectID": "c7ee763ae44c4d8a2c7ae45b247451bf",
      "ref": "marlow-walking-route"
    },
    {
      "description": "Henley-on-Thames",
      "objectID": "1eac7070841f7d942a8b4926e27a159a",
      "ref": "henley-on-thames-walking-route"
    },
    {
      "description": "Hurley Loop Walk",
      "objectID": "3eaa6c9322a73bc518adc239ed9aeeb0",
      "ref": "hurley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/64204fcee4b36194880d415e920046c9.gpx",
  "_geoloc": {
    "lat": 51.5675546314,
    "lng": -0.7736290027
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/MarlowLock01.JPG/512px-MarlowLock01.JPG",
      "title": "By Motmit [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], from Wikimedia Commons",
      "caption": "Marlow Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/TempleLock02.JPG/512px-TempleLock02.JPG",
      "title": "By Motmit [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], from Wikimedia Commons",
      "caption": "Temple Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/The_River_Thames%2C_Hurley_-_geograph.org.uk_-_605625.jpg",
      "title": "Andrew Smith / The River Thames, Hurley",
      "caption": "The River Thames, Hurley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/The_Thames_floodplain%2C_Medmenham_-_geograph.org.uk_-_510817.jpg",
      "title": "Andrew Smith / The Thames floodplain, Medmenham",
      "caption": "The Thames floodplain, Medmenham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Aston_Ferry_-_geograph.org.uk_-_536848.jpg",
      "title": "Colin Smith / Aston Ferry",
      "caption": "Aston Ferry"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/The_River_Thames%2C_Remenham_-_geograph.org.uk_-_874404.jpg",
      "title": "Andrew Smith / The River Thames, Remenham",
      "caption": "The River Thames, Remenham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Hambleden_Mill_and_Weir_-_geograph.org.uk_-_536842.jpg",
      "title": "Colin Smith [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Hambleden Mill and Weir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Henley2.jpg/512px-Henley2.jpg",
      "title": "By The original uploader was Scu98rkr at English Wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Henley"
    }
  ],
  "distance_km": 13.0,
  "description": "A popular riverside walk between these Marlow and Henley-on-Thames. The walk follows a lovely section of the Thames Path National Trail for about 8 miles. There's locks, weirs, interesting villages and great views of the Chilterns countryside to enjoy. At the end of the walk you can return the same way or catch a bus back to Marlow to rest your legs. The walk starts on the Grade I listed Marlow Bridge which was opened in 1832. Follow the towing path west along the northern side of the river, passing the weir at Temple Lock and Temple Mill Island. The island was named after it's three watermills which have now been replaced with a modern housing development and a marina. You continue by crossing the river on the Temple Footbridge which connects the Buckinghamshire and Berkshire banks of the Thames. Shortly after you come to the village of Hurley where you will find the pretty Hurley Lock and Hurley Priory. The former Benedictine priory was founded in 1086 with the surviving priory church now used as the Hurley parish church. Also look out for kayakers around the rushing waters of Hurley. The route continues west, past Medmenham, Black Boy Island and Frog Mill Ait before coming to the hamlet of Aston. Follow the bend of the river round toward Hambleden Mill and Hambleden Lock. The historic watermill sits next to a large weir in a lovely spot on the river. The Grade II listed mill has now been converted into flats overlooking the Thames. You can take a small detour here and cross the walkways over the weir from the lock to the small village of Mill End on the Buckinghamshire bank. After enjoying Hambleden you continue south towards Temple Island. The island is a well known local landmark as it is used as the start of the course for Henley Royal Regatta. It includes an elegant ornamental temple (folly) designed by the 18th century English architect James Wyatt and constructed in 1771. The next section takes you past the village of Remenham where there are fine views across the river to Fawley Court. The Grade I listed country house dates from the late 17th century and is noted for its fine architecture. The final section takes you into Henley-on-Thames finishing on Henley Bridge. The Grade I listed bridge was built in 1786 and includes five elliptical stone arches. To extend your walk you can pick up the Chiltern Way and the Oxfordshire Way long distance trails near Henley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Riverside Restaurant in Marlow is a lovely location for some refreshments. There's a fine outdoor terrace which is ideal for warmer days. You can find it right next to Marlow Bridge at a postcode of SL7 1RG for your sat navs. The Two Brewers is also located near the river in Marlow. The 18th century pub does great food and also has a nice beer garden. You can find it on St. Peter Street at postcode SL7 1NQ. The 12th century Olde Bell Inn in Hurley is one of the most significant pubs in the country. It is claimed to be the oldest hotel in the UK, and one of the oldest hotels in the world. The hotel is said to contain a secret tunnel leading to the village priory, which was used by John Lovelace, who was involved in the Glorious Revolution to overthrow King James II in the 17th century. The hotel was also used as a meeting point for Winston Churchill and Dwight D. Eisenhower during World War II. It's well worth exploring the whole site as other features include a kitchen garden, wildflower garden and a 16th century Tithe Barn. The inn is located close to Pinewood Studios and over the years, has seen a number of movie-star guests, including Mae West, Greta Garbo, Cary Grant, Errol Flynn, Elizabeth Taylor and Richard Burton."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Higginson Park in Marlow is a nice place to visit in the town. The popular park attracts 1,000,000 visitors a year and includes riverside views and access to open countryside. There are also many fine trees and large expanses of lawn with formal flowerbeds and a brick in grass maze. It's another good option for refreshments with a nice cafe. You can find the park on the western fringes of the town, next to the river. Just to the east of Marlow is the neighbouring village of Little Marlow. Here you can explore the wildlife rich Spade Oak Nature Reserve and visit the historic 14th century church and 16th century pub.  In Hurley you can try the Hurley Loop Walk which will take you south to the woodland trails in Ashley Hill Forest and the Hurley Chalk Pit Nature Reserve."
    }
  ],
  "postcode": "SL7 1RG",
  "district": "Bisham",
  "county": "Windsor and Maidenhead",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Marlow Bridge, Bisham, Windsor and Maidenhead, England, SL7 1RG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "villages",
    "countryside views",
    "historical landmarks",
    "watermills"
  ],
  "facilities": [
    "car park",
    "bus stop",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}