{
  "objectID": "6430be3eaeeeda93eb268b5a2bd4a4a4",
  "created_at": "2024-12-21T13:16:28.632283+00:00",
  "ref": "petts-wood-circular-walking-route",
  "title": "Petts Wood Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Petts_Wood_-_geograph.org.uk_-_669775.jpg",
  "nearby": [
    {
      "description": "Scadbury Park",
      "objectID": "d0d21ca075cc6929904e63b6250dc35a",
      "ref": "scadbury-park-walking-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Foots Cray Meadows",
      "objectID": "924d905f50e3bf6212276b9f460ac841",
      "ref": "foots-cray-meadows-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Petts_Wood_-_geograph.org.uk_-_669775.jpg",
      "title": "Stacey Harris / Petts Wood",
      "caption": "Petts Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Petts_Wood%2C_Kent_-_geograph.org.uk_-_137110.jpg",
      "title": "Dr Neil Clifton / Petts Wood, Kent",
      "caption": "The beautiful Petts Wood is owned by the National Trust, having been bequeathed to the nation by George Edlmann in 1927. This path forms part of the London Outer Orbital Path (London Loop) walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Great_Thrift%2C_Petts_Wood_-_geograph.org.uk_-_1053268.jpg",
      "title": "David Kemp / Great Thrift, Petts Wood",
      "caption": "Great Thrift. Taken at the junction with Little Thrift. The attractive Tudor style of these pre-War houses is typical of the Petts Wood and Orpington area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Birchwood_Road%2C_Petts_Wood_-_geograph.org.uk_-_1098669.jpg",
      "title": "Ian Capper / Birchwood Road, Petts Wood",
      "caption": "Birchwood Road, Petts Wood. This is no.41, built in the early 1930s by \"Freddie\" Love, who was responsible for much of this road. From June to September 1940, this house was rented by the De Gaulle family. However, concern over security (Petts Wood was on the path of bombing raids into London, and rumours were that the Germans were aware of his whereabouts), led them to move on, the family moving to Shropshire and Charles De Gaulle basing himself in the Connaught Hotel in Mayfair during the week."
    }
  ],
  "distance_km": 6.0,
  "description": "A short circular walk that takes you through Petts Wood and Jubilee Country Park in Bromley. The Park consists of 62 acres of grassland and ancient woodland and was purchased by Bromley Council to celebrate the Silver Jubilee of Queen Elizabeth II in 1977. The park is also full of wildlife with amphibians, birds, butterflies, insects, mammals, reptiles and wild flowers to look out for. Good access points for the walk are the car park at Jubilee Country Park and Petts Wood station just to the south. The London Loop runs through the park so you can pick this up to extend your walk. Head north and you can visit Scadbury Park where you will find 300 acres of woodland and grassland. There's also the ruins of Scadbury Manor, home to Elizibethan courtier Sir Thomas Walsingham. Just beyond the park is Foots Cray Meadows nature reserve which has a nice waterside footpath along the River Cray to enjoy."
}