{
  "created_at": "2025-01-06T01:51:39.002631+00:00",
  "objectID": "644768ed8d1b4271071b163fa9a9d416",
  "ref": "high-force-waterfall-walking-route",
  "title": "High Force Waterfall Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/High_Force_Tourists_7209.JPG/512px-High_Force_Tourists_7209.JPG",
  "nearby": [
    {
      "description": "Cow Green Reservoir and Cauldron Snout",
      "objectID": "fde863f6ed3a3635dbb832514339b716",
      "ref": "cow-green-reservoir-and-cauldron-snout-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/644768ed8d1b4271071b163fa9a9d416.gpx",
  "_geoloc": {
    "lat": 54.6488181166,
    "lng": -2.1461420991
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/High_Force_Tourists_7209.JPG/512px-High_Force_Tourists_7209.JPG",
      "title": "Clem Rutter, Rochester, Kent [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "High Force is a striking natural feature on the River Tees, where the river drops 70 feet (21 metres) over a sheer precipice in two stages. This dramatic cascade creates a powerful spectacle, especially after heavy rainfall, when the river may also flow over a usually dry right-hand side channel, resulting in two separate falls. On rare occasions, when the river is exceptionally high, it may even flow over the central section of rock. The last notable instance of this occurring was in December 2015, following Storm Desmond. During harsh winters, the waterfall can freeze, producing impressive ice formations that resemble cathedral spires. The waterfall can be accessed from both banks: the northern bank via a private footpath on the Raby Estate, which requires a fee, and the southern bank through the Pennine Way public footpath, which crosses the Moor House-Upper Teesdale National Nature Reserve and is free of charge. The waterfall was painted by JMW Turner in 1816."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/High_Force_3_%281151669367%29.jpg/512px-High_Force_3_%281151669367%29.jpg",
      "title": "Tony Hisgett from Birmingham, UK [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "High Force and rock formations. The waterfall is part of the historic county boundary between the North Riding of Yorkshire on the south bank, and County Durham on the north bank. High Force was formed as the River Tees crossed the Whin Sill, a prominent layer of hard igneous rock that also appears at Hadrian's Wall and other sites. The waterfall showcases three distinct types of rock. The upper layer consists of whinstone, or dolerite, a tough igneous rock that resists erosion. The lower section is made of Carboniferous Limestone, which is softer and erodes more quickly. Sandwiched between these layers is a thinner band of Carboniferous sandstone, which was hardened by the molten Whin Sill about 295 million years ago. As the waterfall erodes the rock, it gradually moves upstream, creating a deep, narrow gorge that currently extends about 700 metres (2,300 feet). The bed load of the river is primarily composed of large boulders, which are rolled along the riverbed. Upstream from the waterfall, the river is narrow, while downstream, it widens and meanders."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/High_Force_Access_7153.JPG/512px-High_Force_Access_7153.JPG",
      "title": "Clem Rutter, Rochester, Kent [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "View of the Access path from the car park to the falls. Despite common misconceptions, High Force is not the highest waterfall in England. At 71 feet (22 metres) tall, it is surpassed by several other waterfalls. For example, Cautley Spout in Cumbria's Howgill Fells boasts a dramatic drop of nearly 590 feet (180 metres), and Hardraw Force in North Yorkshire has a single drop of 98 feet (30 metres). Additionally, Fell Beck, located underground on the flanks of Ingleborough, plunges an impressive 315 feet (96 metres) down the Jib Tunnel of Gaping Gill Hole. However, High Force does hold a unique distinction. It has the largest volume of water falling over an unbroken drop when in full spate, which has earned it the Nordic name \"High Fosse.\" This name reflects its significance in terms of water flow, even if its height is not the highest in England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/High_Force_Tourists_7198.JPG/512px-High_Force_Tourists_7198.JPG",
      "title": "Clem Rutter, Rochester, Kent [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "A couple sit on the rocks next to the falls and enjoy the view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Low_Force_-_geograph.org.uk_-_1392421.jpg",
      "title": "malcolm tebbit / Low Force",
      "caption": "Low Force. Low Force is notable not only for its natural beauty but also for the historic Wynch Bridge, completed in 1830. The bridge, which crosses the river near the falls, has signs at each end advising that only one person should cross at a time due to its potential instability. The area has also been used as a filming location. In June 2019, sections of the film 1917 were shot near Low Force, with the production team installing signs to inform walkers about the prosthetic bodies used as props. More recently, in 2020, Low Force featured in episode seven of season two of the popular Netflix series The Witcher, showcasing the site's continued appeal for filmmakers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/River_Tees_between_High_and_Low_Force_-_geograph.org.uk_-_1301832.jpg",
      "title": "Andrew Curtis / River Tees between High and Low Force",
      "caption": "River Tees between High and Low Force"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Holwick_Head_Bridge_-_geograph.org.uk_-_1715909.jpg/512px-Holwick_Head_Bridge_-_geograph.org.uk_-_1715909.jpg",
      "title": "Rebecca Beeston / Holwick Head Bridge",
      "caption": "Holwick Head Bridge. Between Low Force and High Force, there is another footbridge that spans the River Tees. This bridge, accessible via a steep track from the main B6277 road, lies on the Strathmore Estate and was originally built in 1896 by Motley and Green of Leeds. It is sometimes referred to as the Duke's Bridge because it was constructed for the Duke of Cleveland. In 1998, Durham County Council rebuilt it as a footbridge. On the south side of the bridge, a track leads east to the settlement of Holwick, situated just below Holwick Scars cliff. There are also paths that connect to High Force a few hundred yards away and another heading east. Both of these paths are part of the Pennine Way. At this location, the river is calm and serene, offering a peaceful contrast to the dramatic falls nearby. From the bridge, steps lead up to higher paths along the riverbank, providing excellent views of the surrounding landscape."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Small_Waterfall_on_the_River_Tees_-_geograph.org.uk_-_3689287.jpg",
      "title": "Small Waterfall on the River Tees by G Laird, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Small Waterfall on the River Tees"
    }
  ],
  "distance_km": 11.0,
  "description": "Visit the spectacular Low Force and High Force waterfalls on this waterside circular walk in the North Pennines Area of Outstanding Natural Beauty. The walk runs for about 6.5 miles with some moderate climbs along the way. You start off from the Bowlees Visitor Centre, where car parking is available. A short walk from here takes you to the River Tees and the 18 foot (5.5m) Low Force Waterfall. Here you cross a bridge over the river and pick up the Pennine Way, following it west through riverside woodland to High Force Waterfall. It's one of the biggest waterfalls in England and a spectacular sight with the water dropping 70 feet (21m) into a plunge pool below. The site also includes ancient rocks formed over 300 million years ago. From here you can return to the start point the same way but this route climbs to the hills to the south of the river. You'll reach a height of over 1300ft around Whiteholm Bank, with splendid views over the area to enjoy. The walk then descends back to the river and the car park. This walk takes you along the free southern bank of the river but if you would like to visit the northern bank then access is via a private footpath on the Raby estate for which a fee is charged. See the link below for more details. If you'd like to extend your walk you could continue west along the Pennine Way to Cow Green Reservoir and Cauldron Snout waterfall. The waterfall is another spectacular sight and at 200 yards (180 m) long, it is reckoned to be the longest waterfall in England. Heading east along the waymarked river trail will take you to Middleton-in-Teesdale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bowlees Visitor Centre at the start of the walk has a nice cafe with a good choice of snacks and meals. They also have lots of information about the area with booklets for self-guided walks, bike rides and nature-spotting. The High Force Hotel is also conveniently located for some post walk refreshments. They do very good food which you can enjoy in two cosy little bars, in the tearoom or outdoors on the patio, in the courtyard or in the garden. It's a lovely place to relax in after your exercise. The Strathmore Arms is another good choice. The pub is located in Holwick (Postcode: DL12 0NJ) and was named Country Cider Pub of the Year 2016, 17 & 18. It's a traditional English country pub with a nice coal log fire and a good selection of meals and ales. The pub is also dog friendly.  Pictured above the very fine High Force Hotel and the Strathmore Arms pub in Holwick. Both are worthy of some investigation if you have time after your walk. You could also follow the Tees North and visit Landgdon Beck. Here you'll find the Langdon Beck Hotel which is a popular place to stay in the area. The hotel has a good menu and a cosy interior with roaring fires and a friendly atmosphere. It's in a wonderfully remote location, with lovely views and a whole host of other walks to try around the hotel. You can find the hotel to the east of the reservoir at a postcode of DL12 0XP for your sat navs.  Pictured above: Langdon Beck Hotel and Langdon Beck Bridge to the north of the falls. Langdon Beck has been adopted as the name of the hamlet."
    },
    {
      "subtitle": "Dog Walking",
      "content": "On the High Force paths dogs are welcome but to protect the sensitive plants and wildlife you are advised to keep them on leads. The High Force hotel mentioned above is also dog friendly whether you're staying over or just eating."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "This area is excellent for bird watching so be sure to bring your binoculars with you. For example the fields around Langdon Beck are some of the best in the North Pennines for seeing the rare Black Grouse. About 80% of Britain’s Black Grouse population live within the North Pennines. The lekking displays, which are at their peak in early Spring are quite spectacular. Lapwings, Curlew, Redshank and Snipe all breed in the surrounding pastures too. Just north of the visitor centre you can also visit Summerhill Force waterfall and Gibson's Cave. You can reach the site with a nice little stroll through woodland along the Bow Lee Beck to the pretty waterfall.  Pictured above the Summerhill Force waterfall and Gibson's Cave. Located close to High Force the site is a very worthy addition to your outing."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lvuq2CUu3PE?si=EK8AyfsVg51hBnZL",
  "postcode": "DL12 0XE",
  "county": "County Durham",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bowlees, Newbiggin, County Durham, North East, England, DL12 0XE, United Kingdom",
  "district": "Newbiggin",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}