{
  "created_at": "2025-01-06T02:41:39.793683+00:00",
  "objectID": "64aa1413325a48a097a647877bb0c01f",
  "ref": "maidenhead-river-walk-walking-route",
  "title": "Maidenhead River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/99/Boulter%27s_Lock_-_geograph.org.uk_-_515648.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/64aa1413325a48a097a647877bb0c01f.gpx",
  "_geoloc": {
    "lat": 51.5333535149,
    "lng": -0.6996479962
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Boulter%27s_Lock_-_geograph.org.uk_-_515648.jpg",
      "title": "Colin Smith / Boulter's Lock",
      "caption": "Boulter's Lock. The lock is full as boats prepare to leave and head upstream towards Cookham. The lock takes the boats past Ray Mill Island in the Thames."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Maidenhead_Bridge_and_River_Thames_-_geograph.org.uk_-_205285.jpg",
      "title": "Nigel Cox / Maidenhead Bridge & River Thames",
      "caption": "Maidenhead Bridge and River Thames. The bridge carries the A4 Bath Road over the River Thames. It was designed by the architect Robert Taylor and built at a cost of £19,000 in 1777. It was a toll bridge until 1903, when motorists decided they were no longer prepared to pay and threw the gates into the river. The bridge has 12 arches of which the middle 6 are over the water, with the middle two navigable. The first bridge over the river here was built out of wood in 1280. The centre of the small metal plaque on the near abutment records the maximum water level reached during the November 1894 flood event."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Monkey_Island_-_geograph.org.uk_-_383432.jpg",
      "title": "David Hawgood / Monkey Island",
      "caption": "Monkey Island. This island is a narrow island in the Thames, and can be reached only by footbridge or boat. It became firm ground only when rubble was dumped following the great fire of London in 1666. The 3rd Duke of Marlborough bought it in 1723, and since then there have been pleasure buildings, lawns, and latterly this hotel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Jubilee_River%2C_Footbridge_near_Glebe_Close%2C_Dorney_Reach_-_geograph.org.uk_-_71709.jpg",
      "title": "Nigel Cox / Jubilee River: Footbridge near Glebe Close, Dorney Reach",
      "caption": "Jubilee River, Footbridge near Glebe Close, Dorney Reach. A view taken looking downstream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Dorney_Rowing_Lake_-_geograph.org.uk_-_1505153.jpg",
      "title": "Kevin White / Dorney Rowing Lake",
      "caption": "Dorney Rowing Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Boveney_lock_-_geograph.org.uk_-_950406.jpg",
      "title": "Susannah Muldoon / Boveney lock",
      "caption": "Boveney lock, Windsor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Eton_College_boathouses_from_Windsor_and_Eton_Bridge_-_geograph.org.uk_-_753286.jpg",
      "title": "Rod Allday / Eton College boathouses from Windsor & Eton Bridge",
      "caption": "Eton College boathouses from Windsor and Eton Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/The_River_Thames_at_Windsor_-_geograph.org.uk_-_1520574.jpg",
      "title": "Steve Daniels / The River Thames at Windsor",
      "caption": "The River Thames at Windsor"
    }
  ],
  "distance_km": 11.8,
  "description": "This walk takes you from Maidenhead to Windsor along the Thames Path National Trail. It's a popular walk running for just over 7 miles along a flat riverside path. Along the way there's pretty locks, weirs and some lovely country views to enjoy. The walk starts from the picturesque Boulter's Lock where there is a car parking area next to the Thames. From here you can pick up the Thames Path and follow it south along the river to Taplow and Dorney Reach where you'll pass Monkey Island and the pretty Dorney Lake. The attractive lake was used as the rowing venue for the 2012 Olympics in London. The site additionally includes 450 acres of parkland with an Arboretum and Nature Conservation area. The route continues to Queen's Eyot before coming to Eton Wick and Eton where you can visit the famous school. Soon after you cross the river to finish in Windsor close to the historic castle.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Maidenhead Boundary Walk also starts from the lock car park. The 13 mile trail is a nice way to explore the area around the town. At the other end of the route there's the Windsor River Walk. This circular walk visits Eton Wick, Eton Great Common, Eton College and Datchet. You can also reach Eton from the town on the Jubilee River Walk. This route passes Taplow Lake and the 15th century Dorney Court on the way. Just to the west in Hurley you can pick up the Hurley Loop Walk which will take you south to the woodland trails in Ashley Hill Forest and the Hurley Chalk Pit Nature Reserve. There's also one of the oldest pubs in the country to see in the village. Just to the east of Marlow is the neighbouring village of Little Marlow. Here you can explore the wildlife rich Spade Oak Nature Reserve and visit the historic 14th century church and 16th century pub.  For more walking ideas in the area see the Berkshire Walks page."
    }
  ],
  "postcode": "SL6 8PE",
  "district": "Maidenhead",
  "county": "Windsor and Maidenhead",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lower Cookham Road, North Town, Maidenhead, Windsor and Maidenhead, England, SL6 8PE, United Kingdom",
  "state": "England"
}