{
  "created_at": "2025-01-06T01:44:41.998880+00:00",
  "objectID": "64c823596f23006e79d3a249339e1719",
  "ref": "looe-to-polperro-walking-route",
  "title": "Looe to Polperro Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c9/The_slipway%2C_East_Looe_-_geograph.org.uk_-_293163.jpg",
  "nearby": [
    {
      "description": "Looe Island",
      "objectID": "e7b9ce64015a9464ce5f04d80b432baa",
      "ref": "looe-island-walking-route"
    },
    {
      "description": "Fowey Hall Walk",
      "objectID": "9b1e728a28d1dd414c007ac53bb597db",
      "ref": "fowey-hall-walk-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Lansallos and Lantivet Bay",
      "objectID": "1a21303ff1f89c51cf2c2f5f004690e5",
      "ref": "lansallos-and-lantivet-bay-walking-route"
    },
    {
      "description": "Looe To Seaton Beach Walk",
      "objectID": "ee87f61e05902217b1dd12272c187174",
      "ref": "looe-to-seaton-beach-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/64c823596f23006e79d3a249339e1719.gpx",
  "_geoloc": {
    "lat": 50.3531898691,
    "lng": -4.450966521
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/The_slipway%2C_East_Looe_-_geograph.org.uk_-_293163.jpg",
      "title": "Carol Walker / The slipway, East Looe, via Wikimedia Commons",
      "caption": "The slipway, East Looe. This is the entrance to East Looe from the sea. The site now houses the new lifeboat station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Beach_and_East_Looe_-_geograph.org.uk_-_219448.jpg",
      "title": "Pam Brophy / Beach and East Looe, via Wikimedia Commons",
      "caption": "Beach and East Looe. Standing at the end of the pier, looking inland, one can see the beach and the hillside on which East Looe is built."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/West_and_East_Looe_with_the_river_from_Hannafore_road_-_geograph.org.uk_-_759559.jpg",
      "title": "roger geach / West and East Looe with the river from Hannafore road, via Wikimedia Commons",
      "caption": "West and East Looe with the river from Hannafore road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Looe_Bay_-_geograph.org.uk_-_747817.jpg/512px-Looe_Bay_-_geograph.org.uk_-_747817.jpg",
      "title": "Trevor Rickard / Looe Bay, via Wikimedia Commons",
      "caption": "Looe Bay From the Hannafore foreshore looking eastwards across Looe Bay to Seaton and Downderry on the opposite side. Gulls follow a fishing boat as it approaches Looe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Lansallos%2C_by_Talland_Bay_-_geograph.org.uk_-_1509296.jpg",
      "title": "Martin Bodman / Lansallos: by Talland Bay, via Wikimedia Commons",
      "caption": "Lansallos: by Talland Bay. The South West Coast Path climbs above the cliffs, heading for Aesop\u0092s Bed and Hore Point. The tower of Talland church appears above the hill. Talland in Celtic means \u0091The Holy Place [Lan] on the Brow of the Hill [Tal]\u0092"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Portnadler_Bay_-_geograph.org.uk_-_1242122.jpg",
      "title": "Philip Halling / Portnadler Bay, via Wikimedia Commons",
      "caption": "Portnadler Bay. View across Portnadler Bay to Looe Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Fishermens_cottages%2C_Polperro_-_geograph.org.uk_-_293100.jpg",
      "title": "Carol Walker / Fishermens cottages, Polperro, via Wikimedia Commons",
      "caption": "Fishermens cottages, Polperro. Cornish fishermen had an idea that their home should be the equivalent of a 'ship in stone'.You needed somewhere to store your gear below, and a loft divided into rooms above."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Polperro%2C_Harbour_-_geograph.org.uk_-_517031.jpg",
      "title": "Dieter Hoegerle / Polperro, Harbour, via Wikimedia Commons",
      "caption": "Polperro, Harbour"
    }
  ],
  "distance_km": 8.5,
  "description": "This is a popular walk between these two Cornish coastal villages. It follows the South West Coast Path for just over 5 miles with stunning views all the way. The walk starts in East Looe near the tourist information centre. The town has a lovely beach, pier, pretty harbour and picturesque Cornish cottages. After passing through East Looe you cross the bridge over the Looe Estuary into West Looe and follow the coast round to Hannafore (you can see some of this section on the google street view link below). There's great views of Looe Bay and towards the idyllic Looe Island on this section of the walk. From Hannafore you continue to Talland, passing Samphire Beach and Portnadler Bay. At Talland Bay you will find two nice shingle beaches called Talland Sand and Rotterdam Beach. There is also a church dating from the 15th century and a cafe where you stop for refreshments. The final section takes you from Talland to Polperro, passing the memorial at Downend Point and Chapel Cliff. The town has a lovely harbour and rows of ancient fishermen's cottages to admire. To extend your walking in the area you could continue west along the coast on the Polperro to Polruan Walk. This route runs through a delightful area designated as a coastal Site of Special Scientific Interest (SSSI) and a Special Area of Conservation. In Polruan you can pick up the Fowey Hall Walk which takes in two ferry crossings and includes waterside sections along Pont Pill and Fowey Quay. In Looe you can follow the Looe River north west from the town centre to the pretty Kilminorth Woods Nature Reserve. The reserve has an abundance of flora and fauna with primroses, bluebells and dog violets to look out for. Wildlife includes herons, sparrowhawks, peregrines, roe deer and woodpeckers. The woods also have a nice off road cycling trail to try. Also of interest is the beautiful Looe Island. You can catch a boat from East Looe to the pretty island and enjoy a guided walk. Look out for grey seals and a variety of birdlife on your visit.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's some delightful old pubs at both ends of the route that are well worth some investigation: The Jolly Sailor in Looe is a historic pub of some note. It was originally established in 1516 making it one of the oldest pubs in England. Affectionately known as 'the Jolly' by the locals, it has been a place of rest and recreation for seafarers and travellers alike for centuries. Inside the main beam in the pub was taken from a French ship of the line at the Battle of Trafalgar in 1805. The ship was captured and renamed The Indefatigable. When she was later broken up, the landlord of the time arranged for the beam to be installed in the main bar and it remains there to this day. The pub has been refurbished to a very high standard, making it one of the most pleasant, as well as the most characterful of places to drink or stay in the town. You can find the pub on Princes Square, Looe at postcode PL13 2EP. In Polperro the delightful Blue Peter Inn is another must see pub. Nestled between ancient smugglers cottages on the harbour and Fish Quay, just a few yards from the beach 'The Blue' (as it is affectionately known) is one of the quaintest pubs you may ever come across. The building is Grade I listed and dates all the way back to the 16th century. The award winning pub has a wonderfully cosy interior, a great menu and is also dog friendly. You can find it on Quay Road with a postcode of PL13 2QZ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east along the coast path from Looe and you could visit the lovely Seaton Valley Countryside Park. There's nice trails along the River Seaton and lots of wildlife to see here. For details of the coast path between the two settlements see the Looe To Seaton Beach Walk page. You can continue your exercise on the circular Lansallos and Lantivet Bay Walk which visits a wonderful scenic cove and a picturesque beach waterfall."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Vh9qYoz6GHE",
  "district": "Looe",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "East Cliff, Plaidy, East Looe, Looe, Cornwall, England, PL13 1BU, United Kingdom",
  "postcode": "PL13 1BU",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "3-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint",
    "nature reserve"
  ],
  "facilities": [
    "visitor center",
    "cafe",
    "car park",
    "dog friendly",
    "beach"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling",
    "bird watching"
  ]
}