{
  "created_at": "2025-01-06T03:53:45.694675+00:00",
  "objectID": "6509fabe604a0870d8c384b14db027dd",
  "ref": "gog-magog-hills-walking-route",
  "title": "Gog Magog Hills Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Hill_fort_ditch_-_Wandlebury_Ring_-_geograph.org.uk_-_1142095.jpg",
  "nearby": [
    {
      "description": "Wandlebury Country Park",
      "objectID": "d86ae8a474db0bb59dfdd11d4adb1b7a",
      "ref": "wandlebury-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6509fabe604a0870d8c384b14db027dd.gpx",
  "_geoloc": {
    "lat": 52.1428634389,
    "lng": 0.1549130333
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Hill_fort_ditch_-_Wandlebury_Ring_-_geograph.org.uk_-_1142095.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hill fort ditch at Wandlebury Ring. The area was already inhabited during the Bronze Age and around 2500 years ago there was an Iron Age hill fort known as Wandlebury Ring. This hill fort once had concentric ditches and earthen walls which were kept in place by wooden palisades. Although the fort has vanished, the ditch (the Ring) dug around the edge can clearly be seen and walked along, being 5 metres deep in places and offering an adventurous route along its edge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Bridge_over_the_River_Granta_-_geograph.org.uk_-_67187.jpg/256px-Bridge_over_the_River_Granta_-_geograph.org.uk_-_67187.jpg",
      "title": "David Gruar / Bridge over the River Granta",
      "caption": "Bridge over the River Granta near Stapleford. River names are a bit confused in these parts. The river that flows through Cambridge used to be called the Granta, but it later became the Cam by back-formation from the name of the town (which is itself a corruption of Grantabridge or something similar). A mile above Grantchester it divides into two, the 'River Cam or Rhee' and the 'River Cam or Granta' (according to the OS). Into the latter flows this little trickle, also called the Granta."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Magog_Down.jpg",
      "title": "David Gruar, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Magog Down just east of Wandlebury Hill. It's a moderately hilly area of grassland to the south-east of Cambridge, with good views over the city on sunnier days than this one. The double chimney of Addenbrookes Hospital can just be made out on the skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/The_Dogwalk_at_Gog_Magog_Downs_-_geograph.org.uk_-_379827.jpg",
      "title": "gunnel clark / The Dogwalk at Gog Magog Downs",
      "caption": "The Dogwalk at Gog Magog Downs. This stretch of the path runs along the A1307. On the horizon can be seen the southern outskirts of Cambridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Gog_Magog_Hills_-_geograph.org.uk_-_644509.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from the footpath crossing the railway line just before Addenbrooke's Hospital. The 'hills' are the wooded area in the middle distance. It doesn't take much of an elevation in this part of East Anglia to be called a hill!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Roman_Road%2C_Gog_Magog_Hills_-_geograph.org.uk_-_302978.jpg",
      "title": "Alan Murray-Rust / Roman Road, Gog Magog Hills",
      "caption": "Roman Road, Gog Magog Hills. After nearly 2000 years, it has become a long-distance footpath again!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Giant%27s_Grave_-_geograph.org.uk_-_759575.jpg",
      "title": "Colin Bell / Giant's Grave",
      "caption": "Giant's Grave in Cherry Hinton. According to tradition, the giant Magog (associated with the Gog Magog hills a few miles south) is buried on the island in the pool here. The spring feeding this pool provided the water supply for Cherry Hinton, and later for much of Cambridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Gog_Magog_Hills_Farm_-_geograph.org.uk_-_722843.jpg",
      "title": "Duncan Grey / Gog Magog Hills Farm",
      "caption": "Gog Magog Hills Farm. Locally known as Bradfords Farm there is a popular farm shop for local produce."
    }
  ],
  "distance_km": 16.0,
  "description": "This walk explores the Gog Magog Downs, a ridge of low chalk hills extending for several miles to the southeast of Cambridge. You start your walk at the village of Stapleford four miles to the south of Cambridge. The village became famous when it emerged that Barack Obama was a direct descendant of Thomas Blossom, who lived in Stapleford during the 16th century before emigrating to the United States. You can pick up footpaths taking you from the village to Ash Grove, crossing the River Granta on the way. The walk then climbs to Copley Hill and Wandlebury Country Park where there is an Iron Age Hill Fort and a nature reserve. From the 74 m (243 ft) summit of Wandlebury Hill there are great views over the surrounding Cambrideshire countryside.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Wandlebury Park there's a pop up cafe on the weekends where you can enjoy refreshments after your walk. Near the start/end of the walk you'll find The Square and Compasses, in Great Shelford. There's a cosy interior and a nice garden area for warmer days. They are located on the High Street at postcode CB22 5EH. The Plough is another good option in the village. They have a pizza oven outside in the garden area where you can relax on warmer days. You can find them on the High Street at postcode CB22 5EH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and the woodland of the area make for a fine dog walk. The Plough pub mentioned above is also dog friendly with water bowls provided."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east of the hills and the park you'll find another significant local attraction at the Fleam Dyke Walk which visits some significant local archaeological sites and an impressive earthwork. The epic Harcamlow Way can also be picked up in nearby Fulbourn. Head into the nearby city of Cambridge and you could try the popular Cambridge Backs Walk which explores the historic university. Just a few miles to the west there's the worthy village of Haslingfield. Here you'll find pleasant walks along the River Rhee, rows of quaint thatched cottages, a church dating back to the 12th century and a noteworthy Tudor Manor House where Queen Elizabeth I stayed during the 16th century. Near here there's also the new settlement of Cambourne. There's some pleasant walks around this modern village with a lovely local nature reserve to explore. The wildlife rich reserve includes pretty lakes, wildflower meadows and wetland areas. On the walk you can also visit the ancient Bourn Windmill, the oldest surviving windmill in the United Kingdom. Just to the south there's also the stunning gardens at the historic Wimpole Hall. For more walking ideas in the area see the Cambridgeshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/RlBMNStmhG8",
  "postcode": "CB22 5EA",
  "district": "Stapleford",
  "county": "Cambridgeshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}