{
  "objectID": "6521dd291fb4cc9516cba00054d3f4c4",
  "created_at": "2024-12-18T11:25:39.110144+00:00",
  "ref": "sedgefield-walking-route",
  "title": "Sedgefield Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/06/Sedgefield_Manor_House_-_geograph.org.uk_-_981411.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/00D235074B1C86A2862585EC004FA86C/$FILE/Sedgefield.gpx",
  "_geoloc": {
    "lat": 54.6539162953,
    "lng": -1.4523809751
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Sedgefield_Manor_House_-_geograph.org.uk_-_981411.jpg",
      "title": "Stephen Craven / Sedgefield Manor House",
      "caption": "Sedgefield Manor House. The Manor House is a fine example of Queen Anne architecture and was built in 1707. The building has been carefully restored and is currently used for offices."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Sedgefield%2C_Shrove_Tuesday_ball_game_sculpture_-_geograph.org.uk_-_981406.jpg/256px-Sedgefield%2C_Shrove_Tuesday_ball_game_sculpture_-_geograph.org.uk_-_981406.jpg",
      "title": "Stephen Craven / Sedgefield: Shrove Tuesday ball game sculpture",
      "caption": "Sedgefield: Shrove Tuesday ball game sculpture. The sculpture, outside the parish church, was designed by Brian Sutherland and made in 2000 by David France. It illustrates a local custom which is alleged to have originated in playing with the head of a Scotsman."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Site_of_Bishop_Middleham_Castle_-_geograph.org.uk_-_422461.jpg",
      "title": "Oliver Dixon / Site of Bishop Middleham Castle",
      "caption": "Site of Bishop Middleham Castle. Bishop Middleham Castle was the principal seat of the Prince Bishops of Durham between the 12th and 14th century and occupies a prominent hill projecting into low-lying levels to the south; there is little to show of this once-great castle nowadays beyond a few humps and hollows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Hardwick_Park_-_geograph.org.uk_-_425216.jpg",
      "title": "Oliver Dixon / Hardwick Park",
      "caption": "Hardwick Park in the spring of 2007. A grand house has stood at Hardwick since Medieval times, but it was only in 1748 that John Burdon, a wealthy Tyneside businessman bought the estate that an extensive programme of building and landscaping was initiated. The Hall is now a Hotel whilst the southern part of the park is a country park managed by Durham County Council. This photo shows the meadows and an old avenue of trees in the eastern part of the Park on what was probably an old carriage drive between Sedgefield village and the Hall. The Sedgefield By-pass runs in front of the trees in the distance, with the gates to the Hotel beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/The_%22Durham_Lakes%22_return%5E_-_geograph.org.uk_-_413636.jpg",
      "title": "Oliver Dixon / The \"Durham Lakes\" return!",
      "caption": "Durham Lakes. There is an extensive area of low-lying land in mid-southern County Durham, occupied at least in Roman times by lakes, now drained by the River Skerne and its tributaries. It is probable that the Romans used the lakes and interconnecting canals for water. This view is taken from the low hill which marks the site of Bishop Middleham Castle. The water area beyond is punctuated by the tops of fence posts, which suggest that this is a temporary inundation rather than a new permanent lake, although recent weather has been fairly dry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/River_Skerne_-_geograph.org.uk_-_422464.jpg/256px-River_Skerne_-_geograph.org.uk_-_422464.jpg",
      "title": "Oliver Dixon / River Skerne",
      "caption": "River Skerne.  A sluggish tributary of the River Tees drains the low-lying levels to the north of Darlington which once formed the \"Durham Lakes\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/A_beautiful_old_house_sits_on_the_hill_which_was_the_site_of_Bishop_Middleham_Castle._-_geograph.org.uk_-_415367.jpg",
      "title": "Carol Rose / A beautiful old house sits on the hill which was the site of Bishop Middleham Castle.",
      "caption": "A beautiful old house sits on the hill which was the site of Bishop Middleham Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Ponded_stream_near_Bishop_Middleham_-_geograph.org.uk_-_422460.jpg",
      "title": "Oliver Dixon / Ponded stream near Bishop Middleham",
      "caption": "Ponded stream near Bishop Middleham. This is a minor stream which rises in the Ferryhill gap and joins the River Skerne a short way to the south of this photograph. This section of the stream has been ponded up at the Bishop Middleham pumping station which is located at the confluence. The A1(M) can be seen in the distance crossing the low-lying levels of the \"Durham Lakes\""
    }
  ],
  "distance_km": 11.0,
  "description": "This attractive town in County Durham has some fine country walks and is well known as the site of the historic Hardwick Hall. It also sticks in people's minds as former Prime Minister Tony Blair was the MP for the Sedgefield constituency from 1983 to 2007. The town resembles a village with a number of photogenic eighteenth century houses surrounding a pretty green. There is also a fine medieval church with a noteworthy tower to see. This walk from the town visits Hardwick Hall Country Park before heading to the nearby Middleham Castle at Bishop Middleham. There's lovely countryside scenes and views of the River Skerne to enjoy on the way. The walk starts from the western side of the town where you can pick up footpaths heading north west to Hardwick Hall. The park includes a 17-acre lake and a number of ornamental features, including temples, grottoes and follies. The path passes along the Serpentine Lake before heading north west through the countryside to Bishop Middleham, passing the River Skerne and Castle Lake on the way. This water body covers an area of 13 ha (33acres) and developed as a result of groundwater flooding. The lake attracts a variety of birds with up to 60-70 species at the site during the summer months. There is not much left of the castle which was once the seat of the Prince Bishops of Durham between the 12th and 14th century. After exploring the castle site and the lake the route then takes you into the village of Bishop Middleham. From the village you turn south east to pass the lake and return to Hardwick Hall before and the town.",
  "postcode": "TS21 2BX",
  "district": "Sedgefield",
  "county": "County Durham",
  "region": "North East",
  "country": "England"
}