{
  "created_at": "2025-01-06T02:17:48.138641+00:00",
  "objectID": "656c0a6d774146c0200b43d01392b732",
  "ref": "epsom-common-walking-and-cycle-route",
  "title": "Epsom Common Walk and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Epsom_Common_-_geograph.org.uk_-_1054321.jpg",
  "nearby": [
    {
      "description": "Epsom Downs",
      "objectID": "33c0285853738ec8deb8c98748782b1e",
      "ref": "epsom-downs-walking-route"
    },
    {
      "description": "Ashtead Common National Nature Reserve",
      "objectID": "ef9312c14e66197fb9d1c5144cf876fd",
      "ref": "ashtead-common-national-nature-reserve-walking-and-cycle-route"
    },
    {
      "description": "Horton Country Park",
      "objectID": "4102754cbd940474492ef51eda2fa56d",
      "ref": "horton-country-park-walking-and-cycle-route"
    },
    {
      "description": "Thames Down Link",
      "objectID": "5492bd3fd912559ad5619ee703537b58",
      "ref": "thames-down-link-walking-route"
    },
    {
      "description": "Chessington",
      "objectID": "f7627510f83178f9ba32026c962f2772",
      "ref": "chessington-walking-route"
    },
    {
      "description": "Oxshott",
      "objectID": "26a04bb2c51b141f9071d4d159fb69a0",
      "ref": "oxshott-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/656c0a6d774146c0200b43d01392b732.gpx",
  "_geoloc": {
    "lat": 51.3357311242,
    "lng": -0.30267698
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Epsom_Common_-_geograph.org.uk_-_1054321.jpg",
      "title": "Nigel Cox / Epsom Common",
      "caption": "Autumn tree on Epsom Common. Designated as a Site of Special Scientific Interest (SSSI) by English Nature in 1955 and as Local Nature Reserve (LNR) in 2001, the Common is approximately 435 acres or about 176 hectares in extent, and is the largest, in terms of area, LNR in Surrey. It has a variety of habitats, such as lakes, woodland, grassland, scrub and heathland. Here a solitary oak tree is growing in the heathland area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Epsom_Common_-_geograph.org.uk_-_82245.jpg",
      "title": "peter lloyd / Epsom Common",
      "caption": "Geese cross one of the roads through the common. The popular public house \"The Cricketers\" is shown in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Great_Pond%2C_Epsom_Common_-_geograph.org.uk_-_44120.jpg",
      "title": "Roger Miller / Great Pond, Epsom Common",
      "caption": "Great Pond is, as its name suggests, the largest of several ponds on the common. It was probably excavated in mediaeval times by the monks of the Abbey of Chertsey who originally owned the common, and they probably enlarged and formalized a natural depression that gathered water on the thick layer of impermeable London Clay that underlies the area. Today fishing is prohibited in this pond in order to encourage wildlife. It was restored during the period 1975-79 having previously been drained."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Stew_Pond%2C_Epsom_Common_-_geograph.org.uk_-_43643.jpg",
      "title": "Roger Miller / Stew Pond, Epsom Common",
      "caption": "Stew Pond. Once owned by the Abbey of Chertsey as part of their lands on Epsom Common, and probably originally excavated by the monks of the abbey, a stew pond was so-named because it would have been a holding pond where fish were fattened immediately prior to being consumed in a stew. This pond is the only one on the common today where fishing is allowed. The water in the pond comes via a spillway from Great Pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Duck_pond_on_Stamford_Green%2C_Epsom_Common_-_geograph.org.uk_-_82250.jpg",
      "title": "peter lloyd / Duck pond on Stamford Green, Epsom Common",
      "caption": "Duck pond on Stamford Green. Viewed towards West Hill from the terrace of The Cricketers public house"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Cattle_grazing_on_Epsom_Common_-_geograph.org.uk_-_44130.jpg",
      "title": "Roger Miller / Cattle grazing on Epsom Common",
      "caption": "Cattle grazing on the common in the summer of 2005. Parts of the common are grazed by cattle from Spring to Autumn. This helps to keep scrub at bay and aims to replicate the original open habitat of the common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Christ_Church%2C_Epsom_Common_-_geograph.org.uk_-_44138.jpg",
      "title": "Roger Miller / Christ Church, Epsom Common",
      "caption": "Christ Church parish church, seen from the east. Built in 1876 as a chapel of ease to St Martin of Tours parish church, Epsom."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Stamford_Green%2C_Epsom_-_geograph.org.uk_-_43638.jpg",
      "title": "Roger Miller / Stamford Green, Epsom",
      "caption": "Stamford Green, Epsom. This part of Epsom Common is known as Stamford Green, and straddles Stamford Green Road, beyond which lies the pond. Churchside is in the foreground."
    }
  ],
  "distance_km": 4.0,
  "description": "Follow this cycle and walking track around this large open space in Surrey. There are peaceful woodland trails, several ponds, fields with grazing cows and a wide variety of wildlife (the site is also a local nature reserve). If you would like to continue your exercise why not visit the nearby Horton Country Park or follow the Thames Down Link which passes through the common. The adjacent Ashtead Common National Nature Reserve also has miles of cycling and walking paths to enjoy. Just to the south east you will find Epsom Downs. You can follow a footpath across the famous racecourse and enjoy attractive chalk downland, grassland and woodland.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Cricketers Inn is conveniently located right next to the common. It's in a lovely spot with views of the picturesque cricket green and duck pond. There's an attractive interior and an outdoor area for warmer days. You can find the pub at 1 Stamford Green Road with a postcode of KT18 7SR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The common is a popular place for dog walking and you'll likely see plenty of other dogs on your outing. The Cricketers Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Chessington Walk starts from the Chessington South train station just to the north of the reserve. It runs past the famous theme park before visiting Ashtead Common and Epsom Common. It then picks up the London Looop to visit Horton Country Park and Chessington village. The walk is a nice way to explore the surrounding countryside and visit some of the other local highlights using public transport. Just to the north west of the common there's Oxshott Heath and Woods to visit. The village is also notable as being one of the most expensive places to live in the country. Residents include several premier league footballers and tennis player Andy Murray. For more walking ideas in the area see the Surrey Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/MYaCn8OcZv0",
  "county": "Surrey",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}