{
  "objectID": "657b71ad6999bee4a644ae82509b1c6a",
  "created_at": "2024-12-18T23:47:41.137483+00:00",
  "ref": "sandwood-bay-walking-route",
  "title": "Sandwood Bay Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Sandwood_Bay_-_geograph.org.uk_-_821419.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/D77F2D697AD72C2B80257F570030C3AE/$FILE/Sandwood Bay.gpx",
  "_geoloc": {
    "lat": 58.4909658105,
    "lng": -5.0996652182
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Sandwood_Bay_-_geograph.org.uk_-_821419.jpg",
      "title": "Anne Burgess / Sandwood Bay",
      "caption": "Sandwood Bay. The outcrops of rock in the middle of the bay are of Lewisian gneiss, which is up to 3000 million years old, give or take a hundred million or few. The most distant headland in this view is Cape Wrath, 11 miles to the north. The bay is backed by an extensive belt of dunes, most of which are stabilised by marram grass."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Sandwood_Loch_-_geograph.org.uk_-_821400.jpg",
      "title": "Anne Burgess / Sandwood Loch",
      "caption": "Sandwood Loch. The loch is about a mile long and up to half a mile wide. The steep slope above it on the right is Carn Call."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Sandwood_-_geograph.org.uk_-_821372.jpg",
      "title": "Anne Burgess / Sandwood",
      "caption": "The ruins of the house at Sandwood command a fine view towards Sandwood Loch, with a glimpse of the beach beyond the dunes at left. The walls of the house, like the surrounding dykes, still stand almost intact, though the roof and woodwork have vanished."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Sandwood_Bay_-_geograph.org.uk_-_821416.jpg",
      "title": "Anne Burgess / Sandwood Bay",
      "caption": "The cliffs at the south end of the bay, and the sea stack Am Buachaille, meaning 'the Herdsman', are of Torridonian sandstone. The foreground rocks here are Lewisian gneiss, so there is a change of rock type, and an age difference of more than a thousand million years, between the foreground and background in this view.\nThe stack is 65 metres (213 feet) high and was first climbed in 1968 by the mountaineers Tom Patey, Ian Clough and John Cleare. It is considered a \"famous\" sea stack climb with at least four routes to the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Sandwood_Bay_-_geograph.org.uk_-_821450.jpg",
      "title": "Anne Burgess / Sandwood Bay",
      "caption": "On the left is the more northerly of the two rocky outcrops on the beach. The map shows that it is accessible at low tide, but it's well offshore at this state of the tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Sandwood_Bay_Path_-_geograph.org.uk_-_821367.jpg/256px-Sandwood_Bay_Path_-_geograph.org.uk_-_821367.jpg",
      "title": "Anne Burgess / Sandwood Bay Path",
      "caption": "Sandwood Bay Path. The John Muir Trust, which owns the area, has obviously done a lot of work on the path, which is solidly constructed and easy to walk on."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Tr%C3%A0igh_Shanabhait_-_geograph.org.uk_-_821456.jpg",
      "title": "Anne Burgess / Tràigh Shanabhait",
      "caption": "Tràigh Shanabhait. A classic view of Sandwood Beach, with distant Am Buachaille guarding the southern extremity of the bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Druim_na_Buainn_-_geograph.org.uk_-_821403.jpg",
      "title": "Anne Burgess / Druim na Buainn",
      "caption": "Druim na Buainn. The cliffs above the south end of the bay are Torridonian Sandstone. Marram grass covers much of the sand dunes by the beach. The area contains a wide variety of other flora with more than 200 different species of plant, including eight types of orchid. The peatlands of Sandwood are among the most important wildlife habitats in north-west Scotland."
    }
  ],
  "distance_km": 12.0,
  "description": "Visit one of the most beautiful beaches in Great Britain on this wonderful walk in Sutherland. The route follows a 4 mile track from Blairmore, passing a series of pretty lochs through peat moorland to the coast. The walk starts at the car park in the little hamlet of Blairmore and soon picks up the trail to the coast. You'll first pass Loch Aisir, Loch na Gainimh and Loch a Mhuilinn before the wonderful stretch of coast comes into view. There's great views of the Cape Wrath cliffs and the lovely Sandwood Loch on this final section. The beach is absoultely stunning with sand dunes, cliffs and an unusual sea stack named Am Buachaille.  It's about a mile long so you can enjoy a long stroll along the beach before heading back to Blairmore on the same path. The Sandwood coast is a great place for wildlife spotting. Look out for dolphins and a variety of birds including Guillemots, Razor Bills and Shags.",
  "video_url": "https://www.youtube.com/embed/PFlaQY1M9cQ",
  "county": "Highland",
  "region": "Scotland",
  "country": "Scotland"
}