{
  "created_at": "2025-01-06T04:00:14.033123+00:00",
  "objectID": "6588b9959201d98e256c3f9b7ba0c66a",
  "ref": "new-river-path-walking-route",
  "title": "New River Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/New_River_in_King%27s_Meads_4.JPG/256px-New_River_in_King%27s_Meads_4.JPG",
  "nearby": [
    {
      "description": "Lea Valley Walk",
      "objectID": "af6db7140df05d5e84b785fb63202b0d",
      "ref": "lea-valley-walk-walking-route"
    },
    {
      "description": "Parkland Walk",
      "objectID": "99ebadd998417cdb5b1c69f10edd9382",
      "ref": "parkland-walk-walking-route"
    },
    {
      "description": "Enfield",
      "objectID": "13baca9cfcce8f494dc698c77578e4f4",
      "ref": "enfield-walking-route"
    },
    {
      "description": "Whitewebbs Park",
      "objectID": "d9d4b0334c0db4ec7e125d7d19788b7e",
      "ref": "whitewebbs-park-walking-route"
    },
    {
      "description": "Rye Meads",
      "objectID": "518ab65ecd282006032be5d192377ca6",
      "ref": "rye-meads-walking-route"
    },
    {
      "description": "Amwell Nature Reserve",
      "objectID": "275d467145b196b8613ea566ebb8aab9",
      "ref": "amwell-nature-reserve-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6588b9959201d98e256c3f9b7ba0c66a.gpx",
  "_geoloc": {
    "lat": 51.8066330703,
    "lng": -0.0578616322
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/New_River_in_King%27s_Meads_4.JPG/256px-New_River_in_King%27s_Meads_4.JPG",
      "title": "Dudley Miles [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "New River in King's Meads, a nature reserve near Hertford managed by the Herts and Middlesex Wildlife Trust"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_New_River_-_geograph.org.uk_-_322375.jpg",
      "title": "Mike Ryan / The New River, via Wikimedia Commons",
      "caption": "The New River near its start on the River Lee"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/The_New_River%2C_Stanstead_St._Margarets_-_geograph.org.uk_-_81002.jpg",
      "title": "Nigel Cox / The New River, Stanstead St. Margarets, via Wikimedia Commons",
      "caption": "The New River, Stanstead St. Margarets. The New River is something of a misnomer since it is neither a river nor new. It is an aqueduct built under the direction of Sir Hugh Myddleton between 1607 and 1612 to bring fresh drinking water from Chadwell and Amwell Springs near Ware about 40 miles down the Lee Valley to London"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/New_River_Aqueduct_-_geograph.org.uk_-_9983.jpg",
      "title": "Stephen Dawson / New River Aqueduct, via Wikimedia Commons",
      "caption": "New River Aqueduct. The New River was opened in 1613 to carry fresh water from near Hertford to Islington. In maintaining the contour, it had many large loops: in 1859 a 3½ mile loop through the Whitewebbs estate was cut off with embankments and this aqueduct over Turkey Brook. Just to the right (north) of here is where Thames Water extract water from the New River and pipe it into the King George V reservoir prior to treatment in Walthamstow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/New_River%2C_Bullsmore_Lane_-_geograph.org.uk_-_9975.jpg",
      "title": "Stephen Dawson / New River, Bullsmore Lane",
      "caption": "Bullsmore Lane. The New River was built in the 17th century to take drinking water from near Hertford to Islington."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/New_Gauge.jpg/256px-New_Gauge.jpg",
      "title": "The original uploader was StephenDawson at English Wikipedia., CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "This brick building known as New Gauge is the start of the New River with water pouring from the River Lea into the New River. Extraction of this water caused hostility with boatmen and mill-owners, who both claimed there was insufficient water in the Lea as a result."
    }
  ],
  "distance_km": 45.0,
  "description": "Follow the man made New River from Hertford to Islington on this easy waterside walk. There's much to enjoy on this walk including regular views of the River Lea and riverside Nature Reserves. The walk passes through Hoddesdon, Rye Meads RSPB Nature Reserve, Cheshunt, Enfield and Finsbury Park with urban sections towards the end of the walk. In the Hertford area the river runs parallel to the Lea Valley Walk which follows the towpath of the River Lea Navigation canal. It's a nice way of extending your walk or creating a circular route around the Hertford and Ware area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Refreshment options on the route include the Finsbury Park Cafe. There's an extensive menu and a nice outdoor seating area with good views across the park.Near here there's also the Woodberry Wetlands Nature Resere where there is an on site cafe. Built in 1538 the historic Red Lion pub is one of the oldest buildings in the area and the second oldest in Stanstead Abbotts. It started life as a monastery, then a coaching inn and was renovated in 2005 to help reinstate the character of the pub. They serve good quality food and gave a garden area. You can find them on the High Street at postcode SG12 8AA. The pub is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the route you'll pass through the lovely Woodberry Wetlands. This new nature reserve was created in 2016 and is one of the highlights on the path. There's two pretty reservoirs, a boardwalk, and a visitors' centre with a cafe. It's a great place to see several species of water loving bird such as pochard, shoveler, gadwall, grey heron, tufted duck and reed bunting. In Finsbury Park you can pick up the popular Parkland Walk. The walk follows the course of an old railway line running between Finsbury Park and Alexandra Park. The whole route is actually a local nature reserve and a great place to see interesting flora and fauna in the city. The Enfield Walk starts from the market town and uses part of the trail. It also visits the lovely Whitewebbs Park and the historic Forty Hall which is just to the west of the river, near the town. Near Ware and Stanstead Abbotts you'll pass pass the Amwell Nature Reserve. The reserve is a great place for wildlife with lots of wintering wildfowl to look out for on the two pretty lakes. It can be found at postcode SG12 8ED and is well worth taking a small detour to explore, particularly if you are keen on wildlife. For more walking ideas in the area see the Hertfordshire Walks and London Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mVPN8SoOIMw",
  "postcode": "SG13 7DP",
  "district": "Hertford",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}