{
  "created_at": "2025-01-06T00:26:28.920027+00:00",
  "objectID": "658f8790c646d28d413c2f654f1d6050",
  "ref": "sissinghurt-castle-walking-route",
  "title": "Sissinghurst Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/80/Sissinghurst_Castle_-_geograph.org.uk_-_54772.jpg",
  "nearby": [
    {
      "description": "Tenterden",
      "objectID": "12a3a5fd31cb98081341737059fa4634",
      "ref": "tenterden-walking-route"
    },
    {
      "description": "High Weald Landscape Trail",
      "objectID": "c7b8c1bca6fbd4e77e5b71e851dba4a5",
      "ref": "high-weald-landscape-trail-walking-route"
    },
    {
      "description": "Cranbrook",
      "objectID": "2d46880195c0d7833ef8f4fabe198fb2",
      "ref": "cranbrook-walking-route"
    },
    {
      "description": "Scotney Castle",
      "objectID": "6e932dac1985933614652a1a687702d3",
      "ref": "scotney-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/658f8790c646d28d413c2f654f1d6050.gpx",
  "_geoloc": {
    "lat": 51.1141646912,
    "lng": 0.5846197448
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Sissinghurst_Castle_-_geograph.org.uk_-_54772.jpg",
      "title": "Deri James / Sissinghurst Castle, via Wikimedia Commons",
      "caption": "Sissinghurst Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Oast_House_at_Sissinghurst_Castle%2C_Biddenden_Road%2C_Sissinghurst%2C_Kent_-_geograph.org.uk_-_578461.jpg",
      "title": "Oast House Archive / Oast House at Sissinghurst Castle, Biddenden Road, Sissinghurst, Kent, via Wikimedia Commons",
      "caption": "Oast House at Sissinghurst Castle, Biddenden Road, Sissinghurst, Kent Grade II listed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Lime_Walk_at_Sissinghurst_-_geograph.org.uk_-_188844.jpg",
      "title": "Richard Croft / Lime Walk at Sissinghurst, via Wikimedia Commons",
      "caption": "Lime Walk at Sissinghurst"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Priest_House%2C_Sissinghurst_Castle_%28geograph_5353564%29.jpg/512px-Priest_House%2C_Sissinghurst_Castle_%28geograph_5353564%29.jpg",
      "title": "Oast House Archive / Priest House, Sissinghurst Castle, via Wikimedia Commons",
      "caption": "Priest House, Sissinghurst Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Chapel%2C_The_Street%2C_Sissinghurst%2C_Kent_-_geograph.org.uk_-_483614.jpg",
      "title": "Oast House Archive / Chapel, The Street, Sissinghurst, Kent",
      "caption": "Chapel, The Street, Sissinghurst village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/The_Milk_House_-_geograph.org.uk_-_3918233.jpg/512px-The_Milk_House_-_geograph.org.uk_-_3918233.jpg",
      "title": "The Milk House by Stuart Logan, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Milk House in the village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/View_from_the_roof_-_north-west_-_geograph.org.uk_-_2403300.jpg",
      "title": "View from the roof - north-west by Graham Horn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from the roof"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Sissinghurst_-_view_across_the_orchard_-_geograph.org.uk_-_188847.jpg",
      "title": "Richard Croft / Sissinghurst - view across the orchard",
      "caption": "Sissinghurst - view across the orchard. View from the tower across the orchard towards the gazebo and Kent countryside beyond"
    }
  ],
  "distance_km": 4.5,
  "description": "Explore the 460 acres of gorgeous Wealden countryside in the Sissinghurst Castle Estate on this walk in Kent. You can stroll through the stunning gardens before heading into the surrounding woodland to stretch your legs further. Highlights include the gazebo by the pretty moat, and the 16th century tower with vast panoramic views from the top. There's also some nice woodland with pretty bluebells in the spring. The gardens are varied and extensive with a rose garden, herb garden, orchard and glasshouses. There are also a number of ruined buildings and a library with a collection of 11000 rare books. Sissinghurt Castle is located near Cranbrook and Tenterden in Kent.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a good on site cafe at the castle sellling a decent range of meals and snacks. If you fancy a pub lunch you could stroll into Sissinghurst village and visit The Milk House. It's a pub of some note being set in a former 16th century hall house. It has a charming olde worlde interior with timber beams and a Tudor fireplace. They do excellent food including some particularly delicious pizzas. Outside there's a lovely large garden area to relax in on warmer days. You can find them in the village at a postcode of TN17 2JG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome to explore as much of the estate as they like but aren't allowed in the main garden or in the vegetable garden. Please keep dogs on leads when near livestock. The Milk House pub mentioned above is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you enjoy this walk then you could head a few miles south east and visit the pretty village of Tenterden. Here you could try our Tenterden Walk which takes you along the High Weald Landscape Trail to the noteworthy Smallhythe Place. This National Trust half-timbered house was built in the late 15th or early 16th century. It was the home of the Victorian actress Ellen Terry from 1899 to her death in the house in 1928. The house contains Terry's theatre collection, while the cottage grounds include her rose garden, orchard, nuttery and the working Barn Theatre. It's an interesting local place to visit and it's very nice to stroll around the gardens on a fine day. The castle can be easily reached on foot from the nearby town of Cranbrook on the Cranbrook Walk. The town is well worth exploring with its medieval buildings, a church known as the 'Cathedral of the Weald' and a very photogenic working windmill to see. It's about a 3 mile walk from the town to the castle, passing through some attractive woodland and farmland on the way. Another must see in the vicinity is Scotney Castle. It's another National Trust run property in a similar vein to Sissinghurst. The ruined castle is surrounded by some lovely grounds and gardens. Near here you can also pick up the historic Lamberhurst Walk which visits the noteworthy Bayham Old Abbey. The site is run by English Heritage and includes substantial ruins dating back to the 13th century. Just to the south of the castle there's the expansive Hemsted Forest. There's miles of good footpaths and bridleways suitable for cycling here. A couple of miles due east there's the village of Biddenden. It's a worthy place to visit with a picturesque village green, a fine 15th century pub and a photogenic High Street with a number of old Flemish weavers cottages to admire. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/IqOI1kViRbQ",
  "county": "Kent",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}