{
  "created_at": "2025-01-06T03:05:54.462181+00:00",
  "objectID": "664c1a14a7de703e4562d5609745a60b",
  "ref": "melksham-walking-route",
  "title": "Walk around Melksham - Canal and River Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/River_Avon%2C_Melksham_-_geograph.org.uk_-_1344922.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/664c1a14a7de703e4562d5609745a60b.gpx",
  "_geoloc": {
    "lat": 51.379775112,
    "lng": -2.1376734804
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/River_Avon%2C_Melksham_-_geograph.org.uk_-_1344922.jpg",
      "title": "Derek Harper / River Avon, Melksham",
      "caption": "River Avon, Melksham. The river approaching the town, seen from a riverside path near Kings Park Primary School. The trees on the opposite bank hide the Cooper Tire and Rubber plant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/River_Avon_at_Melksham_-_geograph.org.uk_-_497024.jpg",
      "title": "Phil Williams / River Avon at Melksham",
      "caption": "A view looking to the southwest along the River Avon, downstream of the weir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Melksham_weir_-_geograph.org.uk_-_497026.jpg",
      "title": "Phil Williams / Melksham weir",
      "caption": "Melksham weir. A view looking to the northeast along the placid waters of the River Avon, upstream of the weir. The structure on the left is a flood control gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/On_the_Kennet_and_Avon_Canal_between_Seend_and_Semington_-_geograph.org.uk_-_85183.jpg",
      "title": "Rog Frost / On the Kennet and Avon Canal between Seend and Semington",
      "caption": "On the Kennet and Avon Canal between Seend and Semington."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Somerset_Arms%2C_Semington_-_geograph.org.uk_-_650302.jpg",
      "title": "Maurice Pullin / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Somerset Arms, Semington. About 300 yards south of the Kennet & Avon Canal this pub does a very nice Sunday lunch. It's a good option if you'd like to stop for some refreshments on the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Near_Semington_-_geograph.org.uk_-_3658.jpg",
      "title": "David Stowell / Near Semington",
      "caption": "Near Semington. The Kennet and Avon in open countryside near Semington with repairs in progress on Newtown Farm Swing Bridge"
    }
  ],
  "distance_km": 13.0,
  "description": "This Wiltshire town has some lovely waterside walking trails along the tranquil River Avon and the Kennet and Avon Canal to the south. It's also surrounded by some lovely Wiltshire countryside with plenty of waymarked footpaths to try. Melksham is conveniently located just east of Bath and not far from Bradford-on-Avon. This circular walk around the town takes you along the river to the Kennet and Avon Canal to the south of the town. The route run for just over 8 miles and includes some nice waterside and countryside sections. The walk starts in the town by the river and follows footpaths south west to the Pack Horse Bridge at Monkton Farm. The route continues south east past Whaddon before picking up the canal towpath near Semington. You can take a little detour south of the canal to visit the pretty village if you have time. Follow the towpath east towards Seend Cleeve before heading north east to Redstocks. Here you turn north west to return to Melksham through the countryside. The last section through the town follows the pretty Clackers Brook back to the river. Please scroll down for the full list of walks near and around Melksham. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Water Meadow in East Melksham is a nice place for a pit stop. They do good food at reasonable prices and have an outdoor seating area for warmer days. You can find the pub at Verbena Court with a postcode of SN12 7GG for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Melksham has a train station on the Great Western Railway. Two weekday southbound services run through to Southampton Central and two northbound services continue to Cheltenham. Just to the west there's the worthy village of Holt to explore. Here you'll find two fine National Trust properties with beautiful gardens and plenty of history. The North Wiltshire Rivers Route actually starts from the town. This long distance cycling and walking trail runs all the way to Avebury through some lovely countryside."
    }
  ],
  "county": "Wiltshire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}