{
  "objectID": "664d790bb6ceb98b1413050d85a04ea7",
  "created_at": "2024-12-18T01:25:06.141923+00:00",
  "ref": "stiffkey-walking-route",
  "title": "Stiffkey Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Stiffkey_village_sign_-_geograph.org.uk_-_1052927.jpg/256px-Stiffkey_village_sign_-_geograph.org.uk_-_1052927.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/FAF2668DDC5A3026862586FD005AF380/$FILE/Stiffkey.gpx",
  "_geoloc": {
    "lat": 52.9498398719,
    "lng": 0.9313188674
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Stiffkey_village_sign_-_geograph.org.uk_-_1052927.jpg/256px-Stiffkey_village_sign_-_geograph.org.uk_-_1052927.jpg",
      "title": "Ian Capper / Stiffkey village sign",
      "caption": "Stiffkey village sign. The colours on the beak of the tern depicted on the sign suggests that it is supposed to be a Little Tern (Sterna albifrons), of which there is a nesting colony on the nearby marshes. This sign is at the eastern entrance to the village, on the green in front of Camping Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Stiffkey_fen_and_saltmarshes_beyond_-_geograph.org.uk_-_1024622.jpg",
      "title": "Evelyn Simak / Stiffkey fen and saltmarshes beyond",
      "caption": "Stiffkey fen and saltmarshes beyond. The fields are rolling down towards the coast where they are met by marshland and the North Sea. The wetland seen in mid distance is Stiffkey fen which is populated by many migrating birds - the honking of wild geese could clearly be heard; this wetland is located just north of the A149 (Morston Road). Stiffkey saltmarshes can be seen beyond; dunes and the North Sea can be glimpsed on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Track_across_the_saltmarsh_-_geograph.org.uk_-_952596.jpg",
      "title": "Hugh Venables / Track across the saltmarsh",
      "caption": "Track across the saltmarsh. Together with a few bridges, this gets you out to a sandy beach beyond the saltmarsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Coastal_Path_north_of_Stiffkey_-_geograph.org.uk_-_1389248.jpg",
      "title": "Richard Law / Coastal Path north of Stiffkey",
      "caption": "Coastal Path north of Stiffkey. Part of the Norfolk Coast Path, which is designated as a bridleway along this section."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Left_for_Morston_-_geograph.org.uk_-_1024587.jpg",
      "title": "Evelyn Simak / Left for Morston",
      "caption": "Left for Morston. The former service road (or runway) of Langham airfield now provides access to the poultry sheds seen in the distance (at right). The public footpath leading to Morston turns off in northwesterly direction (at left). This area once used to be part of Langham airfield which was opened at the beginning of WWII as a second satellite airfield for Bircham Newton. During its first two years of operation the airfield was fairly quiet with target towing and air-sea rescue operations being conducted together with some anti-shipping operations performed by a detachment of Fleet Air Arm Swordfish aircraft. In 1942 its status was raised to that of an independent station and for the next 16 months it was closed for a major expansion which included the laying of concrete runways, perimeter tracks and dispersals. Presently the former airfield is used as a poultry farm. One of the most important relics of its military past is the so-called Langham Dome, a former training facility, which still stands near the airfield."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Airfield_Dome_Trainer_at_Langham_-_geograph.org.uk_-_1024546.jpg",
      "title": "Evelyn Simak / Airfield Dome Trainer at Langham",
      "caption": "Airfield Dome Trainer at Langham This black domed building is Langham Airfield Dome Trainer, one of around 40 structures of this kind which were built during WWII. Only a few of these buildings have survived and this particular one now is a Scheduled Ancient Monument. It is located beside the road connecting Langham with the village of Cockthorpe, further to the northwest, on the site of the former airfield near the village of Langham, and it was used by the Royal Air Force to train their squadrons in the operation of an anti-aircraft gun by using film projection techniques. The first squadrons stationed there were 455 Royal Australian Air Force and 489 Royal New Zealand Air Force. It fell into disrepair after the war and none of the interior remains. In 1961, turkey-giant Bernard Matthews purchased the land including the dome but is planning to donate the building and half-an-acre of surrounding land to the North Norfolk Historic Buildings Trust who plan to conserve the structure and restore the interior to demonstrate its original use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/The_village_of_Cockthorpe_-_geograph.org.uk_-_1024596.jpg",
      "title": "Evelyn Simak / The village of Cockthorpe",
      "caption": "The village of Cockthorpe. The transmitter, located just east of the village, can be seen at left; the tower of All Saints church can be glimpsed above the trees at right. This view was taken from the public footpath to Morston which leads across higher ground; it is adjoined by a large cultivated field (seen in the foreground) and offers good views in all directions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Stiffkey_Old_Hall_-_geograph.org.uk_-_582250.jpg",
      "title": "Nigel Jones / Stiffkey Old Hall",
      "caption": "Stiffkey Old Hall. Taken from over the churchyard wall of St John the Baptist. This Elizabethan Grade II* listed structure, is composed of an extraordinary array of restored buildings, gardens and ruins (including four round towers). It is now undergoing an extensive restoration."
    }
  ],
  "distance_km": 12.6,
  "description": "This village in north Norfolk is in a great spot for exploring some wonderful wildlife rich marshland. This circular walk from the village visits Salt Marshes , Stiffkey Fen, Morston and Langham. There's some marvellous coastal scenery and lots of bird life to look out for around the lagoons and wetland. The walk starts in the village and follows tracks north to meet with the Peddars Way and Norfolk Coast Path at the Salt Marshes. Follow the waymarked trail east and it will take you to Stiffkey Fen and Morston Green. Here you pick up a country trail and follow it south to the village of Langham and Langham Hall. From Langham you can pick up another quiet country lane and follow it north west back to Stiffkey, passing through Cockthorpe as you go.",
  "video_url": "https://www.youtube.com/embed/kM9j-fn9qLA",
  "postcode": "NR23 1QH",
  "district": "Stiffkey",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}