{
  "created_at": "2025-01-06T02:22:59.311198+00:00",
  "objectID": "66bf3dd0621fdf25f8c5635bec31aec9",
  "ref": "cherhill-white-horse-walking-route",
  "title": "Cherhill White Horse Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Cherhill_village_-_geograph.org.uk_-_46640.jpg",
  "nearby": [
    {
      "description": "White Horse Trail",
      "objectID": "f8439cbeac9e3bb5a4852659b79a5429",
      "ref": "white-horse-trail-walking-route"
    },
    {
      "description": "Avebury Stones",
      "objectID": "131fc4cd3eaa13cde0fc3361fc0d2e7a",
      "ref": "avebury-stones-walking-route"
    },
    {
      "description": "Silbury Hill",
      "objectID": "0aae9fdb3b0a9017250b6945820beb81",
      "ref": "silbury-hill-walking-route"
    },
    {
      "description": "Calne",
      "objectID": "c64e44d2d6438ea19b6677a0942af5e6",
      "ref": "calne-walking-route"
    },
    {
      "description": "Tetbury",
      "objectID": "b100410d671c74d3867d1deacb3e9496",
      "ref": "tetbury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/66bf3dd0621fdf25f8c5635bec31aec9.gpx",
  "_geoloc": {
    "lat": 51.430510318,
    "lng": -1.94324111
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Cherhill_village_-_geograph.org.uk_-_46640.jpg",
      "title": "Ron Strutt / Cherhill village",
      "caption": "Delightful thatched cottages in Cherhill village where the route starts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Barley_crop%2C_Cherhill_-_geograph.org.uk_-_1462064.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barley crop. A large field of barley waits to be harvested beside the A4. The Cherhill White Horse is in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Bridleway_on_Cherhill_Down_-_geograph.org.uk_-_1564983.jpg",
      "title": "Andrew Smith / Bridleway on Cherhill Down",
      "caption": "Bridleway on Cherhill Down. The bridleway is the Wessex Ridgeway as it descends south from the down towards extensive arable fields."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Track_to_Cherhill_Monument_-_geograph.org.uk_-_420820.jpg",
      "title": "Chris Heaton / Track to Cherhill Monument",
      "caption": "Track to Cherhill Monument. A track leaves the Wessex Ridgeway, to aim for the obelisk on Cherhill Hill by driving through the ramparts of ancient Oldbury Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/View_from_the_bridleway_north_of_Cherhill_-_geograph.org.uk_-_1057639.jpg",
      "title": "Brian Robert Marshall / View from the bridleway north of Cherhill",
      "caption": "View from the bridleway north of the village. The view is across farmland west of the bridleway towards the Cherhill white horse and the Lansdowne monument."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/The_Cherhill_White_Horse_and_the_Landsdowne_Monument_-_geograph.org.uk_-_220141.jpg",
      "title": "Janine Forbes / The Cherhill White Horse and the Landsdowne Monument",
      "caption": "The Cherhill White Horse and the Landsdowne Monument. The Cherhill, or Oldbury, White Horse was originally cut in 1780. It once had a glass eye formed from upturned bottles but these were robbed out. Attempts were made to replace the eye but these suffered the same fate. The current eye is stone and concrete. The Lansdowne Monument is a 38 metre stone obelisk erected in 1845 by Third Marquis of Lansdowne, in remembrance of one of his ancestors, Sir William Petty who was a physician and surveyor. the monument was restored by the National Trust in 1990."
    }
  ],
  "distance_km": 4.0,
  "description": "This circular walk takes you to Cherhill Down and the Lansdowne Monument in Wiltshire. The Cherhill White Horse dates from the 18th century and is the third oldest white horse in the country. The downs are a lovely place for a walk with splendid views across rolling valleys and hills. On a clear day you can see the Tetbury water tower. The walk starts in the pretty village of Cherhill with its thatched cottages, village hall and pub. The route then makes use of the White Horse Trail to climb the downs where you will pass the 120ft high Lansdowne Monument. The impressive structure was erected in 1845 by the 3rd Marquess of Lansdowne to commemorate his ancestor Sir William Petty. You will also pass Oldbury Castle, a hill fort which dates from the bronze age. The walk then descends the hill to the A4 where you pick up a roadside path to lead you back to Cherhill village. If you would like to extend your walk then you could continue along the White Horse Trail to the nearby Avebury Stones and Silbury Hill. A few miles to the south east you can visit the Devizes White Horse at Roundway Hill. The hill is also the site of a 1643 Civil War battle and Oliver's Castle Iron Age Hillfort.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the Black Horse for some post walk refreshment. The pub has an interesting history dating back to the 18th century when it was a coaching inn. It is notable for being the hideout for the infamous Cherhill Gang, a group of highwaymen that would rob passers by naked to avoid being caught. They have a charming interior with interesting artwork on the walls. There's also a good menu and an outdoor area as well. You can find them at a postcode of SN11 8UT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill makes for a nice bracing walk for fit dogs. The Black Horse pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The hill is located a short distance east from the town of Calne. Here you can try the circular Calne Walk which takes you to Bowood House. The 18th century Georgian country House is surrounded by beautiful grounds with public footpaths running through the western side of the park. For more walking ideas in the area see the North Wessex Downs Walks and the Wiltshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ytgdN0yKb9M",
  "district": "Cherhill",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Park Lane, Cherhill, Wiltshire, England, SN11 8XN, United Kingdom",
  "postcode": "SN11 8XN",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "historical monuments",
    "views",
    "archaeological sites"
  ],
  "facilities": [
    "pub",
    "village hall",
    "roadside path"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}