{
  "objectID": "672193e659e5492000d0b0041f8db883",
  "created_at": "2024-12-18T00:33:10.378920+00:00",
  "ref": "hatchet-pond-walking-route",
  "title": "Hatchet Pond Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Hatchet_Pond%2C_New_Forest_-_geograph.org.uk_-_982775.jpg",
  "nearby": [
    {
      "description": "Beaulieu River",
      "objectID": "0252332f3b21d5a4605d753840f0209c",
      "ref": "beaulieu-river-walking-route"
    },
    {
      "description": "Beaulieu Heath",
      "objectID": "79a58b4f603e92d79f03ef88668b7c58",
      "ref": "beaulieu-heath-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/639CD8D3859254F485257EDF004BB85E/$FILE/Hatchet Pond.gpx",
  "_geoloc": {
    "lat": 50.8132219689,
    "lng": -1.4773623195
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Hatchet_Pond%2C_New_Forest_-_geograph.org.uk_-_982775.jpg",
      "title": "Jim Champion / Hatchet Pond, New Forest",
      "caption": "Hatchet Pond. A view south-west across the smooth surface of Hatchet Pond. The pond started as a series of marl diggings which were then flooded when the valley was dammed to provide a head of water for the nearby mill (off to the left)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Pond_between_Hatchet_Pond_and_Hatchet_Moor_car_park%2C_New_Forest_-_geograph.org.uk_-_460222.jpg",
      "title": "Jim Champion / Pond between Hatchet Pond and Hatchet Moor car park, New Forest",
      "caption": "Pond between Hatchet Pond and Hatchet Moor car park. This flooded disused marl pit is just to the east of the Hatchet Moor car park, between the B3054 road and Hatchet Pond. There are lilies growing in it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Swan_feather_on_Hatchet_Pond_-_geograph.org.uk_-_982792.jpg/512px-Swan_feather_on_Hatchet_Pond_-_geograph.org.uk_-_982792.jpg",
      "title": "Jim Champion / Swan feather on Hatchet Pond",
      "caption": "Swan feather on the pond. This feather floating on the surface of Hatchet Pond came from a preening swan - one of a pair of swans that are often seen at the pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Fishing_at_Hatchet_Pond%2C_Beaulieu_Heath%2C_New_Forest_-_geograph.org.uk_-_24694.jpg",
      "title": "Jim Champion / Fishing at Hatchet Pond, Beaulieu Heath, New Forest",
      "caption": "Fishing at Hatchet Pond. The pond was artificially created by damming clay diggings to provide a head of water for the nearby mill. It is now a popular tourist centre, situated in the fork where the road from Beaulieu diverges to Brockenhurst and Lymington."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Cattle_on_the_move_at_Hatchet_Pond%2C_New_Forest_-_geograph.org.uk_-_190991.jpg",
      "title": "Jim Champion / Cattle on the move at Hatchet Pond, New Forest",
      "caption": "Cattle on the move. Looking across the northern end of the pond, these cattle are on the move around the edge of the water (away from tourists, towards pastures new). The B3055 road is in the background and there are a couple of black-headed gulls wading around in the shallows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Black-headed_gull_at_Hatchet_Pond%2C_New_Forest_-_geograph.org.uk_-_190984.jpg",
      "title": "Jim Champion / Black-headed gull at Hatchet Pond, New Forest",
      "caption": "Black-headed gull on the pond. The sea is only a few miles to the south of the pond and there are often seagulls of one kind or another lurking around. The artificially created body of water is popular with visitors to this part of the Forest, and the gulls have no problem scavenging discarded food."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Feeding_time_at_Hatchet_Pond%2C_New_Forest_-_geograph.org.uk_-_346489.jpg",
      "title": "Jim Champion / Feeding time at Hatchet Pond, New Forest",
      "caption": "Feeding time. A few moments earlier the occupants of another car had been throwing crumbs to the gulls in the car park at Hatchet Pond. This car turned up and was the focus of attention for the gulls, some swans and cygnets and even a passing pony. It is against the Forest by-laws to feed commoners' stock, such as ponies - feeding encourages them to pester people in future, lures them into more dangerous areas such as roads and car parks, and human food is not necessarily a good diet for them anyway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/North-west_corner_of_Hatchet_Pond%2C_New_Forest_-_geograph.org.uk_-_456962.jpg",
      "title": "Jim Champion / North-west corner of Hatchet Pond, New Forest",
      "caption": "North-west corner of the site. The pond was originally a series of marl diggings on Beaulieu Heath, which were later dammed to provide a head of water for the nearby mill (in this photo the causeway across the dam which carries the B3054 road is on the far side of the pond, to the right of the car park). At this north-west corner of the pond the old pits are more obvious as they are not completely submerged. A pair of swans with cygnets are floating around and visitors are watching from the edge of the water."
    }
  ],
  "distance_km": 3.0,
  "description": "This large pond in the New Forest makes for a nice, easy circular walk. The pond is located about a mile west from Beaulieu with a good sized parking area at the eastern end. There's a nice footpath to follow around the water where you will often see New Forest Ponies enjoying a drink! The pond is the largest body of water in the New Forest so it's about a 2 mile walk all the way around. It's a great spot for a picnic with facilities that include toilets and an ice cream van in the summer months. Wildlife lovers can look out for birds on the water such as Herons and Egrets. If you would like to continue your walking in the area you can enjoy a waterside walk along the Beaulieu River . You could also try the longer Beaulieu Heath Walk will explores the expansive heathland area surrounding the ponds.",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}