{
  "created_at": "2025-01-06T04:55:22.070617+00:00",
  "objectID": "675fda18ef31291e750c51fec5fee587",
  "ref": "tring-park-walking-route",
  "title": "Tring Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Tring_Park_-_geograph.org.uk_-_1480840.jpg",
  "nearby": [
    {
      "description": "Tring Reservoirs",
      "objectID": "fa68832f07583c10caac77a926a2f363",
      "ref": "tring-reservoirs-walking-route"
    },
    {
      "description": "Wendover Woods",
      "objectID": "b7e790c9a2cb011c456ed7f93c4a835a",
      "ref": "wendover-woods-walking-and-cycle-route"
    },
    {
      "description": "Icknield Way Path",
      "objectID": "e96b8caef019982483e720c1ec5927d6",
      "ref": "icknield-way-path-walking-route"
    },
    {
      "description": "Grand Union Canal Walk",
      "objectID": "dae6d837fcdb83dc44e94da2b24b4040",
      "ref": "grand-union-canal-walk-walking-route"
    },
    {
      "description": "The Ridgeway",
      "objectID": "2384cde76809687efb1a502a57345f61",
      "ref": "the-ridgeway-walking-route"
    },
    {
      "description": "Wiggington",
      "objectID": "75f14471bfa9edf310a3aef9e17d8aaa",
      "ref": "wiggington-walking-route"
    },
    {
      "description": "Tring Circular Walk",
      "objectID": "82bec53cc1f7705d51a3bf5965b15fa7",
      "ref": "tring-circular-walk-walking-route"
    },
    {
      "description": "Haddington Hill",
      "objectID": "3baec92455153b0e0b81c87049493568",
      "ref": "haddington-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/675fda18ef31291e750c51fec5fee587.gpx",
  "_geoloc": {
    "lat": 51.7907926133,
    "lng": -0.6601790967
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Tring_Park_-_geograph.org.uk_-_1480840.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tring Park originally formed part of the estate of the banker Lionel de Rothschild and of his son Nathaniel (1st Baron Rothschild of Tring), who made sweeping changes to the mansion, to the estate farms and its other buildings, and who opened the Tring Zoological Museum as a gift to his son Walter - the Museum now forms part of 'The Natural History Museum' (and is well worth a visit). Walter Rothschild was responsible for introducing numerous exotic animals - including wallabies, cassowaries, quaggas and rheas - into the Park's extensive grassland. Today the Park, which is managed by the Woodland Trust, is home to much less exotic sheep and cattle. This view is towards Pitstone Hill (skyline, right of centre)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/The_Mansion%2C_Tring_Park_-_geograph.org.uk_-_1608834.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Mansion. Once the seat of a branch of the Rothschild banking family, is now home to Tring Park School for Performing Arts"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Horses_on_the_fields_at_Home_Farm%2C_Tring_-_geograph.org.uk_-_1502475.jpg/512px-Horses_on_the_fields_at_Home_Farm%2C_Tring_-_geograph.org.uk_-_1502475.jpg",
      "title": "Chris Reynolds / Horses on the fields at Home Farm, Tring",
      "caption": "Horses on the fields at Home Farm. Home Farm was rebuilt over 100 years ago by the Rothschild family, then living in Tring Park. For a time it was known as White Cloud Farm (the childhood home of Stirling and Pat Moss) but has now reverted to the name Home Farm. The fields now provide a green strip between Park Road, Tring, and the bypass (A41)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Tring_Park_-_with_cattle_grazing_the_rich_pasture_-_geograph.org.uk_-_1342386.jpg",
      "title": "Chris Reynolds / Tring Park – with cattle grazing the rich pasture",
      "caption": "Cattle grazing the rich pasture. This view would have been visible from Tring Mansion a hundred years ago \u0096but now the house is surrounded by a high hedge and the park is used for cattle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Tring_Park%2C_The_Summerhouse_-_geograph.org.uk_-_185101.jpg",
      "title": "Nigel Cox / Tring Park: The Summerhouse",
      "caption": "This Summerhouse is the folly in Tring Park where King Charles II is supposed to have met the actress Nell Gwyn while she was attending the Tring School of Drama."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Tring_Park_-_Perhaps_the_site_of_a_Medieval_Open_Field_-_geograph.org.uk_-_1342382.jpg",
      "title": "Chris Reynolds / Tring Park – Perhaps the site of a Medieval Open Field",
      "caption": "Perhaps the site of a Medieval Open Field. This view would have been visible from Tring Mansion a hundred years ago \u0096 but now the house is surrounded by a high hedge and the park is used for cattle. If you look carefully at the grass in the foreground there appear to be three parallel strips. I wonder if this was the site of one of the town's open fields in Medieval times? The stripes look just about the right width."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Tring_Park_-_Looking_towards_the_Bypass_-_geograph.org.uk_-_1342392.jpg",
      "title": "Chris Reynolds / Tring Park – Looking towards the Bypass",
      "caption": "Looking towards the Bypass. When the bypass was built it was carefully landscaped so it was invisible, but it runs just behind the group of three smaller trees. The wooded hill in the distance is also part of the original parkland. While the landscaping is effective from this side it is wasted because there are few accessible places where one can actually appreciate it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Woodland_walk_above_Tring_Park_-_geograph.org.uk_-_649063.jpg/256px-Woodland_walk_above_Tring_Park_-_geograph.org.uk_-_649063.jpg",
      "title": "Colin Park / Woodland walk above Tring Park",
      "caption": "Woodland walk above the park."
    }
  ],
  "distance_km": 5.5,
  "description": "This splendid park in the Chilterns AONB has lots of good walking trails to try. In the park you will find expansive areas of grassland and pretty bluebell woods ideal for a peaceful afternoon stroll. There's lots of wildflowers and butterflies in the summer months with great views from the park's high points. It's a great area for wildlife watching with orange tip, marbled white and common blue butterflies to look out for. Also keep your eyes peeled for kestrel, red kite, woodpeckers, nuthatch, chifffchaff, willow warbler and blackcap. The park is located just to the south of the Tring town centre. You can park at the Natural History Museum car park and then pick up the trails into the park. Tring park is in a great location for extending your walking in the area. The Icknield Way Path and the Ridgeway long distance trails both pass through the southern section of the park. If you head west you can enjoy woodland cycling and walking trails in the expansive Wendover Woods. It's only about 2 miles west of the park and includes waymarked walks, sculptures and more great views of the Chilterns countryside. Just to the east of the park is the Grand Union Canal which you can follow north to Marsworth and the lovely Tring Reservoirs .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Wiggington Walk and the Tring Circular Walk pass close to the park and provide a further opportunity for exploring the area. For more walking ideas in the area see the Chilterns Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dDJojYpWGMk",
  "district": "Dacorum",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Tring Park School for the Performing Arts, Mansion Drive, Tring, Dacorum, Hertfordshire, England, HP23 5LX, United Kingdom",
  "postcode": "HP23 5LX",
  "state": "England"
}