{
  "created_at": "2025-01-06T03:41:54.489331+00:00",
  "objectID": "679d14b04178b50890d151de68955347",
  "ref": "hanley-swan-walking-route",
  "title": "Hanley Swan Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/70/The_Swan_Inn%2C_Hanley_Swan_-_geograph.org.uk_-_392316.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/679d14b04178b50890d151de68955347.gpx",
  "_geoloc": {
    "lat": 52.0798859546,
    "lng": -2.2690674537
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/The_Swan_Inn%2C_Hanley_Swan_-_geograph.org.uk_-_392316.jpg",
      "title": "Philip Halling / The Swan Inn, Hanley Swan",
      "caption": "The Swan Inn, Hanley Swan. The Swan Inn reflected in the pool at Hanley Swan, complete with Heron."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Footpath_to_the_trig_point_near_Hanley_Swan_-_geograph.org.uk_-_637342.jpg",
      "title": "Trevor Rickard / Footpath to the trig point near Hanley Swan",
      "caption": "Footpath to the trig point near Hanley Swan. View northwards up the small hill, but the trig point is not in view because it's part of the hedge!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Broadacres_Farm_-_Footpath_and_fields_-_geograph.org.uk_-_833642.jpg",
      "title": "Whatlep, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Broadacres Farm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/The_river_bank_at_Hanley_Castle_-_geograph.org.uk_-_395386.jpg",
      "title": "Philip Halling / The river bank at Hanley Castle",
      "caption": "The river bank at Hanley Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/The_Track_to_Tuck_Mill_-_geograph.org.uk_-_707636.jpg",
      "title": "Bob Embleton / The Track to Tuck Mill",
      "caption": "The Track to Tuck Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/The_moat_of_Hanley_Castle_-_geograph.org.uk_-_806178.jpg",
      "title": "Bob Embleton / The moat of Hanley Castle",
      "caption": "The moat of Hanley Castle. A rather sad looking sight for what was the heart of the community 8oo to 600 years ago, but no doubt, excellent for the wildlife."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Cricket_field%2C_Hanley_Castle_-_geograph.org.uk_-_809675.jpg",
      "title": "Bob Embleton / Cricket field, Hanley Castle",
      "caption": "Cricket field, Hanley Castle. The large white screens are set up at each end of the bowling line to aid the batsman to see the ball."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Oak_Tree_near_Gilbert%27s_End_Farm_-_geograph.org.uk_-_806459.jpg",
      "title": "Bob Embleton / Oak Tree near Gilbert's End Farm",
      "caption": "Oak Tree near Gilbert's End Farm"
    }
  ],
  "distance_km": 11.0,
  "description": "This Worcestershire based village is located in a pleasant rural spot in the Malvern Hills area of the county. It's an attractive place with a pretty village green, a pond, a 17th century pub and lots of country footpaths branching out for its centre. This circular walk from the village takes you to the trig point to the north before heading to the neighbouring village of Hanley Castle. Here you can see the site of the ancient castle and enjoy a view of the River Severn which runs to the east of the settlements. The walk starts in the village and first follows footpaths north to the hill and trig point above the settlement. There's some nice country trails and views to enjoy from here. You then head east and south through the countryside to visit Hanley Castle. There's the site of the old castle and moat here and the option to visit the River Severn as well. To the south of here you can head to Upton Upon Severn and pick up the long distance Severn Way if you would like to extend the walk. There's some pleasant riverside sections to enjoy here. This route heads west passing along the old dismantled railway through Brotheridge Green to Gilvers Lane. Here you turn north to follow footpaths back to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy some rest and refreshment at The Swan Inn. The historic inn dates back to the 17th century and is located in a lovely spot next to the village green. The inn serves good quality dishes and has a nice garden area to relax in on warmer days. You can find them on the Worcester Road at postcode WR8 0EA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails are ideal for dog walking and the Swan Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west towards Great Malvern and you could pick up the Malvern Hills Walk and enjoy a climb to the excellent viewpoints at Worcestershire Beacon and Herefordshire Beacon and British Camp. Malvern Common can also be explored in this area. To the east there's the splendid landscaped parkland surrounding Croome Court. The mid 18th century Neo-Palladian mansion is one of the highlights of the area and located near the worthy village of Pershore. Just to the south west you'll find Castlemorton Common. The expansive common is another popular local place for a walk with miles of trails, woodland, wildlife and great views to the Malverns."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3EElNsSclUU",
  "district": "Hanley Swan",
  "county": "Worcestershire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}