{
  "created_at": "2025-01-06T00:47:46.338780+00:00",
  "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
  "ref": "stour-valley-way-walking-route",
  "title": "Stour Valley Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/61/Caf%C3%A9_and_Land_Train%2C_Hengistbury_Head_-_geograph.org.uk_-_1444685.jpg",
  "nearby": [
    {
      "description": "Hengistbury Head",
      "objectID": "2c6884b809e93651240c9e055ca1135c",
      "ref": "hengistbury-head-walking-route"
    },
    {
      "description": "Stourhead",
      "objectID": "a0d7ddc5c07758cf0e870e6b074aabf6",
      "ref": "stourhead-walking-route"
    },
    {
      "description": "Kingston Lacy",
      "objectID": "cfe06bfc630a817ec4f816223f21c4f8",
      "ref": "kingston-lacy-walking-route"
    },
    {
      "description": "Christchurch Harbour",
      "objectID": "8752182f29690fd1df755e404b4985ba",
      "ref": "christchurch-harbour-walking-route"
    },
    {
      "description": "Longham Lakes",
      "objectID": "6bbf41642ca17a41086efbd160155f38",
      "ref": "longham-lakes-walking-route"
    },
    {
      "description": "Wimborne",
      "objectID": "f745c78a06af6691aa3792f304c90c69",
      "ref": "wimborne-walking-route"
    },
    {
      "description": "Throop Mill",
      "objectID": "8f6bfcb98dcfea291168ce3c1183c9fb",
      "ref": "throop-mill-walking-route"
    },
    {
      "description": "White Sheet Hill",
      "objectID": "2d6744f4c44b20247cac01fde202dca6",
      "ref": "white-sheet-hill-walking-route"
    },
    {
      "description": "Hambledon Hill",
      "objectID": "1c8969a67e3f43ad1c56c46ff4f8da7d",
      "ref": "hambledon-hill-walking-route"
    },
    {
      "description": "Pamphill",
      "objectID": "91d50226e4e889d410331390530c542f",
      "ref": "pamphill-walking-route"
    },
    {
      "description": "Canford Magna",
      "objectID": "5d533cf98edf5136a11a7fb14dc0a91f",
      "ref": "canford-magna-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6815ecc39ffffa3cbc2225ad8d6071ca.gpx",
  "_geoloc": {
    "lat": 50.7198640155,
    "lng": -1.7429081434
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Caf%C3%A9_and_Land_Train%2C_Hengistbury_Head_-_geograph.org.uk_-_1444685.jpg",
      "title": "Pierre Terre / Café and Land Train, Hengistbury Head, via Wikimedia Commons",
      "caption": "Café and Land Train, Hengistbury Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/River_Stour_at_Christchurch_-_geograph.org.uk_-_1761289.jpg/512px-River_Stour_at_Christchurch_-_geograph.org.uk_-_1761289.jpg",
      "title": "Andrew Mathewson / River Stour at Christchurch, via Wikimedia Commons",
      "caption": "River Stour at Christchurch"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Dudsbury_Rings_-_geograph.org.uk_-_469109.jpg",
      "title": "Mike Smith / Dudsbury Rings, via Wikimedia Commons",
      "caption": "Dudsbury Rings are the remains of an Iron Age fort. The rings are now heavily wooded. This is the view of the rings from the south side of the River Stour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Hinton_St_Mary%2C_Cutt_Mill_-_geograph.org.uk_-_39083.jpg",
      "title": "Martin Bodman / Hinton St Mary: Cutt Mill, via Wikimedia Commons",
      "caption": "Hinton St Mary: Cutt Mill. A watermill on the river Stour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Canford_Magna%2C_boathouse_-_geograph.org.uk_-_1553988.jpg",
      "title": "Mike Faherty / Canford Magna, boathouse, via Wikimedia Commons",
      "caption": "Canford Magna, boathouse. One of two boathouses on the River Stour, belonging to Canford School."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Flood_reflections_River_Stour_near_Child_Okeford_20091115.jpg/512px-Flood_reflections_River_Stour_near_Child_Okeford_20091115.jpg",
      "title": "Marilyn Peddle, North Dorset, England [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Morning clouds, reflections in the floods on the River Stour near Child Okeford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/River_Stour%2C_Blandford_Forum_-_geograph.org.uk_-_1501885.jpg",
      "title": "andrew auger / River Stour, Blandford Forum, via Wikimedia Commons",
      "caption": "River Stour, Blandford Forum"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/The_bridge_at_Stourhead_-_geograph.org.uk_-_374803.jpg",
      "title": "Graham Horn / The bridge at Stourhead, via Wikimedia Commons",
      "caption": "The bridge at Stourhead. Part of the Stourhead Estate, this bridge crosses a stream entering the Garden Lake."
    }
  ],
  "distance_km": 97.0,
  "description": "This splendid walk takes you along the River Stour from Hengistbury Head on the Dorset south coast to Stourton in Wiltshire. You begin at Hengistbury Head and head inland past Christchurch Harbour to Throop Mill where you'll pass a historic old watermill and the pretty Stour Valley Nature Reserve. You continue towards Wimborne Minster via Canford Magna and Longham Lakes. At Wimborne Minster you'll pass the beautiful Kingston Lacy with its acres of beautiful parkland and gardens. The route continues past Blandford Forum, Child Okeford, Hambledon Hill, Hod Hill and Sturminster Newton. The final section passes Gillingham before finishing at Stourton near the splendid Stourhead Estate and gardens. To extend the walk you climb to White Sheet Hill from Stourton, for fine views over the estate and the Cranborne Chase AONB.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop at The Spread Eagle Inn on the Stourhead Estate for some refreshments. The eighteenth-century inn offers lunches, snacks, evening meals, cakes, tea and coffee, as well as a great selection of wines, beers, and gins. There's also a nice outdoor seating area to relax in during the summer months. You can find the inn at Church Lawn on the estate with postcode BA12 6QE for your sat navs.Also of interest is the White Horse Inn in Stourpaine. It's a quaint pub of some note, dating back to the early 18th Century. Today, the inside provides an open-plan layout with a bar, restaurant, shop, post office, games room, wood burning stoves & an open fire. The external provides a covered outdoor decking area at the rear and a seating area out the front for warm summer days. There's also a village shop within the pub with a deli counter which sells a variety of delicious, fresh products. You can find the pub in the village at postcode DT11 8TA for your sat navs.In Blandford head to the Crown Hotel in the town centre. The Crown is reportedly the oldest inn in Dorset and has been a residence since the 10th Century. The pub/hotel is set in a redbrick Georgian property near to the interesting Blandford Town Museum. Highlights include a lounge with leather sofas and a fireplace, and a garden with a terrace seating to relax in on the warmer days. You can find it on West St at postcode DT11 7AJ. The Baker Arms in Child Okeford is another great choice. It's a quintessential Dorset pub located right in the village. The pub dates back to circa 1770 and is perfectly situated at the foot of Hambledon hill. There's a cosy log burner indoors for the winter and a nice beer garden for warm summer days. There's a very good menu and an associated cottage if you need overnight accommodation. You can find the pub at The Cross with a postcode of DT118ED for your sat navs. The Anchor Inn in the little village of Shapwick is another good option. It's a lovely pub with a good menu and some outdoor seating for fine days. You can find the pub near the river at a postcode of DT11 9LB for your sat navs. The The Buffalo Inn is located in the North Dorset town of Gillingham. They serve excellent pasta and pizzas which you can enjoy in the lovely large garden and patio area. You can find them on the western side of the town at Lydfords Lane with a postcode of SP8 4NJ for your sat navs. In pretty little Pamphill in Dorset there's the Pamphill Dairy. There's a farm shop and cafe selling a good range of meals, snacks and ice creams here. You can find them at Hillbutts with postcode BH21 4ED for you sat navs. There's also the excellent Vine Inn. The award winning pub has been managed by the same family for 120 years. It's a splendid place with a patio garden for warmer days. You can find them at postcode BH21 4EE. In Sturminster Marshall there's the Red Lion. The pub serves a fine Sunday roast which you can enjoy in the lovely garden area with views of the surrounding countryside. You can find the inn at postcode BH21 4BU for your sat navs. Near here the route also passes the National Trust's White Mill. The 18th century mill is open for informative tours on certain days."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In North Dorset's Spetisbury you will pass the Spetisbury Rings Iron Age Hill Fort. You can climb to the top of the ancient fort for some lovely views over the area. The pretty village also includes a noteworthy 15th century church."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nueG2bNItRg",
  "postcode": "BH23 4AB",
  "district": "Christchurch",
  "county": "Bournemouth, Christchurch and Poole",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Chichester Way, Mudeford, Christchurch, Bournemouth, Christchurch and Poole, England, BH23 4AB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "watermill",
    "nature reserve",
    "parkland",
    "gardens",
    "estate"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}