{
  "created_at": "2025-01-06T08:45:26.568907+00:00",
  "objectID": "682a4eb1b6690e34683c67f1323a67b1",
  "ref": "orwell-country-park-walking-route",
  "title": "Orwell Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Fallen_trees_by_the_Orwell_-_geograph.org.uk_-_662251.jpg",
  "nearby": [
    {
      "description": "Ipswich",
      "objectID": "99edbea69f3b69b1d0e224d51339ecbb",
      "ref": "ipswich-walking-route"
    },
    {
      "description": "Stour and Orwell Walk",
      "objectID": "fd6a1cb844bf80f32c77a011fee71c29",
      "ref": "stour-and-orwell-walk-walking-route"
    },
    {
      "description": "Trimley Marshes",
      "objectID": "b35ad0aafeac64a546b87e3c65adf575",
      "ref": "trimley-marshes-walking-route"
    },
    {
      "description": "Nacton Shores",
      "objectID": "06a98d5f26f108a958b789848fedd487",
      "ref": "nacton-shores-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/682a4eb1b6690e34683c67f1323a67b1.gpx",
  "_geoloc": {
    "lat": 52.03369637,
    "lng": 1.1744054726
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Fallen_trees_by_the_Orwell_-_geograph.org.uk_-_662251.jpg",
      "title": "Chris Holifield / Fallen trees by the Orwell",
      "caption": "Fallen trees by the river. Taken from the foreshore on a walk in Orwell Country Park. Orwell Bridge is pictured in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Riverside_footpath_-_geograph.org.uk_-_766909.jpg/256px-Riverside_footpath_-_geograph.org.uk_-_766909.jpg",
      "title": "Bob Jones / Riverside footpath",
      "caption": "Riverside footpath. A 'Caution' sign warns of erosion on this footpath alongside the eastern bank of the River Orwell. The field to the left is part of Pond Hall Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Bridge_Wood_4.jpg/512px-Bridge_Wood_4.jpg",
      "title": "Dudley Miles, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Bridge Wood is a Local Nature Reserve in Ipswich in Suffolk. It forms part of Orwell Country Park. In the spring you can see lots of pretty bluebells in this area of the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/%27Green_Wind%27_sculpture_-_geograph.org.uk_-_766893.jpg",
      "title": "Bob Jones / 'Green Wind' sculpture",
      "caption": "'Green Wind' sculpture. Situated on the artificial mound known as the Tump, this wind-reactive sculpture by Diane Maclean was commissioned in 2006 by Ipswich Borough Council and Bellway Homes, the developers of the nearby Ravenswood housing estate, which the Tump overlooks. The twelve stainless steel columns vary in height from between 7 and 10 metres. The 'wings' of coloured stainless steel turn in the wind. The colour is created by an oxide layer on the polished surface of the material, which reacts with daylight to create colour change. The colours change with the seasons and the varying light of day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Entrance_to_Priory_Court_-_geograph.org.uk_-_1099017.jpg",
      "title": "Oxymoron / Entrance to Priory Court",
      "caption": "Entrance to Priory Court. Near here is the site of Alnesbourne Priory. The priory was \"ruinous\" by 1514, although remains of the priory church can be found in the walls of Alnesbourne Priory Country Club and form the basis for the listing of the building as a Grade II listed building. The club is located on the eastern side of the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Entrance_to_Orwell_Country_Park_-_geograph.org.uk_-_1307849.jpg",
      "title": "Oxymoron / Entrance to Orwell Country Park",
      "caption": "Entrance to the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Orwell_Bridge_from_Pipers_Vale_-_geograph.org.uk_-_1358000.jpg",
      "title": "John Goldsmith / Orwell Bridge from Pipers Vale",
      "caption": "Orwell Bridge from Pipers Vale The Orwell Bridge carries the A14 road across the river Orwell to Felixstowe. The mud under the bridge on this side of the river is imaginatively known as Black Ooze. The photograph was taken from the Pipers Vale Country Park to the north of the bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/West_end_of_Orwell_Bridge_-_geograph.org.uk_-_1358009.jpg",
      "title": "John Goldsmith / West end of Orwell Bridge",
      "caption": "West end of Orwell Bridge. Photographed from Pipers Vale Country Park which forms the northern section of the park. There is a landing stage on this side of the river."
    }
  ],
  "distance_km": 6.5,
  "description": "Enjoy fabulous views of the River Orwell in this delightful country park in Ipswich. There are woodland walks and riverside footpaths to enjoy in over 200 acres of parkland. There's good facilities with a good sized car park where you can directly pick up the trails. The Stour and Orwell Walk also runs through the park so there is scope for continuing your walk along the river. If you head east you can visit the splendid Trimley Marshes where there is a huge variety of water loving birdlife to look out for. You could also head north along the Suffolk Coast Path and enjoy a walk around the attractive Ipswich Docks and Marinas. You'll also pass through the adjacent Landseer and Holywell Parks.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Raven is located just north of the car park in Ravenswood. They serve good quality food and also have a garden area for warmer weather. You can find them at postcode IP3 9QJ for your sat navs. A little to the east there's the village of Levington where you'll find The Ship. It's an historic pub of some note, dating all the way back to the 14th century. The pub sits in a lovely spot, overlooking the Orwell River and next to the 16th century St Peter's Church. There's a charming interior with low ceilings and original beams as well as the warmth from the log burner. There's also pictures of sailing ships on the walls to add to the nautical theme. If the weather is good there's a decent outdoor area to relax in. You can find the picturesque thatched inn on Church Lane with a postcode of IP10 0LQ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "With lovely beaches and woodland trails the park is an excellent place to bring your dog for a walk. You're very likely to bump into other owners if you visit on a fine weekend day. The Ship Inn mentioned above is also very dog friendly with treats provided for your hungry friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east from the park and you could pick up the circular Levington Walk which starts from the nearby village and visits Levington Creek and the delightful Nacton Shores. In the village there's also an historic 16th century church and a 14th century pub for refreshment. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zNCSuBTAM_U",
  "district": "Ipswich",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Raeburn Road South, Greenwich, Ipswich, Suffolk, England, IP3 0ET, United Kingdom",
  "postcode": "IP3 0ET",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "bird watching",
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}