{
  "created_at": "2025-01-06T03:48:58.021561+00:00",
  "objectID": "6845e01b7c233ac9c90abbe7119bfc64",
  "ref": "harmondsworth-moor-walking-route",
  "title": "Harmondsworth Moor Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/38/Information_board_on_Harmondsworth_Moor_-_geograph.org.uk_-_1752162.jpg",
  "nearby": [
    {
      "description": "Colne Valley Way",
      "objectID": "ef83d9fcf0c06fd142b76a312a49c598",
      "ref": "colne-valley-way-walking-route"
    },
    {
      "description": "Staines Moor",
      "objectID": "dee4fb3fbeb3261a6e6a487beb27d936",
      "ref": "staines-moor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6845e01b7c233ac9c90abbe7119bfc64.gpx",
  "_geoloc": {
    "lat": 51.4884170455,
    "lng": -0.4879002752
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Information_board_on_Harmondsworth_Moor_-_geograph.org.uk_-_1752162.jpg",
      "title": "Rod Allday / Information board on Harmondsworth Moor",
      "caption": "Information board on Harmondsworth Moor. The Moor is a reclaimed landfill site, used previously for gravel extraction. It was landscaped by British Airways, whose offices are just to the south of here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/The_Duke_of_Northumberland%27s_River_on_Harmondsworth_Moor_-_geograph.org.uk_-_1752141.jpg",
      "title": "Rod Allday / The Duke of Northumberland's River on Harmondsworth Moor",
      "caption": "The Duke of Northumberland's River. Technically not a river but a canal, constructed in the time of Henry VIII to augment the flow supplying existing mills and to facilitate the construction of new ones."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Swan_Lake%2C_Harmondsworth_Moor%2C_Middlesex_-_geograph.org.uk_-_88492.jpg",
      "title": "John Goodall / Swan Lake, Harmondsworth Moor, Middlesex",
      "caption": "Swan Lake, Harmondsworth Moor, Middlesex. The Moor is an area of parkland wedged in between the M25, M4 and A4 so does not sound like a promising location. But after you have become used to the constant hum of traffic it is really quite attractive. It was developed by British Airways and opened in 1999. At 240 acres it is the biggest area of parkland to be established in London in the last 100 years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/River_Colne_-_geograph.org.uk_-_88631.jpg",
      "title": "Ray Stanton / River Colne",
      "caption": "River Colne. One of the many rivers of this name, from the bridge in Accommodation Lane."
    }
  ],
  "distance_km": 4.0,
  "description": "This country park in Hillingdon has some nice footpaths taking you to grassland and two pretty lakes. It is the largest public park to be built in the London area in the last 100 years, having been opened in 2000. The site includes riverside paths along the Wraysbury River and the River Colne. There's also some moderate hill climbs with extensive views towards London and Windsor Castle. The park is located near to Heathrow Airport so there's good views of the planes taking off. It's a good place to visit if you've got a bit of time to kill before heading to the airport. There's parking available at the southern end of the park off Tramac Lane and Accommodation Lane. The park is also just a short walk from Harmondsworth village. Cycle Routes run from Windsor and Eton to the park as well. Just to the west of the park you can pick up the Colne Valley Way and visit Wraysbury Reservoir and the lovely Staines Moor. This large area of grassland attracts grazing horses and cattle with a variety of birdlife around several streams and reservoirs. It's a great place to extend your walking in the area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Also in Hillingdon is the popular Celandine Route. The trail runs along the River Pinn from Cowley to Pinner. It is named after the pretty Lesser Celandine flowers you can see on the walk.For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/G_S38vS8B8c",
  "postcode": "UB7 0AS",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Accommodation Lane, Harmondsworth, London Borough of Hillingdon, London, Greater London, England, UB7 0AS, United Kingdom",
  "state": "England"
}