{
  "created_at": "2025-01-06T00:24:14.140972+00:00",
  "objectID": "68485c19b5dca4b069437ad472988c2f",
  "ref": "cwmbran-walking-route",
  "title": "Cwmbran Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Five_Locks_Basin%2C_Cwmbran_-_geograph.org.uk_-_836549.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/68485c19b5dca4b069437ad472988c2f.gpx",
  "_geoloc": {
    "lat": 51.6480741594,
    "lng": -3.024289116
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Five_Locks_Basin%2C_Cwmbran_-_geograph.org.uk_-_836549.jpg",
      "title": "Eirian Evans / Five Locks Basin, Cwmbran, via Wikimedia Commons",
      "caption": "Five Locks Basin, Cwmbran The main line of the Monmouthshire Canal ends here at Five Locks Basin, Cwmbran"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Glenside_Community_Centre%2C_Cwmbran_-_geograph.org.uk_-_2380284.jpg",
      "title": "Jaggery / Glenside Community Centre, Cwmbran, via Wikimedia Commons",
      "caption": "Glenside Community Centre, Cwmbran. Viewed across the former Monmouthshire & Brecon canal, from the towpath, now part of National Cycle Route 46."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Two_Locks_Church%2C_Cwmbran_-_geograph.org.uk_-_3249492.jpg/512px-Two_Locks_Church%2C_Cwmbran_-_geograph.org.uk_-_3249492.jpg",
      "title": "Jaggery / Two Locks Church, Cwmbran, via Wikimedia Commons",
      "caption": "Two Locks Church, Cwmbran. Viewed across Two Locks Road. Two Locks Church is a non-denominational, independent, Christ-centred, Bible-based church. Located on the west bank of the disused Monmouthshire & Brecon Canal, the building was erected in 1860 as Ebenezer Baptist Chapel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/The_Square%2C_Upper_Cwmbran_-_geograph.org.uk_-_328454.jpg",
      "title": "Chris Harris / The Square, Upper Cwmbran, via Wikimedia Commons",
      "caption": "The Square, Upper Cwmbran. Built for the workers of the local coalmine in around 1820. The cottages originally occupied three sides of a square, but some have been demolished. Also shown is the local Methodist Chapel. The photo is taken from the overgrown spoil tip."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Crown_Bridge%2C_Sebastopol._Pontypool_-_geograph.org.uk_-_1577134.jpg",
      "title": "John Grayson [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Crown Bridge, Sebastopol. Pontypool Crown Bridge is numbered 48 on the Monmouthshire & Brecon canal. It was rebuilt in 1994. The Crown Inn is in the upper right of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Pontymoile_Canal_basin_-_geograph.org.uk_-_655669.jpg",
      "title": "Colin Madge / Pontymoile Canal basin, via Wikimedia Commons",
      "caption": "Pontymoile Canal basin"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/A_path_through_Pontypool_Park_3195397_b9660b63.jpg",
      "title": "Jaggery / A path through Pontypool Park, via Wikimedia Commons",
      "caption": "A path through Pontypool Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Stone_circle%2C_Pontypool_Park%2C_Pontypool_-_geograph.org.uk_-_3415107.jpg",
      "title": "Jaggery / Stone circle, Pontypool Park, Pontypool, via Wikimedia Commons",
      "caption": "Stone circle, Pontypool Park, Pontypool. Located in the north of the park, the Gorsedd stone circle was created in 1923 for the 1924 National Eisteddfod of Wales."
    }
  ],
  "distance_km": 7.2,
  "description": "Enjoy an easy walk along the Monmouthshire and Brecon Canal on this easy waterside walk in Cwmbran. The route runs from the town towards Pontypool where you have the option of catching the train back or continuing on a short way to the pretty Pontypool Park. The walk starts on the canal in Old Cwmbran and heads north along the towpath to Sebastopol. The route continues past Griffithstown before coming to the Pontymoile canal basin, a pleasant spot on the canal. Near here you can catch the train back to Cwmbran at the Pontypool and New Inn Station or return on the same paths. You could also carry on a little further west and visit Pontypool Park where there's some nice footpaths to follow around the mature trees and open meadowland in the park. The main park starts at Pontymoile Gates near New Inn and Pontymoile Basin and has footpaths leading into the Brecon Beacons National Park. Other highlights include the Italian Gardens and the Nant-y-Gollen Ponds. To continue your walking in the area head east from Pontypool to Llandegfedd Reservoir. There's a lovely, long walking trail heading around the perimeter of the beautiful lake. A few miles south west of the town you will find Cwmcarn Forest. There's miles of woodland trails to try here. Also near the woods is the lovely Ebbw Vale which you can explore on the waymarked Ebbw Valley Walk. The Sirhowy Valley Ridgeway Walk and Sirhowy Valley Country Park can also be explored in this area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the north western edge of the town you'll find Blaen Bran Reservoir. There's some nice community woodland here with a waterfall and excellent views down to the two reservoirs from the surrounding hills."
    }
  ],
  "postcode": "NP44 3LR",
  "district": "Cwmbrân",
  "county": "Torfaen - Torfaen",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}