{
  "created_at": "2025-01-06T04:44:17.845406+00:00",
  "objectID": "6864b5a39ad0e9f974daf09c3b155d05",
  "ref": "shifnal-walking-route",
  "title": "Shifnal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/62/Shops_in_Shifnal_-_geograph.org.uk_-_810557.jpg",
  "nearby": [
    {
      "description": "Severn Way",
      "objectID": "72be59b71bcbfee43d10b1521911293f",
      "ref": "severn-way-walking-route"
    },
    {
      "description": "Telford",
      "objectID": "773b8caa60b4c80640a6d16aa219b0cb",
      "ref": "telford-walking-route"
    },
    {
      "description": "Ironbridge Way",
      "objectID": "cfe0eedf53a1feba8997d3edde99c201",
      "ref": "ironbridge-way-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "The Wrekin",
      "objectID": "382172122ba35a0c58e6a5273a47bc50",
      "ref": "the-wrekin-walking-route"
    },
    {
      "description": "Coalbrookdale",
      "objectID": "211079356575fd2b01f48654b573ae02",
      "ref": "coalbrookdale-walking-route"
    },
    {
      "description": "Badger Dingle",
      "objectID": "1a8a586f146db6846a93b6757c50a82c",
      "ref": "badger-dingle-walking-route"
    },
    {
      "description": "Albrighton",
      "objectID": "9430ef819c9cfcf583a63e85842df3a7",
      "ref": "albrighton-walking-route"
    },
    {
      "description": "Wellington",
      "objectID": "1291476225fcc70c11a3a6ea160f8837",
      "ref": "wellington-walking-route"
    },
    {
      "description": "Worfield",
      "objectID": "b8c65ca3ef7faa6344b8648415fc1c62",
      "ref": "worfield-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6864b5a39ad0e9f974daf09c3b155d05.gpx",
  "_geoloc": {
    "lat": 52.6657169174,
    "lng": -2.3723894276
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Shops_in_Shifnal_-_geograph.org.uk_-_810557.jpg",
      "title": "Richard Law / Shops in Shifnal",
      "caption": "Shops in Shifnal. These are on the junction of Bradford Street and Church Street, and stand directly opposite Naughty Nell's inn. The brick gable end of the taller building proudly advertises the Globe Shoe Stores, which has long since departed from the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Lodge_Hill_View_-_geograph.org.uk_-_433239.jpg",
      "title": "Gordon Griffiths / Lodge Hill View",
      "caption": "View Looking south from near the Trig Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/George%27s_Steps%2C_Lodge_Hill_-_geograph.org.uk_-_811427.jpg/256px-George%27s_Steps%2C_Lodge_Hill_-_geograph.org.uk_-_811427.jpg",
      "title": "Richard Law / George's Steps, Lodge Hill",
      "caption": "A dog climbing George's Steps, Lodge Hill. These were built to reduce erosion on this popular footpath, and are now dedicated to the memory of the late George Wilcox, a former member of the Shifnal Pathfinders group."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Lodge_Hill%2C_Evelith%2C_Shifnal_-_geograph.org.uk_-_69320.jpg",
      "title": "Humphrey Bolton / Lodge Hill, Evelith, Shifnal",
      "caption": "Lodge Hill, Evelith, Shifnal. This is the view of the hill from the road. Sunnyside (building) can just be seen towards the left of the picture. Note the square plantation on the hill towards the right of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Lodge_Hill_to_The_Wrekin_-_geograph.org.uk_-_871616.jpg",
      "title": "Richard Law / Lodge Hill to The Wrekin",
      "caption": "Lodge Hill to The Wrekin. From the copse on the top of Lodge Hill, with the trig point hidden in the trees, you can see right over to The Wrekin about 6 or 7 miles away the other side of Telford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Coalport_China_Museum_-_Coalport_-_Shropshire_-_geograph.org.uk_-_1321470.jpg",
      "title": "Ian Slater / Coalport China Museum - Coalport - Shropshire",
      "caption": "Coalport China Museum - Coalport - Shropshire The former Coalport China Works is now the Coalport China Museum, one of the hanful of museums in the Ironbridge Gorge area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Ironbridge_-_geograph.org.uk_-_571000.jpg",
      "title": "M J Richardson / Ironbridge",
      "caption": "Ironbridge Buildings on the north bank of the River Severn, as seen from the Iron bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Ironbridge_and_Church%2C_Ironbridge%2C_Telford_-_geograph.org.uk_-_757825.jpg",
      "title": "Peter Scrimshaw / Ironbridge and Church, Ironbridge, Telford",
      "caption": "Ironbridge and Church, Ironbridge, Telford The famous iron bridge at Ironbridge near Telford with a view up to the church"
    }
  ],
  "distance_km": 14.0,
  "description": "This walk from the town heads through the countryside to visit the historic town of Ironbridge on the River Severn. On the way there's an easy climb to a pleasant viewpoint located just to the south of the town. The walk starts from train station and follows roads south through the town. You then pick up footpaths to climb to Lodge Hill. It's a small hill but there are still some nice views over the town and the surrounding countryside to the nearby Wrekin hill. You then descend Lodge Hill to pick up the Monarch's Way. Follow the waymarked trail south west and it will take you to Kemberton before coming to the river at Coalport. Here you'll pass the pretty Coalport Canal and the interesting Coalport China Museum which is well worth visiting if you have time. At Coalport you can pick up a section of the Severn Way and follow it west along the river to Ironbridge. The town takes its name from, The Iron Bridge, a 100-foot (30 m) cast iron bridge that opened in 1781. It includes The Ironbridge Gorge, formed by a glacial overflow from the long drained away Lake Lapworth, at the end of the last ice age.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Hart in Shifnal is a good choice for some post walk refreshments. The traditional pub has a good menu and selection of ales. Outside there's a beautiful garden with a view of the river and a pretty iron bridge. You can find the pub on the High Street at postcode TF11 8BH for your sat navs. They also have their own car park."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country paths and riverside trails make for a fine dog walk. The White Hart pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the end of the route you could pick up the circular Coalbrookdale and Ironbridge Gorge Walk which visits the fascinating Coalbrookdale Museum of Iron before exploring the woodland trails in the gorge. The town is close to Telford so you can easily pick up the Telford Walk. The route uses the Silkin Way and the Ironbridge Way to create a circular walk around the town on good waymarked footpaths. Also nearby is the lovely Granville Country Park where there more nice trails to try. Just a mile south of the Iron Bridge you can pay a visit to the historic Benthall Hall. This National Trust owned hall dates from the 16th century and includes some beautiful gardens. You can tour the fine house and learn all about the interesting family history which dates back to the doomsday.  To the south there's a bit of a hidden gem at Badger Dingle. There's a delightful little wood here with a brook, pools, sandstone outcrops and a rushing waterfall to admire. In nearby Albrighton there's the 12th century Norman church and the Donington and Albrighton Nature Reserve where you can look out for lots of wildlife in the village. Also in the area is the lovely Aqualate Mere. There's a pleasant waterside path to pick up at this large, scenic lake. The site is one of the area's highlights and notable as the largest natural lake in the English Midlands. Just to the west of here there's the interesting market town of Newport where you can enjoy another waterside stroll along the old Newport Canal. The Wellington Walk starts from the historic market town which lies just north west of Telford. It visits The Wrekin and The Ercall Nature Reserve where there are some striking geological features to admire. The walk start from close to the town's bus station and train station making the area accessible by public transport. The town is also well worth exploring with its historic market and the splendid Victorian house and garden at the National Trust's Sunnycroft to see. For more walks in the area see the Shropshire Hills Walks page."
    }
  ],
  "postcode": "TF11 9AP",
  "district": "Shifnal",
  "county": "Shropshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}