{
  "created_at": "2025-01-06T02:45:39.490515+00:00",
  "objectID": "68f4eda2057a9449a42bde9c4f576401",
  "ref": "tal-y-fan-walking-route",
  "title": "Tal Y Fan Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Tal_y_Fan_-_geograph.org.uk_-_909.jpg",
  "nearby": [
    {
      "description": "Conwy Mountain",
      "objectID": "09294c375986def8178d55675af193bf",
      "ref": "conwy-mountain-walking-route"
    },
    {
      "description": "North Wales Path",
      "objectID": "a4a9223258d8388fae4cf17727878867",
      "ref": "north-wales-path-walking-route"
    },
    {
      "description": "Rowen",
      "objectID": "04ceec12e020aff69ca04600194cbd49",
      "ref": "rowen-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/68f4eda2057a9449a42bde9c4f576401.gpx",
  "_geoloc": {
    "lat": 53.2298948119,
    "lng": -3.8648469459
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Tal_y_Fan_-_geograph.org.uk_-_909.jpg",
      "title": "Barry Hunter / Tal y Fan",
      "caption": "The summit of Tal y Fan, looking East"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Moorland_below_Tal_Y_Fan_-_geograph.org.uk_-_8199.jpg",
      "title": "dave roberts / Moorland below Tal Y Fan",
      "caption": "Moorland below the mountain. Geograph showing typical moorland terrain in this square. The stone structures are visible on the 1:25000 map, but not noted what they are (presumably sheepfolds)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Wild_Pony_on_Tal_Y_Fan_-_geograph.org.uk_-_199885.jpg",
      "title": "Terry Hughes / Wild Pony on Tal Y Fan",
      "caption": "Pony grazing near a rocky outcrop on the side of Tal Y Fan"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Ruined_building_2%2C_Tal_y_Fan_Quarry_-_geograph.org.uk_-_1358145.jpg",
      "title": "Jonathan Wilkins / Ruined building 2, Tal y Fan Quarry",
      "caption": "Ruined building, Tal y Fan Quarry. Another enigmatic building just to the west of the short tunnel leading from the upper part of the quarry to the older tip. There is no clue to the original function of the building. Bilberry bushes on the hillside are a remarkable, bright green."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Tal_y_Fan_quarry_-_geograph.org.uk_-_1330558.jpg/256px-Tal_y_Fan_quarry_-_geograph.org.uk_-_1330558.jpg",
      "title": "Jonathan Wilkins / Tal y Fan quarry",
      "caption": "Access to the lower level of the quarry is gained through a narrow entrance cut at floor level, but there is an exit at higher level in the form of a short tunnel, visible left of centre in this image. The slate is of extremely poor quality, and it is amazing that anybody would work so hard at such an altitude for such small reward."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Tal_y_Fan_Volcanic_Formation_-_geograph.org.uk_-_1358089.jpg",
      "title": "Jonathan Wilkins / Tal y Fan Volcanic Formation",
      "caption": "Tal y Fan Volcanic Formation - Tuff rock formation in Wales. Tumbled boulders are the remains of frost-shattered outcrops of the Ordovician Tal y Fan Volcanic Formation, which is a deposit formed by submarine, basaltic volcanic vents on the edge of the wider Snowdon volcanic district. Fine beds of ash or tuff are interspersed with much coarser debris in the form of basaltic breccia. A bed of this breccia forms the outcrop immediately above the dog in the image, where the coarser texture is clearly visible and contrasts with much smoother surfaces elsewhere."
    }
  ],
  "distance_km": 8.0,
  "description": "This walk climbs to Tal Y Fan in the Carneddau mountains of North Wales. The walk starts from the little village of Rowen, located just to the east of the mountain. From here you can follow country lanes and footpaths west towards Cae Coch. Here you turn north to follow a track up to the summit of the mountain which stands at a height of 610 metres (2,001 ft). This makes it the most northerly 2000 ft summit in Wales and also categorises it as a mountain. From here there are fabulous views to the sea, the Isle of Anglesey and the mountains of Snowdonia. It's about a 2.5 mile so roughly 5 miles there and back. The area is notable for its neolithic wonders on the mountain's lower slopes. Look out for the two ancient burial chambers and two standing stones on your walk. Nearby there's also a little hill fort and the beautiful Llangelynnin Old Church.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ty Gwyn in Rowen is a lovely place for some refreshments after your walk. The historic pub dates back to 1784 and includes a delightful riverside garden where you can enjoy a meal outside on warmer days. You can find the inn on the High Street at a postcode of LL32 8YU for your sat navs. The pubs is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The site is located just to the south of the popular seaside town of Conwy. Here you can continue your climbing at Conwy Mountain. The waymarked North Wales Path can also be picked up in this area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/XjQ5yXbNvI4",
  "county": "Conwy - Conwy",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}