{
  "created_at": "2025-01-06T03:52:23.693567+00:00",
  "objectID": "69331eda2032293b57c98f2911ae5f4b",
  "ref": "aldringham-walking-route",
  "title": "Aldringham Walks Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Aldringham_Walks_Map_-_geograph.org.uk_-_2846131.jpg/512px-Aldringham_Walks_Map_-_geograph.org.uk_-_2846131.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/69331eda2032293b57c98f2911ae5f4b.gpx",
  "_geoloc": {
    "lat": 52.1940910799,
    "lng": 1.5762070138
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Aldringham_Walks_Map_-_geograph.org.uk_-_2846131.jpg/512px-Aldringham_Walks_Map_-_geograph.org.uk_-_2846131.jpg",
      "title": "Aldringham Walks Map by Geographer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Aldringham Walks Map. The sign includes details of the flora and fauna at the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Aldringham_Village_Sign_%5E_B1122_Aldeburgh_Road_-_geograph.org.uk_-_1826117.jpg/512px-Aldringham_Village_Sign_%5E_B1122_Aldeburgh_Road_-_geograph.org.uk_-_1826117.jpg",
      "title": "Aldringham Village Sign & B1122 Aldeburgh Road by Geographer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Aldringham Village Sign. Aldringham appears in the Domesday Book of 1086 under the name \"Alrincham\". The origin of its name is uncertain, but Ekwall suggests that it likely signifies \"the village of Ealdhere's people\". Interestingly, any resemblance to Aldeburgh is coincidental or stems from assimilation. The Domesday Survey of 1086 does not mention a specific manor in Aldringham. However, it does reference two estates. One of these estates, included in the assessment of Leiston, fell within the jurisdiction of the bishop at Hoxne. It was leased by Robert Malet and comprised seven villeins and a bordar, cultivating 90 acres of land. The other estate consisted of 20 acres and half a ploughteam, also under the tenure of Robert Malet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/St._Andrew%27s_church%2C_Aldringham_-_geograph.org.uk_-_5847968.jpg/512px-St._Andrew%27s_church%2C_Aldringham_-_geograph.org.uk_-_5847968.jpg",
      "title": "St. Andrew's church, Aldringham by Christopher Hilton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St. Andrew's church, Aldringham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/The_Parrot_and_Punchbowl%2C_Aldringham_-_geograph.org.uk_-_3123472.jpg/512px-The_Parrot_and_Punchbowl%2C_Aldringham_-_geograph.org.uk_-_3123472.jpg",
      "title": "The Parrot and Punchbowl, Aldringham by Trevor Harris, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Parrot and Punchbowl. The pub in Aldringham-cum-Thorpe, believed to have been constructed around 1576, holds the distinction of being the oldest building in the parish. Originally named \"The Case is Altered,\" it underwent a renaming in 1604 under the ownership of the Kemp family. Notably, the pub was featured in \"The History of Signboards, From the Earliest Times to the Present Day,\" published in 1866 by English bibliophile and publisher John Camden Hotten, along with Dutch author Jacob Larwood. The book highlights the addition of punchbowls to pub signboards by the late seventeenth century, symbolising \"political prestige.\" Punch, favored by the Whigs, served as a form of \"party badge\" for pubs during this period. With a rich history intertwined with smuggling activities, Aldringham was a notable hub for smuggling during the 17th and 18th centuries, with the pub playing a significant role. Records show that in 1778, authorities arrested two smugglers on the premises. An account from 1892 by Leiston local Lewis Chandler, documented on the Parrot's website in 2004, sheds light on a major smuggling incident. Chandler recounted a significant arrest involving the confiscation of twelve horses, six carts, and three hundred tubs of gin. The seized alcohol was emptied outside the pub, prompting locals to create a sump hole to collect it in pails. Tragically, one individual succumbed to the effects of consuming contaminated alcohol within 24 hours."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Footpath_on_Thorpeness_Common_-_geograph.org.uk_-_5359085.jpg/512px-Footpath_on_Thorpeness_Common_-_geograph.org.uk_-_5359085.jpg",
      "title": "Footpath on Thorpeness Common by John Myers, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath on Thorpeness Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Pillbox_on_the_edge_of_Corporal%27s_Belts_-_geograph.org.uk_-_5368018.jpg/512px-Pillbox_on_the_edge_of_Corporal%27s_Belts_-_geograph.org.uk_-_5368018.jpg",
      "title": "Pillbox on the edge of Corporal's Belts by John Myers, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pillbox on the edge of Corporal's Belts"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Footpath_in_The_Walks%2C_north-west_of_Thorpeness_-_geograph.org.uk_-_4069271.jpg/512px-Footpath_in_The_Walks%2C_north-west_of_Thorpeness_-_geograph.org.uk_-_4069271.jpg",
      "title": "Footpath in The Walks, north-west of Thorpeness by David Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath in The Walks, north-west of Thorpeness"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Sandlings_Walk_and_moorland%2C_Thorpeness_-_geograph.org.uk_-_4069239.jpg/512px-Sandlings_Walk_and_moorland%2C_Thorpeness_-_geograph.org.uk_-_4069239.jpg",
      "title": "Sandlings Walk and moorland, Thorpeness by David Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sandlings Walk and moorland, Thorpeness"
    }
  ],
  "distance_km": 12.8,
  "description": "This Suffolk based village is located just south of Leiston in the Blything Hundred area of the county. This walk from the village takes you across Aldrindham Common to the coast where you can visit Sizewell and Thorpeness. On the way you will pass through an area known as the Aldringham Walks. The RSPB run conservation area includes a number of footpaths taking you to heathland, woodland and scrub. Here you can look out for a variety of wildife including nightjars, Dartford Warblers, stonechats, yellowhammers and hairstreak butterflies. You can then enjoy a stretch along the Suffolk Coast Path with some lovely views out to sea. Please scroll down for the full list of walks near and around Aldringham. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Parrot and Punchbowl is a 16th-century English pub where you can enjoy some refreshments after your walk. It is a grade II listed building associated with a history of smuggling with more details next to the photo below. Its current title is The Parrot. You can find them at postcode IP16 4PY. They are dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north is the town of Leiston where you can explore the fascinating ruins of Leiston Abbey. The English Heritage owned site dates back to the 12th century and is considered one of the historic highlights of the area."
    }
  ],
  "postcode": "IP16 4PU",
  "district": "Aldringham",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}