{
  "created_at": "2025-01-06T04:20:56.631367+00:00",
  "objectID": "69843c35e285df624ce293d4a8b38207",
  "ref": "chobham-common-walking-and-cycle-route",
  "title": "Chobham Common Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/54/Chobham_Common_-_geograph.org.uk_-_158274.jpg",
  "nearby": [
    {
      "description": "Virginia Water Lake",
      "objectID": "6f41273d61083e6275e6b369a22d312e",
      "ref": "virginia-water-lake-walking-route"
    },
    {
      "description": "Bracknell Forest Ramblers Route",
      "objectID": "1fc3ae8ed162e449851ae57b6a42d577",
      "ref": "bracknell-forest-ramblers-route-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/69843c35e285df624ce293d4a8b38207.gpx",
  "_geoloc": {
    "lat": 51.3727172942,
    "lng": -0.6043886475
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Chobham_Common_-_geograph.org.uk_-_158274.jpg",
      "title": "Martyn Davies / Chobham Common, via Wikimedia Commons",
      "caption": "Where the rugged terrain of Chobham Common gives way to the pampered lawn of Sunningdale Golf Course"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/The_Monument%2C_Chobham_Common%2C_1972_-_geograph.org.uk_-_345344.jpg/512px-The_Monument%2C_Chobham_Common%2C_1972_-_geograph.org.uk_-_345344.jpg",
      "title": "Stephen Williams / The Monument, Chobham Common, 1972, via Wikimedia Commons",
      "caption": "The Monument, Chobham Common, 1972. This is the monument on Chobham Common, commemorating Queen Victoria's troop review. It is seen from the front, facing up the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Chobham_Common_-_geograph.org.uk_-_1717917.jpg",
      "title": "Alan Hunt / Chobham Common, via Wikimedia Commons",
      "caption": "Birch, Pine and Gorse scrub encroaching on the heath. This scrub will need to be managed if the essential open nature of the heath is to be maintained."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Chobham_Common_-_geograph.org.uk_-_137444.jpg",
      "title": "Martyn Davies / Chobham Common, via Wikimedia Commons",
      "caption": "The common is split down the middle by the M3. This is the larger, southern section of the common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lake_at_Chobham_Common_-_geograph.org.uk_-_158276.jpg/256px-Lake_at_Chobham_Common_-_geograph.org.uk_-_158276.jpg",
      "title": "Martyn Davies / Lake at Chobham Common, via Wikimedia Commons",
      "caption": "Lake on the common. The lake looks beautiful this time of year, with the gorse coming into flower. Only a few hundred metres away from the monument but on the other side of the road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Chobham_Common_-_geograph.org.uk_-_1717906.jpg",
      "title": "Alan Hunt / Chobham Common, via Wikimedia Commons",
      "caption": "The Langshot Bog area of Chobham Common. This is where all the water from the high ridge of Staple Hill to the north ends up."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Chobham_Common%2C_entrance_to_Fishpond_car_park_-_geograph.org.uk_-_73384.jpg",
      "title": "Andrew Longton / Chobham Common: entrance to Fishpond car park, via Wikimedia Commons",
      "caption": "Entrance to Fishpond car park. Looking south"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Burrowhill_Green%2C_Chobham_-_geograph.org.uk_-_1024344.jpg",
      "title": "Andrew Smith / Burrowhill Green, Chobham, via Wikimedia Commons",
      "caption": "Burrowhill Green, Chobham. Looking across the green, part of Chobham's extensive common lands, from the B383 Windsor Road."
    }
  ],
  "distance_km": 5.5,
  "description": "Enjoy a circular walk or cycle around this large common in Surrey. The common covers hundreds of acres and has a series of good footpaths over grassland, lowland heath and woodland. The area is also crisscrossed with wide bridleways which are ideal for an off road cycle. Chobham Common is the largest National Nature Reserve in the south east of England. As such there is a diverse range of flora and fauna. Look out for over 100 species of bird including the rare dartford warbler, the hobby and the nightjar. In the wetland areas look out for frogs, newts, adders, grass snakes, lizards, slow worms, foxes and possibly deer. Plants and flowers include purple heather, gorse and orchids. It's a really attractive area with lots of nice stony footpaths to follow. You could easily spend a few hours strolling around looking out for wildlife. This circular walk starts at the car park on Staple Hill and follows various footpaths past Albury Bottom to Gracious Pond. You then follow woodland paths and bridleways back to the car park. If you would like to continue your walk then you could head a few miles north to the lovely Virginia Water Lake .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Hart is in a great location in Chobham village. It's in an idyllic spot, next to the village green and cricket pitch. With a nice outdoor seating area it's the perfect place to relax after your walk. The pub also has an interesting history, with the building originally dating from the 1500's. The timber frame of the property is built around a pair of shops standing at right angles to the road, and the original inn had stabling for six horses behind. You can find the pub on the High Street at a postcode of GU24 8AA. On the southern fringes of the common there's also the Red Lion. There's a good menu and another nice garden area here. You can find it in Burrowhill on 15 Red Lion Rd at postcode GU24 8RG."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The common's miles of wide tracks are great for dog walking and you will probably see plenty of other owners on your outing. They can go off the lead in most places too. The White Hart and Red Lion pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles north west and you'll find the expansive Bracknell Forest. There's excellent cycling and walking opportunities here with lots of pretty villages and a decent visitor centre with cycle hire. For more walking ideas in the area see the Surrey Walks page."
    }
  ],
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Staple Hill, Burrowhill, Chobham, Surrey Heath, Surrey, England, GU24 8TU, United Kingdom",
  "postcode": "GU24 8TU",
  "district": "Surrey Heath",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "lowland heath",
    "woodland"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}