{
  "created_at": "2025-01-06T02:20:49.460298+00:00",
  "objectID": "698b7577592089037242eca16c46f917",
  "ref": "clevedon-walking-route",
  "title": "Clevedon Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/69/Clevedon_pier_-_geograph.org.uk_-_712668.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/698b7577592089037242eca16c46f917.gpx",
  "_geoloc": {
    "lat": 51.4451060736,
    "lng": -2.8596245373
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Clevedon_pier_-_geograph.org.uk_-_712668.jpg",
      "title": "Dr Duncan Pepper / Clevedon pier",
      "caption": "Clevedon pier. The spring sunshine illuminates the recently refurbished pier, viewed from the cast iron balcony work around the pavilion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Trig_point_on_Dial_Hill_-_geograph.org.uk_-_1760263.jpg",
      "title": "Philip Halling / Trig point on Dial Hill",
      "caption": "Trig point on Dial Hill overlooking Clevedon and the Bristol Channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/The_grounds_of_Clevedon_Court_west_of_the_house%2C_Tickenham_Road%2C_Clevedon%2C_Somerset_-_geograph.org.uk_-_1033871.jpg",
      "title": "Brian Robert Marshall / The grounds of Clevedon Court west of the house, Tickenham Road, Clevedon, Somerset",
      "caption": "The grounds of Clevedon Court west of the house, Tickenham Road. This view is facing south towards Tickenham Road down a slope. The main house is to the left, out of shot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Useful_%27Folly%27_-_geograph.org.uk_-_403086.jpg",
      "title": "Donnylad / Useful 'Folly'",
      "caption": "Useful 'Folly'. The octagonal summer house on the upper terrace at Clevedon Court. At first glance there appears to be a telephone pole spoiling the view. But it is in fact a fine specimen of Trachycarpus fortunei about seven metres tall which illustrates the mildness of the climate on the edge of the Bristol Channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/The_rear_of_Clevedon_Court%2C_Tickenham_Road%2C_Clevedon%2C_Somerset_-_geograph.org.uk_-_1033910.jpg",
      "title": "Brian Robert Marshall / The rear of Clevedon Court, Tickenham Road, Clevedon, Somerset",
      "caption": "The rear of Clevedon Court. This view is from the terrace on the north side of the house at the western end of which is this summer-house. The house dates from the 14th century having been built by Sir John de Clevedon in the early years of that century. Any property that old might be expected to have been altered or extended in that time and changes were made in the 16th, 18th and 19th centuries. Listed Grade I."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Walton_in_Gordano_-_geograph.org.uk_-_1762244.jpg",
      "title": "Philip Halling / Walton in Gordano",
      "caption": "Walton in Gordano. The village of Walton in Gordano in the Gordano Valley viewed from Court Hill. The Llanwern steelworks can be seen in the distance on the other side of the Bristol Channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Margaret%27s_Bay_-_geograph.org.uk_-_712642.jpg",
      "title": "Dr Duncan Pepper / Margaret's Bay",
      "caption": "Margaret's Bay. The shoreline adjacent to the coastal path here makes a sudden transition from a steep inaccessible rocky shore to flat rocks, popular with fishermen, and giving fine views over the Margaret's Bay to the Severn bridge and Monmouthshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Clevedon_Seafront_-_geograph.org.uk_-_404084.jpg",
      "title": "Christina Burford / Clevedon Seafront",
      "caption": "Clevedon Seafront. Photographed from the pier"
    }
  ],
  "distance_km": 9.0,
  "description": "This north Somerset based town has lots of opportunities for walkers with coast, country, woodland, hill climbs and a nearby historic house to explore on foot. This circular walk from the town visits some of the local highlights including Dial Hill, the National Trust's Clevedon Court, the neighbouring village of Walton in Gordano and the Clevedon coast. The route makes use of the Gordano Round, a circular footpath running from Clevedon to Portishead. The walk starts at High Cliff, just north of the pier on the sea front. From here you can pick up the waymarked Gordano Round and follow the waymarked footpath east up to Dial Hill where there's a nice viewpoint and a trig point. You continue east to Strawberry Hill and the Swiss Valley Cave before coming to Clevedon Court. There's miles of woodland and attractive parkland surrounding the historic 14th century manor house. After exploring the grounds the route rejoins the Gordano Round and heads through the woods to Norton's Woods. Here you can pick up the Walton Drove and follow it to Walton in Gordano. From the village it is a short walk down to the coast at Pigeon House Bay and Culver Cliff. You can then follow the coast path south to St Margaret's Bay and Ladye Sands before returning to the pier in Clevedon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Moon & Sixpence is located in a great spot on the sea front, next to the Victorian pier. They have a balcony where you can enjoy fine sea views with your meal. You can find them at 15 The Beach with a postcode of BS21 7QU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and coastal paths make for a fine dog walk. The Moon and Sixpence mentioned above is also dog friendly. Dogs are not allowed on the beach in the town though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north there's the lovely Portishead Nature Reserve Walk where there's lots of wildlife to look out for. To the south you can visit Weston-Super-Mare and explore the scenic Sand Point. The circular Nailsea Walk starts from the nearby town and can be picked up around Clevedon Court. It visits the delightful Ty Sculpture Trail and the ancient Cadbury Camp. You can also visit the lovely Backwell Lake Nature Reserve at the southern edge of the town. Cycling Information: The Avon Cycleway passes through the town. The long distance circular ride explores the area around Bristol, visiting the edge of the Cotswolds and the coast around Portishead and Clevedon. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/i9F-qazn3xM",
  "postcode": "BS21 7PR",
  "district": "Clevedon",
  "county": "North Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Edgarley Court, 11, Wellington Terrace, Walton Park, Clevedon, North Somerset, England, BS21 7PR, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "coastal",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "parkland"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}