{
  "created_at": "2025-01-06T03:27:02.745180+00:00",
  "objectID": "69f155d0de56fd039f2b3816d30fa952",
  "ref": "leland-trail-walking-route",
  "title": "Leland Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/04/Alfred%27s_Tower_-_geograph.org.uk_-_286353.jpg",
  "nearby": [
    {
      "description": "Cadbury Castle",
      "objectID": "4240d95c911c09d76b51c8598e204156",
      "ref": "cadbury-castle-walking-route"
    },
    {
      "description": "Montacute House",
      "objectID": "5d68e3049a5f02b64677a91237e66d22",
      "ref": "montacute-house-walking-route"
    },
    {
      "description": "Ham Hill Country Park",
      "objectID": "a2ec85079a74bd0da7408f6741e7443b",
      "ref": "ham-hill-country-park-walking-and-cycle-route"
    },
    {
      "description": "Bruton",
      "objectID": "1f4d7426017b6c8eaed4cc094affbc8f",
      "ref": "bruton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/69f155d0de56fd039f2b3816d30fa952.gpx",
  "_geoloc": {
    "lat": 51.116063804,
    "lng": -2.3608978011
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Alfred%27s_Tower_-_geograph.org.uk_-_286353.jpg",
      "title": "Chris Heaton / Alfred's Tower",
      "caption": "Alfred's Tower Start of the Leland Trail. Constructed in 1762 to commemorate the peace with France and the succession of George III. It stands on top of the escarpment on Kingsettle Hill, and can be seen for many miles, especially from the West"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Leland_Trail_near_Queen_Camel_-_geograph.org.uk_-_289122.jpg",
      "title": "Chris Heaton / Leland Trail near Queen Camel",
      "caption": "The trail near Queen Camel. Following the trail westwards through colourful meadows towards West Camel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Leland_Trail_east_of_Redlynch_-_geograph.org.uk_-_286369.jpg",
      "title": "Chris Heaton / Leland Trail east of Redlynch",
      "caption": "Trail east of Redlynch. In fields on a long straight westerly course, that ends after the woodland ahead at the scattered hamlet of Redlynch. This is an old coach road, but little remains today"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Southern_end_of_Creech_Hill_-_geograph.org.uk_-_288316.jpg",
      "title": "Chris Heaton / Southern end of Creech Hill",
      "caption": "Southern end of Creech Hill. Following the trail from Bruton up an excellent, if somewhat overgrown track up this hill. Superb views to the east - King Alfred's Tower on the skyline"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Bridle_Path_near_Tintinhull_-_geograph.org.uk_-_1276995.jpg",
      "title": "Nigel Mykura / Bridle Path near Tintinhull",
      "caption": "Bridle Path near Tintinhull. View south along the path that runs from Windmill Farm to Cole Cross. This is Kissmedown Lane which is part of the Leland Trail and also part of Monarchs Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Beside_the_River_Yeo_-_geograph.org.uk_-_289137.jpg",
      "title": "Chris Heaton / Beside the River Yeo",
      "caption": "Beside the River Yeo. Following the trail in meadows full of flowers, beside the River Yeo just south of the airfield at Yeovilton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Old_Market_House_-_geograph.org.uk_-_289012.jpg",
      "title": "Chris Heaton / Old Market House",
      "caption": "Old Market House. Grand old building in the centre of Castle Cary."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Holy_Trinity%2C_Sutton_Montis_-_geograph.org.uk_-_289021.jpg",
      "title": "Chris Heaton / Holy Trinity, Sutton Montis",
      "caption": "Holy Trinity, Sutton Montis. Retrospective view back to the church in Sutton Montis while walking the trail. The tree covered hill to the left conceals Cadbury Castle"
    }
  ],
  "distance_km": 45.0,
  "description": "Follow in the footsteps of royal librarian John Leland during his 16th century survey of Britain's churches and priories. You start at King Alfred's Tower at the north-western edge of the Stourhead in Wiltshire and head west towards Bruton and Castle Cary Walk in Somerset. The route continues to South Cadbury where you will pass Cadbury Castle Iron Age Hill Fort before coming to the pretty village of Queen Camel. The next section takes you to Yeovilton with a short stretch along the River Yeo leading you through the village and on towards Ilchester. The path then turns south towards Montacute where you will pass the National Trust owned 16th century mansion at Montacute House and the delightful Ham Hill Country Park. The final stretch takes you on to the finish point at Ham Hill Country Park where you will find splendid views of the Mendip Hills, Blackdown Hills, Quantock Hills and Dorset Downs.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you could stop at The Spread Eagle Inn on the Stourhead Estate for some refreshments. The eighteenth-century inn offers lunches, snacks, evening meals, cakes, tea and coffee, as well as a great selection of wines, beers, and gins. There's also a nice outdoor seating area to relax in during the summer months. You can find the inn at Church Lawn on the estate with postcode BA12 6QE for your sat navs. Next to Ham Hill you'll find the excellent Prince of Wales. The pub is located right next to the hill and includes a lovely beer garden with fine views over the surrounding countryside. In the summer months there is live music in Amy’s garden, an ice cream hut, pizza oven and an outside bar. You can find the pub next to the hill with a postcode of TA14 6RW for your sat navs. In South Cadbury, near Cadbury Castle, there's the Camelot to investigate. It's very conveniently located just a short stroll from the base of the ancient hill fort. The walls of the pub are even covered with information relating to the history of the castle site. There's a good menu and a lovely garden area to relax in on warmer days. You can find it in the village on Chapel Rd, with a postcode of BA22 7EX for your sat navs. In Bruton there's the 13th century Sun Inn. They do delicious Persian food and have a large garden area. You can find them on the High Street at postcode BA10 0AH for your sat navs. In Castle Cary there's the historic George Inn. The quaint old inn dates all the way back to the 15th century. There's a charming olde worlde interior including an inglenook fireplace with an elm beam, said to date back to the 10th century. You can find them on the Market Place with a postcode of BA7 7AH for your sat navs."
    }
  ],
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Tower Road, Kilmington Common, Kilmington, Wiltshire, England, BA12 6RJ, United Kingdom",
  "postcode": "BA12 6RJ",
  "district": "Kilmington",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "country park",
    "views"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}