{
  "created_at": "2025-01-06T01:11:29.352541+00:00",
  "objectID": "6a669f457ae8421f2a1fc59b2bc217a1",
  "ref": "felixstowe-walking-route",
  "title": "Felixstowe Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/04/Beach_at_Felixstowe_-_geograph.org.uk_-_39084.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6a669f457ae8421f2a1fc59b2bc217a1.gpx",
  "_geoloc": {
    "lat": 51.9577516441,
    "lng": 1.3460203074
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Beach_at_Felixstowe_-_geograph.org.uk_-_39084.jpg",
      "title": "Nigel Freeman / Beach at Felixstowe",
      "caption": "Beach at Felixstowe. Looking towards the pier at low water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Martello_Tower%2C_Felixstowe_Ferry_-_geograph.org.uk_-_1468022.jpg",
      "title": "John Goldsmith / Martello Tower, Felixstowe Ferry",
      "caption": "Martello Tower, Felixstowe Ferry. It looks like this tower is used as a home. This scene is right at the mouth of the River Deben, and two yachts are navigating their way into the river, using the route required to avoid the sand bars and islands that form. In the background we see a container ship making its way to the other end of the town, and the docks built on the River Orwell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Felixstowe_Marshes_-_geograph.org.uk_-_711729.jpg",
      "title": "Bob Jones / Felixstowe Marshes",
      "caption": "Felixstowe Marshes. Looking across the reed-beds towards Holmhill Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Creeks_at_Felixstowe_Ferry_-_geograph.org.uk_-_977160.jpg",
      "title": "John Goldsmith / Creeks at Felixstowe Ferry",
      "caption": "Creeks at Felixstowe Ferry. Tidal creeks at the edge of the river Deben. In the background, in the next square, are visible the ex-RAF houses of RAF Bawdsey, pioneering radar and missile site. The actual Bawdsey Manor, where Watson-Watt's team worked, is just visible on the skyline in the centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Ferry_Boat_Inn%2C_Felixstowe_Ferry_-_geograph.org.uk_-_1148070.jpg",
      "title": "Colin Park / Ferry Boat Inn, Felixstowe Ferry",
      "caption": "Ferry Boat Inn, Felixstowe Ferry"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/King%27s_Fleet_-_geograph.org.uk_-_1335419.jpg",
      "title": "Tim Marchant / King's Fleet",
      "caption": "King's Fleet - so named because it was used by Edward III in 1338 to assemble his fleet before sailing to fight in France."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Island_in_Loompit_Lake_-_geograph.org.uk_-_1312403.jpg",
      "title": "Oxymoron / Island in Loompit Lake",
      "caption": "Island in Loompit Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Entrance_to_Trimley_Marshes_-_geograph.org.uk_-_282436.jpg",
      "title": "Keith Evans / Entrance to Trimley Marshes",
      "caption": "Entrance to Trimley Marshes. The entrance to Trimley Marshes with Felixstowe docks in the background."
    }
  ],
  "distance_km": 23.0,
  "description": "Flanked by two rivers and with a lovely coastline, the Suffolk town of Felixstowe is a fine place for a walk. It's an attractive place with a Victorian promenade, an old pier and some pleasant seafront gardens to explore. This circular walk explores the coast and countryside surrounding the town using a section of the Suffolk Coast Path. The route runs for about 14 miles along a flat, waymarked path. There's much to enjoy with seaside stretches, riverside footpaths and countryside trails on the way. You'll also pass marshland and nature reserves where there are some excellent bird watching opportunities. The walk starts from the pier on the seafront and heads north east along the town and beach to Felixstowe Ferry. Here you can catch the little ferry over the river to Bawdsey and follow the Suffolk Coast Path east towards Orford Ness. You head around Felixstowe Marshes next to the River Deben before turning west along the King's Fleet waterway. You continue west to the village of Trimley St Martin before coming to Loompit Lake and the Trimley Marshes Nature Reserve. The site is one of the premiere wildlife watching spots in England with a huge variety of water loving birds to look out for. The path runs through the reserve and along the River Orwell before climbing to a viewpoint at Fagbury Cliff. The final section takes you through the town before returning to the seafront where the walk finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One nice idea is to stop of at the Ferry Boat Inn at Felixstowe Ferry. It's a historic pub of some note, dating all the way back to 1465. The interior is full of character and includes low beams and a huge wood burner to keep you warm on those winter days. They do very good food and also have a nice beer garden to sit out in on warmer days. You can find the pub at a postcode of IP11 9RZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area around the town is great for dog walking though you are requested to keep them on leads in the Trimley Marshes Nature Reserve. The Ferry Boat Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Felixstowe Ferry you will pass the noteworthy Bawdsey Manor. Built in 1886, it was enlarged in 1895 as the principal residence of Sir William Cuthbert Quilter. The manor is now used for PGL holidays and courses, and has a small museum in the Radar Transmitter Block. This is where radar research took place early in World War II. The manor is located in a fine position at the mouth of the River Deben near Felixstowe Ferry. On the opposite side of the river you can pick up the Ramsholt Walk. This will take you along the eastern side of the river to Methersgate Quay. In Ramsholt there's a pretty quay, a beach and a splendid riverside pub in what is a delightful remote, unspoilt spot. Near the northern end of the walk there's also the National Trust's Sutton Hoo where you can explore a fascinating Anglo-Saxon burial site. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "postcode": "IP11 2DX",
  "district": "East Suffolk",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Felixstowe Pier Amusements, The Promenade, Old Felixstowe, Felixstowe, Walton, East Suffolk, Suffolk, England, IP11 2DX, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "coastal",
    "river",
    "marshland",
    "countryside"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserves"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}