{
  "created_at": "2025-01-06T04:49:31.028731+00:00",
  "objectID": "6b13adeb8c347d49ce46f4a1c65353a2",
  "ref": "almscliffe-crag-walking-route",
  "title": "Almscliffe Crag Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cc/North_Rigton.jpg",
  "nearby": [
    {
      "description": "Harrogate Ringway",
      "objectID": "3275bc6154901552601730d06dfaafeb",
      "ref": "harrogate-ringway-walking-route"
    },
    {
      "description": "Huby",
      "objectID": "1f820cb79156d22cbb8df423b1be762b",
      "ref": "huby-harrogate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6b13adeb8c347d49ce46f4a1c65353a2.gpx",
  "_geoloc": {
    "lat": 53.9382624589,
    "lng": -1.5760751851
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/North_Rigton.jpg",
      "title": "Chris Heaton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "North Rigton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/North_Rigton%2C_The_Church_of_St_John_The_Evangelist_-_geograph.org.uk_-_231946.jpg",
      "title": "Bill Henderson / North Rigton, The Church of St John The Evangelist, via Wikimedia Commons",
      "caption": "North Rigton, The Church of St John The Evangelist"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Almscliff_Crag_North_West_Face_-_geograph.org.uk_-_1070853.jpg",
      "title": "Elliott Simpson / Almscliff Crag North West Face, via Wikimedia Commons",
      "caption": "Almscliffe Crag North West Face. The Crag has become a favoured site for filming by Yorkshire Television. Notably, it featured in the opening credits of the ITV soap opera Emmerdale from 1998 to 2005. Additionally, the crag serves as the concluding scene for each series of The Beiderbecke Trilogy. Its earlier screen appearance includes being portrayed as the planet Obsidian in the BBC sci-fi series Blake's 7, specifically in the third episode of its third season, which aired in 1980."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Rocks_at_Almscliff_Crag_-_geograph.org.uk_-_540707.jpg",
      "title": "John Fielding / Rocks at Almscliff Crag, via Wikimedia Commons",
      "caption": "Rocks at Almscliffe Crag"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/A_rock_feature_at_Almscliff_Crag_-_geograph.org.uk_-_540705.jpg",
      "title": "John Fielding / A rock feature at Almscliff Crag, via Wikimedia Commons",
      "caption": "A rock feature at Almscliffe Crag"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/A_Yorkshire_Sunset_-_panoramio.jpg/512px-A_Yorkshire_Sunset_-_panoramio.jpg",
      "title": "Durand D'souza [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "A Yorkshire Sunset"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Sheep_near_Almscliff_Crag_-_geograph.org.uk_-_1429458.jpg/512px-Sheep_near_Almscliff_Crag_-_geograph.org.uk_-_1429458.jpg",
      "title": "Mark Anderson / Sheep near Almscliff Crag, via Wikimedia Commons",
      "caption": "Sheep near Almscliffe Crag. Looking towards Crain Syke Farm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Crag_Lane_-_geograph.org.uk_-_249500.jpg",
      "title": "Ray Woodcraft / Crag Lane, via Wikimedia Commons",
      "caption": "Crag Lane leading towards the village of North Rigton."
    }
  ],
  "distance_km": 2.5,
  "description": "This short circular walk climbs to a splendid viewpoint in North Yorkshire, near Harrogate. You can start the walk from the village of North Rigton, just to the east of the hill. The area around the village was used for scenery at the end of Yorkshire Television dramas, The Beiderbecke Affair, The Beiderbecke Tapes and The Beiderbecke Connection. From the village you can pick up footpaths heading west up to the crag. The large outcrop of Millstone Grit stands at a height of almost 700ft, offering lovely views over the surrounding Wharfe Valley countryside. You will often see rock climbers traversing one of the impressive, large rocky outcrops. If you look to the south you can get a great view of one of the architectural highlights of the area at Arthington Viaduct. The historic Grade II listed structure dates from 1845 and is (460 m) in length, with 21 semi-circular arches on high piers. After taking in the views you can descend the same way or return via Crag Lane to turn it into a circular walk. Back in the village you can reward yourself with refreshments at the very fine Square and Compass pub. To continue your walking in the area you could head north to Pannal Hall and pick up the Harrogate Ringway long distance trail. The waymarked footpath will take you on a tour of the countryside and villages surrounding the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Square & Compass in North Rigton is a nice place to go for some refreshments after your walk. They do good food and if the weather is fine you can sit outside on the terrace and enjoy views of the village. You can find the old stone pub at Rigton Hill with a postcode of LS17 0DJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The crag is a nice place to go for a dog walk and the Square & Compass pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can visit the crag by public transport by catching the train to Weeton station. The station is located about a mile to the south in the village of Huby. During Monday to Saturday daytimes, there is generally a half-hourly service southbound to Leeds and a half-hourly service northbound to Knaresborough with one train per hour onwards to York. A pleasant country lane can then be followed from Huby to the crag."
    },
    {
      "subtitle": "Visitor Reviews",
      "content": "\"Almscliffe Crag is an amazing spot for climbers and walkers alike! The gritstone formations are impressive, and the views from the top are absolutely breathtaking. Just make sure to park responsibly along the roads and follow the designated access paths.\"  \"The crag offers a fantastic range of climbing routes, suitable for all levels. It can get a bit busy on weekends, but it’s well worth it. Remember to respect the land as it’s on private property, and keep the noise down to maintain a good relationship with the local farmer.\"  \"I had a wonderful day at Almscliffe Crag! The walking paths are well marked, and the scenery is perfect for photography. Just be careful not to walk on the dry stone walls as they are easily damaged.\"  \"A great place for outdoor enthusiasts! Almscliffe Crag is not just for climbers; it’s also perfect for a leisurely walk or a picnic with family and friends. The access path is a nice touch, making it easier to get to the crag without ruining the surrounding area.\"  \"Almscliffe Crag is a hidden treasure! I loved exploring the various climbing routes and enjoying the peaceful atmosphere. Just a tip: parking can be limited, so try to arrive early to find a good spot.\""
    }
  ],
  "video_url": "https://www.youtube.com/embed/1-q1OkcKRNc?si=Y7Ar_d4abSgDYFaD",
  "district": "Huby",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brackenwell Lane, North Rigton, Huby, North Rigton, North Yorkshire, York and North Yorkshire, England, LS17 0DG, United Kingdom",
  "postcode": "LS17 0DG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "rock",
    "rural"
  ],
  "points_of_interest": [
    "viewpoint",
    "historical structure",
    "archaeological site"
  ],
  "facilities": [
    "pub/cafe",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}