{
  "created_at": "2025-01-06T03:27:40.712830+00:00",
  "objectID": "6b5af1f810646a543f2bb0bff4c78f5d",
  "ref": "eltham-walking-route",
  "title": "Eltham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Eltham_Palace-geograph-3007950.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6b5af1f810646a543f2bb0bff4c78f5d.gpx",
  "_geoloc": {
    "lat": 51.4476846525,
    "lng": 0.0480106728
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Eltham_Palace-geograph-3007950.jpg",
      "title": "Chris Downer / Eltham: Eltham Palace",
      "caption": "Eltham Palace. Completed in 1936, this grand mansion stands in beautiful gardens which make a feature of the moat. The palace was built adjoining the Great Hall of the original Eltham Palace, built in the 1470s - it is the part mainly hidden in this picture by the foliage far left"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Bridge_at_Eltham_Palace_%28geograph_6122053%29.jpg/512px-Bridge_at_Eltham_Palace_%28geograph_6122053%29.jpg",
      "title": "Oast House Archive / Bridge at Eltham Palace",
      "caption": "Bridge at Eltham Palace"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Great_Hall%2C_Eltham_Palace_-_geograph.org.uk_-_1032093.jpg",
      "title": "Rob Farrow / Great Hall, Eltham Palace",
      "caption": "Great Hall, Eltham Palace The magnificent Great Hall at Eltham Palace dates back to the 1470s when it was constructed for King Edward IV and designed by his chief mason, Thomas Jordan and his chief carpenter, Edmund Graveley. It measures 101' x 36' and is 55' tall (30.8 x 10.9 x 16.8 m) comparable to the Great Hall at Hampton Court built 50 years later and surpassed only in size by Westminster Palace Great Hall for surviving mediæval great halls."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Eltham_Palace_-_Main_Entrance_-_geograph.org.uk_-_1033526.jpg",
      "title": "Rob Farrow / Eltham Palace - Main Entrance",
      "caption": "Eltham Palace - Main Entrance. The curved columned façade seen centre image here is the grand main entrance to the Courtauld's 1930s redesigned palace at Eltham. The new 'palace' incorporated buildings dating back to the C15th, some effectively hidden within the body of the new building. Other parts, such as the Great Hall, part of which can be seen to the right in this image, retained their external appearance but were attached to the newer range."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Hall_of_Eltham_Palace_from_rose_garden-geograph-3539985-by-David-Hawgood.jpg/512px-Hall_of_Eltham_Palace_from_rose_garden-geograph-3539985-by-David-Hawgood.jpg",
      "title": "David Hawgood / Hall of Eltham Palace from rose garden",
      "caption": "Hall of Eltham Palace from rose garden. The sunken rose garden was created by Stephen and Virginia Courtauld when they owned Eltham Palace in the 1930s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Beckenham_Place_-_geograph.org.uk_-_478702.jpg",
      "title": "I M Chengappa / Beckenham Place",
      "caption": "Beckenham Place. A view of the historic house of Beckenham Place, seen from one of the fairways on the golf course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Eltham_Palace%2C_London%2C_SE9-geograph-3401215-by-David-Hallam-Jones.jpg/512px-Eltham_Palace%2C_London%2C_SE9-geograph-3401215-by-David-Hallam-Jones.jpg",
      "title": "David Hallam-Jones / Eltham Palace, London, SE9",
      "caption": "Eltham Palace, London, SE9. The footbridge, part of the retaining wall associated with this dry section of the moat with the south-westerly elevations of the 15th century Great Hall and the Courtauld extension."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Winter_in_Elmstead_Woods_%282%29_-_geograph.org.uk_-_1655287.jpg",
      "title": "Stephen Craven / Winter in Elmstead Woods (2)",
      "caption": "Winter in Elmstead Woods"
    }
  ],
  "distance_km": 13.4,
  "description": "This circular walk from Eltham uses part of the Green Chain Walk to take you to Eltham Palace, Beckenham Place Park and Elmstead Woods. The route runs for about 10 miles and includes a few small climbs on the way. The walk starts at Eltham Palace where you can pick up the Green Chain Walk in the park. The fine 1930s house is surrounded by 19 acres of award-winning gardens and a moat. The English Heritage run site also includes a medieval palace with a glorious hammer-beam roof built for Edward IV five hundred years ago. You can follow the waymarked path south from the palace and it will take you past Mottingham to Elmstead Woods. After exploring the woods the path heads west to Sundridge and Plaistow before coming to Beckenham Place Park. In the park you'll find 96 hectares (237 acres) of parkland including river trails along the Ravensbourne River, ancient woodland, a sensory garden and a Grade II listed mansion. From the park you head east, crossing the Ravensbourne River before passing through Downham. The final section runs past Catford and Grove Park where you cross the Quaggy River at Mottingham. Shortly after you pass Mottingham Farm and return to Eltham Palace where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The lovely glasshouse café at Eltham Palace is a fine place to enjoy some refreshments on the walk."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could try our Circular Walk around Bromley which visits some of the highlights of the London Borough."
    }
  ],
  "video_url": "https://www.youtube.com/embed/6XWS7a6vyYc",
  "postcode": "SE9 5QE",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Eltham Palace, Court Yard, Middle Park, Royal Borough of Greenwich, London, Greater London, England, SE9 5QE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "parkland",
    "river trails"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}