{
  "created_at": "2025-01-06T04:21:44.350547+00:00",
  "objectID": "6b7dac2b6f3263ffdd4fe874acabcd61",
  "ref": "alfreton-walking-route",
  "title": "Alfreton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/be/The_Blue_Bell%2C_Alfreton_-_geograph.org.uk_-_1373132.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6b7dac2b6f3263ffdd4fe874acabcd61.gpx",
  "_geoloc": {
    "lat": 53.0989879873,
    "lng": -1.3936132747
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/The_Blue_Bell%2C_Alfreton_-_geograph.org.uk_-_1373132.jpg",
      "title": "David Long / The Blue Bell, Alfreton",
      "caption": "The Blue Bell, Alfreton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Alfreton_Park_1_-_geograph.org.uk_-_1480197.jpg",
      "title": "Jonathan Billinger / Alfreton Park 1",
      "caption": "Alfreton Park. The cricket ground can be seen to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Swanwick_countryside_-_geograph.org.uk_-_97788.jpg",
      "title": "chris cox / Swanwick countryside",
      "caption": "Swanwick countryside. On footpath west of Swanwick near Coneygrey Farm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Bluebells_oakerthorpe.jpg/512px-Bluebells_oakerthorpe.jpg",
      "title": "Kmtextor / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Bluebells in Shaw Wood, Oakerthorpe, Derbyshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/View_from_David%27s_Hill_-_geograph.org.uk_-_726579.jpg",
      "title": "Alan Heardman / View from David's Hill",
      "caption": "View from David's Hill in Oakerthorpe. The hill is located just to the north of Shaw Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Site_of_Roman_Fortlet_-_geograph.org.uk_-_149645.jpg",
      "title": "Nikki Mahadevan / Site of Roman Fortlet",
      "caption": "Site of Roman Fortlet. The field in the foreground is actually the site of a Roman camp. This can be seen from aerial shots of the area eg. Multimap. The course of the Roman road \"Ryknild Street\" ran through the field adjacent to the east of this picture (off picture) past the buildings at Hollybank (seen to the centre right). The woods on Castle Hill can be seen at the northern boundary of the field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Oakerthorpe_Nature_Reserve_-_Footpath_and_Sign_-_geograph.org.uk_-_725083.jpg",
      "title": "Alan Heardman / Oakerthorpe Nature Reserve - Footpath and Sign",
      "caption": "Oakerthorpe Nature Reserve. Footpath and Sign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Footpath_View_-_geograph.org.uk_-_726565.jpg",
      "title": "Alan Heardman / Footpath View",
      "caption": "Footpath View. Looking across the field at the rear of Hollybank House, the white building, centre right is the Anchor Inn."
    }
  ],
  "distance_km": 9.7,
  "description": "The town of Alfreton is located in the Amber Valley district of Derbyshire. There's some nice woodland and country trails to the west of the town and a local reservoir which is great for wildlife watching. This circular walk from the town visits Alfreton Park, Shaw Wood, Pentrich village and the Oakerthorpe Nature Reserve. There's attractive parkland, peaceful woodland trails and countryside views to enjoy on the way. The walk starts on the western edge of the town where you can pick up footpaths on the northern side of Alfreton Park. These will take you west to Oakerthorpe before heading south west past the golf course to St David's Hill in Shaw Wood. In the springtime this area is covered with carpets of bluebells. The route then heads south east past the site of a Roman Fortlet to the village of Pentrich. The village includes a noteworthy Norman church with a tower dating back to the 14th century. After exploring the village the route then heads north east back through the Oakerthorpe Nature Reserve. This Local Nature Reserve has a short circular trail with a pond dipping platform provided for school groups. The pond platform is an ideal location to spot frogs, toads and common newts. Footpaths will then take you back to Alfreton Park where you can follow footpaths through the park back to the start point.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the southern end of the route around Pentrich you could take a small detour to visit the Midland Railway Centre. Here you'll find a 35 acre country park with a heritage railway and nice trails around Butterley Reservoir and Codnor Park Reservoir. Head north west from the town and you will soon come to expansive Ogston Reservoir. This large lake is located near the village of Brackenfield and is notable as one of Derbyshire's premier bird watching sites. A few miles west of the town you can pick up the Cromford Canal near Crich. You'll also find the excellent Tramway Village in this area too. This fascinating museum contains over 60 trams built between 1873 and 1982 and is set within a recreated period village containing a working pub, cafe, old-style sweetshop and tram depots.  For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "district": "Alfreton",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}