{
  "created_at": "2025-01-06T02:50:07.031948+00:00",
  "objectID": "6b8e0e8bf274c6fe34eae19394f1e251",
  "ref": "castle-carrock-reservoir-walking-route",
  "title": "Castle Carrock Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6d/The_dam%2C_Castle_Carrock_Reservoir_-_geograph.org.uk_-_1433200.jpg",
  "nearby": [
    {
      "description": "Talkin Tarn Country Park",
      "objectID": "b39251bbc7df0d78f5758a48dc8cf7bd",
      "ref": "talkin-tarn-country-park-walking-route"
    },
    {
      "description": "Gelt Woods",
      "objectID": "72e0f83c1a754e1a6eff4263f1194d93",
      "ref": "gelt-woods-walking-route"
    },
    {
      "description": "Geltsdale",
      "objectID": "2f2d4be24e03758b31719f7565ffa99d",
      "ref": "geltsdale-walking-route"
    },
    {
      "description": "Miltonrigg Woods",
      "objectID": "a64416a7950777aed96bf5f48c93738a",
      "ref": "miltonrigg-woods-walking-route"
    },
    {
      "description": "Lanercost Priory",
      "objectID": "71651358bbb55d9a5c5d948c4c2ac57b",
      "ref": "lanercost-priory-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6b8e0e8bf274c6fe34eae19394f1e251.gpx",
  "_geoloc": {
    "lat": 54.8901039444,
    "lng": -2.7122651257
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/The_dam%2C_Castle_Carrock_Reservoir_-_geograph.org.uk_-_1433200.jpg",
      "title": "Rose and Trev Clough / The dam, Castle Carrock Reservoir",
      "caption": "The dam, Castle Carrock Reservoir. This photo was taken on a guided tour to celebrate the reservoir's 100th year. The crenellated turret in the water is the valve tower; buildings to the right of the dam are part of the Castle Carrock Water Treatment Works."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Castle_Carrock_Reservoir_-_geograph.org.uk_-_1433190.jpg",
      "title": "Rose and Trev Clough / Castle Carrock Reservoir",
      "caption": "View from the dam, taken on an open day to celebrate the reservoir's centenary. It was built to provide a reliable clean water supply to Carlisle, which it did for over 50 years. Increasing demand in the city meant additional water had to be extracted from the River Eden. Today the reservoir supplies water to the area north and east of Carlisle, as far as the border with Scotland, and is a supplementary source for Carlisle and Caldbeck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Culverted_beck_alongside_Castle_Carrock_Reservoir_-_geograph.org.uk_-_1433223.jpg",
      "title": "Rose and Trev Clough / Culverted beck alongside Castle Carrock Reservoir",
      "caption": "Culverted beck alongside the reservoir. Castle Carrock is a storage reservoir - the water is piped by gravity from streams and springs in Geltsdale, 3 or 4km away. The source was chosen for its purity, but from a geological point of view the most suitable place to build a reservoir was in the valley of the Castle Carrock Beck. The beck that was originally here flowed through agricultural land, so not good for drinking water. The solution was to divert it through an underground culvert around the edge of the reservoir. This photo shows a small section which is uncovered, before the culvert goes underneath the dam. The beck comes out beside the water works, then continues as normal round the edge of Castle Carrock village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/The_valve_tower%2C_Castle_Carrock_Reservoir_-_geograph.org.uk_-_1433206.jpg",
      "title": "Rose and Trev Clough / The valve tower, Castle Carrock Reservoir",
      "caption": "The valve tower. A functional structure with Edwardian grandeur. The valve or \"draw-off\" tower houses machinery which controls the water leaving the reservoir for the treatment works. It can be drawn from various depths according to conditions in the reservoir, to get the best quality."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Castle_Carrock_Beck%2C_at_the_Waterworks_-_geograph.org.uk_-_1433233.jpg/256px-Castle_Carrock_Beck%2C_at_the_Waterworks_-_geograph.org.uk_-_1433233.jpg",
      "title": "Rose and Trev Clough / Castle Carrock Beck, at the Waterworks",
      "caption": "Castle Carrock Beck, at the Waterworks. The beck has been culverted around the east side of the reservoir. It emerges behind the dam and is channelled through the water treatment works, after which it continues naturally downstream to join the River Gelt. The grassed slope of the reservoir dam is seen in the distance, with the top of the valve tower peeping over the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Geltsdale_Road%2C_Castle_Carrock_-_geograph.org.uk_-_1437901.jpg",
      "title": "Rose and Trev Clough / Geltsdale Road, Castle Carrock",
      "caption": "Geltsdale Road, Castle Carrock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Entrance_to_St._Peter%27s_Church%2C_Castle_Carrock_-_geograph.org.uk_-_1433256.jpg",
      "title": "Rose and Trev Clough / Entrance to St. Peter's Church, Castle Carrock",
      "caption": "Entrance to St. Peter's Church, Castle Carrock village. The stone cross on the grass is a war memorial to James Hetherington and Donald Armstrong, who gave their lives for their country, 1939-1945. Note the old-style bench mark, lower left stonework of porch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Watson_Institute%2C_Castle_Carrock%2C_viewed_from_churchyard_-_geograph.org.uk_-_1437888.jpg",
      "title": "Rose and Trev Clough / Watson Institute, Castle Carrock, viewed from churchyard",
      "caption": "Watson Institute, Castle Carrock, viewed from churchyard. The bunting and marquee were part of village celebrations to mark the centenary of the reservoir being opened. A plaque above the door of the institute has a date of 1897. It was built as a public hall, free library and reading room by J.P. Watson"
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy an easy circular walk around this pretty reservoir in the Carlisle District of Cumbria. The trail runs for about 2 miles on a series of fairly flat footpaths. The walk starts from the village of Castle Carrock where you can follow footpaths south to reach the reservoir. You can then follow trails around the water and through the surrounding woodland. It's a very pretty and peaceful area with woodland birds to look out for on the way round. For a more challenging walk you could climb to the fells above the reservoir on the eastern side. The footpaths run south from the village to Nixon Head, Tottergill Farm and Roughet Hill. There are fine views over the area from this elevated path.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Duke Of Cumberland is a friendly pub located in the village. They do very good home cooked food and also have a large outdoor area for warmer days. You can find the pub at a postcode of CA8 9LU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake and woodland trails make for a lovely dog walk and the Duke of Cumberland pub in the village is also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north of the village and you can visit one of the highlights of the area at Talkin Tarn Country Park. There's a lovely waterside path around the pretty tarn and some peaceful woodland trails in the adjacent Gelt Woods. The circular Brampton Walk visits the woods and the park from the train station located just to the north east in Milton. Just a couple of miles to the north east of Brampton there's Miltonrigg Woods to explore. There's more peaceful woodland trails here with pretty bluebells in the spring and lots wildlife to see. Lanercost Priory is also located in this area. The English heritage run site was originally founded in 1169 as an Augustinian monastery. Today the substantial priory ruins are well worth a visit for the fascinating history and architecure. A few miles to the north east there's the Geltsdale Walk to try. Here you'll find a rugged RSPB nature reserve with becks, hills, old quarries, a pretty tarn and lots of wildlife to see. For more walking ideas in the area see the North Pennines Walks and Cumbria Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1EzAKIvP95o",
  "postcode": "CA8 9NB",
  "district": "Castle Carrock",
  "county": "Cumberland",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}