{
  "created_at": "2025-01-06T09:47:03.382500+00:00",
  "objectID": "6b94f2fa94f832e4f1f118afde5e457c",
  "ref": "nuneaton-rotary-walk-walking-route",
  "title": "Nuneaton Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Lakes_at_Arbury_Hall_-_geograph.org.uk_-_227262.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6b94f2fa94f832e4f1f118afde5e457c.gpx",
  "_geoloc": {
    "lat": 52.535709824,
    "lng": -1.4729168081
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Lakes_at_Arbury_Hall_-_geograph.org.uk_-_227262.jpg",
      "title": "David Stowell / Lakes at Arbury Hall",
      "caption": "Lakes at Arbury Hall. The route passes close to the hall on the south western side of Nuneaton. The hall is a Grade I listed country house and the ancestral home of the Newdigate family. The hall is built on the site of the former Arbury Priory in a mixture of Tudor and 18th-century Gothic Revival architecture. The fine hall is surrounded by 300 acre estate of parkland and gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Seeswood_Pool_-_geograph.org.uk_-_1114282.jpg",
      "title": "Mollie Burdett / Seeswood Pool",
      "caption": "Seeswood Pool, just north of Arbury Hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Hartshill_Hayes_-_geograph.org.uk_-_865748.jpg",
      "title": "Beryl Allcoat / Hartshill Hayes",
      "caption": "Hartshill Hayes Country Park. The trail passes through the park where there are fine views over the area from the high points."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Main_Street_of_Higham_on_the_Hill_-_geograph.org.uk_-_672033.jpg",
      "title": "Mat Fascione / Main Street of Higham on the Hill",
      "caption": "Main Street of Higham on the Hill. A village to the north east of Nuneaton. The Post Office is at the corner of Nuneaton Lane, the Oddfellows Arms public house is on the left of the view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Turn_Over_Bridge%2C_Coventry_Canal%2C_south_of_Nuneaton_-_geograph.org.uk_-_1137527.jpg",
      "title": "Roger Kidd / Turn Over Bridge, Coventry Canal, south of Nuneaton",
      "caption": "Turn Over Bridge, Coventry Canal, south of Nuneaton. At present this is purely a farmer's access bridge linking fields on the right with the farm on the left of the canal. There is no \"turnover\" in the sense that the towpath crosses the canal, but when the Griff Arm of the canal branched to the west about 150 metres ahead, maybe that facility was available."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Marston_Junction_-_geograph.org.uk_-_227082.jpg",
      "title": "David Stowell / Marston Junction",
      "caption": "Marston Junction. The Ashby Canal emerges from under the bridge carrying the towpath to join the Coventry Canal in the foreground."
    }
  ],
  "distance_km": 39.0,
  "description": "This super circular walk was devised by the Nuneaton Rotary Club and takes you on a tour of the countryside, parks and canals around Nuneaton. The walk begins at Weddington, by the River Anker and passes Hartshill, Higham on the Hill and Hinckley. It runs for about 24 miles on a series of fairly flat easy footpaths. The main attractions on the walk are the delightful waterside stretches along the Coventry Canal and Ashby Canal . You will also visit the beautiful Hartshill Country Park where you will find 137 acres of woodland and open hilltop with magnificent views across the Anker Valley. The next attraction near route is the splendid Arbury Estate just outside Nuneaton. Here you will find a beautiful Elizabethan mansion house surrounded by beautiful 18th century landscaped gardens and over 100 acres of lakes and parkland. This is a fairly easy walk with good access points just to the south of the route start at Nuneaton rail and bus stations.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Atherstone Walk starts from the train station in the nearby town and follows the Coventry Canal to Hartshill Park where you can pick up this trail. The Hinckley Circular Walk uses a section of the Ashby Canal and this walk to explore the area around the market town. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wt1d90UStLU",
  "postcode": "CV10 0EY",
  "district": "Nuneaton",
  "county": "Warwickshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}