{
  "created_at": "2025-01-05T23:39:35.421007+00:00",
  "objectID": "6bcdc307fdac7ac7b95968de7faaf84f",
  "ref": "lizard-point-to-kynance-cove-walking-route",
  "title": "Lizard Point to Kynance Cove Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/48/Man_of_War_and_Shag_Rock%2C_off_Lizard_Point_-_geograph.org.uk_-_1707750.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Coverack",
      "objectID": "a863ea45f5a1f90df5fc39723ae7a8cb",
      "ref": "coverack-walking-route"
    },
    {
      "description": "Mullion Cove to Lizard Point Walk",
      "objectID": "b65e159fbabd4b510e0415b128bc78ba",
      "ref": "mullion-cove-to-lizard-point-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6bcdc307fdac7ac7b95968de7faaf84f.gpx",
  "_geoloc": {
    "lat": 49.9598470117,
    "lng": -5.2070309362
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Man_of_War_and_Shag_Rock%2C_off_Lizard_Point_-_geograph.org.uk_-_1707750.jpg",
      "title": "Jim Champion / Man of War and Shag Rock, off Lizard Point",
      "caption": "Man of War and Shag Rock, off Lizard Point. Two rocks off the Point, to the west of Polpeor Cove: Shag Rock (the closer and smaller rock) and Man of War (the farther and larger rocks). Viewed over the terrace hedge at the Most Southerly Café."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Kynance_Cove_at_low_tide_-_geograph.org.uk_-_229584.jpg",
      "title": "Jim Champion / Kynance Cove at low tide",
      "caption": "Kynance Cove at low tide. A panoramic view of the cove at low tide when the beach is accessible, taken from the rocks at the southern end of the beach. On this sunny August bank holiday weekend the beach was busy, most of the visitors are at the far end of the beach nearer the cafe and steps up to the National Trust car park. The public toilets at the cove are discreetly tucked away behind the cafe, under a turf roof with a drystone wall. They have won an award for their environment-friendliness - all the waste is digested in a system beneath the lavatories and very clean effluent is discharged into the stream after being UV treated."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Lizard_lighthouse_%283824527868%29.jpg/256px-Lizard_lighthouse_%283824527868%29.jpg",
      "title": "Jim Champion from Southampton, UK, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lizard lighthouse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Lizard_RNLI_lifeboat_station%2C_Kilcobben_Cove_-_geograph.org.uk_-_229727.jpg",
      "title": "Jim Champion / Lizard RNLI lifeboat station, Kilcobben Cove",
      "caption": "Lizard RNLI lifeboat station, Kilcobben Cove, just east of the point. The RNLI lifeboat is launched from the boathouse down the slipway into the sea - and in fact had done so just a few minutes earlier. The cliff railway connects the boathouse to the crew station, although the visiting public is invited to use the steps. The lifeboat station was opened here in 1961, the location was chosen because it was sufficiently protected to allow safe launching in all conditions. The old lifeboat station around the Lizard headland at Polpeor Cove was too exposed, making launching difficult and dangerous in certain conditions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Cave_at_Kynance_Cove_-_geograph.org.uk_-_229591.jpg/256px-Cave_at_Kynance_Cove_-_geograph.org.uk_-_229591.jpg",
      "title": "Jim Champion / Cave at Kynance Cove",
      "caption": "Cave at Kynance Cove. Looking out of this cave towards the northwest, one of the headlands protruding from Kynance Cliff is visible on the right (The Rill?). This cave is actually an arch, with a tall wide opening to the NW and a much smaller exit to the SE (behind the photographer). These caves are only accessible when the tide is out!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Between_Lizard_Point_and_Kynance_Cove_-_geograph.org.uk_-_23895.jpg",
      "title": "Bob Jones / Between Lizard Point and Kynance Cove",
      "caption": "Ponies between Lizard Point and Kynance Cove. Looking north towards Pentreath Beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Polpeor_-_geograph.org.uk_-_31482.jpg",
      "title": "Tony Atkin / Polpeor",
      "caption": "Polpeor. This is the peninsula between Polbream Cove on the near side and Polpeor Cove on the far side which most tourists regard as the most southerly point on the British mainland. Lizard Point itself is about a kilometre to the west but is no further south than this. This is as good a place as any to stand and stare at the sea and there is a cafe with nice cake!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Looking_Inland_-_geograph.org.uk_-_263599.jpg",
      "title": "Tony Atkin / Looking Inland",
      "caption": "Looking Inland. Looking back from the track down to Polpeor Cove. The hut is one of several used for Serpentine turning where the local rock is carved for sale to tourists."
    }
  ],
  "distance_km": 14.0,
  "description": "This circular walk takes you from Lizard Point to Kynance Cove and then visits the Lizard National Nature Reserve and the little village of Cadgwith on the Cornish Coast. There's some truly spectacular coastal scenery with stunning coves, beautiful beaches, turquoise seas and imposing cliffs. You start off at the Lizard Point car park and head around Lizard Point, the most southerly place in Britain. It's a beautiful and unique area with interesting geological formations and a variety of flora and fauna. The walk continues north to Kynance Cove via Crane Ledges and Pentreath Beach. Kynance Cove has spectacular cliffs, stacks, arches and islands of serpentine rock while the beach is considered one the most beautiful in the world. The area is also covered with attractive heathland and a variety of rare coastal plants. From Kynance Cove you head inland across the Lizard National Nature Reserve and Lizard Downs to Cadgwith. The tiny fishing village is very picturesque with thatched cottages and a pretty stream trickling over the sand and shingle beach. At Cadgwith you pick up the coast path again to take you back to the car park. On this final section you pass interesting geological features such as Whale Rock and the Devil's Frying Pan. The latter was formed from the collapsed roof of a sea cave with a remaining arch of rock. The walk is also great for wildlife spotting. Look out for grey seals in the water and the Cornish Chough in the air. The walk can be extended by continuing along the South West Coast Path to Mullion Cove, north of Kynance Cove. The cove is another feature of this lovely section of coast with its pretty harbour and surrounding cliffs. See the Mullion Cove to Lizard Point Walk for more details.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Polpeor Cafe for some post walk refreshment. The excellent cafe is England's most southerly cafe, situated in a wonderful position on the cliff tops. Here you can sit outside on the terrace and enjoy some delicious sea food with amazing views. You can find them at postcode Polpeor with postcode TR12 7NU."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coast path makes for a bracing dog walk and the Polpeor Cafe mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east along the coast path and you could pay a visit to the delightful village of Coverack. There's a pretty harbour, a nice beach and a fine hotel where you can enjoy refreshment with a sea view from the garden. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4x5F0mjpRRk",
  "postcode": "TR12 7NT",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lighthouse Road, Landewednack, Lizard, Cornwall, England, TR12 7NT, United Kingdom",
  "district": "Lizard",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "heathland",
    "rural"
  ],
  "points_of_interest": [
    "geological formations",
    "rare coastal plants",
    "historical features",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}