{
  "created_at": "2025-01-06T03:33:40.064592+00:00",
  "objectID": "6c3517ac771254e2f26c48fce94562f0",
  "ref": "rothbury-walking-route",
  "title": "Rothbury Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/River_Coquet_at_Rothbury_-_geograph.org.uk_-_1772415.jpg/512px-River_Coquet_at_Rothbury_-_geograph.org.uk_-_1772415.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6c3517ac771254e2f26c48fce94562f0.gpx",
  "_geoloc": {
    "lat": 55.30986845,
    "lng": -1.9098965663
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/River_Coquet_at_Rothbury_-_geograph.org.uk_-_1772415.jpg/512px-River_Coquet_at_Rothbury_-_geograph.org.uk_-_1772415.jpg",
      "title": "Philip Barker [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Coquet 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/River_Coquet_-_geograph.org.uk_-_1513479.jpg",
      "title": "Graham Horn / River Coquet",
      "caption": "River Coquet 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Chester_Hope_and_the_edge_of_the_Simonside_Forest_-_geograph.org.uk_-_106961.jpg",
      "title": "Les Hull [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Chester Hope and the edge of the Simonside Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Climbing_Simonside_-_geograph.org.uk_-_872536.jpg",
      "title": "Graham Horn / Climbing Simonside",
      "caption": "Climbing Simonside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Simonside_-_geograph.org.uk_-_826134.jpg/256px-Simonside_-_geograph.org.uk_-_826134.jpg",
      "title": "Peter McDermott / Simonside",
      "caption": "Simonside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Dove_crag_-_geograph.org.uk_-_1114793.jpg",
      "title": "James Gilbert / Dove crag",
      "caption": "Dove crag"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Path_down_from_Simonside_-_geograph.org.uk_-_1412798.jpg",
      "title": "Oliver Dixon / Path down from Simonside",
      "caption": "Path down from Simonside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Garleigh_Moor_looking_north_-_geograph.org.uk_-_109801.jpg",
      "title": "C Massey / Garleigh Moor looking north",
      "caption": "Garleigh Moor looking north"
    }
  ],
  "distance_km": 12.8,
  "description": "Rothbury is located in the Northumberland National Park on the edge of the Simonside Hills. There's lovely walks through Coquetdale into the surrounding hills and the wonderful Cragside to visit. As such the town is a popular base for walkers looking to explore this scenic area. This circular walk starts in the town centre and picks up the riverside path along the River Coquet. The route then leaves the river and climbs to Newtown and Great Tosson where you enter a woodland section at Windy Crag. The path then climbs through the woods to the Simonside Hills, where you reach a height of nearly 1400ft (426m). There's fabulous views here over the town to the surrounding hills and countryside. The route then descends through Newtown Park to Rothbury Forest where you will pass an old fort and some intersting geological rock formations. The area includes Lordenshaw Hill which has the largest concentration of rock carvings in Northumberland. The carved panels range from single cup-marked boulders to more complex panels. There are many other interesting archaeological sites in this area, including a ditched Iron Age enclosure and an Early Bronze Age cairn. The final section passes Garleigh Moor before descending to Whitton and crossing the river to return to the town. On this section you'll pass the 14th century Whitton Tower which is exceptionally well-preserved.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east of Rothbury is the little village of Thropton. Here you'll find the excellent Three Wheat Heads Inn. The main advantage here is a wonderful large beer garden with wide ranging views of the surrounding countryside and hills. If the weather is fine it's the ideal spot to relax outside and enjoy a drink. The pub also has an interesting history, dating all the way back to the 18th century. They are dog friendly and do great food in the bar and the restaurant area. You can find the inn on Front Street at postcode NE65 7LR."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking in Rothbury head to Cragside Country Park on the eastern side of the town. The large estate includes miles of footpaths with peaceful woodland, a series of lakes and two waterfalls.You could also try our Simonside Hills circular walk which starts from the Rothbury Forest car park and further expores the forestry, hills and rock formations of this interesting area.Just to the south you can visit Fontburn Reservoir where there's some nice waterside trails to try.Head north and you can explore the expansive Thrunton Woods on miles of good trails. The woods sit next to the pretty village of Whittingham where you can enjoy views of the River Aln and see the noteworthy old church which dates back to the 10th century.The long distance St Oswald's Way also passes through the town. You can pick this up and head east towards the Northumberland Coast AONB."
    }
  ],
  "video_url": "https://www.youtube.com/embed/WITcfRzbRGw",
  "county": "Northumberland",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}