{
  "created_at": "2025-01-06T04:23:48.075373+00:00",
  "objectID": "6c8542117a87948384460e2ebf82d1d4",
  "ref": "bulbarrow-hill-walking-route",
  "title": "Bulbarrow Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/55/Woolland%2C_slopes_of_Bulbarrow_Hill_-_geograph.org.uk_-_1374875.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6c8542117a87948384460e2ebf82d1d4.gpx",
  "_geoloc": {
    "lat": 50.8522198747,
    "lng": -2.3093801236
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Woolland%2C_slopes_of_Bulbarrow_Hill_-_geograph.org.uk_-_1374875.jpg",
      "title": "Chris Downer / Woolland: slopes of Bulbarrow Hill",
      "caption": "Looking down from near the top of the lane south from Woolland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Billowy_slopes_of_Bulbarrow_Hill_-_geograph.org.uk_-_502845.jpg",
      "title": "Chris Downer / Billowy slopes of Bulbarrow Hill",
      "caption": "Billowy slopes of Bulbarrow Hill, one of Dorset's finest viewpoints. On its top is this Iron Age hillfort called Rawlsbury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Bulbarrow_Hill_and_Balmers_Coombe_Bottom_-_geograph.org.uk_-_57825.jpg",
      "title": "Jim Champion / Bulbarrow Hill and Balmers Coombe Bottom",
      "caption": "Bulbarrow Hill and Balmers Coombe Bottom. Looking west from the footpath to Rawlsbury Camp, this is the view of Bulbarrow Hill and its MOD radio masts which are a landmark for many miles around."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Looking_towards_Rawlsbury_Camp_from_Bulbarrow_-_geograph.org.uk_-_32694.jpg",
      "title": "Nigel Freeman / Looking towards Rawlsbury Camp from Bulbarrow",
      "caption": "Looking towards Rawlsbury Camp from Bulbarrow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Stoke_Wake%2C_looking_down_on_the_village_-_geograph.org.uk_-_1374876.jpg",
      "title": "Chris Downer / Stoke Wake: looking down on the village",
      "caption": "Stoke Wake: looking down on the village from the hill top. Here you can see the church and Manor Farm of the little village of Stoke Wake. Glorious views of the Dorset countryside are beyond on this fine summer day in 2009"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Woolland%2C_view_across_village_from_above_-_geograph.org.uk_-_1374873.jpg",
      "title": "Chris Downer / Woolland: view across village from above",
      "caption": "Woolland: view across village from above. Looking from the road south of Woolland, high above the village on the slopes of Bulbarrow Hill, we look northwest towards the buildings of Dairy House Farm (far right), with Crate Wood the prominent woodland towards the bottom-left."
    }
  ],
  "distance_km": 4.0,
  "description": "This walk explores the Dorset Downs, visiting the Iron Age hillfort at Bulbarrow Hill. The area has an interesting history and offers fine views over the Blackmore Vale. There's a car park just to the east of the hill where you can pick up the Wessex Ridgeway to take you across the hill to Rawlsbury Camp. The hill is the second highest in Dorset standing at a height of 274-metres (899 feet). The views from the summit stretch into Somerset, Wiltshire and Devon. To extend your walk you could head north east along the Wessex Ridgeway to Ibberton Hill, Okeford Hill and Blandford Forest. Continue south west and you will come to Ball Hill. Cyclists can reach the hill by following National Cycle Network route 253 from the picture postcard village of Milton Abbas or Okeford Fitzpaine.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head a little north from the hill and you will come to the pretty little village of Ibberton. Here you'll find the noteworthy Ibberton. The inn has an interesting history stretching all the way back to the 16th century. It has retained original features such as flagstone floors, beams and inglenook fireplace complete with bread oven. Outside there's two gardens with a trickling stream running through. It's a lovely spot to relax in on a fine summer day. You can find the pub on Church Lane with a postcode of DT11 0EN."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In nearby Ibberton you could visit the interesting St. Eustace Church which dates back to the 14th century. Here you can also pick up the Ibberton Millennium Path which explores the area on a waymarked path. Just to the south you can pick up the circular Milton Abbas Walk which visits the Capability Brown designed village and the historic abbey school. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zgnd3vcnXzE",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cuckoo Lane, Woolland, Dorset, England, DT11 0ER, United Kingdom",
  "postcode": "DT11 0ER",
  "district": "Woolland",
  "state": "England"
}