{
  "created_at": "2025-01-06T04:44:41.655227+00:00",
  "objectID": "6d0d01f6477b5bcb587aea1c97814016",
  "ref": "cheshire-ring-canal-walk-walking-route",
  "title": "Cheshire Ring Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Castlefield_Bridgewater_4688.JPG/512px-Castlefield_Bridgewater_4688.JPG",
  "nearby": [
    {
      "description": "Trent and Mersey Canal",
      "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
      "ref": "trent-and-mersey-canal-walking-and-cycle-route"
    },
    {
      "description": "Rochdale Canal",
      "objectID": "9e315fd68b82273b696b35909c3a558e",
      "ref": "rochdale-canal-walking-and-cycle-route"
    },
    {
      "description": "Bridgewater Way",
      "objectID": "4e287e22b0e5c22a0dde82d0204d7e91",
      "ref": "bridgewater-way-walking-route"
    },
    {
      "description": "Peak Forest Canal",
      "objectID": "58bd76853a36b9a324b3b4952d4ee4a5",
      "ref": "peak-forest-canal-walking-route"
    },
    {
      "description": "Ashton Canal",
      "objectID": "a77cd2e2cf3f910880690e05a9421609",
      "ref": "ashton-canal-walking-and-cycle-route"
    },
    {
      "description": "Macclesfield Canal",
      "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
      "ref": "macclesfield-canal-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6d0d01f6477b5bcb587aea1c97814016.gpx",
  "_geoloc": {
    "lat": 53.3921045881,
    "lng": -2.0605453765
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Castlefield_Bridgewater_4688.JPG/512px-Castlefield_Bridgewater_4688.JPG",
      "title": "Clem Rutter, Rochester, Kent. [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The Bridgewater Canal was commissioned by Francis Egerton, 3rd Duke of Bridgewater, to transport coal from his mines in Worsley to Manchester. Castlefield was the Manchester basin, and it was watered by the River Medlock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Top_Locks%2C_Marple_-_geograph.org.uk_-_717882.jpg",
      "title": "Peter Fuller / Top Locks, Marple, via Wikimedia Commons",
      "caption": "Top Locks, Marple Top Lock (lock 16) Marple is at the junction of the Macclesfield and Peak Forest Canals. The flight of 16 locks with an average drop of almost 4 metres each are some of the deepest in the country. The canal operated without locks for many years a ropeway taken goods down roughly where the canal towpath is today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Portland_Basin_-_geograph.org.uk_-_807939.jpg",
      "title": "Gerald England / Portland Basin",
      "caption": "The old canal warehouses at Portland Basin now house a Heritage Museum."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Anderton_Lift_1_-_geograph.org.uk_-_894731.jpg",
      "title": "Roger Gittins / Anderton Lift 1",
      "caption": "Anderton Boat Lift. This lift transfers boats from the lower River Weaver up to the Trent and Mersey Canal. The two caissons today are supported by hydraulic rams rather than the previous ropes and pulleys on the earlier structure. This picture shows the far caisson raised where the hydraulic ram is difficult to discern from the \"A\" frame supports. One of the many interesting facts related by the tour guide was that Messieur Citroen developed the distinct chevron gearing, the shape of which later became the symbol of cars bearing his name. It was a triumph of Victorian engineering when first constructed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/The_old_Boatyard_-_geograph.org.uk_-_1346783.jpg",
      "title": "david newton / The old Boatyard",
      "caption": "The old Boatyard Stretford. The photo was taken from the Bridgewater Canal towpath beneath Edge Lane roadbridge. The towpath is part of the Cheshire Ring Canal Walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Preston_Brook_on_the_Bridgewater_Canal_-_geograph.org.uk_-_4392244.jpg/512px-Preston_Brook_on_the_Bridgewater_Canal_-_geograph.org.uk_-_4392244.jpg",
      "title": "Preston Brook on the Bridgewater Canal by Raymond Knapman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Preston Brook on the Bridgewater Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Ashton_Canal%2C_Portland_Basin_-_geograph.org.uk_-_3304052.jpg/512px-Ashton_Canal%2C_Portland_Basin_-_geograph.org.uk_-_3304052.jpg",
      "title": "Ashton Canal, Portland Basin by John Glasby, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ashton Canal, Portland Basin"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Peak_Forest_Canal_at_Marple_-_geograph.org.uk_-_3243191.jpg",
      "title": "Peak Forest Canal at Marple by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Peak Forest Canal at Marple"
    }
  ],
  "distance_km": 158.0,
  "description": "This nice easy walk follows six historic canals through Cheshire, Greater Manchester and Staffordshire. The canal towpaths you will follow include:",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Macclesfield Canal Pubs: The Ring O' Bells is a good choice for some refreshments on the Macclesfield Canal. Located in Marple the 200 year old pub boasts a large award winning beer terrace/garden overlooking the canal. It's a great place to relax and enjoy a drink in the summer when there are weekly brass band concerts. The friendly pub is located right next to the canal at 130 Church Lane with a postcode of SK6 7AY. At Gurnett Ye Olde Kings Head is worthy of some investigation. The historic pub dates from 1695 and used to be a Smithy. It's conveniently located right next to the canal on Byrons Lane at postcode SK11 0HD.  The Puss in Boots is also right on the canal in Macclesfield itself. There's tables right next to the water and a good menu. It's at postcode SK10 1NF. The Miner's Arms is located a couple of minutes walk from the Adlington Basin and attractive Lyme View Marina. As such it makes for a good pit stop on the route. The classic old country pub does good food and has a nice large beer garden to sit out and relax in on warmer days. There's a cosy fire indoors, a good sized car park and it's also dog friendly. You can find the pub on Wood Lane North, just south east of Poynton at a postcode of SK10 4PF for your sat navs. At Portland Basin there's an excellent museum with an adjacent cafe. There's a good menu and outdoor seating where you can sit and watch the boats go by on finer days. You can even take a boat trip from here and experience the canal from a different perspective. The Portland Basin Museum is also well worth exploring if you have time. It's housed within the restored nineteenth century Ashton Canal Warehouse and combines a lively modern interior with a peaceful canal side setting. Inside you can see a series of interesting exhibitions detailing the history of Tameside's industrial heritage. One of the highlights of the Trent and Mersey Canal is the splendid Anderton Boat Lift near Northwich. The device lifts boats 50 feet from the River Weaver Navigation to the canal. This 'Cathedral of the Canals' has been listed as one of the Seven Wonders of the British Waterways and won experience of the year 2019. Here you can enjoy a boat trip along the river which uses the lift on the way. There's also a visitor centre and cafe where you can enjoy refreshments with fine views of the lift."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aCY_e5FrZg8",
  "postcode": "SK6 6BW",
  "district": "Marple",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Marple Water Point, Church Street, Marple, Stockport, Greater Manchester, England, SK6 6BW, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "canal"
  ],
  "points_of_interest": [
    "historical sites"
  ],
  "facilities": [],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}