{
  "created_at": "2025-01-06T00:01:29.285811+00:00",
  "objectID": "6d427ed206907a4b53e7d5f39d94fc93",
  "ref": "pagham-harbour-walking-route",
  "title": "Pagham Harbour Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Pagham_Harbour_-_geograph.org.uk_-_501464.jpg",
  "nearby": [
    {
      "description": "Selsey Bill",
      "objectID": "43ba71ada7adb70a737815cd15e9fa86",
      "ref": "selsey-bill-walking-route"
    },
    {
      "description": "Chichester Harbour",
      "objectID": "4533e7ff5a4e6194eb25a8f820743ee4",
      "ref": "chichester-harbour-walking-route"
    },
    {
      "description": "Chichester Canal",
      "objectID": "1e8bcd65c69dc75467ac241ecc43c213",
      "ref": "chichester-canal-walking-route"
    },
    {
      "description": "New Lipchis Way",
      "objectID": "308aa2c4709a534d0490bf1ea452e10e",
      "ref": "new-lipchis-way-walking-route"
    },
    {
      "description": "Bognor Regis",
      "objectID": "06e08979e1553d2b99d8cbc780b756aa",
      "ref": "bognor-regis-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6d427ed206907a4b53e7d5f39d94fc93.gpx",
  "_geoloc": {
    "lat": 50.7631394766,
    "lng": -0.7862696852
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Pagham_Harbour_-_geograph.org.uk_-_501464.jpg",
      "title": "Simon Carey / Pagham Harbour",
      "caption": "The northern edge of the inlet where Bremere Rife empties into the harbour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Entering_Pagham_Harbour_-_geograph.org.uk_-_765616.jpg/256px-Entering_Pagham_Harbour_-_geograph.org.uk_-_765616.jpg",
      "title": "Simon Carey / Entering Pagham Harbour",
      "caption": "Entering Pagham Harbour. The footpath follows the shingle foreshore for a short distance before heading back onto firmer land. This entrance is nicely flancked by hawthorn and gorse bushes with a view over the saltmarsh and mudflats of the harbour with the village of Pagham just viewable on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Beach%2C_Pagham_Harbour_-_geograph.org.uk_-_765613.jpg",
      "title": "Simon Carey / Beach, Pagham Harbour",
      "caption": "Beach view. Small shingle foreshore separating the gorse from the saltmarsh. The spit across the mouth of the harbour can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Pagham_Harbour_saltmarsh_-_geograph.org.uk_-_1423218.jpg",
      "title": "Leonard Harding / Pagham Harbour saltmarsh",
      "caption": "Saltmarsh. A view from Church Norton across the salt marsh of the harbour with the steeple of the Church of St. Thomas a Becket, Pagham village in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Pagham_Harbour_mouth_-_geograph.org.uk_-_1458230.jpg",
      "title": "Hugh Venables / Pagham Harbour mouth",
      "caption": "Harbour mouth. This shingle spit has extended significantly to the north-east in recent years, overlapping the spit on the north-east side of the mouth. The shingle is becoming vegetated as it stabilises."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Ferry_Pool%2C_Pagham_Harbour_-_geograph.org.uk_-_766115.jpg",
      "title": "Simon Carey / Ferry Pool, Pagham Harbour",
      "caption": "Ferry Pool. Small saline lagoon separated from the rest of the water by the building of the Selsey Tramway whose route follows the bushes at the end of the pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Pagham_Harbour_entrance_-_geograph.org.uk_-_1423248.jpg",
      "title": "Leonard Harding / Pagham Harbour entrance",
      "caption": "A view of the Harbour entrance with the town of Bognor Regis and the Butlins holiday camp in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/The_Salthouse%2C_Pagham_Harbour_-_geograph.org.uk_-_501445.jpg",
      "title": "Simon Carey / The Salthouse, Pagham Harbour",
      "caption": "The Salthouse. Restored thatched building once used for storing salt now used for tourist information. Located on the corner of Pagham harbour before the footpath heads off across Pagham Wall."
    }
  ],
  "distance_km": 10.0,
  "description": "Enjoy a walk around this lovely coastal nature reserve and look out for thousands of wading birds. The RSPB reserve is located a few miles south of Chichester, near the village of Pagham. You can park at the reserve car park, just off the Chichester Road. From here you can pick up the waterside footpaths to Sidlesham Quay and then around the site to Pagham Lagoon. There's a wide variety of habitats with salt marsh, mudflats, farmland, copses, lagoons, reed beds and shingle beaches. Look out for birds including little egrets, ringed plovers and lapwings. To extend your walking in the area you can pick up the New Lipchis Way at nearby West Wittering. The long distance path will take you along the Chichester Channel in to Chichester. Just to the south of the harbour you will find Selsey Bill. The coastal headland is the southernmost point of Sussex. Around Birdham you can also pick up the Chichester Canal and enjoy a waterside walk along the towpath. Just to the south of the harbour you will find the headland at Selsey Bill. It is the southernmost point of Sussex and has a nice beach and fish huts selling fine fresh fish.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The reserve is a lovely place for a dog walk so you'll probably see other owners on a fine day. It's best to keep them on leads because of the wildlife though. Bins are dotted around the site too. Dog water bowls are available at the RSPB visitor centre at the reserve."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Bognor Regis Walk visits the harbour from the nearby seaside resort. It's a nice way of visiting the area if you are coming by public transport as there is a train station in the town. It's about a 4 mile walk to the harbour from the town, passing along Bognor beach. The Selsey To West Wittering Walk will take you through the nearby RSPB Medmerry Nature Reserve. The reserve is another great place for cycling and walking with a wide variety of wildlife to see. For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/qNKqSeKs3kY",
  "postcode": "PO20 7NE",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}