{
  "created_at": "2025-01-06T00:22:53.829277+00:00",
  "objectID": "6d462d55f680123d16781e3f10dcbf6d",
  "ref": "clareabbey-river-walk",
  "title": "Clareabbey River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Clare_Abbey%2C_%28_Brian_Borus_Abbey_%29_20150904-DSC_6829-2.jpg/512px-Clare_Abbey%2C_%28_Brian_Borus_Abbey_%29_20150904-DSC_6829-2.jpg?20160929184308",
  "nearby": [
    {
      "description": "Lahinch Beach and Cliff Walk",
      "objectID": "253979424f208ba5b9e1ec0d4fa10b22",
      "ref": "lahinch-beach-and-cliff-walk-walking-route"
    },
    {
      "description": "Cratloe Woods",
      "objectID": "627fa9c668b89b290f080d79c1d0408f",
      "ref": "cratloe-woods-walking-route"
    },
    {
      "description": "Ennis River Fergus Walk",
      "objectID": "bceb1a5b11c7b283a70e95cae4e97631",
      "ref": "ennis-river-fergus-walk"
    },
    {
      "description": "Ballyalla Lake",
      "objectID": "298b92eae4e85f7741c1e4abcb575ae4",
      "ref": "ballyalla-lake-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6d462d55f680123d16781e3f10dcbf6d.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Clare_Abbey%2C_%28_Brian_Borus_Abbey_%29_20150904-DSC_6829-2.jpg/512px-Clare_Abbey%2C_%28_Brian_Borus_Abbey_%29_20150904-DSC_6829-2.jpg?20160929184308",
      "title": "Frank Chandler, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Brian Borus Abbey, Clare Abbey. The ruined monastery is located about a mile north of the village of Clarecastle. The abbey is one of the most historically significant monastic sites in the region. Founded in 1195 by Donal Mór O'Brien, King of Thomond, it was the first and largest Augustinian house in the county. The abbey's remains are quite extensive, featuring a church with a belfry, and two ranges of domestic buildings to the east and south, all arranged around a cloister garth. Interestingly, unlike many other monasteries, Clare Abbey lacks a west range."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Clareabbey%2C_Co_Clare_-_geograph.org.uk_-_1802584.jpg?20110314123429",
      "title": "C O'Flanagan / Clareabbey, Co Clare",
      "caption": "The church likely dates back to the late 12th century, though the tower situated between the chancel and the nave was added in the 15th century. Among the most notable architectural features are the three inserted 15th-century traceried windows. Two of these are located in the chancel, including the pointed three-light east window, which is adorned with a small carving of a human face above the hood. Additionally, an elaborate design of cusped tracery, consisting of six trefoils and a quatrefoil, was inserted above the original window in the south gable of the east range. This design is framed within a richly moulded projecting hood, adding to the site’s architectural interest. Despite its relative simplicity, Clare Abbey's tranquil setting and historical features make it a worthwhile destination for those interested in Ireland's monastic heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Western_Corridor_Railway_-_geograph.org.uk_-_1802611.jpg?20110314150654",
      "title": "C O'Flanagan / Western Corridor Railway",
      "caption": "A section of the Western Corridor railway which runs from Limerick to Galway. This section is in Clareabbey south of Ennis, Co Clare."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Pipeline_Bridge%2C_Co_Clare_-_geograph.org.uk_-_1801866.jpg?20110314143248",
      "title": "C O'Flanagan / Pipeline Bridge, Co Clare",
      "caption": "Pipeline Bridge, Co Clare"
    }
  ],
  "distance_km": 4.1,
  "description": "This walk visits a fascintaing Augustinian monastery near Ennis in County Clare. The ruined abbey is located in a lovely spot near to the River Fergus with a lovely riverside path to try. There are great views of the historic ruins and the surrounding Clare countryside to enjoy on the walk. See below for photos with more details on the interesting history and architecture of the abbey. You can continue your walking in the area by heading into nearby Ennis to pick up the Ennis River Fergus Walk in the town.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the south east you can enjoy some peaceful woodland trails around Cratloe Woods. The site includes several walking trails and cycling paths with views of Lough Gorteen. To the north of Ennis you'll find the pretty Ballyalla Lake. There's a nice lakeside walk, picnic areas and kayaks to hire in this delightful scenic spot."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HBAaWiYnvPQ?si=aR0pvsBFpWQB2TGG",
  "gazetteer_found": false
}