{
  "created_at": "2025-01-06T11:00:40.460064+00:00",
  "objectID": "6d4718dfe9b5900149c70f84c90eb03e",
  "ref": "burrs-country-park-walking-route",
  "title": "Burrs Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/98/Entrance_to_Burrs_Country_Park_-_geograph.org.uk_-_432881.jpg",
  "nearby": [
    {
      "description": "Irwell Sculpture Trail",
      "objectID": "7b491815b9290d73a8137e8a38d25ec5",
      "ref": "irwell-sculpture-trail-walking-route"
    },
    {
      "description": "Bury",
      "objectID": "f407c8f42eabe91c15e090ec32a1df9c",
      "ref": "bury-walking-route"
    },
    {
      "description": "Ramsbottom",
      "objectID": "6e2284c42d1f1ef1bc5c3bf28132b703",
      "ref": "ramsbottom-walking-route"
    },
    {
      "description": "Peel Tower",
      "objectID": "cc1ad1dce04225c45f904ca3ca1cb8d8",
      "ref": "peel-tower-walking-route"
    },
    {
      "description": "Holcombe Moor",
      "objectID": "1caaf602b60f5a08e1767d41d2856d09",
      "ref": "holcombe-moor-walking-route"
    },
    {
      "description": "Elton Reservoir",
      "objectID": "b38e7304c30c7b48933cfe0b0d6a68c2",
      "ref": "elton-reservoir-walking-route"
    },
    {
      "description": "Redisher Wood",
      "objectID": "a1a1f69c43853a321f1503c5977ed7c5",
      "ref": "redisher-wood-walking-route"
    },
    {
      "description": "Radcliffe Canal Walk",
      "objectID": "d97af80872a82e4c48cecb435504e5ff",
      "ref": "radcliffe-canal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6d4718dfe9b5900149c70f84c90eb03e.gpx",
  "_geoloc": {
    "lat": 53.6084993996,
    "lng": -2.3025391506
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Entrance_to_Burrs_Country_Park_-_geograph.org.uk_-_432881.jpg",
      "title": "Paul Anderson / Entrance to Burrs Country Park",
      "caption": "Entrance to Burrs Country Park. The approach to Burrs is via this cobbled road Bury Council acquired Burrs in 1986 and since then the site has been transformed from a derelict industrial site to a modern country park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Steam_engine%2C_Burrs_Country_Park_-_geograph.org.uk_-_1386119.jpg",
      "title": "Chris Allen / Steam engine, Burrs Country Park",
      "caption": "Steam engine in the park. Diagonal twin cylinder engine of the type used in the textile finishing trades. This one is by Whitehead and Poole of Radcliffe and is typical of the breed. It has been nicely painted and is on display without any interpretation whatsoever. Hopefully that will be remedied."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Burrs_Country_Park_-_geograph.org.uk_-_391999.jpg",
      "title": "Paul Anderson / Burrs Country Park",
      "caption": "This was Burrs Country Park with people enjoying the Spring sunshine on Easter Saturday 2007. The Caravan & Camping Club operate a caravan site adjacent to the park which can be seen in the back ground. The site is open from the 17th March to the 6th of November."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Brown_Cow_Burrs_Country_Park_-_geograph.org.uk_-_388014.jpg",
      "title": "Paul Anderson / Brown Cow Burrs Country Park",
      "caption": "The Brown Cow. In 1752 a farmhouse was built on the north side of the river Irwell at Burrs. Today the original farmhouse is still in existence and is now the Brown Cow public house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/River_Irwell%2C_Burrs_Country_Park_-_geograph.org.uk_-_135133.jpg",
      "title": "Gillian Rimington / River Irwell, Burrs Country Park",
      "caption": "River Irwell running through the park. Looking NW from just above the weir. Holcombe Hill in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Burrs_Activity_Centre_-_geograph.org.uk_-_140499.jpg",
      "title": "Dennis Turner / Burrs Activity Centre",
      "caption": "Burrs Activity Centre. Here you can try outdoor activities including kayaking, climbing and raft building"
    }
  ],
  "distance_km": 3.0,
  "description": "This walk takes you around the pretty Burrs Country Park, situated on the River Irwell just north of Bury. Habitats in the park include woodland, open space, wetland, ponds and waterways. You can follow a circular walking trail along the river before heading through Walmersley on the other side of the park. It's about a 2 mile walk so should take under an hour. There's good facilites too with a car park, a visitor centre and a cafe. The Irwell Sculpture Trail runs through the park so you could continue your walk along the River Irwell. If you head north you will soon come into Ramsbottom where you can enjoy a climb to Peel Tower on Holcombe Moor. On the way you'll also pass the attractive Summerseat where there's an impressive six arched viaduct, historic old mills and a heritage railway station on the East Lancs railway. Heading south will take you along the river into Bury .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Brown Cow pub is conveniently located within the park. They do good food and have an outdoor seating area with views of the park. The Eagle and Child in Ramsbottom is another pub worthy of some investigation. It was named Great British Pub Awards ‘Pub of the Year’ in September 2017 and has a whole host of other awards to its name. It's a pub with a social conscience targeting young people who are marginalised and need extra help such as young offenders and disabled young people. They're rated as one of the best food pubs in Greater Manchester, having consistently featured in all the main national newspapers ‘Top 50 Sunday Lunch’ features. One of the main attractions is a stunning Orangery dining room, with fine views across the Irwell valley to Holcombe. The expansive garden area includes an outdoor kitchen and bar, polytunnel, veg beds, compost beds, fruit shrubs and ornamental beds and a mini orchard with chickens. It's a lovely setting and the ideal place to round off your walk. You can find the pub in the town on Whalley Rd with a postcode of BL0 0DL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a popular place for dog walkers so you'll probably see plenty of other pets with their owners on your visit. The Brown Cow pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south along the river from the park and you can enjoy more waterside trails around the pretty Elton Reservoir in Bury. Just south of Ramsbottom there's the worthy Redisher Wood to explore. In the woods there are peaceful woodland trails and water features including the Holcombe Brook, a picturesque lake and photogenic waterfalls. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BxxyWqKu8Q8",
  "postcode": "BL8 1BU",
  "district": "Bury",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}