{
  "created_at": "2025-01-06T03:45:36.958131+00:00",
  "objectID": "6d4fa37957b847b47bbb687230c1416e",
  "ref": "alresford-walking-route",
  "title": "Alresford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b7/New_Alresford_-_geograph.org.uk_-_1327364.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6d4fa37957b847b47bbb687230c1416e.gpx",
  "_geoloc": {
    "lat": 51.0879480209,
    "lng": -1.1589447388
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/New_Alresford_-_geograph.org.uk_-_1327364.jpg",
      "title": "Stephen McKay / New Alresford",
      "caption": "New Alresford. The heart of this small Hampshire town, where Broad Street meets East Street and West Street, on a gloriously sunny bank holiday Sunday."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Tichborne_Down%2C_east_of_New_Alresford_-_geograph.org.uk_-_146268.jpg",
      "title": "Peter Jordan / Tichborne Down, east of New Alresford",
      "caption": "Tichborne Down, east of New Alresford. The fields of Tichborne Down lie just to the east of New Alresford. Here we're looking north west. Behind the trees is Sun Lane which runs more or less along the grid boundary."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Wayfarer%27s_Walk_descends_towards_Alresford_Golf_Course_-_geograph.org.uk_-_329330.jpg",
      "title": "Peter Facey / Wayfarer's Walk descends towards Alresford Golf Course",
      "caption": "Wayfarer's Walk descends towards Alresford Golf Course"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Wayfarer%27s_Walk_approaching_Cheriton_Mill_-_geograph.org.uk_-_329472.jpg",
      "title": "Peter Facey / Wayfarer's Walk approaching Cheriton Mill",
      "caption": "Wayfarer's Walk approaching Cheriton Mill. There are bee hives on the land to right of the water, and honey for sale from the house at left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/King%27s_Way_near_Tichborne_-_geograph.org.uk_-_949661.jpg",
      "title": "Pierre Terre / King's Way near Tichborne",
      "caption": "King's Way near Tichborne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/River_Itchen_near_the_Bush_Inn%2C_Ovington_-_geograph.org.uk_-_211520.jpg",
      "title": "Nigel Freeman / River Itchen near the Bush Inn, Ovington",
      "caption": "River Itchen near the Bush Inn, Ovington. A popular walk to spot the trout and swans!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/The_Itchen_Valley_-_geograph.org.uk_-_949718.jpg",
      "title": "Pierre Terre / The Itchen Valley",
      "caption": "The Itchen Valley A view across the Itchen Valley from the Itchen Way above Ovington. In the distance on the left is Manor Farm Itchen Stoke SU5632. Peeping between the tall trees on the right is the tower of Old Alresford church SU5833."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Alresford_Fulling_Mill_-_geograph.org.uk_-_94237.jpg",
      "title": "Graham Clutton / Alresford Fulling Mill",
      "caption": "Alresford Fulling Mill. This 13th Century mill is over the river Arle. It was used for fulling - a process for tightening and shrinking cloth to get a closely woven material. It is now a private house."
    }
  ],
  "distance_km": 13.5,
  "description": "This attractive Hampshire based town has some lovely walks along the two rivers which flow through the area. There's also some lovely Hampshire countryside and woodland to explore around the town. This route from the town makes use of the Wayfarer's Walk and the Kings Way to create a circular walk around the town. The walk starts just to the east of the train station where you can pick up the Wayfarer's Walk and follow the waymarked path south to Tichborne Down. You continue south east past the Alresford golf course to the River Itchen, just north of Cheriton. Here you can see the noteworthy 13th century church, some picturesque thatched cottages and the site of the Battle of Cheriton which took place as part of the English Civil War in 1544. You could also take a detour here and head south to visit the splendid Hinton Ampner where you'll find the source of the Itchen and some attractive parkland. This walk heads north west to the villages of Tichborne and Ovington where you cross the river to reach Itchen Stoke. From here you head north along a country lane towards Folly Hill where you can pick up the Oxdrove Way and the Wayfarer's Walk. Follow the trails south east to the northern tip of Alresford where you can pick up riverside paths along the River Alre. These will take you east and then south to return to the town centre and train station area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The noteworthy Globe is a good choice for some post walk refreshments. The historic pub dates from the 15th century and includes a garden and terrace on the banks of a small lake. It's a lovely place to relax with a drink on warmer days. You can find the pub at The Soke with a postcode of SO24 9DB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine walk with your dog. The Globe mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking in the area you could pick up the waymarked Itchen Way and follow it west to visit the neighbouring village of Itchen Abbas. It's a very picturesque riverside village with the option of visiting the nearby Avington Park on the southern side of the water. There's a lovely lake, peaceful woodland and a herd of Highland Cattle to see here. The village is also notable for providing the inspiration for the setting of Charles Kinglsey's novel The Water Babies. The author was a regular visitor to the area. The Itchen Way is coincident with the St James' Way, a pilgrimage route which will take you to Southampton or Reading Abbey. If you continue west and then south along the path you will soon come to Winchester where you could try the Winchester Circular Walk and the Winchester River Walk. Here you can visit the lovely riverside Winnal Moors Nature Reserve where there are excellent wildlife watching opportunities. You can also climb to St Catherine's Hill for some fine views over the surrounding area. For more walking ideas in the area see the South Downs Walks and the Hampshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Tsbm1aA_oUs",
  "district": "Winchester",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sun Lane, The Soke, New Alresford, Winchester, Hampshire, England, SO24 9NP, United Kingdom",
  "postcode": "SO24 9NP",
  "state": "England"
}