{
  "objectID": "6d7640b8fe8eb1824cbbcd7e702ab8f0",
  "created_at": "2024-12-19T07:47:40.435816+00:00",
  "ref": "newcastle-walking-route",
  "title": "Walks in Newcastle upon Tyne Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Tyne_Bridge_%28geograph_3522843%29.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/041EC45E76CF9B298625857F002E1461/$FILE/Newcastle.gpx",
  "_geoloc": {
    "lat": 54.9677429699,
    "lng": -1.6080267578
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Tyne_Bridge_%28geograph_3522843%29.jpg",
      "title": "Richard Webb / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Tyne Bridge. Route Start"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/A_view_from_Millennium_bridge_over_the_river_Tyne_at_Newcastle-upon-Tyne.jpg",
      "title": "Flickr user: A view from Millenium bridge over the river Tyne at Newcastle-upon-Tyne   https://www.flickr.com/photos/22794650@N04/ / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The Tyne, A view from Millenium bridge over the river Tyne at Newcastle-upon-Tyne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tyne_Riverside_Country_Park_-_geograph.org.uk_-_1362753.jpg",
      "title": "Anthony Foster / Tyne Riverside Country Park",
      "caption": "The Tyne Riverside Country Park is situated over two sites - at Prudhoe and at Newburn. This is the Newburn site looking east towards the village and the site of the Battle of Newburn Ford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Hadrian%27s_Wall%2C_Heddon-on-the_Wall_-_geograph.org.uk_-_82724.jpg/256px-Hadrian%27s_Wall%2C_Heddon-on-the_Wall_-_geograph.org.uk_-_82724.jpg",
      "title": "Alan Fearon / Hadrian's Wall, Heddon-on-the Wall",
      "caption": "Hadrian's Wall, Heddon on the Wall 1. A remarkable survival after 2000 years of plundering the Wall for building in this area. The two ditches associated with the Wall can just be made out: The Wall Ditch in front (to the left) and the Vallum behind (to the right). Part of the foundations of a turret an be seen in the middle of the photograph. The view is to the east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Hadrian%27s_Wall%2C_Heddon_on_the_Wall_-_geograph.org.uk_-_1736629.jpg/256px-Hadrian%27s_Wall%2C_Heddon_on_the_Wall_-_geograph.org.uk_-_1736629.jpg",
      "title": "Andrew Curtis / Hadrian's Wall, Heddon on the Wall",
      "caption": "Hadrian's Wall, Heddon on the Wall 2. The wall ditch is on the right (north side), now shallow, beyond the level berm next to the wall. Excavations elsewhere suggest that this area may have had its own layer of defences such as sharpened stakes,at least where they were needed for defence. The outer courses of often triangular-shaped stones were in-filled with more random shaped and sized stones, possibly a more accurate restoration than seen elsewhere along the Roman Wall. The vallum can be seen in the field to the left (south side). Why does this short section of the wall have such a pronounced bend (just behind)? Whatever the reason, it did help this small section survive the road building that destroyed many miles of the structure west from Newcastle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Vindobala_Roman_Fort%2C_Rudchester_-_geograph.org.uk_-_2465993.jpg/512px-Vindobala_Roman_Fort%2C_Rudchester_-_geograph.org.uk_-_2465993.jpg",
      "title": "Andrew Curtis / Vindobala Roman Fort, Rudchester",
      "caption": "Vindobala Roman Fort, Rudchester. View of the information board at the site next to Hadrian's Wall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Location_of_the_Giant%27s_Grave%2C_Rudchester_-_geograph.org.uk_-_2464918.jpg/512px-Location_of_the_Giant%27s_Grave%2C_Rudchester_-_geograph.org.uk_-_2464918.jpg",
      "title": "Andrew Curtis / Location of the Giant's Grave, Rudchester",
      "caption": "Location of the Giant's Grave, Rudchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Rudchester_Farm_-_geograph.org.uk_-_1028043.jpg",
      "title": "Oliver Dixon / Rudchester Farm",
      "caption": "Rudchester Farm Seen from Hadrians Wall National Trail. As the \"-chester\" suffix implies, of Roman origin; Vindobala Roman Fort on Hadrian's Wall lies only a short distance away. Additional note: In fact the slightly raised grassy area on the left side of the picture is probably part of the fort site."
    }
  ],
  "distance_km": 24.5,
  "description": "Newcastle upon Tyne is the most populous city in the North East of England. There's lots of good options for walkers with riverside walks along the Tyne and Derwent Rivers plus a number of country parks and woodland areas to explore. This walk from the city centre takes you along the epic Hadrian's Wall Path to a historic Roman Fort on the wall. On the way there's riverside paths along the River Tyne and a visit to the Tyne Riverside Country Park . The walk starts on the Newcastle side of the impressive Tyne Bridge which links with Gateshead on the opposite side. The bridge was officially opened on 10 October 1928 by King George V and has since become a defining symbol of Tyneside. From here you can pick up the Hadrian's Wall Path and follow the waymarked trail west along the river. You'll pass several old bridges and the areas of Elswick, South Benwell, Scotswood and Newburn before coming to the Tyne Riverside Country Park in Ryton. After exploring the park you continue west to Clara Vale where the trail leaves the river to head north to Heddon-on-the-Wall via Ashbank Wood. Here you join the wall itself and follow it west to the Vindobala Roman Fort at Rudchester. The fort guards the valley of the March Burn to the west, an ancient route leading to the south towards the Tyne ford at Newburn. The name Vindobala means “White Strength” with the troops recruited from a coastal tribe of Lower Germany. At the site there's an information board which will tell you all about the history of the area. After exploring the fort you retrace your steps to the river where you head west to Wylam . Here you can catch a direct train back to Newcastle.",
  "district": "Newcastle upon Tyne",
  "region": "North East",
  "country": "England"
}