{
  "objectID": "6d78e5f2959862941a5fbdff592af7bf",
  "created_at": "2024-12-18T11:46:58.590850+00:00",
  "ref": "shoreham-to-eynsford-walk-walking-route",
  "title": "Shoreham to Eynsford Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/90/The_River_Darent_north_of_Shoreham_-_geograph.org.uk_-_1732095.jpg",
  "nearby": [
    {
      "description": "Lullingstone Country Park",
      "objectID": "e6b6a8d13f2e950a0c32b21fba6e720c",
      "ref": "lullingstone-country-park-walking-route"
    },
    {
      "description": "Farningham Woods",
      "objectID": "8334604406864eee773de1befddd7d30",
      "ref": "farningham-woods-walking-route"
    },
    {
      "description": "Darenth Country Park",
      "objectID": "ca76f114f4bbdd665ca806615ad878bf",
      "ref": "darenth-country-park-walking-and-cycle-route"
    },
    {
      "description": "Eynsford Circular Walk",
      "objectID": "4f653741948827d8c80ebe8a1a99b1a5",
      "ref": "eynsford-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6d78e5f2959862941a5fbdff592af7bf.gpx",
  "_geoloc": {
    "lat": 51.3337619679,
    "lng": 0.1815383283
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/The_River_Darent_north_of_Shoreham_-_geograph.org.uk_-_1732095.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The River Darent north of Shoreham. The Darent Valley Path is 19 miles (31 km) long, following the River Darent from Sevenoaks station through the Kent Downs Area of Outstanding Natural Beauty to the banks of the River Thames at Dartford. The River Darent flows from its source in the Greensand hills, south of Westerham, to join the Thames, north of Dartford. The walk is through a varied landscape of riverside fringed with ancient willows, hop gardens and cornfields, secretive woodlands, downland carpeted with wild flowers and expanses of marshland and has the added attractions of Roman remains, majestic viaducts, historic houses, old mills and picturesque villages with beautiful churches. There is an alternative start point at Chipstead"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Stile_on_the_Darent_Valley_Path_north_of_Shoreham_-_geograph.org.uk_-_1732113.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stile on the Darent Valley Path north of Shoreham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/The_River_Darent_from_the_Darent_Valley_Path%2C_Lullingstone_Country_Park_-_geograph.org.uk_-_1735279.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The River Darent from the Darent Valley Path, Lullingstone Country Park. The large park is internationally important for its collection of ancient trees, with over 300 veteran oak, beech, ash, hornbeam and sweet chestnut, some of which are thought to be 800 years old. There are also areas of chalk grassland that fill with spectacular displays of orchids and other wild flowers in spring and summer. The visitor centre on site offers excellent facilities including a café, toilets and shop. It has a comprehensive range of information about the park's landscape, wildlife and heritage. For those wishing to venture into the wider countryside, an excellent guide is available for a 6.5 mile circular walk from the visitor centre, passing through the nearby village of Shoreham. At Lullingstone a fully equipped education centre enables groups of all ages, from primary schools to adult art and conservation groups, to learn about all aspects of the countryside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/The_Gatehouse%2C_Lullingstone_Castle%2C_Lullingstone_Country_Park_-_geograph.org.uk_-_1734754.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Gatehouse, Lullingstone Castle, Lullingstone Country Park. Lullingstone Castle is one of England\u0092s oldest family estates, dating back to the time of Domesday. The present Manor House and Gate house were built in 1497 and have been home to the same family ever since. Both Henry VIII and Queen Anne are known to have been regular visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/River_Darent_entering_Lullingstone_Lake%2C_Lullingstone_Country_Park_-_geograph.org.uk_-_1734714.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Darent entering Lullingstone Lake, Lullingstone Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Ride_in_Lullingstone_Country_Park_-_geograph.org.uk_-_1355413.jpg",
      "title": "David Anstiss / Ride in Lullingstone Country Park, via Wikimedia Commons",
      "caption": "Ride in Lullingstone Country Park This park used to be a deer park and the woods are called Upper Beech Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/The_flooded_ford_at_Eynsford_%28geograph_5736359%29.jpg/512px-The_flooded_ford_at_Eynsford_%28geograph_5736359%29.jpg",
      "title": "Marathon / The flooded ford at Eynsford, via Wikimedia Commons",
      "caption": "The flooded ford at Eynsford. The River Darent rises on the northern side of the Greensand Ridge, to the south of Westerham, and reaches the Thames at Dartford Creek. The ford across the Darent at Eynsford is possibly the most photographed scene in Kent. On this day, after a particularly wet winter, the river was flowing with considerable force. At the ford the water was two feet deep and nobody was foolhardy enough to try driving through it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Eynsford_-_geograph.org.uk_-_609079.jpg",
      "title": "Richard Croft / Eynsford, via Wikimedia Commons",
      "caption": "Eynsford Ford, bridge and St.Martin's church - the heart of Eynsford"
    }
  ],
  "distance_km": 6.0,
  "description": "This walk follows a lovely section of the Darent Valley Path from Shoreham to Eynsford in Kent. There's nice riverside trails, countryside views and a visit to Lullingstone Country Park. The route runs for a distance of about 4 miles on largely flat paths. The walk starts on the bridge over the River Darent in the small Kent village of Shoreham. From here you can pick up the Darent Valley Path, a waymarked footpath which runs from Sevenoaks to Dartford along the river. Follow the footpath north past the weirs and you will soon come to the splendid Lullingstone Country Park. The 460 acre park includes a large collection of ancient trees and the 15th Century Lullingstone Castle. There's miles of good footpaths to try if you want to take a detour from the route and explore the woods to the west of the river. This route passes the castle and continues past Hulberry Farm and the Lullingstone Roman Villa. Constructed in the 1st century, perhaps around A. D. 80-90, the occupants were wealthy Romans or native Britons who had adopted Roman customs. Shortly after passing the village you come into Eynsford. You will pass the picturesque ford over the river, and the hump-back bridge alongside. There are also many other old buildings including the 16th-century Plough Inn and the Old Mill to see in the pleasant village. To extend your walk you could continue north along the path to Farningham Woods and Darenth Country Park .",
  "postcode": "TN14 7SE",
  "district": "Shoreham",
  "county": "Kent",
  "region": "South East",
  "country": "England"
}