{
  "created_at": "2025-01-06T04:40:05.171828+00:00",
  "objectID": "6dd8ab0a13909f06d7880026446d9afe",
  "ref": "loughborough-canal-walk-walking-route",
  "title": "Loughborough Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Grand_Union_Canal_in_Loughborough_-_geograph.org.uk_-_553132.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6dd8ab0a13909f06d7880026446d9afe.gpx",
  "_geoloc": {
    "lat": 52.7719702712,
    "lng": -1.1924254324
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Grand_Union_Canal_in_Loughborough_-_geograph.org.uk_-_553132.jpg",
      "title": "Mat Fascione [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Canal in Loughborough 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Grand_Union_Canal_in_Loughborough_-_geograph.org.uk_-_553071.jpg",
      "title": "Mat Fascione [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Canal in Loughborough 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Watermead_Country_Park%2C_Leicester_-_geograph.org.uk_-_473502.jpg",
      "title": "Mat Fascione [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Watermead Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Grand_Union_Canal%2C_Leicester_-_geograph.org.uk_-_585398.jpg",
      "title": "Stephen McKay [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Canal in Leicester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Loughborough_the_Soar_-_geograph.org.uk_-_1296195.jpg",
      "title": "Andy Jamieson / Loughborough the Soar",
      "caption": "The River Soar"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/The_Three_Nuns%2C_Churchgate%2C_Loughborough_-_geograph.org.uk_-_695343.jpg",
      "title": "Tim Heaton / The Three Nuns, Churchgate, Loughborough",
      "caption": "The Three Nuns, Churchgate. With the Parish Church of All Saints and Holy Trinity behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Loughborough_Big_Meadow_-_geograph.org.uk_-_422808.jpg",
      "title": "Alan Murray-Rust / Loughborough Big Meadow",
      "caption": "Loughborough Big Meadow (SSSI). This is one of the few remaining so-called 'Lammas Meadows' left in England. These were generally flood-meadows (here it is the River Soar) which remained as open fields. Strips would be allocated to farmers who would be entitled to the hay crop, harvested around Lammas tide. In the case of the Loughborough Meadow, this was subsequently grazed. Strip owners had the right to graze a number of cattle proportional to the size of their strip holding, the meadow remaining unfenced. The Meadow is now a SSSI, managed by the Leicestershire and Rutland Wildlife Trust, still using the traditional farming methods. An idea of the variety of meadowland flowers can be seen in this picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Loughborough_Viaduct_-_geograph.org.uk_-_422815.jpg",
      "title": "Alan Murray-Rust / Loughborough Viaduct",
      "caption": "Loughborough Viaduct - just to the north of the town. The viaduct carried the Great Central Railway over the river Soar on a gradient of 1 in 176 (30 feet per mile). An unusual feature is the use of skew arches in the middle of the structure where it crosses the river itself. The extra arches were doubtless put in to ensure additional room for the river in flood times, as the railway is carried on an embankment on both sides of the viaduct. In the foreground is part of Loughborough Big Meadow, a so-called 'Lammas Meadow' on which ancient farming practices are still observed."
    }
  ],
  "distance_km": 22.0,
  "description": "A waterside walk from Loughborough to Leicester along a section of the Grand Union Canal and the River Soar. It's about a 13 mile route, so it's possible to do in a day. At the end of the walk you can get the train directly back to Loughborough from Leicester. The walk starts on the canal just to the east of the train station. You can access the towpath from Moor Lane Bridge and then follow it south east towards the village of Barrow upon Soar. The route continues through the lovely Soar Valley to Mountsorrel and Syston, where you pass through Watermead Country Park. It's a real highlight on the route with 12 lakes, wildflower meadows, woodland, grassland and reedbeds. Look out for a whole host of wildlife on this section of the walk. The final section takes you through Birstall and Belgrave, before finishing at Abbey Park in Leicester. It's a lovely finish to the walk with the attractive park including formal gardens, a sensory garden, a boating lake, a model boat lake, a miniature railway and pretty bridge over the River Soar.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Barrow Upon Soar you could make a pit stop at The Navigation Inn which is located in a great spot right next to the canal. On warm days you can sit outside and enjoy a lovely view over the water. You can find them at 87 Mill Ln, LE12 8LQ. The pub is dog friendly if you have your canine friend with you. In Mountsorrel there's the Waterside Inn. The inn is located in a fine spot next to the Mountsorrel Lock on the River Soar. You can sit outside in the lovely garden and enjoy a meal with a view over the water. The pub can be found at Sileby Rd with postcode LE12 7BB for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north of the town you could visit Loughborough Big Meadow and the impressive viaduct which spans the River Soar near the town. Just to the west there's the interesting town of Shepshed. Here you'll find a picturesque old watermill and a fine old thatched pub. You can also visit the nearby Blackbrook Reservoir, Grace Dieu Priory and the historic Mount St Bernard Abbey from the town. The circular Charnwood Forest Walk explores the countryside and village of the area.  Just to the south there's the worthy village of Woodhouse Eaves. From here you can enjoy a walk along the Leicestershire Round to several local walking highlights including Swithland Reservoir, Cropston Reservoir, Bradgate Country Park and Beacon Hill Country Park. Just to the south of Bradgate Park you'll find the secluded Groby Pool. The small lake is a good place for wildlife watching and also includes some adjacent bluebell woods. The woodland trust's Martinshaw Wood is located about half a mile south west from here too. It's another peaceful local place for bird watching and easy trails. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/19V9gfQwcks",
  "county": "Leicestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Little Moor Lane, Loughborough, Charnwood, Leicestershire, England, LE11 1RS, United Kingdom",
  "postcode": "LE11 1RS",
  "district": "Charnwood",
  "state": "England"
}