{
  "created_at": "2025-01-06T00:05:23.910811+00:00",
  "objectID": "6e4d638c8d2c362527aaa9686601e958",
  "ref": "holmes-chapel-walking-route",
  "title": "Holmes Chapel Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Holmes_Chapel%2C_church_tower_-_geograph.org.uk_-_1469096.jpg/256px-Holmes_Chapel%2C_church_tower_-_geograph.org.uk_-_1469096.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6e4d638c8d2c362527aaa9686601e958.gpx",
  "_geoloc": {
    "lat": 53.2065576448,
    "lng": -2.3647553274
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Holmes_Chapel%2C_church_tower_-_geograph.org.uk_-_1469096.jpg/256px-Holmes_Chapel%2C_church_tower_-_geograph.org.uk_-_1469096.jpg",
      "title": "Mike Faherty / Holmes Chapel, church tower",
      "caption": "Holmes Chapel, church tower. Looking up London Road towards the tower of St. Luke's Parish Church, at the junction with Knutsford Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Bridge_over_the_River_Dane_-_geograph.org.uk_-_1289702.jpg",
      "title": "Dave Dunford / Bridge over the River Dane",
      "caption": "Bridge over the River Dane. A stone plaque on the downstream side of the bridge reads \"Tho. Hall Ironmaster 1707\". The walk from Twemlow Viaduct along the Dane is very pleasant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/The_Twemlow_Viaduct_1_-_geograph.org.uk_-_1083009.jpg",
      "title": "Jonathan Billinger / The Twemlow Viaduct 1",
      "caption": "The Twemlow Viaduct 1. An impressive structure with 23 arches spanning the shallow Dane valley to the west of Holmes Chapel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Dane_Valley_Way_-_geograph.org.uk_-_1446685.jpg",
      "title": "Stephen Burton / Dane Valley Way",
      "caption": "Dane Valley Way. Five bar gate on the Dane Valley footpath. The Dane Valley Way runs from Buxton to Middlewich, a distance of approximately 40 miles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Lavender_and_Sunflower_Meadow%2C_Swettenham_Arms.jpg/512px-Lavender_and_Sunflower_Meadow%2C_Swettenham_Arms.jpg",
      "title": "Photograph by Mike Peel (www.mikepeel.net)., CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Lavender and Sunflower Meadow, Swettenham Arms"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Dane_valley_-_geograph.org.uk_-_1289568.jpg",
      "title": "Dave Dunford / Dane valley",
      "caption": "Dane valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Looking_towards_the_meadow_across_the_lake_-_geograph.org.uk_-_1738426.jpg/512px-Looking_towards_the_meadow_across_the_lake_-_geograph.org.uk_-_1738426.jpg",
      "title": "Jonathan Kington / Looking towards the meadow across the lake",
      "caption": "Looking towards the meadow across the lake at Brereton Heath. This view across the lake on Brereton Heath Country Park was taken from near the visitor centre and looks over towards the meadow area. Taken on a lovely day in early March, there was just a very slight breeze to disturb the water surface. The lake itself is man-made and was created after a silica sand quarry closed down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Cottages_in_Holmes_Chapel_-_geograph.org.uk_-_1287252.jpg",
      "title": "Trevor Harris / Cottages in Holmes Chapel",
      "caption": "Cottages in Holmes Chapel"
    }
  ],
  "distance_km": 8.8,
  "description": "This Cheshire based village has some nice riverside trails and a local country park to visit. This walk takes you along the Dane Valley Way to the nearby Swettenham Meadows Nature Reserve and the Brereton Heath Local Nature Reserve. The walk starts on the river to the north of the village. Here you can pick up the waymarked footpath and follow it east, passing Hermitage Bridge, the Grade II listed Twemlow Viaduct, Bowshot Wood and Greenhey Wood before coming to the village of Swettenham. Near here you'll pass the Swettenham Meadows Nature Reserve on the Swettenham Brook. It's an important site for flora and fauna with Common spotted orchid and marsh orchid thriving in the wet flushes of the variable grassland. In the warmer months it's also great for butterflies with species including small skipper, common blue, small copper and orange tip butterflies. You then head south, passing Davenport Hall before arriving at Brereton Heath. The nature reserve is a lovely place for a stroll with woodland trails, a lake and lots of wildlife to look out for. After exploring the reserve the route returns to the village on the same paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village the George & Dragon is a good choice for post refreshment. They serve high quality food from the conservatory restaurant, while outside there's a lovely terrace garden for warmer days. You can find them on Middlewich Road at postcode CW4 7EA. On the route you could stop off in Swettenham and visit the noteworthy Swettenham Arms. The 16th century country inn includes a lovely Lavender garden where you can enjoy fine food on a summer day. You can find them at postcode CW12 2LF for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk. At Brereton Heath please keep them under close control because of the wildlife. The George & Dragon mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north of the village you'll find one of the highlights of the area at the Jodrell Bank Arboretum. You can learn all about the famous telescope in the discovery centre and enjoy a stroll around the pretty 35 acre arboretum. Head south east into nearby Congleton and there's some lovely waterside walks to be found at Astbury Mere Country Park and the Macclesfield Canal. If you head west along the Dane Valley Way it will take you to Sproston Green and Middlewich where you can pick up the towpath of the Trent and Mersey Canal. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/k3xayUUfLp8",
  "postcode": "CW4 8EE",
  "district": "Holmes Chapel",
  "county": "Cheshire East",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}