{
  "objectID": "6e63f45f27491a95d64e23012e3644af",
  "created_at": "2024-12-21T17:38:48.359345+00:00",
  "ref": "ards-peninsula-walking-route",
  "title": "Ards Peninsula Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Houses_in_the_National_Trust_owned_village_of_Kearney_-_geograph.org.uk_-_5482483.jpg/512px-Houses_in_the_National_Trust_owned_village_of_Kearney_-_geograph.org.uk_-_5482483.jpg?20230926005819",
  "nearby": [
    {
      "description": "Castle Ward",
      "objectID": "53170b67bd8c738cb1b5279d238df47a",
      "ref": "castle-ward-walking-and-cycle-route"
    },
    {
      "description": "Mount Stewart",
      "objectID": "0c0e70c4ce7debcc88e2e9d1e3cda533",
      "ref": "mount-stewart-walking-route"
    },
    {
      "description": "Scrabo Tower",
      "objectID": "60bd01143b497409c9b7c270fde89862",
      "ref": "scrabo-tower-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6e63f45f27491a95d64e23012e3644af.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Houses_in_the_National_Trust_owned_village_of_Kearney_-_geograph.org.uk_-_5482483.jpg/512px-Houses_in_the_National_Trust_owned_village_of_Kearney_-_geograph.org.uk_-_5482483.jpg?20230926005819",
      "title": "Houses in the National Trust owned village of Kearney by Eric Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Kearney is a picturesque village meticulously restored by the National Trust to reflect the authenticity of a traditional fishing village. Located three miles east of Portaferry, it offers stunning views across to Scotland, the Isle of Man, and the Mountains of Mourne. The National Trust owns several cottages in Kearney, which have been carefully restored in the local vernacular style, preserving the village's unique character. A narrow road winding through green, rounded drumlins leads visitors to this charming village, the eight-acre sandy beach of Knockinelder, and a small saltmarsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Reefs_at_Kearney_-_geograph.org.uk_-_5487475.jpg/512px-Reefs_at_Kearney_-_geograph.org.uk_-_5487475.jpg?20230926211204",
      "title": "Reefs at Kearney by Eric Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Reefs at Kearney. In the 19th century, Kearney was a thriving community centred around fishing. Local legends speak of a 'she-cruiser' crewed entirely by women, which ventured into the surrounding waters. Today, Kearney is a place of recreation, ideal for bird watching. The coastal area is home to breeding birds such as oystercatchers, rock pipits, and shelducks. Offshore, the striking white form of gannets can be seen diving into the sea, while terns, eiders, and wintering waders are also common. Turnstones are often found feeding among the seaweed-covered rocks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Cottages_at_Kearney_-_geograph.org.uk_-_2732547.jpg/512px-Cottages_at_Kearney_-_geograph.org.uk_-_2732547.jpg?20211114100236",
      "title": "Cottages at Kearney by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cottages at Kearney"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Shoreline_North_of_the_village_of_Kearney_-_geograph.org.uk_-_5487595.jpg/512px-Shoreline_North_of_the_village_of_Kearney_-_geograph.org.uk_-_5487595.jpg?20230926213643",
      "title": "Shoreline North of the village of Kearney by Eric Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Shoreline North of the village of Kearney. From Kearney village, there are scenic walks to the beach at Knockinelder and along the shore to Stinking Point. These paths traverse lichen-covered slate rocks and coastal grasslands dotted with spring squill on the promontories. The small, sheltered bays consist of shingle and saltmarsh, where the yellow horned poppy, a rare plant in the area, can be found."
    }
  ],
  "distance_km": 3.0,
  "description": "This coastal walk takes you along the Ards Peninsula in the village of Kearney in Northern Ireland. The picturesque fishing village is owned by the National Trust and includes several pretty dwellings and well laid out walking trails. This waymarked circular walk explores the area around the village with wonderful sea views over Knockinelder Bay. On a clear day the views extend to Scotland, the Isle of Man and the Mountains of Mourne. The area is also great for wildlife with a variety of sea birds to look out for on the walk. To continue your walking in the area head to the nearby Castle Ward. Here you can explore the splendid estate surrounding the historic 18th century mansion. There's also the Strangford Lough cycle ride which has many sections suitable for walkers.",
  "video_url": "https://www.youtube.com/embed/GXwAH4y-vzI?si=QkSSYDjHBHtXKjJq&start=27"
}