{
  "created_at": "2025-01-06T00:38:24.649474+00:00",
  "objectID": "6e8237d1d03e21275188a8ceb0ed5d41",
  "ref": "bradford-millennium-way-walking-route",
  "title": "Bradford Millennium Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Millennium_Way_above_Denholme_-_geograph.org.uk_-_458774.jpg",
  "nearby": [
    {
      "description": "Cottingley Woods",
      "objectID": "a819d6966529ccddc209c9dce4478cbe",
      "ref": "cottingley-woods-walking-route"
    },
    {
      "description": "Shipley Glen",
      "objectID": "fd5590a126ab1af86659bfab27a70b5c",
      "ref": "shipley-glen-walking-route"
    },
    {
      "description": "Baildon Moor",
      "objectID": "97bbafde0bce261b061b1da60a4845b8",
      "ref": "baildon-moor-walking-and-cycle-route"
    },
    {
      "description": "Bronte Waterfall and Top Withens",
      "objectID": "27ef72e4234f2837a9aaf846eba25d51",
      "ref": "bronte-waterfall-and-top-withens-walking-route"
    },
    {
      "description": "Bronte Way",
      "objectID": "29a9070171e85c70f19b6ff7731fbd8b",
      "ref": "bronte-way-walking-route"
    },
    {
      "description": "Leeds and Liverpool Canal",
      "objectID": "fa6cd622bb8bb404353c325eb4d48350",
      "ref": "leeds-and-liverpool-canal-walking-and-cycle-route"
    },
    {
      "description": "Ilkley Moor",
      "objectID": "c47b5760ae8158674a200d8e87072dc9",
      "ref": "ilkley-moor-walking-route"
    },
    {
      "description": "Hewenden Reservoir and Viaduct",
      "objectID": "0f5f17b552e164a3741009edec6f6e87",
      "ref": "hewenden-reservoir-and-viaduct-walking-route"
    },
    {
      "description": "Bradford",
      "objectID": "a018f7681483a79acf1354c324d3fc1c",
      "ref": "bradford-walking-route"
    },
    {
      "description": "Goit Stock Waterfall",
      "objectID": "549134a5377407cf340d1d1710266eba",
      "ref": "goit-stock-waterfall-walking-route"
    },
    {
      "description": "Doe Park Reservoir",
      "objectID": "562832571d756caf5e512c7232f3c94e",
      "ref": "doe-park-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6e8237d1d03e21275188a8ceb0ed5d41.gpx",
  "_geoloc": {
    "lat": 53.84827358,
    "lng": -1.80398941
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Millennium_Way_above_Denholme_-_geograph.org.uk_-_458774.jpg",
      "title": "John Readman / Millennium Way above Denholme",
      "caption": "Millennium Way above Denholme. The old footpath, is deeply hollowed into hillside. To the left of the photograph is a brick wall made of Yorkshire grit coloured red. It appears to be old, to have been here for years, but looks are deceiving for it was constructed only a few years ago by a group of local men using the stone from nearby!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Millennium_Way_above_Eastburn_-_geograph.org.uk_-_453014.jpg",
      "title": "John Readman / Millennium Way above Eastburn",
      "caption": "Millennium Way above Eastburn. The grassy track curves to the right below Knott Hill, with a high well maintained dry stone wall to the left. The moor in front is also divided by stone walls. There is young bracken and bilberry bushes in the foreground.Not in shot, but close by is a wooden seat, where views over the Aire valley below can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/The_Millennium_Way_at_Gleid_Hill_-_geograph.org.uk_-_358921.jpg",
      "title": "Paul Glazzard / The Millennium Way at Gleid Hill",
      "caption": "The Millennium Way at Gleid Hill. Just south of the parish boundary between Denholme and Cullingworth, on the track around Gleid Hill from Wood Nook in Denholme leading to Birchen Lea Farm in Cullingworth and further north to the Hewenden Reservoir and Viaduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Millennium_Way_towards_Long_Causeway%2C_Denholme_-_geograph.org.uk_-_458804.jpg",
      "title": "John Readman / Millennium Way towards Long Causeway, Denholme",
      "caption": "Millennium Way towards Long Causeway, Denholme. The moorland is very flat at this point as the footpath on a cart track leads from a gateway towards a wall in the distance. The long grass of the moor was waving gently in the breeze."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/The_Millennium_Way_at_Gleid_Hill_-_geograph.org.uk_-_358928.jpg",
      "title": "Paul Glazzard / The Millennium Way at Gleid Hill",
      "caption": "The Millennium Way at Gleid Hill. Hewenden Viaduct on the dismantled railway line southeast of Cullingworth, looking north across the northeast corner of Hewenden Reservoir from Gleid Hill on the Millennium Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/The_Millennium_Way_at_Gleid_Hill_-_geograph.org.uk_-_358921.jpg",
      "title": "Paul Glazzard / The Millennium Way at Gleid Hill",
      "caption": "Just south of the parish boundary between Denholme and Cullingworth, on the track around Gleid Hill from Wood Nook in Denholme leading to Birchen Lea Farm in Cullingworth and further north to Hewenden Viaduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/The_Millennium_Way_above_Currer_Wood%2C_Eastburn_-_geograph.org.uk_-_453029.jpg",
      "title": "John Readman / The Millennium Way above Currer Wood, Eastburn",
      "caption": "Above Currer Wood, Eastburn. The wide grassy bridleway leads gently down from Intake Lane towards a wooden gate. There is a drystone wall to the right in which I found a family a weasels taking advantage of the warmth and cover provided by the wall. Through the gate can be viewed a copse of silver birch trees, and in the distance the Aire valley with Cross Hills and Glusburn, and the hills above Cononley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Far_Laithe_Farm_with_views_towards_Worth_Valley_-_geograph.org.uk_-_451964.jpg",
      "title": "John Readman / Far Laithe Farm with views towards Worth Valley",
      "caption": "Far Laithe Farm with views towards Worth Valley. The Millennium Way goes through this farm; the tip of the signpost is to the bottom right, and the path goes through the field of sheep, to the left of the farm over the stiles in the distance and down towards Laycock Village."
    }
  ],
  "distance_km": 72.0,
  "description": "This long distance, waymarked circular walk takes you on a tour of some of most beautiful countryside, pretty villages and attractive moorland in the Bradford area of West Yorkshire. The walk starts on Shipley Green, just north of Shipley town centre. You then head north to Weecher Reservoir, passing the lovely Shipley Glen and Baildon Moor on the way. The route continues to the wonderful Ilkley Moor. The moor has many interesting geological features, bronze age stone circles and fabulous views from the high points. After passing the town of Ilkley you continue to the village of Addingham, passing Addingham High Moor on the way. The route then passes Silsden Moor and Silsden Reservoir before skirting the outskirts of the town. From Silsden you continue south through Airedale to Steeton, crossing the Leeds and Liverpool Canal and the River Aire on the way. You then pass Steeton Moor and Laycock before crossing Keighley Moor and Oakworth Moor. This section includes a waterside path along Keighley Moor Reservoir. The next stage takes you to the lovely little hamlet of Oldfield. From here there are panoramic views across the Worth valley towards Bronte country. The path heads south from here to the Bronte Waterfall. This delightful spot was popular with the Bronte sisters who loved visiting the pretty waterfall. There is a lovely little bridge called Bronte Bridge next to the falls. The area also includes the ruined farmhouse of Top Withens, said to have been the inspiration for Wuthering Heights by Emily Bronte. From the waterfall you continue to Oxenhope and then Denholme, passing Leeming Reservoir and Thornton Moor reservoir on the way. The final section takes you back to Shipley via Hewenden Reservoir and Viaduct, Goit Stock Waterfall, Doe Park Reservoir, Harden Beck and Bingley. The walk is well marked with a series of yellow and blue discs.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Keighley the path passes close to the Keighley Worth Way. This circular trail explores the lovely Worth Valley, visiting Haworth and the Penistone Hill Country Park, where there are fine waterside trails around Lower Laithe Reservoir and great views from the elevated position of the park."
    }
  ],
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Glen Road, Baildon, Bradford, West Yorkshire, England, BD17 5EA, United Kingdom",
  "postcode": "BD17 5EA",
  "district": "Bradford",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "geological features",
    "waterfalls",
    "literary locations"
  ],
  "facilities": [
    "car park",
    "waterfront",
    "reservoir"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}