{
  "objectID": "6e8a6106d21443ede5176ebd3ddd3aff",
  "created_at": "2024-12-18T00:51:14.217294+00:00",
  "ref": "hucknall-walking-route",
  "title": "Walk around Hucknall Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/af/High_St%2C_Hucknall_-_geograph.org.uk_-_892807.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/88E8474215822FE5862587E300377160/$FILE/Hucknall.gpx",
  "_geoloc": {
    "lat": 53.0380469991,
    "lng": -1.1969667591
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/High_St%2C_Hucknall_-_geograph.org.uk_-_892807.jpg",
      "title": "Phil Evans / High St, Hucknall",
      "caption": "High St, Hucknall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/The_Red_Lion_and_flower_seller_-_geograph.org.uk_-_1752493.jpg/256px-The_Red_Lion_and_flower_seller_-_geograph.org.uk_-_1752493.jpg",
      "title": "David Lally / The Red Lion and flower seller",
      "caption": "The Red Lion and flower seller, Hucknall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Bestwood_Country_Park-_Mill_Lakes_-_geograph.org.uk_-_661632.jpg",
      "title": "Alan Murray-Rust / Bestwood Country Park- Mill Lakes",
      "caption": "Bestwood Country Park- Mill Lakes. The lakes are home to extensive wildlife"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Main_path_through_Bestwood_Country_Park_-_geograph.org.uk_-_1435301.jpg",
      "title": "Trevor Rickard / Main path through Bestwood Country Park",
      "caption": "Main path through Bestwood Country Park. Looking south-east towards the aptly-named Big Wood. This path follows the track-bed of the old LNER line from Bestwood Colliery to Draybrook, part of the Nottingham to Shirebrook line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Bestwood_Country_Park_-_geograph.org.uk_-_1436607.jpg",
      "title": "Trevor Rickard / Bestwood Country Park",
      "caption": "Bestwood Country Park. A good view to the north-west from this path. In the Leen Valley below is Hucknall, with its by-pass on the left. Bestwood Business Park below on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Greasley_House_-_geograph.org.uk_-_1553385.jpg",
      "title": "Trevor Rickard / Greasley House",
      "caption": "Greasley House. Looking north from the B600. A good-looking late Victorian House, which was for sale via Savills at the time I took this picture in 2009. Their property details say seven bedrooms, complete with coach house and five acres for a mere £800K."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Pond_at_Colliers_Wood_-_geograph.org.uk_-_1549195.jpg",
      "title": "Trevor Rickard / Pond at Colliers Wood",
      "caption": "Pond at Colliers Wood. Looking north with High Park Wood in the distance. Planted with marginals, including flag iris and purple loosestrife, to encourage wildlife. The area has been mined for coal for at least 700 years. Within a couple of miles of here over 200 shafts have been sunk. Colliers Wood and the surrounding area was once Moorgreen Colliery, opened by Barber, Walker & Co in 1865. Coal production from the three shafts began in 1871. At its peak the colliery produced over a million tons of coal in 1963. From that point, production gradually decreased and the pit eventually closed in 1985 when the seams were exhausted. Following landscaping, the land was converted into an industrial estate and the country park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Moorgreen_Reservoir_-_geograph.org.uk_-_16377.jpg",
      "title": "Garth Newton / Moorgreen Reservoir",
      "caption": "Moorgreen Reservoir. The reservoir was constructed at the end of the eighteenth century. Based on an incident in 1892, it was used by the author D.H. Lawrence, born in nearby Eastwood, as the location for the drowning tragedy in his novel \"Women In Love\"."
    }
  ],
  "distance_km": 25.7,
  "description": "This Nottinghamshire market town has some nice country trails, waterside paths around a nearby lake and a significant local park to explore. The town includes a train station, attractive market square and a noteworthy church which is the burial place of the famous 18th and 19th century poet Lord Byron . This circular walk around Hucknall visits some of the local walking highlights at Mill Lakes, Bestwood Country Park and Moorgreen Reservoir . It uses a mixture of public footpaths and a section of the long distance Robin Hood Way to complete the walk. The walk starts at the train station and then heads south east through Broomhill to the Mill Lakes in Bestwood Park. You'll pass along the northern side of the pretty lakes before passing through Bestwood Village and entering the main section of the park where there's miles of peaceful woodland trails. After exploring the park you then pick up the Robin Hood Way and follow it west through the golf course at Bulwell Hall Park. You continue to Watnall before turning north west to Greasley and Colliers Wood Nature Reserve on the outskirts of Eastwood. There's a pretty pond and lots of wildlife to see in this small, but worthy reserve. The route then passes north along Moorgreen Reservoir with more woodland and some lovely views across the still water. The final section takes you east through High Park Wood to Misk Hill before returning to Hucknall.",
  "postcode": "NG15 7TP",
  "district": "Hucknall",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "England"
}