{
  "created_at": "2025-01-06T04:45:14.782356+00:00",
  "objectID": "6e932dac1985933614652a1a687702d3",
  "ref": "scotney-castle-walking-route",
  "title": "Scotney Castle Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/51/Sundial_at_Scotney_Castle_-_geograph.org.uk_-_914983.jpg",
  "nearby": [
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Bewl Water",
      "objectID": "e016f27e7e61d59b93cae067b96b5347",
      "ref": "bewl-water-walking-and-cycle-route"
    },
    {
      "description": "Goudhurst",
      "objectID": "1e804d3a58bde6c6f4498179907c73a0",
      "ref": "goudhurst-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6e932dac1985933614652a1a687702d3.gpx",
  "_geoloc": {
    "lat": 51.091457565,
    "lng": 0.4105457266
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Sundial_at_Scotney_Castle_-_geograph.org.uk_-_914983.jpg",
      "title": "Stephen Craven / Sundial at Scotney Castle",
      "caption": "Sundial at Scotney Castle. A traditional sundial, or gnomon, in the castle grounds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Scotney_Castle_-_geograph.org.uk_-_1532391.jpg",
      "title": "Richard Croft / Scotney Castle",
      "caption": "14th century drum tower and Elizabethan south wing of the old castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Scotney_Castle_-_geograph.org.uk_-_1063101.jpg",
      "title": "Graham Taylor / Scotney Castle",
      "caption": "This part was built as a 'romantic ruin' or folly simply to provide a focal point in the garden. The currently occupied building is some distance away. The original castle has long since been demolished."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Scotney_Castle_-_geograph.org.uk_-_1532402.jpg",
      "title": "Richard Croft / Scotney Castle",
      "caption": "Old Scotney Castle from the south side of the moat with drum tower of c1380, Elizabethan south wing of 1580 and ruined east wing of 1630"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Boathouse_at_Scotney_Castle_-_geograph.org.uk_-_517851.jpg",
      "title": "Philip Halling / Boathouse at Scotney Castle",
      "caption": "Boathouse view. A boathouse reflected in the lake in the gardens of the Castle. The gardens were originally created in the 1830's by Edward Hussey III. Seen over a stand of giant rhubarb, the boathouse is tucked away under a horse chestnut tree next to a less welcome clump of Japanese Knotweed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Ruined_east_range_of_Scotney_Castle_-_geograph.org.uk_-_864430.jpg",
      "title": "Andy Potter / Ruined east range of Scotney Castle",
      "caption": "Ruined east range of the castle This three-storey wing was added by the Darrell family in 1640 utilising stone from original 14th castle walls. This act of what would now be seen as architectural vandalism was matched in the 19th century when the east range itself was demolished to provide a romantic ruin for the redesigned gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Walled_garden_at_Scotney_Castle_-_geograph.org.uk_-_864499.jpg",
      "title": "Andy Potter / Walled garden at Scotney Castle",
      "caption": "Walled garden. This is currently the designated picnic area and there is a kiosk providing light refreshments tucked away behind a doorway in the west wall. Virtually nothing remains of the original walled garden except for the wall itself, and the greenhouses and plots on the north wall. The buff-coloured section of wall to the right of the greenhouses is the site of a dismantled greenhouse. The north wall not only receives the most sunlight but appears to have a heated wall, as evidenced by the chimneys."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/A_Bridge_and_Gate_at_Scotney_Castle_-_geograph.org.uk_-_75345.jpg",
      "title": "Hywel Williams / A Bridge and Gate at Scotney Castle",
      "caption": "A Bridge and Gate at the castle. A small bridge over the river Brewl and a gate on the grounds of Scotney Castle. The gate is used to separate the fields of grazing animals."
    }
  ],
  "distance_km": 5.0,
  "description": "Explore the 770 acres of woodland and parkland surrounding this 14th century moated castle near Tunbridge Wells. The gardens are stunning with rhododendrons and azaleas and the ruins of the Old Castle at the centre. The new house was built in the 19th century and overlooks the castle. It has grand rooms with fine furniture and paintings. After explorling the gardens you can follows miles of footpaths into the wider estate. You will pass woodland, ponds and also cross the River Bewl which flows through the grounds. If you would like to continue your outing you could head to the nearby Bewl Water where you will find a circular walking route around a large reservoir. The Sussex Border Path also runs just to the south of Scotney Castle and can be easily picked up.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The parkland is ideal for dog walking so you're bound to see other owners on your visit. You are requested to keep them on short leads though. You can find water bowls at the tea room where they are allowed in the outdoor section."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The on site tea room has a good range of snacks and meals with some ingredients coming from their own walled garden. You could also head into nearby Lamberhurst and visit the noteworthy Chequers. The pub dates back to the 15th century and includes a charming interior with log fires and interesting wall art. Outside there's a lovely garden area for summer days. They do excellent food and can be found on The Broadway at postcode TN3 8DB for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Only a mile to the north west you can pick up the historic Lamberhurst Walk which visits the noteworthy Bayham Old Abbey. The site is run by English Heritage and includes substantial ruins dating back to the 13th century. Just a few miles north east of the castle you'll find the village of Goudhurst. The picturesque little village is located in a lovely elevated spot with excellent views over the Weald. There's also a delightful village pond, rows of ancient cottages and a noteworthy 14th century church to see here. It's a nice little place to visit after you've explored the castle. Another worthy idea is to head to the town of Cranbrook. The ancient settlement is well worth exploring with a number of fine medieval buildings, a noteworthy church known as the 'Cathedral of the Weald' and a photogenic working windmill to see. There's also an excellent, award winning micropub on the High Street to try. The Cranbrook Walk explores the town before heading to the nearby Sissinghurst Castle. It's another National Trust run attraction in a similar vein to Scotney. For more walking ideas in the area see the Kent Walks and High Weald Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/42RRpJgEqZA",
  "postcode": "TN3 8JN",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Scotney Castle, Sweetbourne Bridge, Lamberhurst, Tunbridge Wells, Kent, England, TN3 8JN, United Kingdom",
  "district": "Tunbridge Wells",
  "state": "England"
}