{
  "created_at": "2025-01-06T02:37:43.481667+00:00",
  "objectID": "6f7a2d1454d650669c7764b76cf74ef1",
  "ref": "stoodley-pike-walking-route",
  "title": "Stoodley Pike Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/db/Stoodley_Pike_Monument_-_geograph.org.uk_-_362553.jpg",
  "nearby": [
    {
      "description": "Withens Clough Reservoir",
      "objectID": "fae9843b762a57748132fc749ebdb43c",
      "ref": "withens-clough-reservoir-walking-route"
    },
    {
      "description": "Rochdale Canal",
      "objectID": "9e315fd68b82273b696b35909c3a558e",
      "ref": "rochdale-canal-walking-and-cycle-route"
    },
    {
      "description": "Pennine Bridleway",
      "objectID": "44a8045b0b270f7e12f201cd782af111",
      "ref": "pennine-bridleway-walking-and-cycle-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Calderdale Way",
      "objectID": "96f0b565a2bbeec9d6d8b9b6775d477b",
      "ref": "calderdale-way-walking-route"
    },
    {
      "description": "Hebden Bridge",
      "objectID": "032b62035ea618e8df9cc2f5e8bb5791",
      "ref": "hebden-bridge-walking-route"
    },
    {
      "description": "Gaddings Dam",
      "objectID": "fdd7b41726f431ae74214eac1553de0a",
      "ref": "gaddings-dam-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6f7a2d1454d650669c7764b76cf74ef1.gpx",
  "_geoloc": {
    "lat": 53.7116643004,
    "lng": -2.0992769505
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Stoodley_Pike_Monument_-_geograph.org.uk_-_362553.jpg",
      "title": "Paul Glazzard / Stoodley Pike Monument",
      "caption": "A monument on Stoodley Pike was built by public subscription in 1814 to commemorate the peace after Napoleon's defeat but coincidentally it collapsed after a lightning strike on 8th February 1854, the day the Russian Ambassador was withdrawn from London at the start of the Crimean War. To mark the end of the Crimean War in 1856, a new 110 foot monument designed by local architect James Green was erected in its place, this time with a lightning conductor attached."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Stoodley_Pike_-_geograph.org.uk_-_471.jpg",
      "title": "Andy Stephenson / Stoodley Pike",
      "caption": "The site on Stoodley Pike was probably used for bronze age burials, since bones were found when excavating for the first circular tower. This was built in 1815 to celebrate the peace at the end of the Napoleonic war. Unfortunately, it collapsed when the next war started, on the day the Russian ambassador left London before the Crimean War. The present monument was built in 1856. You can climb up the inner spiral staircase counting 39 steps in the dark to get a great view. It may also have been a beacon site. A beacon was temporarily put up and lit on 19th July 1988 to commemorate the great chain of beacons 400 years earlier, when the Spanish Armada was sighted off the southern coast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Stoodley_Pike_Monument_-_geograph.org.uk_-_1255114.jpg",
      "title": "Kevin Rushton / Stoodley Pike Monument",
      "caption": "Doorway at the top of the spiral staircase to the balcony"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Derelict_Farm_buildings_below_Stoodley_Pike_-_geograph.org.uk_-_1229334.jpg",
      "title": "Michael Steele / Derelict Farm buildings below Stoodley Pike",
      "caption": "Derelict Farm buildings below Stoodley Pike"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/A_Storm_Brews_Over_Stoodley_Pike._-_geograph.org.uk_-_502521.jpg",
      "title": "Steve Partridge / A Storm Brews Over Stoodley Pike.",
      "caption": "A Storm Brews Over Stoodley Pike. The storm only turned out to be a wandering shower that followed the course of the valley below for a while completely missing the Pike and me."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Pennine_Way_near_Stoodley_Pike_-_geograph.org.uk_-_1377270.jpg",
      "title": "Chris Wimbush / Pennine Way near Stoodley Pike",
      "caption": "Pennine Way signs near the Pike"
    }
  ],
  "distance_km": 11.0,
  "description": "This circular walk takes you to the Stoodley Pike monument from Todmorden. It makes use of the Calderdale Way and the Pennine Way to take you to the monument before returning to Todmorden along the Rochdale Canal. The walk starts in Todmorden near the train station. You then follow the Calderdale Way to the little village of Lumbutts where you will find an old church, a mill house and pretty cottages. The walk continues past the Heeley Dam reservoir to Withens Gate where you pick up the Pennine Way. This takes you across Higher Moor to the Stoodley Pike summit. Here you will find the impressive monument, built in 1856 at the end of the Crimean War. You can climb the stairs of the monument to a viewing platform and enjoy wonderful views over Calderdale. From the summit you descend to the Rochdale Canal where a long waterside section leads back to Todmorden. It's a lovely section of the canal with old bridges, mills and locks. The surrounding hills and countryside make a splendid backdrop. You can also reach the hill from nearby Hebden Bridge by following the Pennine Bridleway. If you'd like to extend your walk then you could follow Pennine Way the to the nearby Withens Clough Reservoir. There is a nice waterside footpath with good views of the surrounding moorland and back to the monument.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the nearby Top Brink pub for some well earned refreshments after your walk. The traditional original pub includes stone features, beamed ceilings, brassware & pottery, and a light airy large conservatory to the front with panoramic views. Outside there are several outside eating areas, including a large decked area and a lovely garden area with pretty flower baskets. It's a great place to relax and enjoy the countryside views with your meal. You can find the pub at Lumbutts just a short distance to the west of the hill. Postcode is OL14 6JB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The pike makes for an excellent walk for fit dogs. The Top Brink pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to head east of the Pike to visit the little village of Cragg Vale. It has an interesting history connected with the The Cragg Vale Coiners, a band of counterfeiters that produced fake gold coins in the late 18th century to supplement small incomes from weaving. Just to the north you'll find Bell House Moor where the house of the leader of the Cragg Vale coiners can be seen. The Cragg Vale Walk starts from the village and visits Withens Clough Reservoir before climbing to the viewpoint at Turley Holes Edge. You could start the walk to the Pike from the village and head west along the Calderdale Way before turning to north along the Pennine Way. The Hinchcliffe Arms pub in the village does some of the best food in the area and would make an excellent end to the walk. The circular Walk around Todmorden passes the hill. You can follow it south to the nearby Warland Reservoir and White Holme Reservoir. Near here there's also the pretty Gaddings Dam. The small reservoir is notable for having the highest beach in Britain. Just to the west of Todmorden there's some nice peaceful trails around the woodland of Gorpley Clough and the adjacent Gorpley Reservoir. For more walking ideas in the area see the South Pennines Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mxlAWpeRqxM",
  "postcode": "OL14 6LD",
  "district": "Calderdale",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Fielden House, 41, Rochdale Road, Salford, Todmorden, Calderdale, West Yorkshire, England, OL14 6LD, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland",
    "canal"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "monument"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}