{
  "created_at": "2025-01-06T04:07:56.405888+00:00",
  "objectID": "6fe32483c076f7849bd92ac780560869",
  "ref": "bedruthan-steps-walking-route",
  "title": "Bedruthan Steps Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Queen_Bess_Rock%2C_Bedruthan_Steps_-_geograph.org.uk_-_54649.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Trevose Head",
      "objectID": "05d817ace8038375e18d7b0b6df4f7e9",
      "ref": "trevose-head-walking-route"
    },
    {
      "description": "Mawgan Porth to Bedruthan Steps Walk",
      "objectID": "cbafa74e065efddb1b18275f4e148fd6",
      "ref": "magwan-porth-to-bedruthan-steps-walk-walking-route"
    },
    {
      "description": "Holywell to Crantock Circular Walk",
      "objectID": "ea80122fe6b16ea01920caa11e2ef6f2",
      "ref": "holywell-to-crantock-circular-walk-walking-route"
    },
    {
      "description": "Constantine Bay to Harlyn Bay Walk",
      "objectID": "9b5b2db6335105acdca89e5d3240a375",
      "ref": "constantine-bay-to-harlyn-bay-walking-route"
    },
    {
      "description": "Mawgan Porth to Watergate Bay",
      "objectID": "c2232b7341c404f4f3ce2f8a62d02c42",
      "ref": "mawgan-porth-to-watergate-bay-walking-route"
    },
    {
      "description": "Porthcothan",
      "objectID": "e460f2b636db9a1f43dd3dd621de67f4",
      "ref": "porthcothan-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6fe32483c076f7849bd92ac780560869.gpx",
  "_geoloc": {
    "lat": 50.4814251745,
    "lng": -5.0295626836
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Queen_Bess_Rock%2C_Bedruthan_Steps_-_geograph.org.uk_-_54649.jpg",
      "title": "David Hawgood / Queen Bess Rock, Bedruthan Steps",
      "caption": "Queen Bess Rock, Bedruthan Steps. Off with her head! Until a few years ago this rock had a prominent \"head\" on the slender neck, but it succumbed to the waves in rough weather and fell off. The isolated pillars on this beach are volcanic rock, the cliffs behind are softer sandstone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/National_Trust_sign_for_Carnewas%2C_by_Bedruthan_Steps_-_geograph.org.uk_-_50433.jpg",
      "title": "David Hawgood / National Trust sign for Carnewas, by Bedruthan Steps",
      "caption": "National Trust sign for Carnewas, by Bedruthan Steps. Looking North across Carnewas and Bedruthan Steps to Park Head, with Trevose Head behind"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Cliff_at_Trerathick_Cove%2C_near_Bedruthan_Steps_-_geograph.org.uk_-_50419.jpg",
      "title": "David Hawgood / Cliff at Trerathick Cove, near Bedruthan Steps",
      "caption": "Cliff at Trerathick Cove, near Bedruthan Steps. This cliff with deformed strata is just south of Bedruthan Steps. The rocks in this area are mainly Lower Old Red Sandstone. The isolated rocks of Bedruthan Steps are volcanic."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Coast_path_near_Bedruthan_Steps_-_geograph.org.uk_-_1540409.jpg",
      "title": "Philip Halling / Coast path near Bedruthan Steps",
      "caption": "Coast path near Bedruthan Steps. The South West Coast Path briefly enters this grid square."
    }
  ],
  "distance_km": 8.5,
  "description": "This walk takes you to a stunningly beautiful stretch of Cornish Coast where you will find the Bedruthan Steps. This series of large rocks along the beach are a popular tourist attraction and very photogenic. There are great views towards Carnewas Island and Trescore Islands to enjoy. The area is also covered with attractive wildflowers which attract a variety of butterflies and birds. The walk starts from the National Trust Carnewas car park and heads to the coast path. You then pass the Bedruthan Steps said to have been used as stepping stones by the giant Bedruthan. There is a steep staircase down to a lovely secluded beach but be mindful of the changing tides if you take this detour. The walk continues to Porth Mear where there is a lovely cove with lots of pretty rock pools. You can continue along the coast to Porthcothan where where there is another gorgeous bay and beach. You can also stop for refreshments at the Porthcothan Bay Stores in the little village. To return to the car park you can just follow the coast all the way back or take a nice detour at Porth Mear towards Pentire Farm. This section will take you through a pretty valley with streams and attractive countryside. The Bedruthan Steps are located about 6 miles north of Newquay so you could follow the South West Coast Path to the steps if you would prefer to come on foot.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south to Mawgan Porth and you could visit the Merrymoor Inn for some refreshments. There's a good menu and great sea views from the garden area. It's a lovely place to relax if the weather is good. You can find the inn at postcode TR8 4BA for your sat navs. To the north there's the Porthcothan Bay Stores. There's a nice cafe here selling coffee, cakes and sandwiches. You can hire surfboards and wetsuits here too. There's also another car park here if you would like to start the walk from here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal path and the beaches are great for dog walking and the Merrymoor Inn mentioned above is also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north along the coast path and you could visit Trevose Head. The attractive headland includes the Trevose Lighthouse and more great views. You could also visit the steps from the car park at the lovely Mawgan Porth just to the south of the steps. See the Mawgan Porth to Bedruthan Steps Walk for more details. The Mawgan Porth to Watergate Bay Walk will take you south to a splendid long beach just outside the popular tourist town of Newquay. Just south of Newquay you can pick up the Holywell to Crantock Circular Walk to visit the lovely Holywell Bay and the secluded beach at Porth Joke."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bGiGmzfye8g",
  "postcode": "PL27 7FS",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bedruthan House Hotel, B3276, Mawgan-in-Pydar, St. Eval, Cornwall, England, PL27 7FS, United Kingdom",
  "district": "St. Eval",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "beach",
    "valley"
  ],
  "points_of_interest": [
    "viewpoints",
    "rock pools",
    "countryside"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "shop",
    "beach"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}