{
  "objectID": "6ff44de82e6dcb0e7ae602d41a9b604b",
  "created_at": "2024-12-18T00:56:14.634025+00:00",
  "ref": "alfriston-walking-route",
  "title": "Alfriston Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Cuckmere_River%2C_Alfriston_-_geograph.org.uk_-_168799.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/6/6ff44de82e6dcb0e7ae602d41a9b604b.gpx",
  "_geoloc": {
    "lat": 50.8080834886,
    "lng": 0.1567117364
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Cuckmere_River%2C_Alfriston_-_geograph.org.uk_-_168799.jpg",
      "title": "Simon Carey / Cuckmere River, Alfriston",
      "caption": "Cuckmere River, Alfriston. Taken from Whites Bridge, the church is to the right out of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Long_Man_of_Wilmington_-_geograph.org.uk_-_936784.jpg",
      "title": "Simon Carey / Long Man of Wilmington",
      "caption": "Long Man of Wilmington. Viewed from the footpath from Wilmington at sunset. The first record of a chalk figure dates from 1710 and the 226 foot figure has been scaled in a way so as not to look short and stumpy from below. Whether the figure dates back to antiquity has been much debated but is generally believed not to. The figure is in the current ownership of the Sussex Archeological Society who received it from the Duke of Devonshire along with nearby Wilmington Priory in 1926."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Windover_Hill_-_geograph.org.uk_-_936653.jpg",
      "title": "Simon Carey / Windover Hill",
      "caption": "Windover Hill. The peak is actually in the next square though all of its slope into Ewe Dean is in this one. Taken from the South Downs Way next to the reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Lullington_Heath_-_view_to_the_south-west_-_geograph.org.uk_-_39673.jpg",
      "title": "Ian Cunliffe / Lullington Heath - view to the south-west",
      "caption": "A lone walker on Lullington Heath. As well as interesting wild plants, one often sees rare breeds of sheep and goats here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Lullington_Heath_National_Nature_Reserve%2C_East_Sussex_-_geograph.org.uk_-_846940.jpg",
      "title": "Kevin Gordon / Lullington Heath National Nature Reserve, East Sussex",
      "caption": "Lullington Heath National Nature Reserve, East Sussex. The reserve is one of the largest areas of Chalk Heath in England. It is a haven for wildlife including butterflies and spiders (48 different species of spider found there in June 2007)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Seven_Sisters_Country_Park_Sign_-_geograph.org.uk_-_1282013.jpg",
      "title": "Nigel Chadwick / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Seven Sisters Country Park Sign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Cuckmere_Haven_-_geograph.org.uk_-_945356.jpg",
      "title": "Andrew Smith / Cuckmere Haven",
      "caption": "Cuckmere Haven. The view from the western end of the shingle beach. Further to the west the shoreline is rocky. The mouth of the river is in the middleground beyond the third groyne. The Seven Sisters and Belle Tout are in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Friston_Forest_-_geograph.org.uk_-_1272307.jpg",
      "title": "Simon Carey / Friston Forest",
      "caption": "Friston Forest. Viewed from the northern side of Charleston Bottom. The forest is an early 20th century plantation on former open downland currently owned by Southern Water who lease it to the Forestry Commission. All tracks within the forest are open access for walkers though cyclists and horse riders have to stick to specifically marked ones."
    }
  ],
  "distance_km": 18.0,
  "description": "The riverside village of Alfriston is located in a wonderful spot for exploring the South Downs. This circular walk visits some of the highlights of the area including Cuckmere River and Cuckmere Haven, Seven Sisters Country Park, Long Man of Wilmington and Friston Forest. The route runs for just under 12 miles, using sections of The South Downs Way National Trail and other public trails and paths that run through the countryside to the east of Alfriston. The walk starts on the eastern side of the village where you cross the river and pick up the South Downs Way trail. Follow it north east and will climb to the Long Man on Wilmington Hill. The striking hill figure is thought to have originated in the Iron Age or even the neolithic period. From the hill top there are fine views over the Downs to the coast. The trail then heads south and the west to visit the Lullington Heath Nature Reserve. It's a lovely area made up of chalk heath with heather, bell heather and gorse bushes. The trail then skirts the edge of the expansive Friston Forest before heading through the Seven Sisters Country Park to Cuckmere Haven. The route then heads back to Alfriston, passing Charleston Manor before a final riverside section leads you back into the village.",
  "video_url": "https://www.youtube.com/embed/3wULz8e8iWA",
  "district": "Alfriston",
  "county": "East Sussex",
  "region": "South East",
  "country": "England"
}