{
  "created_at": "2025-01-06T01:53:24.183719+00:00",
  "objectID": "0006d1151c89ce0302097da19f7dd382",
  "ref": "stratford-upon-avon-canal-walking-and-cycle-route",
  "title": "Stratford Upon Avon Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/11/Edstone_Aqueduct_-_geograph.org.uk_-_3027153.jpg",
  "nearby": [
    {
      "description": "Baddesley Clinton",
      "objectID": "50800eca937fa1b2a7d13d9889b4eca3",
      "ref": "baddesley-clinton-walking-route"
    },
    {
      "description": "Packwood House",
      "objectID": "78149ae3a141f1421b4991b76c680d47",
      "ref": "packwood-house-walking-route"
    },
    {
      "description": "Lapworth Circular Canal Walk",
      "objectID": "375f6dddef8edd81f55eb3344ab2fd1c",
      "ref": "lapworth-circular-canal-walk-walking-route"
    },
    {
      "description": "Bidford on Avon",
      "objectID": "46c92f5516cb6cc5cf90bbae218b6ae4",
      "ref": "bidford-on-avon-walking-route"
    },
    {
      "description": "Snitterfield",
      "objectID": "4f19ac39933d8332d9e371737b31e66b",
      "ref": "snitterfield-walking-route"
    },
    {
      "description": "Edstone Aqueduct",
      "objectID": "818a4452fb776079dced5fb19f2ad5d9",
      "ref": "edstone-aqueduct-walking-route"
    },
    {
      "description": "Wootton Wawen",
      "objectID": "a6dc03f844928dee355a36a5148de7d5",
      "ref": "wootton-wawen-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0006d1151c89ce0302097da19f7dd382.gpx",
  "_geoloc": {
    "lat": 52.1923124726,
    "lng": -1.7026210215
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Edstone_Aqueduct_-_geograph.org.uk_-_3027153.jpg",
      "title": "Edstone Aqueduct by roger geach, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Edstone Aqueduct. Just south of the village of Wootton Wawen you will pass the Edstone Aqueduct. The structure is notable as the longest cast iron aqueduct in England, measuring 475 feet (145 m). The Grade II listed Aqueduct dates to 1816 and is a popular place for a stroll with nice views over the surrounding countryside from the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Stratford-upon-Avon_Canal%2C_Solihull_Lodge_-_geograph.org.uk_-_1725015.jpg",
      "title": "Roger Kidd / Stratford-upon-Avon Canal, Solihull Lodge",
      "caption": "The canal winding past Solihull Lodge. Here the canal passes by the gardens and 1960s housing built on the site of the old Pear Tree Farm. The northern part of the canal dates from 1790s and was built with wide boats in mind, but the original plans had to be revised, and by 1803 the canal was open from King's Norton to Kingswood, with narrow locks. A further delay occurred until 1812, when the route was extended to Stratford, and operating by 1815"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Clubhouse_by_the_Stratford-upon-Avon_Canal%2C_Earlswood_-_geograph.org.uk_-_1719123.jpg",
      "title": "Roger Kidd / Clubhouse by the Stratford-upon-Avon Canal, Earlswood",
      "caption": "Clubhouse by the canal, Earlswood. By the feeder from Earlswood Lakes,which enters the canal from the left, at Lady Lane Wharf, is the club house of the Earlswood Motor Yacht Club. Lady Lane Bridge (No 16) is further round the bend to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Stratford-upon-Avon_Canal_near_Warstock%2C_Birmingham_-_geograph.org.uk_-_1725127.jpg",
      "title": "Roger Kidd / Stratford-upon-Avon Canal near Warstock, Birmingham",
      "caption": "View near Warstock, Birmingham. This is the canal approaching Bridge No 5 which carries Yardley Wood Road between the Springfield and Warstock areas of Birmingham crosses the bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Shirley_Drawbridge_near_Solihull_-_geograph.org.uk_-_1724806.jpg",
      "title": "Roger Kidd / Shirley Drawbridge near Solihull",
      "caption": "Shirley Drawbridge near Solihull. The gentleman on the towpath is a boat crew member operating the bridge electrically from the control box. The Drawbridge public house is on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Stratford-upon-Avon_Canal_at_Dickens_Heath%2C_Solihull_-_geograph.org.uk_-_1720426.jpg",
      "title": "Roger Kidd / Stratford-upon-Avon Canal at Dickens Heath, Solihull",
      "caption": "Dickens Heath, Solihull. The canal is tree-lined here as the it skirts the northern edge of the modern housing at Dickens Heath. Open fields are to the right of the towpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Stratford-upon-Avon_Canal_at_Kingswood_Junction%2C_Warwickshire_-_geograph.org.uk_-_1712955.jpg",
      "title": "Roger Kidd / Stratford-upon-Avon Canal at Kingswood Junction, Warwickshire",
      "caption": "Kingswood Junction, Warwickshire. The channel to the left leads directly to the main Stratford-on-Avon Canal. Lock No 20 to the right is a bypass route allowing an extra lock up and down in the Lapworth Flight for boats to and from the Grand Union Canal (which is four hundred metres back from the camera). Vessels only using the Stratford Canal will use Lock No 21 of the flight. This arrangement seems fine for boats travelling down the locks at busy times, but when there are two queues ascending to Lock No 19 (by the white cottage), congestion and delays are likely."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Stratford-upon-Avon_Canal_near_Lapworth%2C_Warwickshire_-_geograph.org.uk_-_1715228.jpg",
      "title": "Roger Kidd / Stratford-upon-Avon Canal near Lapworth, Warwickshire",
      "caption": "Near Lapworth, Warwickshire Seen from under the arch of Bridge No 27, there is a winding hole here for the purpose of turning boats up to seventy feet long."
    }
  ],
  "distance_km": 42.0,
  "description": "Enjoy waterside cycling and walking on this 26 mile canal which runs from Stratford Upon Avon to Birmingham. The whole route can be walked while cyclists can enjoy the sections from Stratford Upon Avon to Wilmcote at one end and through the outskirts of Birmingham at the other. The route starts in the centre of Stratford Upon Avon and passes through a series of pretty villages before entering the outskirts of Birmingham and finishing in King's Norton. There's lots of pretty locks and some lovely Warwickshire countryside to enjoy. Around Solihull you'll pass close to Earlswood Lakes which is well worth a small detour. You'll also pass close to the lovely Baddesley Clinton. Here you will find a moated manor house surrounded by gardens and woodland. Near here there's also the option of visiting the tudor Packwood House. You could try our Lapworth Circular Canal Walk which visits both of these interesting properties. Also, around Kingswood the canal links up with the Grand Union Canal Walk so you can easily pick up another super canal trail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east of the village of Lapworth you will find the Boot Inn which has a fine canalside beer garden for the summer months. It's a great place to stop on your walk for refreshments in a picturesque location. You can find it on the Old Warwick Road at a postcode of B94 6JU for your sat navs. In Shirley there's the Drawbridge Inn which also has seating next to the canal. It's at postcode B90 1DD. The picturesque village of Wootton Wawen includes the ancient Bulls Head. The 17th century half timbered inn is located in a nice spot, opposite the Anglo Saxon church. The interior is full of olde worlde charm with old beams and open fires. Outside there's a lovely garden area for warmer days. You can find them at postcode B95 6BD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The waterside path makes for a pleasant walk with your dog. The Boot Inn, The Bulls Head and the Drawbridge Inn mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Wilmcote you could stop off to see the historic 16th century house of Shakespeare's mother at Mary Arden's Farm. There's a working tudor farm here with many rare breed animals to see. For more walking ideas in the area see the Warwickshire Walks and West Midlands Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7cDHhAMHI_o",
  "district": "Stratford-on-Avon",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bridgefoot, Stratford-upon-Avon, Stratford-on-Avon, Warwickshire, England, CV37 6YY, United Kingdom",
  "postcode": "CV37 6YY",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "canal",
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "manor house",
    "canal trails"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}