{
    "created_at": "2025-01-06T10:56:43.840102+00:00",
    "objectID": "00627f96ea5b07949800e4e899bb2fdc",
    "ref": "belfast-walking-route",
    "title": "Belfast City, Rivers, Parks and Woods Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1d/The_Ormeau_Bridge%2C_Belfast_-_geograph.org.uk_-_980269.jpg",
    "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/00627f96ea5b07949800e4e899bb2fdc.gpx",
    "_geoloc": {
        "lat": 54.5938748894,
        "lng": -5.916701178
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/The_Ormeau_Bridge%2C_Belfast_-_geograph.org.uk_-_980269.jpg",
            "title": "Ross, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "The Ormeau Bridge, Belfast Bridge over the River Lagan in Belfast. The bridge carries the Ormeau Road, a main arterial route in and out of the city, over the river and is usually extremely busy at rush hour."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Ormeau_Park%2C_Belfast_%2813%29_-_geograph.org.uk_-_2120344.jpg",
            "title": "Ormeau Park, Belfast (13) by Albert Bridge, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Autumn leaves in Ormeau Park in 2010."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Pergolas%2C_Botanic_Gardens%2C_Belfast_%282%29_-_geograph.org.uk_-_901855.jpg",
            "title": "Albert Bridge / Pergolas, Botanic Gardens, Belfast (2)",
            "caption": "Pergolas, Botanic Gardens, Belfast. Pergolas in the rose garden."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Tree%2C_Belvoir_-_geograph.org.uk_-_667205.jpg",
            "title": "Ross, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "A tree on the edge of Belvoir Forest Park"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Spring_verge%2C_Lagan_towpath._-_geograph.org.uk_-_1315771.jpg",
            "title": "Albert Bridge / Spring verge, Lagan towpath.",
            "caption": "Spring verge, Lagan towpath. Cow parsley (or a member of the family) growing, in profusion, by the Lagan towpath between Stranmillis and Newforge."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Mickey_Taylor%27s_Lock%2C_Lagan_Navigation_-_geograph.org.uk_-_1087656.jpg",
            "title": "Sue Adair / Mickey Taylor's Lock, Lagan Navigation",
            "caption": "Mickey Taylor's Lock, Lagan Navigation Here the canal splits from the River Lagan and the small bridge links the towpath to the island. The lock was named Mickey Taylor's after one of the lock-keepers."
        }
    ],
    "distance_km": 18.0,
    "description": "This walk takes you on a tour of the best parks, woodland and rivers in around the city centre of Belfast. The walk starts on the River Lagan and follows the Lagan Towpath south to Ormeau Park. The park is the oldest municipal park in Belfast, having been originally opened in 1871. There's nice tree-lined paths and pretty gardens to admire in this popular park. After strolling around Ormeau Park you continue south along the river to the Belfast Botanical Gardens. The 19th century public park contains a wonderful Palm House conservatory with a cool wing and a tropical wing. There's also the Tropical Ravine House, rose garden and a fine statue of Belfast born Physicist Lord Kelvin. The towpath continues south to Belvoir Park Forest. The woods have a number of waymarked trails to try with lots of woodland wildlife to look out for. The park is somewhat unusual as it is rare to find a working forest within a city. The path continues through Lagan Meadows and Clement Wilson Park before coming to the splendid Lagan Valley Regional Park. Here you will find wet meadows, ponds, mixed beech woodland and attractive parkland set next to the river. The route continues along the river, passing Newforge cricket ground and the village of Edenderry before coming to Lady Dixon Park. The expansive 128 acre park park consists of meadows, woodland and gardens with a number of well laid out footpaths to follow. Other features in the park include the 19th century Wilmont House, arboretum, the Azalea Walk, fountains, a walled garden and a delightful a Japanese-style garden with pretty water features. To further extend your walk you can continue along the Lagan Towpath to Lisburn. There are lots of other nice walks to try in and around Belfast. You could visit Belfast Castle, Cave Hill Country Park and Redburn Country Park where you can enjoy great views over the city and Belfast Harbour. There's also the excellent Comber Greenway walking and cycle route. The route runs along a disused railway line between Belfast and Comber with great views of Stormont and Scrabo Tower .",
    "details": [
        {
            "subtitle": "Further Information and Other Local Ideas",
            "content": "On the western side of the city there's the popular climb to Black Mountain. The National Trust owned area includes a series of waymarked trails taking you to a splendid summit viewpoint. There's excellent views over Belfast to the coast and beyond from this elevated spot. For more walking ideas in the area see the Northern Ireland Walks page."
        }
    ],
    "video_url": "https://www.youtube.com/embed/ewXC2w1wL1w",
    "gazetteer_found": false,
    "nominatim_found": true,
    "display_address": "Allstate Northern Ireland, 10, May's Meadow, Short Strand, Markets, Belfast, County Antrim, Northern Ireland / Tuaisceart Éireann, BT1 3PH, United Kingdom",
    "postcode": "BT1 3PH",
    "district": "Belfast",
    "county": "County Antrim",
    "region": null,
    "state": "Northern Ireland / Tuaisceart Éireann",
    "country": "United Kingdom",
    "llama_cpp": true,
    "estimated_duration": "2-3 hours",
    "difficulty": "moderate",
    "terrain": ["woodland", "parkland", "meadow"],
    "points_of_interest": [
        "historical site",
        "gardens",
        "park",
        "conservatory",
        "arboretum",
        "water features"
    ],
    "facilities": [
        "visitor center",
        "car park",
        "footpath",
        "Japanese-style garden"
    ],
    "route_type": "circular",
    "activities": ["walking"]
}
