{
  "created_at": "2025-01-06T03:10:52.105063+00:00",
  "objectID": "006350ef483637495e86b5971a08b72e",
  "ref": "hollingworth-lake-walking-route",
  "title": "Hollingworth Lake Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/88/Hollingworth_Lake%2C_Littleborough_-_geograph.org.uk_-_343367.jpg",
  "nearby": [
    {
      "description": "South Pennine Water Trail",
      "objectID": "6147ef1e7b39108125ecf773eddcd3e4",
      "ref": "south-pennine-water-trail-walking-route"
    },
    {
      "description": "Ogden Reservoir and Piethorne Reservoir",
      "objectID": "d7385faea1a365c334930600c84e24c9",
      "ref": "ogden-reservoir-and-piethorne-reservoir-walking-route"
    },
    {
      "description": "Rochdale Canal",
      "objectID": "9e315fd68b82273b696b35909c3a558e",
      "ref": "rochdale-canal-walking-and-cycle-route"
    },
    {
      "description": "Rochdale Way",
      "objectID": "f0350cc1f52366c4210e708214fe00ce",
      "ref": "rochdale-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/006350ef483637495e86b5971a08b72e.gpx",
  "_geoloc": {
    "lat": 53.6311504706,
    "lng": -2.1023360062
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Hollingworth_Lake%2C_Littleborough_-_geograph.org.uk_-_343367.jpg",
      "title": "michael ely / Hollingworth Lake, Littleborough, via Wikimedia Commons",
      "caption": "Looking across the lake from the visitor facilities at SD937147. The white building is The Winery pub/restaurant at the junction of Hollingworth Road and Rakewood Road 500 metres away. Above the pub construction work at Cleggswood is underway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Hollingworth_Lake_-_geograph.org.uk_-_365272.jpg",
      "title": "R lee / Hollingworth Lake, via Wikimedia Commons",
      "caption": "Nice view of the footpath running along the lake. Hollingworth was originally built as the main water source for the Rochdale Canal, but developed as a tourist resort from the 1860s. Several hotels were built as the emergence of the railway brought tourists from the nearby cities of Manchester, Bradford and Leeds to the scenic spot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Nature_Reserve_at_Hollingworth_Lake_-_geograph.org.uk_-_1132169.jpg",
      "title": "michael ely / Nature Reserve at Hollingworth Lake, via Wikimedia Commons",
      "caption": "Nature Reserve at Hollingworth Lake. View from Rakewood Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Hollingworth_Lake_-_geograph.org.uk_-_680042.jpg",
      "title": "Mick Garratt / Hollingworth Lake, via Wikimedia Commons",
      "caption": "The south eastern tip of this reservoir has been made into a nature reserve. Sailboat on the water in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Nature_Reserve_at_Hollingworth_Lake_-_geograph.org.uk_-_1132169.jpg",
      "title": "michael ely / Nature Reserve at Hollingworth Lake",
      "caption": "Nature Reserve at the south eastern end of the lake. View from Rakewood Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Equine_traffic_-_geograph.org.uk_-_4951523.jpg",
      "title": "Equine traffic by Jonathan Wilkins, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Equine traffic. Horse riders on the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Dam_Wall%2C_Hollingworth_Lake_-_geograph.org.uk_-_680030.jpg",
      "title": "Mick Garratt / Dam Wall, Hollingworth Lake",
      "caption": "Dam Wall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Geese_at_Hollingworth_Lake_-_geograph.org.uk_-_2326785.jpg/512px-Geese_at_Hollingworth_Lake_-_geograph.org.uk_-_2326785.jpg",
      "title": "Geese at Hollingworth Lake by Peter Whatley, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Geese at the lake. Hundreds of species of bird have been spotted around the lake. Look out for tufted duck or goosander in the winter and great-crested grebes performing their courting ritual in the spring months."
    }
  ],
  "distance_km": 3.0,
  "description": "Enjoy a lovely circular walk around this 130 acre reservoir in Littleborough. There is some beautiful scenery surrounding the lake and a nature reserve with a bird hide. You can also try kayaking and windsurfing on the lake with equipment available for hire. The Rochdale Way walking route passes through the park so there is scope for continuing your walk. The Rochdale Canal also passes near the lake so you could continue your waterside exercise along the towpath. The circular South Pennine Water Trail also takes in the lake, the canal and the Ealees Valley. It's a great way to explore this attractive area of the South Pennines. If you head south from the lake you will soon come to the lovely Ogden Reservoir and Piethorne Reservoir. There's a nice circular trail around the reservoirs with great views over the Piethorne Valley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Right next to the lake is the splendid Wine Press. This contemporary British Restaurant includes a lovely outdoor seating area where you can enjoy fine views over the lake with your lunch. There's also an attractive modern interior for cooler days. There's also a couple of fantastic old pubs with great views to the north east of the lake. The White House is located next to Blackstone Edge Reservoir and an inn of some note. The remote pub is in a fabulous location in an elevated position on the Halifax Road with panoramic views of the surrounding moors and Hollingworth Lake far below. It also has a wonderful history being originally an old coaching house dating from 1671. It is situated 1,300 feet above sea level and includes an outdoor seating area where you can relax on warmer days. The pub has an extensive menu and a nice cosy interior. You can find it at postcode OL15 0LG for your sat navs. Just up the road is the Moorcock Inn, located at the foot of the Pennines in Littleborough. There's more great countryside views from the garden area with home-made food and fine real ales on tap. It's also located on the Halifax Road at postcode OL15 0LD."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake is a lovely place for a dog walk and the Wine Press pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you'd like to visit by public transport then Smithy Bridge railway station is located just to the west of the lake. You can also catch a bus from Rochdale and Littleborough."
    }
  ],
  "video_url": "https://www.youtube.com/embed/-vklRiuFdd0",
  "postcode": "OL15 0DN",
  "district": "Rochdale",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beach Hotel Carpark, Lake Bank, Dearnley, Smithy Bridge, Rochdale, Greater Manchester, England, OL15 0DN, United Kingdom",
  "county": null,
  "state": "England"
}