{
  "created_at": "2025-01-06T00:02:03.532282+00:00",
  "objectID": "00e08e7d638102af21c188d30538defc",
  "ref": "gara-point-yealm-estuary-walking-route",
  "title": "Gara Point Yealm Estuary Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Gara_Point_-_geograph.org.uk_-_703344.jpg",
  "nearby": [
    {
      "description": "Wembury Point",
      "objectID": "e1fb225095debbbb6595f33e72fceb82",
      "ref": "wembury-point-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Yealmpton",
      "objectID": "526598b7d42afce0db5a9bcb98b66b43",
      "ref": "yealmpton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/00e08e7d638102af21c188d30538defc.gpx",
  "_geoloc": {
    "lat": 50.3011206899,
    "lng": -4.0497864601
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Gara_Point_-_geograph.org.uk_-_703344.jpg",
      "title": "Derek Harper / Gara Point",
      "caption": "Gara Point. Above this headland the coast path, from which the photo was taken, swings north towards the Yealm estuary. On the right of the photo is The Great Mew Stone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Boats_on_the_Yealm_-_geograph.org.uk_-_705178.jpg",
      "title": "Derek Harper / Boats on the Yealm",
      "caption": "Boats on the Yealm. Seen through a gap in the trees from Passage Road which runs along the Yealm and Newton Creek."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Warren_Cottages_across_the_Yealm_-_geograph.org.uk_-_704550.jpg/256px-Warren_Cottages_across_the_Yealm_-_geograph.org.uk_-_704550.jpg",
      "title": "Derek Harper / Warren Cottages across the Yealm",
      "caption": "Warren Cottages across the Yealm. Looking from the access woodland in Passage Wood across the Yealm to the cottages on Warren Point, past moored yachts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/River_Yealm_in_Rough_Torrs_-_geograph.org.uk_-_295482.jpg/256px-River_Yealm_in_Rough_Torrs_-_geograph.org.uk_-_295482.jpg",
      "title": "Derek Harper / River Yealm in Rough Torrs",
      "caption": "River Yealm in Rough Torrs. The Yealm, only half a mile from its tidal estuary, races through a wooded valley below Yealmpton. Rough Torrs is the wood on the left (photo taken from a permissive footpath) and Western Torrs is on the right bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Creekside_cottages%2C_Newton_Ferrers_-_geograph.org.uk_-_705247.jpg",
      "title": "Derek Harper / Creekside cottages, Newton Ferrers",
      "caption": "Creekside cottages, Newton Ferrers. Taken from Pope's Quay below the Swan Inn at Noss Mayo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Coastguard_cottages%2C_Noss_Mayo_-_geograph.org.uk_-_703950.jpg",
      "title": "Derek Harper / Coastguard cottages, Noss Mayo",
      "caption": "Coastguard cottages, Noss Mayo. Shadows cast by trees alongside the coast path spread across a field in front of the terrace of three former coastguard cottages. The path, following Lord Revelstoke's carriage drive, takes a broad sweep around the little valley to maintain its contour."
    }
  ],
  "distance_km": 5.5,
  "description": "This circular coastal walk near Newton Ferrers visits Gara Point with wonderful views over the Yealm Estuary. The walk starts from the National Trust car park at Warren and follows the South West Coast Path to Gara Point, passing Blackstone Point SSI on the way. It's a lovely spot with wildflowers, green fields, gorse and wonderful views to Wembury Bay, Plymouth Sound and the Mewstone. From Gara Point you head towards Cellar Beach which you can visit by climbing down some steps. You then start a short woodland section through the Brakehill Plantation, a 19th-century woodland of ash, chestnut, sycamore, beech and oaks. You continue through more woodland towards Noss Mayo with great views over the Yealm River and Newton Ferrers. The final section heads inland through the countryside on a mixture of country lanes and footpaths, returning you to the car park. If you'd like to continue your walking in the area then you could head to the nearby Wembury Point .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Yealmpton you could enjoy some refreshment at the Rose and Crown. There's a cosy interior here with a roaring fire and a sun trap garden outside. They have a restaurant selling high quality food and also provide accommodation if you'd like to stay in the area. You can find them on Market Street at postcode PL8 2EB for your sat navs. The pub is dog friendly if you have your four legged friend with you. In the village you can also visit the 400 year old Mother Hubbard's Cottage. The lady from the nursery rhyme lived in the cottage when working as the housekeeper at Kitley House."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Kw1zGT08wn8",
  "postcode": "PL8 1EL",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}