{
  "created_at": "2025-01-05T23:40:57.382953+00:00",
  "objectID": "00eb16ae55dfd48a44fd7538496a24d7",
  "ref": "sticklepath-walking-route",
  "title": "Sticklepath Walks - Cosdon Hill",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5d/River_Taw%2C_Sticklepath_-_geograph.org.uk_-_1092476.jpg",
  "nearby": [
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Tarka Trail",
      "objectID": "8b354e6c74d8f24e714c2780ff9d8a4a",
      "ref": "tarka-trail-walking-route"
    },
    {
      "description": "Taw Teign Link",
      "objectID": "5d30dc7142157475b4b1f5051b0a91bf",
      "ref": "taw-teign-link-walking-route"
    },
    {
      "description": "High Willhays",
      "objectID": "df3dc9033248db991780140c286d884b",
      "ref": "high-willhays-walking-route"
    },
    {
      "description": "Yes Tor",
      "objectID": "f3c1de54ee45a5150778c51094af7d3b",
      "ref": "yes-tor-walking-route"
    },
    {
      "description": "Belstone",
      "objectID": "afc066de913f2f1444888e116dc31b10",
      "ref": "belstone-walking-route"
    },
    {
      "description": "Scorhill Stone Circle",
      "objectID": "8fe91fd19baadf3701a0c727c44b575b",
      "ref": "scorhill-stone-circle-walking-route"
    },
    {
      "description": "South Zeal",
      "objectID": "c07864ec5163947093f285a705f98217",
      "ref": "south-zeal-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/00eb16ae55dfd48a44fd7538496a24d7.gpx",
  "_geoloc": {
    "lat": 50.7297365652,
    "lng": -3.9229466007
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/River_Taw%2C_Sticklepath_-_geograph.org.uk_-_1092476.jpg",
      "title": "Richard Dorrell / River Taw, Sticklepath",
      "caption": "River Taw, Sticklepath. The footbridge is part of a signposted circular walk from the village to Belstone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Millennium_memorial%2C_Sticklepath_-_geograph.org.uk_-_1092444.jpg",
      "title": "Richard Dorrell / Millennium memorial, Sticklepath",
      "caption": "Millennium memorial, Sticklepath. The plaque on the right reads: \"Sticklepath 2000 by the village for the village\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Two_paths%2C_Ramsley_Hill_-_geograph.org.uk_-_990161.jpg",
      "title": "Derek Harper / Two paths, Ramsley Hill",
      "caption": "Two paths, Ramsley Hill. These paths cross the southwestern area of a grassy area of the hill - most of the hill, especially the steeper edges, is dominated by bracken and bramble. The hill has no officially numbered rights of way across it, but is nonetheless crossed by the Dartmoor Way and the Taw-Teign Link, which appear to share the path I was following when I took this. Seen in late sunlight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Towards_South_Tawton_from_Ramsley_Hill_-_geograph.org.uk_-_990197.jpg",
      "title": "Derek Harper / Towards South Tawton from Ramsley Hill",
      "caption": "Towards South Tawton from Ramsley Hill. A path descends from the top of Ramsley Hill between high bracken and bramble. The elements in the middle distance are in SX6594, including the tower of South Tawton church. In the distance is North Tawton, Taw Valley Creamery, about 8 km away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Fields_above_Nine_Stones_-_geograph.org.uk_-_990063.jpg",
      "title": "Derek Harper / Fields above Nine Stones",
      "caption": "Fields above Nine Stones. Just the first and second walls crossing the hillside below the camera are in square. The white house, Hedgeways, is in SX6592, and the woods and fields beyond extend across that square and into SX6692. The view is from South Tawton Bridleway 21 close to the moorland edge above the remaining field boundaries"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Dartmoor_ponies._%2843613314294%29.jpg/256px-Dartmoor_ponies._%2843613314294%29.jpg",
      "title": "Aidan Sammons from Birmingham, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Dartmoor ponies just east of Cosdon Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/White_Moor_Stone_-_geograph.org.uk_-_1495039.jpg",
      "title": "Guy Wareham / White Moor Stone",
      "caption": "White Moor Stone. A boundary stone for Dartmoor Forest, South Tawton and Throwleigh parishes. 150 metres south-east of the Little Hound Tor stone circle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Wall_corner_on_Cosdon_Hill_-_geograph.org.uk_-_996872.jpg",
      "title": "Derek Harper / Wall corner on Cosdon Hill",
      "caption": "Wall corner on Cosdon Hill. The corner of this wall represents the limit of improved land on the slopes of Cosdon Hill; beyond is unimproved moorland. South Tawton Bridleway 21 continues up to the right into the moor."
    }
  ],
  "distance_km": 11.0,
  "description": "The village of Sticklepath is located in a lovely spot on the River Taw in the north eastern section of Dartmoor National Park. There's fine riverside trails, woodland paths and a splendid climb to a prominent local hill. This circular walk from the village visits two local viewpoints in the shape of Ramsley Hill and Cosdon Hill. You'll also visit the neighbouring village of South Zeal and the stone circle at Little Hound Tor. There's fantastic views and you should see some Dartmoor ponies on the way too. The walk starts from the public car park in the village, next to the River Taw. From here you can pick up the Dartmoor Way and follow the waymarked trail south east through South Zeal. The route then turns south to climb up to the viewpoint at Ramsley Hill. You continue south to Cheriton Combe before climbing up to the stone circle at Little Hound Tor. Here you turn north to cross South Tawton Common before coming to the summit point at Cosdon Hill. The hill is also known as Cawsden Beacon and rises to a height of 550 metres (1,800 ft). As such it is one of the highest hills on Dartmoor. From this elevated spot there are excellent views over Dartmoor to the coast at Teignmouth and Start Point. From the hill top you descend north to arrive back in Sticklepath.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Oxenham Arms is a good choice for a pit stop in the village of South Zeal. The pub has an interesting history having originally been a 12th-century monastery. It has a charming interior with low beams, flagstone floors and open fires. Outside there's a nice garden area for warmer weather. You can find them at postcode EX202JT for your sat navs. The pub also has a car park and is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles west of the hill you'll find another great climb to Yes Tor and High Willhays. The hill is the highest on Dartmoor at 621 metres (2,039 feet) above sea level. Head west along the river and you will pass through the pretty Belstone Cleave to the neighbouring village of Belstone. Here you can pick up the Belstone Walk and enjoy a climb to Watchet Hill and Belstone Tor for more great views. The village is also very attractive with thatched cottages and a fine pub with a large outdoor area. Just to the south you'll find the noteworthy href='/routes/home.nsf/RoutesLinksWalks/scorhill-stone-circle-walking-route'>Scorhill Stone Circle. The site is an English Heritage scheduled monument and has been described as Devon's finest, most intact stone circle. There's also the ancient Wallabrook Clapper Bridge to visit in this area. For more walking ideas in the area see the Dartmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/MO7sV8fptB0",
  "postcode": "EX20 2NR",
  "district": "West Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sticklepath, West Devon, Devon, England, EX20 2NR, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "viewpoints",
    "stone circle"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}