{
  "created_at": "2025-01-06T05:21:50.246663+00:00",
  "objectID": "01175d7ec59c336e651fac4a4ba7489c",
  "ref": "grewelthorpe-walking-route",
  "title": "Grewelthorpe Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/87/Part_of_Grewelthorpe_-_geograph.org.uk_-_107342.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/01175d7ec59c336e651fac4a4ba7489c.gpx",
  "_geoloc": {
    "lat": 54.1794422791,
    "lng": -1.6450104573
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Part_of_Grewelthorpe_-_geograph.org.uk_-_107342.jpg",
      "title": "Chris Heaton / Part of Grewelthorpe, via Wikimedia Commons",
      "caption": "Part of Grewelthorpe. This the main street at the northern end of this large village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/The_Duck_Pond%2C_Grewelthorpe_-_geograph.org.uk_-_77659.jpg",
      "title": "Uncredited / The Duck Pond, Grewelthorpe, via Wikimedia Commons",
      "caption": "The Duck Pond, Grewelthorpe. Photo taken on a suitably rainy day, - when all the ducks were on the village green rather than in the pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Former_Hackfall_Inn%2C_Grewelthorpe_-_geograph.org.uk_-_638583.jpg",
      "title": "Gordon Hatton / Former Hackfall Inn, Grewelthorpe, via Wikimedia Commons",
      "caption": "Former Hackfall Inn, Grewelthorpe. This was the Hackfall Inn at the north end of the main village street until 1994. Now converted into a house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/The_River_Ure_-_geograph.org.uk_-_116750.jpg/256px-The_River_Ure_-_geograph.org.uk_-_116750.jpg",
      "title": "Peter Crump / The River Ure, via Wikimedia Commons",
      "caption": "The River Ure. Photographed from the northern shore, looking east, the River Ure twists its way through the Hackfall gorge deep in the woods. Popular with canoeists."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/View_from_Limehouse_Hill_-_geograph.org.uk_-_1222076.jpg",
      "title": "Peter Barr / View from Limehouse Hill, via Wikimedia Commons",
      "caption": "View from Limehouse Hill. The River Ure flows round this point; Masham Church can be seen in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/The_Ure_Valley_from_Mowbray_Point_-_geograph.org.uk_-_114131.jpg",
      "title": "Peter Crump / The Ure Valley from Mowbray Point, via Wikimedia Commons",
      "caption": "Autumnal trees in the Ure Valley from Mowbray Point. Looking NE from Mowbray Point, the path of the hidden River Ure can be discerned in the trees of Hackfall Wood below. Beyond, the Vale of York."
    }
  ],
  "distance_km": 6.3,
  "description": "This circular walk around Grewelthorpe uses the Ripon Rowel long distance trail to visit Hackfall Woods and the River Ure. The route runs for a distance of about 4 miles using a mixture of public footpaths and country lanes. You start the walk in the village and follow footpaths north east towards the river and the woods. Here you pick up the waymarked Ripon Rowel and follow it west into Hackfall Woods. The woods are a popular place with grottos, old temples, follies, waterfalls and riverside paths along the River Ure. You'll then climb to Limehouse Hill where there are splendid views of Masham Church, The Ruin and Mowbray Castle which was famously painted by Turner. After descending the hill the route follows more woodland paths back into Grewelthorpe.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Crown Inn in Grewelthorpe for some refreshments after your walk. The country pub is a popular draw for walkers coming from the woods. It has a good menu, a beer garden for fine days and is also very dog friendly. You can find it just to the south of the woods on Main Street in the pretty little village. Postcode is HG43BS for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to continue along the Ripon Rowel north into Masham. Here you'll find nice trails along the River Burn, the circular Masham Leaves Sculpture Walk and the splendid Swinton Estate with its deer park and expansive parkland. Just to the east you can visit the neighbouring village of West Tanfield. Here you'll find the 15th century Marmion Tower, a fine 17th century riverside pub and the lovely Nosterfield Nature Reserve."
    }
  ],
  "district": "Grewelthorpe",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Main Street, Wapping, Grewelthorpe, North Yorkshire, York and North Yorkshire, England, HG4 3BS, United Kingdom",
  "postcode": "HG4 3BS",
  "state": "England"
}