{
  "created_at": "2025-01-06T00:39:51.428899+00:00",
  "objectID": "015e5ff7eb509951ba5af68c1b3baec6",
  "ref": "skiddaw-walking-route",
  "title": "Skiddaw Circular Walk from Keswick Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/55/Skiddaw_-_geograph.org.uk_-_74759.jpg",
  "nearby": [
    {
      "description": "Dodd Wood",
      "objectID": "564c61ba625613481bfbfdf4b6748e0a",
      "ref": "dodd-wood-walking-route"
    },
    {
      "description": "Allerdale Ramble",
      "objectID": "641f71c34743ce206179b03c5da3b722",
      "ref": "allerdale-ramble-walking-route"
    },
    {
      "description": "Derwent Water",
      "objectID": "985a4a278a6fa78df33209bb1df4af97",
      "ref": "derwent-water-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/015e5ff7eb509951ba5af68c1b3baec6.gpx",
  "_geoloc": {
    "lat": 54.6033592661,
    "lng": -3.1432240271
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Skiddaw_-_geograph.org.uk_-_74759.jpg",
      "title": "Ron Shirt [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Skiddaw. Ascending Grisedale Pike looking over the Plantation towards Skiddaw"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Ullock_Pike_from_Skiddaw_-_geograph.org.uk_-_24054_%28cropped%29.jpg",
      "title": "paul birrell / Ullock Pike from Skiddaw, via Wikimedia Commons",
      "caption": "Ullock Pike from Skiddaw"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Plaque_on_top_of_Skiddaw_-_geograph.org.uk_-_11360.jpg",
      "title": "Andy Beecroft / Plaque on top of Skiddaw, via Wikimedia Commons",
      "caption": "Toposcope on top of Skiddaw"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/View_From_NW_edge_of_Skiddaw_Summit_-_geograph.org.uk_-_35128.jpg",
      "title": "Alan Stewart / View From NW edge of Skiddaw Summit, via Wikimedia Commons",
      "caption": "View From NW edge of Skiddaw Summit. A cold, windy and cloudy Skiddaw summit suddenly cleared to provide this view of Bassenthwaite Lake."
    }
  ],
  "distance_km": 21.0,
  "description": "This is the popular Skiddaw circular walk from Keswick in the Lake District National Park. It's a challenging route, running for almost 13 miles, and reaching a height of over 3000ft at the high points. Skiddaw is the 4th highest mountain in England and is a popular climb with hill walkers. This route makes use of the Allerdale Ramble way-marked walking trail so is well defined and easy to follow. The route starts from the town of Keswick at the northern end of the beautiful Derwent Water. From here you can pick up the Allerdale Ramble and head north east to Ormathwaite, Applethwaite and Millbeck where there are some pretty waterfalls. The path then heads to Carl Side before the final steep climb to the summit of Skiddaw which stands at a height of 931 m (3,054 ft). Here you will find several cairns and a number of stone windshelters. The views are magnificent - you can see the Cheviots, North Pennines, Yorkshire Dales, Forest of Bowland, the Isle of Arran, the Isle of Man and the Mourne Mountains of Northern Ireland on a clear day. After taking in the views you then descend to Longside Edge and Ullock Pike before a woodland stretch through Thornthwaite Forest takes you to the River Derwent. You then follow the lovely riverside path back into Keswick. The walk can be extended by heading into Dodd Wood near Millbeck. The Allerdale Ramble passes through the wood where you can climb to Dodd Fell summit for great views over Bassenthwaite Lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Next to Dodd Wood at Bassenthwaite is the excellent Old Sawmill Tearoom. The delightful tearoom was originally a working sawmill until 1970 and it was converted to its present use in 1981. The walls are hung with saws and the original saw blade is still here. You can read about the local history of Dodd Wood and the Mirehouse estate while you enjoy morning coffee, light lunch or afternoon tea. The wood burning stove is stoked up in the colder months, and in summer picnic tables overlook Bassenthwaite Lake. The tea room is wonderfully positioned at the foot of Dodd Fell just to the east of Mirehouse."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's some interesting sites to explore next to Bassenthwaite Lake if you have time. Firstly there's the historic St Bega’s Church. The church dates from pre-Norman times and includes a 14th century lead crucifix and a font dating from 1300. The tranquil church is well worth a visit if you have time. A booklet describing the history of the church can be obtained from the Dodd Wood Old Sawmill Tearoom.   Pictured above, the church and chuchyard of the historic St Begas Church. The church is located in the grounds of the lovely Mirehouse and Gardens. Mirehouse was owned by the Spedding family, who regularly entertained the likes of Thomas Carlyle, Edward Fitzgerald and Lord Tennyson. It was named 2017 visitor attraction of the year at the Cumbria Tourism Awards. On the site you can explore the historic house, stroll the picturesque gardens and visit the lakeshore and woodland playgrounds. There's a number of walks with a Family Nature Trail, a woodland trail with Scots Pine and a Poetry Walk. This uses a section of the terraced garden known as “Canada” and is an ongoing commemoration of the unique literary connections that Mirehouse has had over the years. Just above the house is a viewpoint where you can look out for Osprey soaring above the lake.  Pictured above left, Mirehouse. On the right the stunning view to the SW from the Osprey viewpoint which sits above the Mirehouse car park. You can see red squirrels here, as well as many different species of birds. There are mounted telescopes provided which are very powerful. On the western side of the lake there's the circular walk to Sale Fell to try. The area near the fell also includes the 17th century Pheasant Inn, one of the oldest inns in the Lake District."
    }
  ],
  "video_url": "https://www.youtube.com/embed/lAUznfvzVu8",
  "postcode": "CA12 5NX",
  "district": "Keswick",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Bridge Cafe, High Hill, Keswick, Cumberland, England, CA12 5NX, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "hard",
  "terrain": [
    "mountain",
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "viewpoints",
    "summit"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}