{
  "created_at": "2025-01-06T04:04:55.276094+00:00",
  "objectID": "0179c28fe9501d77bf1e0f061a58d2f1",
  "ref": "nantlle-ridge-walking-route",
  "title": "Nantlle Ridge Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/99/Nantlle_Ridge_-_geograph.org.uk_-_51710.jpg",
  "nearby": [
    {
      "description": "Beddgelert Forest",
      "objectID": "79408560b5023c17d7833728dd8cfc14",
      "ref": "beddgelert-forest-walking-and-cycle-route"
    },
    {
      "description": "Y Garn",
      "objectID": "fb8df352dd634eee8b60306c04953139",
      "ref": "y-garn-walking-route"
    },
    {
      "description": "Cwm Pennant",
      "objectID": "101c57139b72105af142946173a4a54b",
      "ref": "cwm-pennant-walking-route"
    },
    {
      "description": "Mynydd Mawr",
      "objectID": "d35bcfbb7a78443b186645a78dd217b6",
      "ref": "mynydd-mawr-walking-route"
    },
    {
      "description": "Llyn Nantlle Uchaf",
      "objectID": "fe1cd93cc63f0e247ae430f5c0f533d5",
      "ref": "llyn-nantlle-uchaf-walking-route"
    },
    {
      "description": "Llyn Peris",
      "objectID": "ca70a38f622f4448658bbec70dd68416",
      "ref": "llyn-peris-walking-route"
    },
    {
      "description": "Lon Gwyrfai",
      "objectID": "f01c086ea7c11c18edd4f748c6e47fb8",
      "ref": "lon-gwyrfai-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0179c28fe9501d77bf1e0f061a58d2f1.gpx",
  "_geoloc": {
    "lat": 53.0544917873,
    "lng": -4.1362261499
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Nantlle_Ridge_-_geograph.org.uk_-_51710.jpg",
      "title": "Tom Stringer / Nantlle Ridge, via Wikimedia Commons",
      "caption": "Nantlle Ridge. Viewed north towards Mynydd Drws-y-coed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Spur_off_Nantlle_Ridge_-_geograph.org.uk_-_51670.jpg",
      "title": "Tom Stringer / Spur off Nantlle Ridge, via Wikimedia Commons",
      "caption": "Spur heading south east from Trum y Ddysgl leading off Nantlle Ridge towards Beddgelert Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Start_of_Nantlle_Ridge_-_geograph.org.uk_-_1348333.jpg",
      "title": "Dave Dunford / Start of Nantlle Ridge, via Wikimedia Commons",
      "caption": "Start of Nantlle Ridge The ascent of Mynydd Drws y Coed, viewed from near the summit of Y Garn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Moel_yr_Ogof%2C_Moel_Lefn%2C_and_the_Nantlle_Ridge_-_geograph.org.uk_-_72485.jpg",
      "title": "David Crocker / Moel yr Ogof, Moel Lefn, and the Nantlle Ridge, via Wikimedia Commons",
      "caption": "Moel yr Ogof, Moel Lefn, and the ridge. Clouds drift across the distant Nantlle Ridge here viewed from the summit of Moel Hebog. The nearer summit is Moel yr Ogof, with Moel Lefn behind. The NW edge of Beddgelert Forest can just be seen on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Walking_up_the_Ridge_-_geograph.org.uk_-_690259.jpg",
      "title": "Dave Croker / Walking up the Ridge, via Wikimedia Commons",
      "caption": "Walking up the Ridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Along_the_Nantlle_ridge_from_Mynydd_Tal-y-Mignedd_-_geograph.org.uk_-_1348445.jpg",
      "title": "Dave Dunford / Along the Nantlle ridge from Mynydd Tal-y-Mignedd, via Wikimedia Commons",
      "caption": "Along the ridge from Mynydd Tal-y-Mignedd. View southeastwards from the obelisk on Mynydd Tal-y-Mignedd along the Nantlle ridge, next objective Craig Cwm Silyn, the highest point on the ridge and just into the clouds at 734m."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Rock_feature_on_the_ridge_-_geograph.org.uk_-_690252.jpg/256px-Rock_feature_on_the_ridge_-_geograph.org.uk_-_690252.jpg",
      "title": "Dave Croker / Rock feature on the ridge, via Wikimedia Commons",
      "caption": "Rock feature on the ridge. The lake in the distance is Llyn Nantlle Uchaf"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Saddle_between_Trym_y_Ddysgl_and_Mynydd_Tal-y-Mignedd_-_geograph.org.uk_-_1348406.jpg",
      "title": "Dave Dunford / Saddle between Trym y Ddysgl and Mynydd Tal-y-Mignedd, via Wikimedia Commons",
      "caption": "Saddle between Trym y Ddysgl and Mynydd Tal-y-Mignedd Impressive mountain scenery on the Nantlle Ridge. The narrow section looks scarier than it is. The summit with the obelisk is Mynydd Tal-y-Mignedd (653m); the higher summit to the left is Craig Cwm Silyn (734m), the highest point on the Nantlle Ridge. The Rivals (Yr Eifl) on the Lleyn peninsula are visible in the distance."
    }
  ],
  "distance_km": 14.0,
  "description": "This popular circular walk explores the Nantlle Ridge range of mountains in the Snowdonia National Park. You'll visit a series of imposing peaks with magnificent views over Snowdonia. The scenery is breathtaking as you make your way along one of the finest ridge walks in Britain. The walk starts from the village of Rhyd Ddu and heads to the first peak of Y Garn which is only about a mile away. At the 633 m (2,077 ft) Y Garn summit you will find a rocky plateau, steep cliffs and cairns. The route continues to the next peak on the ridge - Mynydd Drws-y-Coed. This exposed peak requires a degree of scrambling to reach the 695 m (2,280 ft) summit. From here you climb to the second highest peak on the ridge, Trum y Ddysgl. From the 709 m (2,326 ft) summit you can enjoy wonderful views of Mynydd Mawr , Yr Wyddfa and Moel Hebog. The route then descends to the next peak of Mynydd Tal-y-Mignedd, a subsidiary summit of Trum y Ddysgl. Here you will find a large stone obelisk, put up to commemorate Queen Victoria's Diamond Jubilee. Continuing south west you come to the highest point on the Nantlle Ridge, Craig Cwm Silyn. From the 734 m (2,408 ft) summit there are wonderful 360 panoramic views of the area. The other peaks on the ridge are Garnedd Goch Mynydd Graig Goch. They are a few miles west of Craig Cwm Silyn and not visited on this walk. From Craig Cwm Silyn you descend to Cwm Trwsgl, passing a small reservoir and a quarry. The final section then takes you through the attractive woodland of Beddgelert Forest before returning to Rhyd Ddu.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Cwellyn Arms in Rhyd Ddu is the ideal place to enjoy a rest and a meal after your exercise. There are two cosy lounge areas with “real fires”, which are dog friendly. You can also relax and enjoy homemade food in the 40 seater restaurant with underfloor heating and log burning stove. The inn provides accommodation so is a good choice if you would like to stay over too. You can find it in the village at postcode LL54 6TL for your sat navs. The ridge is also located near to the popular village of Beddgelert where there are a number of good options for some post walk refreshments. We recommend heading to the Hebog Cafe & Bistro in the village centre next to the river. The food is excellent and there's also a lovely river terrace to sit out and enjoy the surrounding mountainous scenery in the summer months. You can find it in the centre of Beddgelert on Caernarfon Road, with postcode LL55 4UY for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the north east there's another popular climb to Y Garn. The route includes a pretty lake and the wonderful Cwm Idwal. In a Radio Times poll in 2005, Cwm Idwal was ranked the 7th greatest natural wonder in Britain. Just a few miles to the south there's the splendid Cwm Pennant to explore. This stunning valley has a number of walking trails with fine views of the Afon Dwyfor and the surrounding mountains to enjoy. In the village of Nantlle you can explore the Dorothea Quarry where you'll find the remains of the old mining houses and a series of scenic lakes including Lynn Nantlle. The quarry is one of the significant sites on the Snowdonia Slate Trail which runs through the area. The circular long distance trail can be used to visit several of the other historic mining areas located in the World Heritage Site. Heading north along the trail would take you to Dinorwic Quarry which was at one time the second largest slate quarry in the world. The quarry is located on the edge of Padarn Country Park where there are some lovely waterside trails along Llyn Padarn and Llyn Peris. For more walking ideas in the area see the Beddgelert Walks and the Snowdonia Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BNSk6rQrjFM",
  "postcode": "LL54 6TL",
  "district": null,
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cwellyn Arms, B4418, Rhyd-ddu, Betws Garmon, Gwynedd, Cymru / Wales, LL54 6TL, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "woodland"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "hiking"
  ]
}