{
  "created_at": "2025-01-06T07:52:27.957301+00:00",
  "objectID": "01df7b8ad63f4215515ecdc8438bdae7",
  "ref": "sandbach-walking-route",
  "title": "Sandbach Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Sandbach_-_Market_Crosses.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/01df7b8ad63f4215515ecdc8438bdae7.gpx",
  "_geoloc": {
    "lat": 53.145582548,
    "lng": -2.3596765183
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Sandbach_-_Market_Crosses.jpg",
      "title": "Roger Cornfoot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sandbach crosses. Erected in the 9th Century to commemorate the adoption of christianity by King Penda around 635AD"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/North_side_of_St_Mary%27s_church%2C_Sandbach_-_geograph.org.uk_-_1265083.jpg",
      "title": "Stephen Craven / North side of St Mary's church, Sandbach",
      "caption": "North side of St Mary's church. The two additions to the north aisle are the Vicar's vestry (foreground) and choir vestry (right of photo). The church is built on a low hill overlooking the Dingle Brook, the \"sandy stream\" that gave Sandbach its name."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Sandbach_Old_Hall.jpg",
      "title": "www fotodiscs4u co uk, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sandbach Old Hall. The fine exterior of this pub which dates from 1656."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Lock_No_66%2C_Trent_and_Mersey_Canal%2C_Wheelock%2C_Cheshire_-_geograph.org.uk_-_577556.jpg",
      "title": "Roger Kidd / Lock No 66, Trent and Mersey Canal, Wheelock, Cheshire",
      "caption": "Lock No 66, Trent and Mersey Canal, Wheelock, Cheshire. The A534 crosses the canal here. Temporarily, the lock chamber on the right is not in operation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Thurlwood_Steel_Lock_No_53%2C_Trent_and_Mersey_Canal_-_geograph.org.uk_-_601242.jpg",
      "title": "Dr Neil Clifton / Thurlwood Steel Lock No 53, Trent and Mersey Canal",
      "caption": "Thurlwood Steel Lock No 53, Trent and Mersey Canal 1981. One of the pair of Thurlwood Locks was selected as the subject of this experiment in modern lock construction, but it was not successful; the prototype remained the sole example, and by 1981 the steel lock was not in use and the parallel conventional lock had to be used. The steel lock was removed and cut up for scrap in 1988."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Obelisk%2C_Rode_Hall.jpg/256px-Obelisk%2C_Rode_Hall.jpg",
      "title": "Paul Brooker / Rode Hall Obelisk",
      "caption": "Obelisk and lake at Rode Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Rode_Hall_%28Ian_Greig%29.jpg/256px-Rode_Hall_%28Ian_Greig%29.jpg",
      "title": "Ian Greig / Rode Hall",
      "caption": "Rode Hall. View of the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Half-timbered_Houses_and_War_Memorial%2C_Sandbach._-_geograph.org.uk_-_129931.jpg",
      "title": "Colin Smith / Half-timbered Houses and War Memorial, Sandbach.",
      "caption": "Half-timbered Houses and War Memorial. Sandbach was a salt town, later silk and still has many old, interesting houses. The thatched Black Bear pub carries a date of 1634."
    }
  ],
  "distance_km": 17.0,
  "description": "This Cheshire based market town has an interesting history and a number of fine local walks to try. There's canalside paths, a local nature reserve, waymarked countryside trails and a fine old hall to explore in the immediate area. This walk from the town takes you along the Trent and Mersey Canal to the nearby Rode Hall. The hall is one of the highlights of the area with a beautiful lake and gardens to see. The walk starts in the pretty Sandbach Park in the town centre. The park is a lovely place for a stroll in the town centre, with woods, ponds, gardens and a nice big green. The route then heads south east to the Sandbach Crosses, one of the historical landmarks of the area. The Saxon stone crosses are located on the cobbled market square in the town centre Sandbach. The photogenic structures are carved with animals and Biblical scenes. You continue south west through the town to Wheelock where you can pick up the canal. Follow it east and it will take you past Malkin's Bank and a series of locks before coming to Thurlwood and Rode Hall. The handsome Georgian country house is surrounded by parkland and gardens. Highlights include a one mile lake and the popular Snowdrop Walks in February. In spring the herbaceous border comes to life, rhododendrons bloom and there are carpets of bluebells to see in the woodland. After exploring the hall the route returns to Sandbach on the same paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Hall is a historic pub of some note and a fine choice for some post walk refreshment. The Grade 1 listed pub dates from 1656 and was once the residence of the Lords of the Manor of Sandbach. There's a charming interior with historic features including wooden floors, beams and opens fires. There's also a light filled garden room which looks out upon a stone terrace. Outside there's a lovely rose garden where you can relax in warmer weather. You can find the inn just to the south of the park at a postcode of CW11 1AL for your sat navs. You can also stop off for afternoon tea at the tea rooms in Rode Hall. There's also a good menu with dishes made using organic ingredients from their kitchen garden. Plants and seasonal garden produce may also be purchased here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canal and parkland at Rode Hall make for a pleasant walk with your dog. You are asked to keep them on leads around the grounds of Rode Hall though. The Old Hall pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east of Rode Hall you will find Mow Cop. There's a well known 18th century folly here with excellent views over the area. The Trent and Mersey Canal is part of the Cheshire Ring Canal Walk which you can use to explore the canals of the county. If you follow the towpath west you can visit Elton Flashes Nature Reserve where there are a number of pools with lots of wildlife to see. Continue north along the canal and it will take you to Elworth, Moston and the neighbouring town of Middlewich. Around Wheelock you can pick up the Wheelock Rail Trail. This popular path is suitable for both walkers and cyclists. It runs for just over a mile between Malkin's Bank and Elworth along a flat surfaced path. It's a nice one to do if you fancy and easy stroll in the area. Not far from the eastern end of the trail you'll find a similar route along the Salt Line. This path will take you from Hassall Green to Alsager, passing the Borrow Pit Meadows nature reserve on the way. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/V7p1uagCrUQ",
  "postcode": "CW11 1FR",
  "district": "Sandbach",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dingle Lane, Sandbach Heath, Sandbach, Cheshire East, England, CW11 1FR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "canal",
    "parkland"
  ],
  "points_of_interest": [
    "historical landmarks",
    "country house",
    "lake",
    "gardens"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}