{
  "created_at": "2025-01-06T03:18:43.905543+00:00",
  "objectID": "01fa2339e39e63bb934e6ea4d656a0e6",
  "ref": "penarth-walking-route",
  "title": "Penarth Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Penarth_Pier_-_geograph.org.uk_-_836006.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/01fa2339e39e63bb934e6ea4d656a0e6.gpx",
  "_geoloc": {
    "lat": 51.4353234773,
    "lng": -3.1670157035
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Penarth_Pier_-_geograph.org.uk_-_836006.jpg",
      "title": "Colin Smith / Penarth Pier",
      "caption": "Penarth Pier. Sweeping northwards view of the pier and Cardiff in the distance - from Cliff Parade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Cliff_Parade_-_geograph.org.uk_-_835988.jpg",
      "title": "Colin Smith / Cliff Parade",
      "caption": "Cliff Parade. Clifftop lawns and viewfinder on a popular walk in Penarth which offers sweeping views across the mouth of the Severn to Somerset."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Beacon_at_Penarth_-_geograph.org.uk_-_835998.jpg",
      "title": "Colin Smith / Beacon at Penarth",
      "caption": "Beacon at Penarth. Sited on the clifftop, a light here would be seen from up and down the Severn Estuary, and from the Somerset hills, on a clear night."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Clifftop_Walk_at_Whitcliffe_Drive_-_geograph.org.uk_-_836036.jpg",
      "title": "Colin Smith / Clifftop Walk at Whitcliffe Drive",
      "caption": "Clifftop Walk at Whitcliffe Drive. Looking north to Penarth, this is a popular walk which offers great views across the Severn to Somerset. Houses have good views too, across the manicured clifftop lawns."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Triassic_mudstone_rock_platform_at_Roundbush_Rocks_-_geograph.org.uk_-_906377.jpg",
      "title": "Alan Bowring / Triassic mudstone rock platform at Roundbush Rocks",
      "caption": "Triassic mudstone rock platform at Roundbush Rocks. The spit of Ranny Point runs out into the Bristol Channel with the coast of Somerset seen across the water. The islands of Flat Holm and Steep Holm occupy centre position within the channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Cliffs_at_Lavernock_Point_-_geograph.org.uk_-_836056.jpg",
      "title": "Colin Smith / Cliffs at Lavernock Point",
      "caption": "Cliffs at Lavernock Point which is also a desgnated nature reserve. Red and grey cliffs of mudstone and blue lias tower over the cobbly beach at Lavernock. Note the clearly banded strata."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/East_Lake%2C_Cosmeston_-_geograph.org.uk_-_836098.jpg",
      "title": "Colin Smith / East Lake, Cosmeston",
      "caption": "East Lake, Cosmesto. Flooded former limestone quarry workings from 1890s to 1960s, now part of Cosmeston Lakes Country Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Cosmeston_Lakes_-_corner_of_east_lake_-_geograph.org.uk_-_1219347.jpg",
      "title": "Mick Lobb / Cosmeston Lakes - corner of east lake",
      "caption": "Cosmeston Lakes. Corner of east lake. A culvert discharges into the lake at this point."
    }
  ],
  "distance_km": 11.0,
  "description": "The town of Penarth is based on the South Wales coast in the Vale of Glamorgan near Cardiff. It has some lovely walking trails to try along the Wales Coast Path which runs through the town. This walk takes you along the cliff top to the nearby Cosmeston Lakes Country Park where you can enjoy lakeisde trails with 200 acres of woodland, meadows and wetland habitats to enjoy. It's about a 3 mile walk from the seafront the park, with nice views of the beach as you go. The walk starts on the sea front in Penarth next to the pier. The town is located at the top of limestone cliffs that have a distinctive rock formation and are referred to as the Penarth Group of rocks. From the pier you proceed south along the coastal path to the noteworthy Lavernock Point, enjoying great views of the Bristol Channel on the way. Here you will find a lovely nature reserve with varied and colourful plants and several species of butterfly to look out for. The area is also well known as the place where Guglielmo Marconi transmitted and received the first wireless signals over open sea between the Point and Flat Holmisland in the late 19th century. At Lavernock Point you turn inland to follow footpaths to Cosmeston Lakes. The park includes a visitor centre and a number of well laid out paths. There's also a number of bird hides where you can look out for mute swans, mallards, herons, egrets and diving birds such as the great crested grebe. On the other side of the Penarth Flats you can pick up the popular Taff Trail and follow it along the River Taff to Bute Park. Here you'll find 130 acres of landscaped gardens and parkland with an arboretum, flower gardens, grassland, woodland and tree-lined avenues. Our longer Cardiff Coastal Walk passes through Penarth and will take you all the way to the popular holiday resort of Barry Island.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west from Penarth and you will soon come to the neighbouring village of Dinas Powys. The circular Dinas Powys Walk will take you through the local woods to the Cadoxton River. The river is one of the shortest in Wales and includes weirs and a salmon leap."
    }
  ],
  "postcode": "CF64 3AU",
  "district": "Penarth",
  "county": "Vale of Glamorgan",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Penarth Pier, Penarth Marina, Penarth, Vale of Glamorgan, Cymru / Wales, CF64 3AU, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical sites",
    "gardens"
  ],
  "facilities": [
    "visitor center",
    "bird hides",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}