{
  "created_at": "2025-01-06T02:12:22.096699+00:00",
  "objectID": "02b1581dd0d7d55fcfde55ff59fe8095",
  "ref": "tavey-cleave-and-hare-tor-walking-route",
  "title": "Tavy Cleave and Hare Tor Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Tavy_Cleave_-_geograph.org.uk_-_1072504.jpg",
  "nearby": [
    {
      "description": "Lydford Gorge",
      "objectID": "0ff9bdbdb039a023d1044e62672e2fb5",
      "ref": "lydford-gorge-walking-route"
    },
    {
      "description": "Peter Tavy",
      "objectID": "ab6ec6f3e4892d9c80202d3ac547409d",
      "ref": "peter-tavy-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/02b1581dd0d7d55fcfde55ff59fe8095.gpx",
  "_geoloc": {
    "lat": 50.6223900991,
    "lng": -4.069031867
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Tavy_Cleave_-_geograph.org.uk_-_1072504.jpg",
      "title": "M Hunter / Tavy Cleave, via Wikimedia Commons",
      "caption": "Tavy Cleave. Tavy Cleave is unusual. It is a river valley enclosed in a steep gorge which is rare for Dartmoor. The Cleave is very beautiful in its own right but it is also a good way to approach the central parts of North Dartmoor and Fur Tor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Hare_Tor_-_Dartmoor_-_geograph.org.uk_-_135728.jpg",
      "title": "Richard Knights / Hare Tor - Dartmoor, via Wikimedia Commons",
      "caption": "Hare Tor. Showing the far reaching views from the tor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Bridge_over_Wheal_Friendship_Leat_-_geograph.org.uk_-_3437190.jpg/512px-Bridge_over_Wheal_Friendship_Leat_-_geograph.org.uk_-_3437190.jpg",
      "title": "Bridge over Wheal Friendship Leat by Tony Atkin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridge over Wheal Friendship Leat. This leat runs from Tavy Cleave all the way down, past Nat Tor, around Lane End, down to Hill Bridge before following the River Tavy and finishing in the Wheal Bennett’s Reservoir, where it feeds the Hydro power station further downstream. The Copper mine at Wheal Friendship, fed by this leat was the most productive copper mine in the world during the 1800s and employed over 1000 men."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Waterfall_on_the_river_Tavy_-_geograph.org.uk_-_1072499.jpg",
      "title": "M Hunter / Waterfall on the river Tavy",
      "caption": "Waterfall on the river Tavy. This shows water tumbling over rocks on the River Tavy just below Tavy Cleave. This is very typical of this stretch of the river. The fast flow, cold water, depth and slippery rocks makes it almost impossible to cross this river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Mary_Tavy%2C_Ger_Tor_-_geograph.org.uk_-_2374825.jpg",
      "title": "Mary Tavy: Ger Tor by Martin Bodman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ger Tor. Large granite outcrop within the Willsworthy Range, above the entrance to Tavy Cleave. Another fine viewpoint in this scenic area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Mary_Tavy%2C_Nat_Tor_-_geograph.org.uk_-_2374836.jpg",
      "title": "Mary Tavy: Nat Tor by Martin Bodman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Nat Tor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/The_River_Tavy_in_Tavy_Cleave_-_geograph.org.uk_-_3438947.jpg/512px-The_River_Tavy_in_Tavy_Cleave_-_geograph.org.uk_-_3438947.jpg",
      "title": "The River Tavy in Tavy Cleave by Tony Atkin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The River Tavy in Tavy Cleave. The river has given its name to the town of Tavistock and the villages of Mary Tavy and Peter Tavy. It is a tributary of the River Tamar and has as its own tributaries. It rises high on Dartmoor near Devil’s Tor and then winds its way down through Tavistock where it joins the River Tamar and forms the Bere peninsula. The Tavy also feeds Tavistock Canal, which was once an important trading route connecting Morwellham quay to Tavistock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/The_Valley_of_the_Rattle_Brook_-_geograph.org.uk_-_3437320.jpg/512px-The_Valley_of_the_Rattle_Brook_-_geograph.org.uk_-_3437320.jpg",
      "title": "The Valley of the Rattle Brook by Tony Atkin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Valley of the Rattle Brook"
    }
  ],
  "distance_km": 7.5,
  "description": "This circular walk takes you to this lovely steep-sided valley of the River Tavy in the Dartmoor National Park. It's a delightful area with the rushing water and waterfalls of the river surrounded by interesting vegetation and several large tors. The walk starts from the Lanehead car park at Higher Willsworthy. You then follow footpaths past Nat Tor before picking up a riverside path along the Tavy to Tavy Cleave. You then climb to the 1742 ft (531m) summit of Hare Tor. From here there are splendid, wide ranging views over Dartmoor. The walk then descends to Ger Tor and Nattor Down before returning to the car park. This walk is located just a couple of miles east of Lydford so if you would like to continue your walking you could visit the beautiful Lydford Gorge. Here you will find the 100-foot-high (30-metre) 'White Lady Waterfall' in a lovely wooded glade.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Dartmoor Inn is located west of the car park. The pub dates back to the 16th century and serves good quality food. Inside there's slate flooring, wooden furniture and a wonderful real fire. Outside there's a lovely garden area with views of the countryside. You can find them at postcode EX20 4AY for your sat navs. The inn is dog friendly. Just to the south west there's the worthy village of Peter Tavy where you could visit the 15th century Peter Tavy Inn. The pub includes a charming old interior with ancient timber beams and warming log fires. Outside there's a lovely garden area with views of the Dartmoor countryside. You can find them at postcode PL19 9NN for your sat navs. The village also includes a 14th century church and more nice views of the River Tavy."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FE-PE881MGg",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A386, Ley, Mary Tavy, West Devon, Devon, England, PL19 9QG, United Kingdom",
  "postcode": "PL19 9QG",
  "district": "West Devon",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "viewpoints",
    "waterfalls",
    "tors"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}