{
  "created_at": "2025-01-06T03:24:49.037876+00:00",
  "objectID": "032b62035ea618e8df9cc2f5e8bb5791",
  "ref": "hebden-bridge-walking-route",
  "title": "Hebden Bridge Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Hebden_Bridge_-_geograph.org.uk_-_4101.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/032b62035ea618e8df9cc2f5e8bb5791.gpx",
  "_geoloc": {
    "lat": 53.7410511762,
    "lng": -2.0129279078
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Hebden_Bridge_-_geograph.org.uk_-_4101.jpg",
      "title": "David Stowell / Hebden Bridge",
      "caption": "The pleasantly renovated canal wharf in Hebden Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Bridge_Gate_Hebden_Bridge_-_geograph.org.uk_-_987413.jpg",
      "title": "Paul Anderson / Bridge Gate Hebden Bridge",
      "caption": "Bridge Gate. Until recently Bridge Gate was a busy main route through the centre of Hebden Bridge for vehicles heading for Haworth and Keighley on the A6033. Today Bridge Gate is closed to all motor vehicles and is a popular pedestrian walkway through the centre of the town. Photo taken in September 2008"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Hebden_Bridge_-_geograph.org.uk_-_5342.jpg",
      "title": "Martin Clark / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Looking north-west along the Rochdale Canal towards the centre of Hebden Bridge from Mayroyd Mill Lock, near the railway station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Hebden_Bridge_Mill_-_geograph.org.uk_-_482617.jpg",
      "title": "Betty Longbottom / Hebden Bridge Mill",
      "caption": "Hebden Bridge Mill. Now an arts & crafts centre & small retail outlets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Hebden_Bridge_-_view_from_Cross_Lanes_Graveyard_-_geograph.org.uk_-_1435158.jpg",
      "title": "Dave Bevis / Hebden Bridge - view from Cross Lanes Graveyard",
      "caption": "A view over the town and countryside from an elevated position."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Red_Acre_Mill_on_The_Rochdale_Canal_%28geograph_2670057%29.jpg/512px-Red_Acre_Mill_on_The_Rochdale_Canal_%28geograph_2670057%29.jpg",
      "title": "David Clark / Red Acre Mill on The Rochdale Canal",
      "caption": "Red Acre Mill on The Rochdale Canal in Mytholmroyd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Mill_at_Hardcastle_Crags_-_geograph.org.uk_-_2051248.jpg",
      "title": "Mill at Hardcastle Crags by John Orchard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mill at Hardcastle Crags"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Wadsworth_Moor_-_geograph.org.uk_-_3260565.jpg",
      "title": "Wadsworth Moor by Alex McGregor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wadsworth Moor"
    }
  ],
  "distance_km": 12.0,
  "description": "This circular walk makes use of the Haworth-Hebden Bridge Walk, the Calderdale Way and the Rochdale Canal to take you on a tour of the countryside, woodland, moors and hills surrounding this attractive Yorkshire town. The market town of Hebden Bridge sits on the River Calder and the Rochdale Canal in the Upper Calder Valley. It's a great base for walkers with a series of waymarked trails to follow through the surrounding area. There's waterside walking along rivers and canals and great views of the hills of the South Pennines. The town is characterised by traditional Yorkshire sandstone buildings, and interesting Victorian architecture. It's very pleasant to just stroll around the central area of the town which has lots of nice cafes and pubs where you can enjoy refreshments after your walk. Hebden Bridge is accessible by rail from it's own railway station which is on the Calder Valley Line between Manchester Victoria and Leeds City. There are frequent train services from Blackpool, Manchester and Leeds so it's an easy place to get to and from on public transport. This walk starts in the centre of the town and follows part of the Haworth to Hebden Bridge Walk along Hebden Water to Midgehole and Pecket Well. Around Midgehole you have the option of taking a detour west and visiting Hebden Dale and the National Trust owned Hardcastle Crags. The beautiful wooded valley contains tumbling streams, beautiful waterfalls and the fascinating Gibson Mill. Around Pecket Well you pick up a section of the Calderdale Way which climbs to Wadsworth Moor and Midgley Moor. This is a challenging section, climbing to a height of over 1200ft. You'll pass Cock Hill and Crow Hill before descending towards the hill-top village of Midgley. There's some great moorland views from the elevated position of the moors. At Midgley you pick up the towpath of the Rochdale Canal to take you back to Hebden Bridge. It's a pretty section of the canal which passes the little village of Mytholmroyd on the way. There's lots of other great walks around the town to try if you have time. You could pick up the Pennine Bridleway and head south to Stoodley Pike where there are more fantastic views to enjoy. Just beyond that is the pretty Withens Clough Reservoir which has a nice circular footpath around the perimeter.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's lots of lovely pubs, restaurants and cafes to choose from in the town. One highlight is the excellent Rim Nam Thai Restaurant. It's located in a wonderful spot right on the canal side just a short distance from The Hebden Bridge Picture House. It's a great place to enjoy a fine meal with a lovely scenic view. You can find it at Butlers Wharf at postcode HX7 8AF. A little to the west of the town centre there's also the noteworthy Fox & Goose Inn. The pub is the first community-owned pub in West Yorkshire. The friendly place is well worth some investigation with its cosy interior with a roaring fire and an exhibition space for local artists to display their work. Outside there's a lovely hillside beer garden which is great on warmer days. The place is also very dog friendly and will provide water bowls and free biscuits. You can find the pub at 7 Heptonstall Road with a postcode of HX7 6AZ for your sat navs. On the walk you could stop off in Pecket Well at the noteworthy Robin Hood Inn. The historic 17th century coaching inn has carvings of 2 men in Lincoln Green and is inscribed “If Robin Hood be not at home come take a pot with little John”. They serve traditional pub food and a fine selection of ales. If the weather is good you can sit outside in the garden area and enjoy splendid views towards Stoodley Pike. In the colder months there's a cosy interior with with 2 log burning fires to keep you warm."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east of Harcdcastle Crags is one of the hidden gems of the area at Lumb Hole Falls. These pretty waterfalls are located on the Crimsworth Beck and are a popular place for wild swimming and walks. There's also a plaque to Ted Hughes poem 'Six young Men' which concerns a group of men photographed at the falls shortly before they went to fight in the first World War. The circular Hebdon Bridge to Heptonstall Walk starts from the town and heads to the neighbouring village which is located just to the north west. There's some interesting old buildings in the attractive village including the 16th century Stag Cottage and the ruined church which was founded in 1260. There's also some fine old pubs to investigate here as well. For more walking ideas in the county see the Yorkshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_6xovKUn_ho",
  "postcode": "HX7 8EJ",
  "district": "Calderdale",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "New Road, Birchcliffe, Hebden Royd, Hebden Bridge, Calderdale, West Yorkshire, England, HX7 8EJ, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland",
    "canal"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "waterfalls"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "wheelchair accessible",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}