{
  "created_at": "2025-01-06T04:31:04.411993+00:00",
  "objectID": "03b6283785a69b9a8a0b5271cb68f0b4",
  "ref": "scafell-pike-from-borrowdale-walking-route",
  "title": "Scafell Pike from Borrowdale Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/91/Tarn_on_Corridor_Route_-_geograph.org.uk_-_781275.jpg",
  "nearby": [
    {
      "description": "Scafell Pike",
      "objectID": "b17cfc6012e8c4c855b5f6d62ac368bc",
      "ref": "scafell-pike-walking-route"
    },
    {
      "description": "Borrowdale",
      "objectID": "30459903103ffc9158473880383cb5e0",
      "ref": "borrowdale-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/03b6283785a69b9a8a0b5271cb68f0b4.gpx",
  "_geoloc": {
    "lat": 54.4990509602,
    "lng": -3.182165221
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Tarn_on_Corridor_Route_-_geograph.org.uk_-_781275.jpg",
      "title": "Kenneth Yarham / Tarn on Corridor Route, via Wikimedia Commons",
      "caption": "This tarn is on the Corridor Route between the top of Piers Gill and Greta Gill. This point provides a stunning view of Great Gable beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Footpath_Repairs%2C_Corridor_Route_-_geograph.org.uk_-_917286.jpg",
      "title": "Mick Garratt / Footpath Repairs, Corridor Route, via Wikimedia Commons",
      "caption": "Footpath Repairs, Corridor Route Necessary improvements on this very popular path to Scafell Pike. The bags of stones would have been helicoptered into place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Corridor_Route_Path_-_geograph.org.uk_-_917267.jpg",
      "title": "Mick Garratt / Corridor Route Path, via Wikimedia Commons",
      "caption": "A slight uphill section on the descent to Styhead. Lingmell Crag on the left and Gable just appearing on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Looking_down_the_Corridor_Route_-_geograph.org.uk_-_1705790.jpg/512px-Looking_down_the_Corridor_Route_-_geograph.org.uk_-_1705790.jpg",
      "title": "Bill Boaden / Looking down the Corridor Route, via Wikimedia Commons",
      "caption": "Looking down the Corridor Route. You can see Styhead Tarn and as far as Derwentwater in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Great_Gable_from_the_Corridor_Route_-_geograph.org.uk_-_893072.jpg",
      "title": "Steve Partridge / Great Gable from the Corridor Route, via Wikimedia Commons",
      "caption": "Great Gable from the Corridor Route. A sunny day with passing cloud produces some interesting contrasts. I believe Stand Crag is in the foreground highlighted by a gap in the clouds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Lingmell_viewed_from_the_Corridor_Route_-_geograph.org.uk_-_1801409.jpg",
      "title": "Philip Halling / Lingmell viewed from the Corridor Route, via Wikimedia Commons",
      "caption": "Lingmell viewed from beside a small tarnlet on the Corridor Route below Scafell Pike."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/The_Corridor_Route%2C_Scafell_Pike_-_geograph.org.uk_-_1801804.jpg",
      "title": "Philip Halling / The Corridor Route, Scafell Pike, via Wikimedia Commons",
      "caption": "Walkers on the Corridor Route to Scafell Pike pictured here below Round How, Great Gable is in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Looking_down_to_the_Corridor_Route_from_Scafell_Pike_-_geograph.org.uk_-_1331304.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Looking down to the Corridor Route from Scafell Pike. Styhead Tarn can be seen in the distance"
    }
  ],
  "distance_km": 14.5,
  "description": "This walk takes you to the highest mountain in England along one of the most popular and scenic routes to the summit. The challenging climb from Seathwaite in beautiful Borrowdale takes in Styhead Gill, Styhead Tarn and the famous Corridor Route. The route starts in the little hamlet of Seathwaite a few miles north of the mountain. There's lots of roadside parking although it can get busy in the summer months. From here you pick up the footpath to Stockley Bridge along the pretty gill and then turn right towards Taylorgill Force waterfall. The path ascends along the running waters of Styhead Gill before coming to the lovely Styhead Tarn. You continue around Sty Head and Spout Head heading along the Corridor Route on a series of stone steps. The route takes you along the western flank of the Scafell massif with wonderful views of the fell. The final steep section takes you around Lingmell Col to the summit. Take a while to rest and enjoy the fabulous panoramic views of the Lakeland Fells before descending the same way. An alternative route is to continue along Grains Gill from Stockley Bridge. The path continues along Ruddy Gill, passing Sprinkling Tarn before rounding Great End and ascending to Scaffel Pike from the eastern side. To climb to the summit the most direct way try the Scafell Pike From Wasdale route. For a longer more challenging walk try the Scafell Pike from Langdale route. This route involves a fair amount of scrambling but with some wonderful views of the Langdale Valley and a visit to Angle Tarn.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Glaramara House hotel in nearby Seatoller is in a stunning location. There's wonderful views of the Borrowdale Fells from the lovely outdoor seating area in the spacious grounds. It's the perfect place to relax after a long walk on a warm day. Indoors there's a cosy resident’s lounge with a log fire and a spacious bar. They do very good food and also provide top quality accommodation if you need to stay over. You can find the hotel just to the east of the National trust car park on the Honister Pass at postcode CA12 5XQ. From here you can also enjoy a climb to Thornythwaite Fell and Glaramara mountain."
    }
  ],
  "county": "Cumberland",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}