{
  "created_at": "2025-01-06T08:30:08.850756+00:00",
  "objectID": "03dd6786cf23df5f47f69fc78f5b970b",
  "ref": "testwood-lakes-walking-route",
  "title": "Testwood Lakes Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Study_centre_at_Testwood_Lakes_nature_reserve_-_geograph.org.uk_-_344288.jpg",
  "nearby": [
    {
      "description": "Test Way",
      "objectID": "f7f671cf68a772945c580a3901d631a6",
      "ref": "test-way-walking-route"
    },
    {
      "description": "Blashford Lakes",
      "objectID": "0e83f77a355df3bfdb1ba2c207ecbae7",
      "ref": "blashford-lakes-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/03dd6786cf23df5f47f69fc78f5b970b.gpx",
  "_geoloc": {
    "lat": 50.9356033606,
    "lng": -1.5072639974
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Study_centre_at_Testwood_Lakes_nature_reserve_-_geograph.org.uk_-_344288.jpg",
      "title": "Jim Champion / Study centre at Testwood Lakes nature reserve",
      "caption": "View of the Study centre at Testwood Lakes nature reserve. On the right is the relatively new building that houses the study centre at the reserve, run by the Hampshire and Isle of Wight Wildlife Trust. Beyond is the largest of the disused gravel pit lakes, simply called Testwood Lake. The field in the foreground was part of the gravel works in the 1980s and 90s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Bird_hide%2C_Testwood_Lakes_nature_reserve_-_geograph.org.uk_-_344303.jpg",
      "title": "Jim Champion / Bird hide, Testwood Lakes nature reserve",
      "caption": "Bird hide. The bird hide looks out over the northernmost lakes in the reserve complex. The lakes were formed by allowing former gravel pits to flood. Vehicles on the M27 motorway can be seen (and heard) in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Replica_ancient_roundhouse%2C_Testwood_Lakes_nature_reserve_-_geograph.org.uk_-_344260.jpg",
      "title": "Jim Champion / Replica ancient roundhouse, Testwood Lakes nature reserve",
      "caption": "Replica ancient roundhouse. This replica bronze age house outside the study centre is similar to the houses the area's inhabitants would have lived in around 3000 years ago. This grassy slope was part of a gravel works in the 1980s and 90s and a prehistoric wooden boat was found preserved under the gravel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Alder_coppice_at_Testwood_Lakes_nature_reserve_-_geograph.org.uk_-_344286.jpg",
      "title": "Jim Champion / Alder coppice at Testwood Lakes nature reserve",
      "caption": "Alder coppice. This gravel path provides \"wheelchair-friendly\" access to the bird hide from the study centre at Testwood Lakes nature reserve. The alder coppice has been tidied up and some of the trimmings have been used to edge the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Pond_near_Testwood_Lakes_study_centre_-_geograph.org.uk_-_344281.jpg",
      "title": "Jim Champion / Pond near Testwood Lakes study centre",
      "caption": "Pond near the study centre. This pond is nearly 200 metres to the northwest of the study centre, and is used for 'pond-dipping' activities. The nature reserve, run by Hampshire and Isle of Wight Wildlife Trust is newer, but very similar to, the reserve at Blashford Lakes (near Ringwood). At Blashford the pond is immediately behind the study centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Little_Testwood_Lake_-_geograph.org.uk_-_344948.jpg",
      "title": "Jim Champion / Little Testwood Lake",
      "caption": "Little Testwood Lake. The body of water in this photo is Little Testwood Lake, a flooded disused gravel pit that is now used by Southern Water as a reservoir. The gravel path in the foreground leads on a circular route around the lake. A Southern Water Technical Performance report on their website says: \"Water is abstracted from the River Test and piped to Little Testwood Lake 800 metres away. In the past water was pumped from the River Test straight to our works for treatment. Little Testwood Lake can store up to 270 million litres of water. This provides security of supply to meet peak demand for water and secure high quality water by providing protection against possible river pollution. Water from the lake is pumped to the supply works for treatment before being distributed to our customers.\""
    }
  ],
  "distance_km": 2.5,
  "description": "Enjoy an easy, waterside walk around these two pretty lakes in Totton, on the eastern edge of the New Forest. There are well surfaced footpaths all the way around the lakes. The area is managed as a nature reserve so you will find a variety of interesting wild flowers and woodland around the lakes. You can also look out for various wildfowl and waders on the water using the two bird hides. There are good facilities with a Visitor centre, toilets and parking. If you'd like to extend your walk you could pick up the Test Way and follow the River Test to the nearby Lower Test Nature Reserve.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a couple of miles north along the Test Way and you can visit the Broadlands Estate near Romsey. Here you can also pick up the Romsey Canal Walk and enjoy an easy stroll along the old Andover Barge Canal. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HkE4eIUt9eA",
  "postcode": "SO40 3SA",
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Brunel Road, Totton, Totton and Eling, Calmore, New Forest, Hampshire, England, SO40 3SA, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "waterfront"
  ],
  "points_of_interest": [
    "wildflowers",
    "wildfowl",
    "bird hides"
  ],
  "facilities": [
    "visitor center",
    "toilets",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}