{
  "created_at": "2025-01-06T03:03:58.516709+00:00",
  "objectID": "0407e97afd5906284ebb2f41c2627d75",
  "ref": "gordale-scar-walking-route",
  "title": "Gordale Scar Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Gordale_Scar_-_geograph.org.uk_-_8042.jpg",
  "nearby": [
    {
      "description": "Malham Cove",
      "objectID": "f69ffccaf926b2bbfa4b17aed1fcadc5",
      "ref": "malham-cove-walking-route"
    },
    {
      "description": "Malham Tarn Estate",
      "objectID": "0e1b77883047f9f0f66863ff12a65c1c",
      "ref": "malham-tarn-estate-walking-and-cycle-route"
    },
    {
      "description": "Janet's Foss",
      "objectID": "cfe2a1b11e3b61c7a09473e22818dbfa",
      "ref": "janets-foss-walking-route"
    },
    {
      "description": "Fountains Fell",
      "objectID": "39ac625fcf4a40d377d9910345cf2da2",
      "ref": "fountains-fell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0407e97afd5906284ebb2f41c2627d75.gpx",
  "_geoloc": {
    "lat": 54.0614364996,
    "lng": -2.152661183
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Gordale_Scar_-_geograph.org.uk_-_8042.jpg",
      "title": "Val Vannet / Gordale Scar",
      "caption": "View of the footpath into the Scar. Gordale Scar is reckoned to have been Tolkien's inspiration for Helm's Deep in 'The Lord of the Rings'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Entrance_to_Gordale_Scar_-_geograph.org.uk_-_707075.jpg",
      "title": "Raymond Knapman / Entrance to Gordale Scar",
      "caption": "Entrance to the Scar. View of the footpath into the site on a late summer day in 2004."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Waterfalls%2C_Gordale_Scar_-_geograph.org.uk_-_8417.jpg",
      "title": "Val Vannet / Waterfalls, Gordale Scar",
      "caption": "A group of walkers gather around the waterfalls at the Scar. The waterfalls in the Scar are hidden in the cleft of the gorge which was probably eroded by huge quantities of meltwater at the end of the Ice Age."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Gordale_Beck_flowing_down_Gordale_Scar_-_geograph.org.uk_-_872118.jpg",
      "title": "Slbs / Gordale Beck flowing down Gordale Scar",
      "caption": "Gordale Beck flowing down Gordale Scar. Sometimes it's possible to climb up the Scar alongside the beck and stay dry - not on the day this photograph was taken though."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Gordale_Scar_-_geograph.org.uk_-_1002752.jpg",
      "title": "John Illingworth / Gordale Scar",
      "caption": "View from abor the site, seen from New Close Knotts. The small dots on the path and near the waterfall are people admiring the gorge from below."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Road_Bridge_over_Malham_Beck_-_geograph.org.uk_-_393169.jpg",
      "title": "mauldy / Road Bridge over Malham Beck",
      "caption": "View of Malham village where the route starts. The photo shows the Road Bridge over Malham Beck in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Brook_south_of_Janet%27s_Foss_-_geograph.org.uk_-_1355281.jpg",
      "title": "Andy Beecroft / Brook south of Janet's Foss",
      "caption": "Brook south of Janet's Foss. You will pass the pretty falls on the way to the Scar."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Gordale_Beck_-_geograph.org.uk_-_1177138.jpg",
      "title": "Gordon Hatton / Gordale Beck",
      "caption": "Gordale Beck - the route passes along the beck on the way from Malham. Looking upstream along the beck towards the limestone reef knoll of Wedber [left] and slopes of Bowland shales and sandstones [right]."
    }
  ],
  "distance_km": 7.0,
  "description": "This circular walk climbs to the spectacular Gordale Scar in the Yorkshire Dales. It's a popular walk through a wonderful limestone ravine with streams, waterfalls and striking geological features to enjoy. The unique area is about 16 million years old and has its own micro-climate which allows rare wildflowers and plants to thrive iin the gorge. The circular trail runs for just over 4 miles and includes some moderate climbs and a bit of a scramble around the waterfall so a reasonable level of fitness is required. You start in the pretty village of Malham and follow Gordale Lane and Gordale Beck north east to Gordale Scar. Here you will find two waterfalls and overhanging limestone cliffs over 100 metres high. It's a truly stunning sight and well worth the climb from Malham. From Gordale Scar you continue the climb towards Seaty Hill where there are magnificent views of the Yorkshire Dales. The final section descends along country lanes to Malham Village. If you'd like to extend your walking in the area then you could visit Malham Cove and the Malham Tarn Estate for more beautiful scenery. You can also try the Janet's Foss Walk where you can follow a nice footpath along a pretty beck and through garlic scented woodland to the falls. See the video below for more details of this walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Malham The Lister Arms is a good choice for some well earned refreshments. They do excellent home cooked food and have award-winning cask ales as well. The Lister home made pies are of particular note! They also have a lovely garden area to sit out in on warmer days. You can find them in a fine spot, just across from the village green at a postcode of BD23 4DB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The whole of the walk can be quite challenging, especially for larger dogs. The scramble around the waterfall can be particularly difficult. The first section along the beck to the site should be fine though. The Lister Arms pub mentioned above is very dog friendly in the bar area. They even make their own biscuit treats for your four-legged friends."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For another rewarding climb in the area head to Fountains Fell. The route starts from the nearby Malham Tarn and climbs to a height of 668 metres (2,192 ft) with lovely views of the pretty Fountains Fell Tarn below. The Malham National Park Centre is a great place to visit for more information on this wonderful area. They have displays about the area, guide books, maps leaflets and a team of knowledgeable staff to advise you. You can also find out about watching the Peregrine Falcons that regularly nest at the Cove. You can find them at Chapel Gate in Malham village at postcode BD23 4DA for your sat navs. They also have a decent sized car park which acts as a great start point for many walks in the area. For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/KAR2uAnD3Pk",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "New Bridge, Malham, North Yorkshire, York and North Yorkshire, England, BD23 4DA, United Kingdom",
  "postcode": "BD23 4DA",
  "district": "Malham",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "limestone"
  ],
  "points_of_interest": [
    "viewpoints",
    "waterfalls",
    "geological features"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}