{
  "created_at": "2025-01-06T03:29:30.375853+00:00",
  "objectID": "042d6645eb15a6296ce25c5a25802c5e",
  "ref": "harlech-walking-route",
  "title": "Harlech Coastal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Harlech_Castle_-_Cadw_photograph.jpg",
  "nearby": [
    {
      "description": "Taith Ardudwy Way",
      "objectID": "b3e81683708fd9b998a647e643b04855",
      "ref": "taith-ardudwy-way-walking-route"
    },
    {
      "description": "Panorama Walk Barmouth",
      "objectID": "60177b109537918a13d4646a00a56e2b",
      "ref": "panorama-walk-barmouth-walking-route"
    },
    {
      "description": "Llanbedr",
      "objectID": "f88e8a397b8bc302624cc5ca91148e69",
      "ref": "llanbedr-walking-route"
    },
    {
      "description": "Dyffryn Ardudwy",
      "objectID": "4d1b72ad3021ee5a368ff79cb2bbfd31",
      "ref": "dyffryn-ardudwy-walking-route"
    },
    {
      "description": "Nantcol Waterfalls",
      "objectID": "beef3592cd830cec9291d8a7c1a35005",
      "ref": "nantcol-waterfalls-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/042d6645eb15a6296ce25c5a25802c5e.gpx",
  "_geoloc": {
    "lat": 52.86117606,
    "lng": -4.11049604
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Harlech_Castle_-_Cadw_photograph.jpg",
      "title": "Cadw [OGL v1.0 (http://NationalArchives.gov.uk/doc/open-government-licence/version/1/)], via Wikimedia Commons",
      "caption": "Harlech Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Llandanwg_beach_-_geograph.org.uk_-_232494.jpg",
      "title": "DS Pugh / Llandanwg beach, via Wikimedia Commons",
      "caption": "Llandanwg beach. Looking towards Harlech from Llandanwg."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/St_Tanwg%27s_Church%2C_Llandanwg_-_geograph.org.uk_-_558768.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "St Tanwg's Church, Llandanwg. The church is dedicated to St Tanwg, a Breton saint who accompanied Cadfan to Bardsey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Harlech_Beach_-_geograph.org.uk_-_512935.jpg",
      "title": "Peter Humphreys / Harlech Beach, via Wikimedia Commons",
      "caption": "Harlech Beach Looking towards Criccieth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Pensarn_Wharf.jpg",
      "title": "Eric Jones / Summer's Evening at Aber Artro, via Wikimedia Commons",
      "caption": "Pensarn Wharf - Summer's Evening at Aber Artro"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Llandanwg_Pensarn_Harbour_and_Shell_Island.jpg/256px-Llandanwg_Pensarn_Harbour_and_Shell_Island.jpg",
      "title": "Oosoom at English Wikipedia [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Llandanwg (right), Pensarn Harbour and Shell Island (above), in Gwynedd, Wales. Llanbedr Airport is on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Morfa_Dyffryn_-_geograph.org.uk_-_212740.jpg",
      "title": "Roger W Haworth / Morfa Dyffryn, via Wikimedia Commons",
      "caption": "The board walk which is the continuation of Ffordd Bennar in Dyffryn Ardudwy, Morfa Dyffryn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/House_at_Llanenddwyn_-_geograph.org.uk_-_1080282.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "House at Llanenddwyn. A quiet time of the year for the house owners as the surrounding camp-sites and holiday caravans are, unsurprisingly, deserted at this time of the year."
    }
  ],
  "distance_km": 18.0,
  "description": "This town on the edge of the Snowdonia National Park has some lovely coastal footpaths to try. This walk takes you along a section of the Wales Coast Path to nearby Llanenddwyn. On the way you'll visit Llandanwg Beach, Pensarn Harbour and the Morfa Dyffryn Nature Reserve. At the end of the route you can catch the train back to Harlech from Llanenddwyn. The walk starts from Harlech Train Station, next to Harlech Castle. The impressive castle was built by Edward I during his invasion of Wales between 1282 and 1289. UNESCO considers Harlech to be one of \"the finest examples of late 13th century and early 14th century military architecture in Europe\", and it is classed as a World Heritage site. From the castle you can pick up the Wales Coast Path and follow it west past Royal St David's golf course. This will take you to Harlech Beach where you can head south along the dunes to Llanfair and then on to Llandanwg where you can visit the noteworthy St Tanwg's Church. Also known as \"the church in the sand, St Tanwg's is an early medieval church, with the western end possibly dating back to the 13th century. However, the presence of 6th century inscribed stones, and the dedication to St Tanwg, suggest much earlier use of the site as a church, possibly dating to around 453 AD as part of St Patrick's work to establish links between Ireland and Britain. From here you head east to small village of Pensarn where there is a picturesque harbour. Follow the path past Llanbedr and then west toward Shell Island. The attractive peninsula is known for the wide variety of seashells that wash up on the beach, and for its wild flowers. Public vehicular access to the island is only possible via a causeway across the estuary of the River Artro when the tide is out. Access on foot is always possible from the adjacent Mochras/Morfa Dyffryn beach, which extends for several kilometres south of Shell Island. The route continues south along Morfa Dyffryn National Nature Reserve. The beautiful reserve includes huge sand dunes, seashore, saltmarsh and grassland with a wide variety of wildlife to look out for. Keep your eyes peeled for birds such as stonechats, skylarks and wheatears. There's also lots of pretty wildflowers in the warmer months with highlights including marsh-orchid, speedwells, thyme and maiden pink. After passing along the reserve the route heads inland to Llanenddwyn train station where the route finishes. To continue your walking around Harlech pick up the long distance Taith Ardudwy Way which takes you through the Snowdonia National Park from Barmouth, on the Mawddach Estuary, to Llandecwyn. You could also continue south along the coast path to visit Barmouth and try the climb to the Dinas Oleu hill fort on the popular Panorama Walk .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just inland there's the village of Dyffryn Ardudwy where there's a train station for public transport access. There's also the fascinating Dyffryn Ardudwy Burial chamber to explore in the village. The ancient site includes a hut circle and a number of dolmen dating back over 6000 thousand years.  Just to the east of Llanbedr there's also something of a hidden gem at the wonderful Nantcol Waterfalls. The area includes pleasant trails along the River Cwmnantcol with a series of rushing waterfalls to see along the way. There's also a circular walk around a small reservoir, just west of the falls."
    }
  ],
  "postcode": "LL46 2UG",
  "district": "Harlech",
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ffordd Glan Môr, Harlech, Gwynedd, Cymru / Wales, LL46 2UG, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "beach",
    "dunes",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "church",
    "golf course",
    "wildflowers"
  ],
  "facilities": [
    "car park",
    "train station",
    "beach"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}