{
  "created_at": "2025-01-05T23:37:34.846646+00:00",
  "objectID": "04863232c16407064a0a524946dadd07",
  "ref": "kegworth-walking-route",
  "title": "Kegworth Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Kegworth_Shallow_Lock_-_geograph.org.uk_-_556535.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/04863232c16407064a0a524946dadd07.gpx",
  "_geoloc": {
    "lat": 52.8398775808,
    "lng": -1.2675855219
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Kegworth_Shallow_Lock_-_geograph.org.uk_-_556535.jpg",
      "title": "Mat Fascione / Kegworth Shallow Lock",
      "caption": "Kegworth Shallow Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Kegworth_Marine_-_geograph.org.uk_-_556547.jpg",
      "title": "Mat Fascione / Kegworth Marine",
      "caption": "Kegworth Marine"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Footbridge_over_the_River_Soar_-_geograph.org.uk_-_715777.jpg",
      "title": "Jerry Evans / Footbridge over the River Soar",
      "caption": "Footbridge over the River Soar. This bridge carries the towpath from New Cut across the original course of the Soar near the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Kegworth_Bridge_-_Grade_II_Listed_Building.jpg/512px-Kegworth_Bridge_-_Grade_II_Listed_Building.jpg",
      "title": "Crep171166, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Kegworth Bridge. Just to the Northeast of the village in Leicestershire; although this part of the bridge is within Nottinghamshire (as the River Soar forms the boundary). This picture is of the South-eastern span, across the canal cut-through, off the main river. A small pleasure boat is about to pass underneath. Grade II Listed Building originally dating from around 1785 although there has been work to widen and rebuild since then."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/West_LeakeMain_street_-_geograph.org.uk_-_1298786.jpg",
      "title": "Andy Jamieson / West LeakeMain street",
      "caption": "West LeakeMain street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Formal_Gardens_at_Sutton_Bonington_Hall_-_geograph.org.uk_-_1810228.jpg",
      "title": "Formal Gardens at Sutton Bonington Hall by Kate Jewell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Formal Gardens at Sutton Bonington Hall"
    }
  ],
  "distance_km": 8.6,
  "description": "This large Leicestershire based village has some nice canal and country trails to try. This circular walk from the village visits the canalised section of the River Soar before heading through the countryside to visit the neighbouring village of West Leake. The walk starts from the public car park next to the canal locks on the eastern side of the village. It's a lovely spot for a stroll with a marina, a Grade II listed bridge and lots of boats to see going through the locks. After exploring the canal you can pick up a section of the Midshires Way and follow the waymarked footpath east along Melton Lane to West Leake. The route then heads west through Sutton Bonnington to return to the river. Here you'll pass the historic Sutton Bonington Hall, a country house erected in the Queen Anne period and known locally as \"The Hall\". After passing the village you can then follow a riverside footpath north to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Anchor Inn is located very close to the start of the walk, next to the river. They serve good quality food and have some outdoor seating for warmer weather. You can find them on Station Road at postcode DE74 2FR your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and country trails make for a fine dog walk and the Anchor mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route can be extend by continuing east to visit East Leake. The village is well worth a visit with a picturesque green, old pubs, a noteworthy 11th century church and the splendid Manor Farm. Here you'll find a 25 acre park with woodlands and a variety of breeds including donkeys, rabbits, guinea pigs, rats, lizards, snakes, parrots and axolotls. If you follow the Midshires Way north you could visit the popular Trent Lock on the Trent and Mersey Canal in Long Eaton. It's a significant location as the lock marks the point where the River Trent and River Soar meet with the beginning of the Erewash Canal. Just to the west you could visit neighbouring Castle Donington. Here you can visit Donington Park which is famously used as a motor racing track and is also the venue for the Download Music Festival.  For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CZgTC8ArCl8",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Kingston Lane, Kingston on Soar, Rushcliffe, Nottinghamshire, East Midlands, England, DE74 2FS, United Kingdom",
  "postcode": "DE74 2FS",
  "district": "Rushcliffe",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "countryside",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "boat viewing"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}