{
  "created_at": "2025-01-06T00:31:04.218909+00:00",
  "objectID": "0497624bd85f35d6a4053c68dd682da8",
  "ref": "monsal-dale-walking-route",
  "title": "Monsal Dale Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Monsal_Dale_-_geograph.org.uk_-_1003943.jpg",
  "nearby": [
    {
      "description": "Monsal Trail",
      "objectID": "725064cd118a55da0f494227d083e732",
      "ref": "monsal-trail-walking-and-cycle-route"
    },
    {
      "description": "Miller's Dale",
      "objectID": "b1b5451a34708ce105fcf182f5d6a29b",
      "ref": "millers-dale-walking-route"
    },
    {
      "description": "Cressbrook Dale",
      "objectID": "f40731d3529f879bfbb4df2819707045",
      "ref": "cressbrook-dale-walking-route"
    },
    {
      "description": "Monsal Head",
      "objectID": "3cc86a6a6c74fa8c4b917e7d16d82831",
      "ref": "monsal-head-walking-route"
    },
    {
      "description": "Great Longstone",
      "objectID": "30d5cfe123b4dde0820638e2441aa837",
      "ref": "great-longstone-walking-route"
    },
    {
      "description": "Chelmorton",
      "objectID": "c51d2a582cf2823244a59466ce8b9692",
      "ref": "chelmorton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0497624bd85f35d6a4053c68dd682da8.gpx",
  "_geoloc": {
    "lat": 53.2405279859,
    "lng": -1.7238064362
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Monsal_Dale_-_geograph.org.uk_-_1003943.jpg",
      "title": "Alan Murray-Rust / Monsal Dale",
      "caption": "Monsal Dale. The classic view from Monsal Head, changing with the seasons and the light."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Monsal_Head_Viaduct%2C_Peak_District_%286214959899%29.jpg/512px-Monsal_Head_Viaduct%2C_Peak_District_%286214959899%29.jpg",
      "title": "Paul Stephenson from London / CC BY (https://creativecommons.org/licenses/by/2.0)",
      "caption": "Looking down on the Monsal Head Viaduct, a popular walking and cycling destination. Just to the left of the photo, the old tunnel, and the 3 other tunnels between Bakewell and Buxton, has been re-opened, and the Monsal Trail is now a very popular cycling route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Path_through_New_Plantation_-_geograph.org.uk_-_1711230.jpg",
      "title": "Peter Barr / Path through New Plantation",
      "caption": "Path through New Plantation. This path has climbed up from Monsal Dale, towards Brushfield Hough.The direction of the view is south, along the Wye valley, towards Bakewell"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Path_by_the_Wye_-_geograph.org.uk_-_649809.jpg",
      "title": "Derek Harper / Path by the Wye",
      "caption": "Path by the Wye. This bank of the Wye runs through the square for a mere 50 metres (the far bank for only about 20 metres). The path to Monsal Head is hemmed in between the steep wooded slopes and trees overhanging the water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/View_from_Brushfield_Hough_-_geograph.org.uk_-_1711456.jpg",
      "title": "Peter Barr / View from Brushfield Hough",
      "caption": "View from Brushfield Hough. Looking east; down in the bottom of the dale is the River Wye, the hill on the right is Fin Cop, and the Monsal Head Hotel is the right of the three buildings"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/The_River_Wye_in_Monsal_Dale_-_geograph.org.uk_-_43620.jpg",
      "title": "Alan Walker / The River Wye in Monsal Dale",
      "caption": "The River Wye in the Dale. After the River Wye has passed under the Monsal Head viaduct and before it reaches the weir a little further downstream the southern bank of river is formed by a hillside covered in scrub and small trees. During the winter, or periods of heavy rain, the riverbank can become indistinct. This picture, taken facing upstream, shows how the hillside scrub encroaches upon the river\u0092s margins."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Weir_at_Monsal_Dale_-_geograph.org.uk_-_817100.jpg",
      "title": "trevor peach / Weir at Monsal Dale",
      "caption": "Weir on the path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/River_Wye_-_geograph.org.uk_-_30128.jpg",
      "title": "Lera Miles / River Wye",
      "caption": "River Wye view"
    }
  ],
  "distance_km": 8.0,
  "description": "This circular walk explores the beautiful Monsal Dale in the Derbyshire Dales. It's a very scenic spot with woodland trails and riverside paths along a lovely section of the River Wye. Look out for wildlife including dippers and kingfishers as you make your way along the river. Start the walk from the Monsal Head car park behind the hotel of the same name. From here you pick up footpaths heading north west to cross the viaduct over to the other side of the River Wye. You can then follow a path along the river heading west through the Dale to Brushfield Hough and Lees Bottom. This section includes an impressive rushing weir. At Lees Bottom you turn around to follow alternative footpaths back along the northern edge of the Dale. These will lead you back towards Monsal Head where you cross the river on a different footbridge. Head east and you can visit the village of Little Longstone before picking up a section of the Monsal Trail to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Monsal Head Hotel is a fine place for some refreshments after your walk. The hotel is in a great spot with fine views over the valley and viaduct. You can visit the rustic Stable Bar which includes original period features such as a sloping flag floor and the horse stalls, in which you can now sit amidst horse tack & hay rack. It was originally The Railway Hotel which was rebuilt around the late 19th century. It came into being at the beginning of the steam era, with the Stable Bar being the original stables for the horses that carried passengers up the steep incline to the Hotel, from the station in Monsal Dale below. The bar does a good range of meals and has a fine outdoor seating area if the weather is good. In Little Longstone there's the excellent Packhorse Inn. This historic pub has a fine range of ales and a cosy real fire indoors. Outside there's a lovely garden area where you can relax on warmer days. You can find the pub in the pretty little village at postcode DE45 1NN. At neighbouring Great Longstone you can investigate the excellent Crispin. The inn dates back to the 1600s and includes a charming interior with ceiling beams studded with a wonderful array of beer mugs and old horse buckles. They do a fine Sunday lunch which you can enjoy in the sunny garden area. You can find them on Main Street at postcode DE45 1TZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and river paths in the Dale are ideal for dog walking. The Monsal Head Hotel and the Packhorse Inn mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative route see the Monsal Trail Circular Walk which uses part of the trail to visit Monsal Dale, Millers Dale and the village of Taddington. The Bakewell Railway Walk also creates a circular walk using the trail. It starts from Bakewell and visits Monsal Head before heading to the picture postcard village of Ashford in the Water. Just to the west there's Chelmorton, an interesting settlement which makes a fine start point for exploring the area. The village includes an ancient 11th century church and a fine 18th century pub too. Just to the south you will find the village of Sheldon and the noteworthy Magpie Mine. Here you can explore a series of well preserved Lead Mines which date back to the 1600s. The historical site is a Scheduled Ancient Monument and another of the local area highlights. For more walking ideas in the area see the Peak District Walks and White Peak Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/fLyb_FsepzQ",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Butts Road, Monsal Head, Little Longstone CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE45 1NL, United Kingdom",
  "postcode": "DE45 1NL",
  "district": "Derbyshire Dales",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "river views"
  ],
  "facilities": [
    "car park",
    "footbridge"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}