{
  "created_at": "2025-01-06T02:02:02.477281+00:00",
  "objectID": "053b7b3bd27f21419b2baa65a4cf25ed",
  "ref": "mablethorpe-walking-route",
  "title": "Mablethorpe Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/88/Mablethorpe_promenade_-_geograph.org.uk_-_771459.jpg",
  "nearby": [
    {
      "description": "Skegness",
      "objectID": "892cfa63bfb47095028c7a246fbd73f8",
      "ref": "skegness-walking-route"
    },
    {
      "description": "Donna Nook Nature Reserve",
      "objectID": "8a28da77be49b8a6b5938bce4ebf623a",
      "ref": "donna-nook-nature-reserve-walking-route"
    },
    {
      "description": "Alford",
      "objectID": "267355a82d4a77a2d0f8b9ceb1f8a113",
      "ref": "alford-walking-route"
    },
    {
      "description": "Louth Canal",
      "objectID": "a3a8935aef0f56bbed05039936fdcad4",
      "ref": "louth-canal-walking-route"
    },
    {
      "description": "Covenham Reservoir",
      "objectID": "a6381246310f52b65350821b00425b44",
      "ref": "covenham-reservoir-walking-route"
    },
    {
      "description": "Sutton on Sea",
      "objectID": "2fa79cb3696bb2bde6e648eccd679cd1",
      "ref": "sutton-on-sea-walking-route"
    },
    {
      "description": "Mablethorpe To Skegness",
      "objectID": "c0786eee7f113c5d729f10ab2de6717a",
      "ref": "mablethorpe-to-skegness-cycle-route"
    },
    {
      "description": "Saltfleet",
      "objectID": "7d7bd23ce1551a3122cb59e53673a45a",
      "ref": "saltfleet-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/053b7b3bd27f21419b2baa65a4cf25ed.gpx",
  "_geoloc": {
    "lat": 53.3431924907,
    "lng": 0.2638413492
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Mablethorpe_promenade_-_geograph.org.uk_-_771459.jpg",
      "title": "Richard Croft / Mablethorpe promenade",
      "caption": "A dog walker strolling along Mablethorpe promenade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Mablethorpe_War_Memorial_-_geograph.org.uk_-_141631.jpg/256px-Mablethorpe_War_Memorial_-_geograph.org.uk_-_141631.jpg",
      "title": "John Readman / Mablethorpe War Memorial",
      "caption": "Mablethorpe War Memorial. The main square of Aberdeen granite sits upon a three stepped granite base The polished granite slab is inscribed with the names of the men who fell in the Second World War. The next slab of granite, carrying the names of the fallen from the First World War. The memorial was originally on the seafront,unveiled on 4th December, 1921 but moved to this position on the High Street to make way for a new building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Queens_Park_Boating_Lake_-_geograph.org.uk_-_771342.jpg",
      "title": "Richard Croft / Queens Park Boating Lake",
      "caption": "Queens Park Boating Lake. Only ducks and geese on the boating lake out of season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/St._Mary%27s_Parish_Church%2C_Mablethorpe_-_geograph.org.uk_-_143686.jpg",
      "title": "John Readman / St. Mary's Parish Church, Mablethorpe",
      "caption": "St. Mary's Parish Church, Mablethorpe. The present church was started around 1300, after the first site of St. Mary's in 1287 was abandoned after severe floods. Recently periods of drought, resulted in deep cracks in the dried out clay sub-soil. These in turn caused structural damage so that in 1978, new arches of Douglas Fir and mahogany now support the aisles and roof"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Beach_Huts_along_the_Promenade_-_geograph.org.uk_-_154948.jpg",
      "title": "Tony Atkin / Beach Huts along the Promenade",
      "caption": "Beach Huts along the Promenade at Sutton on Sea. Beach huts like this extend almost along the whole length of the promenade at Sutton on Sea. As the promenade is also the top of the sea defence wall this makes these huts the highest things in the area and the most prominent feature of this seaside town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/East_end_of_Mablethorpe_High_Street_-_geograph.org.uk_-_1219876.jpg",
      "title": "Ian Paterson / East end of Mablethorpe High Street",
      "caption": "East end of Mablethorpe High Street. Looking south west from the recently constructed concrete benches at the east end of Mablethorpe High Street. Spanish City lies to the left of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Saltfleetby-Theddlethorpe_Dunes_Nature_Reserve_-_geograph.org.uk_-_480929.jpg",
      "title": "Kate Jewell / Saltfleetby-Theddlethorpe Dunes Nature Reserve",
      "caption": "Saltfleetby-Theddlethorpe Dunes Nature Reserve 1. Between Mablethorpe North End in the south and Saltfleet Haven in the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Saltleetby-Theddlethorpe_Dunes_National_Nature_Reserve_-_geograph.org.uk_-_465271.jpg",
      "title": "Oliver Dixon / Saltleetby-Theddlethorpe Dunes National Nature Reserve",
      "caption": "Saltleetby-Theddlethorpe Dunes National Nature Reserve 2. This important Nature Reserve contains tidal sand and mudflats, salt and freshwater marshes and sand dunes. This photo shows the inland edge of the reserve with small car park, and a World War II pill box."
    }
  ],
  "distance_km": 3.5,
  "description": "This seaside town in Lincolnshire has some lovely walks with sand dunes, a fine beach and attractive coastal gardens to explore. This walk from the town follows the promenade south to the neighbouring village of Sutton on Sea. It's about a 2.5 mile walk along the pleasant flat path with nice views of the beach and sea for the duration. The route starts on the sea front in Mablethorpe and follows the paths south to Trusthorpe before coming to Sutton. On the way you'll pass the pretty Queen's Park where there are some lovely gardens and a large boating lake to see. To continue your walking around the town head north to visit the Saltfleetby - Theddlethorpe Dunes Nature Reserve. The attractive reserve contains tidal sand and mudflats, salt and freshwater marshes and sand dunes. It's a great place for wildlife spotting and located just north of the town at postcode LN11 7TS for your sat navs. Just beyond the reserve is the neighbouring village of Saltfleet where there are nice views of Saltfleet Haven. The historic village also includes a series of listed buildings including a 13th century church, a 19th century windmill and two fine local pubs dating back hundreds of years. Donna Nook Nature Reserve is also located in this area and another prime area for wildlife and walks near the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Beck is a good choice for some refreshments in the town. They are located close to the beach and have a large car park, a carvery and a nice patio area to sit out on in the summer months. You can find them at postcode LN12 1LU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The promenade walk is a nice one to do with your dog and the Beck mentioned above is dog friendly in the outdoor section where fresh water is provided."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue south along the coast you will soon come to the popular resort of Skegness. You could follow the promenades on the Mablethorpe To Skegness Cycle Route as this is mostly suitable for walkers. A few miles to the south west is the market town of Alford. Here you can see Alford Manor House, a 13th century church and the five sailed Alford Windmill. Head a few miles inland and you will come to the town of Louth where you can pick up the Louth Canal Walk. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/vQeD-mZZvi0",
  "postcode": "LN12 1AL",
  "district": "Mablethorpe",
  "county": "Lincolnshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}