{
  "created_at": "2025-01-06T01:17:13.104238+00:00",
  "objectID": "059a96d4d3f86f538f7fdb794d94589a",
  "ref": "tennyson-trail-walking-route",
  "title": "Tennyson Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/View_towards_Brighstone_from_Tennyson_Trail_on_Brighstone_Down%2C_showing_Row_Down_-_geograph.org.uk_-_539964.jpg",
  "nearby": [
    {
      "description": "Hamstead Trail",
      "objectID": "0f7051a31e721e6908299b578c93b8b1",
      "ref": "hamstead-trail-walking-route"
    },
    {
      "description": "Isle of Wight Coast Path",
      "objectID": "4979849124ccb54d7e6cfffa6543ccb7",
      "ref": "isle-of-wight-coast-path-walking-route"
    },
    {
      "description": "Yarmouth to Freshwater Bay",
      "objectID": "471e25474aa6ff8cf85d612df40f9539",
      "ref": "yarmouth-to-freshwater-bay-walking-route"
    },
    {
      "description": "Brighstone Forest",
      "objectID": "13c66ff11e0f749d6ecf5f1ead2416cd",
      "ref": "brighstone-forest-walking-route"
    },
    {
      "description": "Alum Bay and Headon Warren",
      "objectID": "af57c712025a06390a7989dff884b0c4",
      "ref": "alum-bay-and-headon-warren-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/059a96d4d3f86f538f7fdb794d94589a.gpx",
  "_geoloc": {
    "lat": 50.6910074455,
    "lng": -1.3196307334
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/View_towards_Brighstone_from_Tennyson_Trail_on_Brighstone_Down%2C_showing_Row_Down_-_geograph.org.uk_-_539964.jpg",
      "title": "Peter Facey / View towards Brighstone from Tennyson Trail on Brighstone Down, showing Row Down",
      "caption": "View towards Brighstone from Tennyson Trail on Brighstone Down, showing Row Down on a misty morning. The hill in middle distance is east of Moortown and called Row Down. Beyond this hill, the coastline of the Isle of Wight can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/View_from_the_Tennyson_Trail_-_geograph.org.uk_-_1408304.jpg/256px-View_from_the_Tennyson_Trail_-_geograph.org.uk_-_1408304.jpg",
      "title": "Ian Capper / View from the Tennyson Trail",
      "caption": "Viewed from Newbarn Down on the Tennyson Trail. Here you can see the Rowridge BBC Transmitter over the edge of the hill and the chimney of Fawley Power Station in the distance, over the Solent.Photo taken in the summer of 2009"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Tennyson_Trail_descends_to_Carisbrooke_-_geograph.org.uk_-_498333.jpg",
      "title": "Graham Horn / Tennyson Trail descends to Carisbrooke",
      "caption": "The trail descends to Carisbrooke. The Trail is one of the island's named trails across the western part of the island, here descending towards Carisbrooke as a byway in a sunken lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Carisbrooke_Castle_-_geograph.org.uk_-_528953.jpg",
      "title": "Paul Collins / Carisbrooke Castle",
      "caption": "Carisbrooke Castle. Looking from the southern wall of the Castle into the centre of the Castle grounds. Charles I was imprisoned at the castle in the months prior to his trial. Here you can wander the moat to discover King Charles I’s bowling green. There's also the lovely Princess Beatrice Garden and the famous Carisbrooke donkeys."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/The_Tennyson_Monument%2C_Tennyson_Down_-_geograph.org.uk_-_515913.jpg/256px-The_Tennyson_Monument%2C_Tennyson_Down_-_geograph.org.uk_-_515913.jpg",
      "title": "Jim Champion / The Tennyson Monument, Tennyson Down",
      "caption": "The Tennyson Monument on Tennyson Down. The poet Alfred Lord Tennyson used to live at nearby Farringford House. This chalk hill was part of the Farringford Estate and Tennyson would walk this hill daily. His son left the downland to the National Trust. In 1897 this Celtic cross was erected to Tennyson's memory. The inscription on the far side reads: \"IN MEMORY OF ALFRED LORD TENNYSON THIS CROSS IS RAISED A BEACON TO SAILORS BY THE PEOPLE OF FRESHWATER & OTHER FRIENDS IN ENGLAND AND AMERICA\" It is situated on the highest point of the downs, nearly 150 metres above sea level."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Tennyson_Trail_above_Carisbrooke_-_geograph.org.uk_-_498337.jpg",
      "title": "Graham Horn / Tennyson Trail above Carisbrooke",
      "caption": "The trail above Carisbrooke. Only half a mile outside Carisbrooke and the trail is already remote and high above the surrounding land. This is a short section of open grassland in between enclosed sections of the byway. Carisbrooke Castle (next square east) can be seen in the valley to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Junction_between_Worsley_and_Tennyson_Trails_on_Brighstone_Down_-_geograph.org.uk_-_540001.jpg",
      "title": "Peter Facey / Junction between Worsley and Tennyson Trails on Brighstone Down",
      "caption": "Junction between Worsley and Tennyson Trails on Brighstone Down The Worsley Trail (behind camera) here joins the Tennyson Trail (ahead, and right, where it enters Brighstone Forest)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Junction_on_Bowcombe_Down_-_geograph.org.uk_-_498357.jpg",
      "title": "Graham Horn / Junction on Bowcombe Down",
      "caption": "Junction on Bowcombe Down"
    }
  ],
  "distance_km": 23.0,
  "description": "This walk runs from Newport to Alum Bay via Brighstone, Freshwater and Tennyson Down. The walk starts at Carisbrooke, near the fascinating Carisbrooke Castle where Charles I was imprisoned. You can enjoy the new Princess Beatrice Garden and the tranquil chapel at this fine historical attraction. Use google street view below to explore the castle. You then head through the beautiful Brighstone Down and Brighstone Forest before arriving at the coast where there are splendid views over Freshwater towards Alum Bay and The Needles. The final section takes you through the coastal Freshwater Bay Golf course and then through Tennyson Down before finishing at the delightful Alum Bay. This is quite a challenging walk with several climbs through the downs, but there are terrific views of the island to enjoy throughout. To further explore this part of the island you can pick up the Hamstead Trail, Isle of Wight Coast Path or the Freshwater Trail from Yarmouth to Freshwater Bay .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route you can stop off for refreshments at the National Trust tea at the batteries in the Needles park. The tea room is in an attractive vintage style with transporting you back to the 1940s. There's excellent views over the area as the tea-room is located in the Port War Signal Station that was specifically built to give the clearest, closest views of shipping in the Solent and around the Needles."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail makes for a fine dog walk and the tea room at the batteries mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Freshwater Bay is notable as the former home of Poet Laureate Alfred Lord Tennyson, after which the trail is named. He was the Poet Laureate during much of Queen Victoria's reign and wrote the famous poem \"The Charge of the Light Brigade\". The trail is also mostly suitable for cyclists though it is mainly an off road track so a mountain bike or hybrid would be required. In Newport you can extend your walking in the expansive Parkhurst Forest. The forest is criss crossed with miles of good walking and cycling trails. It's also great for wildlife spotting with the resident red squirrels of particular note. You'll also pass through Brighstone Forest on the southern side of the island. There's a good viepoint here on Brighstone Down and on the nearby Limerstone Down which includes a handy toposcope. Brighstone is the largest area of woodland on the island with Parkhurst the second largest. Near here there's also the National Trust's Mottistone Manor to visit. Here you'll find beautiful gardens and bluebell woods in the grounds surrounding this historic Elizabethan manor house. The Red Squirrel Trail also passes through Newport. This long distance cycle route explores some of the most attractive countryside and coast on the island. For more walking ideas in the area see the Isle of Wight Walks page."
    }
  ],
  "district": "Carisbrooke",
  "county": "Isle of Wight",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Calbourne Road, Gunville, Newport, Carisbrooke, Isle of Wight, England, PO30 1NX, United Kingdom",
  "postcode": "PO30 1NX",
  "state": "England"
}