{
  "objectID": "059c9ef07681d8f0c122ade36932761e",
  "created_at": "2024-12-19T12:26:51.049175+00:00",
  "ref": "balderhead-blackton-and-hury-reservoirs-walking-route",
  "title": "Balderhead Blackton and Hury Reservoirs Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/39/Balderhead_reservoir_from_west_of_Carnigill_-_geograph.org.uk_-_1584596.jpg",
  "nearby": [
    {
      "description": "Grassholme Reservoir",
      "objectID": "12306e7b4d8bef3d64235e4e194a2192",
      "ref": "grassholme-reservoir-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Teesdale Way",
      "objectID": "bee1da20e3a1d771ea9f89b5a2d25ba9",
      "ref": "teesdale-way-walking-route"
    },
    {
      "description": "Romaldkirk",
      "objectID": "bbbe134eb0196a0876ea0b281a16f8b5",
      "ref": "romaldkirk-walking-route"
    },
    {
      "description": "Mickle Fell",
      "objectID": "1416454f18583601d517239f0c1cce0d",
      "ref": "mickle-fell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/059c9ef07681d8f0c122ade36932761e.gpx",
  "_geoloc": {
    "lat": 54.5631881209,
    "lng": -2.1137061679
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Balderhead_reservoir_from_west_of_Carnigill_-_geograph.org.uk_-_1584596.jpg",
      "title": "Andy Waddington / Balderhead reservoir from west of Carnigill",
      "caption": "Balderhead reservoir from west of Carnigill. The public road to Balderhead ends at a small car park just west of Carnigill - the track continues beyond a locked gate. This view looks over the wall a little east of the road end, past Carnigill farm and down to the north shore of the reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Baldersdale_-_geograph.org.uk_-_855008.jpg",
      "title": "Mick Garratt / Baldersdale",
      "caption": "Baldersdale. View from the top of the dam. About half the outlet pool is in this grid square. On the left buttercups dominate the fields of Hannah's Meadow Nature Reserve. The Pennine Way crosses the river over the small bridge, centre. Far right is the 389m flat topped summit of Goldsborough."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Balderhead_Dam_-_geograph.org.uk_-_1226165.jpg",
      "title": "Peter McDermott / Balderhead Dam",
      "caption": "Balderhead Dam from beneath Water Knott."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Bridleway_south_of_Clove_Lodge_-_geograph.org.uk_-_1567832.jpg",
      "title": "Andy Waddington / Bridleway south of Clove Lodge",
      "caption": "Bridleway south of Clove Lodge, just to the south of the reservoirs. Two bridleways head onto the moor south of Clove Lodge - the more easterly is the Pennine Way which crosses the moor. Between the Pennine Way and How Sike is this bridleway which the map shows rather pointlessly heading south for a mile and just ending. In practice, the vehicle track doesn't follow the line of the bridleway on the map, and does indeed evaporate, though at the point where this photo was taken it is both well-defined and still where the map shows it. The view looks north over the route taken by the Pennine Way between Balderhead reservoir (whose dam is visible on the left) and the smaller Blackton Reservoir as it heads onto Hunderthwaite Moor on its way to Upper Teesdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/The_top_of_Hury_reservoir_-_geograph.org.uk_-_1577878.jpg",
      "title": "Andy Waddington / The top of Hury reservoir",
      "caption": "View from the top of Hury reservoir. This dam holds back a small area of water between Hury reservoir and Blackton reservoir, and is the source for the long spillway which bypasses Hury reservoir on its right. The \"care when casting\" sign indicates that fishing is allowed at this end of the reservoir (unlike at the dam), but not much else is. There is no flow at all in the spillway at this point in dry conditions, so unauthorised boat launching would be pointless. But it is noticeable that various field drains add a little volume to the spillway on its way down, so that there may be a usable flow by the time the dam is reached, and weirs there add more."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/The_start_of_the_Balder_descent_-_geograph.org.uk_-_1577858.jpg/512px-The_start_of_the_Balder_descent_-_geograph.org.uk_-_1577858.jpg",
      "title": "Andy Waddington / The start of the Balder descent",
      "caption": "The start of the Balder descent. The River Balder has not been free-flowing since the Hury reservoir was built in 1892, so any navigation by boat must now start here.The pool below the overspill channel is readily accessible through a gate to the right of this photograph, though there is no convenient parking nearer than either end of the dam. The south end car park is very open to scrutiny by water company staff which may be an issue for some paddlers depending on intentions. The River needs a lot more water in it than this to be paddled, and trees can be a significant hazard. Most of the flow is coming from the tailrace somewhat hidden behind the grassy bank to the right of the picture, with only a small amount coming down the spillway. The spillway itself has seen descents by canoeists, but the authorities do not really approve. If there is enough water to paddle the river, the spillway is likely to be very fast with a significant impact and stopper at the bottom - canoe descents seem to have mostly been done in a low level such as seen here, at which level the river will not really \"go\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Footbridge_over_Hunder_Syke_-_geograph.org.uk_-_685640.jpg",
      "title": "Gordon Hatton / Footbridge over Hunder Syke",
      "caption": "Footbridge over Hunder Syke. On the bridleway between West New Houses and Birk Hat and just 50 metres or so above where this little side stream enters Blackton Reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/View_over_Blackton_Reservoir_-_geograph.org.uk_-_684749.jpg",
      "title": "Matthew Hatton / View over Blackton Reservoir",
      "caption": "View over Blackton Reservoir"
    }
  ],
  "distance_km": 7.5,
  "description": "This walk visits a series of picturesque reservoirs in Baldersdale, on the east side of the Pennines. The walk starts at the parking area at the eastern end of Balderhead Reservoir where there are wonderful views over the water to the surrounding countryside. You then head around Blackton Reservoir to the western end of Hury Reservoir, before returning to Balderhead via the Pennine Way. It's a fairly easy walk with some waterside sections and wonderful views of the beautiful Baldersdale. The area around Blackton Reservoir is a nature reserve so look out for a variety of wildlife on your walk. If you would like to continue your walk you could follow the Pennine Way north to the nearby Grassholme Reservoir .",
  "video_url": "https://www.youtube.com/embed/lY74XHN14KY",
  "postcode": "DL12 9UX",
  "county": "County Durham",
  "region": "North East",
  "country": "England"
}