{
  "created_at": "2025-01-06T04:09:43.114671+00:00",
  "objectID": "05d3acde107d6a2e780d6c86390e660c",
  "ref": "almondsbury-walking-route",
  "title": "Almondsbury Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Bowl_Inn%2C_Almondsbury_-_geograph.org.uk_-_300054.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/05d3acde107d6a2e780d6c86390e660c.gpx",
  "_geoloc": {
    "lat": 51.5540580242,
    "lng": -2.573203521
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Bowl_Inn%2C_Almondsbury_-_geograph.org.uk_-_300054.jpg",
      "title": "Stephen McKay / Bowl Inn, Almondsbury",
      "caption": "Bowl Inn, Almondsbury. Despite its proximity to the northern edge of Bristol's suburbs and the M4/M5 intersection, the village retains a rural air. The Bowl is a traditional village pub - seen here from the church gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Almondsbury_Village_and_the_New_Severn_Bridge_-_geograph.org.uk_-_685324.jpg",
      "title": "Roger Stennett / Almondsbury Village and the New Severn Bridge",
      "caption": "A view from Almondsbury Hill over the village to the New Severn Bridge. Townsend Lane can be seen, and the New Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/From_Almondsbury_church_spire_to_the_old_Severn_Bridge_-_geograph.org.uk_-_959023.jpg",
      "title": "Jonathan Billinger / From Almondsbury church spire to the old Severn Bridge",
      "caption": "From Almondsbury church spire to the old Severn Bridge. This fine view from Over Lane north to the \"bedstead\" of the bridge and the hills of the Forest of Dean in the blue distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Green_space_in_Almondsbury_-_geograph.org.uk_-_958985.jpg",
      "title": "Jonathan Billinger / Green space in Almondsbury",
      "caption": "Green space to the south of the village. Land adjacent to the Garden Centre, with Over Lane in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Plant_area_at_Almondsbury_Garden_Centre_2_-_geograph.org.uk_-_958982.jpg",
      "title": "Jonathan Billinger / Plant area at Almondsbury Garden Centre 2",
      "caption": "Plant area at Almondsbury Garden Centre. View north-east from the back of the shop. The wooden building houses the plant advice centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Red_companions_by_the_village_green_-_geograph.org.uk_-_1363200.jpg",
      "title": "Ruth Sharville / Red companions by the village green",
      "caption": "Red companions by the village green"
    }
  ],
  "distance_km": 1.6,
  "description": "This village on the outskirts of Bristol has a nice rural feel and a fine local viewpoint to visit. The historic settlement also includes a 12th century church and a noteworthy 16th century pub. This circular walk from the village climbs to the nearby Almondsbury Hill and then visits the green space and garden centre to the south. The walk starts in the village centre and heads south to visit the viewpoint at Almondsbury Hill. From here there's splendid views over the Severn floodplain, South Wales, the Forest of Dean, the River Severn and the Severn Bridge. After taking in the views you descend to the south to visit the Almondsbury Green Space and the adjacent garden centre. The centre is a nice place to stroll around and includes a good quality restaurant where you could enjoy some refreshments before heading back to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The 16th century Bowl Inn is a fine place for some post walk refreshment. The traditional pub includes thick stone walls, rustic beams and open fires. Outside there's a nice patio area for warmer days. They serve fine local food and have a good selection of ales too. You can find them on 16 Church Road with a postcode of BS32 4DT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The route makes for a fine dog walk and the Bowl Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west of the village and you can pick up the riverside path along the Severn on the popular Severn Beach Walk. Just to the north there's some nice trails around Old Down Country Park near Olveston. For more walking ideas in the area see the Gloucestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/I_H_zK8_VD0",
  "postcode": "BS32 4DS",
  "district": "Almondsbury",
  "county": "South Gloucestershire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}