{
  "created_at": "2025-01-06T09:29:15.544232+00:00",
  "objectID": "0669dadab4b3865af458053ec5a9e392",
  "ref": "bromley-walking-route",
  "title": "Circular Walk around Bromley Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Jubilee_Country_Park_grassland.JPG/256px-Jubilee_Country_Park_grassland.JPG",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0669dadab4b3865af458053ec5a9e392.gpx",
  "_geoloc": {
    "lat": 51.3919232518,
    "lng": 0.0690170407
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Jubilee_Country_Park_grassland.JPG/256px-Jubilee_Country_Park_grassland.JPG",
      "title": "Dudley Miles / CC0",
      "caption": "Jubilee Country Park grassland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Formal_Garden_in_High_Elms_Country_Park_-_geograph.org.uk_-_1006191.jpg",
      "title": "David Anstiss / Formal Garden in High Elms Country Park",
      "caption": "Formal Garden in High Elms Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Keston%2C_lawn_on_Hayes_Common_-_geograph.org.uk_-_1045080.jpg",
      "title": "Chris Downer / Keston: lawn on Hayes Common",
      "caption": "Keston: lawn on Hayes Common A drinking fountain punctuates this lawn at the southern end of Hayes Common, alongside Keston village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Clearing_in_Keston_Common.jpg/256px-Clearing_in_Keston_Common.jpg",
      "title": "Ethan Doyle White / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Clearing in Keston Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Market_Square%2C_Bromley_-_geograph.org.uk_-_1162719.jpg",
      "title": "Stacey Harris / Market Square, Bromley",
      "caption": "Market Square, Bromley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Looking_towards_Crofton_Heath_-_geograph.org.uk_-_3926545.jpg/512px-Looking_towards_Crofton_Heath_-_geograph.org.uk_-_3926545.jpg",
      "title": "Looking towards Crofton Heath by Marathon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking towards Crofton Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Hayes_Common_between_Commonside_and_Baston_Road%2C_BR2_-_geograph.org.uk_-_2269338.jpg",
      "title": "Hayes Common between Commonside and Baston Road, BR2 by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hayes Common between Commonside and Baston Road, BR2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Mallards_on_the_central_pond_at_Keston_%282%29_-_geograph.org.uk_-_2269584.jpg",
      "title": "Mallards on the central pond at Keston (2) by Mike Quinn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mallards on the central pond at Keston"
    }
  ],
  "distance_km": 19.0,
  "description": "This London town is part of the London Borough of Bromley, the southeasternmost of the 32 London boroughs that make up Greater London. This circular walk around the borough uses part of the London Loop to take you to some of the walking highlights of the Bromley area. You'll visit Jubilee Country Park, Crofton Heath, High Elms Country Park, Hayes Common and Keston Common. There's lots of attractive parkland, peaceful woods and countryside views to enjoy on this varied walk. The route runs for about 12 miles with some moderate climbs on the way. The walk starts in Jubilee Country Park where there is a public car park. You could also start from Petts Wood station which is just to the south east of the park. The pretty park is also a nature reserve with 62 acres of wildflower meadows, hedgerows and semi-natural ancient woodland to explore. You can find it at a postcode of BR5 1DA for your sat navs. In the park you can pick up the London Loop and follow the waymarked footpath south west to Crofton Heath and Roundabout Wood. Follow the woodland trails through the woods and continue south past Orpington. The trail eventually leads to High Elms Country Park near Green Street Green. The 250 acre country park includes attractive formal gardens, woodland and a 19th century Yew Avenue. After passing through the park the route turns west to lead you to Keston Common. The common includes woodland, heathland, dry acid grassland and three pretty ponds with lots of flora and fauna to see. After leaving the common you head north west to Hayes Common where there's some pretty heather moorland. The route then turns north east toward Brook Wood, Scrogginhall Wood and Bromley Common. Here you follow a footpath past Bromley golf course and Southborough before returning to Jubilee Country Park where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk you could stop off for refreshments at the Fox Inn at Keston Common. (postcode: BR2 6BQ). The pub sits next to the common and includes a nice large beer garden to relax in during the summer months. There's also The Greyhound pub here which does a great Sunday Roast."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking with miles of woodland trails, parkland and open heathland for them to explore. The Greyhound pub at Keston mentioned above is also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you'd like to visit the area by public transport them Hayes Station and Petts Wood station are both on the route. To contine your walking around Bromley head to Beckenham Place Park and Elmstead Woods where there's lots more good trails to try. You could also pick up the Petts Wood Circular Walk near the start of the walk at Jubilee Country Park. Also nearby is the wonderful Eltham Palace, run by English Heritage. The fine 1930s house is surrounded by 19 acres of award-winning gardens and a moat. The Nash Circular Walk is another nice option. It starts in the nearby hamlet of Nash and follows trails to Hayes Common and Keston Common. For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7oLXl70Fsr4?si=1VdFYSS_rIn3WpHp",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Tent Peg Lane, Petts Wood, London Borough of Bromley, London, Greater London, England, BR5 1BY, United Kingdom",
  "postcode": "BR5 1BY",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "grassland"
  ],
  "points_of_interest": [
    "parkland",
    "countryside views",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}