{
  "created_at": "2025-01-06T00:22:39.062289+00:00",
  "objectID": "066f313ea472572dd7ed8e8225c4b39b",
  "ref": "plumpton-rocks-walking-route",
  "title": "Plumpton Rocks Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Plumpton_Rocks_-_geograph.org.uk_-_32590.jpg",
  "nearby": [
    {
      "description": "Harlow Carr to Valley Gardens",
      "objectID": "4ceaab8aa1ccf12ff137813d8b322665",
      "ref": "harlow-carr-to-valley-gardens-walking-route"
    },
    {
      "description": "Harrogate Ringway",
      "objectID": "3275bc6154901552601730d06dfaafeb",
      "ref": "harrogate-ringway-walking-route"
    },
    {
      "description": "Knaresborough River Walk",
      "objectID": "24b7650403fe79d82675fe579373b62f",
      "ref": "knaresborough-river-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/066f313ea472572dd7ed8e8225c4b39b.gpx",
  "_geoloc": {
    "lat": 53.9758373211,
    "lng": -1.4599365429
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Plumpton_Rocks_-_geograph.org.uk_-_32590.jpg",
      "title": "Chris McLean / Plumpton Rocks",
      "caption": "Plumpton Rocks. View across the lake to the gritstone rocks. The lake was created by the Earl of Harewood from what was once a quarry. It is one of the most important landscape gardens in the North of England. It has been declared by English Heritage to be of outstanding interest and is rated as Grade 2."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Plumpton_Rocks_-_geograph.org.uk_-_1012606.jpg",
      "title": "David Pickersgill / Plumpton Rocks",
      "caption": "This arm of the lake leads to a small boathouse tunnelled into the rock, the entrance to which is hidden by the rhododendron leaves in the bottom right-hand corner of the photograph from 2008. The boathouse was created by tunnelling into the rock and still be entered."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Plumpton_Rocks_-_geograph.org.uk_-_1276054.jpg",
      "title": "Tom Blackwell / Plumpton Rocks",
      "caption": "A walker admires the view across the lake. Situated between Harrogate and Wetherby in the North of England, Plumpton Rocks is a historic garden of 30-acres which is host to a range of strange and fascinating rock formations. The garden has been used in numerous television programs, and it is rumoured that Robin Hood once hunted deer there."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Sulphur_Tufts_-_geograph.org.uk_-_1012620.jpg",
      "title": "David Pickersgill / Sulphur Tufts",
      "caption": "Sulphur Tufts. A crowd of these small fungi, looking for all the world like little breadcakes, growing on a decaying tree stump at the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Plompton_High_Grange_-_geograph.org.uk_-_4786610.jpg/512px-Plompton_High_Grange_-_geograph.org.uk_-_4786610.jpg",
      "title": "Plompton High Grange by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Plompton High Grange. To the east of the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Plompton_Hall_%28geograph_4775776%29.jpg/512px-Plompton_Hall_%28geograph_4775776%29.jpg",
      "title": "Derek Harper / Plompton Hall",
      "caption": "Plompton Hall. Plompton Hall is a Grade II* listed building designed by the architect John Carr and built about 1760. It is located on the northern side of the site."
    }
  ],
  "distance_km": 1.5,
  "description": "These beautiful 30 acre gardens in Harrogate are a splendid place for an afternoon stroll. The area is geologically significant with a series of Millstone Grit rock formations overlooking a tranquil lake. There's also woodland trails with bluebells and rhododendrons. You can follow narrow paths through the dramatic rocks before a short climb to a lovely viewpoint overlooking the lake. The site has an interesting history dating back to the 18th century when the gardens were originally created. The artist J.M.W. Turner painted two oil paintings of the area called 'Plompton Rocks' after his first visit to Yorkshire in 1797. If you would like to extend your walk you could pick up the Harrogate Ringway which runs just to the west of the site. You can follow it through the Crimple Valley or towards Knaresborough. Also of interest is the Harlow Carr to Valley Gardens walk. This route visits two beautiful gardens which are situated only a mile apart in the town centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Unfortunately there's no cafe at the site so it's a nice idea to bring your own picnic. If you fancy a pub lunch then The Kestrel is located just to the west of the park. They serve high quality food and have a beautiful garden area if the weather is good. You can find them on Wetherby Road with a postcode of HG5 8LY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The gardens are a pleasant place for a dog walk, though you are advised to keep them on leads. The Kestrel pub mentioned above is also dog friendly in the bar area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a couple of miles north and you can pick up the Knaresborough River Walk. Here you can enjoy a stroll along the River Nidd and visit the historic 12th century Knaresborough Castle. For more walking ideas in the area see the Nidderdale Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zAuOoqDi8jo",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Plompton, Follifoot, North Yorkshire, York and North Yorkshire, England, HG5 8NA, United Kingdom",
  "postcode": "HG5 8NA",
  "district": "Follifoot",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rock"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}