{
  "created_at": "2025-01-06T05:14:30.545428+00:00",
  "objectID": "06b97e909edfc59a60c0d2fe1e632a42",
  "ref": "hillingdon-trail-walking-route",
  "title": "Hillingdon Trail Walking and Cycling Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Hillingdon_Trail_in_Mad_Bess_Wood%2C_Ruislip_-_geograph.org.uk_-_62479.jpg",
  "nearby": [
    {
      "description": "Ruislip Lido",
      "objectID": "8c4cbf29df14b173329547a28e543efb",
      "ref": "ruislip-lido-walking-route"
    },
    {
      "description": "Yeading Brook",
      "objectID": "0821c129e607ac66170401bb08153440",
      "ref": "yeading-brook-walking-route"
    },
    {
      "description": "Grand Union Canal Walk",
      "objectID": "dae6d837fcdb83dc44e94da2b24b4040",
      "ref": "grand-union-canal-walk-walking-route"
    },
    {
      "description": "Minet Country Park",
      "objectID": "2bccbd35df19e5836d6341f95398a999",
      "ref": "minet-country-park-walking-and-cycle-route"
    },
    {
      "description": "Colne Valley Trail",
      "objectID": "e2dd72c89baa5d0473703a87e5bb4a94",
      "ref": "colne-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Bayhurst Wood Country Park and Ruislip Woods",
      "objectID": "78556f35dcddc4b23825a34e27485355",
      "ref": "bayhurst-wood-country-park-and-ruislip-woods-walking-and-cycle-route"
    },
    {
      "description": "Celandine Route",
      "objectID": "a626717cb08d5e64f335d6fb2685150a",
      "ref": "celandine-route-walking-route"
    },
    {
      "description": "Cranford Country Park",
      "objectID": "c8dc00862dc6feeb50524bdf98d7a06e",
      "ref": "cranford-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/06b97e909edfc59a60c0d2fe1e632a42.gpx",
  "_geoloc": {
    "lat": 51.4850883089,
    "lng": -0.4160349557
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Hillingdon_Trail_in_Mad_Bess_Wood%2C_Ruislip_-_geograph.org.uk_-_62479.jpg",
      "title": "David Hawgood / Hillingdon Trail in Mad Bess Wood, Ruislip",
      "caption": "Hillingdon Trail in Mad Bess Wood, Ruislip. Part of Ruislip Woods National Nature Reserve. Ruislip Woods covers 726 acres and became the first National Nature Reserve in an urban area of England in 1997. The site includes grassland, ponds, streams, marshland and the delightful Ruislip Lido. The site is popular with Mountain bikers as there are a number of challenging off road trails. However there are also family cycle routes such as the David Brough cycle trail which is located in Bayhurst Wood and is suitable for all abilities of rider."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Hillingdon_Trail_by_Ickenham_Marsh_-_geograph.org.uk_-_18613.jpg",
      "title": "David Hawgood / Hillingdon Trail by Ickenham Marsh",
      "caption": "Ickenham Marsh. This part of the trail runs North from Western Avenue, alongside Yeading Brook and Ickenham Marsh. The low-lying marsh is an important ecological zone due to its range of plants and tall herbs, which attract a variety of bird species. Wetland areas like these often provide critical habitats for birds to feed, nest, and shelter, making them biodiversity hotspots. On the higher ground of this area, a developing woodland consists of oak and ash, along with hawthorn, blackthorn, and elder. Additionally, young elm trees are present, and the woodland floor supports species like broad-buckler ferns and male ferns, which thrive in the shaded areas. The Yeading Brook plays a central role in the habitat, flowing from north to south through the reserve. It runs alongside the Hillingdon Trail, a public footpath, making the area accessible to those interested in nature walks and birdwatching. This blend of marshland and woodland creates a rich environment for both plant and animal life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Footbridge_over_the_Grand_Union_Canal%2C_near_Southall_-_geograph.org.uk_-_22996.jpg",
      "title": "David Hawgood / Footbridge over the Grand Union Canal, near Southall",
      "caption": "Footbridge over the Grand Union Canal, near Southall. The canal here is the boundary between Ealing and Hillingdon. The path over the bridge is the Hillingdon Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Pond%2C_Minet_Country_Park_-_geograph.org.uk_-_93303.jpg",
      "title": "Ian Day / Pond, Minet Country Park",
      "caption": "Pond, Minet Country Park. The Minet Country Park is newly created from a derelict area used partly as car boot sale, & for motor cycle scrambling. It is now an attractive country park. Its features include a cycle track, children's playground, lodge, & areas that make it a nature reserve appreciated by many bird species & other wild life. For a \"Nature Trail\" around the Minet Country Park before and after its creation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Ruislip_Lido_-_geograph.org.uk_-_28051.jpg",
      "title": "Jack Hill / Ruislip Lido",
      "caption": "Ruislip Lido. This view shows the beach alongside the dam. The water is for the canal system. The lake is a popular spot in the summer with its artificial beach and super Mini gauge railway. There's also nice walking trails around the water and through the adjacent woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Yeading_Brook_-_geograph.org.uk_-_854341.jpg",
      "title": "Phillip Perry / Yeading Brook",
      "caption": "Yeading Brook in Ruislip. The route passes through the noteworthy Yeading Brook Meadows nature reserve. The pretty reserve consists of grassland and wild flowers such as the narrow-leaved water dropwort and common spotted orchid. Next to it you will find ten acre wood nature reserve where you will find meadow, marsh and woodland with wildlife such as hobbies and kingfishers to look out for."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/On_the_Hillingdon_Trail_-_geograph.org.uk_-_62031.jpg",
      "title": "Pip Rolls / On the Hillingdon Trail",
      "caption": "The trail picks out some interesting open spaces through a pretty densely populated area. Here it crosses the style on the left to go down to Bayhurst Wood Countryside Park near South Harefield."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Pasture_with_buttercups_by_Bayhurst_Wood_-_geograph.org.uk_-_827717.jpg",
      "title": "David Hawgood / Pasture with buttercups by Bayhurst Wood",
      "caption": "Pasture with buttercups by Bayhurst Wood"
    }
  ],
  "distance_km": 30.0,
  "description": "Travel through North London along the Hillingdon trail and enjoy parkland, countryside and waterside walking along the Grand Union Canal. The walk starts in Cranford Country Park and heads through the borough of Hillingdon passing West Ruislip and Harefield before finishing at Springwell Lock on the Grand Union Canal. There's much to enjoy on this walk including sections along the Grand Union Canal, the Yeading Brook and the delightful Ruislip Lido. Here you will find a reservoir with boating and sailing and the Ruislip Lido Railway which runs about one third of the distance around the reservoir. There's also sections through Bayhurst Wood Country Park and Ruislip Woods and Minet Country Park where there's ponds, grassland and a variety of wild plants and flowers. The route is mainly for walkers but some sections are also suitable for cyclists. For example mountain biking is popular in Ruislip Woods and the canal has a nice waterside path for cycles.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Ruislip Lido is a nice place to stop and enjoy a waterside snack. There are two options here with the Waters Edge pub located next to the car park on the western side of the lake. They have a good menu and outdoor seating with views over the water. There's also the Ruislip Lido Cafe at the south eastern edge of the lake. In Harefield there's the splendid The Old Orchard to consider. They have a lovely large garden area where you can enjoy a meal outside on finer days. From there's a wonderful view towards the surrounding countryside, rivers and lakes of the Colne Valley. They also have a charming interior with interesting old photos on the wall. They serve a good range of high quality food and have a good drinks selection as well. You can find them to the north west of the woods at Park Lane with a postcode of UB9 6HJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Harefield you can join with the Colne Valley Trail and enjoy a walk or cycle along a series of pretty lakes and the River Colne. In Ruislip you can link up with the Celandine Route. This popular walk will take you along the River Pinn from Pinner to Cowley. For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZdLAwXlhaIU?si=FmaOCDgtG1j78Xq_",
  "postcode": "UB3 5HE",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cranford Lane, London Borough of Hillingdon, London, Greater London, England, UB3 5HE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "waterside"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "natural habitats"
  ],
  "facilities": [
    "car park",
    "dog friendly",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}