{
  "created_at": "2025-01-06T02:45:04.532143+00:00",
  "objectID": "06e08979e1553d2b99d8cbc780b756aa",
  "ref": "bognor-regis-walking-route",
  "title": "Bognor Regis Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Bognor_Regis_Pier_-_geograph.org.uk_-_1751557.jpg/512px-Bognor_Regis_Pier_-_geograph.org.uk_-_1751557.jpg",
  "nearby": [
    {
      "description": "Pagham Harbour",
      "objectID": "6d427ed206907a4b53e7d5f39d94fc93",
      "ref": "pagham-harbour-walking-route"
    },
    {
      "description": "Arundel to Littlehampton River Walk",
      "objectID": "3e56d70d6df624a704fcd66c4e34489c",
      "ref": "arundel-to-littlehampton-river-walk-walking-route"
    },
    {
      "description": "Arundel Castle and Arundel Park",
      "objectID": "3d5f64490358fe3cbbfe3aca6da0d74d",
      "ref": "arundel-castle-and-arundel-park-walking-route"
    },
    {
      "description": "Slindon Estate",
      "objectID": "b01279a6808337c1a74e498a66d199c1",
      "ref": "slindon-estate-walking-route"
    },
    {
      "description": "Burpham",
      "objectID": "140a2a0f9a6bf4be1e73d71a91dd5f78",
      "ref": "burpham-walking-route"
    },
    {
      "description": "Littlehampton",
      "objectID": "299795fe50efc0861691d28d13ff467f",
      "ref": "littlehampton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/06e08979e1553d2b99d8cbc780b756aa.gpx",
  "_geoloc": {
    "lat": 50.7811173888,
    "lng": -0.6762249314
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Bognor_Regis_Pier_-_geograph.org.uk_-_1751557.jpg/512px-Bognor_Regis_Pier_-_geograph.org.uk_-_1751557.jpg",
      "title": "Peter Trimming / Bognor Regis Pier",
      "caption": "Bognor Regis Pier - route start. The pier opened in 1865. Like other surviving piers, in England, the pier at Bognor is somewhat shorter than when it was in its prime."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Bognor_Regis_-_geograph.org.uk_-_537839.jpg",
      "title": "Pam Goodey / Bognor Regis",
      "caption": "The town and beach viewed from the pier."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Bognor_Rocks_-_geograph.org.uk_-_720156.jpg",
      "title": "Simon Carey / Bognor Rocks",
      "caption": "Bognor Rocks. Formed of London clay and exposed along the foreshore at low tide. The clay is initially grey but becomes brown on weathering. The rocks extend out to sea into the next grid square and are visible at low tide whilst providing home for sea life and plants."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/The_Arcade%2C_High_Street_-_geograph.org.uk_-_500818.jpg/256px-The_Arcade%2C_High_Street_-_geograph.org.uk_-_500818.jpg",
      "title": "Simon Carey / The Arcade, High Street",
      "caption": "The Arcade, High Street. An shopping arcade constructed by William Tate in 1902 providing the first focal shopping point in the developing town of Bognor. Its entrance is opposite London Road at its junction with High Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Aldwick_Beach_-_geograph.org.uk_-_720229.jpg",
      "title": "Simon Carey / Aldwick Beach",
      "caption": "Aldwick Beach. Looking back towards the shingle and houses lining the beach. Much of Aldwick Beach is backed onto by private estates."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Pagham_Harbour_-_geograph.org.uk_-_765625.jpg",
      "title": "Simon Carey / Pagham Harbour",
      "caption": "Pagham Harbour. Looking towards the mouth of the harbour from the footpath that follows the south western bank of the inlet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Pagham_Lagoon_-_geograph.org.uk_-_501346.jpg",
      "title": "Simon Carey / Pagham Lagoon",
      "caption": "Pagham Lagoon - the former mouth of Pagham Harbour. Taken from the eastern end of the footbridge with the caravans of Church Farm Holiday Village on the far bank. The footbridge separates the lagoon which is used for watersports from the reed beds used by wildlife."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Saltmarsh%2C_Pagham_Harbour_-_geograph.org.uk_-_501421.jpg",
      "title": "Simon Carey / Saltmarsh, Pagham Harbour",
      "caption": "Saltmarsh, Pagham Harbour. Taken from a small embankment jutting out into the inlet and looking back across the saltmarsh towards the shore which is marked by the trees. The latter also give a good indication of the direction of the prevailing winds."
    }
  ],
  "distance_km": 18.0,
  "description": "This popular seaside resort sits in a lovely spot on the West Sussex coast. There's some pleasant beachside walking, a lovely nature reserve to the west and some riverside trails along the Arun to the east. This walk from the town takes you west along the beach to visit one of the area's highlights at Pagham Harbour. The walk starts from the pier on the sea front and heads west along the beach to Aldwick and Pagham where you can enjoy a stroll around Pagham Lagoon. The route continues along Pagham Wall, taking you around the harbour to Sidlesham Quay. The area is includes a number of habitats with salt marsh, mudflats, farmland, copses, lagoons, reed beds and shingle beaches.It's also great for wildlife with birds including little egrets, ringed plovers and lapwings. After exploring the harbour you can then enjoy a walk through the countryside before returning to the coast and following the same paths back into Bognor. You can extend the walk by heading a little north from the sea front to visit Hotham Park. The landscaped park is a lovely place for a stroll with a boating lake, miniature railway, and 18th century house & a cafe. You can find it just east of the train station at Upper Bognor Rd with postcode PO21 1HW.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town one nice idea is to stroll up to Hotham Park and visit their on site cafe for some post walk refreshment. They serve very good food and have a nice outdoor seating area where you can enjoy views over the park. You can find them at postcode PO21 1HN. On the sea front there's also The Navigator Hotel to consider. They have a nice pub area serving good quality food and drinks. There's outdoor seating so you can enjoy your refreshment with a sea view. You can find them on Marine Drive with postcode PO21 2QA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coastal paths make for a fine dog walk and the Hotham Cafe and Navigator pub mentioned above are also dog friendly. Please not dogs are not allowed on the beach from Park Road to Gloucester Road during the summer months 1st May to 30th September. Around the Pagham Harbour area it's best to keep them on leads because of the wildlife. Dog water bowls are available at the RSPB visitor centre at the reserve."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east from the town you could visit Middleton-on-Sea and Atherington where there are more nice walks along the beach. Just beyond there is the resort of Littlehampton where you can pick up the Arundel to Littlehampton River Walk along the River Arun. Head north from the town and you can explore the South Downs around the historic Arundel Castle and Arundel Park and the expansive Slindon Estate. There's also the delightful riverside village of Burpham to explore in this area. For more walking ideas in the area see the Sussex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UnWtIFVcxhU",
  "postcode": "PO21 1PJ",
  "district": "Arun",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Esplanade, Bognor Regis, Felpham, Arun, West Sussex, England, PO21 1PJ, United Kingdom",
  "state": "England"
}