{
  "created_at": "2025-01-05T22:30:07.437453+00:00",
  "objectID": "070ec32736d13dd0dca252bcb514dd4c",
  "ref": "isle-of-whithorn-walking-route",
  "title": "Isle Of Whithorn Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Pier_at_the_Isle_of_Whithorn_-_geograph.org.uk_-_3810084.jpg?20220917082450",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/070ec32736d13dd0dca252bcb514dd4c.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Pier_at_the_Isle_of_Whithorn_-_geograph.org.uk_-_3810084.jpg?20220917082450",
      "title": "Pier at the Isle of Whithorn by Andy Farrington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pier at the Isle of Whithorn. Several key scenes from the 1973 horror film The Wicker Man were filmed in and around the Isle of Whithorn, adding to the area’s cinematic history. The film's dramatic climax was set at Burrow Head and St Ninian's Cave, two striking local landmarks. Burrow Head's clifftops were particularly memorable as the location where the final, iconic scene of the film was shot. The production also involved local residents. Elizabeth McAdam Laughland, one of the co-owners of the Isle of Whithorn Castle, featured in the movie along with other locals who appeared in various roles throughout the film. These community contributions added an authentic regional touch to the film, blending local culture with the eerie atmosphere of The Wicker Man."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Isle_of_Whithorn_Harbour_-_geograph.org.uk_-_4061465.jpg/512px-Isle_of_Whithorn_Harbour_-_geograph.org.uk_-_4061465.jpg?20221128180055",
      "title": "Isle of Whithorn Harbour by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Isle of Whithorn Harbour. The harbour remains a central feature of the Isle of Whithorn, supporting both the local fishing fleet and leisure crafts. Fishing activities include light trawling and lobster fishing, while the harbour also serves as a popular stopover for pleasure boats and a launching point for small angling vessels and diving RIBs. The harbour’s history stretches back to the 16th century, with a more substantial pier built in 1790 to enhance commerce, particularly trade with Whitehaven and other English ports. The pier suffered significant storm damage in 1969 but was eventually rebuilt after persistent efforts by the local community. The harbour's perch—a rocky reef near the mouth of the bay—has been a navigation hazard for incoming vessels, historically marked by an iron pole. In the 19th century, the harbour had strong trade connections with Ireland and the Isle of Man. Ships were built and sailed from here, and the Countess of Galloway steam packet once provided regular service to Liverpool. However, by the late 20th century, commercial shipping had largely given way to leisure vessels. The Wigtown Bay Sailing Club welcomes visiting yachtsmen and offers facilities such as a dedicated visitors' berth at the quay's outer end and two slipways for boat launching. The club is active during the summer, hosting regular dinghy and cruiser races. An interesting historical feature of the harbour was a fish trap, which functioned by trapping fish as the tide receded—a feature still marked on maps as late as the 1850s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Isle_Head%2C_Isle_of_Whithorn_-_geograph.org.uk_-_3086879.jpg/512px-Isle_Head%2C_Isle_of_Whithorn_-_geograph.org.uk_-_3086879.jpg?20220119103447",
      "title": "Isle Head, Isle of Whithorn by Chris Andrews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Isle Head. The Isle of Whithorn’s promontory is almost divided by Chapel Port to the east and west, and approaching Isle Head, the artificial ditch of the Old Fort remains clearly visible. This site features a multivallate promontory fort, consisting of three prominent ramparts and two ditches, with a possible fourth rampart now visible only as a slight scarp. On the seaward side, rubble walls link natural outcrops of rock, particularly in the southeast corner, where inner and outer wall faces indicate a foundation of a wall about 3 yards wide. At the summit of the promontory, slight traces of rubble walls and artificial scarping can be found, along with possible remains of a hut circle in the northeast. A block of rig, visible between the path and the ramparts, further marks the area’s history. The furrows align from northeast to southwest across the promontory, hinting at past agricultural activity. In 1997, a witness cairn was erected on Isle Head to commemorate the arrival of St. Ninian, a Christian missionary to the region. Pilgrims are encouraged to place personal stones on this cairn, located in the remains of a lifeboat house. The Isle’s lifeboat station operated from 1869 to 1919, housing three lifeboats during its tenure, before closing when a motor lifeboat was stationed at Kirkcudbright. Another notable tribute is the Solway Harvester Seat, a granite bench that honours the local crew of the Solway Harvester, a fishing boat that sank in 2000. Along with the seat, an anchor inscribed with the vessel's name is placed atop a nearby hill beside the Cairn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/St_Ninian%27s_Chapel%2C_Isle_of_Whithorn_-_geograph.org.uk_-_5470714.jpg?20230924032505",
      "title": "St Ninian's Chapel, Isle of Whithorn by G Laird, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Ninian's Chapel. The ruins of Saint Ninian's Chapel were restored and partially rebuilt in 1898 by the Marquess of Bute, preserving its original features. The current structure is a rectangular building, measuring 31 feet by 16 feet 6 inches (9.4 m by 5.0 m). Archaeological excavations suggest that this 13th-century chapel replaced an earlier 12th-century version, which had a smaller nave and square chancel. The chapel was enclosed by a contemporary wall, with part of this wall still standing today. An outer enclosure, possibly of Celtic origin, has also been identified, forming a roughly oval area measuring about 100 feet by 110 feet (30 m by 34 m). There are no records indicating the chapel was used as a burial site. Saint Ninian is primarily remembered for his association with Whithorn, but many places in Scotland bear his name, reflecting his influence in converting the Southern Picts and his travels throughout southern Scotland. One such location is Saint Ninian's Isle near Kilwinning in the River Garnock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/The_Cairn%2C_Isle_of_Whithorn_-_geograph.org.uk_-_4061422.jpg/512px-The_Cairn%2C_Isle_of_Whithorn_-_geograph.org.uk_-_4061422.jpg?20221128175036",
      "title": "The Cairn, Isle of Whithorn by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Cairn. The most well-known landmark of the Isle is the square, white tower referred to locally as \"The Cairn.\" This tower has served as a navigational aid for sailors for centuries, guiding them along the coast. From this elevated vantage point, visitors can enjoy sweeping views of the Kirkcudbright coastline, the northern range of the English Lake District mountains, and to the south, the Isle of Man's distinctively rounded, mountainous form. During World War II, this site was used as a tracking station for anti-aircraft gunnery practice. Aircraft would fly up and down as gunners attempted to shoot them down, with initial practice involving radio-controlled \"Queen Bee\" planes. The concrete foundation that remains near the Cairn, now the site of the Solway Harvester memorial stone, was once the base for one of the control huts used during these exercises. The Solway Harvester memorial features an anchor set in a granite block, commemorating the fishing boat and its crew who were lost at sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Isle_of_Whithorn%2C_Isle_Castle_-_geograph.org.uk_-_1498864.jpg?20110302173156",
      "title": "Astrid Horn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Isle Castle. The Isle Castle is one of the oldest structures in the Isle of Whithorn village. Its layout is nearly square, though it retains the principle of an L-shaped design. The castle dates back to the 17th century, with a stone above the door engraved with the initials of Patrick Houston of Drummaston and his wife Margaret Gordon, along with the date 1674. This stone, originally above the main entrance, was later relocated. In the early 19th century, the building served as the residence of Sir John Reid, Superintendent of the Coastguard. The \"Captain's Garden,\" now featuring several houses, was once an extension into the harbour associated with the castle. The garden is noted for its decorative simulated gun ports, reminiscent of man-o'-war ships. The building has some unique architectural features, such as angle turrets on the second floor that are supported by three plain corbels, though these turrets are not visible from inside. Additionally, there was once a Gothic-style porch attached to the side of the castle near the Drumelan burn. On the other side of the Drummulin Burn from the castle stood the Bysbie corn mill, powered by a sizeable mill pond and sluice. The remnants of this mill are still located behind the Queen's Arms Hotel. Additionally, a chalybeate spring known as 'Spa Well' was situated below the castle, as noted on an 1850s map."
    }
  ],
  "distance_km": 1.1,
  "description": "This short circular walk explores the Isle of Whithorn in Dumfries and Galloway. The scenic, coastal village is notable as one of the most southerly villages and seaports in Scotland. On the walk you will visit the 13th-century Saint Ninian's Chapel and enjoy some splendid views over the harbour. Scroll down for photos with more information about this historic area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Cyclists can pick up the Machars Cycle Route which explores the peninsula on a series of quiet roads."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rn1hKqk5opc?si=lRfo5cCFa6OHbmj0",
  "gazetteer_found": false
}