{
  "created_at": "2025-01-06T08:56:41.791613+00:00",
  "objectID": "0770ab9c0b0351730e4d4c22929ec8bf",
  "ref": "holt-country-park-walking-and-cycle-route",
  "title": "Holt Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Entrance_to_Holt_Country_Park_-_geograph.org.uk_-_512497.jpg",
  "nearby": [
    {
      "description": "Sheringham Park",
      "objectID": "3f875e147dc723f57262c945a493643d",
      "ref": "sheringham-park-walking-and-cycle-route"
    },
    {
      "description": "Kelling Heath",
      "objectID": "dcc5b570459b882a884a2ff9800dbc2c",
      "ref": "kelling-heath-walking-route"
    },
    {
      "description": "Peddars Way and Norfolk Coast Path",
      "objectID": "4e358890f1c641370cd442450ff77e93",
      "ref": "peddars-way-and-norfolk-coast-path-walking-route"
    },
    {
      "description": "Cromer to Sheringham",
      "objectID": "00aa38d47847e18fcb357b1b3ebd6c6c",
      "ref": "cromer-to-sheringham-walking-route"
    },
    {
      "description": "Holt-Mannington Walk",
      "objectID": "4c1e71c0bfb11e59e76c3e49bd2837ed",
      "ref": "holt-mannington-walk-walking-route"
    },
    {
      "description": "Mannington Hall",
      "objectID": "c475597070c259e4d835fb9704d8828f",
      "ref": "mannington-hall-walking-route"
    },
    {
      "description": "Baconsthorpe Castle",
      "objectID": "e29af8f56deaa6140d13554733185605",
      "ref": "baconsthorpe-castle-walking-route"
    },
    {
      "description": "Rebellion Way",
      "objectID": "ce673553ec15d7a7286596120f836ac9",
      "ref": "rebellion-way-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0770ab9c0b0351730e4d4c22929ec8bf.gpx",
  "_geoloc": {
    "lat": 52.9000174535,
    "lng": 1.1013311213
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Entrance_to_Holt_Country_Park_-_geograph.org.uk_-_512497.jpg",
      "title": "Evelyn Simak / Entrance to Holt Country Park",
      "caption": "Entrance to the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Visitor_Centre%2C_Holt_Country_Park_-_geograph.org.uk_-_512502.jpg/256px-Visitor_Centre%2C_Holt_Country_Park_-_geograph.org.uk_-_512502.jpg",
      "title": "Evelyn Simak / Visitor Centre, Holt Country Park",
      "caption": "Visitor Centre, Holt Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Holt_Railway_Station_-_geograph.org.uk_-_1249150.jpg",
      "title": "Evelyn Simak / Holt Railway Station",
      "caption": "Holt Railway Station - to the north of the park. You can pick up the wonderful heritage railway here. The original Holt Station was opened on 1. October, 1884. It was a timber- built structure which had been the original Yarmouth Beach station. This station was replaced by an Eastern & Midlands Railway pavilion type structure in brick two years later which was destroyed by fire in 1926 and replaced in concrete. In 2000 the station building at Stalham became available, was dismantled and transported to Holt. The new station was opened in time for the 2005 season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/The_Railway_Tavern_-_Market_Place_-_geograph.org.uk_-_618346.jpg",
      "title": "Evelyn Simak / The Railway Tavern - Market Place",
      "caption": "The Railway Tavern - Market Place Holt. (Now closed and turned into retail units - 2016) is a rural Norfolk town with a market place, and a High Street lined by interesting Georgian houses and cottages, pubs and tearooms as well as unusual shops. Many of the former court yards and tradesmen's yards have been converted into shops or accommodation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/The_Market_Place_-_geograph.org.uk_-_618350.jpg",
      "title": "Evelyn Simak / The Market Place",
      "caption": "The Market Place in Holt town centre. Looking east along the Market Place with Gresham's school seen in the background. In 1066 Holt already had a market and a port (the coastal village of Cley being named in the Domesday Book as the port of Holt), five water mills and twelve plough teams."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Antiques_shop_on_Fish_Hill_-_geograph.org.uk_-_618364.jpg",
      "title": "Evelyn Simak / Antiques shop on Fish Hill",
      "caption": "Antiques shop on Fish Hill. This 18th century building now houses an Antiques shop. Fish Hill links Market Place with Bull Street and was once the site of the fish market, which was destroyed by the fire in 1708. The town survived the Plague of 1348, and by 1556 a school had been opened. The school (a public school since 1900) was founded by Sir John Gresham, and is described as one of the leading schools in the country. In 1708 the town was badly damaged by a fire, which destroyed most of the houses and left the church in the isolated position it occupies today. In Victorian times, Holt had a population of around 1700 and a daily coach service to Cromer, Norwich and London; the railway arrived in 1884."
    }
  ],
  "distance_km": 9.0,
  "description": "Explore nearly 100 acres of peaceful woodland in this country park in Norfolk. The park is situated around the River Glaven and contains several delightful trails through the woods including Scots Pine, Oak and Silver Birch. The park includes a Visitors Centre, a waymarked arts trail and a cycle route. The area is great for wildlife so keep your eyes peeled for grazing ponies, various woodland birds and butterflies fluttering around the park's wildflowers. After exploring the park you could head into the attractive Georgian town of Holt which is well worth exploring. The Holt-Mannington Walk starts in the park. The circular waymarked footpath will take you south east to Mannington Hall and Gardens near Itteringham. The historic house is surrounded by lovely parkland with delightful gardens, woodland and a lake to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The park includes an on site cafe where you can pick up a good range of meals and snacks. It's located at the start next to the car park. You could also head into the nearby market town of Holt and pay a visit to The Lawns. This Georgian house includes a large sunny terrace and south facing garden. It's a lovely spot to sit out and enjoy refreshments on a sunny day. You can find it at 26 Station Road with a postcode of NR25 6BS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is great for dog walking with its woodland trails. It is mostly off lead though you are advised to keep them under control with the wildlife and cyclists around."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east of the park you'll find Sheringham Park. It's another great place for walkers with a19th century hall, miles of peaceful woodland trails, landscaped gardens and great views of the Norfolk coast. Near here you can also pick up the Peddars Way and Norfolk Coast Path and follow it to Cley or Cromer. Also to the north of the park is Holt Railway Station. The station is the current terminus of the North Norfolk Railway, a splendid heritage steam railway. Also known as the Poppy line, the old steam trains will take you along the beautiful coast to Sheringham. Just a couple of miles to the east are the historic remains of Baconsthorpe Castle. Here you can explore the 15th century ruins of a fortified manor house which includes a moat and a pretty lake. The long distance Rebellion Way Cycle Route passes along the edge of the park. The epic 232 mile circular ride visits some of the major highlights of Norfolk, using a series of quiet country lanes and traffic free paths. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YUOO12p_jVM",
  "postcode": "NR25 6ES",
  "district": "North Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hempstead Road, Hempstead Road Industrial Estate, Holt, North Norfolk, Norfolk, England, NR25 6ES, United Kingdom",
  "state": "England"
}