{
  "objectID": "07c8de237761242bb9124600e37ada9e",
  "created_at": "2024-12-18T19:11:21.377723+00:00",
  "ref": "audlem-walking-route",
  "title": "Audlem Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Audlem_Locks_No_4%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_580005.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/42BA8A97248CC9D38625869B005383AA/$FILE/Audlem.gpx",
  "_geoloc": {
    "lat": 52.9878824911,
    "lng": -2.5101142505
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Audlem_Locks_No_4%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_580005.jpg",
      "title": "Roger  Kidd / Audlem Locks No 4, Shropshire Union Canal, Cheshire",
      "caption": "Audlem Locks No 4, Shropshire Union Canal, Cheshire. The concrete storage structure for stop-planks and the little building on the non towpath side of the lock are extra features"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Audlem_Mill%2C_Cheshire_-_geograph.org.uk_-_1704551.jpg",
      "title": "Roger  Kidd / Audlem Mill, Cheshire",
      "caption": "Audlem Mill. The Mill is known locally as Kingbur Mill and was built around 1916 (rather later than most early industrial buildings served by canal). It was always a corn and animal feed mill, and operated until the late 1960s or early 1970s. This red brick old building by the Shropshire Union Canal is now a craft studio and shop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Audlem_Methodist_Church%2C_Cheshire_-_geograph.org.uk_-_1704646.jpg",
      "title": "Roger  Kidd / Audlem Methodist Church, Cheshire",
      "caption": "Audlem Methodist Church. There are three churches in the village: the Methodist Church (in the picture), Audlem Baptist Church and the Parish Church of St James the Great. The churches work together to serve the village. Audlem Methodist Church was built in 1863, and has had extensions built subsequently."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/The_Shroppie_Fly_at_Audlem%2C_Cheshire_-_geograph.org.uk_-_546911.jpg",
      "title": "Roger  Kidd / The Shroppie Fly at Audlem, Cheshire",
      "caption": "The Shroppie Fly at Audlem. This canalside \"theme\" pub, formerly a warehouse, is very popular for ale, food, and music, especially in the summer boating season."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Audlem_Locks%2C_Shropshire_Union_Canal%2C_Cheshire_-_geograph.org.uk_-_1597811.jpg",
      "title": "Roger  Kidd / Audlem Locks, Shropshire Union Canal, Cheshire",
      "caption": "Audlem Locks, Shropshire Union Canal. This image shows the pound below the ninth lock, looking towards Lock No 10. The fifteen locks at Audlem alter the water level by a total of 93 feet, (about 28.4 metres) in one and three quarter miles (or 2.8 kilometres). The canal was fully opened in 1835, engineered by Thomas Telford, and is 66.5 miles in length. It was originally called the Birmingham and Liverpool Junction Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Canalware_sales_boat_at_Audlem%2C_Cheshire_-_geograph.org.uk_-_1601587.jpg",
      "title": "Roger  Kidd / Canalware sales boat at Audlem, Cheshire",
      "caption": "Canalware sales boat. All sorts of things can be bought from licensed traders on the canal system. This was the spring bank holiday ad the Audlem Festival was on, so there were plenty of people about later in the day to enjoy live music in all the pubs (and outdoors too)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Pasture_by_Moss_Hall_at_Audlem%2C_Cheshire_-_geograph.org.uk_-_1703893.jpg",
      "title": "Roger  Kidd / Pasture by Moss Hall at Audlem, Cheshire",
      "caption": "Pasture by Moss Hall at Audlem, Cheshire. Seen from the towpath side of the Shropshire Union Canal south of the Weaver Aqueduct, with telephoto assistance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Narrowboat_leaving_Adderley_Bottom_Lock%2C_Shropshire_-_geograph.org.uk_-_1596590.jpg",
      "title": "Roger  Kidd / Narrowboat leaving Adderley Bottom Lock, Shropshire",
      "caption": "Narrowboat leaving Adderley Bottom Lock, Shropshire. On the Shropshire Union Canal, there are five locks in the flight at Adderley. These raise or lower the water level by thirty-one feet ( about nine and a half metres) within a distance of about five hundred metres."
    }
  ],
  "distance_km": 4.0,
  "description": "This picturesque canalside village is a lovely place to explore on foot. The village is notable for its run of 15 locks, designed by Thomas Telford, which raise the canal from the Cheshire Plain to the higher Shropshire Plain. The settlement also includes the 17th century Moss Hall, the fine Audlem Mill, a popular waterside pub and views of the River Weaver on the western side. This walk from the village takes you south to Adderley along a section of the Shropshire Union Canal . It's a lovely section of the canal with a series of locks and some attractive countryside to see. The walk starts on the canal in the village near to the historic Audlem Mill which dates from 1916. You can pick up the towpath here and head south to Coxbank before coming to Adderley. Here you leave the canal to visit the village before retracing your steps to Audlem.",
  "video_url": "https://www.youtube.com/embed/jQOMXLHiOF0",
  "postcode": "CW3 0DX",
  "district": "Audlem",
  "county": "Cheshire East",
  "region": "North West",
  "country": "England"
}