{
  "created_at": "2025-01-06T04:25:37.751474+00:00",
  "objectID": "07fca5f66930ee3b86aff4bbda4594af",
  "ref": "farley-mount-country-park-walking-route",
  "title": "Farley Mount Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Triangulation_pillar_at_Farley_Mount_-_geograph.org.uk_-_236887.jpg/256px-Triangulation_pillar_at_Farley_Mount_-_geograph.org.uk_-_236887.jpg",
  "nearby": [
    {
      "description": "Clarendon Way",
      "objectID": "be9b3d39a746039072310331122caf4a",
      "ref": "clarendon-way-walking-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Mottisfont Abbey",
      "objectID": "22700f0dcb372258b5a0f4394243bf1f",
      "ref": "mottisfont-abbey-walking-and-cycle-route"
    },
    {
      "description": "Winchester Circular Walk",
      "objectID": "9195b696e0a83ee0c727e7afa0adb2e4",
      "ref": "winchester-circular-walk-walking-route"
    },
    {
      "description": "Winchester River Walk",
      "objectID": "e135c29aae951c527107669b95a0e0c4",
      "ref": "winchester-river-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/07fca5f66930ee3b86aff4bbda4594af.gpx",
  "_geoloc": {
    "lat": 51.063213589,
    "lng": -1.407343525
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Triangulation_pillar_at_Farley_Mount_-_geograph.org.uk_-_236887.jpg/256px-Triangulation_pillar_at_Farley_Mount_-_geograph.org.uk_-_236887.jpg",
      "title": "Jim Champion / Triangulation pillar at Farley Mount",
      "caption": "Triangulation pillar at Farley Mount. The trig pillar at Farley Mount is within the circular enclosure that surrounds the monument. There are good views across to the South Downs (in the distance here) and the Isle of Wight (not visible, off to the right)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/The_monument_at_Farley_Mount_-_geograph.org.uk_-_26204.jpg",
      "title": "Jim Champion / The monument at Farley Mount",
      "caption": "The monument at Farley Mount. This pyramidal obelisk was erected to the memory of a racehorse called \"Beware Chalk Pit\" which won the Hunters Plate at Worthy Down races in October 1734. The plaque at the monument say that \"underneath lies buried a horse the property of Paulet St John esq. that in the month of September 1733 leaped into a chalk pit twentyfive feet deep a foxhunting with his master on his back\". The story is that his master was so grateful that his surefooted horse prevented his early death that he had this monument built. Probing during the recent restoration revealed no evidence of a horse's remains under the mound. It is possible that the mound is a bronze-age bowl barrow, but no archaeological work has been carried out to confirm this."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Field_to_the_west_of_the_monument%2C_Farley_Mount_-_geograph.org.uk_-_1115260.jpg",
      "title": "Jim Champion / Field to the west of the monument, Farley Mount",
      "caption": "Field to the west of the monument. This field to the west of the monument at Farley Mount has been left unploughed, presumably because it is the site of an Iron Age settlement. Traces of the settlement can be seen in aerial photographs, but are not really obvious from ground level - even with a low sun casting long shadows across the field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/West_Wood_-_geograph.org.uk_-_1636910.jpg",
      "title": "Shaun Ferguson / West Wood",
      "caption": "West Wood track. Part of the country park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Bluebells_in_Crab_Wood_Hampshire_-_geograph.org.uk_-_468810.jpg",
      "title": "ValP, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bluebells in Crab Wood on the eastern side of the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Ashmore_Hill_Copse%2C_West_Wood_-_geograph.org.uk_-_77980.jpg",
      "title": "Peter Jordan / Ashmore Hill Copse, West Wood",
      "caption": "Ashmore Hill Copse, West Wood. Looking north from one of the car parks over West Wood."
    }
  ],
  "distance_km": 5.5,
  "description": "Farley Mount Country Park is located a few miles west of Winchester. It is a large area of open country and woods and a Local Nature Reserve. At the highest point there is a pyramid shaped folly that gives the park its name. From here there are fabulous views over the South Downs and the surrounding area. The route below is devised for walkers but cyclists can follow the marked bridleway that dissects the park and links to further routes in the surrounding countryside. This circular walk starts from the car park at the southern end of the site near the Ashmore Hill Copse. It runs for about 4 miles and starts by heading west from the car park to climb to the Mount where you'll find a distinctive pyramidal obelisk monument. It then goes onto explore the woodland area and visit the adjacent Crab Wood Nature Reserve. This sits on the eastern side of the park and includes oak, ash, maple and hazel coppice with lots of flora and fauna to see. Bluebells can be seen in the spring months while there are lots of different woodland birds to see throughout the year.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head south of the park and you could visit the village of Hursley. Here you'll find a historic pub of some note in the shape of The Dolphin Inn. The inn dates back to the 16th century and takes its name from the old HMS Dolphin, having apparently been built using the ship's timbers. There's a charming old interior with historic photos and stories with a nautical theme. The pub also includes a restored barn and stables with a fine garden area for warmer weather. You can find them in the village at postcode SO21 2JY."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As you'd imagine the woodland trails are ideal for dog walking so you'll probably bump into other owners on your visit. The Dolphin Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Clarendon Way runs along the southern edge of the park. The long distance footpath provides and opportunity for further exploring the surrounding area. If you follow it west it will take you to Parnholt Woods, Beacon Hill and King's Somborne. Near here you could pick up the Monarch's Way and follow it south to the splendid Mottisfont Abbey. Heading east will take you into Winchester where you can try the Winchester Circular Walk and the Winchester River Walk along the Itchen River. For more walking ideas in the area see the Hampshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wLTxCJJtFGA",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Farley Mount Road, Standon, Hursley, Winchester, Hampshire, England, SO21 2JE, United Kingdom",
  "postcode": "SO21 2JE",
  "district": "Winchester",
  "state": "England"
}