{
  "created_at": "2025-01-06T02:14:57.796072+00:00",
  "objectID": "08234855982cc27e554434320a0b05b0",
  "ref": "dartmoor-ramble-walking-route",
  "title": "Dartmoor Ramble Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Bellever_Tor_-_geograph.org.uk_-_208200.jpg",
  "nearby": [
    {
      "description": "Postbridge Circular Walk",
      "objectID": "fc72abf283cf18b726a10c9a18bbd580",
      "ref": "postbridge-circular-walk-walking-route"
    },
    {
      "description": "Fingle Bridge and Woods",
      "objectID": "f3249f8567e57792017b386bced05a94",
      "ref": "fingle-woods-walking-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Sticklepath",
      "objectID": "00eb16ae55dfd48a44fd7538496a24d7",
      "ref": "sticklepath-walking-route"
    },
    {
      "description": "Grimspound",
      "objectID": "fa5a8af7e03a541ca36a3438b010d0c4",
      "ref": "grimspound-walking-route"
    },
    {
      "description": "Moretonhampstead",
      "objectID": "cedf66f196ad63bb77ad479cde21c934",
      "ref": "moretonhampstead-walking-route"
    },
    {
      "description": "Scorhill Stone Circle",
      "objectID": "8fe91fd19baadf3701a0c727c44b575b",
      "ref": "scorhill-stone-circle-walking-route"
    },
    {
      "description": "Bovey Castle",
      "objectID": "24eb1b030ca1c2cc5a042250f71d422b",
      "ref": "bovey-castle-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Bellever_Tor_-_geograph.org.uk_-_208200.jpg",
      "title": "Derek Harper / Bellever Tor",
      "caption": "Bellever Tor. This is the main eastern mass of the tor, which has splendid views in all directions and is an easy climb only about a kilometre from two car parks. On the left is a glimpse of Laughter Tor to the southeast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Sittaford_Tor_-_geograph.org.uk_-_1378785.jpg",
      "title": "Guy Wareham / Sittaford Tor",
      "caption": "Sittaford Tor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Grey_Wethers_stone_circles_-_geograph.org.uk_-_1542352.jpg",
      "title": "Rob Purvis / Grey Wethers stone circles",
      "caption": "Grey Wethers stone circles"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Hangingstone_Hill_-_Dartmoor_-_geograph.org.uk_-_16445.jpg",
      "title": "Richard Knights / Hangingstone Hill - Dartmoor",
      "caption": "Hangingstone Hill - Dartmoor. Hangingstone Hill is bang in the middle of North Dartmoor and is a good place to start exploring the wilderness. It is a high exposed point (603m) at SX 617862 which is visible from many other parts of the moor. There is no tor - just an army observation station - but the views on a mist free day are superb. The name Hangingstone derives from a logan rock (or rocking stone) that is on the NW slope of the hill. Alas the rock no longer rocks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Grimspound_Dartmoor_-_geograph.org.uk_-_830854.jpg",
      "title": "Christopher Clift / Grimspound Dartmoor",
      "caption": "The picture is of the entrance into Grimspound on Dartmoor. This one of many pictures of Grimspound. However get the children to look for the small incised cross carved on the bottom boulder on the right. It has been there for as many years I have visited the site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Soussons_Down_stone_circle_-_geograph.org.uk_-_1368199.jpg",
      "title": "Guy Wareham / Soussons Down stone circle",
      "caption": "Soussons Down stone circle. Twenty-two stones surrounding the remains of a burial chamber of which only two side slabs remain visible."
    }
  ],
  "distance_km": 80.0,
  "description": "A wonderful circular walk around the fascinating Dartmoor National Park with plenty of lovely riverside walking and some challenging climbs. The walk starts near the car park at Bellever and first follows the East Dart River through Postbridge and on to Sittaford Tor where you will pass the historical Grey Wethers Stone Circle. Challenging climbs on Whitehorse Hill and Hangingstone Hill follow, offering fabulous views of Dartmoor and the surrounding areas. The walk continues past Oke Tor to the town of Okehampton where you will pass the ruins of the 11th century Okehampton Castle. You then join the East Okemont River and the River Taw for two pleasant waterside stretches which lead you to the little village of Sticklepath. From here you head south towards Teigncombe where you join the River Teign for another riverside section which passes Chagford and the Wooton Castle Iron Age Hill fort before reaching the delightful Meadhaydown Wood Nature Reserve. The route then turns west towards Moretonhampstead (notable for having the longest one-word name of any place in England), the fine Bovey Castle hotel and then the fascinating Grimspound Bronze Age settlement which consists of a set of 24 hut circles surrounded by a low stone wall. The final section takes you past the wooded Soussons Down to the finish point back at Bellever.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near Soussons Down you will pass close to the noteworthy Warren House Inn, one of the highest pubs in England. The 19th century inn is one of the most famous on Dartmoor, sitting in an isolated position some 1425ft (434m) above sea level. Originally built to serve the busy local tin mining community, the Inn was always a favourite haunt with miners from the neighbouring Tin Mines, including Golden Dagger, Vitifer and Birch Tor Mines. From the elevated position of the inn there are breathtaking views over the area. Indoors there's a cosy interior with oak beams and open fires. They do great food and are also dog friendly. The Warren House Inn lies at the very centre of Dartmoor between Moretonhampstead and Princetown on the B3212 with a postcode of PL20 6TA. The Fingle Bridge Inn is in a great location right next to the river near Drewsteignton. You can sit outside in the large garden area which overlooks the woods and the river, which is just a few feet away from the tables. On a fine day it's the perfect place to relax with a cream tea after your exercise. Inside there's a cosy interior with a stone hearth and wood ceiling beams. You can find the inn right next to the old bridge at postcode EX6 6PW for your sat navs. Fingle Bridge is one of the highlights on the walk dating from between the 16th and 17th century. The bridge is Grade II listed."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The epic Dartmoor Way is another long distance circular walk to try in the National Park. For more walking ideas in the area see the Devon Walks and the Dartmoor Walks pages."
    }
  ],
  "gazetteer_found": false,
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/08234855982cc27e554434320a0b05b0.gpx",
  "_geoloc": {
    "lat": 50.5809880952,
    "lng": -3.9016616495
  },
  "nominatim_found": true,
  "display_address": "YHA Dartmoor Hostel Bellever, Clapper Bridge, Dartfordleigh, Dartmoor Forest, Postbridge, West Devon, Devon, England, PL20 6TU, United Kingdom",
  "postcode": "PL20 6TU",
  "district": "West Devon",
  "county": "Devon",
  "region": null,
  "state": "England",
  "country": "United Kingdom",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "castle ruins",
    "archaeological sites",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "hotel"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}