{
  "created_at": "2025-01-06T03:27:37.782441+00:00",
  "objectID": "0853ad0ac3c7cd3c9aa9d6340d4334a5",
  "ref": "wetherby-walking-route",
  "title": "Wetherby Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/08/Wetherby_-_Bridge.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0853ad0ac3c7cd3c9aa9d6340d4334a5.gpx",
  "_geoloc": {
    "lat": 53.927439181,
    "lng": -1.3855220437
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Wetherby_-_Bridge.jpg",
      "title": "David Pickersgill [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Wetherby/Mickletwaite bridge and Wetherby weir. The bridge originally carried the Great North Road - the present-day A1 - across the River Wharfe until the town was bypassed in the 1960s. Note the leaping salmon sculpture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/River_Wharfe_from_Linton_Bridge_-_geograph.org.uk_-_212586.jpg",
      "title": "michael ely / River Wharfe from Linton Bridge",
      "caption": "River Wharfe from Linton Bridge. The River Wharfe here forms the boundary between the villages of Linton and Collingham to the southwest of Wetherby. View downstream towards Wetherby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Woodhall_Bridge%2C_East_Keswick_%283710209927%29.jpg/512px-Woodhall_Bridge%2C_East_Keswick_%283710209927%29.jpg",
      "title": "Tim Green from Bradford [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Woodhall Bridge East Keswick"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/River_Wharfe_%283724512598%29.jpg/512px-River_Wharfe_%283724512598%29.jpg",
      "title": "Tim Green from Bradford [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "River Wharfe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/The_Wharfe_below_Harewood_-_geograph.org.uk_-_770111.jpg",
      "title": "Gordon Hatton / The Wharfe below Harewood",
      "caption": "The Wharfe below Harewood. A pleasant stretch of the River Wharfe a mile downstream from Harewood Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Harewood_House_Sep07.jpg/512px-Harewood_House_Sep07.jpg",
      "title": "JD554 [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Harewood House from the terrace gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Town_Hall%2C_Wetherby_%28geograph_4542048%29.jpg/512px-Town_Hall%2C_Wetherby_%28geograph_4542048%29.jpg",
      "title": "Paul Harrop / Town Hall, Wetherby",
      "caption": "Town Hall, Wetherby. The Town Hall dates from 1845 and is the most prominent building in the Market Place. The vuilding no longer plays a major civic function but provides an office which is used by Wetherby Town Council and facilities for local groups and events. It is Grade II listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Bandstand_by_the_river_in_Wetherby_%28geograph_5232346%29.jpg/512px-Bandstand_by_the_river_in_Wetherby_%28geograph_5232346%29.jpg",
      "title": "Stephen Craven / Bandstand by the river in Wetherby",
      "caption": "Bandstand by the river"
    }
  ],
  "distance_km": 16.0,
  "description": "This lovely market town near Leeds is well worth a visit for its architecture and fascinating history. It's also a great place for walkers with easy access to the beautiful Wharfedale and some delighful parks nearby too. This walk takes you along the Ebor Way long distance trail to the splendid Harewood House. The waymarked trail follows the River Wharfe with great views over the Wharfedale countryside. It runs for about 10 miles with a few moderate climbs along the way. Start the walk on Wetherby Bridge in the town centre and cross to the southern side of the water. The route heads south west along the river passing the Wetherby Ings water meadows. You then head towards Collingham before turning west to Lime Kiln Wood and Woodhall Bridge. You continue to Netherby where you turn south toward Harewood House. The park is a great place for walking with miles of footpaths taking you to woodland, a deer park, lakes and a walled garden. After exploring the park you can catch a bus back to Wetherby most days. You could also turn it into a longer circular walk by following the Leeds Country Way east to Bardsey and then picking up country lanes through Collingham. The Leeds Country Way long distance walk passes the park. If you'd like to continue your walking in the area you could follow this path south west to Eccup Reservoir. The reservoir has nice waterside paths and is a great place for spotting Red Kites and other birds. To continue your walking from Wetherby try the Wetherby to Spofforth Castle Walk along the old Wetherby Railway Line. It's a nice easy stroll finishing at the historic ruins of Spofforth Castle. Just to the south of the town you will find Hetchell Woods. The nature reserve has peaceful woodland trails, pretty streams and lots of wildlife to look out for. The site also includes the imposing rocky outcrop of Hetchell Crags and the fascinating Roman earthworks at Pompocali. Just to the north you can pick up the excellent Knaresborough Round which explores the countryside around Knaresborough.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town The Red Lion is a good choice for some post walk refreshment. The friendly pub serves a fine Sunday lunch and also has a large garden for warmer weather. You can easily find them on the High Street with a postcode of LS22 6LR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and woodland trails on the route make for a fine dog walk. Harewood House is dog friendly too with miles of good trails in the estate for you and your pet. You are asked to keep them on short leads and they are not allowed in the House, Bird Garden, Farm Experience and the Adventure Playground. The Red Lion mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Follow the river south east and you can pick up the Boston Spa Walk. This will take you along the river to Newton Kyme and the ruins of Kyme Castle. The worthy village of Bramham is located just a few miles to the south. Here you can visit the noteworthy Bramham Park where there are hundreds of acres of parkland, gardens, woodland and countryside to explore. The landscaped park surrounds the historic 18th century Bramham House which is a Grade I listed building. You could also pick up the Leeds Country Way here and follow it to nearby Thorner."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1oc_FyjozUY",
  "postcode": "LS22 6AN",
  "district": "Wetherby",
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cliff Terrace, Micklethwaite, Wetherby, West Yorkshire, England, LS22 6AN, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural",
    "waterfront"
  ],
  "points_of_interest": [
    "historical sites",
    "parks",
    "nature reserve",
    "ruins"
  ],
  "facilities": [
    "car park",
    "bus",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}