{
  "objectID": "0872dbcdf132f788db3bdad1e7846239",
  "created_at": "2024-12-19T10:39:01.651307+00:00",
  "ref": "danebury-hill-fort-walking-route",
  "title": "Danebury Hill Fort Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Danebury_Ring%2C_Iron_Age_Hill_Fort_-_geograph.org.uk_-_1506378.jpg",
  "nearby": [
    {
      "description": "Harewood Forest",
      "objectID": "c5d680fcb4e8486f3dbcc8e5e8e6d33a",
      "ref": "harewood-forest-walking-route"
    },
    {
      "description": "Test Way",
      "objectID": "f7f671cf68a772945c580a3901d631a6",
      "ref": "test-way-walking-route"
    },
    {
      "description": "National Cycle Route 246",
      "objectID": "0caf5bd6bb07ad527aefd3d6e75d5f28",
      "ref": "national-cycle-route-246"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0872dbcdf132f788db3bdad1e7846239.gpx",
  "_geoloc": {
    "lat": 51.1387000169,
    "lng": -1.5306275701
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Danebury_Ring%2C_Iron_Age_Hill_Fort_-_geograph.org.uk_-_1506378.jpg",
      "title": "David M Jones / Danebury Ring, Iron Age Hill Fort",
      "caption": "Danebury Ring, Iron Age Hill Fort View of the entrance through the ramparts that circles this ancient fort"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Ditch_and_Ramparts%2C_Danebury_Hillfort_-_geograph.org.uk_-_251470.jpg",
      "title": "Colin Smith / Ditch and Ramparts, Danebury Hillfort",
      "caption": "Ditch and Ramparts, where the ramparts ring a large, flat grassy area with wildflowers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/View_north_from_the_ramparts_of_Danebury_fort_-_geograph.org.uk_-_1506385.jpg",
      "title": "David M Jones / View north from the ramparts of Danebury fort",
      "caption": "View north from the ramparts across the countryside on a glorious day in September 2009"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Danebury_Hill_Fort_entrance_-_panoramio.jpg/256px-Danebury_Hill_Fort_entrance_-_panoramio.jpg",
      "title": "ian freeman / CC BY-SA (https://creativecommons.org/licenses/by-sa/3.0)",
      "caption": "Danebury Hill Fort entrance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Sheep_within_Danebury_hillfort_-_geograph.org.uk_-_735496.jpg",
      "title": "Jim Champion / Sheep within Danebury hillfort",
      "caption": "Sheep within the hillfort. This is a 'conservation flock' of Manx Loughton sheep, if the Hampshire County Council website is to be believed. Apparently this traditional breed is a good approximation to the kind of sheep kept at Danebury in its iron-age heyday. The chalk grassland habitat relies on grazing by such animals to maintain its characteristic flora. The location of the flock varies through the year, so dog-walkers should always have a part of the council-maintained Danebury site to run their dogs off the lead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/The_Turret_-_geograph.org.uk_-_735490.jpg",
      "title": "Jim Champion / The Turret",
      "caption": "The Turret A view across to the wooded knoll known as The Turret, from close to the triangulation pillar east of Danebury hillfort. To the right of the turret, on the far side of the Test Valley, is Woolbury hillfort. The bush in the foreground is a juniper, I think."
    }
  ],
  "distance_km": 2.0,
  "description": "Climb to Danebury Hill Fort and Danebury Down on this short walk in Hampshire. After archeological excavations it is believed the Iron Age Fort dates back to between 500BC-100BC. You can start your walk from the car park on Old Stockbridge Road about 1 mile east of the hill. From here you can pick up the footpath taking you up to the hill fort. The high point stands at 143 m (469 ft) providing wonderful views over the beautiful Test Valley. It's a great spot for a picnic in the summer when you'll see lots of people enjoying the views and walking their dogs. The hill is great for wildlife. Look out for wild ponies and the Chalkhill Blue Butterfly. The fort also has a number of information boards where you can read all about the fascinating history of the area. The fort is located near to Stockbridge and the village of Longstock. An alternative route would be to start your walk in Longstock and follow footpaths west to the hill. The Test Way also runs through Stockbridge and Longstock. You could extend your walk by picking up the riverside trail. Heading north east will take you to Chilbolton, Wherwell and Harewood Forest. Head south and you will come to King's Somborne and Horsebridge. Cyclists can reach the fort by following National Cycle Route 246 from Andover to the Stockbridge area.",
  "video_url": "https://www.youtube.com/embed/Uu9bLT9I9fI",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}