{
  "created_at": "2025-01-06T10:37:16.402220+00:00",
  "objectID": "088109d39ee0854867ed1a206f573066",
  "ref": "edenbridge-walking-route",
  "title": "Edenbridge Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Edenbridge_2.JPG/512px-Edenbridge_2.JPG",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/088109d39ee0854867ed1a206f573066.gpx",
  "_geoloc": {
    "lat": 51.1985461311,
    "lng": 0.0704439021
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Edenbridge_2.JPG/512px-Edenbridge_2.JPG",
      "title": "Charlesdrakew [Public domain], via Wikimedia Commons",
      "caption": "Edenbridge town 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Edenbridge_1.JPG/512px-Edenbridge_1.JPG",
      "title": "Charlesdrakew [Public domain], via Wikimedia Commons",
      "caption": "Edenbridge town 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Hever_Castle_1.jpg/512px-Hever_Castle_1.jpg",
      "title": "Tony Grist [Public domain], via Wikimedia Commons",
      "caption": "Hever Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Hever_Castle_gardens.JPG/512px-Hever_Castle_gardens.JPG",
      "title": "Charlesdrakew [Public domain], via Wikimedia Commons",
      "caption": "Hever Castle gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Penshurst_place_italian_garden_in_spring.jpg",
      "title": "Penshurst Place [FAL], via Wikimedia Commons",
      "caption": "Penshurst Place & Gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/PenshurstParkSpring.jpg",
      "title": "Jetstar888 at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "The \"never-fail\" spring at the Penshurst Gardens"
    }
  ],
  "distance_km": 23.0,
  "description": "The Kent town of Edenbridge is located in a lovely spot for exploring the Eden Valley and the High Weald areas of the county. This walk uses the Eden Valley Walk to visit two highlights of the area at Hever Castle and Penshurst Place. The walk runs for just over 7 miles on a nice waymarked footpath with some short climbs along the way. At the end of the walk you can catch the bus back to the town from Penshurst. The walk starts in the town, close to the train station. From here you can pick up the Eden Valley Walk and follow it east to Hever Castle. The historic castle is surrounded by beautiful grounds with miles of footpaths to follow. After exploring the castle the route continues east past Hill Hoath and the delightful village of Chiddingstone. This National Trust owned village includes a number of quaint timber framed Tudor buildings, a picturesque village pond, an ancient pub and the 15th century Chiddingstone Castle with its beautiful grounds and gardens. You could take a small detour north from the route to explore the settlement. Shortly after passing Hill Hoath you will come to Penshurst. It's a lovely place for a walk with fine views of the medieval manor house and the River Medway. There's also several pretty lakes and nice woodland trails in the north eastern section of the park. After exploring the grounds the route returns to Edenbridge on the same paths. To continue your walking around the town you could visit the nearby Staffhurst Wood where there are miles of peaceful woodland trails. You can reach the woods from the town by following the Eden Valley Walk and the Vanguard Way which also runs through the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the The Old Eden on the High Street at postcode TN8 5AX. The award-winning family run historic traditional pub has a nice beer garden to relax in."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west and you can pay a visit to the neighbouring village of Lingfield. It's an interesting place with several listed tudor buildings and a 13th century church. The circular Lingfield Walk starts from the village and visits Hedgecourt Lake and one of the highlights of the area at the British Wildlife Centre. At this popular local attraction you'll find over 40 species of British wildlife, including foxes, red squirrels, red deer, roe deer, red weasels, badgers, river otters, hedgehogs and Scottish wildcats. There's also a wetlands area with a number of walkways and footpaths to follow around the site. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "postcode": "TN8 5BW",
  "district": "Edenbridge",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Forge Croft, Edenbridge, Sevenoaks, Kent, England, TN8 5BW, United Kingdom",
  "state": "England"
}