{
  "created_at": "2025-01-06T02:30:56.491166+00:00",
  "objectID": "08fe1f955b1e838a4f76581c94b98f81",
  "ref": "rosebush-quarry-walking-route",
  "title": "Rosebush Quarry Pembrokeshire Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/50/Y_Tafarn_Sinc_-_geograph.org.uk_-_67927.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/08fe1f955b1e838a4f76581c94b98f81.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Y_Tafarn_Sinc_-_geograph.org.uk_-_67927.jpg",
      "title": "Ruth Jowett / Y Tafarn Sinc",
      "caption": "Y Tafarn Sinc. A pub in Rosebush village where you could start and finish the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Old_archway%2C_Rosebush_-_geograph.org.uk_-_514553.jpg",
      "title": "ceridwen / Old archway, Rosebush",
      "caption": "Old archway, Rosebush. It is a tribute to the stonemasons that this arch is intact 150 or so years after it was erected as part of this quarry building, probably the sorting shed. No effort has been made to preserve the industrial heritage of the slate industry here in North Pembrokeshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Secret_pool_in_Rosebush_quarry_-_geograph.org.uk_-_202717.jpg",
      "title": "ceridwen / Secret pool in Rosebush quarry",
      "caption": "Secret pool in Rosebush quarry. One of the pits in this abandoned slate quarry was allowed to fill with water in order to drive a turbine below, via a pipeline and culvert. Now it remains as a cool, clear and shadowy place among these dramatic surroundings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Levels_at_Rosebush_quarry_-_geograph.org.uk_-_1455664.jpg",
      "title": "ceridwen / Levels at Rosebush quarry",
      "caption": "Levels at Rosebush quarry. The workings descend in tiers: it is no wonder that the large-scale slate production of this and the adjacent Bellstone quarry required a railway track to provide transport out. The Houses of Parliament in London are said to have been roofed with Rosebush slate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Pit_at_Rosebush_slate_quarry_-_geograph.org.uk_-_293408.jpg",
      "title": "ceridwen / Pit at Rosebush slate quarry",
      "caption": "This pit is the deepest part of the southern working of the quarry, with a further 5 levels above. It was drained by an adit. The quarry was opened 1842 and reached its peak after the construction of a railway link with Clynderwen in the 1870's. From c.1870 onwards Rosebush expanded to employ well over 100 people, with an output of 5000 tons, supporting a village community with a railway, hotel and chapel. It was a welcome source of employment in an impoverished area but the operation came to an end around the turn of the century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Rosebush_quarry%2C_exploring_the_adits%2C_3_-_geograph.org.uk_-_512115.jpg",
      "title": "ceridwen / Rosebush quarry, exploring the adits: 3",
      "caption": "Rosebush quarry, exploring the adits. Inside the fourth level adit. It appears to be hewn out of the rock as has no supports. A torch would be necessary to explore further but at this point the passage either rises or is filled by rockfall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Derelict_quarry_building%2C_Rosebush_-_geograph.org.uk_-_307308.jpg",
      "title": "ceridwen / Derelict quarry building, Rosebush",
      "caption": "Derelict quarry building. Even in the summertime these ruined buildings below Rosebush and Bellstone quarries look dour and forbidding. This one was probably a sorting shed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/The_Terrace%2C_Rosebush_-_geograph.org.uk_-_303446.jpg",
      "title": "ceridwen / The Terrace, Rosebush",
      "caption": "The Terrace, Rosebush. These miners' cottages, bedded into the windswept hillside, were built for quarry workers around 1870 during the brief boom in the slate industry here. Now they are popular as small homes and holiday accommodation."
    }
  ],
  "distance_km": 2.7,
  "description": "This walk visits Bellstone Quarry and Rosebush Quarry in the Pembrokeshire village of Rosebush. You can start the walk from the village which lies on the southern slopes of the Preseli Hills. The village has a quarrying history with the slate exported by the Narberth Road and Maenclochog Railway. The railway ran from Clynderwen (formerly Narberth Road) on the Great Western Railway via Maenclochog to Rosebush. From the village you can follow a trail north for about half a mile to visit the quarries. It's an interesting place to explore with picturesque hidden pools and an arched underground tunnel cut into the hillside. It's a quite unique landscape with steep cliff faces, heath, grassland and pine trees. You can also look out for wildlife including Peregrine Falcons. Notably, the quarry supplied slate for the roof of Westminster Palace. To continue your walking in the area head north east to climb to the splendid viewpoint at Foel Cwmcerwyn, the highest point in Pembrokeshire and the Preseli Hills. The ancient hillfort at Foel Drygarn is also located just to the north east. To the west there's also the pretty Rosebush Reservoir to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village there's the noteworthy Tafarn Sinc for some post walk refreshments. The building dates back to 1876 and, unusually for pubs, is constructed of corrugated metal. It originally served the adjacent Rosebush railway station on the Maenclochog Railway, which opened in 1876. Both were built as part of the development of the slate quarry. In 2017, after the owners decided to sell, it was bought by a community group of local residents and other shareholders. The scheme was promoted by actor Rhys Ifans, who was born locally. The pub has a splendidly authentic interior with sawdust on the floorboards and lots of railway memorabilia. Outside there's a lovely garden area with views of the surrounding countryside. You can find them at postcode SA66 7QU for your sat navs. The inn is dog friendly and has a car parking area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west of the village is Rosebush Reservoir. Fishing, mainly from boats, is for wild brown trout here. To the east there's Gors Fawr Stone Circle which dates from the late Neolithic or early Bronze Age. The fascinating ancient site includes fine views and wildlife including Red Kites. The stones can be found just to the south of the neighbouring village of Mynachlog-dd."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4EEmR0yEIf0",
  "gazetteer_found": false
}