{
  "created_at": "2025-01-06T01:05:25.248280+00:00",
  "objectID": "0948752f209d52e3869d49e533f71371",
  "ref": "barnard-castle-walking-route",
  "title": "Barnard Castle River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Barnard_Castle_-_geograph.org.uk_-_1896415.jpg/512px-Barnard_Castle_-_geograph.org.uk_-_1896415.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0948752f209d52e3869d49e533f71371.gpx",
  "_geoloc": {
    "lat": 54.5445750549,
    "lng": -1.9264275602
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Barnard_Castle_-_geograph.org.uk_-_1896415.jpg/512px-Barnard_Castle_-_geograph.org.uk_-_1896415.jpg",
      "title": "Barnard Castle by Paul Buckingham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barnard Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Thorngate_Bridge%2C_Barnard_Castle_-_geograph.org.uk_-_2127645.jpg",
      "title": "Thorngate Bridge, Barnard Castle by A Chilton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Thorngate Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/River_Tees%2C_Barnard_Castle_-_geograph.org.uk_-_620027.jpg",
      "title": "michael ely / River Tees, Barnard Castle",
      "caption": "River Tees. Looking east from the footbridge over the river. The riverside is a haven for wildlife enthusiasts. Grey herons and kingfishers are frequently seen along the banks, darting between overhanging branches or perched by the water's edge. Ducks and swans glide gracefully on the river's surface, while dippers and wagtails often flit around the rocky shallows. The woodland area is home to songbirds such as blackbirds, robins, and tits, which create a lively soundtrack to the walk. Seasonal flora adds to the beauty of the route. In spring and summer, wildflowers like bluebells and buttercups brighten the paths, while autumn brings rich hues of gold and orange to the trees. The area also provides a habitat for otters, though these elusive creatures are more likely to be spotted at dawn or dusk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Egglestone_Abbey%2C_Co._Durham_-_geograph.org.uk_-_1881608.jpg",
      "title": "Egglestone Abbey, Co. Durham by nick macneill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Egglestone Abbey, Co. Durham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/The_Butter_Market%2C_Barnard_Castle_-_geograph.org.uk_-_1046942.jpg",
      "title": "David Lally / The Butter Market, Barnard Castle",
      "caption": "The Butter Market, Barnard Castle. A plaque inside reads: \"This building in its time has been Town Hall, Court Room, Lock-Up and Fire Station. Up to the 1930's Farmers' Wives sold dairy produce round the veranda, Hence the name \"Butter Market\"\". Note: my capitalisation, apostrophes as per the plaque."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/County_Bridge%2C_Barnard_Castle._-_geograph.org.uk_-_1044208.jpg",
      "title": "David Lally / County Bridge, Barnard Castle.",
      "caption": "County Bridge. According to the \"Barnard Castle An Historical View\" information board. Elicit weddings were performed at the centre of the bridge as it spanned the border of two counties and the lands of two Bishops, so at the centre neither Bishop could object."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Looking_up_Market_Place%2C_Barnard_Castle_-_geograph.org.uk_-_832032.jpg",
      "title": "Nicholas Mutton / Looking up Market Place, Barnard Castle",
      "caption": "Looking up Market Place"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/The_Golden_Lion%2C_Barnard_Castle_-_geograph.org.uk_-_1047887.jpg",
      "title": "David Lally / The Golden Lion, Barnard Castle",
      "caption": "The Golden Lion"
    }
  ],
  "distance_km": 6.0,
  "description": "Enjoy a walk around the historic castle and along the River Tees on this walk in County Durham. It's a fascinating town with a 12th century castle and the ruins of Egglestone Abbey. This walk starts in the centre of town and follows a section of the long distance Teesdale Way along the River Tees. You'll pass the castle before coming to the ruined abbey where you can cross the river on Abbey Bridge. You can then follow other public footpaths on the other side of the river back to the town. The 12th century castle ruins are well worth exploring with nice views over the Tees Gorge, a sensory garden of scented plants and remains of the medieval chapel of St Margaret. Egglestone Abbey ruins are another major highlight on the walk. The atmospheric ruins overlook the river and include remains of a 13th century church and a range of living quarters, with evidence of an ingenious toilet drainage system. Another must see in the town is the Bowes Museum. The museum is located just to the east of the river and contains a nationally renowned art collection with works by El Greco, Francisco Goya, Canaletto, Jean-Honore Fragonard and Francois Boucher. There's also beautiful landscaped gardens to explore. This route follows the river in a south easterly direction but you could also follow it north west towards Cotherstone and Romaldkirk. The Teesdale Way waymarked path runs along both sides of the river in this direction. Our Teesdale Way Circular Walk starts from the castle and is a great way of exploring the area. It links with the Tees Railway Walk between Cotherstone and Ronaldkirk. If you were to continue east along the river you would come to Rokeby Park where the River Tees meets with the River Greta.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the historic Old Well Inn for some post walk refreshment. The 17th century pub serves good quality food and includes a nice garden area with views of the castle. You can find them at 21 The Bank, DL12 8PH."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trails make for a fine dog walk and the Old Well Inn mentioned above is also dog friendly. Please keep them on leads around the Egglestone Abbey area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south east along the river from the abbey and you will soon come to Greta Bridge and the Meeting of the Waters. It's a scenic spot where the River Tees and the River Greta meet. The village also includes the noteworthy Morrit Arms, an historic hotel dating back to the 17th century. The area has literary connections with Charles Dickens who researched his novel 'Nicholas Nickleby' here. For more walking ideas in the area see the County Durham Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_vj9ew0mxtQ",
  "postcode": "DL12 8AH",
  "district": "Barnard Castle",
  "county": "County Durham",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Marwood Cottages, Barnard Castle, County Durham, North East, England, DL12 8AH, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "historical"
  ],
  "points_of_interest": [
    "historical sites",
    "museum",
    "gardens",
    "river gorge"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}