{
  "created_at": "2025-01-06T03:23:36.237713+00:00",
  "objectID": "095aa13358bfca9288ad39339f84b145",
  "ref": "billericay-walking-route",
  "title": "Billericay Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Lake_Meadows%2C_Billericay_-_geograph.org.uk_-_48246.jpg",
  "nearby": [
    {
      "description": "Norsey Woods",
      "objectID": "de90f7a60571e2e96b52b06e302b2701",
      "ref": "norsey-woods-walking-route"
    },
    {
      "description": "Hanningfield Reservoir",
      "objectID": "49593be2ab8f627a6dc977996a32d021",
      "ref": "hanningfield-reservoir-walking-route"
    },
    {
      "description": "St Peters Way",
      "objectID": "02fa33afce1b113faa7fc3d7ad463e03",
      "ref": "st-peters-way-walking-route"
    },
    {
      "description": "Thorndon Country Park",
      "objectID": "a532c4b1297b0fb30815d78e92622618",
      "ref": "thorndon-country-park-walking-and-cycle-route"
    },
    {
      "description": "Upminster",
      "objectID": "6034b402234644bb629479108db20e86",
      "ref": "upminster-walking-route"
    },
    {
      "description": "Hornchurch Country Park",
      "objectID": "730b167975a83dae3aa6331467803198",
      "ref": "hornchurch-country-park-walking-and-cycle-route"
    },
    {
      "description": "Ingatestone",
      "objectID": "3857a038e5bdd73839e8417dea10b968",
      "ref": "ingatestone-walking-route"
    },
    {
      "description": "Wickford",
      "objectID": "218db180804d809ac0b6c5a65f184d11",
      "ref": "wickford-walking-route"
    },
    {
      "description": "Belhus Woods Country Park",
      "objectID": "ee3322f4670dbdfb57d62a84fe495281",
      "ref": "belhus-woods-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/095aa13358bfca9288ad39339f84b145.gpx",
  "_geoloc": {
    "lat": 51.6329392919,
    "lng": 0.4164094209
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Lake_Meadows%2C_Billericay_-_geograph.org.uk_-_48246.jpg",
      "title": "Martin Tipper / Lake Meadows, Billericay",
      "caption": "Lake Meadows, Billericay. Lake Meadows is a delightful park in the centre of Billericay. The lake, shown in this picture, hosts many types of birds. The park is always well maintained by the local council. This picture was taken on a warm sunny September day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Norsey_Woods%2C_Billericay_-_geograph.org.uk_-_48295.jpg",
      "title": "Martin Tipper / Norsey Woods, Billericay",
      "caption": "Norsey Woods, Billericay. Burial mounds still exist in Norsey Woods evidencing its occupation in the Bronze and Iron Ages. Now, a recreation area managed by Basildon Council. A quite delightful place for a walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Forty_Acre_Plantation%2C_Billericay%2C_Essex_-_geograph.org.uk_-_53928.jpg",
      "title": "John Winfield / Forty Acre Plantation, Billericay, Essex",
      "caption": "Forty Acre Plantation, Billericay, Essex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/A_public_bridleway_linking_Broomwood_Lane_with_Goatsmoor_Lane_-_geograph.org.uk_-_748548.jpg",
      "title": "Robert Edwards / A public bridleway linking Broomwood Lane with Goatsmoor Lane",
      "caption": "Mill Lane bridleway linking Broomwood Lane with Goatsmoor Lane, in Stock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Footpath_near_Hanningfield_Reservoir_%283%29_-_geograph.org.uk_-_1341651.jpg",
      "title": "Trevor Harris / Footpath near Hanningfield Reservoir (3)",
      "caption": "Footpath near Hanningfield Reservoir. The footpath leaves the confines of the woods to skirt fields of wheat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Hanningfield_Dam_-_geograph.org.uk_-_72918.jpg",
      "title": "Glyn Baker / Hanningfield Dam",
      "caption": "Hanningfield Dam. This is the view along the dam of the Hanningfield Reservoir taken from the north west end. The grid reference is for the Valve Tower. The dam is over 2km in length."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/West_Hanningfield%27s_village_sign_-_geograph.org.uk_-_752665.jpg",
      "title": "Robert Edwards / West Hanningfield's village sign",
      "caption": "West Hanningfield's village sign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Outlet_Tower_On_Hanningfield_Reservoir_-_geograph.org.uk_-_74640.jpg",
      "title": "Glyn Baker / Outlet Tower On Hanningfield Reservoir",
      "caption": "Outlet Tower On Hanningfield Reservoir"
    }
  ],
  "distance_km": 17.8,
  "description": "This Essex based town has some nice country walking trails, a popular local wood and a nearby reservoir to enjoy. This walk from the town visits two of the walking highlights of the area at Norsey Woods and Hanningfield Reservoir. The walk starts in the lovely Lake Meadows Park in the town centre. This pretty park is located just to the north of the train station and includes a picturesque lake which attracts plenty of wildlife. From here you head east through the town before picking up footpaths into Norsey Woods. There's lots of nice paths here with ponds, streams and pretty bluebells in the spring months. After exploring the woods the route heads north east to the Forty Acre Plantation before following a mixture of public footpaths and country lanes to take you to the expansive reservoir. As you get close to the reservoir you'll pick up a section of the St Peters Way long distance trail to take you to the village of West Hanningfield at the northern end of the water. You can visit the impressive Hanningfield Dam here which is over 2km in length. Also look out for plenty of birdlife on the lake including tufted duck, pochard, shoveler, shelduck and great crested grebe. After enjoying the views from the dam the route returns on the same paths to Billericay.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Duke of York is a good choice for some post walk refreshments. They do very good food and also have a lovely garden area for warmer days. You can find them on Southend Road with a postcode of CM11 2PR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a nice walk to do with your dog, particularly the woodland trails in Norsey Woods where you're likely to see other dog walkers. The Duke of York mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One of the highlights of the area is the excellent Imperial Bird of Prey Academy in the town. It's the leading Bird of Prey Centre in Essex, based at Barleylands Farm & Craft Village. You can handle the birds and spend some time flying an owl. There's also a wonderful flying display, a reptile house and informative talks to enjoy. You can find it in the town at a postcode of CM11 2UD for your sat navs. Head south west of the town and you can visit Thorndon Country Park near Brentwood. Here you'll find miles of walking and cycling trails with an ancient deer park, grassland and three small lakes. Near here you can also pick up the Upminster Circular Walk and visit the pretty Hornchurch Country Park. Near Hanningfield you can visit Danbury Common and Danbury Country Park where there are more good footpaths to try. Just to the east of the water is the lovely Marsh Farm Country Park in South Woodham Ferrers. Around here you can also visit the interesting riverside village of Battlesbridge. The village is home to a number of well known antiques shops including the noteworthy Battlesbridge Antiques Centre housed in the old mill. Just to the west there's also Wickford where you can visit the Shotgate Thicket Nature Reserve and the pretty Wick Country Park. Just to the north is the pretty village of Ingatestone where you can enjoy views of the River Wid and visit the 16th century Ingatestone Hall. For more walking ideas in the area see the Essex Walks page."
    }
  ],
  "district": "Billericay",
  "county": "Essex",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}