{
  "objectID": "098eca580895bbbf6dcdadde38f1c351",
  "created_at": "2024-12-18T23:12:25.091535+00:00",
  "ref": "wychavon-way-walking-route",
  "title": "Wychavon Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d3/On_the_Wychavon_Way_6_-_geograph.org.uk_-_1545336.jpg",
  "nearby": [
    {
      "description": "Bredon Hill",
      "objectID": "1938aabe055c1f51548f641b2e70b06e",
      "ref": "bredon-hill-walking-route"
    },
    {
      "description": "Droitwich Canal",
      "objectID": "58aa3c2533adbefc517f9983781d418a",
      "ref": "droitwich-canal-walking-route"
    },
    {
      "description": "Worcester and Birmingham Canal",
      "objectID": "06cdf2fadd9f580d8ef5c82d462b5a43",
      "ref": "worcester-and-birmingham-canal-walking-route"
    },
    {
      "description": "Broadway Tower Country Park",
      "objectID": "b9acdea928e2266362f5e6be812ee5e8",
      "ref": "broadway-tower-country-park-walking-and-cycle-route"
    },
    {
      "description": "Pershore",
      "objectID": "4559216c392e0d7d8b704da6abbdd685",
      "ref": "pershore-walking-route"
    },
    {
      "description": "Elmley Castle",
      "objectID": "3de9c2fab4b85e41c173b00deff2140c",
      "ref": "elmley-castle-walking-route"
    },
    {
      "description": "Hadzor Circular Walk",
      "objectID": "7129a5b73f8afe5f9e247bd2bafc36c3",
      "ref": "hadzor-circular-walk-walking-route"
    },
    {
      "description": "Ombersley",
      "objectID": "0d9b2e426ab6c7bec4d979fd11576a56",
      "ref": "ombersley-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/402F8FCCE6154F36802579EE005FF903/$FILE/Wychavon Way.gpx",
  "_geoloc": {
    "lat": 52.268679416,
    "lng": -2.1436362762
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/On_the_Wychavon_Way_6_-_geograph.org.uk_-_1545336.jpg",
      "title": "Jonathan Billinger / On the Wychavon Way 6",
      "caption": "Looking over Frampton Farm towards Langley Hill near Winchcombe. Entering Dumbleton Estate land on the southern flank of Alderton/Dumbleton Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/The_Wychavon_Way_-_geograph.org.uk_-_922546.jpg",
      "title": "Trevor Rickard / The Wychavon Way",
      "caption": "The path crosses the Whitsun Brook valley ahead then follows the edge of Old Yew Hill Wood up the other side before entering Yeald Wood on the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/On_the_Wychavon_Way_8_-_geograph.org.uk_-_1545367.jpg",
      "title": "Jonathan Billinger / On the Wychavon Way 8",
      "caption": "Looking south down the dry valley on the southern flank of Alderton Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Site_of_Elmley_Castle_-_geograph.org.uk_-_759488.jpg",
      "title": "Philip Halling / Site of Elmley Castle",
      "caption": "Site of Elmley Castle. The village takes its name from a castle which once stood on high ground above the present village. Viewed here from the northern slopes of Bredon Hill all that remains are earthworks which are clearly visible here. The castle was built by Robert le Despenser in the late 11th century and was for a time the principal seat of the Beauchamps. By the late 15th century the castle had been demolished."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Didcot_Cottages%2C_Wychavon_Way_-_geograph.org.uk_-_63718.jpg",
      "title": "Dave Bushell / Didcot Cottages, Wychavon Way",
      "caption": "Didcot Cottages. Looking north along the Wychavon Way, Ashton-under-Hill visible in the distance on the slopes of Bredon Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/The_Wychavon_Way_entering_Ferndown_Woods_-_geograph.org.uk_-_922573.jpg",
      "title": "Trevor Rickard / The Wychavon Way entering Ferndown Woods",
      "caption": "Entering Ferndown Woods. Looking south-east as the path meets the wood. Both the large and small signs remind people to keep dogs on a lead. The small one politely reminds us to keep to the footpaths and indicates that dogs might scare the deer resident in the wood. Although the map only shows this as Yeald Wood, the sign calls this area 'Ferndown Woods'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Wychavon_Way_approaching_Church_Lench_-_geograph.org.uk_-_922085.jpg",
      "title": "Trevor Rickard / Wychavon Way approaching Church Lench",
      "caption": "Approaching Church Lench. Looking northwards along the track to the outskirts of the village. The 42-mile Wychavon Way links Holt Fleet (north of Worcester on the Severn) to the Cotswolds, passing through many pretty Vale of Evesham villages like this one, and finally linking to the Cotswold Way at Winchcombe. This gentle walking route was originally opened in 1977 to commemorate the Silver Jubilee of Elizabeth II."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Route_of_the_Wychavon_Way_at_Church_Lench_-_geograph.org.uk_-_585963.jpg",
      "title": "Claire Seyler / Route of the Wychavon Way at Church Lench",
      "caption": "Church Lench countryside view. The footpath goes down the hill and crosses the Whitsun Brook in front of Old Yew Hill Wood."
    }
  ],
  "distance_km": 64.0,
  "description": "Follow the Wychavon Way through the Worcestershire countryside on this splendid 40 mile walk. The walk begins at the town of Droitwch Spa, where you can pick up the waymarked trail just to the east of the town centre and train station. You start of heading east along the River Salwarpe before turning south to Hadzor. The route then heads through the countryside to Goosehill Wood, Earl's Common, Flyford Favell, Abberton and Church Lench. This section includes a short stroll along the Worcester and Birmingham Canal and woodland walks through Grafton and Old Yew Hill Woods. At Craycombe Hill you turn west to head through Craycombe Woods towards Wyre Piddle. Here you follow the River Avon to Pershore and Great Comberton. There's nice riverside sections to enjoy here with rushing weirs and lots of wildlife to look out for on the way. The next section takes you past Banbury Stone Tower which is the high point on the walk. There's splendid views over the Cotswolds countryside from the elevated position of the tower. From the tower you descend to the east, toward Ashton Under Hill and Cropthorne whose church dates back to the 12th century. You'll also pass Bredon Hill near Ashton under Hill where you can visit the Iron Age Hill Fort of Kemerton Camp and a small stone tower known as Parsons Folly at the summit. The final section then runs from Ashton to Sedgeberrow and Ashton Somerville before finishing in the popular Cotswolds village of Broadway where you can enjoy a visit to the splendid Broadway Tower Country Park .",
  "district": "Droitwich Spa",
  "county": "Worcestershire",
  "region": "West Midlands",
  "country": "England"
}