{
  "objectID": "09931f4edbc8d2657d74b9ed05ae0f7f",
  "created_at": "2024-12-18T18:38:32.393489+00:00",
  "ref": "appledore-walking-route",
  "title": "Appledore Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fb/An_anchor_at_Appledore_-_geograph.org.uk_-_1354801.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/09931f4edbc8d2657d74b9ed05ae0f7f.gpx",
  "_geoloc": {
    "lat": 51.0509487968,
    "lng": -4.1916257592
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/An_anchor_at_Appledore_-_geograph.org.uk_-_1354801.jpg",
      "title": "Philip Halling / An anchor at Appledore, via Wikimedia Commons",
      "caption": "An anchor on a defensive harbour wall at Appledore, Instow can be seen in the background on the far side of the River Torridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/A_Steep_Street_in_Appledore_-_geograph.org.uk_-_347153.jpg",
      "title": "Dr Duncan Pepper / A Steep Street in Appledore, via Wikimedia Commons",
      "caption": "A Steep Street in Appledore. Seafaring folk once occupied these humble cottages, but they are now popular with holidaymakers and second home owners in the picturesque seaside town of Appledore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Appledore_-_River_Torridge_%28geograph_4018717%29.jpg/512px-Appledore_-_River_Torridge_%28geograph_4018717%29.jpg",
      "title": "Lewis Clarke / Appledore : River Torridge, via Wikimedia Commons",
      "caption": "Appledore : River Torridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Appledore_Quay_%28geograph_3950367%29.jpg/512px-Appledore_Quay_%28geograph_3950367%29.jpg",
      "title": "Stephen McKay / Appledore Quay, via Wikimedia Commons",
      "caption": "Appledore Quay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Northam_Burrows_-_geograph.org.uk_-_747207.jpg",
      "title": "Jonathan Billinger / Northam Burrows, via Wikimedia Commons",
      "caption": "Northam Burrows. A large spit jutting out north at the entrance to the Torridge/Taw estuary. This is access land sharing with the Royal North Devon Golf Club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Northam_Burrows_-_geograph.org.uk_-_31628.jpg",
      "title": "Tony Atkin / Northam Burrows, via Wikimedia Commons",
      "caption": "Northam Burrows. Rough coastal grassland grazed by horses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Northam_Burrows_-_geograph.org.uk_-_1302878.jpg",
      "title": "Jonathan Billinger / Northam Burrows, via Wikimedia Commons",
      "caption": "Northam Burrows. The access land covers the grazing land for horses and sheep, as well as the Royal North Devon Golf Club. In the distance is Westward Ho!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/The_beach_at_Northam_Burrows_-_geograph.org.uk_-_1394288.jpg",
      "title": "Steve Daniels / The beach at Northam Burrows, via Wikimedia Commons",
      "caption": "The beach at Northam Burrows"
    }
  ],
  "distance_km": 10.0,
  "description": "This pretty Devon village is located at the mouth of the River Torridge, near the towns of Barnstaple and Bideford. There's nice walks along the river and along the estuaries of both the Taw and Torridge to the north of the village. This circular walk follows the South West Coast Path along the estuary to the nearby Northam Burrows Country Park where there are miles of nice trails and fine views of the coast to enjoy. Start the walk from the pretty quay in Appledore and head north along the river to West Appledore. The path bends round to the west towards Northam Burrows and the Royal Devon Golf Club. In the park you will find over 600 acres of grassy coastal plain, salt marsh and sand dunes. The trail heads round the coast toward the visitor centre on the western side. Here you'll pass Sandymere before picking up a country lane taking you to Pampley Bridge and Appledore Bridge. From here you can pick up the coast path to take you back into Appledore. You could extend the walk by continuig south from Northam Burrows to visit the attractive seaside village of Westward Ho. A summer ferry runs to Instow on the opposite side of the river. Here you can pick up the popular Tarka Trail and follow it south to Great Torrington. The historic town is well worth a visit with a number of listed buildings, riverside trails and a splendid viewpoint on Castle Hill to enjoy. If you head north east along the Tarka Trail you can visit Barnstaple where there's paths along the River Taw and the interesting Barnstaple Heritage Trail to try. To the north of the village, on the opposite side of the estuary, you will find the lovely Braunton Burrows. The reserve covers nearly 900 hectares making it the second largest dune system in England.",
  "district": "Appledore",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}