{
  "created_at": "2025-01-06T03:01:32.295172+00:00",
  "objectID": "0a44b03337b26010afba46f437ed0f60",
  "ref": "cudham-circular-walk-walking-route",
  "title": "Cudham Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Cudham_Workhouse_-_geograph.org.uk_-_1728622.jpg",
  "nearby": [
    {
      "description": "High Elms Country Park",
      "objectID": "b5992b581143298cc03c11f531d72186",
      "ref": "high-elms-country-park-walking-and-cycle-route"
    },
    {
      "description": "Orpington Walk",
      "objectID": "2aaf240eae7b27555f6c498e0112c6b5",
      "ref": "orpington-walking-route"
    },
    {
      "description": "Downe Circular Walk",
      "objectID": "bbfb0c3fab7cbb10da79860816571b15",
      "ref": "downe-circular-walk-walking-route"
    },
    {
      "description": "Biggin Hill",
      "objectID": "30d902bd61ced5b2e0d0317dbbef3505",
      "ref": "biggin-hill-walking-route"
    },
    {
      "description": "Leaves Green Circular Walk",
      "objectID": "95354a379d560751d2513bed3ad7ed3d",
      "ref": "leaves-green-circular-walk-walking-route"
    },
    {
      "description": "Betsoms Hill",
      "objectID": "399b7dbdb563ee8faaa837686248e189",
      "ref": "betsoms-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0a44b03337b26010afba46f437ed0f60.gpx",
  "_geoloc": {
    "lat": 51.3185581968,
    "lng": 0.07315533
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Cudham_Workhouse_-_geograph.org.uk_-_1728622.jpg",
      "title": "Ian Capper / Cudham Workhouse",
      "caption": "Cudham Workhouse. Despite the name, this would no longer be considered to be in Cudham but in nearby Leaves Green. It was built in 1731 and divided into 3 cottages (Ramblers Rest, Workhouse and Jasmine) some time in the early 20th century. Rambler's Rest once served as a café. The building is grade II listed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Down_House_-_geograph.org.uk_-_680255.jpg",
      "title": "Katherine Tyrrell / Down House",
      "caption": "Down House. The home of Charles Darwin, where he worked on and wrote the 'Origin of the Species'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Blacksmiths_Arms%2C_Cudham_TN14_-_geograph.org.uk_-_67912.jpg/512px-Blacksmiths_Arms%2C_Cudham_TN14_-_geograph.org.uk_-_67912.jpg",
      "title": "Philip Talmage / Blacksmiths Arms, Cudham TN14",
      "caption": "The historic Blacksmiths Arms, Cudham TN14. It was built all the way back in 1628 and has been a pub for nearly 300 years"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Kentish_Orchard_in_High_Elms_Country_Park_-_geograph.org.uk_-_994679.jpg",
      "title": "David Anstiss / Kentish Orchard in High Elms Country Park",
      "caption": "Kentish Orchard at High Elms Country Park. The park covers 250 acres of countryside combined with a 150 acre golf course that together form the High Elms estate, originally the country home of the Lubbock family. In the 1840's Sir John Lubbock II developed the new house and grounds in a classical Italian style with tree's collected from around the world. His son Lord Avebury was one of the foremost public figures of his day and was responsible for the Open Spaces act (1896) which enabled his former estate to be transferred to Bromley Council in 1965, as a Green Belt open space. Unfortunately the house was destroyed by fire, but some of the formal gardens survived and are still maintained. This is a model orchard in the old walled gardens."
    }
  ],
  "distance_km": 13.0,
  "description": "This circular walk takes you through the woodland and farmland around Cudham and Downe in Bromley. The walk passes Down House the former home of Charles Darwin and his family. It was in this house and garden that Darwin worked on his theories of evolution by natural selection and it can be found close to the walk start at the village of Downe. The house is now owned by English Heritage and includes an exciting interactive multimedia tour (narrated by David Attenborough), family rooms and extensive gardens. The walk also passes close to Biggin Hill airport and through the splendid High Elms Country Park. The park boasts 250 acres of countryside including a 150 acre golf course, woodlands, a nature centre, an ice well, formal gardens and wildflower meadows. The route runs for just under 8 miles and includes some moderate hill climbs on the way.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Blacksmith Arms in Cudham is a historic pub of some note. The old inn was built during the reign of Charles I (1625 – 1649) in the year 1628. The property at this time is described as a farm dwelling with stables. These days it's a fine country pub with a good menu and selection of ales. There's also a lovely garden area where you can enjoy your refreshment outside on warmer days. You can find the pub on Cudham Lane at a postcode of TN14 7QB for your sat navs. The inn is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Bromley Walk visits the nearby Keston Common and Hayes Common, where there are some nice trails to try. You can also pick up the London Loop in the area and visit Orpington. There's also the Downe Circular Walk and Leaves Green Circular Walk to try in the area. To the south is Betsoms Hill, the highest point in the county of Kent. This area also includes Westerham Heights, the highest point of Greater London. For more walking ideas in the area see the London Walks page."
    }
  ],
  "postcode": "TN14 7QB",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cudham Lane South, Berry's Green, London Borough of Bromley, London, Greater London, England, TN14 7QB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "farmland"
  ],
  "points_of_interest": [
    "historical sites",
    "nature centre",
    "gardens"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}