{
  "created_at": "2025-01-06T00:41:29.722173+00:00",
  "objectID": "0a99012b873d88c0d5d0a3d17af78b38",
  "ref": "knighton-walking-route",
  "title": "Circular Walk around Knighton Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Clock_Tower._Knighton_-_Tref-y-clawdd%2C_Powys_-_Flickr_-_S._Rae.jpg/512px-Clock_Tower._Knighton_-_Tref-y-clawdd%2C_Powys_-_Flickr_-_S._Rae.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0a99012b873d88c0d5d0a3d17af78b38.gpx",
  "_geoloc": {
    "lat": 52.3459830295,
    "lng": -3.0520193861
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Clock_Tower._Knighton_-_Tref-y-clawdd%2C_Powys_-_Flickr_-_S._Rae.jpg/512px-Clock_Tower._Knighton_-_Tref-y-clawdd%2C_Powys_-_Flickr_-_S._Rae.jpg",
      "title": "S. Rae from Scotland, UK, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "The Welsh name for this town means \"Town on the Dyke\" referring to Offa's Dyke built in the 8th century by the Mercian king Offa."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Footpath_By_River_Teme%2C_Knighton_-_geograph.org.uk_-_591472.jpg",
      "title": "Geoff Pick / Footpath By River Teme, Knighton",
      "caption": "Footpath By River Teme, Knighton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/After_the_climb_from_Knighton_and_the_Teme_valley_-_geograph.org.uk_-_823643.jpg",
      "title": "Tim Heaton / After the climb from Knighton and the Teme valley",
      "caption": "After the climb from Knighton and the Teme valley. Looking back over the first of several brief climbs on the Offa's Dyke Path north of Knighton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/View_up_the_Teme_valley_-_geograph.org.uk_-_823655.jpg",
      "title": "Tim Heaton / View up the Teme valley",
      "caption": "View up the Teme valley. Looking west, with the village of Knucklas in the centre mid-distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Cwm-sanaham_Hill_from_the_north-west_-_geograph.org.uk_-_823720.jpg",
      "title": "Tim Heaton / Cwm-sanaham Hill from the north-west",
      "caption": "Cwm-sanaham Hill from the north-west. Looking across the valley from near Selley Hall to the track carrying the Offa's Dyke Path past Brynorgan (white building) up the flank of Cwm-sanaham Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Cwm-sanaham_Hill_trig_point_-_geograph.org.uk_-_2016480.jpg",
      "title": "Cwm-sanaham Hill trig point by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cwm-sanaham Hill trig point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/The_Lloyney_Inn_-_geograph.org.uk_-_1543142.jpg",
      "title": "Row17 / The Lloyney Inn",
      "caption": "The Lloyney Inn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Cwm_Sanahan_Hill_from_Garbett_Hall_Farm_-_geograph.org.uk_-_549739.jpg/256px-Cwm_Sanahan_Hill_from_Garbett_Hall_Farm_-_geograph.org.uk_-_549739.jpg",
      "title": "Robert Pyke / Cwm Sanahan Hill from Garbett Hall Farm",
      "caption": "Bwlch-y-Plain"
    }
  ],
  "distance_km": 16.0,
  "description": "This border town in Powys is surrounded by the gorgeous countryside of the River Teme valley. There's some riverside walking trails, a major long distance footpath and several decent local hill climbs where you can enjoy wonderful views over this beautiful area. The town is also notable as the start point for the The Glyndwr's Way National Trail. This route from the town uses sections of the Offa's Dyke Path and the Jack Mytton Way to create a circular walk around the surrounding countryside. On the way there are some splendid views into England and Wales with a pleasant riverside stretch along the River Teme to enjoy as well. The walk starts in the town centre and heads north to cross the River Teme before climbing to the 406 metre high Cwm-sanaham Hill. There's some splendid views over the surrounding landscape from this elevated spot. The rpoute continues north to Garbett Hall. You continue round to Llandishop Wood, before turning south to Lloyney. The route then heads south east along a country lane, passing Skborry Green, with some fine views of the River Teme valley as you go. You pass Panpunton Hill before crossing the river and returning to Knighton. The Glyndwr's Way passes south of the river so this could be used to make a slightly longer circular walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town you can enjoy some post walk rest and refreshment at the Horse and Jockey. The traditional 14th century coaching inn includes a cosy interior with original beams and open fires. There's a nice garden area for warmer weather and a fine restaurant which serves good quality dishes. You can find them at Wylcwm Place, Station Rd, LD7 1AE."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails are ideal for fit dogs. There's also some woodland trails in Kinsley Wood to the east of the town. The Horse and Jockey mentioned above is also dog friendly with dog biscuits available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you follow Offa's Dtyke south you could visit Presteigne and Kington. Heading north east along the Jack Mytton Way would take you to Clun where you can visit the historic Clun Castle. Near here there's also the village of Hopton Castle where you can visit the ruins of the mediaeval castle which was besieged in a battle of the English Civil War during 1644. There's also the lovely Wood 'n' Ribbon cafe in this area. The eclectic site has a lovely outdoor area with animals including goats, hens and ponies. They also provide accommodation in the shape of quality glamping pods too. The Heart of Wales Line Trail passes through the town. The 143 mile trail explores the Heart of Wales Railway Line, a wonderful rural railway running between Swansea and Shrewsbury. The trail visit several train stations, old railway lines and photogenic railway viaducts. Follow the path east would take you through Bucknell Wood to Bucknell and then onto Hopton Castle. Head north west and you will soon come to the village of Knucklas where you can enjoy views of the impressive Knucklas Viaduct."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ia0ovq4oqaw",
  "postcode": "LD7 1EP",
  "district": "Knighton",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Offa's Dyke Centre, West Street, Knighton, Powys, Cymru / Wales, LD7 1EP, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "hill"
  ],
  "points_of_interest": [
    "viewpoint",
    "landscape"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}