{
  "objectID": "0a9afadb35d1090581c1ae9fe3e5d241",
  "created_at": "2024-12-18T17:54:04.710270+00:00",
  "ref": "erewash-valley-trail-walking-and-cycle-route",
  "title": "Erewash Valley Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Erewash_Canal%2C_Trentlock_-_geograph.org.uk_-_763828.jpg",
  "nearby": [
    {
      "description": "Erewash Canal",
      "objectID": "e5e398a58bcf54dce4342ad1064fb6a8",
      "ref": "erewash-canal-walking-and-cycle-route"
    },
    {
      "description": "Trent Valley Way",
      "objectID": "deaeed2d2c582aa7fdfd01f9dcce589a",
      "ref": "trent-valley-way-walking-route"
    },
    {
      "description": "Attenborough Nature Reserve",
      "objectID": "b7e367bf4456cdd77ed859556dcdd097",
      "ref": "attenborough-nature-reserve-walking-route"
    },
    {
      "description": "Nottingham Canal",
      "objectID": "2c51f794ccb9236457663018e9957fb7",
      "ref": "nottingham-canal-walking-and-cycle-route"
    },
    {
      "description": "Trent Lock",
      "objectID": "7e87b379acd57c1bf49c0fda3d91970a",
      "ref": "trent-lock-walking-route"
    },
    {
      "description": "Ilkeston",
      "objectID": "978bac121e2b7b957e9a68da51e8ef7f",
      "ref": "ilkeston-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0a9afadb35d1090581c1ae9fe3e5d241.gpx",
  "_geoloc": {
    "lat": 52.93628,
    "lng": -1.25828
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Erewash_Canal%2C_Trentlock_-_geograph.org.uk_-_763828.jpg",
      "title": "Stephen McKay / Erewash Canal, Trentlock, via Wikimedia Commons",
      "caption": "Trentlock - route start. The river yacht and houseboats moored on the opposite bank are hardly typical of the canal network, but Trentlock is a place where river and canal craft mix. This is the attractive start of the almost 12-mile long Erewash Canal; much of the route runs through an urban and industrial landscape but it is nevertheless a fascinating waterway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Erewash_Canal_looking_north_from_Sandiacre_bridge_-_geograph.org.uk_-_953123.jpg",
      "title": "David Pinney / Erewash Canal looking north from Sandiacre bridge, via Wikimedia Commons",
      "caption": "Canal looking north from Sandiacre bridge. The canal was built in 1777-1779 to carry coal from mines on either side of the Erewash valley to Leicestershire. Padmore Moorings are on the left adjacent to Town Street. Springfield Mill with its noticeable chimney was built in 1888 as a lace factory. The towpath is part of an off-road cycle route named the Nutbrook Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Gallows_Inn_Lock%2C_Erewash_Canal_-_geograph.org.uk_-_1106537.jpg",
      "title": "Stephen McKay / Gallows Inn Lock, Erewash Canal, via Wikimedia Commons",
      "caption": "Gallows Inn Lock on the Erewash Canal. The lock is adjacent to the pub of the same name, a grim reminder that this was once a place where criminals were publicly executed. Compare this view with; new houses have appeared in the four years since that picture was taken."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Bennerley_Viaduct_Bridge_-_geograph.org.uk_-_702160.jpg",
      "title": "Nigel Davies / Bennerley Viaduct Bridge, via Wikimedia Commons",
      "caption": "Bennerley Viaduct Bridge. This 1400 feet long, wrought iron bridge was built in 1877 and is one of only two of it's kind in England. It was constructed to carry the Great Northern Railway, over the River Ereash and was closed to traffic in 1973 and is now classed as a Grade II listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Cromford_Canal%2C_Langley_Mill_-_geograph.org.uk_-_551191.jpg",
      "title": "Stephen McKay / Cromford Canal, Langley Mill",
      "caption": "Cromford Canal, Langley Mill. This was at one time the point where the Nottingham Canal joined the Cromford Canal, which in turn joined the Erewash Canal below the lock out of shot to the left. The Erewash Canal nowadays provides the only navigable access to this location. Until the 1990s this scene would have been in Nottinghamshire rather than Derbyshire, the area technically being known as Langley Bridge. The boundary was changed to follow a more logical course along the Eastwood by-pass rather than the River Erewash thus bringing the whole of Langley Mill into one parish."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Bramcote_Hills_Park_-_geograph.org.uk_-_17663.jpg",
      "title": "Garth Newton / Bramcote Hills Park",
      "caption": "Bramcote Hills Park. Besides large expanses of open space, the park also contains a walled garden, a children's play area, a sundial maze and the Holocaust Memorial Statue by Naomi Blake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/The_Hemlock_Stone_-_geograph.org.uk_-_17658.jpg",
      "title": "Garth Newton / The Hemlock Stone",
      "caption": "The Hemlock Stone, an inselberg of New Red Sandstone on Stapleford Hill, Nottinghamshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Attenborough_Nature_Reserve_-_geograph.org.uk_-_18249.jpg",
      "title": "Garth Newton / Attenborough Nature Reserve",
      "caption": "Attenborough Nature Reserve. A wildlife rich reserve which was formerly a gravel pit."
    }
  ],
  "distance_km": 45.0,
  "description": "This splendid cycling and walking trail explores the canals, countryside, towns and villages of south Derbyshire and Nottinghamshire. It's a circular route with miles of great traffic free sections so it's ideal for families or anyone looking for a safe cycle ride. Walkers can also enjoy the nice surfaced trails along the canals and through the nature reserves on this varied route. As a circular route there are several options for a start point. This route starts at Trent Lock on the Erewash Canal just south of the town of Long Eaton. Trent Lock is a significant canal junction where the River Soar, the Trent and Mersey Canal, the River Trent and the Erewash Canal meet (you can virtually explore this section on the street view link below). You then follow the canal towpath north through the town of Long Eaton to Sandiacre. You continue to Ilkeston, passing Gallows Inn and the impressive Bennerley Viaduct, before coming to Langley Mill at the basin of the Erewash Canal. It's a nice section with lots of pretty locks, stone bridges and views of the River Erewash. At Langley Mill you turn south and pick up the Nottingham Canal heading to Cossal and Trowell. The disused canal has now been declared as a nature reserve which attracts lots of dragonflies, damselflies and birdlife. The canal leads you towards Stapleford Hills and Bramcote Hills Park. The park includes a mix of woodland and parkland with a nice walled garden. You'll also pass the geologically fascinating Hemlock Stone. The stone is an outcrop of New Red Sandstone, deposited more than 200 million years ago in the Triassic Period. It's worth stopping to have a look at the plaque and stone on Stapleford Hill before continuing. From the park you continue through Stapleford and Chilwell to the lovely Attenborough Nature Reserve. Here you'll find 350 acres of lakes, wetland, woodland, grassland and scrub with a huge variety of wildlife to look out for. The Beeston Canal can also be picked up at the eastern end of the reserve, next to the pretty Beeston Lock. The final waterside section takes you along the River Trent to Trent Lock and the finish point. Towards the end of the route you pass along the Trent Valley Way so this is a good option if you would like to continue your walking in the area. The trail also forms part of the Nutbrook Trail Cycle Route which runs along the Erewash Canal before bearing right near Stapleford and heading up to Shipley Country Park on a dismantled railway line.",
  "video_url": "https://www.youtube.com/embed/SAkEe2MoGg8",
  "district": "Beeston",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "England"
}