{
  "objectID": "0aae9fdb3b0a9017250b6945820beb81",
  "created_at": "2024-12-18T11:48:08.397849+00:00",
  "ref": "silbury-hill-walking-route",
  "title": "Silbury Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Silbury_Hill_-_geograph.org.uk_-_776.jpg",
  "nearby": [
    {
      "description": "Avebury Stones",
      "objectID": "131fc4cd3eaa13cde0fc3361fc0d2e7a",
      "ref": "avebury-stones-walking-route"
    },
    {
      "description": "White Horse Trail",
      "objectID": "f8439cbeac9e3bb5a4852659b79a5429",
      "ref": "white-horse-trail-walking-route"
    },
    {
      "description": "Cherhill White Horse",
      "objectID": "66bf3dd0621fdf25f8c5635bec31aec9",
      "ref": "cherhill-white-horse-walking-route"
    },
    {
      "description": "Fyfield Down",
      "objectID": "4c5385f61aec3c360159cff8407f6d35",
      "ref": "fyfield-down-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/DA505654AA3F91A780257F580052A06E/$FILE/Silbury Hill.gpx",
  "_geoloc": {
    "lat": 51.4163936368,
    "lng": -1.861975137
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Silbury_Hill_-_geograph.org.uk_-_776.jpg",
      "title": "Alan Simkins / Silbury Hill",
      "caption": "Silbury Hill. The largest man-made earthwork in Europe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Meadow_beside_Silbury_Hill_-_geograph.org.uk_-_1347816.jpg",
      "title": "Derek Harper / Meadow beside Silbury Hill",
      "caption": "Meadow beside Silbury Hill. The meadow extends from the A4 (photo taken from viewpoint at car park) across to the River Kennet (in SU1068), which flows along the foot of Waden Hill in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Autumnal_oak_near_Swallowhead_Springs_-_geograph.org.uk_-_281986.jpg",
      "title": "Jim Champion / Autumnal oak near Swallowhead Springs",
      "caption": "Autumnal oak near Swallowhead Springs. On the right an oak tree alongside the path from the A4 road layby to West Kennett long barrow, close to Swallowhead Springs. On the left in the distance is Silbury Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/River_Kennet_between_Avebury_and_Silbury_Hill_-_geograph.org.uk_-_282009.jpg",
      "title": "Jim Champion / River Kennet between Avebury and Silbury Hill",
      "caption": "River Kennet between Avebury and Silbury Hill. The muddy bridleway from Avebury to the hill's car park runs along the eastern bank of the River Kennet, which is a large stream at this point. The shady side of the hill can be seen across the water meadow and the West Kennett long barrow is visible as a long dark shadow on the ridge in the distance, towards the left of the photo. The Ordnance Survey map labels the river as ending in a single \"t\" (Kennet) whereas the surrounding placenames that incorporate the name end in a double \"t\" (West Kennett)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Chalk_arable_land_east_of_Beckhampton_-_geograph.org.uk_-_282013.jpg",
      "title": "Jim Champion / Chalk arable land east of Beckhampton",
      "caption": "Chalk arable land east of Beckhampton. Looking north from the bridleway just north of the Silbury Hill car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Meadow_beside_Silbury_Hill_-_geograph.org.uk_-_1347816.jpg",
      "title": "Derek Harper / Meadow beside Silbury Hill",
      "caption": "Meadow beside Silbury Hill.  The meadow extends from the A4 (photo taken from viewpoint at car park) across to the River Kennet (in SU1068), which flows along the foot of Waden Hill in the background."
    }
  ],
  "distance_km": 2.0,
  "description": "This circular walk takes you around the Silbury Hill ancient monument near Avebury in Wiltshire. The hill stands at a height of 30 metres (98 ft) making it the tallest prehistoric man-made mound in Europe. It is thought to have been created around 2400 BC, though its original purpose is up for debate. Silbury is part of the Stonehenge, Avebury and Associated Sites UNESCO World Heritage Site, making it a significant historical site. The walk starts from the car park off the A4, next to the hilll. You follow a good footpath around the hill and cross the River Kennet, before picking up the White Horse Trail to take you along the river. Look out for water voles on this section of the walk. A path along the A4 leads back to the car park. If you'd like to extend your walk you could follow the White Horse Trail to the fascinating Avebury Stone Circle which lies less than a mile to the north of Silbury Hill. Head west along the waymarked trail and you will soon arrive at the Cherhill White Horse which is also well worth a visit.",
  "video_url": "https://www.youtube.com/embed/QA0w5MGOmR0",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England"
}