{
  "created_at": "2025-01-06T02:11:55.370698+00:00",
  "objectID": "0b5152c7f441d99ca555c65b57c0cbd3",
  "ref": "cleeve-hill-circular-walking-route",
  "title": "Cleeve Hill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/The_Three_Sisters%2C_Cleeve_Cloud_-_geograph.org.uk_-_526506.jpg",
  "nearby": [
    {
      "description": "Belas Knap",
      "objectID": "41504a2f87208ec563112780d24de2d2",
      "ref": "belas-knap-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Sudeley Castle",
      "objectID": "f422bdfc8dfe7ccf0ca3ac274f811d7a",
      "ref": "sudeley-castle-walking-route"
    },
    {
      "description": "Winchcombe to Cleeve Hill Walk",
      "objectID": "1b5f93f4343b1184e99e5c1d5cbccbb8",
      "ref": "winchcombe-to-cleeve-hill-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0b5152c7f441d99ca555c65b57c0cbd3.gpx",
  "_geoloc": {
    "lat": 51.9219941349,
    "lng": -2.0100230593
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/The_Three_Sisters%2C_Cleeve_Cloud_-_geograph.org.uk_-_526506.jpg",
      "title": "Mike Baldwin / The Three Sisters, Cleeve Cloud",
      "caption": "The Three Sisters, Cleeve Cloud. The Three Sisters are three trees on the edge of the escarpment of Cleeve Hill, the third tree has been replaced by a young tree."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/View_from_Cleeve_Hill_-_geograph.org.uk_-_299073.jpg",
      "title": "Philip Halling / View from Cleeve Hill",
      "caption": "View to the north-west from Cleeve Hill, the much developed Bishop's Cleeve village can be seen at the foot of Cleeve Bill. On the horizon at the Malvern Hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Cleeve_Common_-_geograph.org.uk_-_2739658.jpg/512px-Cleeve_Common_-_geograph.org.uk_-_2739658.jpg",
      "title": "Cleeve Common by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cleeve Common. The common is a significant site for its biology and geology. It is located Jurassic limestones on the top of the Cotswold scarp. As you make your way across the site look out for rare orchids such as the bee orchid, the frog orchid and the musk orchid. Butterflies such as the dark green fritillary, grayling and marsh fritillary can also be seen in the warmer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Cleeve_Cloud_Trig_Point_-_geograph.org.uk_-_38058.jpg",
      "title": "Terry Jacombs / Cleeve Cloud Trig Point",
      "caption": "Cleeve Cloud Trig Point. On a clear day the view extends an impressive 90 miles to Winsford Hill on Exmoor, Somerset."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/View_towards_Winchcombe_from_Cleeve_Hill_-_geograph.org.uk_-_296074.jpg",
      "title": "Philip Halling / View towards Winchcombe from Cleeve Hill",
      "caption": "View towards Winchcombe from Cleeve Hill. The town of Winchcombe can be seen in the valley bottom on the left and to the centre Sudeley Castle is just visible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/View_of_the_Malvern_Hills_from_Cleeve_Hill_-_geograph.org.uk_-_93050.jpg",
      "title": "Bob Embleton / View of the Malvern Hills from Cleeve Hill",
      "caption": "View of the Malvern Hills from Cleeve Hill. Looking WNW across the Severn Plain to the Malvern Hills on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Cleeve_Hill_-_geograph.org.uk_-_755398.jpg",
      "title": "Ian Hunter / Cleeve Hill",
      "caption": "Walkers make their way along part of the Cotswold Way on the hill. The path is leading down to The Washpool at Watery Bottom where there are some dogs having a splash. There's clear water from the spring which you can follow up the valley here. It's a pleasant little spot on the hill for a picnic and stroll. The medieval Postlip Hall and the River Isbourne can be found just to the north east of the pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Grassland%2C_Cleeve_Hill_-_geograph.org.uk_-_567787.jpg",
      "title": "Richard Webb / Grassland, Cleeve Hill",
      "caption": "Grassland, Cleeve Hill. A surviving remnant of open unenclosed grassland on the Cotswolds. Cars parked along a byway while their occupants are orienteering on the complicated quarried terrain of the hill."
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to the highest point in the Cotswolds on this splendid circular walk. The walk makes use of the Cotswold Way so is well defined and way-marked. It begins at the car park at the southern end of Cleeve Common before crossing the common and climbing up to the peak of Cleeve Hill which stands at 1,083 ft (330 m). From here there are marvellous views: to the west, over Cheltenham and the racecourse, over the River Severn and into Wales, and to the north over Winchcombe. You can extend the walk by heading to the eastern side of the hill where you will find Belas Knap. The neolithic, chambered long barrow is a scheduled ancient monument in the care of English Heritage. The fascinating site dates from 3000BC and features a false entrance and independently accessible side chambers. The Cotswold Way can be followed to the site from Cleeve Hill. You could also start the walk from nearby Winchcombe and follow the Cotswold Way to the hill. The Winchcombe Way runs through the town and the area surrounding Cleeve Hill.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rising Sun Hotel is a great place for some post walk refreshments. The pub is wonderfully positioned on the hill with a fine beer garden with views over five different counties of England. It's the perfect place to relax and enjoy a meal on a fine day. You can find it just west of the hill summit at a postcode of GL52 3PX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and surrounding woods make for an excellent dog walk for fit dogs. The Rising Sun mentioned above is also dog friendly and will provide dog bowls too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's another car park closer to the hill if you'd like a shorter, more direct path to the summit. You can find it just off the B4632 about a quarter of a mile north east of the hill. Postcode for your sat navs is GL52 3PW. From there you have a choice of footpaths heading south to take you up to the viewpoint. After climbing the hill you could head into the nearby village of Bishop's Cleeve. It's a nice place to stroll around with a real olde England feel to it. There's dozens of listed buildings with thatched, half-timbered houses dating back to the 12th century and 13th century.   Pictured above, some of the fine buildings you can see in the village of Bishop's Cleeve which sits at the foot of the hill. Also of interest is the historic Sudeley Castle. It's located only a few miles due east of Cleeve Hill and another worthy addition to your outing. There's lots of footpaths to follow around the 1,200 acre estate with some stunning gardens to see on the way. To visit the hill from the nearby town of Winchcombe you could try the circular Winchcombe to Cleeve Hill Walk. The route visits Belas Knap and the River Isbourne as well as the hill summit."
    }
  ],
  "video_url": "https://www.youtube.com/embed/idDrN1Z8fyo",
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cleeve Common, Main Path, Nutterswood, Southam, Cleeve Hill, Tewkesbury, Gloucestershire, England, GL52 3PZ, United Kingdom",
  "postcode": "GL52 3PZ",
  "district": "Tewkesbury",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "ancient monument",
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}