{
  "objectID": "0b9c1baa1438184d592ba3bede64e0e2",
  "created_at": "2024-12-18T01:38:02.833243+00:00",
  "ref": "longshaw-estate-walking-and-cycle-route",
  "title": "Longshaw Estate Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/08/Longshaw_Estate_car_park_-_geograph.org.uk_-_1114545.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/71637A609DB81CAE80257CC0007CB7BE/$FILE/Longshaw Estate.gpx",
  "_geoloc": {
    "lat": 53.3064193939,
    "lng": -1.6197217272
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Longshaw_Estate_car_park_-_geograph.org.uk_-_1114545.jpg",
      "title": "Steve  F / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Longshaw Estate car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Disused_quarry_on_the_edge_of_Longshaw_Estate_-_geograph.org.uk_-_558852.jpg",
      "title": "Roger Temple / Disused quarry on the edge of Longshaw Estate",
      "caption": "Disused quarry on the edge of the estate. It is many years since stone was taken from this quarry and the heather has taken over to give a glorious late summer show."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Longshaw_Lake_-_geograph.org.uk_-_379433.jpg",
      "title": "John Fielding / Longshaw Lake",
      "caption": "Longshaw Lake.  Carl Wark the ironage hillfort can be seen in the distance at the centre of the photo below the lovely autumn leaves. Taken in November 2006."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Longshaw_Lodge_Estate_-_geograph.org.uk_-_549949.jpg",
      "title": "Roger Temple / Longshaw Lodge Estate",
      "caption": "Today most of the parkland surrounding Longshaw Lodge is rough grazing for cattle and sheep. Whether this was always the case or whether this used to be more pristine grassland is not known. Eyam Moor can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Private_chapel_to_Longshaw_Lodge_-_geograph.org.uk_-_549959.jpg",
      "title": "Roger Temple / Private chapel to Longshaw Lodge",
      "caption": "Private chapel to Longshaw Lodge. This building stands to the south of the main Lodge within the private area of the estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Longshaw_Estate_-_geograph.org.uk_-_905427.jpg",
      "title": "Oxymoron / Longshaw Estate",
      "caption": "This is a view from the National Trust visitor centre over part of the estate, with Mother Cap visible on the horizon in the distance. Although it's not obvious from this photo, there are two roads between this point and the heights at Mother Cap, and vehicles travelling along those roads often spoil the purity of the view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Stone_seat_on_Longshaw_Edge_-_geograph.org.uk_-_549945.jpg",
      "title": "Roger Temple / Stone seat on Longshaw Edge",
      "caption": "Stone seat on Longshaw Edge. This seat gives panoramic views across Longshaw and the Peak District as far as the Kinder Plateau. behind the seat is a professional carving - 'DEC 1830'. I think this is more likely to be the initials of someone from Longshaw Lodge rather than just a month and the year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Woodland_around_Longshaw_Lodge_-_geograph.org.uk_-_549954.jpg",
      "title": "Roger Temple / Woodland around Longshaw Lodge",
      "caption": "Woodland around Longshaw Lodge. The Lodge itself is out of view behind the trees. Taken in the early autumn of 2007, just as the trees are starting to brown."
    }
  ],
  "distance_km": 6.0,
  "description": "The Longshaw Estate is a National Trust owned country park in Upper Padley in the Peak District. The estate is perfect for walking with fabulous views of the Peak District, ancient woods, parkland and heather moorland. In the park there are pretty ponds, a waterside path along Barbrage Brook and the lovely Big Moor where you should look out for red deer. There are also excellent facilities with a tea room, shop and the Moorland Discovery Centre. From easter 2014 there will be two new bridleways suitable for cyclists. The routes will be waymarked so you can explore the estate on two wheels or on foot. The Derwent Valley Heritage Way runs near the estate so you could continue your walk along the River Derwent. You could also continue south and climb up to Froggatt Edge and Curbar Edge where there are spectacular views of the Peak District. The wonderful Padley Gorge Trail with its babbling brook and pretty waterfalls is another good option. You're also close to Stanage Edge where you can enjoy fabulous views and interesting rock formations. The park is located just a few miles from Sheffield.",
  "video_url": "https://www.youtube.com/embed/bgKvTyJQRgE",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}