{
  "created_at": "2025-01-06T03:26:13.798460+00:00",
  "objectID": "0c879db862142efde19b17abd060ac05",
  "ref": "kennet-and-avon-canal-walk-walking-route",
  "title": "Kennet and Avon Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/25/Along_the_Towpath_-_geograph.org.uk_-_496462.jpg",
  "nearby": [
    {
      "description": "Newbury to Kintbury and Hungerford Canal Walk",
      "objectID": "1b93c28ff0260cc269591841f321879a",
      "ref": "newbury-to-kintbury-and-hungerford-canal-walk-walking-route"
    },
    {
      "description": "Devizes and Caen Hill Locks",
      "objectID": "08da230ffa485aa7336448d02d333aec",
      "ref": "devizes-and-caen-hill-locks-walking-route"
    },
    {
      "description": "Reading Circular River Walk",
      "objectID": "63d99085a362ce6b20a281c55d43f90c",
      "ref": "reading-circular-river-walk-walking-route"
    },
    {
      "description": "Bradford on Avon Canal and River Walk",
      "objectID": "894b72e8509ad0d9282c08ad12367482",
      "ref": "bradford-on-avon-canal-and-river-walk-walking-route"
    },
    {
      "description": "Thatcham Discovery Centre",
      "objectID": "4b642d5f559dc68f8cc6adf9da1f5b5d",
      "ref": "thatcham-discovery-centre-walking-route"
    },
    {
      "description": "Dundas Aqueduct",
      "objectID": "6557fb85a13f002fe45c491896dfc462",
      "ref": "dundas-aqueduct-walking-route"
    },
    {
      "description": "Freshford",
      "objectID": "fb41c5b3aa5853296054d3d40d716b75",
      "ref": "freshford-walking-route"
    },
    {
      "description": "Great Bedwyn",
      "objectID": "dd4fff7d0c563e778e7860f503e40f37",
      "ref": "great-bedwyn-walking-route"
    },
    {
      "description": "Pewsey",
      "objectID": "966c6818a4ec3f1bf02a0685ddd7b65b",
      "ref": "pewsey-walking-route"
    },
    {
      "description": "Holt Wiltshire",
      "objectID": "60748a6e62d5bce43ebbceab10e805b6",
      "ref": "holt-wiltshire-walking-route"
    },
    {
      "description": "Aldermaston",
      "objectID": "ae64fb1d26f9c9c619496e1ca01d055c",
      "ref": "aldermaston-walking-route"
    },
    {
      "description": "Hungerford",
      "objectID": "1b8c1e0f82e483abe3eb8ad7900d8710",
      "ref": "hungerford-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Along_the_Towpath_-_geograph.org.uk_-_496462.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Along the Towpath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Bradford_on_Avon_Wharf.jpg/256px-Bradford_on_Avon_Wharf.jpg",
      "title": "By Charles Miller (Flickr: Bradford on Avon Wharf) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Bradford on Avon Wharf"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Avoncliff_-_geograph.org.uk_-_3648.jpg",
      "title": "David Stowell / Avoncliff, via Wikimedia Commons",
      "caption": "Avoncliff. On the aqueduct that crosses both the River Avon and the Bath the Westbury railway line at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Dundas_Aqueduct_-_Somerset_Coal_Canal_%2825152230862%29.jpg/512px-Dundas_Aqueduct_-_Somerset_Coal_Canal_%2825152230862%29.jpg",
      "title": "Andrew Bone from Weymouth, England [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Dundas Aqueduct near Bath, where it joins the Kennet & Avon Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Semington-aqueduct.jpg",
      "title": "Subarite [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Semington aqueduct. Built to allow the A350 Semington bypass road to pass underneath the canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Brunsdon_Lock_and_Bridge_07.jpg/512px-Brunsdon_Lock_and_Bridge_07.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Brunsdon Lock and Bridge (Bridge 79) on the Kennet and Avon Canal, northwest of Kintbury, Berkshire, England. The late 18th-century bridge and accompanying lock is a Grade II listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Approaching_Kintbury_-_geograph.org.uk_-_1340739.jpg",
      "title": "Graham Horn / Approaching Kintbury, via Wikimedia Commons",
      "caption": "Approaching Kintbury. The approach to Kintbury from the west. The village has many large and immaculate gardens running down to the water's edge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Abbey_View_Lock%2C_Kennet_and_Avon_Canal_-_geograph.org.uk_-_182453.jpg",
      "title": "Pierre Terre / Abbey View Lock, Kennet and Avon Canal, via Wikimedia Commons",
      "caption": "Abbey View Lock near Bath. The fourth lock up from the Avon, looking upstream."
    }
  ],
  "distance_km": 122.0,
  "description": "A splendid waterside walk from the Thames at Reading, through Thatcham, Newbury, Hungerford, Great Bedwyn, Pewsey, Devizes, Bradford on Avon to Bath. Most of the walk follows the towpath making for an easy, relaxing walk. The route of the Kennet & Avon Canal takes you through some of the nation's best loved landscapes, including West Berkshire - an Area of Outstanding Natural Beauty - and the southern tip of the rolling Cotswolds. Highlights include the delightful Thatcham Discovery Centre, Caen Hill Locks (video below), Avoncliff Aqueduct, Claverton Pumping Station, numerous pretty canalside villages and the historic city of Bath.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the walk there's several fine options for refreshments. The canal passes along the Thatcham Nature reserve where there is a nice lakeside cafe. There's seats outside with nice views over the reserve's lake, so perfect for a fine day. You could also head into Thatcham village and visit the King's Head. It's a lovely, recently refurbished old Pub, with a wonderful Beer Garden and Garden Bar. The pub is also dog friendly and can be found it at 59 Broadway with a postcode of RG193HP for your sat navs.In Newbury you will find the delightful Tea Shop By The Canal which is perfect for afternoon tea. Set in an interesting old Grade II listed building the tea shop blends the comfort and warmth of Italian culture with the fine and splendid rituals of English Cream Teas. There's also outdoor seating so you can sit out right next to the canal on warm summer days. You can find it at The Stone Building, The Wharf, Newbury with a postcode of RG145AS. In Avoncliff be sure to investigate the noteworthy Cross Guns Inn. The pub dates all the way back to 1550 and is a splendid example of Cotswold stone and expert masonry. Indoors there's old gables, wooden beams, stone floors, and cosy roaring fires to warm yourself next to on colder days. Outdoors there are lovely terraced gardens with fine views of the railway aqueduct and the canal. It's the perfect spot to relax in on warm summer days. You can find the pub at 159 Bradford Road with a postcode of BA15 2HB for your sat navs. The Hourglass is in a lovely location right next to the canal in Devizes. From the terrace garden there are lovely views over the water to the surrounding countryside. It's a great place to relax and watch the boats go by on warm summer days. They have an excellent menu and can be found at Horton Avenue with a postcode of SN10 2RH. At Honeystreet west of Pewsey you'll find the idyllic Barge Inn. This historic pub is located right next to the canal and includes an outdoor seating area wih glorious views across the canal to the Marlborough Downs and the Alton Barnes White Horse. It's the ideal place to relax in and watch the world go by on warm summer days. The pub also has an interesting history having originally been built in 1810 to service the newly built Kennet and Avon canal, it was the equivalent of a modern day motorway service station. It then burnt down in the 1850s only to be rebuilt in record time so it now stands as it did then. The pub can be found just to the west of Pewsey in Honeystreet, near Alton Barnes. Postcode for you sat navs is SN9 5PS. In the delightful Somerset village of Freshford there's another excellent historic pub in the shape of the Inn at Freshford. The pub dates from the 16th century and is ideally located on the banks of the River Frome. There's original timber beams, open fires, and an award winning garden with lovely views of the countryside. You can find it at a postcode of BA2 7WG just to the west of the canal near Avoncliff. At Aldermaston Wharf you'll find a British Waterways visitor centre and the lovely Aldermaston Tea Rooms. The tea rooms are located in a lovely spot by the canal at the Wharf. You can sit outside in the garden area and enjoy a cream tea with views of the water. The cafe can be found at Wharfside, RG7 4JS."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The canal passes close to the circular Two Tunnels Greenway. This shared cycling and walking route runs along an easy path around the city of Bath. It makes an excellent detour from the route if you have time. In the Vale of Pewsey you will pass the village of Wilton where a small detour to Wilton Windmill is a nice idea. The picturesque mill is notable as the only working windmill in Wessex and still produces wholemeal, stone-ground flour. During the summer season there are also guided tours available on certain days. To reach the mill you can leave the canal at Crofton and head south east past Wilton Water to the village and the mill. In this area you'll also find the Crofton Pumping Station which is one of the most significant industrial heritage sites in the UK. You can learn about the industrial and social history of the area at this interesting site. It dates from 1812 and is the oldest working beam engine in the world. The steam-powered pumping station is well preserved and operates on selected weekends."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CH4RotjqKko",
  "gazetteer_found": false,
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0c879db862142efde19b17abd060ac05.gpx",
  "_geoloc": {
    "lat": 51.458682941,
    "lng": -0.9493106247
  },
  "nominatim_found": true,
  "display_address": "Kennet Side, Earley, Reading, Wokingham, England, RG1 3LX, United Kingdom",
  "postcode": "RG1 3LX",
  "district": "Reading",
  "county": "Wokingham",
  "region": null,
  "state": "England",
  "country": "United Kingdom",
  "llama_cpp": true,
  "estimated_duration": "1 day",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "rural"
  ],
  "points_of_interest": [
    "historic sites",
    "villages",
    "canalside"
  ],
  "facilities": [
    "visitor center",
    "canal-side",
    "historic city"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}