{
  "created_at": "2025-01-06T01:36:27.322691+00:00",
  "objectID": "0cbbe051aa2e2d752d244854fa89149a",
  "ref": "edwinstowe-walking-route",
  "title": "Edwinstowe Walks Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/High_Street%2C_Edwinstowe_-_geograph.org.uk_-_2501398.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0cbbe051aa2e2d752d244854fa89149a.gpx",
  "_geoloc": {
    "lat": 53.2011661973,
    "lng": -1.063048554
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/High_Street%2C_Edwinstowe_-_geograph.org.uk_-_2501398.jpg",
      "title": "High Street, Edwinstowe by Alex McGregor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "High Street, Edwinstowe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/St_Mary%27s_Church%2C_Church_Street%2C_Edwinstowe_%283%29.jpg/512px-St_Mary%27s_Church%2C_Church_Street%2C_Edwinstowe_%283%29.jpg",
      "title": "Enchufla Con Clave, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "St Mary's Church, Church Street, Edwinstowe. Local legend has it that it was here, at the beautiful medieval church, that Robin married Maid Marian"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Thoresby_Colliery_-_geograph.org.uk_-_1926927.jpg",
      "title": "Thoresby Colliery by Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Thoresby Colliery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/The_Major_Oak_-_geograph.org.uk_-_1328654.jpg",
      "title": "Kate Jewell / The Major Oak",
      "caption": "The Major Oak. This ancient tree is the major tourist attraction in the Sherwood Forest Country Park. It is reputed to be over 1,000 years old. in the first half of the 20th Century visitors could walk right up to the tree but now it is fenced off to protect the soil around the trunk from erosion and the tree itself. In the mid 18th Century the tree was known as the Cock Pen Tree as it was used as a holding site for fighting cocks which were stacked in wicker baskets and hessian sacks inside the hollow trunk before they were released for the now illegal sport of cock fighting. In 1790 a Major Hayman Rooke wrote a popular book called \"Remarkable Oaks in the Park of Welbeck in the County of Nottinghamshire\" in which he mentioned the tree. A short time later the tree was renamed the Major's Oak which was quickly modified to the Major Oak. Apart from a short period in the 19th Century when it acquired the additional name of the Queen Oak, it retains this name to this day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Gleadthorpe_Open%2C_Sherwood_Forest_Country_Park_-_geograph.org.uk_-_1330942.jpg",
      "title": "Kate Jewell / Gleadthorpe Open, Sherwood Forest Country Park",
      "caption": "Gleadthorpe Open in the Sherwood Forest Country Park. The lack of flowering plants and trees on Gleadthorpe Open is due to a number of factors. The old common rights custom of 'pannage', bringing livestock into the forest to graze, meant that pigs grubbed out the root stock whilst foraging; fire was the probable cause of the tree loss and as it is low lying Gleadthorpe Open is susceptible to late frosts. Queen Oak Plantation is straight ahead. This probably originates from the 19th Century when a common name for the Major Oak was The Queen Oak."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/%22Temple%22_at_Clumber_Park%2C_looking_South_East_across_the_lake_-_geograph.org.uk_-_285507.jpg",
      "title": "Robert Neilson / \"Temple\" at Clumber Park, looking South East across the lake",
      "caption": "Clumber Park. \"Temple\", looking South East across the lake. This \"temple\" is one of many focal points, built in a classical style, that are found in Clumber Park. It affords a sheltered resting place for those who venture on a walk around the lake. This view is from the North West shore of the lake and also features Canada geese swimming line astern in the North Easterly direction of flow. This temple can also be seen from a smaller temple which is set back from the North West shore of the lake, near Clumber Chapel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Ollerton_-_Church_from_Station_Road_-_geograph.org.uk_-_2369314.jpg/512px-Ollerton_-_Church_from_Station_Road_-_geograph.org.uk_-_2369314.jpg",
      "title": "Ollerton - Church from Station Road by Dave Bevis, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ollerton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Ollerton_-_White_Hart_Hotel_-_geograph.org.uk_-_2369301.jpg/512px-Ollerton_-_White_Hart_Hotel_-_geograph.org.uk_-_2369301.jpg",
      "title": "Ollerton - White Hart Hotel by Dave Bevis, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ollerton"
    }
  ],
  "distance_km": 27.7,
  "description": "This Nottinghamshire based village sits in a pleasant spot, on the edge of Sherwood Forest near Mansfield. The village includes an attractive High Street and a noteworthy medieval church with connections to the legend of Robin Hood. This long circular walk from the village uses a section of the Robin Hood Way to visit Sherwood Forest Country Park, Clumber Country Park and the neighbouring town of Ollerton. The walk starts in the village centre where you can pick up the Robin Hood Way and follow the waymarked footpath north into Sherwood Forest Country Park. This area of woodland includes a visitor centre, lots of wildlife and woodland trails suitable for cycling and walking. You'll also pass the Major Oak, an ancient tree thought to be over 1000 years old. Follow the trail north and it will take you over the River Meden to the Gleadthorpe Breck Plantation. Here you head east to the Budby Corner Plantation before turning north to enter the splendid Clumber Park. You can follow the trails east to take you along the lovely lake to Hardwick Village. Here you cross the River Poulter, heading south towards Ollerton. This section passes Thoresby Park to the west. From Ollerton you can follow the pavement along the A road west to return to Edinstowe.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to the Royal Oak for some well earned refreshments. They have an ample car park, an attractive interior with log fires and a fine menu. You can find them on the High Street at postcode NG21 9QP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland trails on the route are ideal for dog walking. The Royal Oak mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south of the village you'll find Rufford Country Park. There's a pretty lake and some pleasant woodland trails here. Sherwood Pines Forest Park is also located near here and well worth a visit. Just to the east is the International Outdoor Adventure Activity Centre at Walesby Forest and the worthy village of Laxton. It's a historic place and significant as being England’s Last Open Field Village. You can visit the 12th century church, the Norman Motte and find out all about the area's history in the local visitor centre. For more walking ideas in the area see the Nottinghamshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1APqszC9yAU",
  "postcode": "NG21 9HN",
  "county": "Nottinghamshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swinecote Road, Edwinstowe CP, Ollerton, Newark and Sherwood, Nottinghamshire, East Midlands, England, NG21 9HN, United Kingdom",
  "district": "Newark and Sherwood",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical site",
    "park",
    "village"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}