{
  "created_at": "2025-01-06T03:06:21.580885+00:00",
  "objectID": "0cdf6632ade4d869c2e2ab1c1df278b4",
  "ref": "fermyn-woods-walking-and-cycle-route",
  "title": "Fermyn Woods Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/38/Bridleway_north_to_Fermyn_Woods_-_geograph.org.uk_-_378595.jpg",
  "nearby": [
    {
      "description": "Titchmarsh Nature Reserve",
      "objectID": "ce52019fa42cc2e75f7bab25f7d24381",
      "ref": "titchmarsh-nature-reserve-walking-route"
    },
    {
      "description": "Thrapston",
      "objectID": "078991c3700bf1370329c1d2d0e7fa17",
      "ref": "thrapston-walking-route"
    },
    {
      "description": "Cransley Reservoir",
      "objectID": "849a0c89cc5f92f59abf1e0cd8b431f1",
      "ref": "cransley-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0cdf6632ade4d869c2e2ab1c1df278b4.gpx",
  "_geoloc": {
    "lat": 52.453108972,
    "lng": -0.5990418579
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Bridleway_north_to_Fermyn_Woods_-_geograph.org.uk_-_378595.jpg",
      "title": "Tim Heaton / Bridleway north to Fermyn Woods",
      "caption": "Bridleway north to Fermyn Woods. A 2 mile bridleway between the A6116 and Fermyn Woods. I imagine it is little used by walkers, as the southern end of the bridleway may only be reached by walking along the verge of the busy A6116."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Lyveden_Way_way-marker_in_Fermyn_Wood_Country_Park_-_geograph.org.uk_-_378627.jpg",
      "title": "Tim Heaton / Lyveden Way way-marker in Fermyn Wood Country Park",
      "caption": "Fermyn Wood Country Park office. After 5 p.m., so office closed. But the car park and adjoining adventure playground were still busy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Fermyn_Wood_Country_Park_office_-_geograph.org.uk_-_378205.jpg",
      "title": "Tim Heaton / Fermyn Wood Country Park office",
      "caption": "'Harley Way' heading east to the woods. A narrow country road as it runs east from the A6116 to climb onto the higher ground leading to Fermyn Woods and other remnants of Rockingham Forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/%27Harley_Way%27_heading_east_to_Fermyn_Woods_-_geograph.org.uk_-_378174.jpg",
      "title": "Tim Heaton / 'Harley Way' heading east to Fermyn Woods",
      "caption": "'Harley Way' heading east to Fermyn Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Track_through_Fermyn_Woods_-_geograph.org.uk_-_324310.jpg",
      "title": "Tim Heaton / Track through Fermyn Woods",
      "caption": "Track through thwe woods. The track runs due south to exit the woods at Old Dry Hills near the A6116. The track to the right can (with difficulty) be followed to Brickhill Cottages at the south-west corner of the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Fermyn_Woods_Hall_-_geograph.org.uk_-_1180445.jpg",
      "title": "Michael Trolove / Fermyn Woods Hall",
      "caption": "Fermyn Woods Hall. The main tree lined drive to the hall."
    }
  ],
  "distance_km": 2.5,
  "description": "This country park and forest has a number of walking trails and two bridleways for cyclists. Formerly known as Brigstock Country Park, it is located a few miles north east of Kettering. For walkers there are three waymarked trails to enjoy: The Skylark Nature trail is an all abilities trail on good surfaced paths. It takes you around the ponds and woods located next to the car park. The Woodland walk is about a mile long and takes you a little further into the woods on good footpaths. The Fermyn Forest Walk is just over two miles taking you deep into the woodland on a mixture of hard and soft tracks. In the park you will find semi-natural oak and ash woodland, ponds, a visitor centre and cafe. It's a splendid area for wildlife watching - look out for Red kites, bullfinch, hawfinch, nightingales, skylark and green woodpeckers. You may also see badgers, fallow deer and Purple emperor butterflies.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The on site Skylark cafe is a nice place for refreshments after your exercise. There's seating inside and out plus a good range of meals and snacks to choose from."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are ideal for dog walking and there's plenty of bins dotted around the site. You're likely to bump into several other owners with their pets on your visit. The on site cafe is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Lyveden Way trail also starts from the car park at the park. This fine trail will take you east towards the National Trust's Lyveden Estate. Here you'll find a fine Elizabethan lodge and moated garden with a fascinating history. Just a few miles south east of the park you'll find the lovely Titchmarsh Nature Reserve in the town of Thrapston. There's several lakes and lots of wildlife to see here. You can also pick up the Ringstead Circular Walk amd the Nene Way in this area and enjoy riverside walks along the River Nene. To the west of Kettering there's the pretty Cransley Reservoir at the village of Thorpe Malsor. For more walking ideas in the area see the Northamptonshire Walks page."
    }
  ],
  "postcode": "NN14 3HS",
  "county": "North Northamptonshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}