{
  "created_at": "2025-01-06T01:03:43.955993+00:00",
  "objectID": "0d40dcdce15d2005267d17cfb70cc46f",
  "ref": "machynlleth-walking-route",
  "title": "Machynlleth Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Millennium_Bridge%2C_Machynlleth_-_geograph.org.uk_-_190870.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0d40dcdce15d2005267d17cfb70cc46f.gpx",
  "_geoloc": {
    "lat": 52.5868260446,
    "lng": -3.8559838646
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Millennium_Bridge%2C_Machynlleth_-_geograph.org.uk_-_190870.jpg",
      "title": "Oliver Dixon / Millennium Bridge, Machynlleth, via Wikimedia Commons",
      "caption": "Millennium Bridge, Machynlleth. This spectacular new bridge spans the River Dovey about 600 m east of the road bridge, and is constructed on the site of an old railway bridge (long since dismantled). The bridge and associated new path enables cyclists and walkers to avoid a particularly hazardous section of the A487 on the north bank of the Dovey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Pont_ar_Ddyfi_-_geograph.org.uk_-_240512.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Pont ar Ddyfi. As seen with a telephoto shot from Wylfa, about one and a quarter miles to the south. As a matter of interest, this is a 'cross-myriad' picture, from the north of SN to the south of SH."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Machynlleth_-_geograph.org.uk_-_240505.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Machynlleth, as viewed from Wylfa, about a mile to the south-west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Entrance_to_Bryntudur_-_geograph.org.uk_-_243434.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Entrance to Bryntudur, near to Machynlleth. Viewed from the lane to Wylfa."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Forestry_Walk_-_geograph.org.uk_-_232219.jpg",
      "title": "OLU [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Forestry Walk, near to Pennal. This gate beside the A487 provides access to an unsigned, well maintained and partly boarded forestry walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/360_view_hide%2C_Cors_Dyfi_nature_reserve.jpg/512px-360_view_hide%2C_Cors_Dyfi_nature_reserve.jpg",
      "title": "Celuici [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "360 view hide, Cors Dyfi nature reserve"
    }
  ],
  "distance_km": 8.0,
  "description": "This market town in Powys has some lovely trails to try through the Dovey and Lllyfnant Valleys. This walk takes you through the latter valley with riverside paths, woodland trails and a visit to the Cors Dyfi Nature Reserve near Derwenlas. Machynlleth is significant as the ancient capital and parliamentary seat of wales, home to Laura Ashley and lying within the UNESCO Dyfi Biosphere reserve. The walk starts just to the west of the town at the visitor centre. From here you can pick up country lanes heading south to Wylfa. Woodland trails then continue south taking you into the Lllyfnant Valley where you can enjoy riverside footpaths. The trails then bend round to the Cors Dyfi Nature Reserve in Derwenlas. The site includes habitats such as open water, swamp, bog, wet woodland, scrub and gorse. Boardwalks will take you to viewing platforms where you can look out for wildlife including Ospreys, otters, red kites, peregrines and hen harriers. Part of this route makes use of the Dyfi Valley Way. This waymarked, long distance trail is a great way of further exploring the area around the town. You could continue south west along it to Furnace and visit the Ynys Hir Nature Reserve where there are more good wildlife spotting opportunites. The epic Glyndwr's Way also passes through the town. You could follow the trail east to Abercegir. Machynlleth is located on the southern edge of the Snowdonia National Park where there's hundreds of great walks to try. Head north from the train station and you can cross the River Dovey and explore the forest around Foel Goch in the park. The wonderful Cambrian Mountains spread out to the south as well.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Red Lion in the town is a nice place to go for some refreshments after your walk. The cosy pub has a good menu and is also dog friendly. Outside you can relax in the beer garden on warmer days. Inside there's interesting heavy rock memorabilia on the walls and a cosy atmosphere. You can find the pub at 11 Heol Maengwyn with a postcode of SY20 8AA for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head north along the Dyfi Valley Way you could visit the interesting town of Dinas Mawddwy. The town sits in a nice spot at the confluence of three rivers in the lovely Dyfi Valley. There's some nice river trails, an interesting old mill and a large local forest for walkers to explore. The expansive Dyfi Forest is also located near here and has miles of walking and cycling trails to try. In this area you'll also pass the neighbouring village of Corris. The pleasant riverside village includes the heritage Corris Railway and pleasant walks through the River Dulas Valley. For more walking ideas in the area see the Snowdonia Walks and the Cambrian Mountains Walks pages."
    }
  ],
  "postcode": "SY20 8EU",
  "district": "Machynlleth",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cae-Gybi, Machynlleth, Powys, Cymru / Wales, SY20 8EU, United Kingdom",
  "state": "Cymru / Wales"
}