{
  "created_at": "2025-01-06T08:36:54.193123+00:00",
  "objectID": "0d6cf994aa44e5798a59163747541af4",
  "ref": "standing-hat-walking-route",
  "title": "Standing Hat and Balmer Lawn Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Wet_pony_at_Standing_Hat%2C_New_Forest_-_geograph.org.uk_-_121258.jpg",
  "nearby": [
    {
      "description": "Brockenhurst",
      "objectID": "b377a5f27f5582099b6d186c99f40598",
      "ref": "brockenhurst-walking-route"
    },
    {
      "description": "Ober Water",
      "objectID": "f33d92d77a3eddb8eae568927488c7a4",
      "ref": "ober-water-walking-route"
    },
    {
      "description": "Blackwater Arboretum Trail",
      "objectID": "e5486df8d508cf9f7a51b2f5a438b74d",
      "ref": "blackwater-arboretum-trail-walking-route"
    },
    {
      "description": "Denny Wood",
      "objectID": "43b7b893f9c8a196d1fd908de5172d6d",
      "ref": "denny-wood-walking-route"
    },
    {
      "description": "Hollands Wood",
      "objectID": "a5ec645d3370d77646d1ca123b234a40",
      "ref": "hollands-wood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0d6cf994aa44e5798a59163747541af4.gpx",
  "_geoloc": {
    "lat": 50.8278351292,
    "lng": -1.5652285976
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Wet_pony_at_Standing_Hat%2C_New_Forest_-_geograph.org.uk_-_121258.jpg",
      "title": "Jim Champion / Wet pony at Standing Hat, New Forest",
      "caption": "Wet pony. Between Balmer Lawn and the Pignal Inclosures is a area of open woodland called Standing Hat (a holly and oak holm). This photo is looking south from the Forestry Commission car park (closed to give the site a rest in the winter), towards one of the private dwellings in the Pignalhill Inclosure. The pony in the picture is wearing a reflective collar, which will make it a lot easier for Forest motorists to spot at night."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Pignal_Inclosure_from_Standing_Hat%2C_New_Forest_-_geograph.org.uk_-_121302.jpg",
      "title": "Jim Champion / Pignal Inclosure from Standing Hat, New Forest",
      "caption": "Pignal Inclosure from Standing Hat. The Forestry Commission car park at Standing Hat provides the most convenient access to the vast area of enclosures northwest of Brockenhurst. This view over a gate into the Pignal Inclosure shows two of the off-road cycle paths which (being gravelled) provide a dry winter walk through the plantations. The path on the left eventually leads to Clayhill south of Lyndhurst. There is some distortion at the edges due to the slightly \"wide angle\" lens on my compact camera."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Driftway_between_Parkhill_Inclosure_and_Stubby_Copse_Inclosure%2C_New_Forest_-_geograph.org.uk_-_43062.jpg",
      "title": "Jim Champion / Driftway between Parkhill Inclosure and Stubby Copse Inclosure, New Forest",
      "caption": "Driftway between Parkhill Inclosure and Stubby Copse Inclosure in late summer. This view is looking north along the driftway which connects Standing Hat to Denny Wood. There are several driftways in this part of the Forest, which are essentially wide areas left between the numerous enclosures so that the Commoners' stock can freely move from one part of the Forest to another."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Ponies_grazing_on_Balmer_Lawn%2C_New_Forest_-_geograph.org.uk_-_121305.jpg",
      "title": "Jim Champion / Ponies grazing on Balmer Lawn, New Forest",
      "caption": "Ponies grazing on Balmer Lawn. Balmer Lawn is a large area of open lawn surrounded on three sides by woodland. The area was once far wetter and as a result of partial drainage and some shrinkage of the ground, the old purple moor grass tussocks have consolidated and with grazing have given the unusual 'hummock-scape' seen here. [Information from Discovering the New Forest by Terry Heathcote]"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Balmer_Lawn%2C_pond_-_geograph.org.uk_-_3224998.jpg/512px-Balmer_Lawn%2C_pond_-_geograph.org.uk_-_3224998.jpg",
      "title": "Balmer Lawn, pond by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pond, Balmer Lawn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/New_Forest_ponies_-_geograph.org.uk_-_1213.jpg",
      "title": "Penny Mayes / New Forest ponies",
      "caption": "Ponies and their foals graze on Balmer Lawn."
    }
  ],
  "distance_km": 4.0,
  "description": "This easy circular walk takes you through Forestry Commission managed Inclosures near Brockenhurst in the New Forest. You can park at the car park at Balmer Lawn and then follow good footpaths through the delightful woodland in the Pignal Inclosure. It's a lovely spot for an easy, peaceful stroll. Look out for the New Forest Ponies on your walk. If you'd like to try more easy walks near Brockenhurst then the Ober Water Walk and the Blackwater Arboretum Trail are both good options. Just to the north east the route can be extended by heading into Denny Wood .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Balmer Lawn Hotel is a great place to visit in the area. The exquisite building is surrounded by picturesque parkland and gardens. They are well known for their delicious afternoon tea which you can enjoy on the front terrace."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As you'd imagine the woodland trails are a fine place for a dog walk. The Balmer Lawn Hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Hollands Wood is located just north of Balmer Lawn and has a good campsite and a decent bridleway suitable for cyclists. For more walking ideas in the area see the Hampshire Walks and the New Forest Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/pszd827snBw?si=Tfyhdqd7cXqoXFok",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Greenways, Balmer Lawn Road, Brockenhurst, New Forest, Hampshire, England, SO42 7TT, United Kingdom",
  "postcode": "SO42 7TT",
  "district": "New Forest",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1-2 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "wildlife viewing"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}