{
  "created_at": "2025-01-06T02:05:36.420640+00:00",
  "objectID": "0d7ed24d146072fbb560c097dec2d52d",
  "ref": "dovestone-reservoir-walking-route",
  "title": "Dovestone Reservoir Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Dovestones_Reservoir_-_geograph.org.uk_-_489653.jpg",
  "nearby": [
    {
      "description": "Chew Reservoir",
      "objectID": "0a35ed6a408535ab131db2faaecec877",
      "ref": "chew-reservoir-walking-route"
    },
    {
      "description": "Saddleworth Moor",
      "objectID": "f3b1481eabf73cec0272a4220d55b432",
      "ref": "saddleworth-moor-walking-route"
    },
    {
      "description": "Oldham Way",
      "objectID": "5aeb40c8128d72cea5b1bb1992a0b91d",
      "ref": "oldham-way-walking-route"
    },
    {
      "description": "Greenfield Reservoir",
      "objectID": "7dfb37ed252a89df79d82c034708f21d",
      "ref": "greenfield-reservoir-walking-route"
    },
    {
      "description": "Pots and Pans",
      "objectID": "5ff01f4ed8af3b123205c3fb2b938ed3",
      "ref": "pots-and-pans-walking-route"
    },
    {
      "description": "Dovestone Rocks",
      "objectID": "aacea673e8d356ea2f54ad036c5cc376",
      "ref": "dovestone-rocks-walking-route"
    },
    {
      "description": "Uppermill",
      "objectID": "7e5ec6a2f05b9bc72bcc040093dc41ae",
      "ref": "uppermill-walking-route"
    },
    {
      "description": "Huddersfield Narrow Canal",
      "objectID": "cc37cb6f71f583b2bd8b68de491da756",
      "ref": "huddersfield-narrow-canal-walking-route"
    },
    {
      "description": "Strinesdale Country Park",
      "objectID": "ec92b6765fee620609bafe92e80ea7b7",
      "ref": "strinesdale-reservoir-and-country-park-walking-route"
    },
    {
      "description": "Alphin Pike",
      "objectID": "f9dc9531b18ee52079161bfae8dade1c",
      "ref": "alphin-pike-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0d7ed24d146072fbb560c097dec2d52d.gpx",
  "_geoloc": {
    "lat": 53.5289308695,
    "lng": -1.9812546255
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Dovestones_Reservoir_-_geograph.org.uk_-_489653.jpg",
      "title": "Paul Anderson [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dovestones Reservoir Located above the village of Greenfield Dovestones Reservoir was built in 1967 to supply drinking water for the Oldham area. Today the reservoir is quite a tourist attraction offering many walks amongst the picturesque surroundings of the Peak District National Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dovestones_from_Alphin_Hill.jpg/256px-Dovestones_from_Alphin_Hill.jpg",
      "title": "By Ian Roberts (Dovestone Reservoir from Alphin Hill) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Dovestones from Alphin Hill. The reservoir is located in a wonderful spot in the north west edge of the Peak District's Dark Peak area where the valleys of the Greenfield and Chew Brooks converge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Chew_Piece_Plantation_and_Dovestone_Reservoir_-_geograph.org.uk_-_1558237.jpg",
      "title": "Raymond Knapman / Chew Piece Plantation and Dovestone Reservoir, via Wikimedia Commons",
      "caption": "Chew Piece Plantation and Dovestone Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Dovestone_Reservoir_Overflow_-_geograph.org.uk_-_985833.jpg",
      "title": "Paul Anderson / Dovestone Reservoir Overflow, via Wikimedia Commons",
      "caption": "Dovestone Reservoir Overflow. Modifications to the overflow at Dovestone reservoir have had to be made after people were repeatedly climbing into the overflow and sitting on the circular ledges above the sheer 150 foot drop inside. The modifications have included the stainless steel climb proof fencing bolted all around the perimeter of the overflow which still allows the flow of water to pass through."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Dovestone_Reservoir_-_geograph.org.uk_-_1538103.jpg",
      "title": "michael ely / Dovestone Reservoir, via Wikimedia Commons",
      "caption": "View from the northern end of the dam wall by the spillway. Some statistics on the dams dimensions: its earth embankment is 38 metres high and 550 metres in length. It is 4.25 metres wide at the crest and 183 metres at the widest point at its base."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Dovestones_Reservoir_Dam_Head_-_geograph.org.uk_-_406443.jpg",
      "title": "John Fielding / Dovestones Reservoir Dam Head, via Wikimedia Commons",
      "caption": "Dovestones Reservoir Dam Head. A lone walker makes their way back to the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/The_Outflow_at_Dovestones_Reservoir_-_geograph.org.uk_-_407074.jpg",
      "title": "John Fielding / The Outflow at Dovestones Reservoir, via Wikimedia Commons",
      "caption": "The Outflow at the reservoir. Dean Rocks and Great Dove Stone Rocks can be seen left hand skyline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Mills_below_Dovestones_Reservoir_-_geograph.org.uk_-_1594440.jpg",
      "title": "Bill Boaden / Mills below Dovestones Reservoir, via Wikimedia Commons",
      "caption": "Mills below the reservoir. Nestling in the valley bottom, these are unfortunately now disused. Alderman's Hill is the other side of the valley."
    }
  ],
  "distance_km": 6.0,
  "description": "Enjoy an easy circular walk around this lovely reservoir on Saddleworth Moor. The reservoir is located a few miles east of Oldham on the edge of the Peak District. There is a well maintained footpath running around the reservoir. There is also the option of continuing north along the water to Yeoman Hey Reservoir and Greenfield Reservoir where there are views of the Greenfield Brook. You can also follow the Oldham Way east to the nearby Chew Reservoir. The area is very popular with walkers as the reservoir is surrounded by attractive countryside, woodland and gritstone crags. Also look out for pretty waterfalls at Dovestone Clough near the dam. There is some climbing on the Chew Hills at the southern end of the water but you are rewarded with great views across the reservoir. This route starts from the car park at the south western end of the reservoir but you could also catch the train to nearby Mossley and follow the Oldham Way to the water. If you would like to extend your walk then you could climb to Great Dovestone Rocks located on the eastern side of the reservoir. The rocks are a fascinating geological feature and give great views over the Peak District. Our Dovestone Rocks circular walk starts from the same car park and also visits Chew Reservoir. To extend your walk you could climb across Saddleworth Moor for fantastic views over the reservoirs. Just a short distance to the west you can enjoy a climb to Pots and Pans. The noteworthy hill includes interesting rock formations, an obelisk war memorial and fine views to Manchester.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head west into the village of Greenfield and enjoy refreshments at the King William IV Hotel on Chew Valley Rd, OL3 7DD. There's a great menu and a lovely beer garden to sit out and relax in when the weather is fine.If you have time head to Mossley and visit the Roaches Lock Inn. The pub's main attraction is a lovely beer garden with fine views of the Huddersfield Narrow Canal. It's an ideal spot for a rest on a fine day. You can find it at 387 Manchester Road with postcode OL5 9BB for your sat nav. There's also the option of walking into Mossley from the reservoir by following the waymarked Oldham Way west for about 3 miles."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir is very popular with dog walkers and you will probably see several other people with their pet on the walk."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": ""
    }
  ],
  "video_url": "https://www.youtube.com/embed/ItIE_cO5VR0",
  "postcode": "OL3 7NF",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}