{
    "created_at": "2025-01-05T23:33:15.923171+00:00",
    "objectID": "0dad0f0e750d2c6680a50c7a76bf5964",
    "ref": "coxwold-walking-route",
    "title": "Coxwold Walks",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Coxwold_Village_-_geograph.org.uk_-_1077739.jpg",
    "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0dad0f0e750d2c6680a50c7a76bf5964.gpx",
    "_geoloc": {
        "lat": 54.1872210399,
        "lng": -1.1810001743
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Coxwold_Village_-_geograph.org.uk_-_1077739.jpg",
            "title": "Andrew Blades / Coxwold Village",
            "caption": "Coxwold Village. Looking east from near the church."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/The_Pub_-_Coxwold_-_geograph.org.uk_-_914601.jpg",
            "title": "mauldy / The Pub - Coxwold",
            "caption": "The Fauconberg Arms. An inn with good food and accommodation on the main street of the village."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Coxwold_railway_station_MMB_01.jpg/512px-Coxwold_railway_station_MMB_01.jpg",
            "title": "mattbuck (category), CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "The remains of Coxwold railway station, now a private house."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Shandy_Hall%2C_Coxwold%2C_N_Yorkshire_-_geograph.org.uk_-_48006.jpg",
            "title": "Brian D Osborne / Shandy Hall, Coxwold, N Yorkshire",
            "caption": "Shandy Hall. This old hall is the former home of novelist Laurence Sterne. He lived here from 1760 to 1768 as perpetual curate of Coxwold. He is remembered for his novels The Life and Opinions of Tristram Shandy, Gentleman and A Sentimental Journey Through France and Italy. The Hall is now administered by the Laurence Sterne Trust, a registered charity and is open to the public as a museum."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Footpath_through_Snever_Wood%2C_near_Wass_%28N_Yorks%29_-_geograph.org.uk_-_73873.jpg",
            "title": "Uncredited / Footpath through Snever Wood, near Wass (N Yorks)",
            "caption": "Footpath through Snever Wood, near Wass (N Yorks)"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Mount_Snever_Observatory_-_geograph.org.uk_-_138830.jpg",
            "title": "Chris McLean / Mount Snever Observatory",
            "caption": "Mount Snever Observatory. Built to commemorate the coronation of Queen Victoria in 1838 this observatory is now disused but has tremendous views over the Dales from its position."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Byland_Abbey_-_geograph.org.uk_-_7279.jpg",
            "title": "Alison Stamp / Byland Abbey",
            "caption": "Byland Abbey. Extensive remains well worth a visit, beautiful peaceful and opposite a lovely pub."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Newburgh_Priory.jpg",
            "title": "Stuart and Fiona Jackson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Newburgh Priory. A stately home originally an Augustinian Priory from 1145. Later, the country seat for the Belassis family in the 16th and 17th century. A legend exists that claims Oliver Cromwell's head is entombed in a secret chamber within the walls. Belonged formerly to the Earls of Fauconberg and presently the home of the Wombwell family"
        }
    ],
    "distance_km": 7.8,
    "description": "This pretty little village in the North York Moors makes a fine base for walkers. There's a notable pub/hotel, an interesting museum dedicated to a well known local author and the historic Byland Abbey and Newburgh Priory just a stones throw away. This circular walk from the village visits three of the historic highlights of the area at Newburgh Priory, Shandy Hall and Byland Abbey. The walk starts from the public car park in the village and first heads south to pay a vist to Newburgh Priory. The priory dates back to 1145 and includes grounds with a water garden, hand crafted topiary, a walled garden, woodland and a large lake. You then return to the village and follow a road west to Shandy Hall. The author Laurence Sterne wrote the well known novel 'The Life and Opinions of Tristram Shandy' here. You can now explore the old hall and learn about Sterne in the interesting museum. At the hall you can pick up public footpaths heading north into the countryside. After reaching Cams Head you turn north west towards Olstead before turning east into Snever Wood. Here you'll pass the Mount Snever Observatory, a disused stone tower built in 1837 which originally contained a large telescope. Follow the woodland trails south east and they will take you towards Wass where you turn south to visit Byland Abbey. Here you can explore the extensive ruins of the 12th century abbey buildings. After exploring the abbey the walk heads west and then south to return to the village.",
    "details": [
        {
            "subtitle": "Pubs/Cafes",
            "content": "The excellent Fauconberg Arms is the ideal place for some post walk refreshments. It's a pub of some note, dating back to the 17th century and voted in the Top 30 out of 800 pubs for the 2019 Yorkshire’s Favourite Pub competition. The inn has a charming interior with flagstone floors, wooden beams and cosy log fires. There's also a lovely garden area where you enjoy views towards Byland Abbey. You can find them at Thirsk Bank with a postcode of YO61 4AD for your sat navs."
        },
        {
            "subtitle": "Dog Walking",
            "content": "The country and woodland trails make for a decent dog walk. You are requested to keep them on leads in the Byland Abbey area. The Fauconberg Arms mentioned above is also dog friendly."
        },
        {
            "subtitle": "Further Information and Other Local Ideas",
            "content": "The village is in a great position for exploring some of the highlights of the North York Moors. For example if you head a few miles north you can visit Sutton Bank and the Kilburn White Horse. There's some stunning views and dramatic scenery to be found at this popular spot. The area includes the pretty Gormire Lake which has a nice footpath around the perimeter.You can also explore the Hambleton Hills by picking up the trail from the Kilburn White Horse car park. Head south and you can visit the neighbouring town of Easingwold. The attractive market town includes a number of fine Georgian buildings and is well known for its excellent food and lovely old Sweet shop. The circular Easingwold Walk visits Coxwold, the nearby Oulston Reservoir and the village of Crayke. For more walking ideas in the area see the North York Moors Walks and Howardian Hills Walks pages."
        }
    ],
    "video_url": "https://www.youtube.com/embed/o9Y9-1g_ymw",
    "county": "North Yorkshire",
    "region": "York and North Yorkshire",
    "country": "United Kingdom",
    "gazetteer_found": true,
    "nominatim_found": true,
    "display_address": "Oulston Road, Railway Cottage, Coxwold, North Yorkshire, York and North Yorkshire, England, YO61 4AA, United Kingdom",
    "postcode": "YO61 4AA",
    "district": "Coxwold",
    "state": "England",
    "llama_cpp": true,
    "estimated_duration": "half day",
    "difficulty": "moderate",
    "terrain": ["woodland", "lake", "walled garden"],
    "points_of_interest": ["historical site", "museum", "observatory", "abbey"],
    "facilities": ["pub/hotel", "car park", "footpath"],
    "route_type": "circular",
    "activities": ["walking"]
}
