{
  "created_at": "2025-01-06T00:13:45.845439+00:00",
  "objectID": "0de127e01a71f3afdd9ffbde3ce1e788",
  "ref": "wychwood-forest-walking-route",
  "title": "Wychwood Forest Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Forest_Trail%2C_Wychwood_Forest_-_geograph.org.uk_-_1440034.jpg",
  "nearby": [
    {
      "description": "Charlbury Circular Walk",
      "objectID": "2ad9f0bc23a072f4ad59bb030db71bd7",
      "ref": "charlbury-circular-walk-walking-route"
    },
    {
      "description": "Blenheim Park",
      "objectID": "3a352e052f7f69b1c93a6c14bb922f2c",
      "ref": "blenheim-park-walking-route"
    },
    {
      "description": "Oxfordshire Way",
      "objectID": "f2f8c5cb204c351de4c898446fda44cc",
      "ref": "oxfordshire-way-walking-route"
    },
    {
      "description": "Cornbury Park",
      "objectID": "706aad3f500df23908405205ba9ffa7d",
      "ref": "cornbury-park-walking-route"
    },
    {
      "description": "Milton under Wychwood",
      "objectID": "63296474e1b84747a3c73bcc9782ffb6",
      "ref": "milton-under-wychwood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0de127e01a71f3afdd9ffbde3ce1e788.gpx",
  "_geoloc": {
    "lat": 51.8463675849,
    "lng": -1.4800426165
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Forest_Trail%2C_Wychwood_Forest_-_geograph.org.uk_-_1440034.jpg",
      "title": "Kurt C / Forest Trail, Wychwood Forest, via Wikimedia Commons",
      "caption": "Forest Trail in Wychwood Forest, Oxfordshire. Looking north, following a main forest trail towards Ranger's Lodge. Various broad-leafed trees line the trail on either side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Forest_Trail%2C_Wychwood_Forest_-_geograph.org.uk_-_1440049.jpg",
      "title": "Kurt C / Forest Trail, Wychwood Forest, via Wikimedia Commons",
      "caption": "A very beautiful downhill section of a trail within Wychwood Forest. This shot is looking South back into Wychwood. This picture is slightly overexposed, as the thick foliage here often lets through little sunlight. As a result, the ground here rarely dries out completely, making for interesting walking or cycling!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Wychwood_Forest_%28marshy_waters%29_-_geograph.org.uk_-_1440042.jpg",
      "title": "Kurt C / Wychwood Forest (marshy waters), via Wikimedia Commons",
      "caption": "Marshy lake beside the Forest Trail in the forest, just South of Grand Vista. The lake is on a tributary of the River Evenlode. The trail crosses the water a short distance ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Wychwood_Forest_%28woodland_avenue%29_-_geograph.org.uk_-_1440002.jpg",
      "title": "Kurt C / Wychwood Forest (woodland avenue), via Wikimedia Commons",
      "caption": "View northwest along Hazelwood Light, one of the rides in the forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Wychwood_Forest_%28pathway_at_Grand_Vista%29_-_geograph.org.uk_-_1440019.jpg",
      "title": "Kurt C / Wychwood Forest (pathway at Grand Vista), via Wikimedia Commons",
      "caption": "Looking north near the Grand Vista. Here, one of the forest trails meets a junction, with the entrance to the Cornbury Estate to the right. To the left, Grand Vista joins with a choice of several trails heading NW to NW, generally heading towards Walcot and Charlbury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Wychwood_Forest_at_Hatching_Hill_-_geograph.org.uk_-_358831.jpg",
      "title": "Martin Loader / Wychwood Forest at Hatching Hill, via Wikimedia Commons",
      "caption": "The narrow road from Leafield to Charlbury winds past the forest at Hatching Hill."
    }
  ],
  "distance_km": 6.0,
  "description": "Explore this large area of forest near Charlbury on this woodland walk. The forest can be reached from the nearby village of Finstock or from Charlbury. There are rail stations at both. The forest consists of hundreds of acres of attractive woodland, pretty streams and a series of lakes and ponds. The area is also a nature reserve so look out for a variety of interesting flora and fauna. These include several species of wildflower such as celadine, kidney vetch and bluebells. These flowers attract butterflies such as Barberry Carpet and Pale Shining Brown. Wychwood fair is a popular event which takes place in the forest at Cornbury Park. The fairs are centred on rural communities and crafts. The Oxfordshire Way passes through the area so you could pick up this long distance path to extend your walk. If you head east along the path you will come to Woodstock and the beautiful Blenheim Park. If you head north west from Charlbury you can enjoy a walk along the River Evenlode to Ascott-under-Wychwood.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into nearby Charlbury and there's several good choices for post walk refreshments. The Rose and Crown has an excellent selection of beers and were voted CAMRA Oxfordshire Pub of the Year and North Oxfordshire Pub of the Year in 2018. You can find the pub at 1 Market St with a postcode of OX7 3PL for your sat navs. The Rose and Crown doesn't do food so if you're looking for a bite to eat head to The Bell Inn. The pub is set in a beautiful 18th century Cotswold stone building and has a very good menu. You can find it on Church Street at postcode OX7 3PP."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails in the large forest are ideal for a dog walk so you'll probably bump into several other owners on your visit. The Rose and Crown and Bell Inn pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west are the villages of Milton under Wychwood and Shipton Under Wychwood where there's a fine medieval church. You can also visit the lovely Foxholes Nature Reserve where there are more nice woodland trails and pretty bluebells in the spring months."
    }
  ],
  "postcode": "OX7 3DQ",
  "district": "West Oxfordshire",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Witney Road, Finstock Heath, Finstock, Charlbury, West Oxfordshire, Oxfordshire, England, OX7 3DQ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "natural"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical events",
    "long distance path"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}