{
  "created_at": "2025-01-06T01:48:22.414157+00:00",
  "objectID": "0df63e29ff5a46dbd953a8b75eb0f7ca",
  "ref": "margam-country-park-walking-and-cycle-route",
  "title": "Margam Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/The_Breast_Plantations_in_Margam_Country_Park_-_geograph.org.uk_-_241260.jpg",
  "nearby": [
    {
      "description": "Afan Forest Park Country Park",
      "objectID": "d3198350da7fb9b053600f945943780a",
      "ref": "afan-forest-park-country-park-walking-and-cycle-route"
    },
    {
      "description": "Glamorgan Ridgeway Walk",
      "objectID": "70fa1ea4568f1b35381d45d56fdd87ab",
      "ref": "glamorgan-ridgeway-walk-walking-route"
    },
    {
      "description": "St Illtyd's Walk",
      "objectID": "4a4b91ac7ce3ca721bbfd025eb556451",
      "ref": "st-illtyds-walk-walking-route"
    },
    {
      "description": "Coed Morgannwg Way",
      "objectID": "fa7c642fb2f2afd87e863558f4708665",
      "ref": "coed-morgannwg-way-walking-route"
    },
    {
      "description": "Swansea to Bridgend",
      "objectID": "d9343ce857604a2901060a650a941d0d",
      "ref": "swansea-to-bridgend-cycle-route"
    },
    {
      "description": "Ogwr Ridgeway Walk",
      "objectID": "bbd7f5f8e49eb388404d1b9ee2c15863",
      "ref": "ogwr-ridgeway-walk-walking-route"
    },
    {
      "description": "Kenfig Nature Reserve",
      "objectID": "ffabee95f03da015f8f79bcf5a78cefa",
      "ref": "kenfig-nature-reserve-walking-route"
    },
    {
      "description": "Brombil Reservoir",
      "objectID": "2919d3e4d9cfa57185a2703869c774fc",
      "ref": "brombil-reservoir-walking-route"
    },
    {
      "description": "Port Talbot",
      "objectID": "e436da5e176b8132d4de4b579bda62cd",
      "ref": "port-talbot-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0df63e29ff5a46dbd953a8b75eb0f7ca.gpx",
  "_geoloc": {
    "lat": 51.5607420865,
    "lng": -3.7309086202
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/The_Breast_Plantations_in_Margam_Country_Park_-_geograph.org.uk_-_241260.jpg",
      "title": "Cedwyn Davies / The Breast Plantations in Margam Country Park",
      "caption": "The Breast Plantations in Margam Country Park. Five blocks of coniferous woodland on the hillside in the Deer Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Valley_in_the_east_of_Margam_Country_Park_-_geograph.org.uk_-_834129.jpg",
      "title": "eswales / Valley in the east of Margam Country Park",
      "caption": "Valley in the east of the park. View from high ground of a small valley in the south east corner of the grid square, with the western end of the wooded hillside Craig Goch forming a part of its eastern slope."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Boundary_of_forest_and_country_park%2C_Margam_-_geograph.org.uk_-_832403.jpg",
      "title": "eswales / Boundary of forest and country park, Margam",
      "caption": "Boundary of forest and country park, Margam. A stone wall, shadowed by a track, marking a section of the boundary between the Country Park and Mynydd Margam Forest in the south east of the grid square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Margam_Castle_-_geograph.org.uk_-_1308540.jpg",
      "title": "Robert Davies / Margam Castle",
      "caption": "Margam Castle. The imposing and reputedly haunted Margam Castle, built between the years 1830 and 1840 for the Talbot family, is situated at the heart of Margam Country Park. This Tudor Gothic grade 1 listed mansion was featured by William Henry Fox Talbot in some of his calotype photographs, which were among the earliest photographs taken in Wales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Ruins_of_Margam_Abbey_-_geograph.org.uk_-_1381824.jpg",
      "title": "John Lord / Ruins of Margam Abbey",
      "caption": "Ruins of Margam Abbey. The present day Abbey Church of St Mary, Margam, can be seen in the background. The abbey was founded in 1147 and dissolved by King Henry VIII in 1536. The site now consists of the intact nave and impressive surrounding ruins. Those ruins not belonging to the church are now owned by the County Council. These remains, including the unusually large twelve-sided chapter house, date from the 13th century and are Grade I listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Margam_Castle_-_geograph.org.uk_-_20636.jpg",
      "title": "Steve Rigg / Margam Castle",
      "caption": "A view across the parkland to Margam Castle. Walkers can be seen on one of the surfaced footpaths on the site. Surrounded by nearly 1000 acres of parklands, the 19th Century Tudor Gothic Mansion, once home to the Talbot family, was gutted by fire in 1977."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Path_descending_to_cross_Nant_Cwm_Philip_-_geograph.org.uk_-_984811.jpg/256px-Path_descending_to_cross_Nant_Cwm_Philip_-_geograph.org.uk_-_984811.jpg",
      "title": "eswales / Path descending to cross Nant Cwm Philip",
      "caption": "Path descending to cross Nant Cwm Philip. One of a number of paths in and around the park which are unmarked on OS maps drops down the lower slopes of Cwm Philip to cross Nant Cwm Philip."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Triangulation_Pillar_on_Mynydd_Margam_-_geograph.org.uk_-_1238889.jpg",
      "title": "Hywel Williams / Triangulation Pillar on Mynydd Margam",
      "caption": "Triangulation Pillar on Mynydd Margam. Behind the triangulation pillar in the distance, Ffynnon Oer wind farm can be seen. The hill is located just to the north east of the park. It includes a viewpoint and hundreds of acres of woodland."
    }
  ],
  "distance_km": 5.0,
  "description": "This large country park includes the magnificent Margam Castle, an 18th Century Orangery with ornamental gardens and a Deer Park, all set within 1000 acres of beautiful countryside. The park is excellent for cycling with miles of tarmac roads and rough tracks. A section of the National Cycle Network known as the Celtic Trail Route 4 runs through the northern end of the park. The only place that you are not allowed to cycle is the Orangery Gardens. There is also a splendid, 5 mile mountain Bike Trail. It is waymarked with yellow markers and takes place on tracks, paths and rough ground. The Margam Activity Centre offers guided rides for families. Margam is also great for walking with several different colour coded waymarked trails taking you to the different sections of the park. To extend your walking in the area head towards Porthcawl where you will find the lovely beach at Rest Bay and the Kenfig Pool Nature Reserve near Port Talbot. The site includes expansive sand dunes and the Kenfig Pool, Glamorgan's largest lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the Visitor Centre there's a nice on site cafe snacks, sandwiches and some particularly delicious ice cream."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a great place for dog walking so you will probably see plenty of other owners on your visit. You are asked to keep them on leads in the deer park, gardens and farm trail. They can be let off lead on the main lawns as far down as the farm trail, the area behind the castle and at enclosed area of East Lodge. To the north of the park there's also miles of woodland trails which are good for dog walking."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If your legs are feeling weary then there's a popular little train ride you can take up the steeper parts of the park. The diesel powered locomotive has three covered carriages where you can sit and enjoy the wonderful views. If you'd like to extend your walking from the park then one nice idea is to pick up the St Illtyd's Walk and follow the waymarked trail north to visit Afan Forest Park Country Park. There's miles more walking trails here with several popular mountain bikes trails as well. You could also follow a footpath north to Brombil Reservoir. The picturesque turquiose coloured lake is a lovely place for a peaceful stroll. From the hills surrounding the lake there are fine views to the coast too. You can find the site just a mile north of the park."
    }
  ],
  "video_url": "https://www.youtube.com/embed/A-c-BiqrMUc",
  "postcode": "SA13 2TA",
  "county": "Castell-nedd Port Talbot - Neath Port Talbot",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}