{
  "created_at": "2025-01-06T02:26:28.985450+00:00",
  "objectID": "0e110f9803194c7e6f89c2aa00b7998b",
  "ref": "aston-rowant-nature-reserve-walking-route",
  "title": "Aston Rowant Nature Reserve Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Aston_Rowant_Nature_Reserve_-_geograph.org.uk_-_745083.jpg",
  "nearby": [
    {
      "description": "Christmas Common and Watlington Hill",
      "objectID": "fb3e459a2cd19c9170539ad8f5b193a2",
      "ref": "christmas-common-and-watlington-hill-walking-route"
    },
    {
      "description": "The Ridgeway",
      "objectID": "2384cde76809687efb1a502a57345f61",
      "ref": "the-ridgeway-walking-route"
    },
    {
      "description": "Stokenchurch",
      "objectID": "50754f5ef59f92788cfa0b44a17cf481",
      "ref": "stokenchurch-walking-route"
    },
    {
      "description": "Chinnor",
      "objectID": "67b3c5cb5fc894f971492c5457ba45ce",
      "ref": "chinnor-walking-route"
    },
    {
      "description": "Ibstone",
      "objectID": "3c9dfc3d33d1b82413c840b20714af34",
      "ref": "ibstone-walking-route"
    },
    {
      "description": "Lewknor",
      "objectID": "92560340053f2e4e3c2f8e810eca8d78",
      "ref": "lewknor-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0e110f9803194c7e6f89c2aa00b7998b.gpx",
  "_geoloc": {
    "lat": 51.6562363454,
    "lng": -0.9507583979
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Aston_Rowant_Nature_Reserve_-_geograph.org.uk_-_745083.jpg",
      "title": "Andrew Smith / Aston Rowant Nature Reserve, via Wikimedia Commons",
      "caption": "Aston Rowant Nature Reserve. The Chiltern scarp around Watlington is deeply incised with combes. The nature reserve occupies the section from south of Bald Hill to north of Beacon Hill, ironically in Lewknor, not Aston Rowant. Here we see the transition to arable fields of the valley. The Icknield Way, now part of the Ridgeway, runs just beyond the first green field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Aston_Rowant_Nature_Reserve_-_geograph.org.uk_-_744853.jpg",
      "title": "Andrew Smith / Aston Rowant Nature Reserve, via Wikimedia Commons",
      "caption": "Sunshine lights up a combe above Hill Farm. The nature reserve has downland and woodland habitats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Bald_Hill%2C_Aston_Rowant_National_Nature_Reserve_-_geograph.org.uk_-_14377.jpg",
      "title": "David Hawgood / Bald Hill, Aston Rowant National Nature Reserve, via Wikimedia Commons",
      "caption": "Bald Hill, Aston Rowant National Nature Reserve. Beech woods at the top, juniper scrub on the chalk grassland of the Chilterns scarp"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Aston_Rowant_NNR_chalk_grassland_-_geograph.org.uk_-_696339.jpg",
      "title": "George Evans / Aston Rowant NNR chalk grassland, via Wikimedia Commons",
      "caption": "Chalk grassland in the foreground looking towards a valley in the Aston Rowant National Nature Reserve on the edge of the Chilterns."
    }
  ],
  "distance_km": 8.5,
  "description": "Enjoy a circular walk around this wonderful nature reserve in the Chilterns and climb Beacon Hill on the way. The reserve is a splendid place for walking with miles of good paths taking you through woodland, chalk grassland and some lovely Chilterns countryside. It's a wonderful place for flora and fauna with flowers such as orchids, the Chiltern gentian and various wildflowers. The attractive mixed woodland includes beech, yew, and juniper. As for wildlife look out for Red Kites soaring above and butterflies such as the silver-spotted skipper and the Adonis blue. You may also see Dartmoor Ponies, Roe deer, feral goats and buzzards. This walk starts in the good sized Cowleaze Wood car park and takes you through pretty bluebell woods before reaching Beacon Hill where you can enjoy wonderful views of the reserve and Chiltern Hills. The route then descends on the Ridgeway, before passing Bald Hill and returning to the car park. If you'd like to continue your walking in this lovely area then you could head to the nearby Christmas Common and Watlington Hill where there is more beautiful flora and fauna.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Lewknor and there's The Leathern Bottle for some post walk refreshments. It's an historic pub of some note dating all the way back to the 1600s. The Grade II listed pub serves good quality food and includes a splendid large garden area to relax in on warm summer days. They have a large car park so the pub makes a good start point for a walk in the area. The pretty village is also a nice place for a stroll with its 14th century church of St Margaret's and a series of photogenic old flint cottages to admire."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular walk from Stokenchurch starts in the nearby village and visits the reserve before heading to the nearby Chinnor Quarry. The quarry is a geologically fascinating area and a popular place for a walk. The village of Stokenchurch is also worth a visit with a 13th century church and a noteworthy hotel with an interesting history stretching back hundreds of years. Just to the south is the village of Ibstone where you can enjoy a walk along the boundary of the Wormsley Estate. The 16th century estate is well known for its cricket ground and is also a good place to look out for red kites."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3B2i_dc4lFw",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cowleaze Wood, Christmas Common Road, Lewknor, South Oxfordshire, Oxfordshire, England, HP14 3YL, United Kingdom",
  "postcode": "HP14 3YL",
  "district": "South Oxfordshire",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "chalk grassland",
    "countryside"
  ],
  "points_of_interest": [
    "flora and fauna",
    "views"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}