{
  "created_at": "2025-01-06T01:21:23.120284+00:00",
  "objectID": "0e1b77883047f9f0f66863ff12a65c1c",
  "ref": "malham-tarn-estate-walking-and-cycle-route",
  "title": "Malham Tarn Estate Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Malham_Tarn%2C_Highfolds_-_geograph.org.uk_-_844397.jpg",
  "nearby": [
    {
      "description": "Malham Cove",
      "objectID": "f69ffccaf926b2bbfa4b17aed1fcadc5",
      "ref": "malham-cove-walking-route"
    },
    {
      "description": "Settle Loop",
      "objectID": "66b6df5d33b4b0a60e0aec11a708bfc3",
      "ref": "settle-loop-walking-and-cycle-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Fountains Fell",
      "objectID": "39ac625fcf4a40d377d9910345cf2da2",
      "ref": "fountains-fell-walking-route"
    },
    {
      "description": "Giggleswick",
      "objectID": "966e1991f6aaa7e4aa3c66074c4d192c",
      "ref": "giggleswick-walking-route"
    },
    {
      "description": "Settle Caves and Waterfalls Walk",
      "objectID": "27e343dee3d0f2d49f203b947fecc790",
      "ref": "settle-caves-and-waterfalls-walk-walking-route"
    },
    {
      "description": "Winterburn Reservoir",
      "objectID": "a58e2016595bc513df78b99ce8bfc2cb",
      "ref": "winterburn-reservoir-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0e1b77883047f9f0f66863ff12a65c1c.gpx",
  "_geoloc": {
    "lat": 54.088317097,
    "lng": -2.16349982
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Malham_Tarn%2C_Highfolds_-_geograph.org.uk_-_844397.jpg",
      "title": "Martyn Gorman / Malham Tarn: Highfolds",
      "caption": "Malham Tarn: Highfolds. The view from Highfolds looking across Malham Tarn. The buildings in the middle distance are the old stables for Malham Tarn House which lies among the trees to the left. The house is now owned by The National Trust but leased to The Field Studies Council who use it to provide residential courses for young and old alike. The old stables have been converted to high quality accommodation for those attending the courses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Malham_Tarn_-_geograph.org.uk_-_1176828.jpg",
      "title": "Gordon Hatton / Malham Tarn",
      "caption": "The southern shore of the tarn close to Tarn Foot. Malham Tarn House can be seen on the far shore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Path_across_Ewe_Moor_-_geograph.org.uk_-_297602.jpg",
      "title": "Gordon Hatton / Path across Ewe Moor",
      "caption": "Path across Ewe Moor. Looking east towards the top of Malham Cove from the limestone pastures of Ewe Moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Malham%2C_Wedber_Wood_-_geograph.org.uk_-_845159.jpg",
      "title": "Martyn Gorman / Malham: Wedber Wood",
      "caption": "Wedber Wood. The footpath from Malham to Janet's Foss passes alongside Gordale Beck through Wedber Wood. The wild garlic that grows profusely in the damp rich soil is beginning to die back."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Malham%2C_the_path_to_Janet%27s_Foss_-_geograph.org.uk_-_1362993.jpg",
      "title": "Martyn Gorman / Malham: the path to Janet's Foss",
      "caption": "Walkers on the path to Janet's Foss. A party of young Aberdeen University biologists walking towards Janet's Foss. The building in the distance is New Laithe. A laithe is a field barn, a building combining a cow-house with space to store hay and other crops."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Malhamdale%2C_the_view_from_atop_Malham_Cove_-_geograph.org.uk_-_845172.jpg",
      "title": "Martyn Gorman / Malhamdale: the view from atop Malham Cove",
      "caption": "Malhamdale: the view from atop Malham Cove. Looking South from the top of Malham Cove, a dry limestone waterfall dating from the end of the last ice-age. The village of Malham lies in the middle distance. The surrounding fields are rich in ancient stone walls and lynchets, platforms built in Celtic times to facilitate ploughing by teams of oxen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Mantley_Field_Laithe_and_hay_meadow._-_geograph.org.uk_-_189843.jpg",
      "title": "Martyn Gorman / Mantley Field Laithe and hay meadow.",
      "caption": "Mantley Field Laithe and hay meadow. A field barn dating from 1755. The dialect word laithe comes from the Viking word hlatha, meaning barn. Around 4 cows were overwintered in such barns and were fed on stored hay. The hay meadow is rich in wild flowers. Note the terraces, or lynchets, to the left of the barn. These were built in Anglo-Saxon times to allow ploughing with teams of oxen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Malham_Tarn_House%2C_sundial_-_geograph.org.uk_-_1364150.jpg",
      "title": "Martyn Gorman / Malham Tarn House: sundial",
      "caption": "Sundial Tarn House. Originally a Georgian hunting lodge, it is now run as a field centre by the Field Studies Council. Sadly, the gnomon on the stylish garden sundial is now missing."
    }
  ],
  "distance_km": 7.0,
  "description": "This beautiful spot in the Yorkshire Dales is perfect for a safe cycle or walk. It is run by the National Trust and consists of a beautiful glacial lake, limestone pavements, upland hill farms and flower-rich hay meadows. There are also delightful waterside paths along the tarn and a National Nature Reserve with a bird hide and rare plants. For cyclists there is a nice, easy family cycle trail and more challenging routes for mountain bikers.  There are different routes for walkers with a stroll along the shores of Malham Tarn, through the National Nature Reserve and across the fields a favourite. The Settle Loop circular trail passes close to the estate so you could follow the route from the town to the estate. Alternatively there is a good sized car park just south of the tarn. The Pennine Way passes through the estate so you could pick up the trail to extend your walking in the area. If you head south you can visit the nearby Malham Cove. The site includes a hugely impressive curved cliff formation of limestone rock. Climbing north along the Pennine Way will take you to Fountains Fell and Fountains Fell Tarn with magnificent views over the area.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The estate can also be reached on the Mastiles Lane from Kilnsey. This old Roman Road is an interesting way to reach the site, passing an old Roman settlement on the way.Head west and you could Settle Caves and Waterfalls Walk and visit the splendid Catrigg Force and Scaleber Force waterfalls.On the other side of the River Ribble you'll also find the nearby village of Giggleswick. Here you could pick up the circular Giggleswick Walk and enjoy a climb to the excellent viewpoints on Giggleswick Scar. Just to the east there's some nice trails around Winterburn Reservoir. The reservoir is a little of the beaten track so a nice place for a peaceful walk.  For more walking ideas in the area see the Yorkshire Dales Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/RIYIsQi9Ib4",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Water Sinks, Henside Road, Low Trenhouse, Malham Moor, North Yorkshire, York and North Yorkshire, England, BD24 9PT, United Kingdom",
  "postcode": "BD24 9PT",
  "district": null,
  "state": "England"
}