{
  "created_at": "2025-01-06T03:55:00.867015+00:00",
  "objectID": "0e29c3db92e53d17066c601df86904be",
  "ref": "suffolk-coast-path-walking-route",
  "title": "Suffolk Coast Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/95/Suffolk_Coast_And_Heaths_Path_-_geograph.org.uk_-_1573298.jpg",
  "nearby": [
    {
      "description": "Shotley Peninsula",
      "objectID": "39b20e0f868cb2f3a266f568e45adc87",
      "ref": "shotley-peninsula-walking-route"
    },
    {
      "description": "Stour and Orwell Walk",
      "objectID": "fd6a1cb844bf80f32c77a011fee71c29",
      "ref": "stour-and-orwell-walk-walking-route"
    },
    {
      "description": "Sandlings Walk",
      "objectID": "6e283556dac10952906de5016af23b09",
      "ref": "sandlings-walk-walking-route"
    },
    {
      "description": "Minsmere Nature Reserve",
      "objectID": "c3ba9ede0d780da672e3e56f5a171339",
      "ref": "minsmere-nature-reserve-walking-route"
    },
    {
      "description": "Dunwich Forest",
      "objectID": "17b6b858fa8a4dbcd5035f6daa311286",
      "ref": "dunwich-forest-walking-route"
    },
    {
      "description": "Dunwich Heath",
      "objectID": "2d24a7501d7d2338cbe113f0e2764951",
      "ref": "dunwich-heath-walking-route"
    },
    {
      "description": "Southwold",
      "objectID": "c1df1439d6a34052643520ae577ba499",
      "ref": "southwold-walking-route"
    },
    {
      "description": "Kessingland to Southwold Walk",
      "objectID": "24ca68eb013a73da3665ae803b177e7a",
      "ref": "kessingland-to-southwold-walk-walking-route"
    },
    {
      "description": "Aldeburgh to Snape Maltings",
      "objectID": "02a3677262ee39b680e0a6b98b23dfe2",
      "ref": "aldeburgh-to-snape-maltings-walking-route"
    },
    {
      "description": "Levington",
      "objectID": "9534000e1200010f2441d173563f201d",
      "ref": "levington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0e29c3db92e53d17066c601df86904be.gpx",
  "_geoloc": {
    "lat": 51.9636446597,
    "lng": 1.3664450597
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Suffolk_Coast_And_Heaths_Path_-_geograph.org.uk_-_1573298.jpg",
      "title": "Keith Evans [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Suffolk Coast And Heaths Path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Nci_at_felixstowe.jpg/256px-Nci_at_felixstowe.jpg",
      "title": "Mark.murphy at English Wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Nci at felixstowe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Suffolk_Coastal_Path_-_geograph.org.uk_-_866909.jpg/256px-Suffolk_Coastal_Path_-_geograph.org.uk_-_866909.jpg",
      "title": "Alison Rawson [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Suffolk Coastal Path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Footbridge_-_geograph.org.uk_-_1573278.jpg",
      "title": "Keith Evans [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Footbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Coastguard_Cottages%2C_Dunwich_Heath_-_geograph.org.uk_-_6965.jpg",
      "title": "Andrew Stacey / Coastguard Cottages, Dunwich Heath, via Wikimedia Commons",
      "caption": "The Coastguard Cottages at Dunwich Heath overlook the National Trust's area of heathland conservation, and the eroding cliffs of Minsmere Beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Heatherscape_on_Dunwich_Heath_-_geograph.org.uk_-_932650.jpg",
      "title": "Zorba the Geek / Heatherscape on Dunwich Heath, via Wikimedia Commons",
      "caption": "Heatherscape on the heath. A mixture of ling and bell heather mixed with low gorse makes this colourful textured clifftop with the North Sea behind."
    }
  ],
  "distance_km": 83.0,
  "description": "A walk along the beautiful Suffolk coast from Felixstowe to Lowestoft. The walk passes through the Suffolk Coast and Heaths Area of Outstanding Natural Beauty which covers 150 square miles in East Anglia and includes wildlife-rich wetlands, ancient heaths, shingle beaches and historic towns and villages. You will pass through Bawdsey, Snape Maltings, Aldeburgh, North Warren, Thorpeness, Minsmere, Dunwich Forest, Southwold and Kessingland. Highlights on the route include the section around Leiston where you will pass the delightful Minsmere Nature Reserve - one of the UK's premier birdwatching sites. This section also takes you through the peaceful Dunwich Forest, the Walberswick Nature Reserve and the lovely National Trust owned Dunwich Heath. There's miles of footpaths through beautiful purple heathland and coastal views along the pretty Dunwich beach on this section. Near Ipswich you'll pass the delightful Pin Mill where you can see lots of little boats in the River Orwell and enjoy refreshments at the 17th century Butt and Oyster pub.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near the start at Felixstowe Ferry you can stop at the Ferry Boat Inn at Felixstowe Ferry. It's a historic pub of some note, dating all the way back to 1465. The interior is full of character and includes low beams and a huge wood burner to keep you warm on those winter days. They do very good food and also have a nice beer garden to sit out in on warmer days. You can find the pub at a postcode of IP11 9RZ for your sat navs. The pub is also dog friendly if you have your canine friend with you. You could stop off at the pretty little village of Dunwich and enjoy some refreshments at the noteworthy Ship Inn. Once a haunt of smugglers, The Ship at Dunwich, is nestled in between Southwold and Aldeburgh. On colder days there's a nice cosy fire indoors, while in the summer there's a nice outdoor area with fruit trees. The pub also does accommodation if you need to stay over. You can find it in the little village on St James's St, with a postoce of IP17 3DT for your sat navs. Snape Maltings has several fine eateries where you can enjoy refreshments on your walk. There's freshly prepared local food and cream teas to cafés overlooking the Alde estuary. In the village of Snape there is the noteworthy Golden Key public house. The pub is a relaxed cottage-style dining pub dating back to the 1600’s, just tucked away from the main road through the beautiful village. It's packed full of original character, beams, open fires and quirky details. You can find it in the village on Priory Road with a postcode of IP17 1SA for your sat navs. The White Hart Inn in Aldeburgh dates back to 1800. It's located in the High Street, right next door to the famous fish and chip shop. During the summer months they have a traditional wood-fired Italian Pizzeria in the beer garden, serving freshly cooked-to-order pizza. It's a nice place to relax outdoors on warmer days. The pub is dog friendly and will often provide treats for your pet. You can find the pub at postcode IP15 5AJ for your sat navs. In the prettty village of Levington a break at the The Ship Inn is highly recommended. It's an historic pub of some note, dating all the way back to the 14th century. The pub sits in a lovely spot, overlooking the Orwell River and next to the 16th century St Peter's Church. There's a charming interior with low ceilings and original beams as well as the warmth from the log burner. There's also pictures of sailing ships on the walls to add to the nautical theme. If the weather is good there's a decent outdoor area to relax in. You can find the picturesque thatched inn on Church Lane with a postcode of IP10 0LQ for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/uN1oE5G4q44",
  "postcode": "IP11 7LU",
  "district": "East Suffolk",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Promenade, Old Felixstowe, Felixstowe, East Suffolk, Suffolk, England, IP11 7LU, United Kingdom",
  "state": "England"
}