{
  "objectID": "0e443749bf53302d0e3b35823d783d1d",
  "created_at": "2024-12-18T15:54:03.296981+00:00",
  "ref": "eston-nab-walking-route",
  "title": "Eston Nab Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Eston_Nab_woods.jpg",
  "nearby": [
    {
      "description": "Roseberry Topping",
      "objectID": "2eeed7806bdbd1d3c4000cd114e5c9b8",
      "ref": "roseberry-topping-walking-route"
    },
    {
      "description": "Cleveland Way",
      "objectID": "9d56c63c556a167d04b175f1b86b24e0",
      "ref": "cleveland-way-walking-route"
    },
    {
      "description": "Flatts Lane Country Park",
      "objectID": "045d78b85d267e85b7c876e5696edd6e",
      "ref": "flatts-lane-country-park-walking-route"
    },
    {
      "description": "Tees Link",
      "objectID": "cca626ffb2c0ed3d6976541ebef87893",
      "ref": "tees-link-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/8A9BD90EC55BE8EB8025809900021309/$FILE/Eston Nab.gpx",
  "_geoloc": {
    "lat": 54.5420845167,
    "lng": -1.1472492479
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Eston_Nab_woods.jpg",
      "title": "By Francish7 (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons",
      "caption": "Eston Nab woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Eston_Nab_below_2011.jpg/512px-Eston_Nab_below_2011.jpg",
      "title": "User:MarcusBritish [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons",
      "caption": "Eston Nab below 2011"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Earthworks%2C_Eston_Nab_-_geograph.org.uk_-_588079.jpg",
      "title": "Stephen McCulloch / Earthworks, Eston Nab",
      "caption": "Earthworks. Ditch forming part of the defences of the Bronze Age encampment at Eston Nab."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Communication_masts_on_Eston_Nab_-_geograph.org.uk_-_1625630.jpg",
      "title": "Philip Barker / Communication masts on Eston Nab",
      "caption": "Communication masts on Eston Nab. This photograph shows some of the communication masts located on the Nab near Lackenby. The picture was taken from the top of Lackenby Bank looking in a southerly direction towards Eston Moor. The trees shown in the background of the picture form part of Wilton Moor Plantations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Trig_point_and_beacon_on_Eston_Nab_-_geograph.org.uk_-_1625618.jpg",
      "title": "Philip Barker / Trig point and beacon on Eston Nab",
      "caption": "Trig point and beacon. This photograph shows the trig point and beacon on the Nab. The picture was taken from the footpath that runs in a north-easterly direction from Eston Moor towards the beacon. The viewing direction was north -looking towards Teesmouth. The North sea can just be seen on the horizon (to the left of the trig point) and the trees on the right-hand side of the horizon form a part of Wilton Moor Plantations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Trig_point%2C_tower_and_Teesmouth_-_geograph.org.uk_-_1625658.jpg",
      "title": "Philip Barker / Trig point, tower and Teesmouth",
      "caption": "Trig point, tower and Teesmouth.  In the distance a part of industrial Teesside can be seen on either side of the River Tees. Teesmouth is visible just to the right of the beacon. The North Sea can be seen in the background of the picture spanning the horizon"
    }
  ],
  "distance_km": 5.0,
  "description": "Climb to Eston Nab and Eston Beacon on this popular walk in North Yorkshire. The hill is located just to the east of Middlesbrough standing at a height of 242 metres (794 ft). From the summit there are splendid views towards the coast and across the North York Moors. The nab is historically significant as it includes Bronze Age burial mounds and an Iron Age hill fort. There is also the Eston Nab monument which dates from the early 19th century. It was built as a look-out post against invasion during the Napoleonic wars. You can start your walk from Flatts Lane Country Park where there is a car park. From here you can pick up the Cleveland Way and follow it past Normanby Moor. Public footpaths then take you across Eston Moor to Eston Beacon and Eston Nab. Take a while to soak in the splendid views of the nearby Roseberry Topping and Urra Moor . From the nab you can descend on the same trail or on other paths running past Eston Bank. There's a variety of habitats to enjoy on this varied walk. You will pass lowland heath, grassland and woodland. Look out for wildife including lapwing, curlew, green woodpecker, linnet and a wide variety of butterflies. To extend your walk you could head south east along the Cleveland Way to Hutton Village and Hutton Lowcross Woods. Just beyond that is Roseberry Common and the splendid Roseberry Topping . It's a similar climb with great views of the Cleveland plain and the Pennines to enjoy.",
  "county": "Redcar and Cleveland",
  "region": "North East",
  "country": "England"
}