{
  "created_at": "2025-01-06T04:59:49.436317+00:00",
  "objectID": "0e9ca17c212bd97239421f81cd18b50d",
  "ref": "two-bridges-dartmoor-walk-walking-route",
  "title": "Two Bridges Dartmoor Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1b/The_old_bridge_at_Two_Bridges_-_geograph.org.uk_-_1226565.jpg",
  "nearby": [
    {
      "description": "Wistman's Wood",
      "objectID": "7a5c41c4147dc159ce9aa56084802569",
      "ref": "wistmans-wood-walking-route"
    },
    {
      "description": "Bellever Forest",
      "objectID": "85077e1b59350bc84ced5819ee7acb87",
      "ref": "bellever-forest-walking-and-cycle-route"
    },
    {
      "description": "Dartmoor Way",
      "objectID": "517935ba149ba09e2129f15985e29886",
      "ref": "dartmoor-way-walking-route"
    },
    {
      "description": "Dartmeet",
      "objectID": "261be4af8d326296957d4bf0490595e4",
      "ref": "dartmeet-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0e9ca17c212bd97239421f81cd18b50d.gpx",
  "_geoloc": {
    "lat": 50.5588009483,
    "lng": -3.9652583048
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/The_old_bridge_at_Two_Bridges_-_geograph.org.uk_-_1226565.jpg",
      "title": "Jonathan Billinger / The old bridge at Two Bridges",
      "caption": "The old bridge at Two Bridges"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Path_to_Wistmans_Wood_-_geograph.org.uk_-_992063.jpg",
      "title": "Guy Wareham / Path to Wistmans Wood",
      "caption": "Path to Wistmans Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Oak_tree_in_Wistman%27s_wood._-_geograph.org.uk_-_567706.jpg",
      "title": "David Ayres / Oak tree in Wistman's wood.",
      "caption": "Oak tree in Wistman's wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Longaford_Tor_-_geograph.org.uk_-_1591462.jpg",
      "title": "Derek Harper / Longaford Tor",
      "caption": "Longaford Tor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Gunpowder_Factory_-_geograph.org.uk_-_827549.jpg",
      "title": "Rick Crowley / Gunpowder Factory",
      "caption": "Powder Mills Gunpowder Factory chimney"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Bellever_Tor%2C_across_the_gap_-_geograph.org.uk_-_740334.jpg",
      "title": "Stephen Craven / Bellever Tor: across the gap",
      "caption": "Bellever Tor, across the gap"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Dunnabridge%2C_farm_entrance_-_geograph.org.uk_-_1466655.jpg",
      "title": "Chris Downer / Dunnabridge: farm entrance",
      "caption": "Dunnabridge, farm entrance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Dartmoor_Way_near_Royal_Mile_-_geograph.org.uk_-_1501666.jpg",
      "title": "Derek Harper / Dartmoor Way near Royal Mile",
      "caption": "Dartmoor Way near Royal Mile"
    }
  ],
  "distance_km": 19.4,
  "description": "This long circular walk explores some of the highlights around the Two Bridges on Dartmoor. On the walk you'll visit Wistman's Wood and enjoy climbs to Bellever Tor and Longaford Tor for great views over the area. The route runs for about 12 miles with some moderate climbs and a section along the Dartmoor Way long distance trail which runs through the area. You start off at the Two Bridges parking area on the West Dart river, at the intersection of the two roads that cross Dartmoor. It's a popular spot for walkers with a number of good trails to follow around a scenic part of the National Park. The walk begins by heading north to Wistman's Wood. The National Nature Reserve consists of a number of stunted oak trees with gnarled, tangled branches. It's an unusal and fascinating area with a variety of rarely seen flora and fauna. After exploring the reserve the walk continues north to Longaford Tor which stands at a height of 507 metres and commands lovely views over the park. From here you descend east past the old Powder Mills factory remains. The remote spot was suitable for the production of gunpowder, about 160 years ago. Today the mill stands in ruins with only a row of cottages still in use. The old school is now used as a pottery shop where you can enjoy cream teas in the courtyard in the Summer season. The route continues east into Bellever Forest. Here you'll find some nice woodland trails with Dartmoor ponies to look out for on the way. The site includes Bellever Tor which stands at a height of 443 metres offering panoramic 360 degree views. As well as the granite tor at the peak there's also several Kists and Cairn Circles on its slopes. The route then descends past Laughter Tor to Dunnabridge Pound Farm before crossing the West Dart River at Sherberton. Here you head west to pick up a section of the Dartmoor Way to take you towards Princetown, enjoying some splendid moorland scenery on the way. The route then turns north to return to Two Bridges and the finish point. To continue your walking in the area head east along the Dartmoor Way to Dartmeet. The popular beauty spot is where the tributaries of the East Dart and West Dart meet.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Two Bridges Hotel is a nice place to go for a Devon Cream Tea after your walk. The luxury hotel is beautifully positioned right on the banks of the West Dart River. Outside there's a lovely outdoor area where you can relax with afternoon tea on warmer days. There's also a nice garden you can stroll around after your food. Inside there's a cozy bar with log fires, and an elegant lounge. You can find the hotel right next to the river and bridge at postcode PL20 6SW. Not far from bridges is the noteworthy Warren House Inn, one of the highest pubs in England. The 19th century inn is one of the most famous on Dartmoor, sitting in an isolated position some 1425ft (434m) above sea level. Originally built to serve the busy local tin mining community, the Inn was always a favourite haunt with miners from the neighbouring Tin Mines, including Golden Dagger, Vitifer and Birch Tor Mines. From the elevated position of the inn there are breathtaking views over the area. Indoors there's a cosy interior with oak beams and open fires. They do great food and are also dog friendly. The Warren House Inn lies at the very centre of Dartmoor between Moretonhampstead and Princetown on the B3212 with a postcode of PL20 6TA.  From Postbridge just follow the B3212 north east from the village and you will soon come to the inn."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and the Two Bridges Hotel mentioned above is also very dog friendly."
    }
  ],
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Trout Cottage, Two Bridges, Dartmoor Forest, West Devon, Devon, England, PL20 6SW, United Kingdom",
  "postcode": "PL20 6SW",
  "district": "West Devon",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "pottery shop",
    "cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}