{
  "created_at": "2025-01-05T22:30:31.525254+00:00",
  "objectID": "0ef7dbe8936cd47120af76f1c111942e",
  "ref": "derwent-reservoir-walking-route",
  "title": "Derwent Reservoir Circular Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/70/Derwent_Reservoir._-_geograph.org.uk_-_54286.jpg",
  "nearby": [
    {
      "description": "Alport Castles",
      "objectID": "70e16df7e630144c37a160e7fb7251f3",
      "ref": "alport-castles-walking-route"
    },
    {
      "description": "Derwent Edge",
      "objectID": "610c6b9952f5ceb41c56e743f6ca8a2d",
      "ref": "derwent-edge-walking-route"
    },
    {
      "description": "Ladybower Reservoir",
      "objectID": "dc9cd529b4225315fc364c4fc05f43f3",
      "ref": "ladybower-reservoir-walking-route"
    },
    {
      "description": "Derwent Dam",
      "objectID": "c84aa24d380169ebc9edab71826f9685",
      "ref": "derwent-dam-walking-route"
    },
    {
      "description": "Howden Reservoir and Margery Hill",
      "objectID": "dc5b71f0a44dd3edba890004e5093d1a",
      "ref": "howden-reservoir-and-margery-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0ef7dbe8936cd47120af76f1c111942e.gpx",
  "_geoloc": {
    "lat": 53.4011990484,
    "lng": -1.7428840708
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Derwent_Reservoir._-_geograph.org.uk_-_54286.jpg",
      "title": "Richard Webb [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bay on the eastern shore with the moors above Birchenlee beyond. The River Derwent flows through Howden Reservoir, Derwent Reservoir, and finally Ladybower Reservoir, providing water to Derbyshire, South Yorkshire, and cities as far as Nottingham and Leicester. During the Industrial Revolution, rapid urbanisation created a significant demand for water, leading to the decision to construct these reservoirs to meet the needs of the growing industrial cities. Construction of the Derwent Dam began in 1902, under the supervision of chief engineer Edward Sandeman, who was also responsible for the nearby Howden Dam. He received the Telford Medal in 1918 for his work on the Derwent Valley Waterworks. The dam’s construction was a mammoth task, requiring stone from the quarries at Bole Hill near Grindleford, which was transported via a specially constructed railway. Over 1,000 workers lived in Birchinlee, a self-contained town known as \"Tin Town,\" which provided housing during the dam’s construction. Some workers who died during the project were buried at Bamford Church. The reservoir began filling in November 1914 and overflowed for the first time in January 1916, marking the beginning of its use as a water source. Despite its impressive capacity of 9.64 million cubic metres, additional water supplies were needed soon after its completion. To address this, the rivers Alport and Ashop were diverted into the reservoir between 1920 and 1931 through tunnels and a Venturi flume, which also helped manage water flow during the construction of Ladybower Reservoir from 1935 to 1945. This network of reservoirs now plays a crucial role in providing water to a large area of Derbyshire, South Yorkshire, and beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Derwent_dam_-_panoramio.jpg/512px-Derwent_dam_-_panoramio.jpg",
      "title": "jondaniel [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Derwent dam. Between 1901 and 1903, a standard-gauge railway of over 7 miles (11 km) was constructed from the village of Bamford to the southern part of the Derwent Reservoir, extending to Howden, to facilitate the transportation of vast quantities of stone required for the construction of both Howden and Derwent dams. The quarry at Bole Hill, located near Grindleford, supplied much of this stone. Remnants of this railway can still be found along the Derwent Reservoir, particularly near the western end of Ladybower Dam, where 1.5 miles (2.4 km) of the cutting and trackway, now known locally as 'The Route', remain visible. The present road between the Howden and Derwent dams was built over the old railway line, further highlighting the railway's integral role in the region's infrastructure development. After providing over one million tons of stone, Bole Hill Quarry was closed in September 1914, shortly followed by the closure of the railway. The line was briefly reinstated between Hope and Yorkshire Bridge in 1935 to aid the construction of Ladybower Dam, but it was closed again in 1946 following the dam's completion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Derwent_island_dam%28large%29.jpg/512px-Derwent_island_dam%28large%29.jpg",
      "title": "User:Espresso Addict [CC BY-SA 2.5 (https://creativecommons.org/licenses/by-sa/2.5)], via Wikimedia Commons",
      "caption": "Derwent Reservoir, showing the island and the western tower of Howden Dam. Most of the land surrounding the reservoir is owned by Severn Trent Water, with roughly half of it being woodland. The woods are mainly made up of coniferous trees such as larch, pine, and spruce, while the remaining third comprises primarily sycamore, beech, and oak. The hills of the Peak District are used as sheep pasture, with grazing rights leased to local farmers. The moorlands and gritstone edges are traversed by footpaths, which remain open throughout the year, except during certain shooting seasons. A stone memorial to Tip, a sheepdog, can be found on the reservoir’s bank. Tip stayed with the body of local shepherd Joseph Tagg for 105 days after he passed away on Howden Moor during the winter of 1953-54. Tip was awarded the Bronze Medal by the Canine Defence League."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Derwent_walkers.jpg/512px-Derwent_walkers.jpg",
      "title": "The original uploader was Espresso Addict at English Wikipedia. [CC BY-SA 2.5 (https://creativecommons.org/licenses/by-sa/2.5)], via Wikimedia Commons",
      "caption": "Walkers on Little Howden Moor, above Derwent Reservoir. During the Second World War, the reservoir was used by pilots of 617 Squadron to practise the low-level flights required for Operation Chastise, commonly known as the \"Dam Busters\" raids, due to its resemblance to the German dams. Today, a commemorative plaque dedicated to 617 Squadron can be found on the dam, and one of the towers once housed the Derwent Valley Museum. The museum, now closed, was owned and operated by the late Vic Hallam and featured exhibitions on 617 Squadron and their training for Operation Chastise. It also included displays on the history of the Derwent Valley and the lost villages of Derwent and Ashopton. Occasional flypasts by the Battle of Britain Memorial Flight are held at the reservoir to honour the wartime events. In September 2014, a special flypast took place featuring the only two remaining airworthy Lancaster bombers, one from the Battle of Britain Memorial Flight and one from Canada, flying in formation for three passes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Footbridge_in_Derwent_village_-_geograph.org.uk_-_5961242.jpg?20231219202810",
      "title": "Footbridge in Derwent village by Graham Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footbridge in Derwent village. The former village was submerged in 1944 with the construction of the Ladybower Reservoir, along with the villages of Ashopton, Derwent Woodlands Church, and Derwent Hall. The reservoir was built to increase water supply for the cities of the East Midlands and South Yorkshire. By autumn 1943, all buildings in Derwent had been demolished, and by the end of 1944, the reservoir’s waters had started to rise. One notable structure from the village, a 17th-century packhorse bridge, was preserved due to a preservation order. The bridge was relocated to Slippery Stones at the head of the Howden Reservoir and remains part of the footpaths and cycle tracks in the area. This bridge is one of the few surviving elements of the original village and is now a scheduled monument. The village's Derwent Church held its last service on 17 March 1943, and its bell was later reinstalled in St Philip's Church in Chaddesden. Additionally, stained glass from the church, designed by Charles Eamer Kempe, was saved and placed in St Michael and All Angels' Church in Hathersage. The church spire, initially kept as a memorial, was demolished in 1947 for safety reasons. Though the village itself is gone, remnants occasionally resurface when water levels in the reservoir are low, offering a glimpse into its past."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Inlet_on_west_bank_of_Derwent_Reservoir_-_geograph.org.uk_-_185877.jpg",
      "title": "Espresso Addict / Inlet on west bank of Derwent Reservoir, via Wikimedia Commons",
      "caption": "Inlet on west bank of Derwent Reservoir. Fed by several streams this is the most prominent inlet in Derwent Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Derwent_Village_Uncovered_-_geograph.org.uk_-_178743.jpg",
      "title": "Tim Hallam / Derwent Village Uncovered, via Wikimedia Commons",
      "caption": "Derwent Village Uncovered in 1995. On this picture, you can see the outline of the River very clearly and behind that is the site of Derwent Hall.The site of Derwent village has been revealed several times when water levels in Ladybower Reservoir fell dramatically during dry spells. Notable years when the submerged village resurfaced include 1976, 1989, 1995, 2003, 2018, and 2022. In 2018, the visible ruins attracted unprecedented crowds, leading to some unfortunate incidents. On 3 November 2018, a man had to be rescued by a mountain rescue team after getting stuck in the thick mud around the ruins. Additionally, on 17 November 2018, vandalism was reported at the site, with graffiti scrawled on buildings and visitors attempting to remove items. Although most of the village was submerged, a few houses, the village hall, and several farms remain above the waterline. The civil parish of Derwent still exists, with a small population recorded in the 2001 and 2011 censuses. The most significant surviving reminder of Derwent is the 17th-century packhorse bridge, which was moved to Slippery Stones at the head of Howden Reservoir. The bridge has become a key feature of the paths and cycle tracks around the Derwent Valley reservoirs. The Derwent Valley Museum, formerly located on the reservoir dam, documented the history of Derwent and RAF Squadron 617's Operation Chastise (\"The Dam Busters\"), although it is no longer operational. There is no formal memorial to the drowned villages, but Birchinlee, the temporary village built to house workers constructing the higher Derwent and Howden Reservoirs, is marked by a plaque. Derwent's War Memorial stands above Ladybower Reservoir, serving as the only marker of the village’s original location."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Island_in_Derwent_Reservoir%2C_with_Howden_Dam_behind_-_geograph.org.uk_-_185879.jpg",
      "title": "Espresso Addict / Island in Derwent Reservoir, with Howden Dam behind, via Wikimedia Commons",
      "caption": "Island in Derwent Reservoir, with Howden Dam behind. The northern end of Derwent Reservoir, showing the small island and the western tower of Howden Dam behind. Water can be seen cascading over the dam (right of tower). To the right, on the skyline, rises a minor peak on Howden Moor. View from the footpath along the reservoir's east bank, on a blazingly hot June afternoon"
    }
  ],
  "distance_km": 6.5,
  "description": "This is a moderate circular walk along Derwent and Ladybower Reservoirs, with a short climb to the woodland, farmland and moorland above the water. From the high points there are wonderful views of the Derwent Valley and the surrounding Peak District hills. You'll also pass the old Derwent Village where two buildings remain, the Lodge and the schoolroom. An information panel tells you about the history of the village including how it was flooded when the Dam was built in the Second World War. Scroll down for photos, more information and an interesting video on this historic site. On your walk look out for wildlife including various birds of prey, mountain hares, golden plovers and pipistrelle bats. The walk starts at the Fairholmes car park, where you'll find an excellent visitor centre and cafe. You then head to Derwent Dam where you pick up a waterside path along Derwent Reservoir's eastern side. Derwent Dam and the adjacent Howden Dam, were built at the beginning of the century and became famous for being used for RAF flying practice for the Barnes Wallis bouncing bomb in 1943 and then later in the Second World War film, Dambusters. The walk heads through the woods of Hancock Wood, before climbing to Walker's Clough. You then cross the moorland above the reservoir with some truly wonderful views to enjoy. The route then descends to Ladybower Reservoir, where you pass along the water before returning to the car park. If you would like to extend your walk then you could climb even higher to the wonderful Derwent Edge. The Millstone Grit escarpment reaches a height of over 1700ft at Back Tor with more great views to enjoy. Geology enthusiasts can climb to Alport Castles on the western side of the water. You can start the walk from Fairholmes and climb to the spectacular rock formations via Howden Reservoir. The waterside walk along Ladybower Reservoir is also nearby.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the Ladybower Inn for refreshments. This traditional stone-built pub dates back to the 18th century when it served as a Coaching Inn. There's also a nice beer garden with views over the Ladybower reservoir. The pub is located on The Snake Pass, at the eastern end of the lower Ladybower reservoir. Postcode is S33 0AX. The Fairholmes Visitor Centre at the start of the route also has a refreshment kiosk with nice picnic tables outside. Inside there's a wealth of information on the area including interactive exhibitions for all ages."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir and the surrounding woods are a great place for a dog walk and you will probably see plenty of other owners on your outing. During the summer months it is advised to keep them on leads because of the nesting wildlife."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nqKpzhEjFtk",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hope Woodlands, High Peak, Derbyshire, East Midlands, England, S33 0AQ, United Kingdom",
  "postcode": "S33 0AQ",
  "district": "High Peak",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland",
    "waterfront"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "visitor center",
    "cafe",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}