{
  "created_at": "2025-01-06T02:53:02.039870+00:00",
  "objectID": "0f0c1f783e1f5b696b30ecb53e4ae7ac",
  "ref": "bridestones-walking-route",
  "title": "Bridestones Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Low_Bridestones_-_geograph.org.uk_-_862590.jpg",
  "nearby": [
    {
      "description": "Tabular Hills Walk",
      "objectID": "164ff337d1103761aae50fca51222fc4",
      "ref": "tabular-hills-walk-walking-route"
    },
    {
      "description": "Hole of Horcum",
      "objectID": "2f836d52cfc5a59ce322d77f15081604",
      "ref": "hole-of-horcum-walking-route"
    },
    {
      "description": "Dalby Forest",
      "objectID": "444fb3d84019bfb0cf1d3bee105c7dda",
      "ref": "dalby-forest-walking-and-cycle-route"
    },
    {
      "description": "Langdale Forest",
      "objectID": "05d11b2989b2f0552804aa1efb254331",
      "ref": "langdale-forest-walking-and-cycle-route"
    },
    {
      "description": "Blakey Topping",
      "objectID": "46c514b188876f686ffe2812c5dbbf0c",
      "ref": "blakey-topping-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0f0c1f783e1f5b696b30ecb53e4ae7ac.gpx",
  "_geoloc": {
    "lat": 54.302321236,
    "lng": -0.6517257619
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Low_Bridestones_-_geograph.org.uk_-_862590.jpg",
      "title": "Gordon Hatton / Low Bridestones, via Wikimedia Commons",
      "caption": "Low Bridestones. A series of wind eroded sandstone rocks perched along the edge of Bridestone Griff and Dinsdale Griff on National Trust land."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Bridestones_Todmorden_-_geograph.org.uk_-_55961.jpg",
      "title": "Andrew / Bridestones Todmorden, via Wikimedia Commons",
      "caption": "Bridestones Todmorden. A good example of free face retreat. Which has produced these fine specimens of gritstone tors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/The_Pepperpot_on_Bridestones_Moor_-_geograph.org.uk_-_1514208.jpg",
      "title": "David Hillas / The Pepperpot on Bridestones Moor, via Wikimedia Commons",
      "caption": "The Pepperpot on Bridestones Moor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Bridestones_Moor_-_geograph.org.uk_-_1106670.jpg",
      "title": "Kevin Rushton / Bridestones Moor, via Wikimedia Commons",
      "caption": "Bridestones Moor. Triangulation Pillar No S4501.The moor is most famous for its peculiar shaped rock formations formed under the sea 150 million years ago"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/The_High_Bridestones%2C_Sleights_Moor_-_geograph.org.uk_-_537678.jpg",
      "title": "Jim Champion / The High Bridestones, Sleights Moor, via Wikimedia Commons",
      "caption": "The High Bridestones, Sleights Moor. On the left is the tallest of the intact standing stones at the High Bridestones site on Sleights Moor. There are several fallen megaliths nearby, and others scattered around the area. A little further to the north-west is another set of standing stones known as the Low Bridestones. There are some more famous High and Low Bridestones elsewhere in the North York Moors national park, in gridsquare SE8791 - however those Bridestones are natural rock formations. The locally popular name of \"Bridestones\" may come from the Norse for being on the brink (edge). There are local legends that explain the stones as petrified bridal parties lost in the mists that hang on the moors. For some reason other visitors have felt the need to hammer coins into the natural cracks in the tallest standing stone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Low_Bridestones_-_geograph.org.uk_-_1602125.jpg",
      "title": "Hugh Chappell / Low Bridestones, via Wikimedia Commons",
      "caption": "Low Bridestones.The most southerly of the Low Bridestones - A National Trust property."
    }
  ],
  "distance_km": 3.0,
  "description": "Visit these fascinating sandstone sculptures on this splendid walk in Dalby Forest. The geologically significant area dates back to the Jurassic period 150 million years ago. The Bridestones is a nature reserve with good footpaths taking you around the rocks to woodland and meadows with fabulous views from the reserve's elevated position. The area is run by the National Trust so there is a car park off Dalby Forest Drive near Staindale Lake and Adderstone Wood. From here you can pick up the walking trails taking you up to the stones. It's great in the summer with lots of wildflowers, heather, butterflies and birds to look out for. There are good options for extending your walk. You can pick up the footpath along the Staindale Beck or around Staindale Lake. The wider area of Dalby Forest has several different cycling and walking trails to try. A couple of miles to the west is the wonderful natural amphitheatre of the Hole of Horcum. There's more good trails to follow here through moorland and woodland. Langdale Forest is also just to the east. The Tabular Hills Walk long distance trail also runs past the site. You can follow it Dalby Forest and the Hole of Horcum.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "If you head about a mile east from the car park you will come to the village of Lockton. Here you'll find the Loft Tea Rooms and Gallery. These delightful tea rooms are the ideal place to enjoy a cream tea after your walk. It's an Idyllic setting with the tea rooms surrounded by pretty gardens and attractive North York Moors countryside. The site includes a lovely gallery which showcases the work of local artists who have painted the beautiful surroundings. There's also Tag’s Bistro which offers a varied range of dining options and an evening menu. You can find the cafe in the village on Hudgin Lane with a postcode of YO18 7QA for you sat navs. In the village there's also a Youth Hostel and several holiday cottages if you need accommodation. Also nearby is the village of Levisham where you'll find the 19th century Horseshoe Inn. It's in a lovely spot in the pretty village and includes a nice outdoor seating area if the weather is fine. The pub was featured in an article for The Telegraph's 'The 30 best winter pubs in Britain, for dog-lovers, walkers, foodies and more'. There's a good menu and a warm welcome at the this traditional country pub. You can find the pub at postcode YO18 7NL. They also have a sister pub in Lockton called the Fox and Rabbit. There's another splendid outdoor area with fine views of the countryside here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a fine dog walk so you'll probably see other owners on a fine weekend day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north from the site and you can visit High Bridestones on Sleights Moor near Grosmont. There's several fallen megaliths and lovely heather moorland to see here. The moor is located on the Coast to Coast Walk about 2 miles east of Grosmont. The stones date from the Bronze Age with some still standing today. Skelton Tower is located on the western side of Levisham Moor about 2 miles to the north west of the stones. The tower dates from 1830 and sits perched high above the moor in a dramatic and picturesque spot. There are great views over Goathland Moor and the steam trains of the North York Moors Railway below. It's a great spot to take some stunning photos. Just to the north there's the climb to the ancient standing stones and fine viewpoint at Blakey Topping. This circular walk starts from the Crosscliff car park and viewpoint at the northern end of Dalby Forest. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8cP_u9OVNbg",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}