{
  "objectID": "0f3f43075cc7ab0391b5c83fb0051737",
  "created_at": "2024-12-18T07:39:05.187422+00:00",
  "ref": "yarm-walking-route",
  "title": "Yarm Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/62/Yarm_Viaduct.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/EF0A6BAB77AA9F25802583E00035D385/$FILE/Yarm.gpx",
  "_geoloc": {
    "lat": 54.5123430524,
    "lng": -1.3554236929
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Yarm_Viaduct.jpg",
      "title": "Andrew Duffell at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Yarm Viaduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/River_Tees%2C_Yarm_-_geograph.org.uk_-_12900.jpg",
      "title": "Mick Garratt / River Tees, Yarm, via Wikimedia Commons",
      "caption": "River Tees, Yarm. Taken from Yarm Bridge looking downstream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/River_Tees_below_Preston_Park%2C_Eaglescliffe_-_geograph.org.uk_-_1429507.jpg",
      "title": "Paul Buckingham / River Tees below Preston Park, Eaglescliffe, via Wikimedia Commons",
      "caption": "River Tees below Preston Park, Eaglescliffe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/River_Tees%2C_Preston_Park_-_geograph.org.uk_-_58907.jpg",
      "title": "Mick Garratt / River Tees, Preston Park, via Wikimedia Commons",
      "caption": "Looking north east across the Tees from Preston Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Victoria_Bridge%2C_Stockton-on-Tees_-_geograph.org.uk_-_258094.jpg",
      "title": "Mick Garratt / Victoria Bridge, Stockton-on-Tees, via Wikimedia Commons",
      "caption": "Victoria Bridge, Stockton-on-Tees"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Tees_Barrage_-_Hydraulics.jpg/512px-Tees_Barrage_-_Hydraulics.jpg",
      "title": "John Yeadon [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Tees Barrage"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Yarm_Castle_-_geograph.org.uk_-_195929.jpg",
      "title": "Alistair Campbell / Yarm Castle",
      "caption": "Yarm Castle. Go to the back of the High Street,into West Street and look in the area opposite the end of the Churchyard. The 'castle' is somewhat bijou, being only about 3 feet high, but has been there a long time, at least the 28 years I've known it for..."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/St_Mary_Magdalene_Parish_Church_-_geograph.org.uk_-_1286134.jpg",
      "title": "Mick Garratt / St Mary Magdalene Parish Church",
      "caption": "St Mary Magdalene Parish Church. The present church building is the third to stand on this site. The first church to be built here was Saxon. This would have been built of wood, so no traces of it remain. In a way all the material evidence of its existence is a piece of inscribed stone which was found in Yarm in 1877 by Canon Greenwell of Durham, and was being used as a mangle weight."
    }
  ],
  "distance_km": 13.0,
  "description": "This small North Yorkshire town is nicely positioned for pleasant waterside walking along the River Tees. This walk takes you along the Teesdale Way from the town to the Tees Barrage in Stockton on Tees . The route runs for a distance of just over 8 miles along a nice flat riverside path. The walk starts on the Yarm Bridge over the river, in North Yarm. On the northern side of the bridge you can pick up the waymarked Teesdale Way and follow it east past Egglescliffe and Eaglescliffe to Preston-on-Tees. Here you can visit the lovely Butterfly World with its tropical rainforest hothouse and reptiles. The route continues north through Stockton, passing the Victoria Bridge before arriving at the impressive Tees Barrage. The barrage is used to control the flow of the river, preventing flooding and the effects of tidal change. It's flanked by two lovely nature reserves on either side of the river. There's more nice trails to be found here with lots of interesting flora and fauna to look out for. At the end of your walk you can catch either a bus or train back to Yarm or return in foot if you prefer. To continue your riverside walking in Yarm you could head west along the Teesdale Way to visit Low Worsall and Middleton One Row. Also near the town you will find Coatham Woods where there are miles of nice woodland trails to try. In the town you can also enjoy a stroll through The Rookery. This public area by the River Tees is situated at the bottom of Goose Pasture. The ash, sycamore and lime woodland is about 200 years old and owned by Yarm Town Council. In 2002, a walkway was constructed around the wood to celebrate the Golden Jubilee of Queen Elizabeth II.",
  "video_url": "https://www.youtube.com/embed/9FvjiGeMuLM",
  "postcode": "TS16 0JF",
  "district": "Egglescliffe",
  "county": "Stockton-on-Tees",
  "region": "North East",
  "country": "England"
}