{
  "created_at": "2025-01-05T23:49:14.513497+00:00",
  "objectID": "0fa984d0e009084988d4f7562ebc06ea",
  "ref": "helmsley-to-rievaulx-abbey-walking-route",
  "title": "Helmsley to Rievaulx Abbey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/44/Rievaulx_Abbey_-_geograph.org.uk_-_840946.jpg",
  "nearby": [
    {
      "description": "Nunnington and the River Rye",
      "objectID": "ef39243554f7afcab7f3cedf16d9f86a",
      "ref": "nunnington-and-the-river-rye-walking-route"
    },
    {
      "description": "Cleveland Way",
      "objectID": "9d56c63c556a167d04b175f1b86b24e0",
      "ref": "cleveland-way-walking-route"
    },
    {
      "description": "Duncombe Park",
      "objectID": "927ecf6abc292b780f024e877655d0c1",
      "ref": "duncombe-park-walking-route"
    },
    {
      "description": "Hambleton Hills",
      "objectID": "ca9fb2465435f03106946d42ab42ebba",
      "ref": "hambleton-hills-walking-route"
    },
    {
      "description": "Helmsley Circular Walk",
      "objectID": "173327e988cd0f921a76604963ea3042",
      "ref": "helmsley-circular-walk-walking-route"
    },
    {
      "description": "Sutton Bank and the Kilburn White Horse",
      "objectID": "bf3ea0255e6bc853b03708e82e87f2ca",
      "ref": "sutton-bank-and-the-kilburn-white-horse-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0fa984d0e009084988d4f7562ebc06ea.gpx",
  "_geoloc": {
    "lat": 54.2455342579,
    "lng": -1.061836307
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Rievaulx_Abbey_-_geograph.org.uk_-_840946.jpg",
      "title": "Peter Church / Rievaulx Abbey, via Wikimedia Commons",
      "caption": "Rievaulx Abbey. This view along the nave (southeast) is towards the transept, and is in the part that travellers would use. Access beyond the transept was reserved for the Cistercian monks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Rievaulx_Abbey_-_geograph.org.uk_-_1334289.jpg",
      "title": "Peter Church / Rievaulx Abbey, via Wikimedia Commons",
      "caption": "Rievaulx Abbey. This view is due south, the abbey being built to make best use of the land, rather than in the traditional east-west orientation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Tuscan_Temple%2C_Rievaulx_Terrace_-_geograph.org.uk_-_574292.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Tuscan Temple, Rievaulx Terrace. Columned rotundas of this kind are traced back to a classical building near Rome - the Temple of Vesta at Tivoli."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/The_Ionic_Temple_-_Rievaulx_Terrace_-_geograph.org.uk_-_1610485.jpg",
      "title": "Hugh Chappell / The Ionic Temple - Rievaulx Terrace, via Wikimedia Commons",
      "caption": "The Ionic Temple - Rievaulx Terrace A folly created by Thomas Dunscombe in 1758 AD"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Helmsley_Castle_-_geograph.org.uk_-_936309.jpg",
      "title": "Nigel Catterall / Helmsley Castle, via Wikimedia Commons",
      "caption": "Helmsley Castle taken from Helmsley Walled Garden. The Walled Garden was originally built to supply the Duncombe estate with fruit, vegetables and cut flowers. It was abandoned in the 1970s until, in 1994 extensive restoration was started to bring it back to life as a fully working kitchen garden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Rievaulx_Bridge_-_geograph.org.uk_-_574296.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The bridge carries the road over the River Rye."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/River_Rye_near_Rievaulx_-_geograph.org.uk_-_575968.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Rye near Rievaulx"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Rievaulx_Bridge_Cottage_-_geograph.org.uk_-_515438.jpg",
      "title": "Scott Rimmer [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Rievaulx Bridge Cottage. Seen walking west along the Cleveland Way as you go over Rievaulx Bridge near the river Rye."
    }
  ],
  "distance_km": 6.0,
  "description": "This is a popular walk which takes you from the medieval Helmsley Castle to the fascinating ruins of Rievaulx Abbey. It makes use of the Cleveland Way National Trail takes place on a good, waymarked footpath. The walk runs for about 4 miles on an undulating path with some moderate climbs. As such a reasonable level of fitness is required. The walk starts at Helmsley Castle and heads west passing Duncombe Park with its spectacular landscape garden, the National Centre for Birds of Prey, and the surrounding parkland all open to the public. The walk continues through woodland to Griff Farm before a lovely waterside section along the River Rye takes you to Rievaulx Abbey. You can explore the ruins of the former Cistercian abbey before continuing to the beautiful Rievaulx Terrace. These 18th-century landscape gardens contain woodland, grass banks, wildflower meadows and two temples. The terrace is perched high above the abbey so there are stunning views down to the ruins. If you'd like to extend your walk then you could continue west along the Cleveland Way to the Hambleton Hills or explore the wonderful parkland and gardens of Duncombe Park. For a longer walk to the abbey try the Helmsley Circular Walk which explores more of the lovely Rye Dale scenery. A few miles south east of Helmsley you will find the 17th century manor house of Nunnington Hall. Here you can try the Nunnington and the River Rye Walk which explores the countryside surrounding the hall.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The abbey has a nice on site cafe where you can buy a range of snacks after your walk. If you have time and don't mind travelling a little way then you could head to Oldstead for a special dining experience at the noteworthy Black Swan. This fine restaurant has a Michelin Star and was awarded The Best Restaurant in the UK 2018 by The Food and Travel Magazine and the ‘Best Fine Dining Restaurant in the World’ by TripAdvisor, in 2017. The inn is housed in a fine looking 16th-century building with a nice garden area outside. They also do high quality accommodation if you need to stay over. You can find the inn a few miles south west of the abbey at Oldstead with a postcode of YO61 4BL for your sat navs. Near the inn there's also an opportunity to visit Sutton Bank and the Kilburn White Horse. This is another major highlight of the area with its fabulous viewpoint and woodland trails."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs on leads are allowed in the grounds of the abbey, they're just not allowed inside the cafe or the museum. You can sit outside at the cafe where water bowls are provided as well."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east from the town and you will come to the neighbouring market town of Kirkbymoorside. The town is well known for its Wednesday market which dates all the way back to the 13th century. In the town you'll also find cobbled streets, interesting old cottages and a Saxon church. The Kirkbymoorside Walk visits the nearby village of Gillamoor where you can enjoy fine views over Farndale from 'Suprise View'. Rievaulx is part of the collection of Cistercian abbeys in North Yorkshire. You could continue your historic walking at Jervaulx Abbey and Fountains Abbey. There's splendid trails around these ruined sites that also suffered during the Dissolution. There's also Rosedale Abbey in the North York Moors although this was really just a small Cistercian nunnery, of which only a stone turret or belfry remains in the village churchyard. Just to the north of the abbey you can visit the village of Hawnby and enjoy a climb to the splendid viewpoint at Hawnby Hill."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Cyox-r6pzWM",
  "postcode": "YO62 5DR",
  "district": "Helmsley",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Castlegate, Helmsley, North Yorkshire, York and North Yorkshire, England, YO62 5DR, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grass",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "parkland",
    "views"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}