{
  "created_at": "2025-01-06T10:28:38.511827+00:00",
  "objectID": "0fc911062a3b5906d5e12c9d5df70c2c",
  "ref": "puddletown-forest-walking-and-cycle-route",
  "title": "Puddletown Forest Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Bridleway%2C_Puddletown_Forest_-_geograph.org.uk_-_1180935.jpg",
  "nearby": [
    {
      "description": "Thorncombe Woods",
      "objectID": "35435738dacc9c9a2aa33b63f21bf5d4",
      "ref": "thorncombe-woods-walking-route"
    },
    {
      "description": "Athelhampton House",
      "objectID": "ce060ad0ec71aecb6521cced6093543b",
      "ref": "athelhampton-house-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0fc911062a3b5906d5e12c9d5df70c2c.gpx",
  "_geoloc": {
    "lat": 50.7409812733,
    "lng": -2.3646249138
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Bridleway%2C_Puddletown_Forest_-_geograph.org.uk_-_1180935.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridleway, Puddletown Forest. The surfaced path takes riders and walkers to Green Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Roman_Road%2C_Puddletown_Forest_-_geograph.org.uk_-_786479.jpg",
      "title": "Nigel Mykura / Roman Road, Puddletown Forest",
      "caption": "Roman Road in the forest. This is the view WNW along the line of the Roman Road from Badbury to Dorchester as it approaches Bhompston Heath. Because of the steepness of the climb the road makes a sharp dog leg to lessen the gradient as it climbs onto the heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Two_Droves%2C_Puddletown_Forest_-_geograph.org.uk_-_1180926.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Two Droves. The sign at the beginning of the road indicates this is unsuitable for motor vehicles. The track takes you from Beacon Corner to Troy Town junction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Track_in_Puddletown_Forest_-_geograph.org.uk_-_645529.jpg",
      "title": "Jim Champion / Track in Puddletown Forest",
      "caption": "This bridleway track is approaching a junction on Green Hill in the forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Rhododendron_Clearance%2C_Puddletown_Forest_-_geograph.org.uk_-_1117016.jpg",
      "title": "Nigel Mykura / Rhododendron Clearance, Puddletown Forest",
      "caption": "Rhododendron Clearance. A wide swathe of ground has recently been cleared of scrub and rhododendrons by the Forestry Commission between the forest on the left and the adjacent road on the right. The stretch of road known as Rhododendron Mile is just behind the bushes on the right and a 20m strip of the flowering bushes has been left along the road to maintain this tourist attraction. This clearance will prevent the spread of the rhododendrons into the forest where it would choke the ground cover."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Puddletown%2C_Dorset_-_geograph.org.uk_-_881467.jpg",
      "title": "Nigel Mykura / Puddletown, Dorset",
      "caption": "Puddletown village house. The entrance gates to this large private house are located at the junction of The Square and The Green just opposite the church. This is the view north up the drive."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/The_Blue_Vinny_Inn%2C_Puddletown_-_geograph.org.uk_-_1177807.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View of the Blue Vinny pub in the village of Puddletown. A fine place for some refreshments after your exercise."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_Square%2C_Puddletown_-_geograph.org.uk_-_881465.jpg",
      "title": "Nigel Mykura / The Square, Puddletown",
      "caption": "The Square, in Puddletown village. Looking east from Mill St towards the Church. This interesting house has an unusual bay window supported on columns."
    }
  ],
  "distance_km": 6.0,
  "description": "This large area of woodland near Dorchester has miles of footpaths and mountain bike trails. There are a number of easy walking trails and some more challenging climbs to Green Hill and Beacon Hill. If you are on a moutain bike you can enjoy miles of bridleways, short natural singletracks, downhill sections and some jumps. The forest is located just to the west of the village of Puddletown and the River Piddle. It is a nice walk to do if you are visiting Thomas Hardy's cottage which is located on the western fringe of the forest. If you would like to continue your walking in the area then you could try our Thorncombe Woods Walk. This visits the pretty Rushy Pond and Duddle Heath where there are fine views over the open countryside surrounding the forest. You could also visit the nearby Athelhampton House. Here you can explore the beautiful parkland and gardens surrounding the 15th century Athelhampton House. National Cycle Network Route 2 runs just to the south of the forest.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk you could head into the little village of Puddletown, located just to the north east of the forest. Here you'll find the Blue Vinny pub, named after the local Dorset cheese. It's a fine place serving decent Mediterranean food with a lovely garden area to relax in on warmer days. You can find them at 12 The Moor with a postcode of DT2 8TE for your sat navs. You can also enjoy a stroll around the pretty village where you'll find thatched cottages and a noteworthy church. The historic church of St Mary dates to the Norman period, though much of the building we can see today a result of rebuilding in the 15th century. Inside there's a splendid 12th century font which is well worth seeing if you have time."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails in the forest are ideal for dog walking. The Blue Vinny pub mentioned above is also dog friendly with a separate dining area for dogs and water bowls provided."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The National Trust's Thomas Hardy's Cottage is well worth a visit after your exercise. The famous author was born in the cottage in 1840 and wrote novels including 'Under the Greenwood Tree' and 'Far from the Madding Crowd' here. You can explore the quaint little cottage and learn about his life here. Outside there's an idyllic country garden to explore as well. You can find it on the western side of the woods at Higher Bockhampton with a postcode of DT2 8QJ for your sat navs. Just to the south west of the woods you'll find the county town of Dorchester where there are some riverside trails along the River Frome. The Dorchester Walk starts at the train station in the town and visits the Frome Watermeadows around Stinsford before heading to the woods and the cottage. Near Dorchester you could enjoy a climb to Maiden Castle. There are splendid views over the area from the top of this elevated Iron Age hill fort. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/r6nV-jW4Pks",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Tolpuddle Hollow, Troy Town, Athelhampton and Puddletown, Puddletown, Dorset, England, DT2 8QG, United Kingdom",
  "postcode": "DT2 8QG",
  "district": "Puddletown",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "countryside"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}