{
  "objectID": "0fe72d5f3607ffa7138b22629754e9f1",
  "created_at": "2024-12-18T11:48:07.048728+00:00",
  "ref": "fairford-walking-route",
  "title": "Fairford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Fishing_River_Coln_Fairford.jpg/256px-Fishing_River_Coln_Fairford.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0fe72d5f3607ffa7138b22629754e9f1.gpx",
  "_geoloc": {
    "lat": 51.7073732926,
    "lng": -1.7814247369
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Fishing_River_Coln_Fairford.jpg/256px-Fishing_River_Coln_Fairford.jpg",
      "title": "Saffron Blaze [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The River Coln as it passes through Fairford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Holiday_homes%2C_Cotswold_Water_Park_-_geograph.org.uk_-_1517906.jpg",
      "title": "Brian Robert Marshall / Holiday homes, Cotswold Water Park, via Wikimedia Commons",
      "caption": "Holiday homes, Cotswold Water Park. These attractive properties are part of the 'Watermark' development of lakeside holiday or second homes. The ones I've seen for sale are all so described from which I infer that there may be a covenant or planning condition that precludes their being used as full-time residences. They are also described as being 'New England' style."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Ski_School_at_Cotswold_Water_Park_-_geograph.org.uk_-_22508.jpg",
      "title": "Pam Brophy / Ski School at Cotswold Water Park, via Wikimedia Commons",
      "caption": "Ski School at Cotswold Water Park. This is the Fairford Lechlade section of the waterpark- in the south western corner of the square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Halfpenny_Bridge%2C_Lechlade.jpg",
      "title": "Martin Clark [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Halfpenny Bridge, Lechlade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Entrance_to_gravel_pits_-_geograph.org.uk_-_304995.jpg",
      "title": "Jonathan Billinger / Entrance to gravel pits, via Wikimedia Commons",
      "caption": "Entrance to gravel pits. The gravel extraction around Lechlade and Fairford over the years has resulted in many flooded lakes which now comprise the Cotswold Water Park. This scene is north of the river Coln, one of the headstreams of the Thames, and is well into Gloucestershire, not Swindon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/River_Thames_at_Lechlade_%2843646417745%29.jpg/512px-River_Thames_at_Lechlade_%2843646417745%29.jpg",
      "title": "Hugh Llewelyn from Keynsham, UK [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Thames at Lechlade"
    }
  ],
  "distance_km": 17.0,
  "description": "The Gloucestershire town of Fairford is ideally located for exploring the Cotswolds Hills on foot. This walk takes you through the Cotswold Water Park before visiting the nearby town of Lechlade where you can enjoy riverside footpaths along the Thames Path. The walk starts in the town where you can pick up footpaths heading south east to the series of lakes. After passing along Warren's Cross Lake you will come to Lechlade which is a nice place to stop for refreshments. You can also enjoy a nice stroll along the River Thames to the point where it meets with the River Coln. The route then returns through the water park to Fairford, with a nice section along the River Coln to finish. This route takes you through the eastern section of the park but the huge park also has a western section to explore. It is located between Swindon and Cirencester with more details and a map shown on our Cotswold Water Park Walk and Cycle Route. In Lechlade you can also pick up the Cotswold Canals long distance trail and enjoy more easy, waterside walking. Buscot Park is also located nearby and has some lovely footpaths to follow around the grounds.",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England"
}