{
  "created_at": "2025-01-06T02:38:22.245059+00:00",
  "objectID": "0fef657b2c57fabfd5d3980ac08de5de",
  "ref": "woodbury-common-devon-walking-and-cycle-route",
  "title": "Woodbury Common Devon Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Woodbury_Common_-_geograph.org.uk_-_956364.jpg",
  "nearby": [
    {
      "description": "Aylesbeare Common",
      "objectID": "f008f079e8b45f0ba706a1e47272e190",
      "ref": "aylesbeare-common-walking-route"
    },
    {
      "description": "River Otter and the Otter Estuary",
      "objectID": "8d0bedf5a02770192ed1d5b1344cdf3f",
      "ref": "river-otter-and-the-otter-estuary-walking-route"
    },
    {
      "description": "East Devon Way",
      "objectID": "82f4c21d16ec6bf29baad4d914db7060",
      "ref": "east-devon-way-walking-route"
    },
    {
      "description": "Bystock Pools Nature Reserve",
      "objectID": "b3c366032c150f3fb7b5bd0ccfda130c",
      "ref": "bystock-pools-nature-reserve-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/0/0fef657b2c57fabfd5d3980ac08de5de.gpx",
  "_geoloc": {
    "lat": 50.6765927278,
    "lng": -3.3721411242
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Woodbury_Common_-_geograph.org.uk_-_956364.jpg",
      "title": "Sarah Charlesworth / Woodbury Common, via Wikimedia Commons",
      "caption": "This heathland is on the Salterton Triassic Pebble Beds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Woodbury_Common_-_geograph.org.uk_-_163106.jpg",
      "title": "Derek Harper / Woodbury Common, via Wikimedia Commons",
      "caption": "A path heads off between gorse bushes towards pine trees at the top of Rushmoor Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Woodbury_Common_-_geograph.org.uk_-_1363153.jpg",
      "title": "Roger Cornfoot / Woodbury Common, via Wikimedia Commons",
      "caption": "Lovely view of a footpath on the common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/The_View_from_Woodbury_Common_-_geograph.org.uk_-_131314.jpg",
      "title": "Pierre Terre / The View from Woodbury Common, via Wikimedia Commons",
      "caption": "Looking slightly north of west from car park W of the B3180. On the skyline is the ttransmitter tower above Redhills. In centre are Exeter Cathedral towers and to the right Exe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Footpath_crossing_Woodbury_Common_-_geograph.org.uk_-_117974.jpg",
      "title": "David Smith / Footpath crossing Woodbury Common, via Wikimedia Commons",
      "caption": "Footpath crossing common. In the background are the trees of Woodbury Camp (aka Woodbury Castle)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/The_View_from_Woodbury_Common_-_geograph.org.uk_-_131315.jpg",
      "title": "Pierre Terre / The View from Woodbury Common, via Wikimedia Commons",
      "caption": "Looking north west from the car park west of the B3180. Straight ahead in the distance is Exeter University campus, with Maths most prominent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Tumulus_in_the_Carpark_on_Woodbury_Common_-_geograph.org.uk_-_956365.jpg",
      "title": "Sarah Charlesworth / Tumulus in the Carpark on Woodbury Common, via Wikimedia Commons",
      "caption": "Tumulus in the Carpark on Woodbury Common. A number of other tumuli are hidden in the adjacent woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/The_view_from_Woodbury_Common_-_geograph.org.uk_-_131308.jpg",
      "title": "Pierre Terre / The view from Woodbury Common, via Wikimedia Commons",
      "caption": "The view from Woodbury Common. This is the view slightly south of east over the Exe near Powderham Castle. On the Skyline is Dartmoor - probably Hay Tor. Below is the wooded ridge of Great Haldon"
    }
  ],
  "distance_km": 3.5,
  "description": "Enjoy miles of walking trails through this large area of common land in Woodbury, Devon. The Woodbury and Bicton commons consist of heathland, gorse, heather and pebblebeds from rivers which once flowed across the basin. You can also climb to the ancient hill fort of Woodbury Castle where there are great views of the Exe estuary, Haldon Hills, Otter Valley, and Portland Bill on the coast. The fort was built around 500-300 BC and has a moat which you can walk through. The area is a really good place for wildlife spotting. Look out for birds such as Dartford Warbler and butterflies including High Brown Fritillary and Silver Studded Blue. You can extend your walk by continuing south to Bystock Pools Nature Reserve where there is a lilly-pad filled lake, heathland, wildflower meadow and boardwalks. It's a great place to look out for dragonflies and birds such as willow warblers, blackcaps and stonechats. Also at the southern end of the common you will find Blackhill Quarry and its lake. This circular route starts from the car park near the Woodbury castle. The whole of it is more suitable for walkers but the area is also good for mountain biking. Start from the same start point and follow the tracks to Colaton Raleigh Common and then round to the quarry for a fun off road ride. The East Devon Way runs through the common so you can pick this up to continue your walk. If you head north east you will come to the Hawkerland Valley and the Aylesbeare Common RSPB nature reserve. To the south west is the town of Exmouth and the lovely Exmouth Nature Reserve. Also nearby is the River Otter and the Otter Estuary where you can enjoy waterside walking trails and a variety of wading birds.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head west from the common into the village of Woodbury for some post walk refreshments. There's a few nice pubs here including The Maltsters Arms which is first recorded in 1923 as a Woodbury Pub. The Maltster was the man who prepared the barley for the Brewer by steeping it in water until it had absorbed the correct amount of moister (learned by experience). The pub has a large car park does excellent food and has a lovely large garden to sit out in on warmer days. You can find it in the centre of the village at postcode EX5 1LN for your sat navs. The White Hart is another good option in the village. It also has a nice beer garden and a good menu. It can be found on Church Stile Lane at postcode EX5 1HN."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The common is an excellent place for dog walking with miles of nice wide tracks for you and your dog to roam on."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south east there's some interesting local history at Hayes Barton, the birth place of Sir Walter Raleigh. The 15th century house is not open to the public but it can be viewed from the nearby road (Hayes Lane). Sir Walter Raleigh's father was tenant here and a Church Warden at East Budleigh where the family crest on the bench end and his step-mother's tomb can be seen today. Postcode is EX9 7BS."
    }
  ],
  "video_url": "https://www.youtube.com/embed/idbsE1bZE_I",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Estuary View Car Park, B3180, Woodbury, East Devon, Devon, England, EX5 1JL, United Kingdom",
  "postcode": "EX5 1JL",
  "district": "East Devon",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "heathland",
    "woodland",
    "coastal"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve",
    "wildlife spotting"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}