{
  "objectID": "0ff1e1b4c7b2b78fa933be42f99cf706",
  "created_at": "2024-12-21T19:41:32.289065+00:00",
  "ref": "clonakilty-walking-route",
  "title": "Clonakilty Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Clonakilty_Harbour.jpg/512px-Clonakilty_Harbour.jpg",
  "nearby": [
    {
      "description": "Seven Heads Walk",
      "objectID": "926181ca1c08d632305a93874b620fdd",
      "ref": "seven-heads-walk-walking-route"
    },
    {
      "description": "Ballycotton Cliff Walk",
      "objectID": "974ddbe676115c9eed187875f7535dc7",
      "ref": "ballycotton-cliff-walk-walking-route"
    },
    {
      "description": "Old Head of Kinsale",
      "objectID": "6d748093568dc57c8e8dd5b814f511ef",
      "ref": "old-head-of-kinsale-loop-walking-route"
    },
    {
      "description": "Ardmore Cliff Walk",
      "objectID": "8545239d639b295b86685a3010254814",
      "ref": "ardmore-cliff-walk-walking-route"
    },
    {
      "description": "Charles Fort Walk",
      "objectID": "50c135edb268d0e7e0ff0c8cc6a2f347",
      "ref": "charles-fort-walking-route"
    },
    {
      "description": "Lough Hyne",
      "objectID": "3f08982fdd9e1c3167539db835c33309",
      "ref": "lough-hyne-walking-route"
    },
    {
      "description": "Crosshaven Cliff Walk",
      "objectID": "f1573fbcf3ca1faebd8307d2a6090e22",
      "ref": "crosshaven-cliff-walk"
    },
    {
      "description": "Blarney Castle",
      "objectID": "f54bf95ceeebc6f3ccf1215760eb9760",
      "ref": "blarney-castle-walking-route"
    },
    {
      "description": "Cork Marina Walk",
      "objectID": "ebdb8495297be1f45c661e15a5b0412d",
      "ref": "cork-marina-walking-route"
    },
    {
      "description": "Galley Head",
      "objectID": "c5b4128a66c8175e988bb8fb9ac9ae2a",
      "ref": "galley-head-walking-route"
    },
    {
      "description": "Courtmacsherry Loop",
      "objectID": "5adae4e8f35017db8d7a595a40abc75c",
      "ref": "courtmacsherry-loop-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/4D93BA5BE82739BA86258AE700579993/$FILE/Clonakilty.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Clonakilty_Harbour.jpg/512px-Clonakilty_Harbour.jpg",
      "title": "Podstawko, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Clonakilty Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Clonakilty_town_centre_-_geograph.org.uk_-_1959402.jpg/512px-Clonakilty_town_centre_-_geograph.org.uk_-_1959402.jpg",
      "title": "Clonakilty town centre by Jeff Horne, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clonakilty town centre. Clonakilty serves as a central tourism hub in West Cork and has garnered prestigious accolades for its charm and appeal. In 2017, it was honoured with the title of \"Best Town in Europe\" and also recognised as the \"Best Place of the Year\" by the Royal Institute of the Architects of Ireland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Seat_by_the_Bay%2C_Clonakilty_Harbour_-_geograph.org.uk_-_5848698.jpg",
      "title": "Seat by the Bay, Clonakilty Harbour by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Seat by the Bay, Clonakilty Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Clonakilty_Harbour_-_geograph.org.uk_-_5848693.jpg",
      "title": "Clonakilty Harbour by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clonakilty Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Rocky_Outcrops_to_West_of_Inchdoney_Island_headland_-_geograph.org.uk_-_950322.jpg",
      "title": "Jonathan Pascall / Rocky Outcrops to West of Inchdoney Island headland",
      "caption": "Rocky Outcrops to West of Inchdoney Island headland. Having walked out on to the headland in front of the Inchydoney Island hotel this is the western side of the headland and view beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Looking_up_at_the_Inchdoney_Island_Hotel_-_geograph.org.uk_-_950328.jpg",
      "title": "Jonathan Pascall / Looking up at the Inchdoney Island Hotel",
      "caption": "Looking up at the Inchdoney Island Hotel. Inchydoney is a popular tourist destination boasting two stunning beaches, each situated on either side of the Virgin Mary headland. During the summer months, a lifeguard station is set up on the headland for a period of three months, ensuring the safety of beachgoers. The island holds historical significance, having been granted by Queen Elizabeth I to the Church of Ireland Bishop of Ross in 1584. Amidst the turmoil of the Irish Confederate Wars, a notable event occurred when a Protestant force led by Lord Forbes recaptured the town of Clonakilty from Catholic rebels in 1642. Following this, several hundred rebels attempted to seek refuge on the island of Inchydoney. Tragically, they were intercepted and drowned by the rising tide before reaching the shores of Inchydoney."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Clonakilty_model_village_-_geograph.org.uk_-_1968278.jpg",
      "title": "Clonakilty model village by Christopher Hilton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clonakilty model village. The Model Village is a tourist attraction and includes fully scaled models of Clonakilty and nearby towns – built on a miniature of the area's railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Emmet_Square_Clonakilty_-_geograph.org.uk_-_4965786.jpg/512px-Emmet_Square_Clonakilty_-_geograph.org.uk_-_4965786.jpg",
      "title": "Emmet Square Clonakilty by Gordon Hatton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Emmet Square Clonakilty. Michael Collins House is a museum dedicated to the Irish revolutionary leader Michael Collins. The museum is set out in a restored Georgian townhouse on Emmet Square, where Collins lived from 1903 to 1905. Visitors can explore the museum's exhibits, interactive displays, and historical artifacts to learn about Collins' life and the history of Irish independence. Guided tours are also available to provide deeper insights into Collins' legacy and his contributions to Ireland's struggle for independence. Michael Collins, was the Director of Intelligence for the Irish Republican Army (IRA) during the Irish War of Independence, spending his formative years in Clonakilty and attending the local boys' national school. His pivotal role continued as he later served as Chairman of the Provisional Government of Ireland, playing a crucial part in the establishment of the Irish Free State. Collins fell victim to an ambush by the Anti-Treaty IRA during the Irish Civil War. Collins maintained a strong connection to Clonakilty throughout his life, delivering several speeches from O'Donovan's Hotel on the Main Street. A testament to his legacy stands in Emmet Square, where Collins resided for a period—a statue erected and dedicated in 2002 pays tribute to his memory."
    }
  ],
  "distance_km": 4.1,
  "description": "Clonakilty is a vibrant and welcoming seaside town located in the heart of West Cork, in the southern region of Ireland. Renowned for its multi-award-winning status, it boasts a cosmopolitan atmosphere and a friendly community spirit. This walk from the town takes you along the lovely Clonakilty Harbour to Inchydoney Island. The Island is a popular tourist spot with a beautiful Blue Flag Beach. The walk takes you south from the town passing the splendid West Cork Model Railway Village before picking up a waterside path along the harbour. There are wonderful views across the water to the surrounding countryside on this trail. You'll soon come to Inchydoney Island where you can enjoy a coastal walk with more fine views out to sea. To continue your walking in the area head east along the coast and you could pick up the popular Seven Heads Walk . There's a long circular trail to follow around the picturesque peninsula with pretty seaside villages, lovely beaches and bays.",
  "video_url": "https://www.youtube.com/embed/jEFJwQhqcXo?si=QIHSspd1wu_W5Aze"
}