{
  "created_at": "2025-01-06T00:06:14.433146+00:00",
  "objectID": "b0f699d8ed63c9ba51df884742dd41a1",
  "ref": "malpas-walking-route",
  "title": "Malpas Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Town_Centre%2C_Malpas_-_geograph.org.uk_-_724815.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b0f699d8ed63c9ba51df884742dd41a1.gpx",
  "_geoloc": {
    "lat": 53.0195752919,
    "lng": -2.7645484997
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Town_Centre%2C_Malpas_-_geograph.org.uk_-_724815.jpg",
      "title": "BrianP, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Town Centre, Malpas. Looking northwards along the Roman Road from the steps of the cross. The black and white building on the right is the Victoria Jubilee Hall, dated 1887"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Church_View%2C_Malpas.jpg/256px-Church_View%2C_Malpas.jpg",
      "title": "Dave.Dunford, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Church View, Malpas. St Oswald's church in the town is a noteworthy ancient church with a fine bossed ceiling, Flemish window panels, and a magnificent 13th century oak chest. The church also contains a 15th century octagonal stone font and choir stalls with carved misericords. It stands on the highest point in the town. Near the site is a Norman motte and bailey castle. The church is a Grade I listed building and recognised as being one of the best examples in Cheshire of a late 15th to early 16th-century church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Footpath_to_Malpas_-_geograph.org.uk_-_441060.jpg",
      "title": "Jonathan Billinger, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath to Malpas"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Mere_near_The_Lees_-_geograph.org.uk_-_323789.jpg",
      "title": "Espresso Addict / Mere near The Lees",
      "caption": "Mere near The Lees. This small fenced mere was one of several small meres south of The Lees, visible from the lane to Bradley Brook. It does not appear to be marked on the OS Pathfinder and might be artificial. The structure on the left was probably a silo. The elevation in the distance is typical of the area to the east of Malpas, which is less flat than much of the Cheshire plain"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Tushingham_cum_Grindley_-_cottage_on_the_Bishop_Bennet_Way_-_geograph.org.uk_-_219023.jpg",
      "title": "Mike Harris / Tushingham cum Grindley - cottage on the Bishop Bennet Way",
      "caption": "Tushingham cum Grindley - cottage on the Bishop Bennet Way. Tushingham cum Grindley. Cottage on the Bishop Bennet Way (Tushingham bridleway 20) at its junction with footpath 12 and the ORPA from the Blue Bell pub at Bell o'th' Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Tushingham_-_view_from_the_Bishop_Bennet_Way_-_geograph.org.uk_-_219041.jpg",
      "title": "Mike Harris / Tushingham - view from the Bishop Bennet Way",
      "caption": "Tushingham - view from the Bishop Bennet Way. Tushingham cum Grindley. View from the Bishop Bennet Way (TG 12). Looking west across Cheshire's deep south towards the Welsh hills, barely visible in the distant haze."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/The_Bishop_Bennet_Way_at_Oldcastle_Heath_%28geograph_4395002%29.jpg/512px-The_Bishop_Bennet_Way_at_Oldcastle_Heath_%28geograph_4395002%29.jpg",
      "title": "Jeff Buck / The Bishop Bennet Way at Oldcastle Heath",
      "caption": "The Bishop Bennet Way at Oldcastle Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Lake_at_Newton_Hall_-_geograph.org.uk_-_232789.jpg",
      "title": "Peter Craine, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lake at Newton Hall"
    }
  ],
  "distance_km": 17.3,
  "description": "This Cheshire based market town is a fine place for a stroll with a number of historic buildings including a significant 14th century church and several picturesque timber framed properties. The town is also surrounded by some lovely Cheshire countryside with the Shropshire Union Canal also not far away. Malpas is located a few miles north west of Whitchurch. This circular walk from the town uses sections of the Marches Way and the Bishop Bennet Way to explore the countryside and villages surrounding the settlement. These two long distance waymarked trails are a good way to explore the area. The walk starts in the town and first heads east along the Marches Way to the Maltkiln and Bell o' th' Hill. At this eastern end of the walk you could take a small detour to visit the Shropshire Union Canal around Tushingham. Near Bell o' th' Hill you pick up the Bishop Bennet Way and follow it west past Wigland Hall and Wellmeadow Wood to Lower Wych. Here you turn north and follow country lanes to Oldcastle Heath and Cuddington Heath before returning to Malpas.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Lion is a fine place for some well earned rest and refreshment after your exercise. The quintessentially British Inn serves high quality food from an extensive menu and also provides rooms if you'd like to stay in the area. You can find them on Old Hall Street at postcode SY14 8NE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Lion mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east you'll find the neighbouring village of Cholmondeley where you can explore the 19th century Cholmondeley Castle. The castle is surrounded by 70 acres of beautiful parkland and gardens with an arboretum, herbaceous borders and a fine viewpoint to enjoy"
    }
  ],
  "video_url": "https://www.youtube.com/embed/RNJbHuCRtig",
  "district": "Malpas",
  "county": "Cheshire West and Chester",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Lion, Well Street, Broselake Farm, Malpas, Cheshire West and Chester, England, SY14 8QL, United Kingdom",
  "postcode": "SY14 8QL",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "countryside",
    "woodland"
  ],
  "points_of_interest": [
    "historical buildings",
    "villages"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}