{
  "created_at": "2025-01-06T00:23:35.095060+00:00",
  "objectID": "b1a21754a420ef3adbe8adb4fd8b6500",
  "ref": "ashley-walk-walking-route",
  "title": "Ashley Walk New Forest Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Bomb_crater_southeast_of_Ticketsbury%2C_New_Forest_-_geograph.org.uk_-_478098.jpg/256px-Bomb_crater_southeast_of_Ticketsbury%2C_New_Forest_-_geograph.org.uk_-_478098.jpg",
  "nearby": [
    {
      "description": "Godshill",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    },
    {
      "description": "Wilverley Plain",
      "objectID": "873ccc30c41d7a93728a43b79dec1af9",
      "ref": "wilverley-plain-walking-route"
    },
    {
      "description": "Fordingbridge",
      "objectID": "f6b8024033c64b8164b85712621b4eea",
      "ref": "fordingbridge-walking-route"
    },
    {
      "description": "Cadman's Pool",
      "objectID": "74ac829c1a2c74cf0a1f8e00f8123108",
      "ref": "cadmans-pool-walking-route"
    },
    {
      "description": "Fritham",
      "objectID": "1618e6bc4fb50f181976db6d09d30bfb",
      "ref": "fritham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b1a21754a420ef3adbe8adb4fd8b6500.gpx",
  "_geoloc": {
    "lat": 50.9403025279,
    "lng": -1.7356478031
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Bomb_crater_southeast_of_Ticketsbury%2C_New_Forest_-_geograph.org.uk_-_478098.jpg/256px-Bomb_crater_southeast_of_Ticketsbury%2C_New_Forest_-_geograph.org.uk_-_478098.jpg",
      "title": "Jim Champion / Bomb crater southeast of Ticketsbury, New Forest",
      "caption": "Bomb crater southeast of Ticketsbury. The pool in the foreground is at the bottom of a large bomb crater on the heathland plateau between Ticketsbury and Ashley Cross. The area was included within the Ashley Walk Range during the Second World War, and various bombs were tested on a variety of targets on the heathland. The \"Grand Slam\" crater is a few hundred metres away to the east, at SU199142. Grand Slam was a 22000-pound (10 tonne) high-explosive bomb, the largest conventional weapon used during the Second World War. Here on the Ashley Walk range it was supposed to land on the submarine pen target, but missed it by a short distance, leaving a vast crater. In action during 1945 the Grand Slam brought down viaducts and penetrated the reinforced concrete of German submarine pens near Bremen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Heathland_in_the_rain%2C_Ashley_Walk%2C_New_Forest_-_geograph.org.uk_-_478226.jpg/256px-Heathland_in_the_rain%2C_Ashley_Walk%2C_New_Forest_-_geograph.org.uk_-_478226.jpg",
      "title": "Jim Champion / Heathland in the rain, Ashley Walk, New Forest",
      "caption": "Heathland in the rain, Ashley Walk, New Forest. The gravel track in the middle of the photo is an off-road cycle route between Frogham (on the western edge of the Forest) and the village of Fritham (in the middle of the northern part of the Forest). Bell heather is blooming pink in the foreground. The gorse covered mound on the horizon towards the left is the earth-covered remains of a submarine pen target - burying it proved to be the easiest way of 'removing' it when the Second World War bombing range at Ashley Walk was closed down. The bump of conifers in the far distance are the tops of trees growing on Ticketsbury on the southern edge of Pitts Wood Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Disused_car_park_on_Deadman_Hill%2C_New_Forest_-_geograph.org.uk_-_466250.jpg",
      "title": "Jim Champion / Disused car park on Deadman Hill, New Forest",
      "caption": "Disused car park on Deadman Hill, New Forest. Alongside the B3078 road on Deadman Hill, these pine trees surround an old gravel car park - no longer open to the public. The earthen banks around the perimeter of the car park are a convenient home for rabbits. I believe this spot was also the site of the 'North Tower' of the Ashley Walk bombing range during the Second World War. Beyond the low wooden gate on the left, a path leads down to Black Gutter Bottom. Godshill Ridge can be seen in the far distance on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Second_World_War_bombing_target_at_Leaden_Hall%2C_New_Forest_-_geograph.org.uk_-_81003.jpg",
      "title": "Jim Champion / Second World War bombing target at Leaden Hall, New Forest",
      "caption": "Second World War bombing target at Leaden Hall. This circular feature (and the paths leading to it) are the only man-made features in this grid square, on a remote ridge in the northern New Forest. During the Second World War this area was used as a target for bomb testing (called No. 2 Wall Target). A target wall stood off-centre in the circular area and it was used to test bombs - the concrete apron was removed in 1991 (over 50 years after the range closed for good) and the area is now grassed over. Full details are given in a book by Antony Pasmore and Norman Parker called \"Ashley Walk: Its bombing range landscape and history\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Heathland_west_of_Ashley_Cross%2C_New_Forest_-_geograph.org.uk_-_56505.jpg",
      "title": "Jim Champion / Heathland west of Ashley Cross, New Forest",
      "caption": "Heathland west of Ashley Cross. This pond is found on Hampton Ridge, just west of the area called Ashley Cross. Beyond the pond is an artificial mound, which seems to be labelled as a tumulus on the OS map, but is in fact a relic from World War II. It is a replica of the concrete U-boat pens at Brest, used as bombing practice to test the effectiveness of the bombs on such a structure. Only a few bits of concrete are visible sticking out of the mound when you get up close - it was buried when the range was closed because that was the easiest way of \"disposing\" of such a sturdy structure. The pond in the foreground is most likely a bomb crater - there are many in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Western_entrance_to_Pitts_Wood_Inclosure%2C_New_Forest_-_geograph.org.uk_-_375993.jpg",
      "title": "Jim Champion / Western entrance to Pitts Wood Inclosure, New Forest",
      "caption": "Western entrance to Pitts Wood Inclosure. These posts mark the western entrance to Pitts Wood Inclosure. The inclosure is no longer enclosed by a fence (i.e. it is 'thrown open') and some of the pines from this end of the inclosure have been cleared. Just beyond and to the right of the rightmost gatepost is a small cast iron plaque giving a short history of the inclosure up to the time of Deputy Surveyor Gerald Lascelles. It is similar in style to the one in Wilverley Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Ponies_on_Little_Cockley_Plain%2C_New_Forest_-_geograph.org.uk_-_375947.jpg",
      "title": "Jim Champion / Ponies on Little Cockley Plain, New Forest",
      "caption": "Ponies on Little Cockley Plain. Ponies grazing on the heath on the gravel plateau of Little Cockley Plain, on top of Cockley Hill. The holly trees in the background are alongside the track to Ashley Lodge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Track_from_Godshill_Ridge_to_Cockley_Hill%2C_New_Forest_-_geograph.org.uk_-_277090.jpg",
      "title": "Jim Champion / Track from Godshill Ridge to Cockley Hill, New Forest",
      "caption": "Track from Godshill Ridge to Cockley Hill. The track from Godshill Ridge snakes down into the valley bottom, crosses Ditchend Brook, and (in the neighbouring grid square) climbs Cockley Hill. This area was part of the Ashley Walk bombing range during the Second World War, and this track was one of the gravel roads to the target area around Leaden Hall."
    }
  ],
  "distance_km": 5.4,
  "description": "This circular walk explores the Ashley Walk area of the New Forest, near Godshill. The area is a popular spot for walking with a good sized car park, heathland, woodland, streams and lots of deer and ponies to look out for. It's also of some historical interest as it was here where the largest Bomb ever to be dropped on British soil was tested in World War 2. You can see evidence of its use with craters, markings and buildings still visible today. You can start the walk from the Ashley Walk car park, located off the Roger Penny Way, just north east of Godshill. From here you can pick up the trails heading east to Cockley Hill, Lodge Hill and the Pitts Wood Inclosure where there's some sheltered woodland trails. The route then returns via the Godshill Ridge with some pleasant views over the surrounding area to enjoy. You could extend the walk by continuing south into the Amberwood Inclosure and then on to visit the delightful Cadman's Pool on the other side of Fritham Plain.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west is the town of Fordingbridge where you can explore the historic town and pick up the long distance Avon Valley Path. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ly_Elz_oym4",
  "postcode": "SP5 2PX",
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ashley Walk, Roger Penny Way, Newgrounds, Godshill, Fritham, New Forest, Hampshire, England, SP5 2PX, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "heathland",
    "woodland",
    "streams"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}