{
  "created_at": "2025-01-06T00:08:44.415994+00:00",
  "objectID": "b1fdfdc4036b8e7eaff91c7987adff8f",
  "ref": "grimes-graves-walking-route",
  "title": "Grime's Graves and Weeting Castle Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Track_to_Grime%27s_Graves_-_geograph.org.uk_-_1017452.jpg",
  "nearby": [
    {
      "description": "Thetford Forest",
      "objectID": "c754503315c7047bb884243a9b4b3ec5",
      "ref": "thetford-forest-walking-and-cycle-route"
    },
    {
      "description": "Little Ouse Path",
      "objectID": "2c313ceb6bcc1fd8b8dfbbf05e0e5b08",
      "ref": "little-ouse-path-walking-route"
    },
    {
      "description": "Hereward Way",
      "objectID": "eb70237db71b27b0ed597128a0456162",
      "ref": "hereward-way-walking-route"
    },
    {
      "description": "Thetford River Walk",
      "objectID": "4b824524faf9d51bdcb619d3a8941bf8",
      "ref": "thetford-river-walk-walking-route"
    },
    {
      "description": "Brandon Country Park",
      "objectID": "ce9580ffc900fd36a3cca16ed209c29d",
      "ref": "brandon-country-park-walking-and-cycle-route"
    },
    {
      "description": "St Edmund Way",
      "objectID": "40befcc98f0036085f815e38b0a9bdec",
      "ref": "st-edmund-way-walking-route"
    },
    {
      "description": "Santon Downham",
      "objectID": "13b74d007ec0b740835d202be7380a77",
      "ref": "santon-downham-walking-route"
    },
    {
      "description": "Lynford Arboretum",
      "objectID": "3f269227c668742c2a398f507301b752",
      "ref": "lynford-arboretum-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b1fdfdc4036b8e7eaff91c7987adff8f.gpx",
  "_geoloc": {
    "lat": 52.4769408994,
    "lng": 0.6720599158
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Track_to_Grime%27s_Graves_-_geograph.org.uk_-_1017452.jpg",
      "title": "Bob Jones / Track to Grime's Graves",
      "caption": "Track to Grime's Graves. What the prehistoric miners sought here was the fine quality jet-black flint \u0091floorstone\u0092, which occurs some nine metres below surface level. This was prized as an easily \u0091knapped\u0092 material for axes and other tools \u0096 and much later elsewhere for well-sparking flintlock muskets. Digging with red-deer antler picks, they sank shafts from which radiated gallery-tunnels, following the seams of flint."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Entrance_to_Grime%27s_Graves_-_geograph.org.uk_-_397322.jpg",
      "title": "Jonathan Billinger / Entrance to Grime's Graves",
      "caption": "Entrance to Grime's Graves. The site is the only Neolithic flint mine open to visitors in Britain. A grassy lunar landscape of over 400 shafts, pits, quarries and spoil dumps, they were first named Grim\u0092s Graves \u0096 meaning the pagan god Grim\u0092s quarries, or \u0091the Devil\u0092s holes\u0092 \u0096 by the Anglo- Saxons. It was not until one of them was excavated in 1870 that they were found to be flint mines dug over 5,000 years ago, during the later Neolithic and early Bronze Ages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Open_Flint_Mine._Grime%27s_Graves_-_geograph.org.uk_-_1318798.jpg",
      "title": "David Seale / Open Flint Mine. Grime's Graves",
      "caption": "View of the ladder down to the show pit. Hard hats must be worn here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Grimes_Graves%2C_near_Thetford%2C_Norfolk_-_geograph.org.uk_-_41510.jpg",
      "title": "Ron Strutt / Grimes Graves, near Thetford, Norfolk",
      "caption": "A summer view of Grime's Graves. Dating from the Neolithic age of 5000 years ago, it is one of the country's earliest mining sites. The remains of 433 mineshafts, pits, and spoil heaps pockmark the surface of the ground where ancient man dug for flints from which to make tools and weapons. 28 of the mines have been excavated and one has been left open to allow visitors to climb down into."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Weeting_Castle_-_18th_C_Icehouse_-_geograph.org.uk_-_2377317.jpg",
      "title": "Ashley Dace / Weeting Castle - 18th C Icehouse",
      "caption": "Ice house, Weeting Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Weeting_Castle_-_geograph.org.uk_-_2377286.jpg",
      "title": "Ashley Dace / Weeting Castle",
      "caption": "Weeting Castle is a 12th-century ruin with a three-story-high tower in Weeting, near Brandon, Norfolk. Despite the name, it is not a castle but actually a fortified manor house. It has a large open hall and an attached two-storey chamber block. There's a domed brick ice-house on the northwest corner of the moat and a small car park next to the church. The moat was added in the 14th century. The place is thought to have been abandoned in 1390. The manor was built on a 10th C settlement. It is now owned by English Heritage. Entry is free and the location is open all year for visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/St._Mary%27s_church_Weeting_-_geograph.org.uk_-_993293.jpg",
      "title": "Jeff Tomlinson / St. Mary's church Weeting",
      "caption": "St. Mary's church Weeting. Viewed from Weeting Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Weeting_Castle%2C_Latrine_block_-_geograph.org.uk_-_738408.jpg",
      "title": "Oxyman / Weeting Castle, Latrine block",
      "caption": "Weeting Castle, Latrine block"
    }
  ],
  "distance_km": 11.7,
  "description": "This circular walk visits two interesting English Heritage Sites in Thetford Forest. The walk starts at the car park at Grimes Graves, a prehistoric flint mine dug over 5000 years ago. Today the site is run by English Heritage and allow visitors to descend 9 metres (30 ft) by ladder into an excavated shaft to view the jet-black flint. After exploring the site you can then pick up footpaths heading west to Emily's Wood and the village off Weeting. Here you will find the historic Weeting Castle, a ruined 12th-century manor house with an interesting history. The structure was built around 1180 by Hugh de Plais, and included a three-storey tower, a substantial hall, and a service block, with a separate kitchen positioned near the house. A moat was later dug around the site in the 13th century. After exploring the castle ruins the route retraces its steps to Sunnyside Cottage before turning south to Shadwell's Plantation. You then follow woodland trails east to Bromehill Cottage before turning north to north east to return to the Grime's Graves car park.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's lots of good options for continuing your walking in this area of Thetford Forest. If you head south you could visit the pretty village of Santon Downham where there's an interesting 13th century church to investigate. You can also enjoy a lovely riverside walk here along the Little Ouse Path. In the forest there's also Lynford Arboretum to consider. It's a lovely place for a walk with woodland trails, pretty lakes and an impressive 19th century Sequoia Avenue to see. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "postcode": "IP26 5DE",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grime's Graves, Stump Buster, Lynford, Breckland, Norfolk, England, IP26 5DE, United Kingdom",
  "district": "Breckland",
  "state": "England"
}