{
  "created_at": "2025-01-06T05:03:47.287911+00:00",
  "objectID": "b2a681038f51a7f0d09d753456c7ef62",
  "ref": "sutton-bingham-reservoir-walking-route",
  "title": "Sutton Bingham Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Sutton_Bingham_Reservoir_-_geograph.org.uk_-_526091.jpg",
  "nearby": [
    {
      "description": "Yeovil Country Park",
      "objectID": "599d95f4b0c4cd930ea7cb634b9375e2",
      "ref": "yeovil-country-park-walking-and-cycle-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "National Cycle Route 26",
      "objectID": "de36a7ba2f6e216f5ff706b8d1ecad46",
      "ref": "national-cycle-route-26"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b2a681038f51a7f0d09d753456c7ef62.gpx",
  "_geoloc": {
    "lat": 50.8985718747,
    "lng": -2.6454894163
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Sutton_Bingham_Reservoir_-_geograph.org.uk_-_526091.jpg",
      "title": "Jonathan Billinger / Sutton Bingham Reservoir, via Wikimedia Commons",
      "caption": "View eastwards across the narrow upper end of the body of water. Alders abound."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Sailing_on_Sutton_Bingham_Reservoir_-_geograph.org.uk_-_406212.jpg",
      "title": "Andy Jenkins / Sailing on Sutton Bingham Reservoir, via Wikimedia Commons",
      "caption": "Sailing boats out on the waters of Sutton Bingham Reservoir. The reservoir is home to the Sutton Bingham Sailing Club and the waters can be busy in the summer months with sailors. This photo demonstrates how an essential feature such as a reservoir can also have secondary or additional uses such as in this case where it is also used for leisure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Warriors_Rest_Sutton_Bingham_-_geograph.org.uk_-_893956.jpg",
      "title": "Sarah Smith / Warriors Rest Sutton Bingham, via Wikimedia Commons",
      "caption": "Warriors Rest. A tranquil setting on the shores of the reservoir where a tree is planted - Life for a Life - in memory of a loved one."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Sailing_club_and_school_Sutton_Bingham_reservoir_-_geograph.org.uk_-_942140.jpg",
      "title": "Sarah Smith / Sailing club and school Sutton Bingham reservoir, via Wikimedia Commons",
      "caption": "Sailing club and school. Today there were carloads of children taking dinghy sailing lessons on the reservoir. The colourful sails certainly brighten up another cloudy day!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/The_blue_waters_of_Sutton_Bingham_-_geograph.org.uk_-_1264710.jpg",
      "title": "Sarah Smith / The blue waters of Sutton Bingham, via Wikimedia Commons",
      "caption": "The blue waters of Sutton Bingham. Who wants the Mediterranean when we have this lovely reservoir on a gloriously sunny spring day! The gridline runs across the photograph at approximately the point where the yellow buoy can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Picnic_area_and_carpark_Sutton_Bingham_-_geograph.org.uk_-_1264412.jpg",
      "title": "Sarah Smith / Picnic area and carpark Sutton Bingham, via Wikimedia Commons",
      "caption": "Picnic area and car park view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/Swan_Sutton_Bingham_-_geograph.org.uk_-_942121.jpg/256px-Swan_Sutton_Bingham_-_geograph.org.uk_-_942121.jpg",
      "title": "Sarah Smith / Swan Sutton Bingham, via Wikimedia Commons",
      "caption": "Where the road runs along the reservoir there are concrete slopes running down to the water behind the wire mesh fence and numerous water fowl and the occasional swan waddle up to sunbathe or to be fed by the visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Oak_tree_-_Sutton_Bingham_-_geograph.org.uk_-_1264433.jpg",
      "title": "Sarah Smith / Oak tree - Sutton Bingham, via Wikimedia Commons",
      "caption": "Oak tree. This old tree growing on the west side of the reservoir is just coming into leaf."
    }
  ],
  "distance_km": 1.0,
  "description": "This pretty reservoir near Yeovil has a short walking trail through a hay meadow on the western bank of the water. There's lots of pretty wildflowers and great views across the lovely blue waters of the lake from the viewpoint. The meadow includes flora such as the purple Meadow Saffron and yellow Bird's foot trefoil. These attract a wide variety of butterflies such as Small Skipper and Marble White. On the lake you can look out for a number of water loving birds such as Pochard, Coot and Tufted Duck. If you'd like to continue your walking in the area then the Monarch's Way runs through East Coker just to the north of the reservoir. This popular waymarked trail leads you north to Yeovil Country Park where you will find 127 acres of rivers, lakes, waterfalls, open grassland and woodland.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head short distance north east from the reservoir into East Coker and you can visit the Heylar Arms for some post walk refreshments. It is a pub of some note, being a Grade II listed building and dating from the 15th Century. The pub still retains a wealth of character and charm, set in the picturesque village of East Coker with its mellow stone and thatch cottages, almshouses, Historic Coker Court and St Michael’s church. You can visit the resting place of T.S. Eliot and discover the birthplace of the explorer William Dampier in the area. There's an excellent menu, real log fires, a large sunny garden to sit in during the summer months and a car park that can accommodate over 30 cars. The inn also provides accommodation if you need to stay over. You can find the pub in the village on Moor Street with a postcode of BA22 9JR for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could also pay a visit to Coker Court in the nearby village of East Coker. The historic building includes a noble hall complete with minstrel gallery and magnificent Jacobean fireplace. Within the churchyard lie the remains of the poet T.S. Eliot who once wrote a poem about East Coker. There's also the interesting church of St Michael, which was believed to have been built by Hugh de Courteney in 1276. The church is in an interesting location, situated on a hill overlooking the village. For cyclists National Cycle Route 26 runs along the western side of the lake. The trail runs from Portishead in Somerset to the Isle of Portland on the south coast of Dorset. You can extend your outing on this signed Sustrans path if you have time."
    }
  ],
  "video_url": "https://www.youtube.com/embed/0TBft_8Z_QI",
  "district": null,
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sutton Hill, Sutton Bingham, Closworth, Somerset, England, BA22 9QP, United Kingdom",
  "postcode": "BA22 9QP",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1-2 hours",
  "difficulty": "easy",
  "terrain": [
    "meadow",
    "waterfront"
  ],
  "points_of_interest": [
    "viewpoint",
    "wildflower areas",
    "bird watching"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "loop",
  "activities": [
    "walking",
    "bird watching"
  ]
}