{
  "created_at": "2025-01-06T00:55:09.570351+00:00",
  "objectID": "b2adeea319ab8a9a806bee12a065eaec",
  "ref": "ashlett-creek-to-calshot-walk-walking-route",
  "title": "Ashlett Creek to Calshot Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Victoria_Quay_and_Ashlett_Mill_-_geograph.org.uk_-_331713.jpg",
  "nearby": [
    {
      "description": "Lepe Country Park",
      "objectID": "9ccdc1449bdc71d024492b19a411a751",
      "ref": "lepe-country-park-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b2adeea319ab8a9a806bee12a065eaec.gpx",
  "_geoloc": {
    "lat": 50.8265719604,
    "lng": -1.3391050128
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Victoria_Quay_and_Ashlett_Mill_-_geograph.org.uk_-_331713.jpg",
      "title": "Jim Champion / Victoria Quay and Ashlett Mill",
      "caption": "Victoria Quay and Ashlett Mill. Looking towards Ashlett Mill on the restored Victoria Quay. The mill is a three storey brick building with a tiled mansard roof, rebuilt in 1816. It is now home to the Ashlett Club, part of the Waterside Sports and Social Club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Saltmarsh_south_of_Ashlett_Creek_-_geograph.org.uk_-_331679.jpg",
      "title": "Jim Champion / Saltmarsh south of Ashlett Creek",
      "caption": "Saltmarsh south of Ashlett Creek. Looking across Southampton Water from the edge of 'dry land' across the saltmarsh. The mouth of Ashlett Creek can be seen in the distance in the middle of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Ponies_south_of_ESSO_sailing_club%2C_Ashlett_Creek_-_geograph.org.uk_-_331691.jpg",
      "title": "Jim Champion / Ponies south of ESSO sailing club, Ashlett Creek",
      "caption": "Ponies south of ESSO sailing club, Ashlett Creek. These ponies are grazing the field on the edge of the saltmarsh at the creek. Beyond the animals is the fenced boat pound of the ESSO sailing club."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Submerged_barge_in_saltmarsh%2C_Ashlett_Creek_-_geograph.org.uk_-_331729.jpg/256px-Submerged_barge_in_saltmarsh%2C_Ashlett_Creek_-_geograph.org.uk_-_331729.jpg",
      "title": "Jim Champion / Submerged barge in saltmarsh, Ashlett Creek",
      "caption": "Submerged barge in saltmarsh, Ashlett Creek. Looking across Southampton Water from the shore near Ashlett. In the foreground an old barge wallows in the mud of the saltmarsh. Out in the shipping lane a Red Funnel ferry is making its way to Southampton from Cowes on the Isle of Wight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Edge_of_Calshot_Marshes_-_geograph.org.uk_-_307019.jpg/256px-Edge_of_Calshot_Marshes_-_geograph.org.uk_-_307019.jpg",
      "title": "Jim Champion / Edge of Calshot Marshes",
      "caption": "Edge of Calshot Marshes. The bollards in the foreground are two of a series that stretch from the power station fence down to the shore. In the far distance is the Marine Terminal of the ESSO oil refinery."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Groynes_on_Calshot_beach_-_geograph.org.uk_-_206692.jpg",
      "title": "Jim Champion / Groynes on Calshot beach",
      "caption": "Groynes on Calshot beach. A view northeast from one of the wooden groynes on Calshot beach. At low tide a large area of shingle and mud is exposed, as can be seen here. In the distance a Red Funnel ferry is emerging from Southampton Water on its way to Cowes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Calshot_Marshes_nature_reserve_-_geograph.org.uk_-_306989.jpg",
      "title": "Jim Champion / Calshot Marshes nature reserve",
      "caption": "Calshot Marshes nature reserve. Looking across Calshot Marshes from the path along the shore, towards the end of the spit (with the old hangars and coastguard tower). This is a typical salt marsh, formed in the lee of Calshot Spit at the mouth of Southampton Water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Sea_wall%2C_Calshot_Castle_-_geograph.org.uk_-_1778430.jpg/512px-Sea_wall%2C_Calshot_Castle_-_geograph.org.uk_-_1778430.jpg",
      "title": "Richard Dorrell / Sea wall, Calshot Castle",
      "caption": "Sea wall, Calshot Castle. The castle, built 1539, is surrounded by a moat (seen here on the left) and separated from the Solent by the substantial wall on which the photographer is standing."
    }
  ],
  "distance_km": 3.2,
  "description": "This walk takes you along the Ashlett Creek from Ashlett to Calshot Castle in Hampshire. The walk starts in the village of Ashlett at the village quay. From here you can pick up a footpath heading south east along the creek to Fawley Power Station and the Calshot Marshes Nature Reserve. The reserve is a great place for birdwatching with large numbers of migratory and over-wintering waders and wildfowl. Look out for Wigeon, Teal, Ringed Plover, Grey Plover, Black-tailed Godwit, Redshank and Dunlin in this area. After passing the reserve you turn the corner to reach Calshot Castle. This artillery fort constructed by Henry VIII on the Calshot Spit during the 16th century. You can explore the castle and Calshot Beach before returning to Ashlett on the same paths. To continue your walking simply head south west along the coast to visit the lovely Lepe Country Park .This coastal park has lovely beach walks and views of the Isle of Wight over the Solent.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west there's the lovely Exbury Gardens to explore. There's 200 acres of flowers and rare plants with good surfaced footpaths provided. For more walking ideas in the area see the Hampshire Walks, New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zB8lvc6jXbw",
  "postcode": "SO45 1DT",
  "district": "Ashlett",
  "county": "Hampshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}