{
  "objectID": "b2b9888789d1f10cfda8211dc5acb2b7",
  "created_at": "2024-12-18T01:35:40.721951+00:00",
  "ref": "acres-down-walking-route",
  "title": "Acres Down Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Path_through_woodland_between_Acres_Down_and_Highland_Water%2C_New_Forest_-_geograph.org.uk_-_57398.jpg",
  "nearby": [
    {
      "description": "Minstead",
      "objectID": "d4c63a4b38ac2a434d1f2ee4bce752a5",
      "ref": "minstead-walking-route"
    },
    {
      "description": "Bolderwood Deer Sanctuary",
      "objectID": "2f68923b09d298914b749b55675c8d63",
      "ref": "bolderwood-deer-sanctuary-walking-route"
    },
    {
      "description": "Lyndhurst",
      "objectID": "6004e8b0ac8ca159efad3e2fed7d73fe",
      "ref": "lyndhurst-walking-route"
    },
    {
      "description": "Knightwood Oak",
      "objectID": "2e7f813af716643f3cd00f37b0871424",
      "ref": "knightwood-oak-walking-route"
    },
    {
      "description": "Furzey Gardens",
      "objectID": "a19083a5b087cb4ca77a06d9d41e99ca",
      "ref": "furzey-gardens-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/E1320DB1211FB8D886258795005B07FA/$FILE/Acres Down.gpx",
  "_geoloc": {
    "lat": 50.8867710188,
    "lng": -1.6204081134
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Path_through_woodland_between_Acres_Down_and_Highland_Water%2C_New_Forest_-_geograph.org.uk_-_57398.jpg",
      "title": "Jim Champion / Path through woodland between Acres Down and Highland Water, New Forest",
      "caption": "Path through woodland between Acres Down and Highland Water. This path leads down from the high ground of Acres Down on the way to the car park at Millyford Bridge. The open woodland has oak, beech and holly trees with an undergrowth of bracken."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Pony_eating_gorse%2C_Acres_Down%2C_New_Forest_-_geograph.org.uk_-_1071158.jpg",
      "title": "Jim Champion / Pony eating gorse, Acres Down, New Forest",
      "caption": "Pony eating gorse, Acres Down. The pony in the foreground is eating gorse, one of the widely available foods on the heathland in the New Forest. Beyond is the edge of Wick Wood and the pines of Highland Water Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Stone_circle_in_Wick_Wood%2C_New_Forest_-_geograph.org.uk_-_316362.jpg",
      "title": "Jim Champion / Stone circle in Wick Wood, New Forest",
      "caption": "Stone circle in Wick Wood. Not an ancient megalithic site but a circle of small pebbles (bleached white - most likely from the acid heath at nearby Acres Down) on a damp area of lawn in Wick Wood. In the distance is the track that leads to Acres Down car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Gravel_track_in_Highland_Water_Inclosure%2C_New_Forest_-_geograph.org.uk_-_316363.jpg",
      "title": "Jim Champion / Gravel track in Highland Water Inclosure, New Forest",
      "caption": "Gravel track in Highland Water Inclosure. Looking along the gravel track that serves as an off-road cycle route through Highland Water Inclosure, towards Acres Down. Most of this inclosure is conifer, but some sections like this that border Wick Wood contain old oak and beech. Silver birch grows up quickly to fill gaps."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Fixed_point_for_river_-_geograph.org.uk_-_307004.jpg",
      "title": "Hugh Venables / Fixed point for river",
      "caption": "Fixed point for river. There has been work on this river recently to reinstate meanders, which will subsequently move through deposition and erosion. However a bridge doesn't move so easily so the banks have to be strengthened near it to encourage the river not to move at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Deer_sanctuary_-_geograph.org.uk_-_844500.jpg",
      "title": "Shaun Ferguson / Deer sanctuary",
      "caption": "Deer sanctuary"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Trig_point_on_Hart_Hill%2C_New_Forest_-_geograph.org.uk_-_93023.jpg",
      "title": "Jim Champion / Trig point on Hart Hill, New Forest",
      "caption": "This trig point on Hart Hill (104m above sea level) is on the northern edge of the Highland Water Inclosure. In the time since it was used for triangulation the surrounding trees and bushes have grown. The gateposts in this picture mark an entrance to the Inclosure, which obviously is not enclosed any more because there is no gate. The plantations known as \"inclosures\" are only kept enclosed when it is necessary to allow young trees to grow without being disturbed by the roaming ponies and cattle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Track_on_Mogshade_Hill%2C_New_Forest_-_geograph.org.uk_-_813779.jpg",
      "title": "Jim Champion / Track on Mogshade Hill, New Forest",
      "caption": "Track on Mogshade Hill. The area is mostly heathland with bracken and heather, with areas of lawn, holly holm and the occasional large oak tree."
    }
  ],
  "distance_km": 8.8,
  "description": "This circular walk explores the Acres Down area of the New Forest near the village of Minstead . On the way you'll enjoy the woodland trails and streams of the Highland Water Inclosure before paying a visit to the nearby Bolderwood Deer Sanctuary . The walk starts at the Acres Down car park which is located just south west of Minstead, near to the Acres Down Farm . There's a campsite, working farm and a nice cafe to visit here. From the car park head south west past Wick Wood and into the Highland Water Inclosure. The trail continues past Woolsmoor Meads before coming to the lovely Bolderwood Deer Sanctuary. There's a splendid viewpoint here where you can observe the herd of fallow deer. The route then heads east to Coneygeer Bottom before turning north to the Canadian War Memorial and Mogshade Hill. From here you head east to Stonyard Wood and Hart Hill where you will find a triangulation pillar. The route then heads along Ringwood Ford Bottom before returning to the car park.",
  "video_url": "https://www.youtube.com/embed/XFaMv3Yyz1A",
  "postcode": "SO43 7GE",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}