{
  "created_at": "2025-01-06T03:22:51.682121+00:00",
  "objectID": "b2dbb7d26cfcceb406498c7e8ef13eaa",
  "ref": "llandrindod-wells-walking-route",
  "title": "Llandrindod Wells Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Llandrindod_Wells_lake_water_sculpture.jpg/512px-Llandrindod_Wells_lake_water_sculpture.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b2dbb7d26cfcceb406498c7e8ef13eaa.gpx",
  "_geoloc": {
    "lat": 52.2385588707,
    "lng": -3.3761976476
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Llandrindod_Wells_lake_water_sculpture.jpg/512px-Llandrindod_Wells_lake_water_sculpture.jpg",
      "title": "John Stumbles [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Llandrindod Wells lake water sculpture"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/The_Lake%2C_Llandrindod_Wells_-_geograph.org.uk_-_1552590.jpg",
      "title": "Ann Roberts / The Lake, Llandrindod Wells, via Wikimedia Commons",
      "caption": "A view across the lake looking towards the Lakeside Restaurant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/River_Ithon%2C_Llandrindod_Wells_-_geograph.org.uk_-_1552612.jpg",
      "title": "Ann Roberts / River Ithon, Llandrindod Wells, via Wikimedia Commons",
      "caption": "River Ithon, Llandrindod Wells. The River Ithon is one of the many tributaries of the River Wye."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Llandrindod_Wells_%2826114850905%29.jpg/256px-Llandrindod_Wells_%2826114850905%29.jpg",
      "title": "Alex Liivet from Chester, United Kingdom [CC0], via Wikimedia Commons",
      "caption": "Little stream west of the town"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Llandrindod_Wells_%2826048331151%29.jpg/512px-Llandrindod_Wells_%2826048331151%29.jpg",
      "title": "Alex Liivet from Chester, United Kingdom [CC0], via Wikimedia Commons",
      "caption": "Town centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Llandrindod_Wells_%2825846758810%29.jpg/512px-Llandrindod_Wells_%2825846758810%29.jpg",
      "title": "Alex Liivet from Chester, United Kingdom [CC0], via Wikimedia Commons",
      "caption": "Llandrindod Wells town"
    }
  ],
  "distance_km": 8.0,
  "description": "This circular walk takes you around the victorian spa town of Llandrindod Wells in the Cambrian Mountains. You'll explore the area to the east of the town, visiting the pretty lake and the River Ithon. There's also some climbs to viewpoints where you can enjoy fine views over the town and the surrounding countryside. The town is accessible by rail from Swansea and Shrewsbury via its station on the Heart of Wales Line. The walk starts next to the museum in the town centre and heads south east to Llandrindod lake. The attractive man-made lake is used for fishing and model boating. It houses a sculpture of a water serpent and leaping carp, the scales of which are made of thousands of copper plates initialled by local people and visitors during construction of the work. Next to the lake, there is a distinctive tree-trunk sculpture known as a 'Llandoddie', one of several such sculptures distributed throughout the town. After passing the lake you continue east through woodland, before climbing to a viewpoint above the town. You then descend to Llanoley before following woodland trails north to the River Ithon. There's some nice footpaths here running along both sides of the river. You then leave the river to follow a mixture of country lanes and birdleway tracks west to Noyadd. The route then heads through the town to visit a nice area by the river just to the west of the town. There's a little park here with some stepping stones so its a nice picturesque spot. Head a few miles west of the town and you can continue your walking on the Wye Valley Walk. The waymarked trail can be picked up around Newbridge-on-Wye and can be followed either north or south along the river. Head a few miles north west and you can visit the attractive town of Rhayader and visit the lovely Elan Valley Reservoirs on the circular Rhayader Dams Walk .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Llanerch Inn is a pub of some note and worth some investigation. The historic inn dates from the 16th century and includes a lovely large beer garden where you can sit outside on warmer days. There's a good menu and the inn also does accommodation if you need to stay over. You can find the inn on Llanerch Lane with a postcode of LD1 6BZ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Heart of Wales Line Trail passes through the town. The 143 mile trail explores the Heart of Wales Railway Line, a wonderful rural railway running between Swansea and Shrewsbury. The trail visit several train stations, old railway lines and photogenic railway viaducts. If you were to follow the trail south west for a few miles it would take you to nearby Newbridge-on-Wye where there are some lovely river views. For more walking ideas in the area see the Cambrian Mountains Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/awzAEbMNT7s",
  "postcode": "LD1 5HA",
  "district": "Llandrindod",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Surgery, Spa Road East, Llandrindod Wells, Llandrindod, Powys, Cymru / Wales, LD1 5HA, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "country lane"
  ],
  "points_of_interest": [
    "viewpoint",
    "lake",
    "park"
  ],
  "facilities": [
    "visitor center",
    "dog friendly",
    "car park",
    "play area"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}