{
  "created_at": "2025-01-06T03:22:28.007086+00:00",
  "objectID": "b377a5f27f5582099b6d186c99f40598",
  "ref": "brockenhurst-walking-route",
  "title": "Brockenhurst Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Lymington_River_-_geograph.org.uk_-_62639.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b377a5f27f5582099b6d186c99f40598.gpx",
  "_geoloc": {
    "lat": 50.820685231,
    "lng": -1.5530862286
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Lymington_River_-_geograph.org.uk_-_62639.jpg",
      "title": "Ron Strutt [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Lymington River"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Mill_Lane_bridge_on_the_Lymington_River%2C_New_Forest_-_geograph.org.uk_-_170816.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Mill Lane bridge on the Lymington River. A view from the eastern bank of the river, just south of the Mill Lane bridge east of Brockenhurst. The bridge carries the B3055 (Mill Lane) across the Lymington River. In the foreground on the right is the inevitable length of blue rope hanging from a tree over the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Path_along_the_edge_of_Lymington_River%2C_New_Forest_-_geograph.org.uk_-_408541.jpg/256px-Path_along_the_edge_of_Lymington_River%2C_New_Forest_-_geograph.org.uk_-_408541.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Path along the edge of Lymington River. The trees on this bank of the Lymington River show a definite lean in towards the river. One of the smaller trees has fallen across the river, although it is clear of the water's surface and has not created a debris dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Pignal_Inclosure_from_Standing_Hat%2C_New_Forest_-_geograph.org.uk_-_121302.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Pignalhill Inclosure from Standing Hat, New Forest. The Forestry Commission car park at Standing Hat provides the most convenient access to the vast area of enclosures northwest of Brockenhurst. This view over a gate into the Pignal Inclosure shows two of the off-road cycle paths which (being gravelled) provide a dry winter walk through the plantations. The path on the left eventually leads to Clayhill south of Lyndhurst. There is some distortion at the edges due to the slightly \"wide angle\" lens on my compact camera."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Ponies_grazing_on_Balmer_Lawn%2C_New_Forest_-_geograph.org.uk_-_121305.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ponies grazing on Balmer Lawn. Balmer Lawn, to the northwest of Brockenhurst, is a large area of open lawn surrounded on three sides by woodland. The area was once far wetter and as a result of partial drainage and some shrinkage of the ground, the old purple moor grass tussocks have consolidated and with grazing have given the unusual 'hummock-scape' seen here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Footbridge_over_ditch_-_geograph.org.uk_-_773131.jpg",
      "title": "Hugh Venables [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Footbridge over ditch"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Standing_Hat_-_geograph.org.uk_-_1637789.jpg",
      "title": "Shaun Ferguson [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Standing Hat"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Wet_pony_at_Standing_Hat%2C_New_Forest_-_geograph.org.uk_-_121258.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Wet pony at Standing Hat. Between Balmer Lawn and the Pignal Inclosures is a area of open woodland called Standing Hat (a holly and oak holm). This photo is looking south from the Forestry Commission car park (closed to give the site a rest in the winter), towards one of the private dwellings in the Pignalhill Inclosure. The pony in the picture is wearing a reflective collar, which will make it a lot easier for Forest motorists to spot at night."
    }
  ],
  "distance_km": 10.5,
  "description": "The large village of Brockenhurst is a popular base for walkers wishing to explore the New Forest. The train station also makes it easily accessible with regular trains from London, Bournemouth and Poole. This circular walk explores the woodland to the east of the village, visiting Lymington Water, the Perrywood Ironshill Inclosure, the New Copse Inclosure, Standing Hat and Balmer Lawn. You can start off from the car park at Ivy Wood and then follow footpaths south along the river before turning east into the woods. The paths will take you towards the campsite at Lodge Heath before passing the Ladycross Inclosure. The route then turns west to the Pignalhill Inclosure, visiting Standing Hat and Balmer Lawn. The large lawn is a good place to see ponies grazing and the site of the Balmer Lawn Hotel. The impressive hotel dates from the early 19th century. It has hosted many famous guests including King George V, Winston Churchill and U.S. General Dwight D. Eisenhower. The route then returns to Standing Hat before heading through the Perrywood Ivy Inclosure and returning to Brockenhurst.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east you'll find Denny Wood. It's a peaceful area of the forest with good walking and cycling paths to try. Deer and ponies are often spotted here because of the tranquil nature of the area. About a mile to the west is the popular Puttles Bridge where you can enjoy a walk along the pretty Ober Water and visit the beautiful grounds of the Rhinefield House hotel. The hotel is a splendid place for afternoon tea before a stroll around the ornamental gardens. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ACt6cXpFh08",
  "county": "Hampshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}