{
  "created_at": "2025-01-06T01:02:32.427417+00:00",
  "objectID": "b3aae8b6e3a6f3539158891dd2e87810",
  "ref": "burley-new-forest-walking-route",
  "title": "Burley New Forest Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Burley_New_Inclosure_-_geograph.org.uk_-_19815.jpg",
  "nearby": [
    {
      "description": "Blackwater Arboretum Trail",
      "objectID": "e5486df8d508cf9f7a51b2f5a438b74d",
      "ref": "blackwater-arboretum-trail-walking-route"
    },
    {
      "description": "Ober Water",
      "objectID": "f33d92d77a3eddb8eae568927488c7a4",
      "ref": "ober-water-walking-route"
    },
    {
      "description": "Knightwood Oak",
      "objectID": "2e7f813af716643f3cd00f37b0871424",
      "ref": "knightwood-oak-walking-route"
    },
    {
      "description": "Wilverley Plain",
      "objectID": "873ccc30c41d7a93728a43b79dec1af9",
      "ref": "wilverley-plain-walking-route"
    },
    {
      "description": "Holmsley",
      "objectID": "558ef54a5ddbe6f7846f25ec42a77fd1",
      "ref": "holmsley-walking-route"
    },
    {
      "description": "Bransgore",
      "objectID": "92f9b62c7c476188deb7dad54e2e90c4",
      "ref": "bransgore-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b3aae8b6e3a6f3539158891dd2e87810.gpx",
  "_geoloc": {
    "lat": 50.8394190299,
    "lng": -1.6781328708
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Burley_New_Inclosure_-_geograph.org.uk_-_19815.jpg",
      "title": "Kevin Danks [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Burley New Inclosure. This kind of mixed woodland is typical of the older inclosures, dating from the 18th and 19th centuries. Oak, Beech, Sweet Chestnut and Silver Birch predominate in much of this inclosure, with stands of Douglas Fir and other conifers scattered here and there."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Deer_in_Burley_New_Inclosure%2C_New_Forest_-_geograph.org.uk_-_341853.jpg/256px-Deer_in_Burley_New_Inclosure%2C_New_Forest_-_geograph.org.uk_-_341853.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Deer in the New Inclosure.These deer are two of many stood still deep in the trees of Burley New Inclosure. The white rump of the deer on the right is very obvious, and both have dark winter coats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Gateway_to_Burley_New_Inclosure%2C_New_Forest_-_geograph.org.uk_-_341859.jpg",
      "title": "Jim Champion [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Gateway to Burley New Inclosure. This new gate leads into the New Inclosure from Dames Slough Inclosure. The track is also an off-road cycle route - the post on the right in the foreground is a marker for cyclists."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Burley_Old_Inclosure_-_geograph.org.uk_-_19816.jpg",
      "title": "Kevin Danks / Burley Old Inclosure",
      "caption": "Burley Old Inclosure. Earth banks are found all over the New Forest, marking the boundaries of inclosures. This one is at the western edge of Burley Old Inclosure, which is one of the few places where anything of the original 1700 planting remains. The bank probably dates from the very end of the 17th century or the early 18th."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Burley_Outer_Rails%2C_New_Forest_-_geograph.org.uk_-_341666.jpg",
      "title": "Jim Champion / Burley Outer Rails, New Forest",
      "caption": "Burley Outer Rails. Looking towards Longmead Cottage from the edge of the Outer Rails Inclosure near the bridge over Blackensford Brook. The power line on the right leads to Woolfield Cottage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Burley_Manor_-_geograph.org.uk_-_654126.jpg",
      "title": "Gillian Moy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Burley Manor, a rather fine place for some post walk refreshments. This manor is now a hotel but parts of the estate are said to have been laid out in Saxon times and must have existed before the Domesday Book was compiled in 1086. Later, for nearly 200 years, Burley was a Royal Manor. The current building was erected in 1852, with the restaurant and bedroom wing being added some 80 years later. During World War Two, the hotel was requisitioned and used as a military headquarters. It sits in an excellent location next to Burley Park where there is a large herd of red deer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Burley%2C_looking_along_Ringwood_Road_-_geograph.org.uk_-_177394.jpg",
      "title": "Peter Facey / Burley, looking along Ringwood Road",
      "caption": "Nice view of the village, looking along Ringwood Road. Bransgore Road and the Burley Inn off to the left. The drive to Burley Manor Hotel in distance right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Back_of_the_bus_shelter%2C_Station_Road%2C_Burley%2C_New_Forest_-_geograph.org.uk_-_624612.jpg",
      "title": "Jim Champion / Back of the bus shelter, Station Road, Burley, New Forest",
      "caption": "Back of the bus shelter. Station Road goes off to the right towards the disused station at Holmsley, now a cafe. To the left it goes to Burley village centre, past the golf course and cricket pitch. The bus stop serves the Bisterne Close end of the village, and the Youth Hostel on Cott Lane."
    }
  ],
  "distance_km": 6.5,
  "description": "Enjoy a series of nice footpaths through the Old and New Burley Inclosures in the New Forest. The village of Burley is a popular spot with a number of good options for walkers. You could start from the village but this circular route begins from the car park off Lyndhurst Road, just to the north east of Burley. From here you can pick up the trails heading east through the New Inclosure to Dames Slough Inclosure and Blackwater Bridge. The route returns through the Old Inclosure, passing Cockroad Hill on the way. The route takes place on generally good quality paths with the chance of seeing deer and ponies on the way. Just to the east of this route you can pick up the splendid Blackwater Arboretum Trail. The trail is lined with majestic Douglas fir trees which are among the tallest and oldest trees in Britain. Also near Burley is the Knightwood Oak where you will find the largest oak tree in the forest. The lovely Ober Water is located just a mile or so south east of the Old Inclosure. You can follow some nice waterside footpaths here.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head into Burley village and you will find Burley Manor. The main draw here is an outdoor area where you can enjoy views over the adjacent deer park. It's a great place to relax with afternoon tea after your exercise. They also do excellent Mediterranean food if you fancy something more substantial. The Manor building itself is noteworthy too, being Grade II listed and dating back to 1852. You can find them at 1 Ringwood Rd with a postcode of BH24 4BS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails are ideal for a dog walk and Burley Manor mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a couple of miles due south of the inclosures you'll find Wilverley Plain and Inclosure. There are some lovely walks here across the open grassy plain and through the attractive woodland of the inclosure. You'll also see ponies grazing on the plain most of the time. Next to that there's the Holmsley Bog and Inclosure to explore. This area includes a cycling and walking trail along the old Southampton and Dorchester Railway Line. Here you'll also find the interesting Station House Tea Rooms set in the old Holmsley Station. This is a must see for railway enthusiasts visiting the area. For an alternative walk around the village see the excellent video below. Just west of the village you could pick up the Bransgore Walk. This takes you across the Dur Hill Inclosure, the Kingston Great Common National Nature Reserve before climbing to the viewpoints at Vereley Hill and Picket Plain. For more walking ideas in the area see the New Forest Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/V6LCADQqBgM",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lucy Hill, Mill Lane, Burley, New Forest, Hampshire, England, BH24 4HP, United Kingdom",
  "postcode": "BH24 4HP",
  "district": "New Forest",
  "state": "England"
}