{
  "objectID": "b3f9594665a788ff25391ffb8f4aafa3",
  "created_at": "2024-12-18T12:56:18.505118+00:00",
  "ref": "old-winchester-hill-walking-route",
  "title": "Old Winchester Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/27/Juniper_bushes_on_the_south-facing_rampart_of_Old_Winchester_Hill_-_geograph.org.uk_-_189806.jpg",
  "nearby": [
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Meon Valley Trail",
      "objectID": "a21fecb9783b960a6f62a0acc000670d",
      "ref": "meon-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Monarch's Way",
      "objectID": "d93d80d113c805cab65643061a5416c2",
      "ref": "monarchs-way-walking-route"
    },
    {
      "description": "Meonstoke",
      "objectID": "2fa0bc8f86175f1fbd9bbba4363dbc18",
      "ref": "meonstoke-walking-route"
    },
    {
      "description": "Beacon Hill Hampshire",
      "objectID": "d6f59b3627b08ce62fdac2a36e39605e",
      "ref": "beacon-hill-hampshire-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b3f9594665a788ff25391ffb8f4aafa3.gpx",
  "_geoloc": {
    "lat": 50.9827791165,
    "lng": -1.1279042124
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Juniper_bushes_on_the_south-facing_rampart_of_Old_Winchester_Hill_-_geograph.org.uk_-_189806.jpg",
      "title": "Jim Champion / Juniper bushes on the south-facing rampart of Old Winchester Hill",
      "caption": "Juniper bushes on the south-facing rampart. As with much of the South Downs chalkland, the southern side of Old Winchester Hill has a much more gentle gradient than the northern side. The iron-age hillfort has a single bank(left), ditch (centre) and counterscarp bank (right) which would have been much steeper/deeper/whiter when first constructed. Now the top of the hill is part of a National Nature Reserve. The bushes on the left are juniper, a slow growing shrub. These specimens are not too old - perhaps they were able to grow to a reasonable size on this grassland as a result of the reduced grazing pressure during the myxomatosis outbreaks in the mid 20th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Sunny_November_day_on_Old_Winchester_Hill_-_geograph.org.uk_-_943278.jpg",
      "title": "Eleanor Oakley / Sunny November day on Old Winchester Hill",
      "caption": "Sunny November day on the hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Northwest-facing_scarp_of_Old_Winchester_Hill_-_geograph.org.uk_-_188163.jpg",
      "title": "Jim Champion / Northwest-facing scarp of Old Winchester Hill",
      "caption": "Northwest-facing scarp. This path leads from the hillfort's eastern entrance down and along the northern escarpment of the chalk spur of Old Winchester Hill. The dark wooded areas are yew woodland, fenced off from the grazed slopes to prevent sheep poisoning themselves. The main spine of the South Downs chalk ridge can be seen in the background on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Sun-dappled_yew_woodland_on_Old_Winchester_Hill_-_geograph.org.uk_-_189816.jpg",
      "title": "Jim Champion / Sun-dappled yew woodland on Old Winchester Hill",
      "caption": "Sun-dappled yew woodland. Within the National Nature Reserve there are a variety of chalk downland habitats, including ancient yew woodland like that shown in this photo. The evergreen canopy is so dense that very little light reaches the ground, leaving it devoid of plant life - this picture was taken on a very sunny summer's day and it was very shady and cool in the wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Temporary_route_to_Beacon_Hill_for_cyclists_and_horse_riders_on_the_South_Downs_Way_-_geograph.org.uk_-_1430838.jpg",
      "title": "Jim Champion / Temporary route to Beacon Hill for cyclists and horse riders on the South Downs Way",
      "caption": "Temporary route to Beacon Hill for cyclists and horse riders on the South Downs Way. In March 2009 a new temporary route for horse riders and cyclists was opened between Old Winchester Hill and Beacon Hill. This new route replaces the old temporary route that ran though Warnford. The South Downs Way website says \"The route has been changed to improve the safety of users until agreement can be reached on a permanent route across the valley ... The old route is still usable but is not recommended and is not signed as the South Downs Way.\" The temporary route is likely to be in place until March 2011. This view is the lower part of a permissive stretch of the route, just north of The White Way, leading to the summit of Beacon Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Chalk_grassland_within_Old_Winchester_Hill_fort_-_geograph.org.uk_-_188169.jpg/256px-Chalk_grassland_within_Old_Winchester_Hill_fort_-_geograph.org.uk_-_188169.jpg",
      "title": "Jim Champion / Chalk grassland within Old Winchester Hill fort",
      "caption": "Chalk grassland within Old Winchester Hill fort. The chalk grassland within the hillfort is maintained by sheep grazing and some mechanical clearing of scrub during the winter. The white line running from left to right beyond the buttercups is a foot-worn path along the hillfort's northern rampart. In the middle-distance is the path that skirts the northwest edge of the yew woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/View_of_the_Meon_Valley_from_Old_Winchester_Hill_-_geograph.org.uk_-_188125.jpg",
      "title": "Jim Champion / View of the Meon Valley from Old Winchester Hill",
      "caption": "View of the Meon Valley. This is the view northwest (3 photo panorama) from a little spur on the northern side of the hill, to the east of the hillfort. The black post on the left indicates left to the hillfort and right to the \"circular walk\" that leads back to the public car park (the chalky path can be seen to the left of the hillside yew woodland on the right of the photo). In the foreground are the flower-rich grasslands of the National Nature Reserve. The hill in the distance towards the left is Beacon Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Iron_age_hillfort_on_Old_Winchester_Hill_-_geograph.org.uk_-_24985.jpg",
      "title": "Jim Champion, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Iron age hillfort. Looking southwest at the iron-age ramparts on the hill, a spur of chalkland projecting into the Meon valley. Several large round barrows, which predate the defensive earthworks, can be seen on the ridge of the hill."
    }
  ],
  "distance_km": 14.0,
  "description": "This walk takes you up the 197 metres (646 ft) Old Winchester Hill in the South Downs. The hill and surrounding area is a National Nature Reserve with a wide variety of butterflies and wildlife to look out for. These include buzzards, kites, roe deer and foxes. The area is made largely of chalk grassland with extensive scrub and many orchid species. There is also an Iron Age hill fort and earlier Bronze Age barrows and burial mounds. This circular walk starts at the village of Meonstoke and makes use of the South Downs Way to take you to Old Winchester Hill before returning via Warnford and Beacon Hill. There are super panoramic views of the South Downs and the Meon Valley from the high points. On a clear day you may even be able to see the Isle of Wight. If you'd like to continue your walk then you could pick up the South Downs Way or the Monarch's Way which run past the hill.",
  "video_url": "https://www.youtube.com/embed/cX8102zlsJE",
  "district": "Corhampton",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}