{
  "created_at": "2025-01-06T05:15:09.686910+00:00",
  "objectID": "b451786f41e38ecb2e6c152dd4d271cc",
  "ref": "beaconsfield-walking-route",
  "title": "Beaconsfield Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Windsor_End_-_geograph.org.uk_-_162809.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b451786f41e38ecb2e6c152dd4d271cc.gpx",
  "_geoloc": {
    "lat": 51.612177679,
    "lng": -0.6429491838
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Windsor_End_-_geograph.org.uk_-_162809.jpg",
      "title": "Andrew Smith / Windsor End, via Wikimedia Commons",
      "caption": "Windsor End Beaconsfield. Cottages on the Hall Barn Estate. The larger house is Hall Barn 'Cottage'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Hodgemoor_Woods_%286934584384%29.jpg/512px-Hodgemoor_Woods_%286934584384%29.jpg",
      "title": "Timo Newton-Syms from Helsinki, Finland and Chalfont St Giles, Bucks, UK [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Moss covered tree stumps in Hodgemoor Woods, Chalfont St Giles"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Hodgemoor_Woods_%2813996111322%29.jpg/512px-Hodgemoor_Woods_%2813996111322%29.jpg",
      "title": "Timo Newton-Syms from Helsinki, Finland & Maidenhead, Berkshire, UK [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Hodgemoor Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Chalfont_St_Giles_%285865797579%29.jpg/512px-Chalfont_St_Giles_%285865797579%29.jpg",
      "title": "Timo Newton-Syms from Helsinki, Finland and Chalfont St Giles, Bucks, UK [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Green fields and light blue skies in Chalfont St Giles"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/The_Royal_Saracens_Head%2C_Beaconsfield_-_geograph.org.uk_-_2806585.jpg",
      "title": "The Royal Saracens Head, Beaconsfield by Ian S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Royal Saracens Head, Beaconsfield. Old Beaconsfield has a number of old coaching inns along a wide street of red brick houses and small shops. The town was the first stopping point on the road between London and Oxford, as it is equidistant between the two cities."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Beaconsfield_War_Memorial_-_geograph.org.uk_-_1126671.jpg",
      "title": "Colin Smith / Beaconsfield War Memorial",
      "caption": "Beaconsfield War Memorial. Outside the parish church on Windsor End. This wide street off the main road is still used for markets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Cross_in_Beaconsfield_Churchyard_-_geograph.org.uk_-_2196931.jpg",
      "title": "Cross in Beaconsfield Churchyard by Basher Eyre, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cross in Beaconsfield Churchyard"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Farmers%27_market%2C_Beaconsfield_%282%29_-_geograph.org.uk_-_2196950.jpg",
      "title": "Farmers' market, Beaconsfield (2) by Basher Eyre, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Farmers' market"
    }
  ],
  "distance_km": 18.0,
  "description": "This circular walk from Beaconsfield explores some lovely Chilterns countryside. You'll also visit the lovely Hodgemoor Woods and the interesting village of Chalfont St Giles. The 11 mile route uses a mixture of public footpaths, country lanes and a section of the South Bucks Way. The walk starts from the train station and heads north through the town to Brown's Wood near Knotty Green You then turn east to Owlsears Wood before coming to Hodgemoor. The 250 acre woods include lots of pretty bluebells in the spring and a healthy population of Muntjac Deer to look out for. Also keep your eyes peeled for tawny owls, buzzards, kites and numerous other woodland birds. After leaving the woods you come to Chalfont St Giles. The attractive village includes nice cottages with a duck pond fed by the River Misbourne. Other highlights include the church of Saint Giles which is of Norman architecture and dates from the 12th century. You can also visit the former home of John Milton, author of the epic poem 'Paradise Lost'. The house is now a open to the public as a museum and includes an extensive collection of 17th-century first editions of John Milton's works, both poetry and prose. There's a good selection of pubs and cafes so it makes an ideal stopping point for refreshments, at what is about the half way point of the walk. From the village you pick up the waymarked South Bucks Way long distance footpath. Follow it south and it takes you past Dibden Hill toward Chalfont St Peter. Here you turn west to follow paths through Jordans and Seer Green, where you pass the golf course before returning to Beaconsfield. To continue your walking around the Beaconsifield area you could pick up the Chiltern Way and the Chiltern Heritage Trail at Hodgemoor Woods. You could also visit the popular town of Amersham and try our Amersham Circular Walk .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Royal Saracens Head dates from the 18th century and serves good quality food. You can find them at postcode HP9 2JH. They are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east of the town you'll find Gerrards Cross where there's some nice trails on the town's common and a notable 17th century commonside pub to visit afterwards. Just to the south there's the neighbouring village of Wooburn Green. There's a pleasant large green here with a number of historic properties including a 16th century public house. There's also a pretty local park with walks along the River Wye and peaceful adjacent woodland. For more walking ideas in the area see the Chilterns Walks and the Buckinghamshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/SfY8wFwXtEM",
  "district": "Beaconsfield",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Caledon Close, Beaconsfield New Town, Beaconsfield, Beaconsfield and Chepping Wye Community Board, Knotty Green, Buckinghamshire, England, HP9 2DA, United Kingdom",
  "postcode": "HP9 2DA",
  "state": "England"
}