{
  "created_at": "2025-01-06T07:59:50.216526+00:00",
  "objectID": "b4a5a0d0f6ab6925028c188b823b9332",
  "ref": "dursley-walking-route",
  "title": "Dursley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Market_Place%2C_Dursley_-_geograph.org.uk_-_857097.jpg",
  "nearby": [
    {
      "description": "Stinchcombe Hill",
      "objectID": "68edbddf7f1f10c25470481bebf505ad",
      "ref": "stinchcombe-hill-walking-route"
    },
    {
      "description": "Tyndale Monument",
      "objectID": "4e3284c479536723f1fd9852243a039d",
      "ref": "tyndale-monument-walking-route"
    },
    {
      "description": "Wotton-under-Edge",
      "objectID": "ade920873f603a5230507d16f82d7138",
      "ref": "wotton-under-edge-walking-route"
    },
    {
      "description": "Coaley Peak",
      "objectID": "3f01bdd8224ef0b4186ee31fc8572fc0",
      "ref": "coaley-peak-walking-route"
    },
    {
      "description": "Woodchester Park",
      "objectID": "e7cd467bce60066811409e6dc0accda3",
      "ref": "woodchester-park-walking-route"
    },
    {
      "description": "Kingswood",
      "objectID": "208a8f1fafcb54b842fda873dd00ea8e",
      "ref": "kingswood-walking-route"
    },
    {
      "description": "Cam Peak Dursley",
      "objectID": "cc419b082b3e2b24e992ec637928d416",
      "ref": "cam-peak-dursley-walking-route"
    },
    {
      "description": "Uley Bury",
      "objectID": "a688898a1823fa48ae271bd0b7ab1605",
      "ref": "uley-bury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b4a5a0d0f6ab6925028c188b823b9332.gpx",
  "_geoloc": {
    "lat": 51.6816608541,
    "lng": -2.3539195223
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Market_Place%2C_Dursley_-_geograph.org.uk_-_857097.jpg",
      "title": "Philip Halling / Market Place, Dursley",
      "caption": "Market Place, Dursley. Dursley Market House is on the left and on the right is the splendid mid 18th century Georgian building which is now Lloyds Bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Dursley_geograph-3426978-by-Ben-Brooksbank.jpg/512px-Dursley_geograph-3426978-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank / Dursley: Long Street, 1990",
      "caption": "Dursley: Long Street, 1990. View eastward, with Downham Hill (653 ft.) on horizon. Note reflection in window on right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/View_from_Cam_Peak_-_geograph.org.uk_-_1476268.jpg",
      "title": "Philip Halling / View from Cam Peak",
      "caption": "View from Cam Peak. View across the vale of Berkeley from the summit of Cam Peak or Peaked Down. The River Severn can be seen along with May Hill on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Ashmead_Green_from_Cam_Long_Down%2C_Cotswolds_-_geograph.org.uk_-_1602186.jpg",
      "title": "Anthony O'Neil / Ashmead Green from Cam Long Down, Cotswolds",
      "caption": "Ashmead Green from Cam Long Down, Cotswolds. The River Severn can be seen in the distance and the Forest-of-Dean beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Uley_village_nestling_under_Uley_bury_-_geograph.org.uk_-_1014610.jpg",
      "title": "Roger / Uley village nestling under Uley bury",
      "caption": "Uley village nestling under Uley bury"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Uley_Bury_-_geograph.org.uk_-_316726.jpg",
      "title": "David Gruar / Uley Bury",
      "caption": "Uley Bury in the winter of 2007. An large Iron Age hill fort on a promontory at the edge of the Cotswold plateau. The site covers some 32 acres (13 hectares) and was occupied from around 300 BC to 100 AD. Its natural defensive potential was heightened by terracing the hillside, as can be seen on the right. More than just a defensive structure, this would have been a full-blown settlement - evidence of numerous houses have been found on the site, which is now used for grazing cattle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Owlpen_-_geograph.org.uk_-_427479.jpg",
      "title": "Derek Harper / Owlpen",
      "caption": "Owlpen. To the left of the manor is Holy Cross church, dramatically restored in the C19, and Court House (described by Verey (Pevsner) as a gazebo). Between the buildings is the yew parlour, a quadrangle of yews enclosing a little square where events were sometimes held. At the rear rises Owlpen Wood, part of the Cotswold scarp."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Owlpen_Manor_-_geograph.org.uk_-_427474.jpg",
      "title": "Derek Harper / Owlpen Manor",
      "caption": "Owlpen Manor. The central portion of the south facade is medieval, and is sandwiched between C17 and C18 wings. Behind the \"yew parlour\" to the left is part of Holy Cross church."
    }
  ],
  "distance_km": 11.7,
  "description": "The market town of Dursley is located in an excellent position on the edge of the Cotswolds escarpment and near to the countryside of the Severn Vale. As such it makes a great base for walkers with several hill climbs and river walks to try in the area. This circular walk from the town visits some of the highlights to the east of Dursley. You'll climb to the nature reserve at Cam Long Down, explore the Iron Age Hillfort at Uley Bury and pay a visit to the Tudor Manor house at Owlpen. It's a varied and historically interesting walk with excellent views from the elevated position of the Cotswold escarpment. The walk starts in the town where you can pick up the Cotswold Way and follow it east up to Cam Peak and Cam Long Down. There's excellent views over the fields to the River Severn from here. You continue east to Uley Bury. Here you'll find an impressive Iron Age hill fort dating from around 300 B.C. It stands approximately 750 feet (235 metres) above sea level so you can enjoy more fine views over the Severn Vale from here. After exploring the site the route descends into the little village of Uley. From Uley you head about half a mile east to visit the hamlet of Owlpen and its self named manor house. During the summer months you can explore the Tudor Manor House and its associated gardens for a fee. It's a beautiful place which also includes a fine circular walk around the early Georgian mill pond and lake. From Owlpen you retrace your steps to Uley before following other footpaths past the southern slopes of Downham Hill. You then turn north and south west to return to Dursley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Spot Inn is a fine choice for some post walk refreshments. The inn dates back to 1776 and includes a charming interior with low ceilings and comfortable connecting bar-rooms which are adorned with interesting \"breweriana\" from times gone by. The inn is also a CAMRA National Pub of the Year with a fine range of ales to choose from. Outside there's a lovely garden area where you can relax on warmer days. You can find the pub at 2 Hill Road with a postcode of GL11 4JQ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the walk are ideal for fit dogs. The Old Spot Inn mentioned above is also dog friendly. There's also some more woodland trails to the west of the town in Wesfield Wood and around Stinchcombe Hill."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the town you can enjoy another climb to Stinchcombe Hill. It's another great viewpoint which can easilty be reached from the town. Head south and you can visit the noteworthy Tyndale Monument. The 19th century monument is an impressive landmark standing at a height of 111 ft (34 m). It was built in honour of William Tyndale, a translator of the New Testament who was born in the area. Near here you can also pick up the circular Wotton-under-Edge which takes you through the farmland and woodland surrounding the town. It also passes the Newark Park estate with 700 acres of parkland, gardens and lakes to explore. Just south of Wotton-Under-Edge there's Kingswood where you could visit the 15th century Abbey Gatehouse. The historic site is owned by English Heritage and is all that survives of the former Cistercian abbey. Also of note is the National Trust's Woodchester Park where there's miles of footpaths taking your around the park's lakes and gardens. The climb to Coaley Peak is another fine way to stretch your legs. For more walking ideas in the area see the Cotswolds Walks page."
    }
  ],
  "county": "Gloucestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dursley Town Council, Castle Street, Dursley, Stroud, Gloucestershire, England, GL11 4BS, United Kingdom",
  "postcode": "GL11 4BS",
  "district": "Dursley",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "pasture"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "hillfort",
    "manor house"
  ],
  "facilities": [
    "visitor center",
    "footpaths"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}