{
  "created_at": "2025-01-06T03:14:40.295205+00:00",
  "objectID": "b4c0ef4c39031e1b9ab8f8b902166327",
  "ref": "kettering-walking-route",
  "title": "Walks in Kettering Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Variety_of_roofing_materials%2C_Weekley%2C_Northants_-_geograph.org.uk_-_151234.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b4c0ef4c39031e1b9ab8f8b902166327.gpx",
  "_geoloc": {
    "lat": 52.3993766982,
    "lng": -0.706352072
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Variety_of_roofing_materials%2C_Weekley%2C_Northants_-_geograph.org.uk_-_151234.jpg",
      "title": "John Stolarski / Variety of roofing materials, Weekley, Northants",
      "caption": "Variety of roofing materials, Weekley, Northants Three 'traditional' materials in a row: clay pantiles in the foreground, thatch on the cottages and Collyweston 'slate' in the distance. This 'slate' is in fact a variety of Jurassic limestone, and gets its name from the village of Collyweston SW of Stamford, Lincs,"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/War_Memorial%2C_Weekley-geograph-2546715.jpg",
      "title": "Richard Croft / War Memorial",
      "caption": "Weekley war memorial by St.Mary's church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Old_Post_Office_team_rooms%2C_Weekley_-_geograph.org.uk_-_1411271.jpg",
      "title": "Nicholas Mutton / Old Post Office team rooms, Weekley",
      "caption": "Old Post Office team rooms, Weekley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Lime_Tree_Avenue%2C_Boughton_Park_-_geograph.org.uk_-_152671.jpg",
      "title": "John Stolarski / Lime Tree Avenue, Boughton Park",
      "caption": "Lime Tree Avenue, Boughton Park. When Boughton House was built, the Duke of Buccleuch of the time had a grand scheme to plant an avenue of trees all the way to London (70 miles). They got about 1.5 miles!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Boughton_House_2.jpg/256px-Boughton_House_2.jpg",
      "title": "Euan Myles / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Boughton House 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Jessica%27s_Tea_Shop..._%28and_post_office%29.JPG/256px-Jessica%27s_Tea_Shop..._%28and_post_office%29.JPG",
      "title": "Mickyflick / CC BY-SA (https://creativecommons.org/licenses/by-sa/3.0)",
      "caption": "Jessica's Tea Shop. Located in the beautiful village of Weekley, on the Duke of Buccleuch's Boughton Estate, near Kettering in Northamptonshire, England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Wicksteed_Park_-_geograph.org.uk_-_472404.jpg",
      "title": "Dot Potter / Wicksteed Park",
      "caption": "Wicksteed Park 1. The park to the South of the town is immaculately kept and busy with locals and tourists all of the time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Wicksteed_Park_-_geograph.org.uk_-_472410.jpg",
      "title": "Dot Potter / Wicksteed Park",
      "caption": "Wicksteed Park 2. Looking down over the parkland towards the lakes which are in the distance in front of the trees."
    }
  ],
  "distance_km": 8.0,
  "description": "This walk from the Northamptonshire town of Kettering takes you along the River Ise to the nearby Boughton House. The walk starts on the eastern fringes of the town where you can pick up a public footpath and follow it north toward Warkton, with a riverside footpath along the way. The walk continues north west through Weekley before coming to Boughton Park. There's nice views from the footpath over the estate which is open at certain times of the year (typically bank holiday weekends in the summer months). Inside the grounds you will find 18th-century landscaped gardens, woodlands and a grand country park. The house is also stunning being labelled ‘The English Versailles’. Inside you'll find one of Britain’s most outstanding collections of fine art, furniture, tapestries, porcelain and carpets. There's also paintings by El Greco and Gainsborough in the extensive art gallery. After enjoying the views of the park you can return to Kettering along the same paths. You could also continue along the roadside to Geddington if you have time.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Peacock is a good choice for some post walk refreshments. They serve good quality food and have a great garden area as well. You can find them at Lower Street with postcode NN16 8DH for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walks in Kettering head to Wicksteed Park on the southern fringes of the town. There's pretty gardens and a nice lake to stroll around here. You can find the park at Barton Road with a postcode of NN15 6NJ for your sat navs. Head east from the town and you can visit Thrapston where you'll find the Titchmarsh Nature Reserve. There's several lakes and lots of wildlife to see here. You can also pick up the Nene Way in this area and enjoy riverside walks along the River Nene. Just to the south are the villages of Orlingbury and Little Harrowden where you will find a noteworthy church dating back to the 12th century. For more walking ideas in the area see the Northamptonshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wq0HQ4pK964",
  "district": "Kettering",
  "county": "North Northamptonshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "East Walk, The Grange, Kettering, North Northamptonshire, England, NN15 7AG, United Kingdom",
  "postcode": "NN15 7AG",
  "state": "England"
}