{
  "created_at": "2025-01-06T00:27:28.458700+00:00",
  "objectID": "b55e1a8e10ab51aa911f3c2f3e438a6c",
  "ref": "henley-in-arden-circular-walk-walking-route",
  "title": "Henley in Arden Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/77/Stratford_upon_Avon_Canal%2C_Preston_Bagot_-_geograph.org.uk_-_461573.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b55e1a8e10ab51aa911f3c2f3e438a6c.gpx",
  "_geoloc": {
    "lat": 52.292009615,
    "lng": -1.7818279366
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Stratford_upon_Avon_Canal%2C_Preston_Bagot_-_geograph.org.uk_-_461573.jpg",
      "title": "Stephen McKay [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Stratford Upon Avon Canal at Preston Bagot"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Henley-in-Arden_-_William_Jameshouse.jpg/512px-Henley-in-Arden_-_William_Jameshouse.jpg",
      "title": "By flamenc (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Henley in Arden architecture"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Yarningale_Aqueduct_-_geograph.org.uk_-_358120.jpg",
      "title": "Peter Wasp [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Yarningale Aqueduct"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Narrowboats_pass_through_Lowsonford_lock_-_geograph.org.uk_-_474097.jpg",
      "title": "Trevor Rickard [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Narrowboats pass through Lowsonford lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Claverdon%2C_Henley_Road_-_geograph.org.uk_-_3548241.jpg",
      "title": "Claverdon, Henley Road by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Claverdon. The historic settlement includes several 16th and 17th century half-timbered cottages and a noteworthy church which includes an English Gothic architecture bell tower dating back to the 15th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Henley-in-Arden_-_geograph.org.uk_-_1914454.jpg",
      "title": "Henley-in-Arden by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Henley-in-Arden Main Street and church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Henley-in-Arden_Market_Cross_-_geograph.org.uk_-_2547864.jpg",
      "title": "Henley-in-Arden Market Cross by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Market Cross and the Black and White bank in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Henley-in-Arden_Heritage_Centre_-_geograph.org.uk_-_3728581.jpg/512px-Henley-in-Arden_Heritage_Centre_-_geograph.org.uk_-_3728581.jpg",
      "title": "Henley-in-Arden Heritage Centre by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Henley-in-Arden Heritage Centre"
    }
  ],
  "distance_km": 10.5,
  "description": "This circular walk explores the villages, rivers, canals and countryside surrounding the charming town of Henley in Arden in Warwickshire. It makes use of the Heart of England Way and the Stratford Upon Avon Canal to explore the area on good, waymarked footpaths. The walk starts in the attractive town centre where you will find the magnificent one mile high street with its collection of medieval buildings. Look out for several 15th, 16th and 17th century timber walled buildings, including the fine Guildhall. After admiring the architecture, the route then leaves the town, following the Heart of England Way in a north easterly direction towards Lowsonford. Here you pick up the canal towpath and follow it south towards the village of Preston Bagot. You'll pass the Yarningale Aqueduct, spanning the Kingswood Brook near the village of Claverdon. The route then heads through the countryside on public footpaths, returning to the town, via the site of the Norman Beaudesert Castle. The Arden Way long distance trail starts in the town. This is an excellent way of exploring the beautiful Forest of Arden, visiting Studley Castle, Coughton Court and the River Arrow. If you head south to Wootton Wawen, you can pick up the Monarch's Way. Here you can enjoy a nice walk along the River Alne. The Warwickshire Millennium Way also passes through the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Nags Head is a Grade II listed pub dating back to the 16th century. You can find the old black and white pub on the High Street at postcode B95 5BA for your sat navs. They serve real ale, quality meals and also have a pleasant garden area. Also on the High Street is the White Swan, another historic pub dating to 1550. Charles II, William Shenstone and John Byng have all stayed here and it was once run by the actor Michael Elphick. Also of note is a carved daisy wheel in the beam of a cottage attached to the pub, a common 16th & 17th century symbol to ward off witches and evil, usually carved by a child. They are located at postcode B95 5BY. On the route you could stop in Lowsonford at the noteworthy Fleur De Lys. The pub is well known for its quality pies and its delightful canalside garden. It's a great spot to relax and watch the boats go by on a fine day. The pub has some history too, dating back to the 16th century with a charming old interior which includes wooden beams, a real fire and quirky corners. You can find them on Lapworth Street with postcode B95 5HJ for your sat navs. They have a car park and are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south of the town you could pick up the circular Wootton Wawen Walk and visit the Edstone Aqueduct, the longest cast iron aqueduct in England. The route takes you along the canal towpath and the River Alne while also visiting the interesting settlement of Wilmcote. Here you'll find the historic 16th century house of Shakespeare's mother at Mary Arden's Farm. There's a working tudor farm here with many rare breed animals to see. Just to the north west there's the neighbouring village of Tanworth-in-Arden. Here you can enjoy a circular walk around the grounds of the 17th century Umberslade Hall. The village itself is also worth exploring with its picturesque village green and 14th century church. For more walking ideas in the area see the Warwickshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/NSFfVDMQNqM",
  "postcode": "B95 5JE",
  "district": "Stratford-on-Avon",
  "county": "Warwickshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "5, Brook End Close, Henley-in-Arden, Stratford-on-Avon, Warwickshire, England, B95 5JE, United Kingdom",
  "state": "England"
}