{
  "created_at": "2025-01-06T01:13:33.709353+00:00",
  "objectID": "b57d5ffb9e3430ffdcf2eacc57c80de4",
  "ref": "twyford-wood-walking-and-cycle-route",
  "title": "Twyford Wood Colsterworth Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/81/Twyford_Wood_-_geograph.org.uk_-_184092.jpg",
  "nearby": [
    {
      "description": "Grantham Canal",
      "objectID": "2d87caf5b0bd65ab4baa4bd0c91e88f1",
      "ref": "grantham-canal-walking-route"
    },
    {
      "description": "Viking Way",
      "objectID": "78956b3cfa21f626c540fd93bec83413",
      "ref": "viking-way-walking-route"
    },
    {
      "description": "Culverthorpe",
      "objectID": "65e6164f0145b60ffff2d668e1fa48be",
      "ref": "culverthorpe-walking-route"
    },
    {
      "description": "Grimsthorpe Castle",
      "objectID": "6e672e847e527eb60330b2e0de118f93",
      "ref": "grimsthorpe-castle-walking-route"
    },
    {
      "description": "Empingham",
      "objectID": "b195bb22510f833470341df12f238258",
      "ref": "empingham-walking-route"
    },
    {
      "description": "Clipsham",
      "objectID": "8a4f45fa34c2590778e6c0a5d1fdbbbf",
      "ref": "clipsham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b57d5ffb9e3430ffdcf2eacc57c80de4.gpx",
  "_geoloc": {
    "lat": 52.8034389082,
    "lng": -0.5987117649
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Twyford_Wood_-_geograph.org.uk_-_184092.jpg",
      "title": "Michael Patterson / Twyford Wood, via Wikimedia Commons",
      "caption": "The 1940s map calls this Twyford Forest and although it doesn't appear to be any smaller today it has clearly been downgraded in its status."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/A_walk_through_Twyford_Wood%2C_No_8_-_geograph.org.uk_-_272102.jpg",
      "title": "Kate Jewell / A walk through Twyford Wood: No 8, via Wikimedia Commons",
      "caption": "Light at the end of the tunnel. The woodland is very dense in this part of Twyford Wood with beech trees on the right and pine on the left of the path. As the path turns the corner in the centre of the photograph the trees thin out and let more light in."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/A_walk_through_Twyford_Wood%2C_No_1_-_geograph.org.uk_-_272030.jpg",
      "title": "Kate Jewell / A walk through Twyford Wood: No 1, via Wikimedia Commons",
      "caption": "Twyford Wood (or \"Forest\" as mentioned on the 1940's map) was requisitioned by the RAF in the early 1940s and cleared for the construction of North Witham Airfield. After the site was sold back to the Forestry Commission twenty years later the wood was replanted with conifers and deciduous trees, mainly oak. The concrete runways and perimeter roads still run through the site making it a great place for walking and cycling in all weathers. There is a car park off the Bourne Road, just east of the Colsterworth turn on the A1. Take the main track into the woodland and follow the many routes through the trees and open areas."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/A_walk_through_Twyford_Wood%2C_No_12_-_geograph.org.uk_-_272136.jpg",
      "title": "Kate Jewell / A walk through Twyford Wood: No 12, via Wikimedia Commons",
      "caption": "The last of the sun turns the trees to a rich gold."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/A_walk_through_Twyford_Wood%2C_No_4_-_geograph.org.uk_-_272055.jpg",
      "title": "Kate Jewell / A walk through Twyford Wood: No 4, via Wikimedia Commons",
      "caption": "This part of the old North Witham Airfield is more recently planted with pine"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/A_walk_through_Twyford_Wood%2C_No_3a_-_geograph.org.uk_-_272041.jpg",
      "title": "Kate Jewell / A walk through Twyford Wood: No 3a, via Wikimedia Commons",
      "caption": "The eastern edge of the woodland can be seen here."
    }
  ],
  "distance_km": 4.0,
  "description": "This wood near Grantham has miles of footpaths taking you to conifer woodland, grassland and the lovely Twyford Wood butterfly glades. Here you can look out for dingy and grizzled skipper butterflies. The site is a former second world war airfield with a control tower and wide open runways which are good for cycling. There is a small car park at the northern end of the forest where you can pick up the trails. The woods are very close to Colsterworth and Woolsthorpe-by-Colsterworth, the birthplace of Sir Isaac Newton. Here you can visit the 17th-century limestone house of Woolsthorpe Manor which is owned by the National Trust. This is said to be the site where Newton, observing an apple fall from a tree, was inspired to formulate his law of universal gravitation. The village and manor are only about a mile from the woods. It's a nice place to go for refreshments and to learn about the history of the area after your walk. The Viking Way passes through nearby Buckminster so this is a good option if you'd like to extend your walking in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "To the west of the woods you will find the village of Colsterworth where there are some good options for post walk refreshments. You could head to the White Lion which includes a fully licensed restaurant with home cooked food and a wide selection of Beers, Guest Beers, Lagers and Wines. There's also a beer garden to relax in on warmer days. You can find the pub at postcode NG33 5NE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "There's lots of good trails for you and your dog in the woods."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east is the historic Grimsthorpe Castle where there's miles of woodland and parkland surrounding a fine country house. Head north into Grantham and you'll find one of the highlights of the area at the splendid Belton House. The National Trust owned property includes 1300 acres of parkland surrounding a fine country house. You can also pick up the Grantham Canal near here. A few miles to the south there's the delightful village of Exton. There's a pleasant circular walk here taking you around the parkland of the old Exton Hall before visiting the two pretty lakes at Fort Henry. Near here there's also Empingham where you can enjoy a stroll down to the dam at Rutland Water. Just to the south there's Clipsham where you can enjoy a stroll along the tranquil Yew Tree Avenue with its splendid topiary. The pretty village also includes an award winning pub for refreshments afterwards. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "postcode": "NG33 5JW",
  "county": "Lincolnshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}