{
  "created_at": "2025-01-06T01:54:18.435840+00:00",
  "objectID": "b57d4d3432f4e77e22779ef7fc49285d",
  "ref": "simonside-hills-walking-route",
  "title": "Simonside Hills Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/84/Welcome_to_the_Simonside_Hills_-_geograph.org.uk_-_872531.jpg",
  "nearby": [
    {
      "description": "Fontburn Reservoir",
      "objectID": "82d96ac2c28e80e32fdeea9d6a3ccc43",
      "ref": "fontburn-reservoir-walking-route"
    },
    {
      "description": "Cragside Country Park",
      "objectID": "5d44009a19e4c39db3a68490767c1861",
      "ref": "cragside-country-park-walking-route"
    },
    {
      "description": "St Oswald's Way",
      "objectID": "cdb9d3229e413d00e7a4e7b4b2ff2136",
      "ref": "st-oswalds-way-walking-route"
    },
    {
      "description": "Harwood Forest",
      "objectID": "82f81ec20a2ddc3f5d6493e2d699447e",
      "ref": "harwood-forest-cycle-route"
    },
    {
      "description": "Harbottle",
      "objectID": "78044d2725cc73985214462786f169ea",
      "ref": "harbottle-walking-route"
    },
    {
      "description": "Otterburn Ranges",
      "objectID": "a47cb9e29a5afa6abe3379af6101951b",
      "ref": "otterburn-ranges-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b57d4d3432f4e77e22779ef7fc49285d.gpx",
  "_geoloc": {
    "lat": 55.2831434764,
    "lng": -1.9188518578
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Welcome_to_the_Simonside_Hills_-_geograph.org.uk_-_872531.jpg",
      "title": "Graham Horn / Welcome to the Simonside Hills",
      "caption": "Welcome to the Simonside Hills. At the bottom of the steep path up Simonside is this information board."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Summit_cairn_on_The_Beacon%2C_Simonside_Hills_-_geograph.org.uk_-_1193429.jpg",
      "title": "Andrew Curtis / Summit cairn on The Beacon, Simonside Hills",
      "caption": "Summit cairn on The Beacon, Simonside Hills View west towards Simonside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Simonside_Hills_through_a_gate_-_geograph.org.uk_-_1483753.jpg",
      "title": "David Clark / Simonside Hills through a gate",
      "caption": "Simonside Hills through a gate. Looking towards Simonside from the side of the wood on the road over Wards hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Simonside_Car_Park_-_geograph.org.uk_-_1412797.jpg",
      "title": "Oliver Dixon / Simonside Car Park",
      "caption": "The car park on the minor road below Simonside, from which the ascent of this striking hill is usually made. The path in the foreground is also shared by the St Oswald's Way. The hill beyond is Birky Hill, site of many cup-and-ring marked stones."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Climbing_Simonside_-_geograph.org.uk_-_872536.jpg",
      "title": "Graham Horn / Climbing Simonside",
      "caption": "Climbing Simonside. The final ascent of Simonside is usually taken up this path. Alternatively a forestry road heads to the right, but takes you further away from the car park over Weather Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/In_Simonside_forest_-_geograph.org.uk_-_872488.jpg",
      "title": "Graham Horn / In Simonside forest",
      "caption": "In Simonside forest. A clear area between the planted trees reveals a steep sided valley with a burn gurgling away at the bottom beneath the bracken."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Simonside_Solar_Observatory%5E_-_geograph.org.uk_-_1193409.jpg",
      "title": "Andrew Curtis / Simonside Solar Observatory!",
      "caption": "Simonside Solar Observatory! The alignment of the long hole through this huge boulder below The Beacon has led to speculation that it was set up deliberately to track the sun. The hole looks to me to probably have a more natural origin; but then I haven't seen the setting sun over Yarnspath Law, 23 miles distant in the Cheviot Hills NT8813, shining through it on the Summer Solstice."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/In_Simonside_forest_-_geograph.org.uk_-_874100.jpg/256px-In_Simonside_forest_-_geograph.org.uk_-_874100.jpg",
      "title": "Graham Horn / In Simonside forest",
      "caption": "One of the marked trails descends to this bridge where it meets another of the trails. You still feel as though you are deep in the forest but are only 300 yards from the car park."
    }
  ],
  "distance_km": 11.0,
  "description": "The Simonside Hills are a fabulous place for walkers with miles of footpaths taking you through woodland and moorland to wonderful viewpoints. You'll pass interesting rock formations, rocky outcrops and acres of forest as you make your way through this wildly beautiful area of the Northumberland National Park. This circular walk starts at the parking area in Rothbury Forest and climbs to the 430m high Simonside Hill. From here there are wonderful views of the Cheviots, the River Coquet, Cragside Country Park and the Northumbrian coastline. You descend towards Harwood Forest before picking up the St Oswald's Way to return you to the car park. It's easy to continue your walking in the area by heading to the wonderful Cragside Country Park which is located just a few miles away. You could also continue along the St Oswald's Way deeper into Harwood Forest. You can also reach the hills from Rothbury town on our Rothbury Circular Walk. This includes lovely trails through Coquetdale and a visit to the interesting archaeological sites on Garleigh Moor above the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head a mile or so north of the hills and you'll come to the little village of Thropton. Here you'll find the excellent Three Wheat Heads Inn. The main advantage here is a wonderful large beer garden with wide ranging views of the surrounding countryside and hills. If the weather is fine it's the ideal spot to relax outside and enjoy a drink. The pub also has an interesting history, dating all the way back to the 18th century. They are dog friendly and do great food in the bar and the restaurant area. You can find the inn on Front Street at postcode NE65 7LR. A couple of miles east of the hills you'll find the remotely located The Gate at Forestburn Gate. The inn has a lovely cosy real fire and a beer garden for warmer days. You can find the pub on the B6342 road at a postcode of NE61 4PS for your sat navs. The pretty Fontburn Reservoir is nearby so you could nip down to the tranquil spot and enjoy a stroll along the water if you have time."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and surrounding woodland are ideal for a dog walk. The Three Wheat Heads in Thropton also welcomes pets."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles north west from the hills and you can pick up the circular Alwinton Walk. The route starts in the nearby little village and visits the River Alwin, River Coquet, the ruins of Harbottle Castle, West Wood and the excellent viewpoint at the Drake Stone. There's also a 12th century Norman church and a couple of classic old village pubs to visit in the area. From the village car park you can also pick up the circular Usway Burn - River Coquet - Upper Coquetdale Walk. The delightful villages of Elsdon and Otterburn are well worthy of a visit. The former includes an ancient church, a large village green, the remains of the old motte and bailey castle and a noteworthy Pele tower. The latter has nice trails along the pretty Otter Burn and the historic Otterburn Hall with its fine architecture and deer park. For more walking ideas in the area see the Northumberland Walks and the Northumberland National Park Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PkGt2cAtOHU",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hollinghill, Northumberland, North East, England, NE61 4PU, United Kingdom",
  "postcode": "NE61 4PU",
  "district": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "moorland"
  ],
  "points_of_interest": [
    "viewpoints",
    "rocky outcrops",
    "archaeological sites"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}