{
  "created_at": "2025-01-06T00:42:26.018494+00:00",
  "objectID": "b65b1207c04694366394cb64ab98c180",
  "ref": "dartmouth-and-the-dart-estuary-walking-route",
  "title": "Dartmouth and the Dart Estuary Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/74/Boats_at_Dartmouth_-_geograph.org.uk_-_1033666.jpg",
  "nearby": [
    {
      "description": "Dartmouth to Dittisham",
      "objectID": "1720ebcbf9c539413bcb0ea12f948c22",
      "ref": "dartmouth-to-dittisham-walking-route"
    },
    {
      "description": "Dart Valley Trail",
      "objectID": "3cd6658b220f3ff92f2c39acf0bb436f",
      "ref": "dart-valley-trail-walking-route"
    },
    {
      "description": "Coleton Fishacre",
      "objectID": "126b04fac500cf86ff6ead2f989ed5cb",
      "ref": "coleton-fishacre-walking-route"
    },
    {
      "description": "Blackpool Sands",
      "objectID": "1cbab6c10c7ae199fd0f8db166843b11",
      "ref": "blackpool-sands-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Slapton Ley",
      "objectID": "28824a83a65521fc3d0debc552889a76",
      "ref": "slapton-ley-walking-and-cycle-route"
    },
    {
      "description": "Tuckenhay",
      "objectID": "ec09f39d4f94dba9a880ca503aa529ee",
      "ref": "tuckenhay-walking-route"
    },
    {
      "description": "Kingswear to Greenway Walk",
      "objectID": "9f21ef4053b486c9006f9a5b94e48053",
      "ref": "kingswear-to-greenway-walk-walking-route"
    },
    {
      "description": "Stoke Fleming",
      "objectID": "c9dcaa4c761b606932db3157f172c45a",
      "ref": "stoke-fleming-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b65b1207c04694366394cb64ab98c180.gpx",
  "_geoloc": {
    "lat": 50.3511570305,
    "lng": -3.5782900461
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Boats_at_Dartmouth_-_geograph.org.uk_-_1033666.jpg",
      "title": "Derek Harper / Boats at Dartmouth",
      "caption": "Boats at Dartmouth. Looking across the ranks of moored vessels from the North Embankment. In the centre, 200 metres away, is the Resnova. Beyond, a steam train approaches Kingswear."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/The_Resnova_and_Hercules_-_geograph.org.uk_-_1032998.jpg",
      "title": "Derek Harper / The Resnova and Hercules",
      "caption": "The Resnova and Hercules The Resnova (centre left) is a floating inn, \"a 19th century steel Dutch Barge brought to Dartmouth thirty years ago and converted into a Floating Inn ... permanently moored in the centre of Dartmouth Harbour\". In the background, Hercules leads (backwards) Paignton & Dartmouth Steam Railway's service to Paignton along the Dart's edge, approaching Lower Noss Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Waterfront_by_the_higher_ferry%2C_Dartmouth_-_geograph.org.uk_-_1367993.jpg",
      "title": "Derek Harper / Waterfront by the higher ferry, Dartmouth",
      "caption": "Waterfront by the higher ferry, Dartmouth. Buildings alongside Dart Marina and by Sandquay Road, below the Britannia Royal Naval College, seen from the slipway for the higher ferry at Britannia Crossing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Britannia_Royal_Naval_College_from_Hoodown_-_geograph.org.uk_-_1367600.jpg",
      "title": "Derek Harper / Britannia Royal Naval College from Hoodown",
      "caption": "Britannia Royal Naval College from Hoodown. Looking across the Dart from Kingswear Footpath 30. Below the college are houses on Sandquay Road. The college was built between 1899-1905. \"Wrennian in style, Palladian in layout ... In 1863 the Admiralty stationed HMS Britannia in the Dart as a training ship for naval cadets. In 1865 she was joined by HMS Hindustan. By 1875 it was decided to build a land-based college, but the land was not acquired until 1896. Webb began work on the terraces for the main college in 1898 but, when 2 cadets died of influenza on Britannia, the sanatorium was built first. Edward VII laid the foundation stone of the college in 1902. The Hindustan was towed down to Plymouth in 1905 but the Britannia stayed until 1916.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Kingswear_Castle_and_the_mouth_of_the_Dart_-_geograph.org.uk_-_1353334.jpg",
      "title": "Derek Harper / Kingswear Castle and the mouth of the Dart",
      "caption": "Kingswear Castle and the mouth of the Dart. A view focussing on the castles almost facing each other across the Dart, and between which a chain could be stretched for protection in times of danger. The late C15 Kingswear Castle has been a holiday home for a century and a half. In the foreground is Mill Bay Cove, and Dartmouth appears above Kingswear Castle. The coast path runs through woodland along The Warren and offers few clear views of the coastline below; this, however, is a magnificent exception. The rocky section nearby is below Warren Cottage and Warren House; the inlet on this side of Kingswear Castle is Mill Bay Cove. Across the mouth of the River Dart are Dartmouth Castle and St Petrox church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/St_Petrox_church%2C_Dartmouth_-_geograph.org.uk_-_806859.jpg",
      "title": "Derek Harper / St Petrox church, Dartmouth",
      "caption": "St Petrox church, Dartmouth. The fifteenth-century church beside Dartmouth Castle, in a dramatic position above the River Dart."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Rocks_above_Combe_Point_-_geograph.org.uk_-_806463.jpg",
      "title": "Derek Harper / Rocks above Combe Point",
      "caption": "Rocks above Combe Point. A further clutch of rocks east of Combe Point. The view takes in the coast from Compass Cove to Blackstone Point, and then, across the mouth of the Dart, from Old Mill Cove to Outer Froward Point and the Mew Stone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Footbridge_near_Compass_Cove_-_geograph.org.uk_-_806729.jpg",
      "title": "Derek Harper / Footbridge near Compass Cove",
      "caption": "Footbridge near Compass Cove. This carries the South West Coast Path, here following Dartmouth Footpath 8, across a geo-type inlet cut into a raised beach between Compass Cove and Blackstone Point."
    }
  ],
  "distance_km": 9.0,
  "description": "Enjoy one of the finest areas of Devon on this waterside walk in Dartmouth. You'll visit the fascinating Dartmouth Castle before a coastal stretch to Warren Point and Little Dartmouth. The walk starts in the town centre and follows the South West Coast Path south along the river to Warfleet Creek where there is a stony beach and several small rockpools at low tide. Soon after you reach the 14th century Dartmouth Castle which has guarded the entrance to the Dart Estuary for centuries. For a fee you can explore the castle and grounds where there are nice woodland trails and fabulous views over the estuary. There's also the option to catch a ferry across the water where you can look out for the wide variety of water loving birds which visit the area. After leaving the castle you continue to Blackstone Point where you follow the coast path to Warren Point. You then head inland to Little Dartmouth before picking up the riverside path back into Dartmouth. If you would like to extend your walking in the Dartmouth area then you can catch the ferry to Kingswear and visit the splendid Coleton Fishacre Gardens. Continuing west along the coast path will take you to the beautiful beach at Blackpool Sands. You could also pick up the Dart Valley Trail and head north along the river to the little village of Dittisham. Here you can catch the Greenway Ferry and visit the wonderful Greenway Estate where Agatha Christie took her holidays.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you follow the coastal path south west you will soon come to a major highlight of the area at Slapton Ley and Slapton Sands in Torcross. This National Nature Reserve includes a stunning lagoon, a beautiful beach and a large variety of wildlife. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/DH77_UMzFxw",
  "postcode": "TQ6 9PS",
  "district": "Dartmouth",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}