{
  "created_at": "2025-01-06T02:59:40.678258+00:00",
  "objectID": "b67e1c391d17330efccd6853f798a9bc",
  "ref": "llanrwst-walking-route",
  "title": "Llanrwst Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Riverside_path_and_islet_on_River_Conwy_at_Llanrwst_-_geograph.org.uk_-_1492051.jpg",
  "nearby": [
    {
      "description": "Llyn Crafnant",
      "objectID": "8f0e5c5309b9d07d363aa5f4aad04824",
      "ref": "llyn-crafnant-walking-route"
    },
    {
      "description": "Llyn Geirionydd",
      "objectID": "76a0771a3650efa62079c19e065c6ab0",
      "ref": "llyn-geirionydd-walking-route"
    },
    {
      "description": "Gwydyr Forest",
      "objectID": "be46934496ec81ce829d24f1ec6992de",
      "ref": "gwydyr-forest-walking-and-cycle-route"
    },
    {
      "description": "Betws Y Coed River Walk",
      "objectID": "37d95a5f055eb0d342bc6a88975cafe0",
      "ref": "betws-y-coed-river-walk-walking-route"
    },
    {
      "description": "Fairy Falls Trefriw",
      "objectID": "b357d1ec2b606d03318d7c18c63e3263",
      "ref": "fairy-falls-trefriw-walking-route"
    },
    {
      "description": "Llyn Parc",
      "objectID": "b89b64984af7c9621d75f59a2e2e5f70",
      "ref": "llyn-parc-walking-route"
    },
    {
      "description": "Dolgarrog Pipeline Walk",
      "objectID": "51a4a895f93c97e8944ab9ada2f8b04c",
      "ref": "dolgarrog-pipeline-walk-walking-route"
    },
    {
      "description": "Llyn Eigiau",
      "objectID": "b2513e2bcebb36c5da78b61ed6cfee38",
      "ref": "llyn-eigiau-walking-route"
    },
    {
      "description": "Cadair Ifan Goch",
      "objectID": "7c3ea3074bc8f7c12a0a5730b89ce317",
      "ref": "cadair-ifan-goch-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b67e1c391d17330efccd6853f798a9bc.gpx",
  "_geoloc": {
    "lat": 53.1370304978,
    "lng": -3.7974348311
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Riverside_path_and_islet_on_River_Conwy_at_Llanrwst_-_geograph.org.uk_-_1492051.jpg",
      "title": "Richard Hoare / Riverside path and islet on River Conwy at Llanrwst",
      "caption": "Riverside path and islet on River Conwy at Llanrwst. On the River Conwy south of Pont Fawr."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Stone_Circle_at_Llanrwst_-_geograph.org.uk_-_1484986.jpg",
      "title": "Richard Hoare / Stone Circle at Llanrwst",
      "caption": "Stone Circle at Llanrwst. This circle was built in 1951 to commemorate the Eisteddfod in the town that year. It consists of 14 large stones, twelve in the circle and two outliers to the NE at about 6 feet (1.8 metres) high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Gwydir_Castle.jpg/512px-Gwydir_Castle.jpg",
      "title": "Dara Jasumani, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gwydir Castle. Regarded as one of the finest Tudor houses in Wales, the castle was formerly the ancestral home of the powerful Wynn family. Look out for the peacocks in the lovely gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/The_Grey_Mares_Tail_waterfall_-_geograph.org.uk_-_119075.jpg/256px-The_Grey_Mares_Tail_waterfall_-_geograph.org.uk_-_119075.jpg",
      "title": "Nigel Williams / The Grey Mares Tail waterfall",
      "caption": "The Grey Mares tail waterfall near to Gwydir Castle in the Conwy valley. The name 'Grey Mare's Tail' was given to it by Lady Willoughby of Gwydir Castle, possibly \"in compliment to Lord Byron and the Staubbach\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Gwydir_Uchaf_Chapel_-_geograph.org.uk_-_110477.jpg",
      "title": "Nigel Williams / Gwydir Uchaf Chapel",
      "caption": "Gwydir Uchaf Chapel. Gwydir Uchaf Chapel was erected in 1673 by Sir Richard Wynn as the private chapel of his nearby house"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Llyn_y_Parc_-_geograph.org.uk_-_205494.jpg",
      "title": "Terry Hughes / Llyn y Parc",
      "caption": "Llyn y Parc. Taken from the Northwest end of the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Path_through_Gwydyr_Forest_-_geograph.org.uk_-_1375187.jpg",
      "title": "Phil Champion / Path through Gwydyr Forest",
      "caption": "Path through Gwydyr Forest. On the waymarked route to the north of Llyn y Parc."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Afon_Conwy_from_Pen_y_Bont_Fawr_-_geograph.org.uk_-_831726.jpg",
      "title": "Eric Jones / Afon Conwy from Pen y Bont Fawr",
      "caption": "Afon Conwy from Pen y Bont Fawr"
    }
  ],
  "distance_km": 9.0,
  "description": "This attractive market town is located in an ideal spot in the Snowdonia National Park. There's nice trails along the River Conwy, a nearby forest and several beautiful lakes to visit in the area. It's also the home of the wonderful Gwydir Estate which includes a historic castle, an ancient chapel and an expansive forest. This circular walk from the town visits some of the highlights of the area including the River Conwy, Llanrwst Stone Circle, Gwydir Castle, Gwydir Forest, Llyn Parc and the Grey Mare's Tail Waterfall. The route starts on the impressive three arched bridge on the river in the town centre. It is thought to be the work of renowned architect Inigo Jones. From here you can follow a riverside path south to the Gorsedd Stone Circle. The stones were created as part of the 1951 Eisteddfod. This annual event involves eight days of competitions and performances which are considered the largest music and poetry festival in Europe. Near here you will also pass Gwydir Castle. This fortified manor house dates back to c1500 and includes some beautiful gardens. In the Grade I listed gardens you'll find some ancient cedars, one of which was planted in 1625 to commemorate the wedding of King Charles I to Queen Henrietta Maria. There's also a giant yew tree which is thought to be 600-1000 years old. After passing the castle you continue south along the river before entering Gwydir Forest. Follow the footpaths south through the elevated forest and you will come to Llyn Parc, one of many lakes in the forest. Follow trails north along the lake and then through more woodland and you will come to the Grey Mare's Tail Waterfall. It's a secluded spot with the picturesque falls surrounded by the remains of mill buildings and a nature reserve. From the waterfall you head west to visit the Gwydir Uchaf Chapel. The chapel was built in 1673 by Sir Richard Wynn as a family memorial chapel for the Wynns of Gwydir. There is a fine interior with a beautifully painted ceiling. From here you return to the river which you can follow back into the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Eagles Hotel is a good choice for some post walk refreshments. The 18th century hotel is located in a lovely spot close to the river in the town centre. You can sit outside in the garden area and enjoy nice views over the water. They do good quality home cooked food and also provide accommodation if you need to stay over."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and forest trails make for a fine dog walk. The Eagles Hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you can explore the southern end of the Gwydyr Forest and try the Betws Y Coed River Walk. Head a few miles west of the town and there are two beautiful lakes to visit in the shape of Llyn Crafnant and Llyn Geirionydd. Both have lovely waterside walking trails with wonderful views of the Snowdonia Mountains. Near the lakes you'll also find the delightful Fairy Falls at Trefriw. It's another highlight of the area with picturesque rushing falls on the River Crafnant.  Head north from the town and you could pick up the Dolgarrog Pipeline Walk. This explores the area around the little village, visiting the impressive pipeline structure and the Coedty reservoir. Near here there's also the beautiful Llyn Eigiau where the reservoir dam was breached leading to the Dolgarrog Dam disaster of 1925. Just east of Dolgarrog there's the climb to Cadair Ifan Goch, a National Trust owned area. From the summit of the hills there are excellent views over the River Conwy Valley to the Carneddau mountains. For more walking ideas in the area see the Snowdonia Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/P_kCuSxRo1A",
  "district": "Llanrwst",
  "county": "Conwy",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pont Fawr, Llanrwst, Conwy, Cymru / Wales, LL26 0PL, United Kingdom",
  "postcode": "LL26 0PL",
  "state": "Cymru / Wales"
}