{
    "objectID": "b6b4865a9d1a79c649f625a750864dc7",
    "created_at": "2024-12-18T09:28:01.525001+00:00",
    "ref": "bath-skyline-walk-walking-route",
    "title": "Bath Skyline Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/04/Claverton_Down_-_geograph.org.uk_-_949203.jpg",
    "nearby": [
        {
            "description": "Bath Canal Walk",
            "objectID": "72a9c33668da9c68ccd74aea1a4c3288",
            "ref": "bath-canal-walk-walking-route"
        },
        {
            "description": "Kennet and Avon Canal Walk",
            "objectID": "0c879db862142efde19b17abd060ac05",
            "ref": "kennet-and-avon-canal-walk-walking-route"
        },
        {
            "description": "Bathampton",
            "objectID": "1cc540334ad4b1e22d529edc3cfb2a7b",
            "ref": "bathampton-walking-route"
        },
        {
            "description": "Norton St Philip",
            "objectID": "565943fd29676dd871533ea773471c5a",
            "ref": "norton-st-philip-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/15A61337BA901B7180257EBE0051E23F/$FILE/Bath Skyline Walk.gpx",
    "_geoloc": {
        "lat": 51.3805294705,
        "lng": -2.3459830435
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Claverton_Down_-_geograph.org.uk_-_949203.jpg",
            "title": "Derek Harper [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
            "caption": "Claverton Down. From the footpath, a view past sheep grazing around a fallen tree-trunk, to housing on the southeast side of Claverton Down. Primarily a rural area with relatively few houses, it is home to the University of Bath, the headquarters of Wessex Water and a private golf course, the Bath Golf Course."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Bath_Skyline_Walk_%2816652630674%29.jpg/512px-Bath_Skyline_Walk_%2816652630674%29.jpg",
            "title": "By Paul Stephenson from London (Bath Skyline Walk) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
            "caption": "The skyline of Bath from Bathwick Fields. Lovely buttercup filled meadows above Bath, which you walk though on the National Trust created \"Bath Skyline Walk\""
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/View_from_Bath_Skyline_Walk_-_geograph.org.uk_-_949375.jpg/256px-View_from_Bath_Skyline_Walk_-_geograph.org.uk_-_949375.jpg",
            "title": "Derek Harper / View from Bath Skyline Walk",
            "caption": "View from Bath Skyline Walk. A morning shot; these slopes of Claverton Down are west-facing, but the sun is on the city centre."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/American_Museum_-_geograph.org.uk_-_1776124.jpg/512px-American_Museum_-_geograph.org.uk_-_1776124.jpg",
            "title": "Rick Crowley / American Museum",
            "caption": "The American Museum near Claverton. The museum is well worth a visit if you have time. It takes you on a journey through the history of America with exhibitions and a fine collection of folk and decorative arts. There's also 125 acres of grounds with views of the Limpley Stoke Valley and the River Avon."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Path_on_Claverton_Down_-_geograph.org.uk_-_949349.jpg",
            "title": "Derek Harper / Path on Claverton Down",
            "caption": "Path on Claverton Down. This path is part of the Bath Skyline Walk, although the view here is obscured by the thin belt of trees on the right."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/The_Palladian_Bridge%2C_Prior_Park_-_geograph.org.uk_-_979011.jpg",
            "title": "Stephen McKay / The Palladian Bridge, Prior Park",
            "caption": "The Palladian Bridge, Prior Park. This architectural masterpiece is one of the key features of this wonderful National Trust owned park. It was built in 1755, and is the last of three of its kind built in England. The bridge was created by Ralph Allen, with advice from famous landscape gardener 'Capability' Brown and the poet Alexander Pope."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Sham_Castle%2C_Bathampton_-_geograph.org.uk_-_2172318.jpg/512px-Sham_Castle%2C_Bathampton_-_geograph.org.uk_-_2172318.jpg",
            "title": "Sham Castle, Bathampton by Humphrey Bolton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Sham Castle, Bathampton. The walk passes this Grade II listed folly, located on Claverton Down. It is a screen wall with a central pointed arch flanked by two 3-storey circular turrets, which extend sideways to a 2-storey square tower at each end of the wall. The folly dates to 1762 and is illuminated at night."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Houses%2C_Bathwick_Hill%2C_Bath_-_geograph.org.uk_-_2170876.jpg/512px-Houses%2C_Bathwick_Hill%2C_Bath_-_geograph.org.uk_-_2170876.jpg",
            "title": "Houses, Bathwick Hill, Bath by Humphrey Bolton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Houses, Bathwick Hill, Bath. This noteworthy street contains several historic houses, many of which are designated as listed buildings. The hill climbs south east from the A36 towards the University of Bath on Claverton Down, providing views over the city."
        }
    ],
    "distance_km": 9.0,
    "description": "Enjoy wonderful views of the city of Bath on this popular circular walk. The walk has been devised by the National Trust so takes place on waymarked, well maintained footpaths. The walk begins on Bathwick Hill and then heads south to Widcombe passing Smallcombe Wood. The wood is an excellent place for birdwatching with nuthatch, wrens and blackcap to look out for.  The route continues past the stunning Prior Park with its beautiful lakes and Palladian Bridge. You then cross Claverton Down before turning north towards Claverton where you will find the excellent American musuem. The path continues north towards Bathampton where there is a nice woodland section through Bathampton Woods. You then turn south through more woodland to Sham Castle, an 18th-century folly which makes a good spot to rest and enjoy the wonderful views. The final section takes you from the castle to Bathwick Hill and the finish point. It's a splendid walk with varied scenery and consistently wonderful views over Bath towards the Mendip Hills. At Bathampton you can pick up the Kennet and Avon Canal and try the Bath to Bradford Upon Avon Canal Walk . The route will take you from Somerset into Wiltshire along the towpath of the canal.",
    "video_url": "https://www.youtube.com/embed/9rpkdpFYeQ8",
    "postcode": "BA2 6EP",
    "district": "Bath",
    "county": "Bath and North East Somerset",
    "region": "South West",
    "country": "England"
}
