{
  "created_at": "2025-01-06T08:34:20.786265+00:00",
  "objectID": "b6b539b8220fe9cbf041ddca8aef6e8c",
  "ref": "felton-walking-route",
  "title": "Felton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Felton_Old_Bridge_-_geograph.org.uk_-_334260.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b6b539b8220fe9cbf041ddca8aef6e8c.gpx",
  "_geoloc": {
    "lat": 55.2970121586,
    "lng": -1.7130663101
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Felton_Old_Bridge_-_geograph.org.uk_-_334260.jpg",
      "title": "Les Hull / Felton Old Bridge",
      "caption": "Felton Old Bridge 1. The medieval bridge at Felton was probably built in the 15th century and has three arches spanning the River Coquet. Despite having been widened in the 18th or 19th century, it now carries only pedestrian traffic, a new bridge having been built next to it in the early 20th century. The bridge is built of sandstone and each pier has pointed cutwaters to help the water flow around them. Little documentary evidence has been found for the history of the bridge but an early charter shows there has been a bridge of some kind at Felton since at least the 12th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Felton_Old_Bridge_-_geograph.org.uk_-_1802352.jpg",
      "title": "Joan Sykes / Felton Old Bridge",
      "caption": "Felton Old Bridge 2. The crossing at Felton was an important part of the route between Newcastle upon Tyne and Berwick-upon-Tweed. This is a Scheduled Monument and Grade II* Listed Building protected by law. At one time this bridge carried the Great North Road (A1) even when the bridge was replaced Felton could be a bit of a bottle neck. Since a by-pass was built Felton had returned to its more tranquil days."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Tree_stump_at_Felton_Park_-_geograph.org.uk_-_1802386.jpg",
      "title": "Joan Sykes / Tree stump at Felton Park",
      "caption": "Tree stump at Felton Park In the background, St Mary's Roman Catholic Church, 19th century foundation attached to the Felton Park estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Felton_Mill_%28geograph_3381770%29.jpg/512px-Felton_Mill_%28geograph_3381770%29.jpg",
      "title": "Russel Wills / Felton Mill",
      "caption": "Felton Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/River_Coquet_-_geograph.org.uk_-_1802057.jpg",
      "title": "Oliver Dixon / River Coquet",
      "caption": "River Coquet. Looking upstream, below Felton Fence"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Weldon_Bridge_-_geograph.org.uk_-_1431320.jpg",
      "title": "Oliver Dixon / Weldon Bridge",
      "caption": "Weldon Bridge. An elegant bridge over the River Coquet. The Angler's Arms can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Weir_on_the_River_Coquet_-_geograph.org.uk_-_1431322.jpg",
      "title": "Oliver Dixon / Weir on the River Coquet",
      "caption": "Weir on the River Coquet. Water was diverted here at one time to power a mill at Weldon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/The_Old_And_The_New_-_geograph.org.uk_-_654001.jpg",
      "title": "J Scott / The Old And The New",
      "caption": "The Old And The New, near to Pauperhaugh, Northumberland. Modern sculpture of Bell opposite Manor House and adjacent Brinkburn Priory. The Grade II listed structure was founded by William Bertram, Baron of Mitford, in the reign of Henry I as an Augustinian priory. The exact date is not known but cannot have been later than 1135, as Henry died that year."
    }
  ],
  "distance_km": 17.0,
  "description": "This picturesque Northumberland village has some lovely trails along the River Coquet in Felton Park. This walk from the village takes you west along the river to visit the historic Brinkburn Priory. The route follows the St Oswald's Way, a long distance footpath which runs through the village. The walk starts in the village and heads west through the woodland of Felton Park. The park was created in the 13th century by Roger de Bertram, who lived at the 11th century Mitford castle near Morpeth. The route passes through the woodland and streams of the park before following the river to Catheugh and Weldon Bridge. Shortly after you arrive at Brinkburn Mill and Priory. The 12th century Augustinian Priory church is run by English and Heritage and is a bit of hidden gem of the area. The restored church is one of the best examples of early Gothic architecture in Northumberland. After exploring the abbey the route returns to the village on the same paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Northumberland Arms is a good choice for refreshment in the village. The pub is located in a fine spot next to the river with a garden area to sit out in on warmer days. You can find them at The Peth, with a postcode of NE65 9EE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and river trails make for a fine dog walk and the Northumberland Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east and you can visit the neighbouring village of Warkworth. Here you can try the Warkworth River Walk or head to the coast on the Warkworth to Alnmouth Walk. Just south of the village there's also the popular Druridge Bay Country Park to explore. There's a beautiful long beach, sand dunes and a lake to see here. If you continue west along St Oswald's Way it will take you along the river to the wonderful Cragside Country Park at Rothbury. For more walking ideas in the area see the Northumberland Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wCuj0NjVTIA",
  "postcode": "NE65 9HS",
  "district": "Felton",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B6345, Felton, Northumberland, North East, England, NE65 9HS, United Kingdom",
  "state": "England"
}