{
  "created_at": "2025-01-06T00:05:36.347401+00:00",
  "objectID": "b6f249f4d96db8f566de5fd2fc2c2187",
  "ref": "whitchurch-hampshire-walking-route",
  "title": "Whitchurch Hampshire Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/River_Test%2C_Whitchurch_-_geograph.org.uk_-_881592.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b6f249f4d96db8f566de5fd2fc2c2187.gpx",
  "_geoloc": {
    "lat": 51.2281164343,
    "lng": -1.3380959049
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/River_Test%2C_Whitchurch_-_geograph.org.uk_-_881592.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Test, Whitchurch. The River Test is regarded as one of the most famous chalk streams in the World, and the river is so clean that its waters are used to wash the paper used for British banknotes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/River_Test_at_Whitchurch_Silk_Mill_-_geograph.org.uk_-_1770971.jpg/512px-River_Test_at_Whitchurch_Silk_Mill_-_geograph.org.uk_-_1770971.jpg",
      "title": "nick macneill / River Test at Whitchurch Silk Mill",
      "caption": "River Test at Whitchurch Silk Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/The_bridge_at_Bere_Mill_-_geograph.org.uk_-_331197.jpg",
      "title": "Peter Facey / The bridge at Bere Mill",
      "caption": "The bridge at Bere Mill. An intricate and attractive bridge built partly of stone and partly of brick, just upstream of Bere Mill. The mill was built in 1712 so perhaps the bridge dates from the same time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Bere_Mill_-_geograph.org.uk_-_72025.jpg",
      "title": "Simon and Alison Downham / Bere Mill",
      "caption": "Bere Mill. A watermill near Whitchurch in Hampshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Houses%2C_Freefolk%2C_Hants_-_geograph.org.uk_-_343957.jpg",
      "title": "John Salmon / Houses, Freefolk, Hants",
      "caption": "Houses, Freefolk, Hants"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Bombay_Sapphire_distillery.jpeg/512px-Bombay_Sapphire_distillery.jpeg",
      "title": "User:Keri, CC0, via Wikimedia Commons",
      "caption": "Bombay Sapphire distillery in Laverstoke Mill, near Whitchurch, Hampshire. The mill was originally used to manufacture paper for watermarked banknotes. Although a mill has stood at this location on the River Test since at least 1086, it underwent major rebuilding and expansion in the mid-19th century when the company secured a contract with the Government of India to produce Indian Rupee paper as well as Bank of England paper. The mill was restored for Bombay Sapphire to a design by Thomas Heatherwick during 2012-2014."
    }
  ],
  "distance_km": 8.0,
  "description": "This delightful Hampshire village sits in an idyllic location on the River Test. It's a lovely place for a stroll with easy riverside walks, pretty gardens and a noteworthy old mill to explore. There's also miles of good trails through the surrounding countryside of the North Wessex Downs AONB. This walk from the town takes you east along the River Test to neighbouring Freefolk and Laverstoke. On the way you'll pass historic mills, weirs and pockets of woodland on the southern side of the river. It's about a 5 mile walk there and back. Near the start of the walk you'll pass one of the highlights of the area at the Winchester Silk Mill. Here you can learn all about the town's milling history with a series of exhibits, the originial water wheel and other old machinery to see. There's also some pleasant riverside gardens and a nature trail at the site. At the eastern end of the route there's some fine old churches to see in Freefolk and Laverstoke. There's also the Bombay Sapphire Distillery at Laverstoke Mill. You can tour the distillery to find out exactly what goes into the making of the famous gin. On the return leg you can cross to the northern side of the river and explore the area around picturesque Bere Mill and bridge.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One nice option is the cafe at the Winchester Silk Mill. It's lovely on summer days with a Riverside Garden Gazebo and a Frog Island Gazebo with a number of outdoor picnic benches on which to relax. If you prefer a pub lunch then the King's Arms is a good choice. The pub has some history dating all the way back to 1575. During the civil war, troops of King Charles I were billeted at the Kings Arms in October 1664 before the second battle of Newbury. You can find them on Church Street at postcode RG28 7AB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and woodland trails make for a fine dog walk and the Kings Arm mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east you can visit the neighbouring village of Overton where you can visit the source of the River Test. The village is also notable for its Norman church, 15th century pub and history of banknote paper manufacture which started in the 18th Century. To the north west you can pick up the long distance Test Way at St Mary Bourne. The village is well worth a visit with rows of picturesque thatched cottages and views of the pretty Bourne Rivulet, a tributary of the River Test. For more walking ideas in the area see the North Wessex Downs Walks and the Hampshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/RHLqv2ZtrcU",
  "district": "Basingstoke and Deane",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Winchester Road, Mill Springs, Whitchurch, Basingstoke and Deane, Hampshire, England, RG28 7HF, United Kingdom",
  "postcode": "RG28 7HF",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "5 miles",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical mills",
    "water wheel",
    "nature trail",
    "churches"
  ],
  "facilities": [
    "visitor center",
    "pub/cafe",
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}