{
  "created_at": "2025-01-06T04:01:20.649329+00:00",
  "objectID": "b791f95ebba33eb4db2d5b875528dd2b",
  "ref": "rye-harbour-walking-route",
  "title": "Rye Harbour Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Rye_Harbour_-_geograph.org.uk_-_360957.jpg",
  "nearby": [
    {
      "description": "Rye to Hastings",
      "objectID": "82608d56a3b56c3ba9ce5b6522e9638a",
      "ref": "rye-to-hastings-walking-route"
    },
    {
      "description": "Royal Military Canal Path",
      "objectID": "23ec92ee4698b0dd917d6b4b50ec3444",
      "ref": "royal-military-canal-path-walking-route"
    },
    {
      "description": "Saxon Shore Way",
      "objectID": "e50fab578e5425ee992debe450ead99a",
      "ref": "saxon-shore-way-walking-route"
    },
    {
      "description": "Camber Sands",
      "objectID": "679c775175304584d57257698f27b164",
      "ref": "camber-sands-walking-and-cycle-route"
    },
    {
      "description": "Rye Circular Walk",
      "objectID": "f5cb15fe1cfbf6938c8ab1664608c023",
      "ref": "rye-circular-walk-walking-route"
    },
    {
      "description": "Dymchurch",
      "objectID": "fbe2284768a19bb28ce0897630f94787",
      "ref": "dymchurch-walking-route"
    },
    {
      "description": "Peasmarsh",
      "objectID": "7999a60755be2aa5b23765cec25fcfe1",
      "ref": "peasmarsh-walking-route"
    },
    {
      "description": "Winchelsea",
      "objectID": "594980be6bb9f53bd75fe1bb7719c631",
      "ref": "winchelsea-walking-route"
    },
    {
      "description": "Camber Castle",
      "objectID": "1f9068eb30704ad4f733954d3be9df32",
      "ref": "camber-castle-walking-route"
    },
    {
      "description": "Rye Harbour To Winchelsea Beach Walk",
      "objectID": "06d6e1afc3bfa468ea7c87f3de87ec45",
      "ref": "rye-harbour-to-winchelsea-beach-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b791f95ebba33eb4db2d5b875528dd2b.gpx",
  "_geoloc": {
    "lat": 50.9365803775,
    "lng": 0.7608983493
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Rye_Harbour_-_geograph.org.uk_-_360957.jpg",
      "title": "sue hayton / Rye Harbour, via Wikimedia Commons",
      "caption": "Strand Quay, Rye (Not Rye Harbour) at high tide with leisure craft. Behind are traditional black tarred warehouses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Rye_Harbour_-_geograph.org.uk_-_25087.jpg",
      "title": "Penny Mayes / Rye Harbour, via Wikimedia Commons",
      "caption": "Inshore Rescue Boat Station just left of centre across the Rother. The blue building on the right is the Lifeboat Station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Beach_at_Rye_Harbour_-_geograph.org.uk_-_1329566.jpg",
      "title": "Oast House Archive / Beach at Rye Harbour, via Wikimedia Commons",
      "caption": "Beach at Rye Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/William_the_Conqueror_at_Rye_Harbour_-_geograph.org.uk_-_1028991.jpg",
      "title": "Nick Smith / William the Conqueror at Rye Harbour, via Wikimedia Commons",
      "caption": "William the Conqueror pub at the harbour. One of the many Martello towers that dot the south-east coast in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Boats_on_the_River_Rother%2C_Rye_Harbour_-_geograph.org.uk_-_1028988.jpg",
      "title": "Nick Smith / Boats on the River Rother, Rye Harbour, via Wikimedia Commons",
      "caption": "Boats on the River Rother at the harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Church_of_the_Holy_Spirit%2C_Rye_Harbour_-_geograph.org.uk_-_1094044.jpg",
      "title": "Kevin Gordon / Church of the Holy Spirit, Rye Harbour, via Wikimedia Commons",
      "caption": "Church of the Holy Spirit at the harbour. The church was built in 1849 as a gift from Mr and Mrs William Lucas Shadwell who owned the surrounding land. The tombstone on the left is the back of the memorial to the crew of the lifeboat Mary Stanford; all 17 lost their lives in a single incident in 1928."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Lifeboat_Station%2C_Rye_Harbour_-_geograph.org.uk_-_1094018.jpg",
      "title": "Kevin Gordon / Lifeboat Station, Rye Harbour",
      "caption": "This is the Lifeboat House for Rye Harbour and was built in 1995. The following year the present lifeboat \"The Mrs Rodney Wells\" arrived. There are 15 crew and launchers based at this site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Lake_with_islands_in_Rye_Harbour_Nature_Reserve_-_geograph.org.uk_-_1091656.jpg",
      "title": "Shazz / Lake with islands in Rye Harbour Nature Reserve",
      "caption": "Lake with islands in Rye Harbour Nature Reserve. This was taken on the Sussex Coastline Walk. The reedbeds are currently being expanded to attract more Bitterns into the area. The lakes have been formed from former gravel pits."
    }
  ],
  "distance_km": 4.0,
  "description": "This lovely walk takes you around Rye Harbour Nature Reserve on the Sussex coast. There's great scenery with a wide range of habitats including saltmarsh, lagoons, grazing marsh, shingle and reedbeds. You can follow miles of footpaths through the reserve while looking out for a huge variety of wildlife. Birds you might see include ringed plover, avocet, oystercatcher, redshank, lapwing, and sandwich terns. There's also lots of colourful plants and flowers in the summer months. Look out for 456 species of flowering plants including yellow horned-poppy, sea pea and sea campion. The reserve also includes Henry VIII's Camber Castle. You can visit the interesting ruins of this 16th century Device Fort, built to protect the Sussex coast against French attack. The Saxon Shore Way long distance footpath runs through the reserve so you could pick this up to extend your walk. You could visit nearby Winchelsea and then follow the waterside path along the Royal Military Canal on the Rye to Hastings Walk. Our Rye Circular Walk visits the harbour reserve, the castle and Winchelsea. Also near here is the beautiful Camber Sands, a very popular local beach. At Camber Sands you can pick up the England Coast Path and head east to the splendid Dungeness RSPB Nature Reserve. Here you will find lakes, lagoons and an expansive section of shingle beach with a wide variety of wildlife.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The William the Conqueror pub is located right on the harbour and a good choice for some post walk refreshments. Recently refurbished, it’s a smart, friendly, traditional pub, boasting real ales, hearty pub food and a friendly welcome. There’s a large outdoor area here, with plenty of alfresco seating on the banks of the River Rother. It's a great spot to enjoy lunch while looking out for some of the local wildlife that make this a Site of Special Scientific Interest. You can find the pub near the car park on the eastern side of the reserve at postcode TN31 7TU. The delightful Avocet Tea Room is located in the same area as well. The tea room also includes a lovely art gallery showcasing the talent of local artists. The gallery is run by award-winning photographer Peter Greenhalf and former journalist Morgan (who makes all the cakes). The gallery reflects the artists’ love of the natural world and is well worth seeing if you have time after your walk."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The harbour is a great place for a dog walk, though it's best to keep them on leads near the livestock. The William the Conqueror pub is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route passes the Mary Stanford Lifeboat House, a site of some historical significance. The now abandoned lifeboat house serves as a monument to rescue crew tragically killed in the 1928 disaster. It can be found on the southern side of the harbour and includes an information board with details of the tragedy. At the northern edge of the harbour there's also the Rye Castle Museum or Ypres Tower. The museum has lots of interesting artifacts and exhibits to see including locally-made medieval pottery, an embroidery depicting many aspects of Rye life and history, medieval artifacts, activities and town maps. You can also climb to the top of the tower and enjoy fantastic views over the harbour and the river. It's a nice place to visit after your walk if you have time.  Above: Ypres Tower or Rye Castle. A worthy addition to your outing. For a longer circular walk from the reserve try the Rye Harbour To Winchelsea Beach Walk."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bVAIH_lDcRU",
  "postcode": "TN31 7TZ",
  "district": "Rother",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rye Harbour, Tram Road, Icklesham, Rye Harbour, Rother, East Sussex, England, TN31 7TZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "shingle",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "wildlife viewing",
    "beach"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}