{
  "created_at": "2025-01-06T01:17:52.323447+00:00",
  "objectID": "b7a7ef023cb1681038a29cf44e5397ee",
  "ref": "wantage-walking-route",
  "title": "Wantage Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0a/On_the_downs_above_Lockinge_-_geograph.org.uk_-_228372.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b7a7ef023cb1681038a29cf44e5397ee.gpx",
  "_geoloc": {
    "lat": 51.5890414653,
    "lng": -1.4093295291
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/On_the_downs_above_Lockinge_-_geograph.org.uk_-_228372.jpg",
      "title": "Andrew Smith / On the downs above Lockinge",
      "caption": "On the downs above Lockinge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Lord_Wantage_Memorial_on_the_Ridgeway.jpg/256px-Lord_Wantage_Memorial_on_the_Ridgeway.jpg",
      "title": "Steve Daniels / The Lord Wantage Memorial on the Ridgeway",
      "caption": "Lord Wantage Memorial. The Lindsay Monument on Betterton Down south of Lockinge, Oxfordshire (formerly Berkshire). Robert Loyd-Lindsay, 1st Baron Wantage founded the English Red Cross and was the first man to win a Victoria Cross in the Crimean War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Farmland_on_East_Ginge_Down_-_geograph.org.uk_-_837897.jpg",
      "title": "Andrew Smith / Farmland on East Ginge Down",
      "caption": "Farmland on East Ginge Down"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Trees_on_the_downs_above_Lockinge_-_geograph.org.uk_-_228392.jpg",
      "title": "Andrew Smith / Trees on the downs above Lockinge",
      "caption": "Trees on the downs above Lockinge. Beside the bridleway that descends to Coldharbour Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/The_market_square%2C_Wantage_-_geograph.org.uk_-_1817290.jpg/512px-The_market_square%2C_Wantage_-_geograph.org.uk_-_1817290.jpg",
      "title": "The market square, Wantage by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The market square, Wantage. In the 19th century, Lord Wantage became a notable local and national benefactor. In 1877 he paid for a marble statue of King Alfred by Count Gleichen to be erected in Wantage market place, where it still stands today."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Priory_Road%2C_Wantage_-_geograph.org.uk_-_1571041.jpg",
      "title": "Andrew Smith / Priory Road, Wantage",
      "caption": "Priory Road. A quiet road near the town centre approaches the parish church of St Peter and St Paul."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/The_Ridgeway_at_Cuckhamsley_Hill_-_geograph.org.uk_-_1308845.jpg",
      "title": "Steve Daniels / The Ridgeway at Cuckhamsley Hill",
      "caption": "The Ridgeway at Cuckhamsley Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/The_Ridgeway_above_East_Ginge_-_geograph.org.uk_-_834326.jpg",
      "title": "Andrew Smith / The Ridgeway above East Ginge",
      "caption": "The Ridgeway above East Ginge"
    }
  ],
  "distance_km": 9.5,
  "description": "The Oxfordshire town of Wantage is in a great location for exploring a lovely section of the Ridgeway. There's fine views over the Berkshire Downs from the high points on the trail. This walk takes you from the town onto the Ridgeway, visiting the Wantage Monument and Cuckhamsley Hill to the south east of the town. Starting in the town you head east along a footpath to Lockinge. Near here you could take a detour to visit the pretty neighbouring village of Ardington. The village includes a 13th century church and the Georgian Ardington House. At Lockinge you turn south to climb onto the Ridgeway at Middlehill Down. Near here you will pass the memorial cross and monument to Robert Loyd Lindsey, Lord Wantage. Lord Wantage was a distinguished soldier and one of the first to be awarded the Victoria Cross in the Crimean War. The copses of trees in the vale below were planted by Lord Wantage and are believed to represent the battle lines at Alma. There's fine views over the Vale from here. To extend the walk you can head west along the trail and visit the nearby Segsbury Camp. The periodic occupation of the hill fort between the 6th and 2nd centuries BC suggests that it was a communal centre for various activities, including sheep management and exchange. The circular Letcombe Regis Walk visits the camp from the neighbouring village. Continuing west will take you to another of the highlights of the area at the Uffington White Horse. The area is historically significant with the 3000 year old prehistoric hill figure and an Iron Age hillfort located close together. The castle sits at a height of 860 feet (262m) above sea level making it the highest point in Oxfordshire. Near here you can also visit the fascinating Wayland's Smithy. The Neolithic long barrow dates from 3460–3400 BC and includes a burial chamber consisting of a narrow and partially constricted passage, leading to a pair of small side chambers. The site is located close to the Ashdown House Estate. The National Trust owned estate has nice woodland walks and attractive grounds.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The historic Lamb Inn dates all the way back to the 17th century. The thatched inn serves good quality food and has a nice garden area for sunny days. You can find them on Mill Street with a postcode of OX12 9AB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Lamb Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east you'll find the interesting village of Chilton. Near here you can pick up the epic Ridgeway National Trail, one of the walking highlights of the area. For more walking ideas in the area see the Oxfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zGW-oTKXLbU",
  "postcode": "OX12 8HW",
  "district": "Vale of White Horse",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bridleway, 11, Larkhill, Charlton, Wantage, East Lockinge, Vale of White Horse, Oxfordshire, England, OX12 8HW, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "archaeological sites",
    "hill forts",
    "prehistoric sites"
  ],
  "facilities": [
    "woodland walks",
    "visitor center",
    "estate"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}