{
  "created_at": "2025-01-06T08:04:07.784668+00:00",
  "objectID": "b7b146d2f276fc22fccd4290620414e5",
  "ref": "spanish-point-walking-route",
  "title": "Spanish Point Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/76/Spanish_Point_beach_-_geograph.org.uk_-_1471930.jpg?20110302125342",
  "nearby": [
    {
      "description": "Loop Head",
      "objectID": "9d4fcb83adb6e99c86ef5dc93c6e83cb",
      "ref": "loop-head-walking-route"
    },
    {
      "description": "Kilkee Cliff Walk",
      "objectID": "4e6d4637d2124cad53476fc859b78e4c",
      "ref": "kilkee-cliff-walk-walking-route"
    },
    {
      "description": "Doolin Cliff Walk",
      "objectID": "7f620e99dd91d4423918fcc8ba98b705",
      "ref": "doolin-to-cliffs-of-moher-walking-route"
    },
    {
      "description": "Ballyvaughan Wood Loop Walk",
      "objectID": "bd8ff9d8c40235f958dcb72bb062d141",
      "ref": "ballyvaughan-wood-loop-walk"
    },
    {
      "description": "Doolin to Cliffs of Moher",
      "objectID": "7f620e99dd91d4423918fcc8ba98b705",
      "ref": "doolin-to-cliffs-of-moher-walking-route"
    },
    {
      "description": "Flaggy Shore",
      "objectID": "2e87d3b0c7a1bc39493c087f0c3c68de",
      "ref": "flaggy-shore-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b7b146d2f276fc22fccd4290620414e5.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Spanish_Point_beach_-_geograph.org.uk_-_1471930.jpg?20110302125342",
      "title": "Simon Huguet / Spanish Point beach",
      "caption": "Spanish Point beach. The village was named after the Spanish who died here in 1588, when many ships of the Spanish Armada were wrecked during stormy weather. Those who escaped from their sinking ships and made it safely to land were later executed by Sir Turlough O'Brien of Liscannor and Boethius Clancy, High Sheriff of Clare."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Beach_at_Spanish_Point%2C_West_Clare_-_geograph.org.uk_-_4686374.jpg?20230428072235",
      "title": "Beach at Spanish Point, West Clare by Chris, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "It was not known by the English authorities in Ireland whether the Spanish sailed this way around Ireland because their ships were damaged and the storm prevented them from sailing back the quick way or if it was part of a Spanish plan to invade Ireland. As news of the English victory had not reached William FitzWilliam, the Lord Deputy of Ireland, he had issued a blanket command that all Spanish found in Ireland were to be executed with their ships and treasure seized. The executed Spanish were buried in a mass grave in an area of Spanish Point known locally as Tuama Na Spáinneach (Tomb of the Spaniards). Despite this, there was no archaeological evidence for the claim until 2015 when a group of historians investigating the location of the wreck of San Marcos stated they had found a mass grave under Spanish Point which contained the bodies of the executed Spanish sailors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Ru%C3%AFne_Atlantic_Hotel.jpg/512px-Ru%C3%AFne_Atlantic_Hotel.jpg?20090812080807",
      "title": "Eddylandzaat, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Ruïne Atlantic Hotel. Spanish Point is home of the Atlantic Hotel which was built in 1810 and was promoted as the largest hotel in the British Isles. The hotel closed in 1930 as it had relied upon members of the British nobility visiting for income. This was as a result of the Irish War of Independence and subsequent establishment of the Irish Free State that dissuaded the wealthy from travelling to Spanish Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Spanish_Point_%288068470032%29.jpg/512px-Spanish_Point_%288068470032%29.jpg?20130429181246",
      "title": "psyberartist, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Spanish Point Beach has Blue Flag Status, with facilities and free parking, and is a top surfing spot in Clare. Celtic Surf School is based here."
    }
  ],
  "distance_km": 1.4,
  "description": "This walk visits the coastal village of Spanish Point in the parish of Milltown Malbay, County Clare. Here you can enjoy a walk along the village's long beach with some fine views out to sea. To continue your walking in the area you could head north to try the Lahinch Beach and Cliff Walk. There's some splendid views over Liscannor Bay here. To the south you can pick up the popular Kilkee Cliff Walk. The coastal path provides views of the Aran Islands to the North, Kerry to the South and back to Loop Head to the south west.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north east into the heart of the Burren National Park and you could try the Lough Avalla Farm Loop. Another well trodden path it winds through the historic site of an ancient Celtic farm and briefly follows the picturesque shoreline of Lough Avalla. Near here there's also Lough Bunny, a Special Area of Conservation with stunning views of Mullaghmore Mountain. To the north there's the Doolin Cliff Walk which will takes you along the Cliffs of Moher. On the wonderful cliff top path there's fabulous views over the Atlantic coast and a large variety of sea birds to look out for. Head further along the coast and you could explore Loop Head. Here you can visit the lighthouse and enjoy views of a giant sea stack and the mouth of the River Shannon."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Igv-acNRE14?si=-zPASXpe68_Sa96H",
  "gazetteer_found": false
}