{
  "created_at": "2025-01-06T01:48:34.396295+00:00",
  "objectID": "b81d253a737b17ad07a0749a92ba69fa",
  "ref": "wherrymans-way-walking-route",
  "title": "Wherryman's Way - River Yare Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_Wherryman%27s_Way_-_geograph.org.uk_-_1340003.jpg",
  "nearby": [
    {
      "description": "Norwich Riverside Walk",
      "objectID": "384fcd894f6a38346574000e43d48f68",
      "ref": "norwich-riverside-walk-walking-route"
    },
    {
      "description": "Surlingham",
      "objectID": "ae543d4f53b299797801e223ee46e066",
      "ref": "surlingham-walking-route"
    },
    {
      "description": "Loddon",
      "objectID": "72a7c7484c779a8fa355702c3ff85dbf",
      "ref": "loddon-walking-route"
    },
    {
      "description": "Reedham",
      "objectID": "5a36129b8eab18365f972d5d5f3ba8ff",
      "ref": "reedham-walking-route"
    },
    {
      "description": "Bramerton Riverside Walk",
      "objectID": "ed7b6c563e9cf7c6e3352000c1f480cf",
      "ref": "bramerton-riverside-walk-walking-route"
    },
    {
      "description": "Yare Valley",
      "objectID": "0cec226e45ecad87de93b2e6c15634b8",
      "ref": "yare-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b81d253a737b17ad07a0749a92ba69fa.gpx",
  "_geoloc": {
    "lat": 52.6270297771,
    "lng": 1.3062737919
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_Wherryman%27s_Way_-_geograph.org.uk_-_1340003.jpg",
      "title": "Evelyn Simak / The Wherryman's Way",
      "caption": "This section of the Wherryman's Way leads from Surlingham to Rockland St Mary, further to the south. The long distance footpath here skirts Surlingham Wood. The Wherryman's Way is a 35-mile long distance footpath following the route of the Broads trading wherries between Norwich and Great Yarmouth. The route takes its name from the wherry\u0096 a large cargo-carrying barge whose black sails used to be a common sight on these waters. Ten circular village walks branch off this path along the way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Poplars_by_the_Wherryman%27s_Way_-_geograph.org.uk_-_1552518.jpg",
      "title": "Evelyn Simak / Poplars by the Wherryman's Way",
      "caption": "Poplars by the Wherryman's Way. These tall poplars mark the site of the northern terminus of a narrow gauge railway which between 1926 and 1936 ran the 1.6 kilometres from Claxton Manor Farm to the south bank of the River Yare. In 1928 it was extended south to Staines Barn just east of St Andrew's church. The railway transported sugar beet which were loaded onto wherries and transported to the Cantley sugar factory which is situated several kilometres to the east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/The_Wherryman%27s_Way_-_geograph.org.uk_-_1551424.jpg",
      "title": "Evelyn Simak / The Wherryman's Way",
      "caption": "Following the long distance footpath in a westerly direction along Short Dike, approaching the River Yare. Only white dried-out skeletons are left of the wild mustard (Brassica Kaber) which here lined the path in great abundance during the summer months. Short Dike is a channel linking Rockland Broad and the Yare."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Flowering_shrubs_on_the_Wherrymans_Way_-_geograph.org.uk_-_1335110.jpg",
      "title": "Evelyn Simak / Flowering shrubs on the Wherrymans Way",
      "caption": "Flowering shrubs located next to the trail near Rockland Broad. This section of the long distance footpath links Surlingham with Rockland St Mary, further to the south. The south-eastern edge of Rockland Broad can be glimpsed in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/This_way_to_Manor_Farm_-_geograph.org.uk_-_1330137.jpg",
      "title": "Evelyn Simak / This way to Manor Farm",
      "caption": "This way to Manor Farm. What now serves as an access road once used to carry the 1928 extension of a narrow gauge railway which between 1926 and 1936 ran the 1.6 kilometres from Claxton Manor Farm to the south bank of the River Yare. In 1928 it was extended south to Staines Barn just east of the church. The railway transported sugar beet which were loaded onto wherries and transported to the Cantley sugar factory which is situated several kilometres to the north-east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/St_Andrew%27s_church_-_geograph.org.uk_-_1329931.jpg",
      "title": "Evelyn Simak / St Andrew's church",
      "caption": "St Andrew's church. St Andrew's church is situated about about 1 kilometre to the south-west of the village of Claxton. The direct route to the village is a bridleway which cuts across fields whereas the narrow lane zig-zags first in northerly and then in easterly direction. Traces of an arcade can be discerned on the north wall, indicating that the church once had a north aisle. The red-brick porch on the south side dates from the 16th century. The church interior is mainly from the 18th century but the elaborately carved C15 font with four sitting lions around its stem has survived from the Middle Ages. The church is open daily."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Rosebay_willowherb_on_the_Wherryman%27s_Way_-_geograph.org.uk_-_1387368.jpg",
      "title": "Evelyn Simak / Rosebay willowherb on the Wherryman's Way",
      "caption": "Rosebay willowherb on the trail. This section of the trail follows a footpath which runs between Whitlingham Lane (at left) and the River Yare. Here it is flanked by rosebay willowherb ( Chamaenerion angustifolium)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Seat_beside_the_Wherryman%27s_Way_-_geograph.org.uk_-_1552618.jpg",
      "title": "Evelyn Simak / Seat beside the Wherryman's Way",
      "caption": "Seat beside the trail at Buckenham."
    }
  ],
  "distance_km": 57.0,
  "description": "This walk follows the River Yare between Norwich and Great Yarmouth through the Norfolk Broads. It runs for about 35 miles on flat footpaths through the lovely countryside of the Yare Valley. You will pass through a number of delightful riverside villages including Cantley, Reedham, Loddon and Burney Arms. The walk is decorated with unique waymarkers along the route, which include figures, sculpture, information panels and audio points.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the delightful village of Surlingham you'll pass through the RSPB's RSPB Church Marsh Nature Reserve where you can enjoy a pit stop at the Ferry House Inn. You can sit outside in the lovely large garden area and watch the boats go by on the river as you enjoy lunch. You'll pass the inn at the eastern side of the reserve on Ferry Road at postcode NR14 7AR. They are dog friendly if you have your canine friend with you. Near here there's also The Water's Edge Gastropub at Bramerton. The riverside inn dates back to the 17th century and includes outdoor decking with views over the river. They have a restaurant serving high quality dishes and a good sized car park. In the pretty village of Loddon there's the popular Swan to consider. The inn is housed in a lovely old building which dates back to the 18th century when it was originally a coaching house. Inside there's a cosy interior with roaring fires while outside there's a nice courtyard garden. You can find them at 23 Church Cl, NR14 6LX. The pub is a short stroll from the River Chet and the historic church which dates to 1490."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative walk along the river see the Yare Valley Walk page. You can pick this up south west of Norwich at the Marston Marshes Nature Reserve. The 6 mile trail heads through Cringleford to the man made broad in the pleasant grounds of the University of East Anglia. In Norwich you can try the Norwich Riverside Walk which takes you along the River Wensum in the city. For more walking ideas in the area see the Norfolk Walks and Norfolk Broads Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/TOUWkJCdC7c",
  "postcode": "NR1 1EG",
  "district": "Norwich",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}