{
  "created_at": "2025-01-06T01:37:11.514309+00:00",
  "objectID": "b893b2045b7c5f0d5fb994abe779369f",
  "ref": "tintagel-to-port-isaac-walk-walking-route",
  "title": "Tintagel to Port Isaac Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/44/Tintagel_Castle_-_geograph.org.uk_-_646.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Port Isaac",
      "objectID": "2fdae526be77a5d7cb85029592676651",
      "ref": "port-isaac-walking-route"
    },
    {
      "description": "Tintagel",
      "objectID": "4dd22fde1026b628e3d407bc7b3987f4",
      "ref": "tintagel-walking-route"
    },
    {
      "description": "Port Isaac to Port Gaverne Walk",
      "objectID": "2aa9a31bbf8a7b572ffd8525aa563d35",
      "ref": "port-isaac-to-port-gaverne-walk-walking-route"
    },
    {
      "description": "Polzeath to Port Isaac Walk",
      "objectID": "93ca4dd419364e50f07634c2fb685804",
      "ref": "polzeath-to-port-isaac-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b893b2045b7c5f0d5fb994abe779369f.gpx",
  "_geoloc": {
    "lat": 50.6671391148,
    "lng": -4.7587607038
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Tintagel_Castle_-_geograph.org.uk_-_646.jpg",
      "title": "Alan Simkins / Tintagel Castle, via Wikimedia Commons",
      "caption": "Tintagel Castle. Taken from the grounds of the Camelot Castle Hotel, looking west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Trebarwith_Strand_-_geograph.org.uk_-_563275.jpg",
      "title": "Trevor Rickard / Trebarwith Strand",
      "caption": "Trebarwith Strand. View south as the coast path starts to descend to the little cluster of houses around the stream mouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Tintagel%2C_Trebarwith_Strand_-_geograph.org.uk_-_842409.jpg",
      "title": "Martin Bodman / Tintagel: Trebarwith Strand",
      "caption": "Tintagel, Trebarwith Strand. The tourist shops seen from the South West Coast Path to Tintagel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Tintagel%2C_course_of_old_leat_-_geograph.org.uk_-_1337499.jpg",
      "title": "Martin Bodman / Tintagel: course of old leat",
      "caption": "Tintagel: course of old leat. The leat runs towards Backways Cove. There was possibly a mine pumped by a waterwheel here in the nineteenth century. Thrift grows here in abundance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Treligga_cliffs_and_beyond_-_geograph.org.uk_-_1241656.jpg",
      "title": "William Bartlett / Treligga cliffs and beyond",
      "caption": "Treligga cliffs and beyond. In the far distance St Materiana's Church and Tintagel Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Tregannick_Point_-_geograph.org.uk_-_1241595.jpg",
      "title": "William Bartlett / Tregannick Point",
      "caption": "Tregannick Point. Gorse covered Tregannick Point on the left and The Mountain (rather crumbling) on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Tregardock_Cliff_-_geograph.org.uk_-_1241672.jpg",
      "title": "William Bartlett / Tregardock Cliff",
      "caption": "Tregardock Cliff. The South West Coast Path zigzags past old mineshafts on the left. In the very far distance above The Mountain is Port Isaac."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Port_Isaac_harbour_-_geograph.org.uk_-_561067.jpg",
      "title": "Trevor Rickard / Port Isaac harbour",
      "caption": "View down to Port Isaac harbour. Once a busy trading and fishing harbour, but very much a tourist destination now. The port dates from Saxon times. By the 16th century trade was mainly in pilchards, reaching a high point in the 19th century. In 1850 there were 49 fishing boats based here. When I was a child in the 1960s, this was a quiet place where us local Cornish people came to get away from the crowds, but no longer! The Doc Martin series has made it even more popular"
    }
  ],
  "distance_km": 12.0,
  "description": "This walk follows a splendid section of the South West Coast Path from the historic castle at Tintagel to the little fishing village of Port Isaac. The picturesque village is the setting for ITV's 'Doc Martin' show starring Martin Clunes. It's another of the highlights of the area and well worth a visit. The route runs for a distance of just under 8 miles along an undulating path with fabulous views throughout. The walk starts on the coast at Tintagel and follows the waymarked path south to Trebarwith Strand. This area has 800m of sandy beach, contained by cliffs, in which natural caves are found. There is also a little village with shops and cafes. See the video below for more details. The route continues south to Tregardock where there is a cliff and beach of the same name. The final section takes you past Jacket's Point and Ranie Point before passing along Port Isaac Bay and finishing in the village. There's lots of quaint 18th century cottages to see on narrow winding streets in the charming village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At one end of the route there's Charlie's in Tintagel village. It's a small, well established, family restaurant and delicatessen with great food and a nice outdoor seating area. You can find it in an old 14th century cottage located on Fore St with a postcode of PL34 0DA. At the end of the route in Port Isaac head to the Golden Lion for post walk refreshments. The charming 18th century pub includes the ‘Bloody Bones Bar’ which boasts a smuggling tunnel leading down onto a causeway on the beach. Inside is full of character with a cosy fire and friendly atmosphere. Outside there's terraces with a fabulous view of the harbour and cliffs. It's the perfect spot to enjoy some delicious fish and chips on a fine day. You can find them by the harbour at 10 Fore Street with a postcode of PL29 3RB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The bracing cliff top path is a fine one for fit dogs. The Golden Lion mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Continue west along the coast path on the Polzeath to Port Isaac Walk and you will come to Pentire Point and the lovely surfing beach at Polzeath. Here you can pick up the Rock to Polzeath Walk which runs along the Camel Estuary across from Padstow. From Rock you can catch the ferry over Padstow on the other side of the river. Here you can pick up the Padstow to Harlyn Bay Walk, the Padstow to Trevone Bay Walk and the Stepper Point Walk. There's also the popular Camel Trail, a shared cycling and walking trail running along the river to Wadebridge. For more walking ideas in the area see the Cornwall Walks page. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wALgS0Nxflw",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Upper countryard, Tintagel Castle Bridge, Tintagel, Cornwall, England, PL34 0DQ, United Kingdom",
  "postcode": "PL34 0DQ",
  "district": "Tintagel",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "beach",
    "cliff"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "villages"
  ],
  "facilities": [
    "shops",
    "cafes",
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}