{
  "created_at": "2025-01-05T23:41:28.019973+00:00",
  "objectID": "b973128618e024ff08f768974465ea4a",
  "ref": "stamford-walking-route",
  "title": "Stamford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Town_Hall_1_St_Marys_Hill_%28geograph_3593789%29.jpg/512px-Town_Hall_1_St_Marys_Hill_%28geograph_3593789%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b973128618e024ff08f768974465ea4a.gpx",
  "_geoloc": {
    "lat": 52.6526613732,
    "lng": -0.4776186621
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Town_Hall_1_St_Marys_Hill_%28geograph_3593789%29.jpg/512px-Town_Hall_1_St_Marys_Hill_%28geograph_3593789%29.jpg",
      "title": "Jo Turner [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stamford Town Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/A_quiet_day_beside_the_river_-_geograph.org.uk_-_1087733.jpg",
      "title": "Row17 [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A quiet day beside the river"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/River_Welland_-_geograph.org.uk_-_487677.jpg",
      "title": "Graham Horn / River Welland",
      "caption": "River Welland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Broadeng_Bridge_-_geograph.org.uk_-_487684.jpg",
      "title": "Graham Horn / Broadeng Bridge",
      "caption": "Broadeng Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Tinwell_gauging_station_-_geograph.org.uk_-_1619788.jpg",
      "title": "Tim Heaton / Tinwell gauging station",
      "caption": "Tinwell gauging station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Bridge_over_railway_and_stream_-_geograph.org.uk_-_487702.jpg",
      "title": "Graham Horn / Bridge over railway and stream",
      "caption": "Bridge over railway and stream"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Jurassic_Way_approaches_Stamford_-_geograph.org.uk_-_350895.jpg",
      "title": "Ken Brockway / Jurassic Way approaches Stamford",
      "caption": "Jurassic Way approaches Stamford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Church_Street%2C_Easton_on_the_Hill_-_geograph.org.uk_-_1621028.jpg",
      "title": "Tim Heaton / Church Street, Easton on the Hill",
      "caption": "Church Street, Easton on the Hill"
    }
  ],
  "distance_km": 4.0,
  "description": "The Lincolnshire town of Stamford has a number of good options for walkers visiting the area. Several waymarked long distance trails run through the town and out into the surrounding countryside. There's riverside trails along the River Welland and lovely parkland to explore in the nearby Burghley House too. It's also nice to stroll around the attractive town centre which has 17th and 18th-century stone buildings, older timber-framed buildings and five medieval parish churches. The whole of the old town and St Martin's has been made an outstanding area of architectural or historic interest that is of national importance. In 2013, Stamford was rated the best place to live by The Sunday Times. This short walk follows sections of the Hereward Way and Jurassic Way from the town centre to the nearby village of Easton on the Hill. It starts on riverside paths before climbing through the countryside to the village. To continue your walking in the area you can follow the Hereward Way south west from the town. This will take you across the parkland of Burghley House. The grounds were laid out by Capability Brown and include a 26 acre lake, a deer park and a sculpture park. The trail will eventually lead you into Cambridgeshire and the city of Peterborough. You can also walk to Peterborough along the Torpel Way. This route runs for about 11 miles through through countryside and agricultural land. It includes a riverside stretch along the Welland at the start. For some nice woodland trails, head south west and visit Rockingham Forest where you can explore Fineshade Woods and Wakerley Woods. Rutland Water is located just to the west of the town. There's miles of great waterside cycling and walking trails to be found here. The epic Macmillan Way also passes through the town. Follow it north east and it will take you to Greatford with views of the West Glen River.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the north west there's the neighbouring village of Exton. There's a pleasant circular walk here taking you around the parkland of the old Exton Hall before visiting the two pretty lakes at Fort Henry. Near here there's also Empingham where you can enjoy a stroll down to the dam at Rutland Water. There's also Clipsham where you can enjoy a stroll along the tranquil Yew Tree Avenue with its splendid topiary. The pretty village also includes an award winning pub for refreshments afterwards. A few miles to the south west you'll find the pretty village of King's Cliffe where you can pick up the Kings Cliffe Railway Walk. The easy trail runs along a now disused railway line to the east of the village. King's Cliffe is also a pleasant place for a stroll with a Norman church, picturesque 17th century almshouses and nice views of the Willow Brook, a tributary of the River Nene. There's also a fine old 18th century pub for refreshments afterwards. Near here there's also Blatherwycke Lake to explore. There's some lovely waterside trails with lots of birdlife to see on the water at this scenic spot. Follow the Torpel Way south east and you could visit neighbouring Barnack and the Barnack Hills And Holes National Nature Reserve. There's a rather interesting and unusual landscape here with grassy undulating slopes in an ancient medieval quarry. The site is noted for some signficant flora and fauna as well. You can find the reserve on the western side of Barnack village. Postcode for sat navs is PE9 3EU."
    }
  ],
  "postcode": "PE9 2AY",
  "district": "Stamford",
  "county": "Lincolnshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}