{
  "created_at": "2025-01-06T04:35:43.119645+00:00",
  "objectID": "b9b08074c8c49e9ea1ebb0b8385ddd8b",
  "ref": "jurassic-way-walking-route",
  "title": "Jurassic Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Elkington_-_geograph.org.uk_-_198836.jpg",
  "nearby": [
    {
      "description": "Banbury",
      "objectID": "9b6dffe408e213078eae4782d07532b7",
      "ref": "banbury-walking-route"
    },
    {
      "description": "Rockingham Castle",
      "objectID": "da826f9698a839f9ba8504c17c5fe01d",
      "ref": "rockingham-castle-walking-route"
    },
    {
      "description": "East Carlton Park",
      "objectID": "a74a56c4554d6f1f3a397693dfe9f678",
      "ref": "east-carlton-park-walking-route"
    },
    {
      "description": "Fineshade Woods",
      "objectID": "aba4ed04ae028956ccf57347e8e6a532",
      "ref": "fineshade-woods-walking-and-cycle-route"
    },
    {
      "description": "Wakerley Woods",
      "objectID": "43e7ff77d461883a2ac1dada799819aa",
      "ref": "wakerley-woods-walking-and-cycle-route"
    },
    {
      "description": "Welford",
      "objectID": "de0ee67cee0633fa4f3296d0147e8b60",
      "ref": "welford-walking-route"
    },
    {
      "description": "Braunston to Whilton Locks",
      "objectID": "06ccbc072a8e86ccc09e327e544c7ee6",
      "ref": "braunston-to-whilton-locks-walking-route"
    },
    {
      "description": "Harringworth Welland Viaduct",
      "objectID": "6402c801bd00042c8f38254b0a54dabf",
      "ref": "harringworth-welland-viaduct-walking-route"
    },
    {
      "description": "Grand Union Canal Walk",
      "objectID": "dae6d837fcdb83dc44e94da2b24b4040",
      "ref": "grand-union-canal-walk-walking-route"
    },
    {
      "description": "Oxford Canal Walk",
      "objectID": "7dac2fdaf42e1348ecd8d2e4b59e7953",
      "ref": "oxford-canal-walk-walking-route"
    },
    {
      "description": "Kings Cliffe Railway Walk",
      "objectID": "4ab67c0af9f67651b479fcc04e650522",
      "ref": "kings-cliffe-railway-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/b9b08074c8c49e9ea1ebb0b8385ddd8b.gpx",
  "_geoloc": {
    "lat": 52.0611422786,
    "lng": -1.3300495484
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Elkington_-_geograph.org.uk_-_198836.jpg",
      "title": "Ian Rob / Elkington",
      "caption": "Elkington. Jurassic Way Footpath follows the towpath of the Grand Union Canal at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Staverton_-_geograph.org.uk_-_119393.jpg",
      "title": "Ian Rob / Staverton",
      "caption": "Staverton. Looking west towards Flecknoe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Jurassic_Way_-_geograph.org.uk_-_202585.jpg",
      "title": "David Stowell / Jurassic Way",
      "caption": "The bridleway and named footpath as it crosses a small brook just north of the village of Chacombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Trent_Valley_view_-_geograph.org.uk_-_179132.jpg",
      "title": "Richard Croft / Trent Valley view",
      "caption": "View across the Trent Valley from the Jurassic Way near North Carlton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Broadeng_Bridge_-_geograph.org.uk_-_487684.jpg",
      "title": "Graham Horn / Broadeng Bridge",
      "caption": "Broadeng Bridge. South-west of Stamford a footpath crosses the River Welland at Broadeng Bridge. It is a popular local walk through the water meadows, but is also shared by three long distance paths, the Hereward Way, the Jurassic Way and the Macmillan Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/North_Carlton_from_the_Jurassic_Way_-_geograph.org.uk_-_179122.jpg",
      "title": "Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View to North Carlton and across the Trent Valley beyond from the cliff road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/View_over_Upper_Wardington_-_geograph.org.uk_-_431240.jpg",
      "title": "Duncan Lilly / View over Upper Wardington",
      "caption": "View over Upper Wardington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Stamford_town_scape_-_geograph.org.uk_-_1737389.jpg/512px-Stamford_town_scape_-_geograph.org.uk_-_1737389.jpg",
      "title": "Michael Trolove / Stamford town scape",
      "caption": "Stamford town scape — Lincolnshire, northeast England. A view looking towards Stamford whilst standing in Freemen's meadow an area of unimproved grassland. Popular with walkers and dogs, indeed the long distance footpaths, the Macmillan Way and the Jurassic Way both pass through the wooden gate. *The Macmillan Way heads on towards Boston — whereas this is the start/finish trailhead of the Jurassic Way long distance pathway, that heads to/arrives from the Banbury trailhead here."
    }
  ],
  "distance_km": 141.0,
  "description": "This walk follows the Jurassic limestone ridge from Banbury to Stamford passing through Northamptonshire, Oxfordshire and Lincolnshire. The walk includes a stretch along the Oxford Canal from Banbury and another waterside stretch along the Grand Union Canal near Braunston. There's nice woodland trails through Fineshade Woods in the ancient Rockingham Forest area and you will also enjoy fine views of the River Welland as you approach Stamford. The route passes through a series of picturesque towns and villages including Wardington, Catesby, Welford, Braunston, Ashby St Ledgers (with its impressive Manor House), West Haddon and Middleton. You'll also pass close to Naseby Battlefield, site of the famous Battle of Naseby in the English Civil War in 1645. There's a section along Welford and Sulby Reservoir here too.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At lock number 3 in Braunston you can visit the canalside Admiral Nelson for some refreshments. The interesting building itself dates back to 1730 and pre-dates the canal. It was originally a farm building and cows were milked where the restaurant is today and a green grocer’s shop which opened onto the lock side was where there is now a skittles room. There's a lovely beer garden where you can sit out in the summer months, and watch the canal boats and the world go by. You can cosy up in the winter next to the roaring open fire. The pub is right on the canal in Braunston at postcode NN11 7HJ. In the Northamptonshire village of Harringworth there's the Spokes cafe to consider. The friendly cafe sells a good range of meals, snacks and treats. There's pleasant outdoor seating and a secure courtyard for bike storage. You can find them at Meadow Cottage with a postcode of NN17 3AH for your sat navs. The village is located close to the impressive Harringworth Welland Viaduct, which is one of the highlights on the route. The Grade II listed viaduct is about a kilometre long, and was completed in 1878. It contains 82 arches and is notable as the longest masonry viaduct across a valley in Britain. Just east of Fineshade Woods in Northamptonshire there's the pretty village of King's Cliffe where you could stop off at The Cross Keys. The pub dates back to 1732 and includes a charming old interior with oak beams and inglenook fireplaces. They serve a fine Sunday roast and also provide rooms if you'd like to stay over. You can find them on West Street at postcode PE8 6XA for your sat navs. You can also pick up the Kings Cliffe Railway Walk here. The easy trail runs along a now disused railway line to the east of the village. King's Cliffe is also a pleasant place for a stroll with a Norman church, picturesque 17th century almshouses and nice views of the Willow Brook, a tributary of the River Nene. Near here there's also Blatherwycke Lake to explore. There's some lovely waterside trails with lots of birdlife to see on the water at this scenic spot."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Ashby St Ledgers look out for the historic manor house famous as the location for the planning of the Gunpowder Plot in 1605."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2TLzoWp-pPs",
  "district": "Cherwell",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rainbows Day Nursery, Bridge Wharf, Banbury, Cherwell, Oxfordshire, England, OX16 5AY, United Kingdom",
  "postcode": "OX16 5AY",
  "state": "England"
}