{
  "created_at": "2025-01-05T23:43:17.426540+00:00",
  "objectID": "ba4d6688eb4e8a6e137d00cf99792fce",
  "ref": "sturminster-newton-walking-route",
  "title": "Sturminster Newton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/84/Sturminster_Newton_-_geograph.org.uk_-_336277.jpg",
  "nearby": [
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "North Dorset Trailway",
      "objectID": "c2aac15bf602a0f263fb0a830fe33277",
      "ref": "north-dorset-trailway-walking-and-cycle-route"
    },
    {
      "description": "Okeford Hill",
      "objectID": "ea5f5980dd9b4b6072e40f72b1f4572d",
      "ref": "okeford-hill-walking-and-cycle-route"
    },
    {
      "description": "Hambledon Hill",
      "objectID": "1c8969a67e3f43ad1c56c46ff4f8da7d",
      "ref": "hambledon-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/ba4d6688eb4e8a6e137d00cf99792fce.gpx",
  "_geoloc": {
    "lat": 50.9262637781,
    "lng": -2.3050721605
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Sturminster_Newton_-_geograph.org.uk_-_336277.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sturminster Newton. The town's name is derived from its church or 'minster', and the River Stour which flows round the town. It has been the market centre for the rich Stour farmlands since the 13th century. The town suffered badly from two fires in 1681 and 1759, but still retains many old thatched house, as well as pleasant bow-windowed buildings of brick, stone and cob. The town has associations with two notable literary figures, William Barnes and Thomas Hardy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/The_Market_House_Sturminster_Newton_-_geograph.org.uk_-_250339.jpg",
      "title": "Roy Louis D Cox / The Market House Sturminster Newton",
      "caption": "The Market House. Originally one of the main trading places in the square at Sturminster, the first floor of which provided premises for a dressmaking business in the late 19th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Sturminster_Newton_mill_-_geograph.org.uk_-_30926.jpg",
      "title": "Steve / Sturminster Newton mill",
      "caption": "Sturminster Newton mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Sturminster_Newton_Trailway_geograph-4022040-by-Ben-Brooksbank.jpg/512px-Sturminster_Newton_Trailway_geograph-4022040-by-Ben-Brooksbank.jpg",
      "title": "Ben Brooksbank / Sturminster Newton: Trailway on track-bed of former Somerset & Dorset Railway",
      "caption": "Trailway on track-bed of former Somerset & Dorset Railway. View SE from off Barnes Lane, towards Blandford Forum: former S&D Joint Railway, Bath - Templecombe - Blandford - Broadstone (- Poole - Bournemouth West)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Town_Bridge%2C_Sturminster_Newton_-_geograph.org.uk_-_1318978.jpg",
      "title": "Mike Searle / Town Bridge, Sturminster Newton",
      "caption": "Town Bridge. This 6 arch bridge spans the River Stour a few hundred yards downstream from the more iconic Sturminster Mill. However, with its grade I listed status, it carries more weight (if you'll pardon the pun) than its near neighbour, and is of course much older, dating from circa 1500. It was widened in the C17, and this included corbelling over the central arches to provide pedestrian refuges."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Fiddleford_Manor_-_geograph.org.uk_-_79011.jpg",
      "title": "John Lamper / Fiddleford Manor",
      "caption": "Fiddleford Manor. The right-hand end of this building is part of a medieval manor house containing 600-year-old roofs of the hall and upper living room with collar-beam trusses and timberwork of great complexity. There is more of the manor to the rear, where it is approached from the free car park. The adjoining building is private and not open to visitors. Fiddleford Manor is now in the care of English Heritage. The water course in the foreground is the supply for Fiddleford Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Fiddleford_Mill_-_geograph.org.uk_-_1290469.jpg",
      "title": "Mike Searle / Fiddleford Mill",
      "caption": "Fiddleford Mill. The watermill is probably an C18 rebuild of a much earlier structure, and has a dated inscription of 1566 on two stone blocks that has since been reset into the wall. Grade II listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Fiddleford_Mill_Pond_-_geograph.org.uk_-_378949.jpg",
      "title": "Marilyn Peddle / Fiddleford Mill Pond",
      "caption": "Fiddleford Mill Pond. Crossing the Mill leat at Fiddleford Mill, notice the wheel like structures which were used to control the flow of the water."
    }
  ],
  "distance_km": 6.0,
  "description": "This Dorset based town has some lovely river and country walks with historic mills and local pockets of woodland to visit as well. It's also notable as the former home of author Thomas Hardy who lived here from 1876 to 1878. He wrote The Return of the Native while residing in the town. The town is set in the vale on which Hardy based his the Vale of the little dairies which features in the novel Tess of the d'Urbervilles. This circular walk from the town takes you to the ancient Fiddleford Manor, the picturesque Fiddleford Mill, Piddles Wood and Newton. The walk starts in the town centre where you can pick up the Stour Valley Way and follow the waymarked footpath east along the river to Fiddleford Manor. This small stone manor house is thought to date from around 1370 and was built for William Latimer, Sheriff of Somerset and Dorset. The house is now run by English heritage who often run exhibitions at the property. The route then crosses the river and heads past the old Fiddleford Mill. The watermill is thought to date back to the 18th century and includes a tiled roof with stone slate verges and gable ends. From the mill you head south west to explore the woodland trails in Piddles Wood where there are good bird spotting opportunities. The route then heads north west through Broad Oak and Glue Hill before crossing the river on the Sturminster Newton town bridge. You can then follow another riverside footpath north back into the town centre. This section will pass close to the historic Stuminster Mill which is now run as a museum.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the town the Swan Inn is a nice place for post walk refreshment. The former coaching inn includes a large open bar, a separate dining area and a lovely secluded garden. It's located in the medieval market place at postcode DT10 1AR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and woodland trails make for a fine walk with your dog. The Swan Inn mentioned above is also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of the start of the walk you can visit the Butts Pond nature reserve in the town centre. The reserve includes meadows, hedges, ditches and ponds. It is notable as the last remnant of the grazing land associated with the Sturminster Livestock Market. It's a great place for a peaceful stroll in the town centre with wildlife and wildflowers to see in the summer months. You can access it off Selwood Close, just north of the old railway line. The North Dorset Trailway passes through the town. The shared walking and cycling path follows a dismantled railway line from Stalbridge to Spetisbury. To the south there's the climb to Okeford Hill to try. There's great views here and some popular mountain bike trails for cyclists as well. The epic Wessex Ridgeway can be picked up on the hill too. To the east there's Child Okeford and the climb to Hambledon Hill. Here you'll find one of the country's best preserved Iron Age hill forts and a nature reserve. Another fort sits atop the adjacent Hod Hill, near to Stourpaine. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/uZbtlBgw2iA",
  "district": "Sturminster Newton",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Market Place, Sturminster Newton, Dorset, England, DT10 1AR, United Kingdom",
  "postcode": "DT10 1AR",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "woodland trails",
    "river"
  ],
  "facilities": [
    "visitor center",
    "museum",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}