{
  "created_at": "2025-01-06T04:06:30.538843+00:00",
  "objectID": "ba7ae58ed476b1a8c7ca82c9e1dbcbe6",
  "ref": "white-nancy-walking-route",
  "title": "White Nancy Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/57/White_Nancy_-_geograph.org.uk_-_411879.jpg",
  "nearby": [
    {
      "description": "Tegg's Nose Country Park",
      "objectID": "7a63ac6888ee9bd47a98ad67811ef794",
      "ref": "teggs-nose-country-park-walking-and-cycle-route"
    },
    {
      "description": "Gritstone Trail",
      "objectID": "928e56c6a6c868355ef1a26f5e709aad",
      "ref": "gritstone-trail-walking-route"
    },
    {
      "description": "Macclesfield Canal",
      "objectID": "f6f2ea4897414d4bfee5e1c7747a748f",
      "ref": "macclesfield-canal-walking-route"
    },
    {
      "description": "Poynton",
      "objectID": "b6573ce55ee6388279d14374c30952a6",
      "ref": "poynton-walking-route"
    },
    {
      "description": "Pott Shrigley Walk",
      "objectID": "48cfa54df0668d9f67451620d6d8ef96",
      "ref": "pott-shrigley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/ba7ae58ed476b1a8c7ca82c9e1dbcbe6.gpx",
  "_geoloc": {
    "lat": 53.2943138509,
    "lng": -2.0953046183
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/White_Nancy_-_geograph.org.uk_-_411879.jpg",
      "title": "Jeff Tomlinson / White Nancy",
      "caption": "White Nancy was built as a summer house by the Gaskell family. The white-washed, sugarloaf-shaped folly was erected in 1817 as a monument to the Duke of Wellington's victory at the Battle of Waterloo in 1815. The structure was built of rendered sandstone rubble. The entrance is now blocked but inside is a room with and a circular stone table surrounded by a curved stone bench. It is a protected Grade II listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/White_Nancy_-_geograph.org.uk_-_43492.jpg",
      "title": "Andrew Huggett / White Nancy",
      "caption": "Kerridge Hill at sunset. The distinctive profile forms the logo for the town of Bollington. The structure has been acclaimed and has featured in countdowns of the best British follies identified by The Telegraph newspaper."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Kerridge_Hill_and_White_Nancy_-_geograph.org.uk_-_1276554.jpg",
      "title": "Peter Taylor / Kerridge Hill and White Nancy",
      "caption": "View of the folly from afar. White Nancy commands extensive views across Cheshire and on clear days, Snowdonia in Wales can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Kerridge_Ridge_and_White_Nancy_Monument_-_geograph.org.uk_-_1167404.jpg",
      "title": "gareth / Kerridge Ridge and White Nancy Monument",
      "caption": "Autumn view from Clarke Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Footpath_to_Saddle_of_Kerridge_-_geograph.org.uk_-_2167806.jpg",
      "title": "Footpath to Saddle of Kerridge by Chris Wimbush, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath to Saddle of Kerridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Trig._point_on_Kerridge_Hill_-_geograph.org.uk_-_3530945.jpg/512px-Trig._point_on_Kerridge_Hill_-_geograph.org.uk_-_3530945.jpg",
      "title": "Trig. point on Kerridge Hill by Raymond Knapman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Trig. point on Kerridge Hill. This hill is located just to the south of White Nancy on the Saddle of Kerridge. It stands at a height of 313 metres (1,027 ft) above sea level. The area is a designated nature reserve, managed and owned by the Cheshire Wildlife Trust. In the reserve there's interesting flora including species-rich grassland with an abundance of native wildflowers such as betony, devils-bit scabious and knapweed. This grassland habitat attracts pollinators such as bumblebees and 10 butterfly species, including small heath, wall brown and small skipper. Blackcap, chiffchaff and tawny owls are among the birds which inhabit the reserve. In autumn the rare waxcap mushroom spreads through the grass sward"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Walkers_on_Kerridge_Ridge_-_geograph.org.uk_-_3180321.jpg",
      "title": "Walkers on Kerridge Ridge by Row17, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Walkers on Kerridge Ridge. On the west side of the ridge are Bridge Quarry and Marksend Quarry. The boundary between the two quarries is marked with an estate boundary stone, which is dated 1830. The ashlar sandstone block, at the base of a dry stone wall, is designated Grade II on the national heritage list. Below Bridge Quarry is Endon Hall, which was built in the 1830s by William Clayton who owned the local quarries"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Footpath_junction_north_of_Kerridge_End_-_geograph.org.uk_-_3490088.jpg/512px-Footpath_junction_north_of_Kerridge_End_-_geograph.org.uk_-_3490088.jpg",
      "title": "Footpath junction north of Kerridge End by John Slater, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath junction north of Kerridge End"
    }
  ],
  "distance_km": 3.5,
  "description": "This walk climbs to unusual structure of White Nancy overlooking the town of Bollington in Cheshire. The folly is in the shape of a small domed sugar loaf and thought to have been built in 1817 by Colonel Gaskell as a monument to the Battle of Waterloo. This circular walk makes use of the Gritstone Trail to take you from Bollington to the 280.5 metres (920 ft) high White Nancy before crossing the Saddle of Kerrridge to Kerridge Hill. From the elevated position above the town you can enjoy splendid views across the Cheshire Plain, the mountains of North Wales to the west, the hills of Shropshire to the south and the Pennines to the north and east. It's easy to extend your walk by continuing along the Gritstone Trail to the nearby Tegg's Nose Country Park .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east of the hill you will find the Bulls Head in the hamlet of Kerridge. It's a decent pub and perfectly located just a stones throw from the hill. The pub dates from the 17th century and has a lovely cosy interior to relax in after your exercise. It's nice outside too with a patio area and a garden both with great views. In the paddocks attached to the pub you will usually find pigs and sheep looked after by the landlord. It's a friendly place with a good menu and selection of ales. You'll probably see plenty of other walkers in there too on a fine day. You can find the pub at the foot of the hill on 2 Oak Lane with a postcode of SK10 5BD for your sat navs. You could also visit the village of Rainow which lies just to the south east. The village has a fine local pub in the shape of the Robin Hood where you could enjoy some relaxation and refreshment after your exercise. The pub has a large car park and a fine outdoor decking area with splendid views towards White Nancy and other Peak District hills. The quaint old inn also serves fine food with a good tapas selection on the menu. You can find them at Chapel Brow with postcode SK10 5XE for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "About 3 miles north of the hill you will find one of the highlights of the area at Lyme Park. The expansive park has miles of cycling and walking trails with woodland, ponds and deer to look out for on the way. It's a great way to extend your walking in the area.  Pictured above, the splendid Lyme Park. The National Trust owned park is located only a few miles from Bollington. The Macclesfield Canal also runs through Bollington. You can pick it up a quarter of a mile east of the hill. If you follow the towpath north it will take you to Poynton, heading south will take you into Macclesfield itself. Our Bollington Circular Walk visits the folly before heading to the canal to see the old historic mills there. The 12.5 mile circular Macclesfield Walk starts from the nearby town and visits the hill as well as several of the other local walking highlights. To the east there's the highest point in Cheshire to visit on the Shining Tor and Cats Tor Walk. In this area you'll also find some easy waterside walking around Lamaload Reservoir, Errwood Reservoir and Fernilee Reservoir. To the north is the circular Pott Shrigley Walk which will take you around the old Shrigley Hall to the surrounding moors."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Bga0zrCZTik",
  "postcode": "SK10 5GJ",
  "district": "Bollington",
  "county": "Cheshire East",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cow Lane, Kerridge, Bollington, Cheshire East, England, SK10 5GJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "gritstone"
  ],
  "points_of_interest": [
    "monument",
    "viewpoint"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}