{
  "objectID": "baeb9966ddcd6c9b63c758197707785b",
  "created_at": "2024-12-18T23:29:35.896305+00:00",
  "ref": "danbury-common-walking-and-cycle-route",
  "title": "Danbury Common Mtb and Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Danbury_Common_-_geograph.org.uk_-_1282346.jpg",
  "nearby": [
    {
      "description": "Danbury Country Park",
      "objectID": "5b72e7516929a13798749e376afe3438",
      "ref": "danbury-country-park-walking-route"
    },
    {
      "description": "Galleywood Common",
      "objectID": "bf65e809e8cfdee6b5841bc7f3b280cd",
      "ref": "galleywood-common-walking-route"
    },
    {
      "description": "Little Baddow",
      "objectID": "73e19070cdb4500be06a760fb8d3697d",
      "ref": "little-baddow-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/baeb9966ddcd6c9b63c758197707785b.gpx",
  "_geoloc": {
    "lat": 51.7072089733,
    "lng": 0.5735836094
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Danbury_Common_-_geograph.org.uk_-_1282346.jpg",
      "title": "Glyn Baker / Danbury Common",
      "caption": "Danbury Common is 218 acres (87 ha) of heath and woodland owned by the National Trust It includes one of the largest areas of heath left in Essex."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Pensioner%27s_Box_-_Danbury_Common_-_geograph.org.uk_-_324092.jpg",
      "title": "Malcolm Reid / Pensioner's Box - Danbury Common",
      "caption": "Pensioner's Box. Wanding through Danbury Common, it may come as a surprise to find two cottages (one of them shown here) apparently in the middle of National Trust land. They are known as 'Pensioner's Box'. In fact they are on the edge of the Danbury Common but their only access is along a small track/bridleway which crosses through woodland of the Common."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/The_Old_Armoury_-_Danbury_Common_-_geograph.org.uk_-_308465.jpg",
      "title": "Malcolm Reid / The Old Armoury - Danbury Common",
      "caption": "The Old Armoury. The original 'Old' Armoury was built in 1802 as a military store to support troup stationed on Danbury Common at a time when an invasion by Napoleon was thought possible. The original Armoury was destroyed by fire in 1996; this replica building is now used as a base for the National Trust Warden (Chelmsford District)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Danbury_Common_-_Heathland_-_geograph.org.uk_-_324667.jpg",
      "title": "Malcolm Reid / Danbury Common - Heathland",
      "caption": "Heathland on the common. For centuries Danbury Common was used for grazing cattle, goats and sheep, particularly in those areas where the ground is a poor quality gravel, ill suited to agriculture. This resulted in the generation of open heathland covered by small shrubs and heathers. The National Trust now maintains large areas of the Common as heath, encouraging the natural flora and the invertebrates which are attracted to the sunny open landscape. Heathland is rare in this part of Britain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Danecourt_-_Danbury_Common_-_geograph.org.uk_-_313260.jpg",
      "title": "Malcolm Reid / Danecourt - Danbury Common",
      "caption": "Danecourt. This house on the edge of the Common only has vehicle access along a track which runs across the Common. This building is new, the original \"Danecourt\" having been demolished at the beginning of the 21st Century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Buell_Well_-_Danbury_Common_-_geograph.org.uk_-_313274.jpg",
      "title": "Malcolm Reid / Buell Well - Danbury Common",
      "caption": "Buell Well. At the side of the footpath which runs along the eastern edge of the Common is Buell Well. This provided the drinking water for Danbury in the 18th and early 19th Centuries. On the right hand side of the photograph the foundations of the old pumping station are still visible. On the left hand side of the photograph it is just possible to see the pipe from the well, from which spring water gushes all year round, even in drought conditions. (If you a fancy a drink on a hot summer's day, do not take water from the pool below the pipe as this is mixed with ditch water!)"
    }
  ],
  "distance_km": 2.5,
  "description": "This large area of woodland and heath is managed by the National Trust. As such you will find a number of well maintained footpaths taking you through the common. It's also great for mountain biking with a number of trails. There's a freeride area maintained by locals with some excellent downhill runs. See the video below for an example of the jumps and runs you can find on the common. The site includes the Backwarden Nature Reserve where you'll find woodland, common, heath, wild flowers, streams and bogs. Look out for a variety of wildlife in this area including adders, nesting birds and butterflies. Danbury is an excellent area for walking. You can easily extend your walk by heading north to Lingwood Common and Blake's Wood where you will find orchids and carpets of bluebells in the spring. Just a mile to the west you'll find Danbury Country Park where there's lakeside trails and wildflower meadows. This circular route is designed for walkers but cyclists can enjoy the bridleways that criss cross the common. It's a popular area for mountain bikers with a number of trails to try.",
  "video_url": "https://www.youtube.com/embed/5TMKUWr70Pw",
  "district": "Danbury",
  "county": "Essex",
  "region": "Eastern",
  "country": "England"
}