{
  "created_at": "2025-01-06T03:52:59.322012+00:00",
  "objectID": "bb23c02c721aec9c80dc34ea00040ae7",
  "ref": "banstead-woods-walking-route",
  "title": "Banstead Woods Nature Trail Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Park_Downs_-_geograph.org.uk_-_1097818.jpg",
  "nearby": [
    {
      "description": "Epsom Common",
      "objectID": "656c0a6d774146c0200b43d01392b732",
      "ref": "epsom-common-walking-and-cycle-route"
    },
    {
      "description": "Banstead Downs",
      "objectID": "34f0357596dabc825ef3241cd1c9f865",
      "ref": "banstead-downs-walking-route"
    },
    {
      "description": "Tadworth",
      "objectID": "02e606dc5ec97a58e67b885cb393b9bb",
      "ref": "tadworth-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bb23c02c721aec9c80dc34ea00040ae7.gpx",
  "_geoloc": {
    "lat": 51.3095521463,
    "lng": -0.1748702572
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Park_Downs_-_geograph.org.uk_-_1097818.jpg",
      "title": "Hugh Craddock / Park Downs",
      "caption": "Park Downs is common land and a site of special scientific interest because of its downland flora, although the battle against scrub encroachment is ceaseless. The Downs are managed by the Banstead Commons Conservators, but unusually, the rights of common (to graze animals on Park Downs) belong to the National Trust. In the distance, rising above Banstead Wood, is the water tower of the former Queen Elizabeth Hospital, now converted to a residential estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Parkland_by_Banstead_Woods_-_geograph.org.uk_-_583741.jpg",
      "title": "Derek Harper / Parkland by Banstead Woods",
      "caption": "Parkland by Banstead Woods. Footpath 52 crosses this field towards Holly Lane, which runs up the valley on the right from Chipstead valley. The woods are well knowm for there rich biodiversity, with a mix of mature trees, including oak, beech, and hornbeam. The undergrowth teems with plants such as bluebells, brambles, and ivy, which provide habitats for a variety of wildlife. Birdwatchers may spot species like woodpeckers, nuthatches, and jays, while smaller mammals, insects, and fungi add to the ecological diversity​."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Park_Downs%2C_Chipstead_-_geograph.org.uk_-_1386595.jpg",
      "title": "Peter Trimming / Park Downs, Chipstead",
      "caption": "Park Downs, Chipstead. Looking towards the Chipstead Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Beech_trees_near_Banstead_Wood_-_geograph.org.uk_-_583966.jpg/256px-Beech_trees_near_Banstead_Wood_-_geograph.org.uk_-_583966.jpg",
      "title": "Derek Harper / Beech trees near Banstead Wood",
      "caption": "Beech trees near the Wood. A litter of autumn leaves beneath the beeches on the border between Fames Rough and Banstead Wood, along Banstead footpath 44."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Banstead_Woods%2C_Narnia_trail%2C_Girl_by_lamppost.jpg/256px-Banstead_Woods%2C_Narnia_trail%2C_Girl_by_lamppost.jpg",
      "title": "AndyScott, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Lucy Pevensey by the lamppost on the Narnia Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Banstead_Woods%2C_Narnia_trail%2C_Lion.jpg/256px-Banstead_Woods%2C_Narnia_trail%2C_Lion.jpg",
      "title": "AndyScott, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Aslan on the Narnia trail"
    }
  ],
  "distance_km": 4.0,
  "description": "These lovely woods in Surrey have miles of well marked walking paths and a nature trail to follow. There's over 230 acres to explore with lots of pretty bluebells in the spring months. The area also includes the Park Downs area of common land which is designated as a site of special scientific interest. You can start your walk from the Holly Lane car park at the north eastern corner of the woods. Chipstead and Kingswood train stations are also very nearby. The car park gives direct access to the nature trail where you can see lots of interesting flora and fauna. Look out for wild primroses, purple emperor butterflies and willow warblers as you make your way along the ancient woodland trail. You can extend your walking in the area by picking up the Banstead Countryside Walk. This 5 mile self guided trail explores Chiphouse Wood, Ruffett Wood and the attractive countryside surrounding the town. If you enjoy this walk then you could head a couple of miles north and visit Banstead Downs. The downs are located just to the north of the town and consist of open grass chalkland, wildflowers and nice views towards London from the high points. A couple of miles to the west is Epsom Common where you can explore the famous racecourse and enjoy attractive chalk downland, grassland and woodland.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just south of Chipstead train station you'll find the Rambler's Rest. They serve good quality pub food and have a lovely garden area if the sun is out. You can find them just a short walk from the car park at Outwood Lane, Chipstead with a postcode of CR5 3NP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails are ideal for a dog walk so you'll probably bump into other owners on your visit. There's plenty of bins dotted around the site too. The Rambler's Rest pub mentioned above is also very dog friendly with water bowls available for your thirsty friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The woods now includes a super Narnia trail where you can enjoy sculptures of the characters from The Lion, the Witch and the Wardrobe. You can see Aslan the Lion, spot Lucy Pevensey waiting by the lamppost and even walk through the wardrobe entrance to Narnia, complete with hanging coats. Just to the south west there's Tadworth and Banstead Heath where there's miles of good walking and cycling trails to try. The heath also includes a fine 16th century pub which is worthy of investigation. For more walking ideas in the area see the Surrey Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3FIfr_Q3k3U",
  "district": "Reigate and Banstead",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Lower Park Road, Chipstead, Reigate and Banstead, Surrey, England, CR5 3NR, United Kingdom",
  "postcode": "CR5 3NR",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "nature trail",
    "wildflowers",
    "views"
  ],
  "facilities": [
    "car park",
    "train station"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}