{
  "created_at": "2025-01-06T00:38:12.182545+00:00",
  "objectID": "bb6c98991163d555de20d3df63231bc5",
  "ref": "cambrian-way-walking-route",
  "title": "Cambrian Way Wales Map Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Afon_Taf_Cardiff_-_geograph.org.uk_-_512122.jpg",
  "nearby": [
    {
      "description": "Brecon Beacons Way",
      "objectID": "4adcdd2b37eb2d33c13c059536b8417d",
      "ref": "brecon-beacons-way-walking-route"
    },
    {
      "description": "Snowdonia Slate Trail",
      "objectID": "11f87e2a3b44309978dabb386cd806e7",
      "ref": "snowdonia-slate-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bb6c98991163d555de20d3df63231bc5.gpx",
  "_geoloc": {
    "lat": 51.4812198232,
    "lng": -3.1810757129
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Afon_Taf_Cardiff_-_geograph.org.uk_-_512122.jpg",
      "title": "Andrew Davis / Afon Taf Cardiff",
      "caption": "Afon Taf Cardiff, near the southern end of the route. View over the River Taff looking towards the Arms Park and Millennium Stadium with Bute Park to the left. The Taff Trail is on the right bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/On_the_Blorenge_-_geograph.org.uk_-_2072653.jpg/512px-On_the_Blorenge_-_geograph.org.uk_-_2072653.jpg",
      "title": "On the Blorenge by Gareth James, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On the Blorenge in the Brecon Beacons near Abergavenny. The route traverses a wide range of habitats, each with its own distinctive flora and fauna. The southern sections of the trail pass through limestone grasslands and heathlands, where plants such as wild thyme, rock rose, and common heather thrive. As the trail ascends into the Brecon Beacons, you’ll encounter upland species like bilberry and mosses adapted to the damp, cooler conditions. The central sections of the trail, particularly through the Cambrian Mountains, feature boggy moorlands with sphagnum moss, cotton grass, and insectivorous plants like sundews and butterwort."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Lord_Hereford%27s_Knob_or_Twmpa_-_geograph.org.uk_-_4050550.jpg/512px-Lord_Hereford%27s_Knob_or_Twmpa_-_geograph.org.uk_-_4050550.jpg",
      "title": "Lord Hereford's Knob or Twmpa by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lord Hereford's Knob or Twmpa. The fauna along the Cambrian Way is just as varied. Red kites and buzzards are frequently seen soaring above, while pied flycatchers and redstarts nest in the wooded valleys. In the upland areas, you may spot meadow pipits, skylarks, and the elusive ring ouzel. Mammals such as foxes, badgers, and hares inhabit the lower landscapes, while wild ponies roam freely in areas like the Brecon Beacons. In wetter sections, frogs, newts, and dragonflies are common, particularly near ponds and streams."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Table_mountain_-_geograph.org.uk_-_2070724.jpg/512px-Table_mountain_-_geograph.org.uk_-_2070724.jpg",
      "title": "Table mountain by andy dolman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Table mountain. This Table Mountain is a smaller hill compared to its famous South African counterpart but offers dramatic views of the surrounding landscape, including the Snowdon massif and the surrounding valleys. The summit of Table Mountain in Wales rises to 627 metres (2,057 feet) and is known for its distinct flat-topped shape, similar to the more famous Table Mountain in South Africa. The peak is often shrouded in mist, adding to the atmospheric appeal of the area. The mountain is easily accessible from Capel Curig and is a popular short hike for those looking to experience the natural beauty of Snowdonia without tackling the larger peaks like Snowdon itself. Flora on Table Mountain includes typical upland species such as heather, bilberry, and bracken. The surrounding area is rich in biodiversity, with a mix of heathland and woodlands. In spring and summer, wildflowers add splashes of colour to the landscape, including species such as primroses and bluebells. The fauna is also diverse, with common sightings of birds like kestrels, buzzards, and ravens soaring above the mountain. The slopes are home to small mammals such as rabbits, as well as the occasional red squirrel, which can still be found in parts of Snowdonia. The views from the summit of Table Mountain offer spectacular panoramas of the surrounding valleys, lakes, and other mountains in Snowdonia, including Tryfan, the Glyderau range, and the Carneddau hills. On clear days, visitors can see as far as Anglesey and the North Wales coast. The mountain is a great spot for photographers and those looking for a peaceful retreat in the heart of Snowdonia."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Towards_Pen_y_Fan_-_geograph.org.uk_-_2631694.jpg",
      "title": "Towards Pen y Fan by Derek Harper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Towards Pen y Fan. The trail also showcases some of Wales’ most stunning natural and cultural landmarks. The Brecon Beacons feature dramatic ridges and peaks like Pen y Fan, the highest point in southern Britain. Further north, the trail crosses Snowdonia National Park, home to rugged mountains, including Snowdon, the highest peak in Wales. Along the way, walkers can explore historic castles, ancient standing stones, and picturesque villages such as Crickhowell and Betws-y-Coed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_dam_on_Llyn_Egnant%2C_Teifi_Pools_-_geograph.org.uk_-_2306422.jpg",
      "title": "The dam on Llyn Egnant, Teifi Pools by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The dam on Llyn Egnant, Teifi Pools"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Snowdon_Summit_View.jpg/512px-Snowdon_Summit_View.jpg",
      "title": "Raintheone, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Snowdon Summit View"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Conwy_Castle%2C_Conwy_-_geograph.org.uk_-_3833042.jpg/512px-Conwy_Castle%2C_Conwy_-_geograph.org.uk_-_3833042.jpg",
      "title": "Conwy Castle, Conwy by Ian S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Conwy Castle at the end of the route."
    }
  ],
  "distance_km": 479.0,
  "description": "This epic long distance trail runs from Cardiff on the south coast of Wales to Conwy on the north coast. The trail runs for about 479 km (298 miles) taking you through the heart of the country. You will pass through some spectacular mountainous scenery as you make your way through the Brecon Beacons, the Cambrian Mountains and the Snowdonia National Park. You'll enjoy riverside trails, huge clear watered lakes and challenging climbs to a series of significant peaks.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": ""
    }
  ],
  "video_url": "https://www.youtube.com/embed/I58ihPl2_v4?si=TUrrLDLLfAdPft5x",
  "postcode": "CF10 1BW",
  "district": "Cardiff",
  "county": "Cardiff",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "47-49 Castle Arcade, Castle Street, Castle Quarter, Castle, Cardiff, Cymru / Wales, CF10 1BW, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "multiple days",
  "difficulty": "hard",
  "terrain": [
    "mountain",
    "woodland"
  ],
  "points_of_interest": [
    "natural scenery",
    "lakes",
    "peaks"
  ],
  "facilities": [],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "hiking"
  ]
}