{
  "created_at": "2025-01-06T00:52:58.509386+00:00",
  "objectID": "bb7c414bd5cb87023eb36b42d968239e",
  "ref": "hogsmill-river-walking-route",
  "title": "Hogsmill River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Bourne_Hall_-_geograph.org.uk_-_1154768.jpg",
  "nearby": [
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Thames Down Link",
      "objectID": "5492bd3fd912559ad5619ee703537b58",
      "ref": "thames-down-link-walking-route"
    },
    {
      "description": "Kingston to Hampton Court River Walk",
      "objectID": "302435ca3e2fa94181fa1ca61f9b7bba",
      "ref": "kingston-to-hampton-court-river-walk-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Hampton Court Park",
      "objectID": "e45c4f48d8643b4f22001f566cb9880a",
      "ref": "hampton-court-park-walking-and-cycle-route"
    },
    {
      "description": "Bushy Park",
      "objectID": "304370478e1b5783aa5169c0ecb9cd5e",
      "ref": "bushy-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bb7c414bd5cb87023eb36b42d968239e.gpx",
  "_geoloc": {
    "lat": 51.3503206613,
    "lng": -0.2506193076
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Bourne_Hall_-_geograph.org.uk_-_1154768.jpg",
      "title": "Dennis Turner / Bourne Hall",
      "caption": "The lake in the grounds of Bourne Hall where the route starts in Ewell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Part_of_the_Hogsmill_Open_Space_near_Ewell_-_geograph.org.uk_-_27821.jpg",
      "title": "Roger Miller / Part of the Hogsmill Open Space near Ewell",
      "caption": "Part of the Hogsmill Open Space near Ewell. The Open Space borders the river from the Lower Mill in Ewell to the borough boundary with the Royal Borough of Kingston in Worcester Park. This photo was taken at approximately TQ 213 634 looking south. The paths on the site are for both pedestrians and cyclists.The open area along the Hogsmill represents the last remnants of the farmland that extended to the banks of the Hogsmill River before the construction of the current surrounding housing developments. The Hogsmill River has played a significant historical role in Ewell, serving as a power source for various mills, including the gunpowder mill complexes, and serving as an inspiring landscape for renowned artists. The Nature Reserve provides a sanctuary for a diverse array of local wildlife. The river is renowned for hosting the vibrant kingfisher, which nests along its banks and can often be spotted perched on branches, poised to dive for fish. The combination of open grassy pathways and woodland patches offers habitats for various mammal, bird, and insect species. Regular walkers along the Hogsmill may encounter familiar wildlife such as foxes, chaffinches, blue tits, and blackbirds. The scrub and woodland areas, in particular, teem with birdlife, including the Firecrest, Fieldfare, and Redwing. The nettles and thistles bordering the woodland attract numerous butterflies, including the Red Admiral, Peacock, and various members of the brown family. The reserve is fortunate to host elusive species like the Brown Hairstreak and White-letter Hairstreak butterflies due to the abundance of their larval food plants, Blackthorn and Elm, respectively. Dragonflies and damselflies are also commonly spotted along the river, with the beautiful and banded demoiselle being a notable highlight. Several mature trees, notably oak and willow, line the Hogsmill, with some recognized nationally as champion trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Valley_of_the_Hogsmill_River_-_geograph.org.uk_-_1162527.jpg",
      "title": "David Kemp / Valley of the Hogsmill River",
      "caption": "Valley of the Hogsmill River: a rural corridor between suburbs in Ewell and Kingston, southwest London. The building on the skyline is Tolworth Tower.Originating in Ewell village, the river is fed by numerous springs, filling the ornamental pond at Bourne Hall and the adjacent Horse Pond. The latter was historically used by carters to measure their cart wheels and water their horses. Water from these ponds flows beneath the road to the Old Mill Pond and into the Hogsmill. The white wooden building beside the Old Mill Pond is a remnant of the Hogsmill's past, retaining the architectural style of an 18th-century mill, likely replacing one of the much older mills mentioned in the Domesday Book. This area has been a hub of industry, likely involved in wheat milling since early settlement."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Hogsmill_River_-_geograph.org.uk_-_151421.jpg",
      "title": "Hugh Venables / Hogsmill River",
      "caption": "The Hogsmill is fed by surface run-off to a significant extent so it is quite 'flashy' - the flow increases rapidly after rain (hence the debris) but then drops low in dry spells. The path of the river has been straightened here. Photo taken near the Green Lane recreation ground at New Malden.Further downstream, from around 1754 to 1875, the Hogsmill housed a Gunpowder Mill Complex, employing 156 men at its peak in the mid-nineteenth century. The gunpowder produced here was reportedly used in the American Civil War. However, new regulations under the Explosives Act of 1875 led to the closure of the mills. Remnants of this industrial past are visible in the King George V Recreation Ground, including a preserved millstone from the gunpowder mills. Adjacent to this park, a line of old Oak trees hints at the Hogsmill's agricultural history. These trees mark former field boundaries from when the land was used for grazing as meadow pasture. Across the Bonesgate Stream lies the hay fields of Tolworth Court Farm Meadows Local Nature Reserve, managed by Kingston Borough Council, offering a glimpse of the Hogsmill's pre-development landscape. The open fields, occasional clusters of scrub and trees, and the Willow-lined riverbanks once formed an inspiring landscape revered by artists like the pre-Raphaelite painters Holman Hunt and John Everett Milais. Milais famously painted \"Ophelia\" along the Hogsmill's banks, while Hunt's \"The Light of the World\" was set against one of the Gunpowder Mills' disused huts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Hogsmill_at_Kingston_upon_Thames_-_geograph.org.uk_-_436599.jpg",
      "title": "Julian Smith / Hogsmill at Kingston upon Thames",
      "caption": "The river view at Kingston upon Thames. Soft banks vs hard banks. Looking downstream from Villiers Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/University_footbridge_over_Hogsmill_River_-_geograph.org.uk_-_805445.jpg",
      "title": "Peter Denton / University footbridge over Hogsmill River",
      "caption": "University footbridge over the river in Kingston"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Footbridge_over_the_Hogsmill_River_-_Kingston_-_geograph.org.uk_-_621135.jpg",
      "title": "Bob Parkes / Footbridge over the Hogsmill River - Kingston",
      "caption": "Coming into Kingston"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/The_Hogsmill_river_where_it_joins_the_Thames_at_Kingston._-_panoramio.jpg/512px-The_Hogsmill_river_where_it_joins_the_Thames_at_Kingston._-_panoramio.jpg",
      "title": "brian gillman, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Kingston where the stream joins with the Thames"
    }
  ],
  "distance_km": 11.0,
  "description": "This walk follows the Hogsmill River from Surrey based Ewell to the River Thames at Kingston Upon Thames. The 7 mile route uses sections of the London Loop and Thames Down Link to take you along the pretty waterway which is a small chalk stream tributary of the River Thames. The walk starts in Ewell at Bourne Hall Park where the river springs. The park is a nice place for a stroll with landscaped gardens and a lake to explore. There's also a 19th century waterwheel, a museum and a cafe for refreshment. Car parking is available too but you if wish to come by public transport then Ewell West train station is a short stroll from the park. In the park you can pick up the London Loop and follow the waymarked path north along the river through the Hogsmill Riverside Open Space. This area is a designated nature reserve comprising of 33 hectares of wild open space with a network of grass and surfaced paths. It's a haven for wildlife so keep your eyes peeled for water loving birds such as the Kingfisher, Egret and Grey Heron. The path continues to Tolworth Bridge where it meets with the Thames Down Link. This will take you through Old Malden and Berrylands before coming into Kingston and finishing at the river. Here you can continue your walking along the Thames Path National Trail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a nice cafe in Bourne Hall Park at the route start. They serve a good selection of freshly made sandwiches and cakes. In Kingston there's some nice riverside pubs including The Bishop. You can sit outside and enjoy a fine meal with views of the river and Kingston Bridge. The pub can be found at 2 Bishop’s Hall off Thames Street with a postcode of KT1 1PY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is very popular for dog walking with miles of paths to explore around the Open space nature reserve area at the southern/central end of the route. The Bishop mentioned above is also dog friendly with dog treats and water available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could extend the walk by crossing the river at Kingston to visit Hampton Court Park and Bushy Park on the opposite side. There's miles of trails here with a herd of deer, fountains and lakes to see. For similar walks in London you could try the Beverley Brook Walk and the Dollis Valley Green Walk. The Beverley Brook can be picked up in nearby Putney and followed to New Malden via Barnes, Richmond Park and Wimbledon Common. The Dollis Brook runs through north London to Hampstead Heath. For more walking ideas in the city see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YNiRlwOqnXQ",
  "postcode": "KT17 1UD",
  "district": "Epsom and Ewell",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Spring House, Spring Street, Stoneleigh, Ewell, Epsom and Ewell, Surrey, England, KT17 1UD, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "grass",
    "surfaced paths",
    "river"
  ],
  "points_of_interest": [
    "nature reserve",
    "museum",
    "landscaped gardens",
    "lake"
  ],
  "facilities": [
    "cafe",
    "car park",
    "visitor center",
    "public transport"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}