{
  "created_at": "2025-01-05T23:37:59.001764+00:00",
  "objectID": "bbb6c868f40cd1183d56988b16fdead5",
  "ref": "hothfield-common-walking-route",
  "title": "Hothfield Common Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Hothfield_Common_-_geograph.org.uk_-_408938.jpg",
  "nearby": [
    {
      "description": "Pluckley",
      "objectID": "8bcf0b16ad3ce833eadff696bd4898db",
      "ref": "pluckley-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Stour Valley Walk",
      "objectID": "ada7df515b04aaba1bd691eabe995139",
      "ref": "stour-valley-walk-walking-route"
    },
    {
      "description": "Charing",
      "objectID": "fa1d10090cc2e9b43b24f3267934f9cc",
      "ref": "charing-walking-route"
    },
    {
      "description": "Lenham",
      "objectID": "84c07a19b78159a985b0fec8145737be",
      "ref": "lenham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bbb6c868f40cd1183d56988b16fdead5.gpx",
  "_geoloc": {
    "lat": 51.1777362323,
    "lng": 0.819468932
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Hothfield_Common_-_geograph.org.uk_-_408938.jpg",
      "title": "Adam Hincks / Hothfield Common, via Wikimedia Commons",
      "caption": "Looking across the bracken and heather heathland at Hothfield Common. This Site of Special Scientific Interest (SSSI)) and Local Nature Reserve (LNR) is owned by Ashford CC while it is managed by Kent Wildlife Trust. Hothfield Common contains the last four valley bogs in Kent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Boardwalk_in_Hothfield_Common_Nature_Reserve%2C_Kent.jpg",
      "title": "David Anstiss / Boardwalk in Hothfield Bogs, via Wikimedia Commons",
      "caption": "Boardwalk in Hothfield Bogs. This wooden path leads southwards through the heathland bogs towards Foxenhill Toll."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Footpaths_in_Hothfield_Common_-_geograph.org.uk_-_1600963.jpg",
      "title": "David Anstiss / Footpaths in Hothfield Common, via Wikimedia Commons",
      "caption": "Footpaths in Hothfield Common. A public footpath heads straight through the heathland (managed by the Kent Wild Life Trust) towards Little Chart Forstal. The post with red and green markers is part of circular routes around the common. The green is the Bogs and Giants Walk (1 mile, 45 min walk). The red is the Sundews and Views Walk (0.6 miles, 30 mins walk)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Gate_on_Greensand_Way_in_Hothfield_Common_-_geograph.org.uk_-_1601799.jpg",
      "title": "David Anstiss / Gate on Greensand Way in Hothfield Common, via Wikimedia Commons",
      "caption": "Gate on Greensand Way in Hothfield Common. The long distance path (with the Stour Valley Walk) heads through the gate and then right along the edge of the heathland. Before heading across farmland towards Little Chart Forstal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Rainbow_over_Hothfield_Common_-_geograph.org.uk_-_1601814.jpg",
      "title": "David Anstiss / Rainbow over Hothfield Common, via Wikimedia Commons",
      "caption": "Rainbow over Hothfield Common. Seen from a field beside the Greensand Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/The_Greensand_Way_and_Stour_Valley_Path_meet_near_Hothfield_Common_-_geograph.org.uk_-_1601828.jpg",
      "title": "David Anstiss / The Greensand Way and Stour Valley Path meet near Hothfield Common, via Wikimedia Commons",
      "caption": "The Greensand Way and Stour Valley Path meet near Hothfield Common. The Stour Valley Walk (long distance path from West Street, through the field) meets The Greensand Way (long distance path from Hothfield, along the hedge). Both paths head through a horse's paddock beside Cobb Cottage, towards the heathland nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Close-up_of_Hothfield_Heathland_Information_Board_-_geograph.org.uk_-_1600947.jpg",
      "title": "David Anstiss / Close-up of Hothfield Heathland Information Board, via Wikimedia Commons",
      "caption": "Close-up of Hothfield Heathland Information Board. Located in the car park beside Hothfield Common Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Hothfield_Heathlands_-_geograph.org.uk_-_1092153.jpg",
      "title": "Mike Sharpe / Hothfield Heathlands, via Wikimedia Commons",
      "caption": "Hothfield Heathlands. What used to be the old football field within Hothfield Common (rectangular and white on the OS map) is now an enclosed area. The 12 Konik horses are being used to graze the Heathlands / Common, to keep down invasive vegetation like bracken and silver birch. On Christmas Day 2008 they'd been corralled here. The clear green tracks have been made by walkers and dog-walkers. The whole area is a Site of Special Scientific Interest, containing acid heathland and bogs, with a range of habitats."
    }
  ],
  "distance_km": 2.0,
  "description": "This area of common land is located near Ashford in the Kent Downs AONB. The area is also nature reserve consisting of Kent's last four valley bogs and one of its few remaining fragments of open heath with patches of acid grassland. It is criss crossed with some nice marked footpaths and covered with interesting flora including heather, cross-leaved heath, dwarf and common gorse, heath spotted-orchid. You can start your walk from the public car park on the eastern end of the site, off the A20 road. From here you can pick up the colour coded trails taking you west towards the bogs. On the way look out for birdlife such as Yellowhammers, White Throat and Willow Warblers. You can also see the Konik horses which are used to graze the Heathlands in order to keep down invasive vegetation like bracken and silver birch. The Greensand Way long distance footpath runs across the western side of the common. You could pick up the waymarked trail to further explore the area if you have time. Follow it west and it will take you to the village of Pluckley which is closely associated with the 'Darling Buds of May'. Heading south east will take you toward Godinton Park and then into Ashford itself. The Stour Valley Walk also runs close by and is another good option.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north west from the common and you could visit the noteworthy village of Charing. The pretty settlement includes an old windmill, a 14th century church, the 13th century Archbishop's Palace and a few fine country pubs. Follow the Stour Valley Walk west and you could visit Little Chart and the nearby village of Lenham. The worthy settlement includes a pretty square and a historic high street with a number of listed buildings. There's also a Grade I listed Tithe Barn, an early 1600s pub and a notable 14th century church to investigate. The fine old stately home at Eastwell Park and the lovely sculpture trail at King's Wood are located just north of Ashford. For more walking ideas in the area see the Kent Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/njW6s6SUVvw",
  "postcode": "TN26 1HD",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cades Road, Hothfield, Ashford, Kent, England, TN26 1HD, United Kingdom",
  "district": "Ashford",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "grassland"
  ],
  "points_of_interest": [
    "birdwatching",
    "historical sites",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}