{
  "created_at": "2025-01-06T08:07:03.329873+00:00",
  "objectID": "bc642d98a6eb93263e26366363c5ed72",
  "ref": "micheldever-woods-walking-route",
  "title": "Micheldever Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Micheldever_Woods_-_Bluebells_-_geograph.org.uk_-_1672122.jpg",
  "nearby": [
    {
      "description": "Blackwood Forest",
      "objectID": "a64ed7ac7232ad07903001422d961384",
      "ref": "blackwood-forest-walking-and-cycle-route"
    },
    {
      "description": "Itchen Abbas",
      "objectID": "22a00ec814536650a24427f3fd5d7088",
      "ref": "itchen-abbas-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bc642d98a6eb93263e26366363c5ed72.gpx",
  "_geoloc": {
    "lat": 51.123246161,
    "lng": -1.245109033
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Micheldever_Woods_-_Bluebells_-_geograph.org.uk_-_1672122.jpg",
      "title": "Sebastian Ballard, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bluebells in the woods in early May"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Micheldever_Wood_-_geograph.org.uk_-_808459.jpg",
      "title": "Andrew Smith / Micheldever Wood",
      "caption": "The main north-south track through the wood which is here a mixture of deciduous and coniferous trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Bluebells_near_the_edge_of_Micheldever_Wood_-_geograph.org.uk_-_165497.jpg",
      "title": "Jim Champion / Bluebells near the edge of Micheldever Wood",
      "caption": "Bluebells near the edge of Micheldever Wood. Between the eastern boundary and the open beech woodland in Micheldever Wood is this region of dense silver birch growth. The bluebells are in profusion during May, and at the weekends people with cameras on tripods descend on the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Bluebells_in_Micheldever_Wood_-_geograph.org.uk_-_165524.jpg",
      "title": "Jim Champion / Bluebells in Micheldever Wood",
      "caption": "Carpets of bluebells. This view is from atop the Bronze Age barrow on the western edge of the woods next to the M3 motorway. During May the bluebells carpet the floor of the beech woodland and the trees have grown new leaves."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Micheldever_-_The_Crease_-_geograph.org.uk_-_1423028.jpg",
      "title": "Chris Talbot / Micheldever - The Crease",
      "caption": "Micheldever village. The Crease. This small triangle of grass is known as the crease."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Micheldever_-_Cottage_Near_The_Crease_-_geograph.org.uk_-_1423026.jpg",
      "title": "Chris Talbot / Micheldever - Cottage Near The Crease",
      "caption": "Thatched cottage in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/St_Mary%27s%2C_Micheldever%2C_churchyard_-_geograph.org.uk_-_829185.jpg",
      "title": "Rosemary Oakeshott / St Mary's, Micheldever, churchyard",
      "caption": "The churchyard provides a magnificent view across the Dever valley, with the railway running across the horizon in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Half_Moon_and_Spread_Eagle%2C_Micheldever_-_geograph.org.uk_-_829168.jpg",
      "title": "Rosemary Oakeshott / Half Moon & Spread Eagle, Micheldever",
      "caption": "Half Moon and Spread Eagle, Micheldever. The pub is in the Winchester Road, near the centre of the village. When a second pub in the village, the Spread Eagle, was burnt down its name was added to that of the Half Moon - hence the unusual name."
    }
  ],
  "distance_km": 3.5,
  "description": "This walk explores Micheldever Woods near Basingstoke and Winchester. The woods are a lovely place for a peaceful stroll with the pretty bluebells in the spring a major attraction to the site. They are also particularly lovely in the autumn months when the leaves start to change colour. You can start your walk from the car park at the southern end of the woods, just off Northington Lane. It's located a couple of miles south east of Micheldever village. From here pick up the trails heading north into the woods where there are hundreds of acres to explore. You can extend the walk by heading into the adjacent Dodsley Wood to the north east or Itchen Wood to the south.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into the village and you could enjoy some post walk refreshment at the Half Moon & Spread Eagle. It's a typical village pub with a patio and a nice garden to sit out in on warmer days. There's a cosy interior with a wood-burning stove and ensuite B&B rooms if you need to stay over. The old drovers’ inn dates back to 1703 and is in a nice position over looking the former cricket pitch. You can find them on Winchester Road with a postcode of SO21 3DG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails are popular with dog walkers so you'll probably bump into other owners on your visit. The Half Moon & Spread Eagle pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Micheldever village is located just to the north west of the woods. The pretty village is worth exploring with its old church and picturesque thatched cottages. To continue your woodland walking in the area head a few miles north to Blackwood Forest. The expansive woods include some fine mountain bike trails and numerous footpaths. Just to the south there's the village of Itchen Abbas where there are nice riverside trails along the Itchen Way. On the southern side of nearby Basingstoke there's the historic area of Old Basing. Here you'll find the 16th century Basing House, a Tudor Tithe Barn, Basingstoke Common and the Basing Lime Pits. There's also some more nice trails along the River Loddon in this area. Just south of Old Basing there's also Hackwood Park to explore. The Grade I listed park has a series of public footpaths taking you past the old estate which includes an ornamental bridge, fountains, a statue of George I, deer and the impressive Hackwood House. Just to the east of the park you can pick up the circular Mapledurwell Walk and visit the pretty villages of Mapledurwell and Upton Grey. For more walking ideas in the area see the Hampshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8oamDZwEANI",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Northington Lane, Micheldever, Winchester, Hampshire, England, SO21 1PP, United Kingdom",
  "postcode": "SO21 1PP",
  "district": "Winchester",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "nature trails",
    "autumn foliage"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}