{
  "created_at": "2025-01-06T00:15:14.867893+00:00",
  "objectID": "bc70c1dda6240ee99f8db14aa45d0286",
  "ref": "gravesend-walking-route",
  "title": "Gravesend Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Gordon_Gardens%2C_Gravesend_-_geograph.org.uk_-_888387.jpg",
  "nearby": [
    {
      "description": "Cliffe Pools Nature Reserve",
      "objectID": "47de4ef43c422de07f1dc8fd1bddf21a",
      "ref": "cliffe-pools-nature-reserve-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Saxon Shore Way",
      "objectID": "e50fab578e5425ee992debe450ead99a",
      "ref": "saxon-shore-way-walking-route"
    },
    {
      "description": "Wealdway",
      "objectID": "3ab807df03695a62363e92d8ce79393c",
      "ref": "wealdway-walking-route"
    },
    {
      "description": "Hoo Peninsula Path",
      "objectID": "90698ad927da195c94ace95c971bb733",
      "ref": "hoo-peninsula-path-walking-route"
    },
    {
      "description": "Beacon Wood Country Park",
      "objectID": "fcf81af491ad8349318d692e78f4582e",
      "ref": "beacon-wood-country-park-walking-route"
    },
    {
      "description": "Darent Valley Path",
      "objectID": "36e7fb5e4f927dfaec7f70ff6239a05d",
      "ref": "darent-valley-path-walking-route"
    },
    {
      "description": "Darenth Country Park",
      "objectID": "ca76f114f4bbdd665ca806615ad878bf",
      "ref": "darenth-country-park-walking-and-cycle-route"
    },
    {
      "description": "Thames Estuary Path",
      "objectID": "eef1a0584f0baafb26e08b03eb2353f3",
      "ref": "thames-estuary-trail-walking-route"
    },
    {
      "description": "Shorne Woods Country Park",
      "objectID": "b4623551ad5d973fe36359d9a35c45d8",
      "ref": "shorne-woods-country-park-walking-and-cycle-route"
    },
    {
      "description": "Jeskyns Park",
      "objectID": "c195138367ce174df1513677fa0ed894",
      "ref": "jeskyns-park-walking-and-cycle-route"
    },
    {
      "description": "Tilbury Fort",
      "objectID": "654ca53bff9b0f7beea3f979b9aeb3c8",
      "ref": "tilbury-fort-walking-route"
    },
    {
      "description": "Greenhithe",
      "objectID": "8aca13791935820c6fac5573afa07d8d",
      "ref": "greenhithe-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bc70c1dda6240ee99f8db14aa45d0286.gpx",
  "_geoloc": {
    "lat": 51.444929219,
    "lng": 0.3728121396
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Gordon_Gardens%2C_Gravesend_-_geograph.org.uk_-_888387.jpg",
      "title": "Danny Robinson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gordon Gardens, Gravesend. A part of the Gravesend Riverside Leisure Area. The gardens are named after General Gordon who lived at Fort House from 1865-1871, which houses his statue made by Doulton Lambeth in Terracotta."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Lifeboat_Jetty_-_geograph.org.uk_-_48167.jpg",
      "title": "Glyn Baker / Lifeboat Jetty",
      "caption": "Lifeboat Jetty. The picture shows the last jetty on the east side of Gravesend. All the boats seem to be lifeboats of one sort or another. The variety of types seems to indicate this could be a training facility of some kind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Steps_on_Sea_Wall_-_geograph.org.uk_-_1087750.jpg",
      "title": "David Anstiss / Steps on Sea Wall",
      "caption": "Steps on Sea Wall On Saxon Shore Way from Cliffe to Gravesend along the River Thames."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Saxon_Shore_Way_near_Shornemead_Fort_-_geograph.org.uk_-_1565225.jpg",
      "title": "David Anstiss / Saxon Shore Way near Shornemead Fort",
      "caption": "Saxon Shore Way near Shornemead Fort. The long distance path leads from Gravesend along the sea wall embankment. It passes the World War II Fort and then heads towards Cliffe (and another fort). The red and white beacon on the left is a mudflat warning beacon in the River Thames. The now-disused artillery fort was built in the 1860s to guard the entrance to the Thames from seaborne attack. The surviving fragments of the fort and the area around it are part of a nature reserve and can be visited by the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Cliffe_Pools_Panorama_-_geograph.org.uk_-_104147.jpg",
      "title": "Glyn Baker / Cliffe Pools Panorama",
      "caption": "Cliffe Pools Panorama. This picture shows part of the Cliffe Pools Nature Reserve. The reserve consisting of more than 200 hectares of fresh and salt-water lagoons, salt marsh and scrub was acquired by the RSPB in 2001. The pools are the result of clay extraction. There are a number of rights of way across the reserve so there is easy access for the public. The picture was taken from a viewpoint constructed for birdwatchers with powerful binoculars!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Thames_and_Medway_Canal_-_geograph.org.uk_-_1095701.jpg",
      "title": "David Anstiss / Thames and Medway Canal",
      "caption": "Thames and Medway Canal, opened 1824. This disused Canal still exists in places along its route from Gravesend to Rochester. But parts of it are now used by a railway or roads (such as Canal Road in Higham). National Cyclepath from Gravesend to Higham, seen on left, uses the old towpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/The_Thames_and_Medway_Canal_-_geograph.org.uk_-_48194.jpg/256px-The_Thames_and_Medway_Canal_-_geograph.org.uk_-_48194.jpg",
      "title": "Glyn Baker / The Thames & Medway Canal",
      "caption": "The Thames & Medway Canal. This is a picture of the remains of the Thames and Medway Canal. The canal was first proposed as a link from Chatham to Woolwich in 1778. It was completed in 1801. The canal tunnel to Rochester was taken over for the railway some time after 1845. The canal remained open to Higham until 1934. The photo was taken from a footbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/View_from_Windmill_Hill%2C_Gravesend_-_geograph.org.uk_-_1319868.jpg",
      "title": "Julia MG / View from Windmill Hill, Gravesend",
      "caption": "View from Windmill Hill. Looking north from Windmill Hill over Gravesend towards the Thames and Tilbury."
    }
  ],
  "distance_km": 21.0,
  "description": "This town on the Thames has a very pretty riverside park, nice walking trails along the sea wall and a worthy nearby nature reserve to explore. The historic settlement is notable for having one of the oldest surviving markets in the country and the oldest cast iron pier in the world. This circular walk from Gravesend takes you along the Saxon Shore Way to the Cliffe Pools Nature Reserve before following the Thames and Medway Canal back to the town. The walk starts on the Town Pier and follows the waymarked Saxon Shore Way east along the River Thames. The opening section has nice views over the river to Tilbury Fort, Tilbury Marshes and Coalhouse Fort on the opposite side. You'lll pass Shorne Marshes and Higham Marshes before coming to Cliffe Fort and the nature reserve. The route follows trails around the reserve with the option of taking a small detour to visit the village of Cliffe. In the reserve there are a number of lakes and pools with great birdwatching opportunities. The route heads south towards the railway line where you can pick up footpaths heading west from Church Street to Beckley Hill. A shared cycling and walking trail then runs along the disused Thames and Medway Canal to return you to Gravesend. This final section passes Filborough Marshes, Eastcourt Marshes, Great Clane Lane Marshes, Westcourt Marshes, Denton and Milton before returning to the town. You'll pass the Riverside Leisure area at Gordons Gardens where there's some nice surfaced footpaths to try. In the park there's flowers, mature plants and trees, with paths leading around the small lake. You then have the option of extending the walk by heading south to climb Windmill Hill. Here you'll find a fine viewpoint with views over the town towards London.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Three Daws is a pub of some note and worthy of some investigation. The historic riverside inn dates back to the 1400s, making it one of the oldest in the country. As such it's steeped with tales of smugglers, Press Gangs, hauntings and the like. It would have been a popular haunt for seamen as at one time large sailing merchant ships used to anchor off the Three Daws. Today you can enjoy lovely British food in the garden area overlooking the river. It's a splendid spot to relax in on warmer days. You can find them at the start of the walk at the Town Pier with a postcode of DA11 0BJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The walk is a nice one to do with your dog. At Cliffe Pools, dogs are permitted on all public footpaths but must be under close control and kept out of the pools at all times. The Three Daws mentioned above is dog friendly in the outdoor section."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The long distance Wealdway starts in the town. You can follow the epic trail through the North Downs, South Downs and the Weald AONB to Eastbourne on the south coast. The Hoo Peninsula Path also starts in Gravesend. The path runs for about 18 miles along the River Thames estuary to Allhallows. There's some lovely scenery and a huge number of wading birds to look out for on the way. Thames Estuary Path is a similar waymarked path you can easily pick up. Beacon Wood Country Park is another nice place for a stroll near the town. There's miles of peaceful woodland trails here with lovely colours in the autumn months. You can also visit Darenth Country Park and pick up the Darent Valley Path in this area. Shorne Woods Country Park has miles of waymarked footpaths taking you to 288 acres of rolling woodlands, wetlands and meadows. It's located just a few miles south of the town. Jeskyns Park is located right next to it as well. Catch the ferry to the opposite side of the river and you could explore Tilbury Fort. The riverside fort is owned by English Heritage and includes some interesting trails around the moats and old buildings of the 16th century site.  For more walking ideas in the area see the Kent Walks page."
    }
  ],
  "district": "Gravesend",
  "county": "Kent",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}