{
  "created_at": "2025-01-06T05:16:16.337742+00:00",
  "objectID": "bc86b13eb7ce8afd7e2c2dc9d4b8738c",
  "ref": "chitty-chitty-bang-bang-windmill-walking-route",
  "title": "Chitty Chitty Bang Bang Windmill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Cobstone_Windmill.jpg/256px-Cobstone_Windmill.jpg",
  "nearby": [
    {
      "description": "Fingest",
      "objectID": "e79dcaf67f3b60e992167f245e82f004",
      "ref": "fingest-walking-route"
    },
    {
      "description": "Turville",
      "objectID": "253fdfe3b7750094eec6aca59b6682a2",
      "ref": "turville-walking-route"
    },
    {
      "description": "Chiltern Way",
      "objectID": "e4888a75d90cd63bc6fc871d701234a0",
      "ref": "chiltern-way-walking-route"
    },
    {
      "description": "Ibstone",
      "objectID": "3c9dfc3d33d1b82413c840b20714af34",
      "ref": "ibstone-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bc86b13eb7ce8afd7e2c2dc9d4b8738c.gpx",
  "_geoloc": {
    "lat": 51.6139641026,
    "lng": -0.8924368794
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Cobstone_Windmill.jpg/256px-Cobstone_Windmill.jpg",
      "title": "DeFacto / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Cobstone Windmill, Ibstone, Buckinghamshire. This late 18th century smock mill (now converted into a house) is a grade II listed building in England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/The_windmill_and_old_school%2C_Turville_-_geograph.org.uk_-_995687.jpg",
      "title": "Andrew Smith / The windmill and old school, Turville",
      "caption": "The windmill and old school, Turville. The school is now a nursery. The mill, Cobstone Mill, is within the parish of Ibstone but directly overlooks Turville."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Into_Mill_Hanging_Wood_-_geograph.org.uk_-_1435650.jpg",
      "title": "Graham Horn / Into Mill Hanging Wood",
      "caption": "Into Mill Hanging Wood. A footpath heads into the wood from the Ibstome to Fingest road, opposite Cobstone Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Grazing_on_Cobstone_Hill_-_geograph.org.uk_-_1672389.jpg",
      "title": "Colin Smith / Grazing on Cobstone Hill",
      "caption": "Grazing on Cobstone Hill Sheep finding something to eat on the top of grassy Cobstone Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg/512px-Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg",
      "title": "Michael Trolove / Fingest Village",
      "caption": "View of Fingest Village. Turville Hill and Windmill is above and beyond the village. This view can be seen at the beginning of the Agatha Christie's Marple (TV series) episode \"Endless Night\" (2013). The church in view is the noteowrthy St Bartholomew's. The nave and tower are 12th century with the saddleback roof added to the tower in the 18th or early 19th century. The roof is notable as being one of only two such designs in England. The chancel was added in the 13th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Turville_-_geograph.org.uk_-_9553.jpg",
      "title": "Brendan and Ruth McCartney / Turville",
      "caption": "A view of the village of Turville. The windmill on the hill overlooking Turville in the east of the square. The name 'Turville' is Anglo-Saxon in origin and means 'dry field'. The pretty village has been used as a filming location for many tv dramas including Midsomer Murders, Lewis, Marple, Foyle's War and the 2008 Christmas special of Jonathan Creek. It was also used in the Dawn French sitcom The Vicar of Dibley. In the series, the church of St Mary the Virgin was renamed \"St Barnabus\". The village church is well worth some investigation as it dates back to the 12th century with the nave being the oldest surviving part."
    }
  ],
  "distance_km": 2.8,
  "description": "This short circular walk visits Cobstone Windmill in Turville, Buckinghamshire. The old mill is a well known local landmark having been used in the 1967 film \"Chitty Chitty Bang Bang\" when it was cosmetically restored for filming. Start the walk in the village where you can pick up a public footpath heading north east up past Turville Hill towards the windmill. It was built around 1816 as a smock mill replacing the original mill that had stood there since the 16th century. It had fallen into disrepair until it was restored for the film with a remolded cap, a new fantail and light wooden sails added. The walk then descends past Manor Farm and Mill Hanging Farm to Fingest. The picturesque village includes a 12th century church with a particularly noteworthy saddleback roof which is one of only two such designs in England. There's also a splendid 18th century pub just opposite the church. In Fingest you can pick up the Chiltern Way and follow the waymarked trail west to return to Turville.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's two fine pubs on the route where you can stop off for some refreshments. Back in Turville there's the Bull and Butcher. They are known for their excellent homemade pies and a splendid large garden area for the summer months. You can find them at a postcode of RG9 6QU for your sat navs. In Fingest there's The Chequers to consider. The pub is in a lovely location just opposite the picturesque church. It's set in an attractive 18th century brick and flint building with a splendid 2 acre garden outside. The pub is also notable for featuring in the 2014 George Clooney film 'Monuments Men' set during World War II. At the time the village was transformed into a Normandy-like appearance. You may also recognise the pub and village from episodes of the popualar Midsomer Murders series on ITV. You can easily find them in the heart of the village at a postcode of RG96QD for your sat navs. Both pubs are dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north is the village of Ibstone where you can enjoy a walk along the boundary of the Wormsley Estate. The 16th century estate is well known for its cricket ground and is also a good place to look out for red kites."
    }
  ],
  "video_url": "https://www.youtube.com/embed/oUZ7DAwq_7E",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Holloway Lane, Turville, Buckinghamshire, England, RG9 6QU, United Kingdom",
  "postcode": "RG9 6QU",
  "district": "Turville",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "rural"
  ],
  "points_of_interest": [
    "windmill",
    "church",
    "village"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}