{
  "created_at": "2025-01-06T00:16:54.398007+00:00",
  "objectID": "bcaa3341b63a7725287c094afb5a600d",
  "ref": "shardlow-walking-route",
  "title": "Shardlow Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/62/Former_salt_warehouse_-_Shardlow_-_geograph.org.uk_-_598771.jpg",
  "nearby": [
    {
      "description": "Trent Lock",
      "objectID": "7e87b379acd57c1bf49c0fda3d91970a",
      "ref": "trent-lock-walking-route"
    },
    {
      "description": "Castle Donington",
      "objectID": "35243aa0c6d90acf44e668e1c8d46d84",
      "ref": "castle-donington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bcaa3341b63a7725287c094afb5a600d.gpx",
  "_geoloc": {
    "lat": 52.8700556872,
    "lng": -1.3396845705
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Former_salt_warehouse_-_Shardlow_-_geograph.org.uk_-_598771.jpg",
      "title": "J147 / Former salt warehouse - Shardlow, via Wikimedia Commons",
      "caption": "Former salt warehouse - Shardlow. This former salt warehouse was known as \"number 2 store\" and was built in the late 18th century, shortly after completion of the adjacent Trent & Mersey canal. It found later use as a corn merchant's premises and most recently was the premises of Derby Timber Products Ltd. It appears to be unused at the current time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/New_Inn_-_Shardlow_-_geograph.org.uk_-_539844.jpg",
      "title": "J147 / New Inn - Shardlow, via Wikimedia Commons",
      "caption": "New Inn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/River_Trent_at_Shardlow_-_geograph.org.uk_-_7480.jpg",
      "title": "Chris J Dixon / River Trent at Shardlow, via Wikimedia Commons",
      "caption": "River Trent at Shardlow. Looking South."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Trent_and_Mersey_Canal%2C_Shardlow_-_geograph.org.uk_-_1541725.jpg",
      "title": "Stephen McKay / Trent & Mersey Canal, Shardlow, via Wikimedia Commons",
      "caption": "Trent & Mersey Canal. Shardlow is a superb example of a canal village, located at the eastern end of the Trent & Mersey Canal. From here boaters effectively leave the narrow canal network and head into river navigations, joining the Trent about a mile further on at Derwent Mouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Malt_Shovel_-_Shardlow_-_geograph.org.uk_-_539849.jpg",
      "title": "J147 / Malt Shovel - Shardlow, via Wikimedia Commons",
      "caption": "Malt Shovel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Shardlow_Marina_-_geograph.org.uk_-_689679.jpg",
      "title": "David Lally / Shardlow Marina, via Wikimedia Commons",
      "caption": "Shardlow Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/The_Clock_Warehouse%2C_Shardlow_-_geograph.org.uk_-_3861.jpg",
      "title": "Martin Clark / The Clock Warehouse, Shardlow, via Wikimedia Commons",
      "caption": "The Clock Warehouse, Shardlow. This warehouse on the Trent and Mersey Canal at Shardlow, Derbyshire, built around 1780, has been refurbished as a family pub. It takes its name from the clock above the signs reading \"Navigation from the Trent to the Mersey\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Shardlow_Lock_-_geograph.org.uk_-_874111.jpg",
      "title": "David Lally / Shardlow Lock, via Wikimedia Commons",
      "caption": "Shardlow Lock"
    }
  ],
  "distance_km": 5.0,
  "description": "This circular walk around Shardlow takes you along the Trent and Mersey Canal and the River Derwent. The delightful little canal village is located just to the south west of Long Eaton and a real highlight of the area. It's another noteworthy spot on the canal having been a significant 18th-century river port for the shipment of goods from the River Trent to the canal. During this time it became was known as \"Rural Rotterdam\" and \"Little Liverpool\". Today Shardlow is considered Britain's most complete surviving example of a canal village, with over 50 Grade II listed buildings and a large number of surviving public houses. You can start the walk from the public car park, next to the canal near Great Wilne. From here you can pick up the canal towpath and follow it east to Long Horse Bridge (now Fathorse bridge). Here you leave the canal to follow a riverside path along the River Trent to Cavendish Bridge, passing an aqueduct on the way. The route then passes the pretty Shardlow Marina before returning to the car park. If you enjoy this walk then you could head east to visit the noteworthy Trent Lock. It's a significant location as the lock marks the point where the River Trent and River Soar meet with the beginning of the Erewash canal. It also sits on the border of three counties: Leicestershire, Nottinghamshire and Derbyshire.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's several good options for canalside refreshments in Shardlow. The historic Clock Warehouse is housed in a converted milll, dating from 1780. There's a nice garden here right next to the water. Perfect for relaxing in on warm summer days. You can find the pub right next to the canal at a postcode of DE72 2GL."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south you could visit nearby Castle Donington. Here you can visit Donington Park which is famously used as a motor racing track and is also the venue for the Download Music Festival. To the north there's some nice waterside trails around St Chad's Water and Church Wilne Reservoir. St Chad's includes a nice circular lakeside footpath with a wildflower meadow and the historic 13th century St Chad's Church. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "district": "Derby",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Lawn, 31, Wilne Lane, Shardlow and Great Wilne, Great Wilne, Derby, Derbyshire, East Midlands, England, DE72 2HA, United Kingdom",
  "postcode": "DE72 2HA",
  "state": "England"
}