{
  "created_at": "2025-01-06T07:58:36.615935+00:00",
  "objectID": "bccd0439986397c98b3f51665d95a67f",
  "ref": "mastiles-lane-walking-and-cycle-route",
  "title": "Mastiles Lane Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Mastiles_Lane_-_geograph.org.uk_-_294383.jpg",
  "nearby": [
    {
      "description": "Kilnsey Crag",
      "objectID": "e4108b4201fb745526072fe4b55c9aa1",
      "ref": "kilnsey-crag-walking-route"
    },
    {
      "description": "Malham Tarn Estate",
      "objectID": "0e1b77883047f9f0f66863ff12a65c1c",
      "ref": "malham-tarn-estate-walking-and-cycle-route"
    },
    {
      "description": "Grass Wood",
      "objectID": "73464b923afc2f4574cadc58391b8ac2",
      "ref": "grass-wood-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bccd0439986397c98b3f51665d95a67f.gpx",
  "_geoloc": {
    "lat": 54.10591109,
    "lng": -2.04005599
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Mastiles_Lane_-_geograph.org.uk_-_294383.jpg",
      "title": "John Illingworth / Mastiles Lane, via Wikimedia Commons",
      "caption": "An ancient green lane, now closed to motor vehicles, allowing the damaged grass to recover. Taken in December sun, showing the difference from the August colours in 44994 taken from about the same spot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Mastiles_Lane_-_geograph.org.uk_-_523085.jpg",
      "title": "David Pickersgill / Mastiles Lane, via Wikimedia Commons",
      "caption": "Looking east along the green lane from Malham toward Kilnsey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Mastiles_Lane_-_geograph.org.uk_-_44994.jpg",
      "title": "John Illingworth / Mastiles Lane, via Wikimedia Commons",
      "caption": "Badly eroded by off road vehicles, the lane is now closed to traffic for an experimental period to see whether the vegetation will recover. In 2008 the closure was made permanent."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Looking_west_along_Mastiles_Lane_-_geograph.org.uk_-_189209.jpg",
      "title": "Chris Heaton / Looking west along Mastiles Lane, via Wikimedia Commons",
      "caption": "Looking west along Mastiles Lane. The photograph shows this green lane stretching into the distance. Arguably the best known in the Dales, it was certainly used by the monks of Fountains Abbey centuries ago. Subject to much local controversy over the use of 4 wheel drives that have wreaked much damage to the lane. I believe they have finally been banned here"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Old_Hall_and_neighbouring_houses%2C_Mastiles_Lane%2C_Kilnsey_-_geograph.org.uk_-_675767.jpg",
      "title": "Humphrey Bolton / Old Hall and neighbouring houses, Mastiles Lane, Kilnsey, via Wikimedia Commons",
      "caption": "Old Hall and neighbouring houses, Mastiles Lane. Kilnsey Old Hall formed the main administrative centre for the management of wool for Fountains Abbey, which had extensive grazing land in the area. Some parts of the present Hall date back to this period, such as the gatehouse, most of which was probably built in the 14C. However most of the current hall was built in 1648 by Christopher Wade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Highland_cattle_near_Mastiles_Lane_-_geograph.org.uk_-_971885.jpg",
      "title": "John Illingworth / Highland cattle near Mastiles Lane, via Wikimedia Commons",
      "caption": "Highland cattle near Mastiles Lane. Highland cattle and other hardy breeds are being encouraged in the Dales as part of the Limestone Country Project: \"The Limestone Country Project aims to protect and improve some of England's most important wildlife sites by promoting the re-introduction of native cattle breeds across the Malham and Ingleborough areas of the Yorkshire Dales National Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Sheep_creep_near_the_Roman_camp_on_Mastiles_lane_-_geograph.org.uk_-_174506.jpg",
      "title": "Martyn Gorman / Sheep creep near the Roman camp on Mastiles lane, via Wikimedia Commons",
      "caption": "Sheep creep near the Roman camp on Mastiles lane. Drystone walls may have by openings for livestock. A traditional opening is the \"sheep-creep\", a square opening made in the lower part of the wall, and filled in on top. Some are made so that the upper layers of stone can be removed to create an opening large enough for cattle to pass through. These larger openings are called \"cow-creeps\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Mastiles_Lane_Roman_Marching_Camp._-_geograph.org.uk_-_240102.jpg",
      "title": "Steve Partridge / Mastiles Lane Roman Marching Camp., via Wikimedia Commons",
      "caption": "Mastiles Lane Roman Marching Camp. The NE corner of the camp can be made out as a slight brown ridge making a left 90 degree turn in the centre of the picture."
    }
  ],
  "distance_km": 9.2,
  "description": "This cycle or walk takes you along the historic Mastiles Lane Roman Road from the village of Kilnsey to Malham Tarn. The lanes is a former Roman marching road, later an important route for monks leading sheep from Fountains Abbey to summer pasture on higher ground. The route runs for about 6 miles with a moderate climb at the start. If you are cycling then a mountain bike is probably best and you may have to walk some of the rougher sections. The route starts in the village of Kilnsey in lovely Wharfedale. The lane starts in the village and heads east past Kilnsey Park which has a number of attractions to visit. These include a trout farm and nature trails with with wildlife such as red squirrels, angora goats, alpacas and butterflies to look out for on the way. The lane continues across Kilnsey Moor, passing the site of an old Roman Camp on the way. Shortly after passing Seaty Hill you come to Malham Tarn where the route finishes.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south you'll find the Grass Wood Nature Reserve. There's some nice woodland trails, bluebells in spring and lots of wildlife to see here. The reserve is notable as one of the largest areas of broadleaved woodland in the Dales."
    }
  ],
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mastiles Lane, Conistone with Kilnsey, Kilnsey, North Yorkshire, York and North Yorkshire, England, BD23 5PW, United Kingdom",
  "postcode": "BD23 5PW",
  "district": "Kilnsey",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "mountain"
  ],
  "points_of_interest": [
    "historic site",
    "nature trails",
    "wildlife"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}