{
  "created_at": "2025-01-06T01:41:59.602832+00:00",
  "objectID": "bcee52366a7c4547a23afb46fc1181d5",
  "ref": "kingston-walking-route",
  "title": "Kingston Dorset and Houns Tout Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/45/Entering_Kingston_along_South_Street_-_geograph.org.uk_-_899810.jpg",
  "nearby": [
    {
      "description": "Kimmeridge Bay to Chapmans Pool",
      "objectID": "8bf494265d0239bbd58479ec4d6f762c",
      "ref": "kimmeridge-bay-to-chapmans-pool-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Swyre Head",
      "objectID": "a118e13def0e80a0123289d25511f18f",
      "ref": "swyre-head-walking-route"
    },
    {
      "description": "Corfe Castle",
      "objectID": "a41a4f07c0e3e0ab6661161546ce00bf",
      "ref": "corfe-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bcee52366a7c4547a23afb46fc1181d5.gpx",
  "_geoloc": {
    "lat": 50.6161774491,
    "lng": -2.0627345327
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Entering_Kingston_along_South_Street_-_geograph.org.uk_-_899810.jpg",
      "title": "Jim Champion / Entering Kingston along South Street",
      "caption": "Entering Kingston along South Street. This lane that runs south from the village centre is naturally called South Street. The tower poking up through the trees is that of St James' church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/The_Scott_Arms%2C_Kingston_-_geograph.org.uk_-_764808.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Scott Arms, Kingston."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Looking_down_on_the_undercliff_from_Houns-tout_-_geograph.org.uk_-_909860.jpg",
      "title": "Jim Champion / Looking down on the undercliff from Houns-tout",
      "caption": "Looking down on the undercliff from Houns-tout. The headland below is Egmont Point. The scrubby undercliff comprises former land-slips below Houns-tout cliff. In the foreground is the Portland stone that caps Houns-tout."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Chapman%27s_Pool_from_Houns-tout_cliff_-_geograph.org.uk_-_909859.jpg",
      "title": "Jim Champion / Chapman's Pool from Houns-tout cliff",
      "caption": "Chapman's Pool from Houns-tout cliff. Looking down into Chapman's Pool from the summit of Houns-tout cliff. The clay cliffs around the cove are rapidly being eroded. It is thought that the cove has retreated several hundred metres inland since Roman times. The end of Houns-tout hill is now a cliff (in the foreground), but once it would have been an inland hill similar to nearby Swyre Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Track_through_the_trees_near_Kingston_-_geograph.org.uk_-_765962.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Track through the trees near Kingston. Heading south to the coast from the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Sheep_on_the_ridge_above_Encombe_Dairy_-_geograph.org.uk_-_765988.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Sheep on the ridge above Encombe Dairy"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Rocks_at_Egmont_Point_-_geograph.org.uk_-_899208.jpg",
      "title": "Jim Champion / Rocks at Egmont Point",
      "caption": "Rocks at Egmont Point. The rocks in the foreground are off Egmont Point, fallen over a period of time from Houns-Tout cliff. The rocks at this clay headland consist of Portland Stone and dolomite. Beyond is Egmont Bight, with Swyre Head in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Kingston%2C_Isle_of_Wight_view_-_geograph.org.uk_-_1718573.jpg",
      "title": "Chris Downer / Kingston: Isle of Wight view",
      "caption": "Kingston: Isle of Wight view. I was quite surprised to be able to make out the western cliffs of the Isle of Wight so easily from here. We look across someone's garden in South Street, with Ballard Down visible top-left."
    }
  ],
  "distance_km": 5.5,
  "description": "This pretty little village near Corfe Castle is a great place to start a walk along the Dorset coast. With a classic old stone pub, a significant Victorian church and easy access to the nearby cliffs, it's a bit of a hidden gem of the area. This circular walk from the village visits Houns-Tout cliff and Chapmans Pool on the coast. The walk starts from the public car park to the west of the village centre. From here you can pick up a woodland trail heading south through Quarry Wood. It's a nice shady path with wild garlic in the spring months. Eventually you will come out in open countryside where you continue south past Westhill Farm to the coast at the Houns-Tout cliff. There's some great views here along both sides of the coast. From here head east along the South West Coast Path and it will take you towards Chapman's Pool. The secluded arched pool is a beautiful spot and one of the highlights of the Jurassic Coast. You can follow a series of steep steps down to the beach if you are feeling energetic. This route follows an alternative country path north back towards Kingston. Here you can enjoy a stroll through the pretty village with its picturesque Purbeck stone cottages and historic church. The Church of St James dates from the Victorian period and is now known as 'The Cathedral of the Purbecks'. It is a Grade I listed building.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the village the Ivy covered Scott Arms is well worthy of some investigation. The historic pub has a splendid garden area around the back. In the summer months you can enjoy a Caribbean BBQ here. From the elevated position of the garden there are fine views towards Corfe Castle and the Purbeck Hills. You can find them in the village centre on West Street at postcode BH20 5LH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and coast paths make for a bracing dog walk. The Scott Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could climb to Swyre Head the highest point in Dorset. Just to the north are the historic ruins of Corfe Castle and the delightful Corfe Common. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZlCUd5hI4HM",
  "postcode": "BH20 5LH",
  "district": "Kingston",
  "county": "Dorset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}