{
    "objectID": "bd2a915f127ef832aa904b96d7db0e1e",
    "created_at": "2024-12-18T00:34:20.498155+00:00",
    "ref": "haweswater-walking-route",
    "title": "Haweswater Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/81/Haweswater_Dam_-_geograph.org.uk_-_597653.jpg",
    "nearby": [
        {
            "description": "High Street from Haweswater",
            "objectID": "cb945e7937a56911b378bcf95ce43a40",
            "ref": "high-street-from-haweswater-walking-route"
        },
        {
            "description": "Wainwright's Coast to Coast",
            "objectID": "aeb59b23526cfd8bd5521bd004d22599",
            "ref": "wainwrights-coast-to-coast-walking-route"
        },
        {
            "description": "Kentmere Horseshoe",
            "objectID": "395a7ee3fede53d9f5abb7095034d24a",
            "ref": "kentmere-horseshoe-walking-route"
        },
        {
            "description": "Brothers Water",
            "objectID": "c8331e27dba87b7210e6cafae4e55509",
            "ref": "brothers-water-walking-route"
        },
        {
            "description": "Kentmere Reservoir",
            "objectID": "8b311ef8c525c53285a8d9c80114d656",
            "ref": "kentmere-reservoir-walking-route"
        },
        {
            "description": "Yoke",
            "objectID": "5bcb3cc36004b7648f207178594c70ef",
            "ref": "yoke-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/287345EA5DAA19058025806A007CEF3F/$FILE/Haweswater.gpx",
    "_geoloc": {
        "lat": 54.4889065581,
        "lng": -2.8220112937
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Haweswater_Dam_-_geograph.org.uk_-_597653.jpg",
            "title": "Steve Partridge / Haweswater Dam, via Wikimedia Commons",
            "caption": "Haweswater Dam. Looking along the first two kilometres of the lake with autumnal trees in the picture too"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Haweswater_Dam_-_geograph.org.uk_-_72862.jpg",
            "title": "Mick Garratt / Haweswater Dam, via Wikimedia Commons",
            "caption": "Haweswater Dam. Built by Manchester Corporation between 1929 and 1941. It raised the surface of Haweswater by 96 feet increasing its capacity to 18,660 million gallons. The dam is of hollow concrete buttress construction which was quite innovative in its day. The method was cheaper and lower maintenance. Any movement of the dam is monitored inside by a giant plumb bob which has only deflected one twentieth of an inch since the dam's construction."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Haweswater_West_Bank_-_geograph.org.uk_-_73130.jpg",
            "title": "Mick Garratt / Haweswater West Bank, via Wikimedia Commons",
            "caption": "West Bank. Taken looking south from below Welter Knotts showing the unslightly shoreline of the reservoir."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Stone_Plinth_Overlooking_Haweswater_-_geograph.org.uk_-_72675.jpg",
            "title": "Mick Garratt / Stone Plinth Overlooking Haweswater, via Wikimedia Commons",
            "caption": "Stone Plinth Overlooking the lake. A carefully constructed stone platform, purpose unknown but probably used in the construction of the reservoir."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Haweswater_from_Little_Harter_Fell_-_geograph.org.uk_-_1202091.jpg",
            "title": "Mick Garratt / Haweswater from Little Harter Fell, via Wikimedia Commons",
            "caption": "Haweswater from Little Harter Fell"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Flakehowe_Crags%2C_across_Haweswater_-_geograph.org.uk_-_65685.jpg",
            "title": "David Crocker / Flakehowe Crags, across Haweswater, via Wikimedia Commons",
            "caption": "Flakehowe Crags, across Haweswater. This photo was taken from the Haweswater road near Mardale Banks. In the background, High Street summit is cloaked in early morning cloud."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Boathouse_at_Haweswater._-_geograph.org.uk_-_597795.jpg",
            "title": "Steve Partridge / Boathouse at Haweswater., via Wikimedia Commons",
            "caption": "Boathouse at Haweswater. I had a look inside there was no boat, but there was a bogey mounted onto a tracked slipway. At the front of the boathouse there is a set of badly eroded tracks leading down to the water."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Car_Park_at_the_Head_of_Haweswater_-_geograph.org.uk_-_65716.jpg",
            "title": "David Crocker / Car Park at the Head of Haweswater, via Wikimedia Commons",
            "caption": "Car Park at the Head of Haweswater. Note the exposed bed of the Lake during this very dry spell."
        }
    ],
    "distance_km": 16.5,
    "description": "Follow the lakeside trail around the beautiful Haweswater Reservoir on this circular walk in the Lake District. The area is one of the quieter parts of the national park so you can expect a delightfully peaceful walk on good paths. The path runs around the lake for just over 10 miles with some woodland sections along the way. You can start the walk from the car park at the southern end of the lake. Then head along the western side on a good footpath with great views across the water to the surrounding fells. Along the way you will pass pockets of woodland, Measand Beck and The Forces waterfalls. Here you can take a detour and climb along the beck to Bampton Common. The route continues along the lakeside to the Haweswater Dam and Burnbanks where you will pass the RSPB  Haweswater Nature Reserve. Look out for birds including Buzzard, Peregrine and Redstart in this area. At Naddle Bridge you cross the Haweswater Beck and start the return leg on the eastern side of the water. You'll pass Naddle Forest, Guerness Wood and Mardale Banks before returning to the car park. The northern tip of the Kentmere Horseshoe circular walk passes close to the lake at Harter Fell. If you climb up to Harter Fell from the parking area you can pick up the trail which takes you on a tour of the range of fells in the upper Kentmere valley. Just to the west you can visit Blea Water, Brothers Water and Hayeswater. Wainwright's Coast to Coast long distance route also passes the reservoir so you can pick this up to extend your walk. The climb to High Street also starts from the Mardale Head car park. You can virtually explore the eastern side of the reservoir using the google street view link below. Cyclists can enjoy a ride along this side of the water on the quiet country lane.",
    "video_url": "https://www.youtube.com/embed/vpDIp1ZY1VY",
    "county": "Westmorland and Furness",
    "region": "North West",
    "country": "England"
}
