{
  "objectID": "bd84563b2c921be516082a4f7582a984",
  "created_at": "2024-12-21T12:53:46.054799+00:00",
  "ref": "somerset-space-walk",
  "title": "Somerset Space Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Somerset_Space_Walk_Sun_2.jpg/512px-Somerset_Space_Walk_Sun_2.jpg?20100830164933",
  "nearby": [
    {
      "description": "Bridgwater and Taunton Canal",
      "objectID": "e571e18a0e6613925af42440a1d55968",
      "ref": "bridgwater-and-taunton-canal-walking-and-cycle-route"
    },
    {
      "description": "Taunton Heritage Trail",
      "objectID": "51ee71f85e8eb1db236e5704e6915070",
      "ref": "taunton-heritage-trail-walking-route"
    },
    {
      "description": "Maunsel Lock",
      "objectID": "f70606b82ccd53e0b3caf3340872870f",
      "ref": "maunsel-lock-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/CEB527BC8D0F42B686258B2B004BE3FB/$FILE/Somerset Space Walk.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Somerset_Space_Walk_Sun_2.jpg/512px-Somerset_Space_Walk_Sun_2.jpg?20100830164933",
      "title": "Rodw, Public domain, via Wikimedia Commons",
      "caption": "The Sun (scale 1:530,000,000). Located at Maunsel Lock on the Somerset Space Walk on the Bridgwater and Taunton Canal. The model of the Sun is a 2.5-metre (8.2 ft)-wide, 14-ton concrete sphere with a vertical segment removed to create two vertical faces for mounting explanatory plates. The solid sphere was cast by Pip Youngman and Trevor Hill in the grounds of the former SWEB storage yard adjacent to the Obridge Viaduct in Taunton. Initially 'natural' in colour to match the other models, it was painted yellow during refurbishment to enhance its visibility."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Bathpool_-_Canal_and_Neptune.jpg/512px-Bathpool_-_Canal_and_Neptune.jpg?20101027071725",
      "title": "Geof Sheppard, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Neptune. Two anglers cast for fish in the Bridgwater and Taunton Canal at Bathpool. The feature on the right of the path represents Neptune. Each of the smallest planet models is housed within a round-topped concrete plinth about 1 metre (3.3 ft) high. The stainless steel model is held inside a circular hole in the side of the plinth, allowing the model of the planet to be viewed through the hole. Youngman created the plinths using fibreglass moulds, which he also made. The models of the largest gas giants, Saturn and Jupiter, are moulded as part of the top face of the concrete pillars. Originally concrete-coloured, they were painted during the refurbishment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Somerset_Space_Walk_Jupiter.jpg/512px-Somerset_Space_Walk_Jupiter.jpg?20100830164520",
      "title": "Rodw, Public domain, via Wikimedia Commons",
      "caption": "Jupiter. Each pillar also serves as a milepost, with the distance to Bridgwater and Taunton cast in the concrete at ground level, below a depiction of the British Waterways 'bridge' logo. However, the sculptures are positioned according to the spacing required for the model, rather than at kilometre increments for the convenience of boaters. The Walk is a collaborative project between the Taunton Solar Model Group and British Waterways, with support from Somerset County Council, Taunton Deane Borough Council, and the Somerset Waterways Development Trust. The Taunton Solar Model Group consisted of Pip Youngman, Trevor Hill—a local physics teacher who had received the title of \"Institute of Physics (IOP) Physics Teacher of the Year\"—and David Applegate, who, during his tenure as Mayor of Taunton, had expressed a desire to see a science initiative in the area. Youngman conceived the idea for the Space Walk, and Hill assisted by calculating the appropriate positions and sizes of the planets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Cogload_Junction_43163.jpg?20090729072817",
      "title": "Geof Sheppard, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Saturn with First Great Western 43163 passing Cogload Junction in the background. Funding for the project was provided by the Committee on the Public Understanding of Science (COPUS), and the initial advertising leaflet was funded by the Particle Physics and Astronomy Research Council (PPARC). There was also a small grant from Sustrans, which funds art installations along cycle paths, to cover maintenance requirements until Somerset County Council took on that responsibility. To apply for the COPUS funding, Youngman needed two 'sponsors', so he wrote to Arthur C. Clarke (a local native living in Sri Lanka at the time) and Patrick Moore, both of whom wrote warm letters of support. Arthur C. Clarke's brother Fred read out his letter at the opening ceremony. ReadyMix Concrete provided the concrete for the plinths, and Avimo (now part of Thales Group), a local defence contractor, supplied the steel for the models."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Somerset_Space_Walk_Earth.jpg/512px-Somerset_Space_Walk_Earth.jpg?20100830164346",
      "title": "Rodw, Public domain, via Wikimedia Commons",
      "caption": "Somerset Space Walk Earth. The pillar's include a plaque with a short inscription describing the planet. The Earth inscription reads: \"Earth orbits far enough from the heat of the Sun for water to be liquid, near enough not to freeze, for air to be a gas and earth a solid. With gravity strong enough to hold our atmosphere, gentle enough to allow delicate life forms. Rotating to give our day and night, tilted to give the four seasons. Enormous to us, tiny on the cosmic scale. Our home, unique, beautiful, fragile.\" – Pip Youngman"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Taunton_Pluto.jpg/256px-Taunton_Pluto.jpg?20101027071247",
      "title": "Geof Sheppard, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Pluto"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Standards_lock%2C_Taunton_and_Bridgwater_canal_-_geograph.org.uk_-_313647.jpg?20101230154958",
      "title": "Martin Southwood / Standards lock, Taunton and Bridgwater canal",
      "caption": "Standards lock, Taunton and Bridgwater canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/The_Bridgwater_and_Taunton_Canal_-_geograph.org.uk_-_4251003.jpg?20230107190534",
      "title": "The Bridgwater and Taunton Canal by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Canal view near Bridgwater"
    }
  ],
  "distance_km": 21.0,
  "description": "This waymarked walk runs from Bridgwater to Taunton along the Bridgwater and Taunton Canal . The route is lined with a number of sculptures representing the planets of the Solar System. As well as the astronomical interest you can enjoy a number of pretty locks and fine views of the surrounding countryside. The Space Walk was opened on 9 August 1997 by British astronomer Heather Couper. The route uses the canal towpath to display a representation of the Sun and its planets in proportionally correct sizes and distances. Unusually for a Solar System model, there are two sets of planets to represent the diameter of the orbits. Aware of the limitations of printed pictures of the Solar System, inventor Pip Youngman designed the Space Walk to challenge people's perceptions of space and to provide an experience of the vastness of the Solar System. The model is built to a scale of 1:530,000,000, meaning that one millimetre on the model equates to 530 kilometres. The Sun is positioned at Higher Maunsel Lock , with one set of planets installed in each direction along the canal towards Taunton and Bridgwater. The distance between the Sun and each model of Pluto is 11 kilometres (6.8 miles). For less hardy walkers, the inner planets are within 430 metres (1,410 feet) of the Sun, near the Maunsel Canal Centre (and tea shop) at Lower Maunsel Lock, where a more detailed leaflet about the model is available. In 2007, a project team from Somerset County Council refurbished some of the models.",
  "video_url": "https://www.youtube.com/embed/hVBo94H3HuA?si=jv0tTLxTfBxDQ2A5"
}