{
  "objectID": "bdd14d1efa3d250fc99371d2476ba1fd",
  "created_at": "2024-12-18T19:11:55.635048+00:00",
  "ref": "rugeley-walking-route",
  "title": "Rugeley Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Rugeley_-_geograph.org.uk_-_276821.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/DFB33EDB9752AD23862586C7004905D1/$FILE/Rugeley.gpx",
  "_geoloc": {
    "lat": 52.7650352701,
    "lng": -1.9346390732
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Rugeley_-_geograph.org.uk_-_276821.jpg",
      "title": "www fotodiscs4u co uk / Rugeley",
      "caption": "Rugeley Upper Brook Street, leading into the town centre, showing \"The Crown Inn\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Rail_Bridge_over_the_River_Trent%2C_Rugeley_%28geograph_2493973%29.jpg",
      "title": "Mick Malpass / Rail Bridge over the River Trent, Rugeley",
      "caption": "Rail Bridge over the River Trent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Autumn_colours_on_the_canal._Rugeley%2C_Staffordshire_-_geograph.org.uk_-_1556810.jpg/512px-Autumn_colours_on_the_canal._Rugeley%2C_Staffordshire_-_geograph.org.uk_-_1556810.jpg",
      "title": "Roger  Kidd / Autumn colours on the canal. Rugeley, Staffordshire",
      "caption": "Autumn colours on the canal. This is the Trent and Mersey canal, built 1766-1777 under the supervision of James Brindley. It has acted as a eastern boundary to the expansion of Rugeley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Trent_and_Mersey_Canal_in_Rugeley%2C_Staffordshire_-_geograph.org.uk_-_1559230.jpg",
      "title": "Roger  Kidd / Trent and Mersey Canal in Rugeley, Staffordshire",
      "caption": "Trent and Mersey view through the town. The Trent and Mersey canal, fully opened by 1777, has acted as a boundary to the expansion of Rugeley to the north-east. These canal-side cottages, ideal for people who prefer small gardens, are in Anson Mews. Some of it seems to be restored old housing, though the end one is more modern, and the far buildings are recent. Just in case your boat doggy or moggie is ill, there is a vet's practice in the mews, as well as a large supermarket nearby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Trent_and_Mersey_Canal_in_Rugeley%2C_Staffordshire_-_geograph.org.uk_-_1559258.jpg",
      "title": "Roger  Kidd / Trent and Mersey Canal in Rugeley, Staffordshire",
      "caption": "The old factory units here in Mill Lane will probably be redeveloped before long, and canal-side housing seems to be a popular use for such sites."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Trent_and_Mersey_Canal_at_Rugeley%2C_Staffordshire_-_geograph.org.uk_-_1004512.jpg",
      "title": "Roger  Kidd / Trent and Mersey Canal at Rugeley, Staffordshire",
      "caption": "Both bridges are (or were) railway bridges taking the lines to the power station, yet the closer (more modern) one has become disused. Neither has an original canal bridge number, as they were built after the canal, which dates from as long ago as 1777 (it having been given permission to start construction in 1766)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/The_Essex_Bridge_%28part%29_at_Shugborough%2C_Staffordshire_-_geograph.org.uk_-_1193522.jpg",
      "title": "Roger  Kidd / The Essex Bridge (part) at Shugborough, Staffordshire",
      "caption": "The Essex Bridge (part) at Shugborough, Staffordshire. The stone packhorse bridge across the River Trent was built in 1550 by the Earl of Essex for Queen Elizabeth I so she could go hunting near the village. It has low parapets to avoid impeding the wide loads on the horses. Originally it had 40 arches, fourteen of which remain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Hawkesyard_Hall_near_Rugeley%2C_Staffordshire_-_geograph.org.uk_-_1680251.jpg",
      "title": "Roger  Kidd, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hawkesyard Hall. Nathaniel Lister, (poet and author, Member of Parliament for Clitheroe and uncle of Baron Ribblesdale) had the house built in the Gothic Revival style in about 1760. Josiah Spode IV, greatgrandson of Josiah Spode bought the estate in about 1840 and the house was much altered and extended. At this time it was known as Spode House. The present owners, who have converted this superb Grade II listed building into offices and a conference centre."
    }
  ],
  "distance_km": 14.0,
  "description": "This Staffordshire based town has some nice waterside trails along the river and canal which run through the area. It's also very near to the splendid Cannock Chase AONB, where there's miles of walking and cycling opportunites. This walk from the town takes you along the Trent and Mersey Canal to the wonderful Shugborough Hall just to the north. The walk starts on the eastern side of the town where you can pick up the canal towpath. Follow it north and it will take you through Colwich to Little Haywood and Great Haywood where you will find Shugborough Hall. The historic hall is one of the local highlights with an expansive area of woodland and parkland to explore. After exploring the hall the route returns to the town on the same paths which include a section along the waymarked Staffordshire Way .",
  "video_url": "https://www.youtube.com/embed/QLAhQ_Bpbgg",
  "district": "Rugeley",
  "county": "Staffordshire",
  "region": "West Midlands",
  "country": "England"
}