{
  "objectID": "bdd3afed4a73cee1a2060898ef624ac4",
  "created_at": "2024-12-18T00:33:23.989447+00:00",
  "ref": "llyn-brianne-walking-and-cycle-route",
  "title": "Llyn Brianne Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/13/The_northern_arms_of_Llyn_Brianne_-_geograph.org.uk_-_540398.jpg",
  "nearby": [
    {
      "description": "Rhandirmwyn",
      "objectID": "e50b6bcdc326d3dc3d0ebc83abf03bcc",
      "ref": "rhandirmwyn-walking-route"
    },
    {
      "description": "LLanwrtyd Wells",
      "objectID": "bbe6ac5cf4fb9b9a87680d6605e645d6",
      "ref": "llanwrtyd-wells-walking-route"
    },
    {
      "description": "Tywi Valley",
      "objectID": "831b4b0ccbfbc2204c4b8316bfae1e9a",
      "ref": "tywi-valley-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/85B933B6EDC9A5C08025800400522978/$FILE/Llyn Brianne.gpx",
  "_geoloc": {
    "lat": 52.1211403841,
    "lng": -3.7640111722
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/The_northern_arms_of_Llyn_Brianne_-_geograph.org.uk_-_540398.jpg",
      "title": "Trevor Rickard / The northern arms of Llyn Brianne, via Wikimedia Commons",
      "caption": "The northern arms of Llyn Brianne The lake has a complex structure and the road up the east side at its highest point provides a good view of the two long northern arms."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Afon_Tywi_feeding_Llyn_Brianne_-_geograph.org.uk_-_1041550.jpg",
      "title": "Roger  Kidd / Afon Tywi feeding Llyn Brianne, via Wikimedia Commons",
      "caption": "Afon Tywi feeding Llyn Brianne. About one mile north of here is a weir with a tower containing lime which is automatically released into the river to neutralise its acidity before it enters the reservoir at Llyn Brianne. The cilycwm.com website gives this information: Llyn Brianne reservoir was originally built (1968-1972) to satisfy the growing demands of heavy industry in and around Swansea for water, notably the tin plate works at Felindre and a smelting plant at Llansamlet. Ironically, both these have since closed down and water from Llyn Brianne which is surplus to the Swansea area's needs now goes into the general supply, quenching thirsts all the way from Llanelli, across West and South Wales and as far East as Cardiff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Llyn_Brianne_weir_-_geograph.org.uk_-_925476.jpg",
      "title": "John Gibson / Llyn Brianne weir, via Wikimedia Commons",
      "caption": "Llyn Brianne weir. Overflowing water pours over the weir at the top of the Llyn Brianne spillway as the day's weather looks set to be dominated by heavy rain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Llyn_Brianne_and_the_Tywi_Forest%2C_Powys_-_geograph.org.uk_-_1041524.jpg",
      "title": "Roger  Kidd / Llyn Brianne and the Tywi Forest, Powys, via Wikimedia Commons",
      "caption": "Llyn Brianne and the Tywi Forest in autumn, Powys. The yellow-brown hues of the larch trees contrasts with the greens of the other conifers in November."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Llyn_Brianne_through_the_trees%2C_Powys_-_geograph.org.uk_-_1066732.jpg/256px-Llyn_Brianne_through_the_trees%2C_Powys_-_geograph.org.uk_-_1066732.jpg",
      "title": "Roger  Kidd / Llyn Brianne through the trees, Powys, via Wikimedia Commons",
      "caption": "View of the lake through the trees.This is towards the northern end of the Tywi arm. If felling of the trees by the water continues, it is likely that replanting will be with native deciduous trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Bridleway_near_Llyn_Brianne%2C_Powys_-_geograph.org.uk_-_1501142.jpg/256px-Bridleway_near_Llyn_Brianne%2C_Powys_-_geograph.org.uk_-_1501142.jpg",
      "title": "Roger  Kidd / Bridleway near Llyn Brianne, Powys, via Wikimedia Commons",
      "caption": "The bridleway from Abergwesyn descends here to the road traversing the slopes above the Tywi arm of Llyn Brianne."
    }
  ],
  "distance_km": 22.0,
  "description": "Enjoy a walk or cycle along this beautiful reservoir in central Wales. The reservoir sits at the head of the River Towy with a dam 299 feet high and 951 feet long. There's a lovely country lane running along the eastern side of the water. It climbs high above the reservoir with wonderful views over the water to the surrounding countryside and hills. The lane is ideal for a quiet cycle ride in beautiful surroundings. The route starts from the car park at the southern end of the water and follows the track through the Tywi Forest before finishing at the bridge at the northern end of the reservoir. Look out for red squirrels as you pass through the forest. You can view the scenery and follow the route using the google street view link below. To extend your walking in the area you could head to the Gwenffrwd-dinas RSPB Nature Reserve which is just to the south of the reservoir. Here you can enjoy great views of the River Towy and look out for red kites and a variety of butterflies. Just to the north west of the lake you will find Soar y mynydd a Calvinist Methodist Church sitting in the valley of the river Camddwr in the Cambrian Mountains. It's claim to fame is that it is the remotest chapel in all Wales. To the north east of the lake you will find the village of Abergwesyn, Vicarage Meadows and the pretty Nant Irfon National Nature Reserve. There's some nice woodland trails here with lots of bluebells in the spring.",
  "video_url": "https://www.youtube.com/embed/n0kOP8tcmOk",
  "county": "Sir Ceredigion - Ceredigion",
  "region": "Wales",
  "country": "Wales"
}