{
  "created_at": "2025-01-06T08:03:04.906893+00:00",
  "objectID": "be2762addb52304da14635e5d0df98cb",
  "ref": "kielder-forest-lakeside-way-walking-and-cycle-route",
  "title": "Kielder Forest Lakeside Way Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Lakeside_Way_-_Kielder_Water_-_geograph.org.uk_-_1363676.jpg",
  "nearby": [
    {
      "description": "Deadwater Fell",
      "objectID": "2a269399b95e92f4cb56f9b15643a43f",
      "ref": "deadwater-fell-walking-route"
    },
    {
      "description": "Bellingham to Langholm",
      "objectID": "4976edd30c403ae82bbe6d85e29eca6a",
      "ref": "bellingham-to-langholm-cycle-route"
    },
    {
      "description": "Catcleugh Reservoir",
      "objectID": "03e7afaaabac55ddd260def019254a3e",
      "ref": "catcleugh-reservoir-walking-route"
    },
    {
      "description": "Kershope Forest",
      "objectID": "5b11cf56b15030aaea4d1ddebaa090d2",
      "ref": "kershope-forest-walking-route"
    },
    {
      "description": "Kielder Reservoir",
      "objectID": "5ad9000a2c5b47ec9788085130f7cd21",
      "ref": "kielder-reservoir-walking-route"
    },
    {
      "description": "Hindhope Linn",
      "objectID": "171bfa43a688793b212179969406307a",
      "ref": "hindhope-linn-walking-route"
    },
    {
      "description": "Wark Forest",
      "objectID": "fde8cbf12f2f6c4be860d76f091b152e",
      "ref": "wark-forest-walking-route"
    },
    {
      "description": "Reivers Route",
      "objectID": "99aecd0f14d923341c68e7d2f7b26077",
      "ref": "reivers-route-cycle-route"
    },
    {
      "description": "National Cycle Route 10",
      "objectID": "6952a6825cafe0e9253b33a33af38b5c",
      "ref": "national-cycle-route-10"
    },
    {
      "description": "Border County Ride",
      "objectID": "7c73099d69edec6248153d73b1c0279c",
      "ref": "border-county-ride-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/be2762addb52304da14635e5d0df98cb.gpx",
  "_geoloc": {
    "lat": 55.2287143841,
    "lng": -2.5797208026
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Lakeside_Way_-_Kielder_Water_-_geograph.org.uk_-_1363676.jpg",
      "title": "Simon Johnston / Lakeside Way - Kielder Water",
      "caption": "Lakeside Way - Kielder Water The Lakeside Way was recently completed (2009) and is a full perimeter walking and cycling route hugging the lakeside of the UK's largest body of water. (42 Km)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Lakeside_Way_-_Kielder_Water_-_geograph.org.uk_-_1363701.jpg",
      "title": "Simon Johnston / Lakeside Way - Kielder Water",
      "caption": "Lakeside Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Hillside_in_Kielder_Forest_-_geograph.org.uk_-_204541.jpg",
      "title": "Iain Thompson / Hillside in Kielder Forest",
      "caption": "Hillside in Kielder Forest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Track_in_Kielder_Forest_-_geograph.org.uk_-_204456.jpg",
      "title": "Iain Thompson / Track in Kielder Forest",
      "caption": "Track in Kielder Forest"
    }
  ],
  "distance_km": 35.0,
  "description": "This fantastic circular cycling and walking route takes you around the beautiful Kielder Water in Kielder Forest Park, Northumberland. The route is known as the Lakeside Way and follows the shoreline of the reservoir on a lovely multi-user track. Along the way you can see twenty pieces of outdoor public art including the futuristic Belvedere shelter and the three large rotating Janus Chairs. There's excellent wildlife spotting opportunities with Ospreys regularly seen around the reservoir. The route also passes Kielder Dam and Kielder Castle where you will find an excellent visitor centre with exhibitions, information and a cafe. The castle is also the centre for cycling within the park - you can hire a bike here or get your own repaired. It is located at the northern tip of the reservoir at Kielder village. If you're looking for a more challenging cycle ride you will also find several colour coded mountain bike trails within the park. They range from the easy Borderline trail to the thrilling Deadwater black trail. For great views over the Lake District and the Scottish Hills you could climb Deadwater Fell from Kielder Castle. A few miles to the north there's a nice climb to Girdle Fell with great views over the lovely Catcleugh Reservoir .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kielder Castle Café is a nice place to enjoy some post ride/walk refreshments. It is integrated in the ancient Kielder castle which was built in 1775 as a hunting lodge for the Duke of Northumberland. The cosy family run Café serves locally sourced homemade food daily including, breakfasts, lunches, snacks, soups and cakes. The building also includes a free exhibition, an open log fire, a wildlife camera and an area where you can view the native red squirrels on the feeder outside. At the Tower Knowe centre at the southern of the lake there's the Wafflemeister cafe where you can enjoy handmade Belgian liege waffles, thick shakes and savoury American waffles."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome on the lakeside path but need to be on leads around the fishing areas. The surrounding woodland trails also make for a fine dog walk and can be let off the lead in most of this area. The Kielder Castle Café mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For a shorter walk try the Kielder Reservoir Walk. This route explores the Bullcrag Peninsula and the Kielder Dam from the Tower Knowe visitor centre at the southern end of the lake. There's good facilities at the centre with a car park, cafe and an interactive exhibition on the Dam and how it was built. A few miles to the south west you will find the expansive Kershope Forest. There's more peaceful trails here with climbs to the Bewcastle Fells and the Christianbury Crags. Head a few miles north east through and you could visit something of a hidden gem at Hindhope Linn in the Redesdale Forest. There's some pretty waterfalls here and more nice waterside trails along the burns that run through the area. The epic Pennine Way can also be picked up at the falls car park here. On the southern side of the forest you can explore Wark Forest. It's a very peaceful area with miles of good walking and mountain bike trails. There's a car park at the Stonehaugh Picnic and campsite where you can pick up some nice walks along the Blacka Burn. For cyclists the popular Reivers Route along National Cycle Route 10 runs through the park. The epic route takes you from coast to coast, starting at Whitehaven and finishing at Tynemouth. The reservoir makes a good start point for the long distance Border County Ride. The circular cycling and walking route explores the forests and hills of the Cheviots, visiting the England - Scotland border on the way. For more walking ideas in the area see the Northumberland Walks and Cheviots Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gOKhUK-MUCM",
  "district": "Butteryhaugh",
  "county": "Northumberland",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}