{
  "objectID": "be9b3d39a746039072310331122caf4a",
  "created_at": "2024-12-18T07:47:42.371815+00:00",
  "ref": "clarendon-way-walking-route",
  "title": "Clarendon Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Signpost_on_the_Clarendon_Way_-_geograph.org.uk_-_236909.jpg",
  "nearby": [
    {
      "description": "Clarendon Way",
      "objectID": "be9b3d39a746039072310331122caf4a",
      "ref": "clarendon-way-walking-route"
    },
    {
      "description": "Farley Mount Country Park",
      "objectID": "07fca5f66930ee3b86aff4bbda4594af",
      "ref": "farley-mount-country-park-walking-route"
    },
    {
      "description": "Salisbury Circular Walk",
      "objectID": "03cb8dc1b9a6194e29fb9564b8a79092",
      "ref": "salisbury-circular-walk-walking-route"
    },
    {
      "description": "Test Way",
      "objectID": "f7f671cf68a772945c580a3901d631a6",
      "ref": "test-way-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/27E925AA4E928198802577F5005D5C9B/$FILE/Clarendon Way.gpx",
  "_geoloc": {
    "lat": 51.0668787133,
    "lng": -1.7976204221
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Signpost_on_the_Clarendon_Way_-_geograph.org.uk_-_236909.jpg",
      "title": "Jim Champion / Signpost on the Clarendon Way",
      "caption": "Signpost on the Clarendon Way. The footpath (from Salisbury to Winchester) makes a right-angled turn here on the very edge of the grid square. The green track across the field is the route of the footpath as it climbs Beacon Hill towards Farley Mount."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/The_monument_at_Farley_Mount_-_geograph.org.uk_-_26204.jpg",
      "title": "Jim Champion / The monument at Farley Mount",
      "caption": "The white monument at Farley Mount. This viewpoint is located just west of Winchester and one of the highlights on the trail. This pyramidal obelisk was erected to the memory of a racehorse called \"Beware Chalk Pit\" which won the Hunters Plate at Worthy Down races in October 1734. The plaque at the monument say that \"underneath lies buried a horse the property of Paulet St John esq. that in the month of September 1733 leaped into a chalk pit twentyfive feet deep a foxhunting with his master on his back\". The story is that his master was so grateful that his surefooted horse prevented his early death that he had this monument built. Probing during the recent restoration revealed no evidence of a horse's remains under the mound. It is possible that the mound is a bronze-age bowl barrow, but no archaeological work has been carried out to confirm this."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Ploughed_field_on_Ashley_Down_-_geograph.org.uk_-_236922.jpg",
      "title": "Jim Champion / Ploughed field on Ashley Down",
      "caption": "Ploughed field on Ashley Down. This ploughed chalk field features two trees which have been left standing, despite the fact that they must be awkward for the farmer to work around. The course of the Roman Road runs diagonally across this field. The worn track going up the hill into the woods on the left of the photo is the Clarendon Way footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/The_bottom_end_of_Whiteshute_Lane_-_geograph.org.uk_-_449917.jpg",
      "title": "Jim Champion / The bottom end of Whiteshute Lane",
      "caption": "The bottom end of Whiteshute Lane Whiteshute Lane is a bridleway, but was once a drovers' road to Winchester from the south-east. At this point, towards the bottom of the hill, it looks like a 'sunken lane', scoured into the chalk by centuries of use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Clarendon_Palace_-_geograph.org.uk_-_970651.jpg",
      "title": "Graham Horn / Clarendon Palace",
      "caption": "Clarendon Palace. This is the most substantial part of the remains of the Medieval Royal palace. It is now used for sheep grazing but you can wander round the whole area. The palace was a royal residence during the Middle Ages, and was the location of the Assize of Clarendon which developed the Constitutions of Clarendon. It now lies within the grounds of Clarendon Park. Entrance is free and there are also a number of information boards dotted around the site. They detail the history of the palace and explain the layout of what remains. You can find the ruins near the start of the walk, just east of Salisbury. Postcode is SP5 3ET."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Deer_in_Parnholt_Wood_-_geograph.org.uk_-_1609844.jpg",
      "title": "Bill Boaden / Deer in Parnholt Wood",
      "caption": "Deer and pretty bluebells in Parnholt Wood. These woods are located just to the west of Farley Mount."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Salisbury_Cathedral_-_geograph.org.uk_-_754220.jpg",
      "title": "Mike Searle / Salisbury Cathedral",
      "caption": "Salisbury Cathedral at the start of the walk. Bishop Richard Poore's masterpiece was thirty-eight years in the building, and was finally completed in 1258. Its 750th anniversary will be celebrated in 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Winchester_-_Winchester_Cathedral_-_geograph.org.uk_-_1159562.jpg",
      "title": "Chris Talbot / Winchester - Winchester Cathedral",
      "caption": "Winchester Cathedral."
    }
  ],
  "distance_km": 39.0,
  "description": "Walk from Salisbury to Winchester on the Clarendon Way and enjoy some wonderful scenery. The route takes you through the counties of Hampshire and Wiltshire and runs for a distance of about 25 miles. The path starts next to Salisbury Cathedral and heads through Milford and past the photogenic ruins of Clarendon Palace before a short wooded section takes you to Pitton. You then cross the hills to West and Middle Winterslow and descend into Broughton where you join a lovely country lane that takes you onto Houghton. Here you cross the River Test on your way to the worthy village of King's Somborne with its 17th century pub and 13th century church. Another wooded section through Parnholt woods then leads to the beautiful Farley Mount Country Park where at the highest point there is a pyramid shaped folly that gives the park its name. The final section sees the walker descend into the city of Winchester, passing through the outskirts and then along the River Itchen to finish next to the famous cathedral.",
  "video_url": "https://www.youtube.com/embed/VAhbzKv76QE",
  "postcode": "SP1 2PD",
  "district": "Salisbury",
  "county": "Wiltshire",
  "region": "South West",
  "country": "England"
}