{
  "created_at": "2025-01-06T04:49:19.358873+00:00",
  "objectID": "bee1da20e3a1d771ea9f89b5a2d25ba9",
  "ref": "teesdale-way-walking-route",
  "title": "Teesdale Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Ford_on_Teesdale_Way_-_geograph.org.uk_-_525701.jpg",
  "nearby": [
    {
      "description": "Barnard Castle",
      "objectID": "0948752f209d52e3869d49e533f71371",
      "ref": "barnard-castle-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Cow Green Reservoir and Cauldron Snout",
      "objectID": "fde863f6ed3a3635dbb832514339b716",
      "ref": "cow-green-reservoir-and-cauldron-snout-walking-route"
    },
    {
      "description": "Redcar to Saltburn Beach Walk",
      "objectID": "8525c4216464742e8c67db8bcc4bb191",
      "ref": "redcar-to-saltburn-beach-walk-walking-route"
    },
    {
      "description": "Tees Barrage Walk",
      "objectID": "33540dea304b2786028fcb254f358a58",
      "ref": "tees-barrage-walk-walking-route"
    },
    {
      "description": "Yarm",
      "objectID": "0f3f43075cc7ab0391b5c83fb0051737",
      "ref": "yarm-walking-route"
    },
    {
      "description": "Piercebridge",
      "objectID": "1da68c84163dde33aff7ff4df3a56633",
      "ref": "piercebridge-walking-route"
    },
    {
      "description": "Dufton Pike",
      "objectID": "c00e009dce13aba09dad1764106bde8b",
      "ref": "dufton-pike-walking-route"
    },
    {
      "description": "Stockton on Tees",
      "objectID": "f1b35618d8e5765411b4680143295816",
      "ref": "stockton-on-tees-walking-route"
    },
    {
      "description": "Hurworth on Tees",
      "objectID": "d6d1cbed395d1aac2610249130b0d4f6",
      "ref": "hurworth-on-tees-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bee1da20e3a1d771ea9f89b5a2d25ba9.gpx",
  "_geoloc": {
    "lat": 54.6196726578,
    "lng": -2.4836523386
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Ford_on_Teesdale_Way_-_geograph.org.uk_-_525701.jpg",
      "title": "William Metcalfe / Ford on Teesdale Way",
      "caption": "Ford on Teesdale Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/On_the_Teesdale_Way_-_geograph.org.uk_-_1512380.jpg",
      "title": "Chris Heaton / On the Teesdale Way",
      "caption": "On the Teesdale Way Part of the long distance footpath between Cotherstone and Woden Croft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Teesdale_Way_-_geograph.org.uk_-_459162.jpg",
      "title": "Stanley Howe / Teesdale Way",
      "caption": "A public footpath signpost, featuring a Dipper. Near Gainford Spa. The mineral spa fountain has a sulphur smell but pleasant tasting water. It is thought to have healing properties. Gainford also includes a picturesque village green, some historic Georgian Houses and the Gainford Millennium Green, a small riverside park on the south western side of the settlement."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Teesdale_Way_-_geograph.org.uk_-_1730533.jpg/512px-Teesdale_Way_-_geograph.org.uk_-_1730533.jpg",
      "title": "Alan Murray-Rust / Teesdale Way",
      "caption": "Teesdale Way Looking north-east from near the bridge into Teesport. There are the remains of a fence between footpath and railway, but the pipelines do the job of forming a barrier between the footpath and the steelworks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Victoria_Bridge%2C_Stockton-on-Tees_-_geograph.org.uk_-_258094.jpg",
      "title": "Mick Garratt / Victoria Bridge, Stockton-on-Tees",
      "caption": "Victoria Bridge, Stockton-on-Tees. Opened on the 20 June 1887, the new bridge spanning the Tees was so named in commemoration of the 50th anniversary of the reign of Queen Victoria."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Teesdale_Way_-_geograph.org.uk_-_1730533.jpg/512px-Teesdale_Way_-_geograph.org.uk_-_1730533.jpg",
      "title": "Alan Murray-Rust / Teesdale Way",
      "caption": "Looking north-east from near the bridge into Teesport. There are the remains of a fence between footpath and railway, but the pipelines do the job of forming a barrier between the footpath and the steelworks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/On_the_Teesdale_Way_-_geograph.org.uk_-_1512380.jpg",
      "title": "Chris Heaton / On the Teesdale Way",
      "caption": "Part of the long distance footpath between Cotherstone and Woden Croft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Teesdale_Way_at_Neasham_-_geograph.org.uk_-_1352005.jpg",
      "title": "Oliver Dixon / Teesdale Way at Neasham",
      "caption": "Footpath at Neasham"
    }
  ],
  "distance_km": 148.0,
  "description": "Follow the River Tees from Dufton, in Cumbria, to Redcar on the North Yorkshire coast. The first section takes you through the Pennine Hills, from Dufton to Forest-in-Teesdale. There is some spectacular scenery as you pass through Dufton Fell and then past Cow Green Reservoir before joining the River Tees near the village of Forest-in-Teesdale. This section is coincident with the Pennine Way National Trail and includes several beautiful waterfalls as shown in the video below. From Forest-in-Teesdale you continue along the river passing Newbiggin, Middleton in Teesdale and Egglesdon Hall on your way to Barnard Castle. Here you will find two fascinating historical buildings in the 12th century Barnard castle and the ruined abbey at nearby Egglestone. You can also try our Teesdale Way Circular Walk here which runs along both sides of the river from the castle to the villages of Egglestone, Romaldkirk and Cotherstone. The next section runs from Barnard Castle to Darlington. This section very closely follows the banks of the River Tees, passing Whorlton and the interesting Roman Fort at Piercebridge on the way. From Darlington you continue east towards Stockton-on-Tees. This section takes you past Teesside Airport and the pretty town of Yarm. The final section takes you through the industrial landscape of Stockton on Tees and Middlesbrough, passing the impressive Infinity Bridge, and the Tees Barrage. You then pass Middlesbrough Docks and the Riverside Stadium before finishing on the outskirts of Redcar.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Stag Inn in Dufton at the start of the route is a good place to stay or get a bite to eat. (Postcode:CA16 6DB). The rustic country inn was built in 1703 and includes solid oak beams. It's in a lovely spot overlooking the village green and is very walker friendly. There's a good menu and accommodation is also available if you need to stay over. At Piercebridge you'll find The George. The old coaching inn is located in a nice spot next to the river. You can sit outside and enjoy a fine view on warmer days. The pub can be found at a postcode of DL2 3SW for your sat navs. In the delightful village of Romaldkirk there's the lovely Rose and Crown. The hotel is set in a fine old coaching inn, dating from the 18th century. They serve high quality food and have an interior with bags of character. You can find them at postcode DL12 9EB for your sat navs. They also provide accommodation if you need to stay over. After your pint you could enjoy a stroll around the picturesque village which includes a noteworthy Saxon Church and fine views of the Teesdale countryside. Near Darlington you will pass through the village of Hurworth on Tees where you can visit the historic Bay Horse Inn. The former coaching inn dates back to the 15th century and includes a charming interior with original features combined with the modern. Outside there's a beautiful walled garden where you can relax on warmer days. They serve high quality food and can be found at 45 The Green with postcode DL2 2AA for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Barnard Castle look out for the remains of the ancient Egglestone Abbey. The 12th century abbey sits in a photogenic location next to the river. The site is run by English Heritage and includes a 13th century church. In this area you will also Greta Bridge and the Meeting of the Waters. It's a scenic spot where the River Tees and the River Greta meet. The village also includes the noteworthy Morrit Arms, an historic hotel dating back to the 17th century. The area has literary connections with Charles Dickens who researched his novel 'Nicholas Nickleby' here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3ODYZOWVDGg",
  "postcode": "CA16 6BZ",
  "district": "Dufton",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dufton, Westmorland and Furness, England, CA16 6BZ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "rural",
    "industrial"
  ],
  "points_of_interest": [
    "historical buildings",
    "Roman fort",
    "waterfalls",
    "bridge"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}