{
  "created_at": "2025-01-06T01:00:26.922952+00:00",
  "objectID": "bf10c6c8ea7495d80058b0a8043ff422",
  "ref": "hampton-loade-walking-route",
  "title": "Hampton Loade Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Hampton_Loade_Station_-_geograph.org.uk_-_5764.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bf10c6c8ea7495d80058b0a8043ff422.gpx",
  "_geoloc": {
    "lat": 52.4744225882,
    "lng": -2.3765533769
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Hampton_Loade_Station_-_geograph.org.uk_-_5764.jpg",
      "title": "David Stowell / Hampton Loade Station",
      "caption": "Hampton Loade Station. A Severn Valley Railway train hauled by 0-6-0PT 5764 from Bridgnorth rolls into Hampton Loade station en-route for Kidderminster."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Hampton_Loade_Ferry.jpg",
      "title": "David Stowell / Hampton Loade Ferry",
      "caption": "The Hampton Loade Ferry, a ferry that crosses the River Severn at the village. This environmentally sound ferry used the natural flow of the river to move itself across the Severn. It was tethered to a pulley block that runs on a cable suspended across the river, just visible in the upper left of the picture. The ferry is now disused."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Hampton_Loade_geese_-_geograph.org.uk_-_326348.jpg",
      "title": "Roger Dean / Hampton Loade geese",
      "caption": "A gaggle of geese pose for the camera in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/River_Severn_at_Hampton_Loade_-_geograph.org.uk_-_1546724.jpg",
      "title": "Philip Halling / River Severn at Hampton Loade",
      "caption": "River Severn at Hampton Loade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/River_Severn_North_of_Hampton_Loade_-_geograph.org.uk_-_465553.jpg",
      "title": "Trevor Rickard / River Severn North of Hampton Loade",
      "caption": "River Severn North of the village. Quiet stretch of river which is good for bird watching. Chiff-chaffs in large quantities here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Chelmarsh_Reservoir_and_Sailing_Club_-_geograph.org.uk_-_682346.jpg",
      "title": "Row17 / Chelmarsh Reservoir & Sailing Club",
      "caption": "Chelmarsh Reservoir and Sailing Club"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Visitor_Centre_in_Severn_Valley_Country_Park_-_geograph.org.uk_-_235077.jpg",
      "title": "John M / Visitor Centre in Severn Valley Country Park",
      "caption": "Visitor Centre in Severn Valley Country Park. Visitor centre and tea room with views over the River Severn. This is close to a new pedestrian and cycleway crossing of the river and leading towards the Severn Valley Railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Across_the_Severn_Valley%2C_near_Hampton_Loade%2C_Shropshire_-_geograph.org.uk_-_404532.jpg",
      "title": "Roger Kidd / Across the Severn Valley, near Hampton Loade, Shropshire",
      "caption": "Across the Severn Valley. Looking westwards across the cereal crop field, the lane (dead end) leads down past the near rape field to Hampton Loade, and the pedestrian ferry to Hampton and the Severn Valley Railway station. In the middle distance the lane leads to the village of Sutton (3.5km/2.5 miles). The Clee Hills mark the skyline."
    }
  ],
  "distance_km": 14.0,
  "description": "This pretty riverside village is located on the Severn Valley Railway in Shropshire. It's a pleasant place to start a walk with waymarked trails, a historic National Trust Property, a local country park and a scenic reservoir to explore. There's also a noteworthy 17th century inn for well earned rest and refreshment after your exercise. This circular walk starts from the train station and begins by heading south along the Severn Way towards Highley. Here you can cross the river to visit the Severn Valley Country Park where there's nice visitor centre with a tea room. The route then heads west to pick up a section of the Jack Mytton Way which you can follow north to Chelmarsh Reservoir. Follow the pleasant waterside trail north towards Crateford and you can then rejoin the river by crossing the Mor Brook. The riverside trail will then take you south back to Hampton. You could extend the walk by heading east to visit Dudmaston Hall. There's pretty lakes, woodland trails and lovely gardens surrounding this National Trust owned property. The area also includes the adjacent Comer Woods. The tranquil woods have their own car park and entrance and are free to access. There's a number of picturesque pools and lots of woodland birds to see in this area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Unicorn Inn is located in a lovely spot on the banks of the river. It dates back to the 17th century and serves a find Sunday lunch. There's also a decent Caravan and Campsite with plots for tents, caravans, campervans and motorhomes with electrical hookups."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and woodland paths make for a fine dog walk. The Unicorn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north along the river path and you will soon come into Bridgnorth. Heading south will take you to Upper Arley where you can enjoy a waterside walk around Trimpley Reservoir."
    }
  ],
  "video_url": "https://www.youtube.com/embed/zU98HBW6BU8",
  "district": "Highley",
  "county": "Shropshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Vicarage Lane, Highley, Shropshire, England, WV16 6HY, United Kingdom",
  "postcode": "WV16 6HY",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "historic property",
    "country park",
    "reservoir",
    "woodland"
  ],
  "facilities": [
    "visitor center",
    "tea room",
    "car park",
    "pub/cafe",
    "National Trust Property"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}