{
  "created_at": "2025-01-06T03:55:25.611217+00:00",
  "objectID": "bf3ea0255e6bc853b03708e82e87f2ca",
  "ref": "sutton-bank-and-the-kilburn-white-horse-walking-route",
  "title": "Sutton Bank and the Kilburn White Horse Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ee/View_from_Sutton_Bank._-_geograph.org.uk_-_58227.jpg",
  "nearby": [
    {
      "description": "Gormire Lake",
      "objectID": "8cf825b3ca9b1c19ca5029041bfbb144",
      "ref": "gormire-lake-walking-route"
    },
    {
      "description": "Cleveland Way",
      "objectID": "9d56c63c556a167d04b175f1b86b24e0",
      "ref": "cleveland-way-walking-route"
    },
    {
      "description": "Hambleton Hills",
      "objectID": "ca9fb2465435f03106946d42ab42ebba",
      "ref": "hambleton-hills-walking-route"
    },
    {
      "description": "Byland Abbey",
      "objectID": "94d761967c0c3eb23216161af3fcde6d",
      "ref": "byland-abbey-walking-route"
    },
    {
      "description": "Helmsley to Rievaulx Abbey",
      "objectID": "0fa984d0e009084988d4f7562ebc06ea",
      "ref": "helmsley-to-rievaulx-abbey-walking-route"
    },
    {
      "description": "Oulston Reservoir",
      "objectID": "548569ba90e6e3884d981bcb771283af",
      "ref": "oulston-reservoir-walking-route"
    },
    {
      "description": "Felixkirk",
      "objectID": "8ed244bd6b3d666bb69afdc8c84d727b",
      "ref": "felixkirk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bf3ea0255e6bc853b03708e82e87f2ca.gpx",
  "_geoloc": {
    "lat": 54.2240554804,
    "lng": -1.2123285786
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/View_from_Sutton_Bank._-_geograph.org.uk_-_58227.jpg",
      "title": "Johnny Durnan / View from Sutton Bank., via Wikimedia Commons",
      "caption": "View from Sutton Bank. Vet and author James Herriot said the view from the Sutton Bank escarpment over the Vale of York and Mowbray, was the \"finest in England\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/View_indicator_at_Sutton_Bank_-_geograph.org.uk_-_582941.jpg",
      "title": "Stephen McCulloch / View indicator at Sutton Bank, via Wikimedia Commons",
      "caption": "View indicator at Sutton Bank. Looking to Roulston Scar and Hood Hill. Roulston Scar is the site of one of the most important prehistoric monuments in the region - a huge hillfort built in the Iron Age, around 400 BC. It marked the site of the Battle of Old Byland, where on 14 October 1322, the Scots achieved a significant triumph over the English. King Robert the Bruce orchestrated a rapid march with his army, aiming to catch the English forces off guard as they retreated from a failed invasion of Scotland. Meanwhile, John of Brittany, Earl of Richmond, occupied the elevated position of Sutton Bank, while King Edward II and his Queen sought refuge at Rievaulx Abbey, approximately 16 miles (25 km) to the south-east. The Scots valiantly ascended the steep hillside, ultimately overpowering the Earl and capturing him. King Edward hastily fled ahead of Sir Walter Stewart's advancing forces, abandoning the Great Seal of England and substantial treasures at the Abbey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Sutton_Bank_-_geograph.org.uk_-_1147932.jpg",
      "title": "David Rogers / Sutton Bank, via Wikimedia Commons",
      "caption": "Winter Scene at Sutton Bank"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Visitors%27_Centre_at_Sutton_Bank_-_geograph.org.uk_-_1583515.jpg",
      "title": "Philip Barker / Visitors' Centre at Sutton Bank, via Wikimedia Commons",
      "caption": "The Visitor's Centre at Sutton Bank on the North York Moors is a focal point both for tourists to the area and for outdoor enthusiasts - particularly, walkers. The centre lies just to the east of Sutton Brow and is a welcome refreshment stop for walkers who are doing the Cleveland Way long-distance walk. There is a also a cycling centre with cycle hire and trail guides for some of the excellent mountain bike routes in the area. They also have a Cyclo Cross course and a fantastic pump track right opposite the car park making up the start of the green trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Above_Sutton_Bank_-_geograph.org.uk_-_582677.jpg",
      "title": "Graham Horn / Above Sutton Bank, via Wikimedia Commons",
      "caption": "The road up Sutton Bank can be seen to the right. Gormire Lake (in the next square north-west) is to the left. This is taken from the plateau above Sutton Bank on the Cleveland Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Kilburn_White_Horse_-_geograph.org.uk_-_121528.jpg",
      "title": "Gordon Hatton / Kilburn White Horse, via Wikimedia Commons",
      "caption": "The White Horse of Kilburn is a bit of a 'cheat' compared to those in Wessex as it is cut in limestone & sandstone and has to be regularly whitened with paint. The figure is 318 feet (97 m) long by 220 ft (67 m) high and covers about 1.6 acres (6,475 m2) and said to be the largest and most northerly hill figure in England"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Kilburn_white_horse%2C_the_classic_view_-_geograph.org.uk_-_269113.jpg",
      "title": "Howard Morland / Kilburn white horse, the classic view, via Wikimedia Commons",
      "caption": "Kilburn white horse, the classic view. Late summer view of the white horse on its prominent escarpment; taken from near Kilburn village. Power lines removed, as they should be in reality. During World War II the horse was covered over to prevent it from becoming a conspicuous navigation landmark for enemy bombers. This white horse can reputedly be seen from Julian's Bower, Alkborough in North Lincolnshire, over 45 miles (72 km) away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/The_White_Horse_-_Kilburn_-_geograph.org.uk_-_1629719.jpg",
      "title": "Hugh Chappell / The White Horse - Kilburn, via Wikimedia Commons",
      "caption": "The White Horse - Kilburn. Seen from outside the Carlton Inn, Carlton Husthwaite. The cutting of the current Litlington White Horse in East Sussex during 1924, was inspired by the story of the Kilburn horse."
    }
  ],
  "distance_km": 9.0,
  "description": "This challenging circular walk in the North York Moors visits the Kilburn White Horse, the lovely Gormire Lake and the scar at Sutton Bank. It's one of the premium walks in the park and a must see if you are in the area. You start at the car park which sits just under the white horse and pick up the Cleveland Way to take you to the 978 ft (298 m) summit of Sutton Bank. The hill is a high point in the Hambleton Hills and commands splendid views over the North York Moors, the Vale of York and the Vale of Mowbray. At the summit you will find the fascinating Sutton Bank National Park Centre where you can find out how the dramatic landscape was formed in the ice age. From the viewing platform there are views of Roulston Scar, Hood Hill and Lake Gormire. There's a handy view indicator which displays all the landmarks you can see. Also look for gliders setting off from the top of the hill on fine days. From the summit you descend through woodland to Gormire Lake, passing the striking Whitestone Cliff as you go. You continue through the countryside before a final woodland section through the Hoodhill Field Plantation returns you to the car park. The area is also great for mountain biking. The North York Moors National Park Authority has created a green, blue and red trail. These are all waymarked and start from the Sutton Bank National Park Centre where you can hire bikes. Our Hambleton Hills Walk starts from the Kilburn White Horse and is a great way of extending your walking in this lovely area. Just to the south east you can also visit the splendid Byland Abbey. The 12th century abbey includes extensive ruins and wonderful brightly coloured medieval floor tiles.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The visitor centre houses a nice cafe which is ideal for refreshments after your walk. There's also interesting exhibitions and a comprehensive gift shop. Another nice option is to head to nearby Oldstead and pay a visit to the noteworthy Black Swan. This fine restaurant has a Michelin Star and was awarded The Best Restaurant in the UK 2018 by The Food and Travel Magazine and the ‘Best Fine Dining Restaurant in the World’ by TripAdvisor, in 2017. The inn is housed in a fine looking 16th-century building with a nice garden area outside. They also do high quality accommodation if you need to stay over. You can find the inn about half a mile south east of the White Horse in Oldstead with a postcode of YO61 4BL for your sat navs. The Black Swan, with pretty Cherry Blossom in the garden area:"
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking with lots of nice woodland trails to explore. There are also water bowls provided at the visitor centre."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a few miles north east of the site you will find Rievaulx Abbey. The abbey is well worth a visit if you have time after your walk. Here you can explore the ruins of the former Cistercian abbey before continuing to the beautiful Rievaulx Terrace. These 18th-century landscape gardens contain woodland, grass banks, wildflower meadows and two temples. It's another major highight of the area and makes for an easy stroll after the more challenging climb. Head a few miles south and you could pay a visit to the worthy little village of Coxwold on the edge of the Howardian Hills. The village is notable as the location where the author Laurence Sterne wrote the well known novel 'The Life and Opinions of Tristram Shandy'. You can learn about his life and works at the museum at Shandy Hall, where he wrote some of his most famous novels during the 18th century. In the village you can pick up the circular Coxwold Walk which visits Newburgh Priory and Shandy Hall before heading to Byland Abbey. The priory is another historic highlight of the area dating back to 1145. The grounds are a lovely place for a stroll with a water garden, hand crafted topiary, a walled garden, woodland and a large lake.  The circular Felixkirk Walk visits the hill from the nearby village. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/N0k-4ZnyhTQ",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Low Town Bank Road, Kilburn High and Low, Oldstead, North Yorkshire, York and North Yorkshire, England, YO61 4AN, United Kingdom",
  "postcode": "YO61 4AN",
  "district": "Oldstead",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "landscape"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "bike hire",
    "trail"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}