{
  "created_at": "2025-01-06T02:18:36.499750+00:00",
  "objectID": "bff3de58963c34fd59a403be0cdc0a85",
  "ref": "hook-norton-walking-route",
  "title": "Hook Norton Walk - Whichford and Long Compton Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Hook_Norton_village_from_the_brewery_-_geograph.org.uk_-_582293.jpg",
  "nearby": [
    {
      "description": "Rollright Stones",
      "objectID": "dc9ae4e69b8fb00ed666279b46d875a0",
      "ref": "rollright-stones-walking-route"
    },
    {
      "description": "Whichford Wood",
      "objectID": "a4b7b605d68aefeec55a5009227c6369",
      "ref": "whichford-wood-walking-route"
    },
    {
      "description": "Macmillan Way",
      "objectID": "cf3f4a199da30cc9ae551d49d13ec8f4",
      "ref": "macmillan-way-walking-route"
    },
    {
      "description": "Chipping Norton",
      "objectID": "d5f4e92a81e8142052c97b1ec1bfbdef",
      "ref": "chipping-norton-walking-route"
    },
    {
      "description": "Heythrop Park",
      "objectID": "97d8dc6138f52030cd615e48939f88ec",
      "ref": "heythrop-park-walking-route"
    },
    {
      "description": "D'arcy Dalton Way",
      "objectID": "3cb280f57191894698f10bc14defce33",
      "ref": "darcy-dalton-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/b/bff3de58963c34fd59a403be0cdc0a85.gpx",
  "_geoloc": {
    "lat": 51.9963848536,
    "lng": -1.4901747304
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Hook_Norton_village_from_the_brewery_-_geograph.org.uk_-_582293.jpg",
      "title": "S Parish / Hook Norton village from the brewery",
      "caption": "Hook Norton village from the brewery. Looking east toward the church from the top of the Hook Norton brewery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Hook_Norton_Brewery_Visitor_Centre_and_Museum_-_geograph.org.uk_-_1517792.jpg",
      "title": "Steve Daniels / Hook Norton Brewery Visitor Centre and Museum",
      "caption": "Hook Norton Brewery Visitor Centre and Museum. Here you can see a steam-powered Victorian tower brewery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Hook_Norton_-_geograph.org.uk_-_600034.jpg",
      "title": "David Stowell / Hook Norton",
      "caption": "The centre of the village from in front of the Sun pub."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/The_Sun_Inn%2C_Hook_Norton_-_geograph.org.uk_-_1477409.jpg",
      "title": "Sarah Charlesworth / The Sun Inn, Hook Norton",
      "caption": "Sun Inn, Hook Norton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Along_the_top_of_Whichford_Wood_-_geograph.org.uk_-_450335.jpg",
      "title": "Graham Horn / Along the top of Whichford Wood",
      "caption": "Along the top of Whichford Wood. A good bridleway skirts the southern edge of Whichford Wood, providing excellent walking and riding. This is part of the Macmillan Way long distance path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Rollright_Stones_-_geograph.org.uk_-_2477.jpg",
      "title": "mym / Rollright Stones, via Wikimedia Commons",
      "caption": "Rollright Stones, West Oxfordshire, with Anish Kapoor sculpture temporarily installed in the circle in summer 2003."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Church_and_lych_gate%2C_Long_Compton_-_geograph.org.uk_-_213724.jpg",
      "title": "Philip Halling / Lych gate and Long Compton Church",
      "caption": "Church and lych gate, Long Compton. The lych gate at Long Compton is unusual in that it is a small cottage with a room on the first floor above the entrance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Pond_at_Long_Compton_-_geograph.org.uk_-_1556582.jpg",
      "title": "Michael Dibb / Pond at Long Compton",
      "caption": "Pond at Long Compton. The Macmillan Way long distance footpath leaves Long Compton and soon passes this pond."
    }
  ],
  "distance_km": 22.2,
  "description": "This pretty Oxfordshire village is located in a fine position close to the Cotswold Hills. It includes a well known local brewery, a Norman church and some fine old Cotswolds pubs. This circular walk from the village explores the countryside to the west. You'll visit the neighbouring villages of Ascott, Whichford Wood, Long Compton and Great Rollright where you find the interesting Rollright Stones. The walk starts in the village and follows country lanes north and then west to meet up with the Macmillan Way long distance footpath. You then turn south to Ascott before turning west to enter Whichford Wood. The area consists of Broadleaved and conifer woodland with pretty bluebells to see during the spring months. The waymarked trail continues west along the fringe of the woods before turning south into Long Compton. The pretty village includes a fine old church, lych gate and village pond. After leaving the village you head south west before leaving the Macmillan Way to visit the Rollright Stones. Here you'll find a group of Neolithic and Bronze Age megalithic monuments consisting of three groups: the King's Men stone circle, the Whispering Knights burial chamber and the single King Stone. The route then heads east through the village of Great Rollright before returning to Hook Norton. You can extend the walk by heading south east from the village and visiting the remains of the Hook Norton Viaduct.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Hook Norton the Sun Inn is a lovely place to grab some refreshments after your walk. This traditional Cotswold Inn has a cosy log fire, a good menu and a nice garden area if the weather is fine. You can find them on the High Street at postcode OX15 5NH for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country paths and woodland trails make for a nice walk with your dog. The Sun Inn in the village is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The village is well known for the Hook Norton Brewery where the Hooky beer is brewed. Founded in 1849, the brewing plant is a traditional Victorian 'tower' brewery in which all the stages of the brewing process flow logically from floor to floor; mashing at the top, boiling in the middle, fermentation and racking at the bottom. You can enjoy a tour of the brewery and visit the interesting museum which includes a section on the history of the village. Also of note is the 18th century hand-pumped fire engine, which was in use until 1896, and is now preserved in St. Peter's parish church. The village is located just a few miles north east of Chipping Norton where there are some nice trails to try. For example just east of the town there's the historic Heythrop Park to explore. The 18th century hotel is surrounded by some beautiful parkland and gardens with miles of walking and cycling trails to try. The D'arcy Dalton Way passes through the area. This waymarked long distance trail starts off to the north at Wormleighton Reservoir and heads south through the Cotswolds towards Ashbury. It's a good way of further stretching your legs if you have time. For more walking ideas in the area see the Cotswolds Walks and Oxfordshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sIovU3q-9BA",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Scotland End, Hook Norton, Cherwell, Oxfordshire, England, OX15 5NU, United Kingdom",
  "postcode": "OX15 5NU",
  "district": "Cherwell",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "stone circle",
    "burial chamber",
    "monuments"
  ],
  "facilities": [
    "pub/cafe",
    "church",
    "village pond",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}