{
  "objectID": "300220f1ba36af4e71bc7ed44061a75d",
  "created_at": "2024-12-18T16:55:48.977071+00:00",
  "ref": "trer-ceiri-walking-route",
  "title": "Tre'r Ceiri Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Llanaelhaearn%2C_towards_Tre%27r_Ceiri_-_geograph.org.uk_-_55485.jpg",
  "nearby": [
    {
      "description": "Yr Eifl",
      "objectID": "ae4a8617692c7b2e95100c02c1308bcf",
      "ref": "yr-eifl-walking-route"
    },
    {
      "description": "Llyn Coastal Path",
      "objectID": "e84cfd39b2ab38d73deb83894a16fc56",
      "ref": "llyn-coastal-path-walking-route"
    },
    {
      "description": "Porthdinllaen",
      "objectID": "875433b8dd6e5763d130d985d05f8db7",
      "ref": "porthdinllaen-walking-route"
    },
    {
      "description": "Garn Fadryn",
      "objectID": "2ebafa7aa9d04c543479f5cf66878d22",
      "ref": "garn-fadryn-walking-route"
    },
    {
      "description": "Nant Gwrtheyrn",
      "objectID": "51084e97485d8cfe273179d0a936d41c",
      "ref": "nant-gwrtheyrn-walks"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/72979F0EC0BF0B378625857C004C0DE0/$FILE/Trer Ceiri.gpx",
  "_geoloc": {
    "lat": 52.9681600196,
    "lng": -4.4537189818
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Llanaelhaearn%2C_towards_Tre%27r_Ceiri_-_geograph.org.uk_-_55485.jpg",
      "title": "Martin Bodman / Llanaelhaearn: towards Tre’r Ceiri",
      "caption": "Llanaelhaearn: towards Tre'r Ceiri. The fort is probably the best preserved hillfort in Wales and Britain and was occupied during the Roman era. Within its 13 feet high, 15 feet thick walls, 150 huts provided a wild refuge from the pax romana. The Romans had a base at Caernarfon, 15 miles away, but Tre'r Ceir's height and steep approaches and maybe its remoteness meant that it was never slighted by their army. With the departure of the Romans it was abandoned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Llanaelhaearn%2C_main_entrance_to_Tre%27r_Ceiri_-_geograph.org.uk_-_55537.jpg",
      "title": "Martin Bodman / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Main entrance.  This narrow passage through the main rampart was reached via a path uphill from an outer entrance through a second wall; the path running under the rampart. Tre\u0092r Ceiri stands at 485m, one of the highest hillforts in Britain and probably dates from the years immediately preceding the Roman invasion of Wales in AD 78. It appears to have been abandoned after the Romans left Wales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Tre%27r_Ceiri_-_geograph.org.uk_-_7293.jpg/512px-Tre%27r_Ceiri_-_geograph.org.uk_-_7293.jpg",
      "title": "Mari / Tre'r Ceiri",
      "caption": "Taken in the ancient iron age fort on top of the westernmost peak of Yr Eifl, this photo shows the entrance of the fort with the Welsh mountains in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Hut_circles_at_Tre%27r_Ceiri_-_geograph.org.uk_-_709864.jpg",
      "title": "Eric Jones / Hut circles at Tre'r Ceiri",
      "caption": "Hut circles. The remains of some 150 huts are contained within the Tre'r Ceiri Iron Age fort. During its period of occupation between about 150BCE and 400CE the inside of the fort would have been grass covered. The thick heather which now covers the site is a later invader."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Caffi_Meinir%2C_the_former_Capel_Seilo_and_the_ruined_Ty_Hen_-_geograph.org.uk_-_631523.jpg",
      "title": "Eric Jones / Caffi Meinir, the former Capel Seilo and the ruined Ty Hen",
      "caption": "Caffi Meinir, the former Capel Seilo and the ruined Ty Hen The cafe, a modern development, is named after Meinir, an 18thC inhabitant who disappeared on the eve of her wedding and whose skeleton was eventually found. The former Calvinist chapel, Capel Seilo, is now the Welsh language centre. In the 19th century, Mass was also celebrated in the valley as many of the quarrymen were Irish immigrants who arrived here by ship. Ty Hen represents the older pre-industrial phase of farming and fishing. The cafe is a fine place to go for refreshments after your walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Eastwards_over_Tre%27r_Ceiri_ramparts_-_geograph.org.uk_-_1006439.jpg",
      "title": "Gordon Hatton / Eastwards over Tre'r Ceiri ramparts",
      "caption": "Eastwards over Tre'r Ceiri ramparts. The view eastwards from the hillfort summit, with the village of Llanaelhaearn below, miles of rolling countryside beyond and the outline of Moel Hebog [782m] on the horizon."
    }
  ],
  "distance_km": 5.1,
  "description": "This walk climbs to the Iron Age Hillfort of Tre'r Ceiri on the Llyn Peninsula in Wales. It's about a 1.5 mile walk from the conveniently located car park near the village of Llithfaen. In total it's 3 miles there and back with a moderate climb, so a reasonable level of fitness is required. The walk starts from the Yr Eifl car park, just to the west of the hill. From here you can pick up footpaths heading north east up to the hill fort. The fort dates back to the Iron Age and is thought to have been constructed around 200 B.C. It sits at a height of 450 metres (1,480 ft) and is considered one of the finest forts in the UK, with much of the original structure still in place. There are also fabulous views to the surrounding mountains and the coastline with Cardigan Bay clearly visible. The fort sits on the slopes of Yr Eifl so you could continue your walk by heading west from the fort to climb to the adjacent summit.",
  "video_url": "https://www.youtube.com/embed/mAWWwP35YNc",
  "postcode": "LL53 6NU",
  "district": "Llithfaen",
  "county": "Gwynedd - Gwynedd",
  "region": "Wales",
  "country": "Wales"
}