{
  "created_at": "2025-01-06T00:36:06.157228+00:00",
  "objectID": "3024163882ff91e86d7d3c1461986e92",
  "ref": "ochil-hills-walking-route",
  "title": "Ochil Hills Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Play_apparatus%2C_Woodland_Park_-_geograph.org.uk_-_1574820.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3024163882ff91e86d7d3c1461986e92.gpx",
  "_geoloc": {
    "lat": 56.15741,
    "lng": -3.77263
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Play_apparatus%2C_Woodland_Park_-_geograph.org.uk_-_1574820.jpg",
      "title": "Richard Webb / Play apparatus, Woodland Park",
      "caption": "Play apparatus, Woodland Park. View from the car park at the Ochil Hills Woodland Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Wood_Hill_-_geograph.org.uk_-_36384.jpg",
      "title": "Richard Webb / Wood Hill",
      "caption": "Wood Hill. Still has a scattered wood on it. The view over the scarp of the Ochils during a cloud inversion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Wood_Hill_from_Ben_Ever_-_geograph.org.uk_-_1574878.jpg",
      "title": "Richard Webb / Wood Hill from Ben Ever",
      "caption": "Wood Hill from Ben Ever. One of the long gentle ridges which end abruptly on the Ochil scarp."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/View_from_Ben_Ever_across_the_Glen_of_Glenwinnel_Burl_-_geograph.org.uk_-_3983149.jpg/512px-View_from_Ben_Ever_across_the_Glen_of_Glenwinnel_Burl_-_geograph.org.uk_-_3983149.jpg",
      "title": "View from Ben Ever across the Glen of Glenwinnel Burl by Doug Lee, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View from Ben Ever across the Glen of Glenwinnel Burn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/The_Nebit_-_geograph.org.uk_-_1577270.jpg",
      "title": "Richard Webb / The Nebit",
      "caption": "The Nebit. A glance at the map suggests that the Nebit belongs to the ridge that runs down off Craighorn, but it is actually connected to Ben Ever as the Glenwinnel Burn has crossed the ridge through capturing the burn that once flowed down the Silver Glen. The Silver Glen now has a misfit stream with its headwaters cut off."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/The_Nebit_-_geograph.org.uk_-_575017.jpg",
      "title": "Callum Black / The Nebit",
      "caption": "Looking south from the summit of The Nebit, over the Forth valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Alva_Glen_-_geograph.org.uk_-_141497.jpg",
      "title": "Chris Wimbush / Alva Glen",
      "caption": "Alva Glen waterfall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/View_over_Alva_Glen_towards_Wee_Torry_and_Big_Torry_-_geograph.org.uk_-_4388828.jpg",
      "title": "View over Alva Glen towards Wee Torry and Big Torry by Doug Lee, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View over Alva Glen towards Wee Torry and Big Torry"
    }
  ],
  "distance_km": 11.0,
  "description": "This 25 mile range of hills are located just to the north east of Stirling. The scenic rolling hills are a fine place for walkers with many excellent viewpoints, beautiful glens, waterfalls, streams and lakes to enjoy. This circular walk in the hills starts off from the Ochil Hills Woodland Park before taking you up to the viewpoints at Wood Hill, Ben Ever and The Nebit. You'll also visit Silver Glen and the beautiful waterfalls at Alva Glen. You start off from the car park in the Ochil Hills Woodland Park which lies just to the east of the town of Alva. The park was planted as part of the Alva House estate and is believed to be one of the oldest plantations in Scotland. It includes bluebell woods, the old silver mines and wildlife including roe deer, woodpeckers and buzzards. From here you can pick up woodland trails through the park before climbing northeast towards Wood Hill which stands at a height of 525 metres. You then head north east along the ridge between Wood Hill and Ben Ever which is 622 metres high. There are fine views over the Glen of Glenwinnel Burn to the surrounding hills from here. The route then heads south towards The Nebit at 449 metres high, commanding more fine views over the Forth Valley below. You then descend through Silver Glen which takes its name from the silver that was mined there in the early 18th century. Near here you will pass Alva Glen as well. The delightful glen is one of the walking highlights of the area with a pretty stream and waterfalls to admire. From here you follow country lanes through the town before returning to the woodland park. To continue your walking in the hills visit the picturesque reservoirs at Glendevon and the beautiful Dollar Glen .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The No 5 Inn is located at Alva Glen. The inn has some interesting history dating back to 1776. In 1787 it was visited by poet Robert Burns and there is a plaque commemorating the event on the side of the pub. It is thought that it was the 5th pub Burns stoped at on his way from Stirling to the north. Hence the name, No5 Inn.There's a pleasant interior with a historic bar serving good quality whisies and a selection of guest beers from the many micro breweries in the area. There's also a fine restaurant with many Scottish favourites on the menu. You can find them at 38 Brook St, Alva FK12 5JL."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west there's Menstrie Glen and the walk to Lossburn Reservoir. To the east there's Tillicoultry Glen and Mill Glen where you can learn about the interesting industrial past of the area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/epaL7df0m3U?si=O16lkI7iX5n2KeAH",
  "postcode": "FK12 5HU",
  "county": "Clackmannanshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Alva, Clackmannanshire, Alba / Scotland, FK12 5HU, United Kingdom",
  "district": "Alva",
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "viewpoints",
    "glens",
    "waterfalls",
    "lakes"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}