{
  "objectID": "3037a53a48947cbc620d44d7d7386bf0",
  "created_at": "2024-12-20T04:46:22.335207+00:00",
  "ref": "newtown-walking-route",
  "title": "Newtown Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/54/River_Severn_east_of_Newtown_-_geograph.org.uk_-_1091083.jpg",
  "nearby": [
    {
      "description": "Severn Way",
      "objectID": "72be59b71bcbfee43d10b1521911293f",
      "ref": "severn-way-walking-route"
    },
    {
      "description": "Montgomery Canal",
      "objectID": "605c10f32c89ee8678b6f53a681eaca3",
      "ref": "montgomery-canal-walking-and-cycle-route"
    },
    {
      "description": "Welshpool",
      "objectID": "98056822d9077a86a6bd39d9c2c45387",
      "ref": "welshpool-walking-route"
    },
    {
      "description": "Powis Castle",
      "objectID": "cf6a40b6713840a6ecc08558caf0e7ad",
      "ref": "powis-castle-walking-route"
    },
    {
      "description": "Dylife Waterfall Walk",
      "objectID": "7044d510e9c01660b3982b71310fa4e4",
      "ref": "dylife-waterfall-walk"
    },
    {
      "description": "Glaslyn Nature Reserve",
      "objectID": "70aad83cb56ee4bf8f477816cd0a9dab",
      "ref": "glaslyn-nature-reserve-walking-route"
    },
    {
      "description": "Gregynog Hall",
      "objectID": "1711ea464f533796bb5c566d8b94daf6",
      "ref": "gregynog-hall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3037a53a48947cbc620d44d7d7386bf0.gpx",
  "_geoloc": {
    "lat": 52.5160574959,
    "lng": -3.3189052389
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/River_Severn_east_of_Newtown_-_geograph.org.uk_-_1091083.jpg",
      "title": "Penny Mayes / River Severn east of Newtown",
      "caption": "River Severn east of Newtown. Taken from the course of the Montgomery Canal (now filled in and raised as flood defences) beside Cymric Mill, looking down the river towards the Pump House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/River_Severn%2C_Newtown_-_geograph.org.uk_-_1141329.jpg",
      "title": "Penny Mayes / River Severn, Newtown",
      "caption": "River Severn, Newtown Viewed from the northern end of Long Bridge. The tower of the Church of Saint Mary, abandoned for worship in 1856 because it was too small and was frequently subject to flooding, stands on what at this point is the south bank of the river. Beside it are buildings associated with the Elephant and Castle Hotel. The flood defence wall was constructed after serious flooding in the 1960s. It is not unusual for the water to rise well above the footpath on the river side of this wall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Newtown%2C_Wales.jpg/512px-Newtown%2C_Wales.jpg",
      "title": "artq55 / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Newtown town centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Canada_geese_at_Pwll_Penarth_-_geograph.org.uk_-_575105.jpg",
      "title": "Penny Mayes / Canada geese at Pwll Penarth",
      "caption": "Canada geese at Pwll Penarth. Pwll Penarth has been developed as a wetlands nature reserve over the last ten years. Disused settling ponds at the nearby sewage works have been remodelled and furnished with a couple of bird hides, one of which can be seen on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Long_Bridge%2C_Newtown_-_geograph.org.uk_-_1020092.jpg",
      "title": "Penny Mayes / Long Bridge, Newtown",
      "caption": "Long Bridge, Newtown. Designed by the County Surveyor Thomas Penson in 1826 to replace a wooden bridge. Penson built a lot of bridges across the Severn in his time as County Surveyor and tended to make them rather narrow. This one was no exception and the iron \"outriggers\" that carry the pavement on both sides were added by Penson in 1857 to replace the original parapets and make the bridge wide enough for traffic to pass in both directions on the bridge itself. River levels were particularly high the day this photo was taken and much of the riverside path was under water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Keep_and_gatehouse_-_Dolforwyn_Castle_-_geograph.org.uk_-_1320364.jpg",
      "title": "John M / Keep and gatehouse - Dolforwyn Castle",
      "caption": "Keep and gatehouse - Dolforwyn Castle. The  castle was built by Llewelwyn ap Gruffudd, Prince of Gwynedd, between 1273 and 1277 as a rival to King Edward's castle across the River Severn in Montgomery. The castle fell to Edward in his first Welsh campaign in 1277 and passed to the Mortimers. The castle fell out of use in the 15th Century. A new settlement 'Newtown' was developed replacing the old town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Dolforwyn_Castle_at_sunrise_-_geograph.org.uk_-_308177.jpg",
      "title": "ceridwen / Dolforwyn Castle at sunrise",
      "caption": "Dolforwyn Castle at sunrise. Much of the castle has been excavated and preserved over recent years but there is a settlement to the west which still lies untouched."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Pump_House_-_geograph.org.uk_-_1243089.jpg",
      "title": "Henry Spooner / Pump House",
      "caption": "Pump House. A view of the Pump House taken from the Canal Road. The Pump House (now a private residence) stands between the course of the Montgomery Canal (on the left, filled in at this point) and the river. Presumably it served to maintain water levels in the canal, which terminated a short distance west of here."
    }
  ],
  "distance_km": 13.2,
  "description": "Newtown is located in Powys near to the Wales-England border. It has an attractive town centre which includes a museum to the textile manufacturer and social reformer Robert Owen who was born in the town. There's some nice walks along the River Severn and the Montgomery Canal which runs through the area. This walk from the town takes you along the River Severn and  the canal to two of the highlights of the area at the Pwll Penarth Nature Reserve and the historic Dolforwyn Castle. The walk starts in the town centre by the river. Here you can pick up the Severn Way and follow the waymarked footpath east along the river and through the town. You cross the river on a footbridge before continuing east through the little village of Llanllwchaiarn on the outskirts of Newtown. The path then continues to the Pwll Penarth Nature Reserve which is a good place to look out for birdlife such as Kingfisher and Little Grebe. There's nice trails here along the Montgomery Canal and some woodland footpaths. After exploring the reserve the route continues past Aberbechan, following the canal and river to Newhouse. Here you leave the canal and head north to Castle Wood and Dolforwyn Castle. Here you can explore the ruins of this 13th century castle and find out about its interesting place in Welsh history. From the castle's elevated position there are fine views over the surrounding countryside. After exploring the castle ruins the route returns to the town on the same paths.",
  "video_url": "https://www.youtube.com/embed/hBR8ySe07fM",
  "district": "Y Drenewydd / Newtown",
  "county": "Powys - Powys",
  "region": "Wales",
  "country": "Wales"
}