{
  "created_at": "2025-01-06T08:53:46.676933+00:00",
  "objectID": "304350b79fb90da37b07bf8a91f5a46b",
  "ref": "grimwith-reservoir-walking-route",
  "title": "Grimwith Reservoir Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Grimwith_Reservoir_-_geograph.org.uk_-_21421.jpg",
  "nearby": [
    {
      "description": "Troller's Gill",
      "objectID": "aa105c0287b49e8ddb1b88c19738a81f",
      "ref": "trollers-gill-walking-route"
    },
    {
      "description": "Linton Falls",
      "objectID": "11a08617617af634fd7557116e1bd62c",
      "ref": "linton-falls-walking-route"
    },
    {
      "description": "Grassington",
      "objectID": "9b0ebc708d7f6edf19dcccfd0a0f336d",
      "ref": "grassington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/304350b79fb90da37b07bf8a91f5a46b.gpx",
  "_geoloc": {
    "lat": 54.0717893674,
    "lng": -1.9057942046
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Grimwith_Reservoir_-_geograph.org.uk_-_21421.jpg",
      "title": "Mick Melvin / Grimwith Reservoir",
      "caption": "The ling thatched building at Rough Hill on Grimwith reservoir Grassington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Grimwith_Reservoir._-_geograph.org.uk_-_98513.jpg",
      "title": "Steve Partridge / Grimwith Reservoir.",
      "caption": "Beautiful view over the water. Photo taken looking SE from the path above Knotts Well"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Ruin_at_Grimwith_Reservoir_-_geograph.org.uk_-_21450.jpg",
      "title": "Mick Melvin / Ruin at Grimwith Reservoir",
      "caption": "The ruined farm house on the North bank of Grimwith Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Grimwith_Reservoir_-_geograph.org.uk_-_21422.jpg",
      "title": "Mick Melvin / Grimwith Reservoir",
      "caption": "Walkers by the water. The start of a circular walk on a very cold April morning in 2004"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Parking_and_Picnic_Area_beside_Grimwith_Reservoir_-_geograph.org.uk_-_662026.jpg",
      "title": "Roger Nunn / Parking & Picnic Area beside Grimwith Reservoir",
      "caption": "Parking and Picnic Area beside Grimwith Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Track_Around_Grimwith_Reservoir_-_geograph.org.uk_-_943595.jpg",
      "title": "Mick Garratt / Track Around Grimwith Reservoir",
      "caption": "The circular footpath around Reservoir takes in this track here at Grimwith Beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Picnic_area_at_Grimwith_-_geograph.org.uk_-_1748447.jpg/512px-Picnic_area_at_Grimwith_-_geograph.org.uk_-_1748447.jpg",
      "title": "Gordon Hatton / Picnic area at Grimwith",
      "caption": "Picnic area at Grimwith. A nice place to enjoy lunch with a view. A lot has been done in recent years to make the site attractive to visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Track_Over_Grimwith_Fell_-_geograph.org.uk_-_943583.jpg",
      "title": "Mick Garratt / Track Over Grimwith Fell",
      "caption": "The circular footpath around the reservoir can be seen branching off to the left."
    }
  ],
  "distance_km": 6.5,
  "description": "Enjoy a circular walk around this lovely reservoir in the Yorkshire Dales. There is a good footpath running around the reservoir with fabulous views of the surrounding countryside. The reservoir is great for bird watching, look out for wildfowl including wigeon, teal, greylag geese and Canada geese on the water. Other winged visitors to the area include ringed plover, northern lapwing, common redshank, curlew, reed bunting, lesser redpoll, whinchat and sedge warbler. The walk starts at the car park at the southern end of the reservoir and heads to Grimwith Moor, crossing Grimwith Beck on the way. You continue to Bracken Haw, cross the pretty Blea Gill and then pass Hebden Moor. The final section passes Hartlington pasture before returning to the car park. If you'd like to continue your walking in the area then you could head to the nearby Linton Falls. Just to the south is the wonderful limestone gorge at Troller's Gill. The reservoir is located close to Grassington and could be reached by following the Dales Way and other footpaths from the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head a mile or so south west of the site and you will come to the little village of Hebden. Here you'll find the delightful Old School Tea Room. It's an idyllic spot with the tea room housed in the wonderful old school which dates from 1874. The charming building includes the old school clock which was restored in the millennium and continues to chime every hour. From inside, there is a picturesque view down to the beck and across the fields and there is also a large garden area for warmer days. In the outdoor section there's the additional attraction of a variety of farm animals including pygmy goats, hens and guinea pigs. Free parking is available in the adjacent car park. You can find the tea rooms in on the Main Street in Hebden with a postcode of BD23 5DX for your sat navs.  Pictured above left the Old School in Hebden where you can enjoy delicious home made dishes and tasty cakes using locally sourced ingredients. On the right is the Gold Post Box at Hebden Post Office. To mark Andrew Triggs Hodge's gold medal winning performance, Royal Mail has painted a post box at Hebden Post Office, Yorkshire, gold."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir and surrounding moors are a fine place for a dog walk. You will probably see plenty of other owners when the weather is good. It's best to keep them on leads as there is a lot of wildfowl on the water for most of the year. The Old School Tea Room mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of Grassington you'll find the worthy village of Threshfield. The pretty settlement includes an historic 16th century inn and the nearby Threshfield Quarry. The quarry is an unusual and atmospheric place for a walk with its limestone rocky cliffs and distinctive turquoise lakes."
    }
  ],
  "video_url": "https://www.youtube.com/embed/x6yoRfB8Dqs",
  "postcode": "BD23 5ED",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grimwith Road, Appletreewick, North Yorkshire, York and North Yorkshire, England, BD23 5ED, United Kingdom",
  "district": "Appletreewick",
  "state": "England"
}