{
  "created_at": "2025-01-05T23:46:31.794135+00:00",
  "objectID": "30d902bd61ced5b2e0d0317dbbef3505",
  "ref": "biggin-hill-walking-route",
  "title": "Biggin Hill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Biggin_Hill_-_geograph.org.uk_-_224124.jpg",
  "nearby": [
    {
      "description": "High Elms Country Park",
      "objectID": "b5992b581143298cc03c11f531d72186",
      "ref": "high-elms-country-park-walking-and-cycle-route"
    },
    {
      "description": "Cudham Circular Walk",
      "objectID": "0a44b03337b26010afba46f437ed0f60",
      "ref": "cudham-circular-walk-walking-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Berrys Green Circular",
      "objectID": "c412eba2d4167e8573e63ce40b283e3e",
      "ref": "berrys-green-circular-walking-route"
    },
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Betsoms Hill",
      "objectID": "399b7dbdb563ee8faaa837686248e189",
      "ref": "betsoms-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/30d902bd61ced5b2e0d0317dbbef3505.gpx",
  "_geoloc": {
    "lat": 51.315072972,
    "lng": 0.0393082125
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Biggin_Hill_-_geograph.org.uk_-_224124.jpg",
      "title": "Rose Atkinson / Biggin Hill",
      "caption": "Biggin Hill. The town as seen from the edge of Jewels Wood. Norheads Lane runs through this picture from the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Downe%2C_Down_House_-_geograph.org.uk_-_1398921.jpg",
      "title": "Mike Faherty / Downe, Down House",
      "caption": "Down House Residence of Charles Darwin from 1842-82"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Single_Street%2C_Berry%27s_Green_TN16_-_geograph.org.uk_-_68687.jpg",
      "title": "Philip Talmage / Single Street, Berry's Green TN16",
      "caption": "Single Street, Berry's Green TN16"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/High_Street%2C_Downe_BR6_-_geograph.org.uk_-_68668.jpg/512px-High_Street%2C_Downe_BR6_-_geograph.org.uk_-_68668.jpg",
      "title": "Philip Talmage / High Street, Downe BR6",
      "caption": "View of the High Street in High Street in Downe village. Looking north from the tree which still stands in the middle of the road junction. The High Street leads north towards Bromley. To the left is Luxted road, leading towards Biggin Hill. And to the right is Cudham Road, leading towards Cudham. The Queen's Head is one of two pubs in Downe (the other being the George and Dragon) and the parish church is just off to the right of the picture"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Kentish_Orchard_in_High_Elms_Country_Park_-_geograph.org.uk_-_994679.jpg",
      "title": "David Anstiss / Kentish Orchard in High Elms Country Park",
      "caption": "High Elms Country Park. The park covers 250 acres of countryside combined with a 150 acre golf course that together form the High Elms estate, originally the country home of the Lubbock family. In the 1840's Sir John Lubbock II developed the new house and grounds in a classical Italian style with tree's collected from around the world. His son Lord Avebury was one of the foremost public figures of his day and was responsible for the Open Spaces act (1896) which enabled his former estate to be transferred to Bromley Council in 1965, as a Green Belt open space. Unfortunately the house was destroyed by fire, but some of the formal gardens survived and are still maintained. This is a model orchard in the old walled gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Biggin_Hill_War_Memorial%2C_TN16_-_geograph.org.uk_-_68641.jpg/256px-Biggin_Hill_War_Memorial%2C_TN16_-_geograph.org.uk_-_68641.jpg",
      "title": "Philip Talmage / Biggin Hill War Memorial, TN16",
      "caption": "Biggin Hill War Memorial, TN16"
    }
  ],
  "distance_km": 14.5,
  "description": "This circular walk from Biggin Hill explores the farmland and woodland to the north of the town. On the way you'll visit the villages of Downe and Cudham, while also exploring the lovely High Elms Country Park. The route also passes the noteworthy Down House, former residence of Charles Darwin. The town is notable as one of the highest points of Greater London, rising to over 210 metres (690 ft) above sea level. It's home to London Biggin Hill Airport and located close to the North Downs which you can explore on the North Downs Way. This route starts from the public car park at the northern end of the town. From here you can pick up footpaths heading north to Ladies Wood, Snotsdale Wood and Leasons Wood next to the West Kent Golf Club. The route continues to the pretty village of Downe which has strong associations with Charles Darwin. From Downe you head north to pick up a section of the London Loop and follow the waymarked trail east into High Elms Country Park. The popular park includes 250 acres of countryside, woodlands, a nature centre, an ice well, formal gardens and wildflower meadows. After exploring the park you head south through Cuckoo Wood before following other trails to Cudham. From Cudham you head west through Single Street before turning south west through Berry's Green. The final section takes you through Aperfield to return to Biggn Hill and the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Black Horse is located near the start of the walk in Biggin Hill. The pub does good food and has a nice large garden area to sit out in. You can find it at postcode TN16 3DX. In Downe you could make a pit stop at the Queen's Head. This 16th century pub was wwarded Pub of the Year 2014, by the Bromley section of CAMRA, and has been included in the good beer guides for 9 years. There's a cosy interior with several log fires, while outside there's a large walled patio / garden area for finer days. The pub includes the Darwin bar where the man himself used to drink. You can find the pub on the High Street with postcode BR6 7US for your sat navs. The Blacksmith Arms in Cudham is another historic pub of some note. The old inn was built during the reign of Charles I (1625 – 1649) in the year 1628. The property at this time is described as a farm dwelling with stables. These days it's a fine country pub with a good menu and selection of ales. There's also a lovely garden area where you can enjoy your refreshment outside on warmer days. You can find the pub on Cudham Lane at a postcode of TN14 7QB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and countryside trails around the town are ideal for dog walking. The Queen's Head and Blacksmith Arms pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The town forms part of the south-eastern London borough of Bromley where you can also try the circular Bromley Walk and visit the nearby Keston Common and Hayes Common, where there are some nice trails to try. You can also pick up the London Loop in the area and visit Orpington. The Berrys Green Circular is another good option for exploring the area on waymarked footpaths. To the south is Betsoms Hill, the highest point in the county of Kent. This area also includes Westerham Heights, the highest point of Greater London. For more walking ideas in the area see the London Walks or North Downs Walks pages."
    }
  ],
  "postcode": "TN16 3SN",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Magnolia Drive, Aperfield, London Borough of Bromley, London, Greater London, England, TN16 3SN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pasture"
  ],
  "points_of_interest": [
    "historical sites",
    "nature centre",
    "wildflower meadows"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}