{
  "created_at": "2025-01-06T04:15:11.811999+00:00",
  "objectID": "30dbdb2eea6c25dda6b190fa569d79f5",
  "ref": "petersfield-lake-and-heath-walking-route",
  "title": "Petersfield Lake and Heath Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Petersfield_Lake_-_geograph.org.uk_-_238.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/30dbdb2eea6c25dda6b190fa569d79f5.gpx",
  "_geoloc": {
    "lat": 50.9983027516,
    "lng": -0.9268197862
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Petersfield_Lake_-_geograph.org.uk_-_238.jpg",
      "title": "Martyn Pattison [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Petersfield Lake. The lake was created by farmers from marsh land around the end of the 18th C. The 22 acre lake is now a major recreational facility for the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Heath_Pond%2C_Petersfield_-_geograph.org.uk_-_317846.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Heath Pond, Petersfield. A view from the boardwalk across the lake. This photograph was taken on a sunny day in January 2007."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Bronze_age_burial_mounds_on_Petersfield_Heath_-_geograph.org.uk_-_240.jpg",
      "title": "Martyn Pattison [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bronze age burial mounds on Petersfield Heath. Evidence of human occupation dating back to 5000 years BC has been found on Petersfield Heath, there are still 21 Bronze age burial mounds on the heath, which is nowadays a recreational public space."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/The_Heath%2C_Petersfield_-_geograph.org.uk_-_694677.jpg",
      "title": "Basher Eyre [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Heath, Petersfield. Just a small part of the lake is in this grid square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/The_Square%2C_Petersfield_-_geograph.org.uk_-_3854031.jpg/512px-The_Square%2C_Petersfield_-_geograph.org.uk_-_3854031.jpg",
      "title": "The Square, Petersfield by David960, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A view of the square in the town centre. The town was founded during the 12th century by William Fitz Robert, 2nd Earl of Gloucester. The market square pictured here includes an 18th-century statue of King William III. The king is mounted and the statue is on an engraved plinth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Path_within_Petersfield_Physic_Garden_-_geograph.org.uk_-_834952.jpg",
      "title": "Basher Eyre / Path within Petersfield Physic Garden",
      "caption": "Path within Petersfield Physic Garden. In the High Street is the physic garden, which is a recreation of a 17th-century herb garden. It is open to the public nearly every day of the year and a pleasant place for an easy stroll in the town centre. Next to the Red Lion public house is the small Charles Dickens garden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Petersfield_Parish_Church_-_geograph.org.uk_-_2711678.jpg/512px-Petersfield_Parish_Church_-_geograph.org.uk_-_2711678.jpg",
      "title": "Petersfield Parish Church by Colin Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Petersfield Parish Church. The ancient Norman church is a Grade I listed building and is located in the centre of the town, on the south side of the Square. The architect Nikolaus Pevsner described it as \"one of the most interesting churches in Hampshire\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Sheep_Street%2C_Petersfield_-_geograph.org.uk_-_2048867.jpg",
      "title": "Sheep Street, Petersfield by Maigheach-gheal, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Old buildings on Sheep Street"
    }
  ],
  "distance_km": 1.2,
  "description": "Enjoy a gentle stroll around Petersfield Lake and heath on this easy walk in Hampshire. The heath has a free car park off the B2146 less than a mile from the town centre. From here you can pick up a nice trail around the 22 acre pond where you will see many ducks and swans. There's also footpaths branching off across the heath with areas of grassland and bronze age burial mounds to look out for. The park has good facilities with a play area, cafe and boat hire. The long distance Serpent Trail starts on the heath so it's a great option if you would like to extend your walk. You can follow the trail east and enjoy views of the River Rother at Durleighmarsh. The Hangers Way also passes close to the heath. It heads north through the town to Shoulder of Mutton Hill, Noar Hill and the pretty Selborne Common. Heading south will take you through Buriton to the splendid Queen Elizabeth Country Park where you climb Butser Hill for wonderful views over the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk you can stop for refreshments at The Old Drum on Chapel St at postcode GU32 3DP. The contemporary country pub is located in the centre of Petersfield and has a lovely beer garden. Built in the 18th Century, it is the oldest in the area and has been beautifully restored to keep its character and charm."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The heath is a fine place for a dog walk so you'll probably bump into plenty of other owners with their pets on a fine day. The Old Drum pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a couple of miles south west of the town you'll find the charming village of Buriton. In this quintessential English village there's a particularly lovely village pond, picturesque cottages, a classic village pub and a fine old church to see. It's well worth a visit and is located within easy walking distance of both Queen Elizabeth Country Park and Butser Hill. Just to the south of the village you can also pick up the Clanfield Walk and visit Butser Ancient Farm and Windmill Hill. The farm is one of the area highlights and includes an archaeological open-air museum with reconstructions of Neolithic dwellings, Iron Age roundhouses, a Romano-British villa and an early Saxon house. Head south and you could visit a splendid viewpoint at Harting Down. There's also the nearby village of South Harting where you could pay a visit to the National Trust's Uppark. Here you'll find a fine 17th century Georgian House surrounded by lovely gardens with views of the English Channel. The author H.G Wells stayed in the house during the late 19th century. The class divisions he observed here inspired his socialist views which later manifested themselves in work such as 'The Time Machine'. You can find the house at postcode GU31 5QR. For more walking ideas around Petersfield see the Hampshire Walks and the South Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/R62jl9PwvGk",
  "district": "East Hampshire",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sussex Road, Heath Common, Petersfield, East Hampshire, Hampshire, England, GU31 4HS, United Kingdom",
  "postcode": "GU31 4HS",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "heathland",
    "grassland"
  ],
  "points_of_interest": [
    "burial mounds",
    "river views",
    "hilltop"
  ],
  "facilities": [
    "car park",
    "play area",
    "cafe",
    "boat hire"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}