{
  "created_at": "2025-01-06T02:07:47.723704+00:00",
  "objectID": "31dbc014e341c34576674a452f27b82c",
  "ref": "ashby-canal-walking-route",
  "title": "Ashby Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/98/Ashby_Canal_at_Ashby_Woulds%2C_Leicestershire.jpg",
  "nearby": [
    {
      "description": "Centenary Way",
      "objectID": "4ba08ffda11743187daf22788b2f34c9",
      "ref": "centenary-way-walking-route"
    },
    {
      "description": "Coventry Canal",
      "objectID": "c8f3fefe14d76428c762cb3872e28420",
      "ref": "coventry-canal-walking-and-cycle-route"
    },
    {
      "description": "Ivanhoe Way",
      "objectID": "e5202a1e3a5f02165431a68916504c74",
      "ref": "ivanhoe-way-walking-route"
    },
    {
      "description": "Leicestershire Round",
      "objectID": "03b619aca78d74705228ce8c8598b890",
      "ref": "leicestershire-round-walking-route"
    },
    {
      "description": "Bosworth Battlefield Country Park",
      "objectID": "f1238e42ef0684934d9d2fc5a15c7f1e",
      "ref": "bosworth-battlefield-country-park-walking-route"
    },
    {
      "description": "Ashby Woulds Heritage Trail",
      "objectID": "7500056df582bbc9b8cdbdbc0afcd195",
      "ref": "ashby-woulds-heritage-trail-walking-and-cycle-route"
    },
    {
      "description": "Hinckley",
      "objectID": "fc42553278d5e20a9a9fb7994fbc2f18",
      "ref": "hinckley-walking-route"
    },
    {
      "description": "Moira Furnace",
      "objectID": "220bddd97302e7779044aacde196eec4",
      "ref": "moira-furnace-walking-route"
    },
    {
      "description": "Sutton Cheney",
      "objectID": "22034c7a725200c0f570ae56160c2d76",
      "ref": "sutton-cheney-walking-route"
    },
    {
      "description": "Shackerstone",
      "objectID": "8d9fce8791eb88237c17e171c3df173d",
      "ref": "shackerstone-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/31dbc014e341c34576674a452f27b82c.gpx",
  "_geoloc": {
    "lat": 52.4903726185,
    "lng": -1.4590843106
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Ashby_Canal_at_Ashby_Woulds%2C_Leicestershire.jpg",
      "title": "cris sloan [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Canal at Ashby Woulds"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Ashby_Canal%2C_Shackerstone_-_geograph.org.uk_-_413869.jpg",
      "title": "Andrea Lowry [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Shackerstone"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Ashby_Canal_in_Hinckley_-_geograph.org.uk_-_659641.jpg",
      "title": "Mat Fascione [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Barges at Hinckley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Ashby_Canal_from_Limekiln_Bridge_-_geograph.org.uk_-_659630.jpg",
      "title": "Mat Fascione [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Limekiln Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Marston_Junction_-_geograph.org.uk_-_227082.jpg",
      "title": "David Stowell / Marston Junction",
      "caption": "Marston Junction where the Ashby Canal meets with the Coventry Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Ashby_Canal_-_geograph.org.uk_-_132739.jpg",
      "title": "Tammy Winand / Ashby Canal",
      "caption": "Bridge No. 41, heading toward Bosworth Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/The_Lime_Kilns%2C_nr._Hinckley_-_geograph.org.uk_-_162092.jpg",
      "title": "Stephen McKay / The Lime Kilns, nr. Hinckley",
      "caption": "The Lime Kilns, near Hinckley. This canalside pub stands at the point where the Ashby de la Zouch Canal is crossed by the A5. It's a nice place for a pit stop on the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Ashby_Canal%2C_Moira_-_geograph.org.uk_-_4034790.jpg/512px-Ashby_Canal%2C_Moira_-_geograph.org.uk_-_4034790.jpg",
      "title": "Ashby Canal, Moira by Alan Murray-Rust, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Canal view at Moira in the summer time."
    }
  ],
  "distance_km": 35.0,
  "description": "Follow the Ashby-de-la-Zouch Canal from Bedworth in Warwickshire, to the little village of Snareston in Leicestershire. The towpath runs for just over 20 miles with pretty hedgerows, reeds, countryside views and lots of wildlife to look out for on the way. The route starts just to the north east of Bedworth town centre at Marston Junction. If you are coming from the town centre or train station just follow the Coventry Canal north and then head east at Marston Junction. The canal is located very close to Nuneaton as well. You could follow the Centenary Way from the southern edge of the town to the start of the route. The towpath first heads east towards Burton Hastings before skirting the western edge of the market town of Hinckley. You continue north towards Stoke Golding and Ambion Hill. The hill was long considered to be the site of the Battle of Bosworth Field and is where the Bosworth Battlefield Heritage Centre is situated. It is now accepted that the core of the battlefield lies either side of Fenn Lanes, about two miles south-west of the visitor centre and that Ambion Hill was Richard III's camp on the night before the battle. You continue north past Shenton, the terminus of the Battlefield Line Heritage Railway which runs steam and diesel-hauled trains every weekend and Bank Holiday from March to December. The canal then skirts the western edge of Market Bosworth, passing Bosworth Water Park before coming to Shackerstone at the other end of the Battlefield Line Railway. The final section runs north west from Shakerstone to Snarestone, passing some attractive woodland on the way. Around Market Bosworth you can pick up the Ivanhoe Way and Leicestershire Round long distance trails in order to further explore the area. You can pick up the Ivanhoe Way at Snarestone and follow it north to Measham where the Ashby Woulds Heritage Trail starts. You could also take a small detour at Market Bosworth and visit the splendid Bosworth Battlefield Country Park. Here you can visit the Bosworth Battlefield Heritage Centre which tells the dramatic story of the Battle of Bosworth of 1485.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Hinckley there's a fine canalside pub in the shape of The Lime Kilns. Here you can sit outside in the garden area and watch the boats go by with your meal. They have a fine selection of home made pies and real ales to enjoy. It also has an interesting history dating back to the 18th century when it was a coaching inn. You can find them on Watling Street with a postcode of LE10 3ED for your sat navs. Near Market Bosworth you'll pass the pictiresque Sutton Cheney Wharf where you'll find the Sutton Wharf cafe. They serve tasty lunches and delicious cakes which you can enjoy in the outdoor seating area next to the water. The Victorian tea room at the old Shackerstone Railway station is a good place for some refreshments and local history. The authentic setting is a lovely way to step back in time while enjoying a fine range of cobs, pasties and delicious cakes. It's very quaint and includes a nostalgic railway museum. You can find them at postcode CV13 6NW for your sat navs. In the canalside village there's also the Rising Sun. The pub is located near the canal and the station at postcode CV13 6NN. They have a family-friendly conservatory and an attractive garden for warmer days. There's also a car park and restaurant dining area. The pub is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue a few miles north from Snareston you could visit a hidden gem on the canal at Moira Furnace. There's a fine country park here with woodland and parkland trails surrounding the early 19th century iron furnace. There's also a museum featuring lime kilns and craft workshops. Here you can learn all about Moira's significant part in the industrial revolution. The Nuneaton Circular Walk uses part of the canal as it makes its way around the nearby town. You can follow this waymarked trail to visit the historic Arbury Hall and the Coventry Canal. The woods, ponds and mountain bike trails of Hicks Lodge are also located just east of the site. Just to the south east you'll find more woodland trails and a series of pretty lakes at Queen Elizabeth Diamond Jubilee Wood and Sence Valley Forest Park on the outskirts of Coalville. For more walking ideas in the area see the Leicestershire Walks and Warwickshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ax3_ce5xP2Y",
  "postcode": "CV12 9AL",
  "district": "Bedworth",
  "county": "Warwickshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}