{
  "objectID": "324f11d2c329890d5e484884880ffca5",
  "created_at": "2024-12-18T05:33:10.419249+00:00",
  "ref": "matley-wood-walking-route",
  "title": "Matley Wood Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Matley_Heath_from_Matley_Ridge%2C_New_Forest_-_geograph.org.uk_-_116397.jpg",
  "nearby": [
    {
      "description": "Denny Wood",
      "objectID": "43b7b893f9c8a196d1fd908de5172d6d",
      "ref": "denny-wood-walking-route"
    },
    {
      "description": "Lyndhurst",
      "objectID": "6004e8b0ac8ca159efad3e2fed7d73fe",
      "ref": "lyndhurst-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/88E80750E701E6FB8625862B0036C5E8/$FILE/Matley Wood.gpx",
  "_geoloc": {
    "lat": 50.8637041262,
    "lng": -1.5277026713
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Matley_Heath_from_Matley_Ridge%2C_New_Forest_-_geograph.org.uk_-_116397.jpg",
      "title": "Jim Champion / Matley Heath from Matley Ridge, New Forest",
      "caption": "Matley Heath from Matley Ridge. A sunny winter view north from Matley Ridge, looking across the heath. The heather is a crunchy brown colour, and gorse bushes provide the occasional fleck of green. A clump of Scots pine provide relief on the left and in the distance, on the far side of Longwater Lawn, are the bare deciduous trees of Mallard Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Damp_heath_between_Matley_Wood_and_Matley_Bog%2C_New_Forest_-_geograph.org.uk_-_189021.jpg",
      "title": "Jim Champion / Damp heath between Matley Wood and Matley Bog, New Forest",
      "caption": "Damp heath between Matley Wood and Matley Bog. On the left the edge of Matley Wood with the usual silver birch fringe. In the middle distance ponies are grazing on the wet heath and in the foreground heath spotted orchids have sprung up next to the gorse bushes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Ponies_grazing_in_Matley_Wood%2C_New_Forest_-_geograph.org.uk_-_285803.jpg",
      "title": "Jim Champion / Ponies grazing in Matley Wood, New Forest",
      "caption": "Ponies grazing. As dusk falls the ponies keep on grazing the undergrowth in Matley Wood - they do not have the digestive efficiency of cattle and spend the vast majority of their waking hours eating. The flash from the camera shows the effectiveness of their reflective collars, a low-tech method of making the animals more visible to motorists driving through the Forest at night."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Matley_Heath%2C_northwest_of_Matley_Wood%2C_New_Forest_-_geograph.org.uk_-_285762.jpg",
      "title": "Jim Champion / Matley Heath, northwest of Matley Wood, New Forest",
      "caption": "Matley Heath, northwest of Matley Wood. In autumn the heath to the northwest of the wood is an expanse of dying heather, interrupted by linear carrs of alder trees. The bulge towards the right is a short spur from the main carr that runs from left to right, eventually draining into the Beaulieu River north of here. Recent heavy rain has saturated the soil of this heathland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Pussy_willow_trees_at_Matley_Passage%2C_New_Forest_-_geograph.org.uk_-_369885.jpg",
      "title": "Jim Champion / Pussy willow trees at Matley Passage, New Forest",
      "caption": "Pussy willow trees at Matley Passage. These pussy willow (salix caprea) trees are just north of the footbridge at Matley Passage, alongside the old road. These willows are close to the water, as they like it. I think the bright yellow catkins mean that these trees are male."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Twisted_oak_in_Matley_Wood%2C_New_Forest_-_geograph.org.uk_-_116390.jpg/256px-Twisted_oak_in_Matley_Wood%2C_New_Forest_-_geograph.org.uk_-_116390.jpg",
      "title": "Jim Champion / Twisted oak in Matley Wood, New Forest",
      "caption": "Twisted Oak in the wood. This area of old woodland contains a greater range of trees than usual in the forest, probably due to the Victorian fad for ornamental trees. This oak is typical of the older trees in the wood, not far east of the \"Matley Wood\" Forestry Commission car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Silver_birch_on_Matley_Heath%2C_New_Forest_-_geograph.org.uk_-_116392.jpg",
      "title": "Jim Champion / Silver birch on Matley Heath, New Forest",
      "caption": "Silver birch on Matley Heath. East of Matley Wood the heath gently slopes down towards the Beaulieu River and Fulliford Bog. The silver birch on the left of the photo is a good example of a speciment that has grown without competition with any neighbours. The wood is fringed with silver birch, which grow much thinner and taller as they compete for the available light."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Heathland_south_of_Matley_Bog%2C_New_Forest_-_geograph.org.uk_-_369912.jpg",
      "title": "Jim Champion / Heathland south of Matley Bog, New Forest",
      "caption": "Heathland south of Matley Bog. The alder trees in the distance, on the left, follow the course of Matley Bog. The small pool in the foreground is typical of many that dot this heathland during the wetter seasons. A small conifer has sprung up on the far side of the pool."
    }
  ],
  "distance_km": 3.5,
  "description": "This walk visits Matley Wood and Heath near Lyndhurst in the New Forest. The area is a lovely place for a walk with ponies, heather, wildflowers and views of the River Beaulieu to enjoy. You can start your walk from the car park next to the campsite. It's located on the Beaulieu Road, just a couple of miles south east of Lyndhurst. From here you can pick up footpaths heading north east across the heath to the Fulliford Bog. This sits next to the rail track and the Beaulieu River. The route then returns to the car park on the same paths.",
  "video_url": "https://www.youtube.com/embed/BJdgtetZY-o",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}