{
  "created_at": "2025-01-06T01:45:57.438517+00:00",
  "objectID": "3251ffe6ea037e61df0bee6f864ca2b5",
  "ref": "crowborough-walking-route",
  "title": "Crowborough Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Crowborough_Common_-_geograph.org.uk_-_335548.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3251ffe6ea037e61df0bee6f864ca2b5.gpx",
  "_geoloc": {
    "lat": 51.047782329,
    "lng": 0.1507711506
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Crowborough_Common_-_geograph.org.uk_-_335548.jpg",
      "title": "Jonathan Billinger / Crowborough Common, via Wikimedia Commons",
      "caption": "Crowborough Common. The thawing january snow reveals a memorial to a favourite pet, and a brace of snowmen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Crowborough_Cross_-_geograph.org.uk_-_456437.jpg",
      "title": "David BROOKER / Crowborough Cross, via Wikimedia Commons",
      "caption": "Crowborough Cross in the town centre. Spring flowerbed near the Sir Arthur Conan Doyle statue"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Crowborough_Country_Park_%2810%29.jpg",
      "title": "Dudley Miles, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Crowborough Country Park is a Local Nature Reserve on the western outskirts of the town."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/High_Street%2C_Crowborough_-_geograph.org.uk_-_1530212.jpg",
      "title": "Stacey Harris / High Street, Crowborough",
      "caption": "High Street, Crowborough"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/The_Blue_Anchor%2C_Crowborough_-_geograph.org.uk_-_2426487.jpg",
      "title": "The Blue Anchor, Crowborough by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Blue Anchor pub. A nice place for refreshments after your walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/All_Saints%2C_Crowborough_-_geograph.org.uk_-_2486618.jpg/512px-All_Saints%2C_Crowborough_-_geograph.org.uk_-_2486618.jpg",
      "title": "All Saints, Crowborough by John Salmon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "All Saints church."
    }
  ],
  "distance_km": 6.0,
  "description": "The town of Crowborough is nicely positioned for exploring the expansive Ashdown Forest and the High Weald AONB. There's also some fine waymarked trails running through the area including the Vanguard Way and the Wealdway. This circular walk takes you around Crowborough Common. The common is located just to the south west of the town centre and includes 220 acres of heathland and woodland. It's a nice place for a stroll with a number of trails to follow around the site. There's also picturesque streams and in the autumn months there is lots of pretty heather to see. You can pick up the footpaths just west of Whitehill and follow them south past the golf club to Sweethaws Wood and Piping Wood. Other bridleways will then take you past Redbridge Farm on the eastern side of the common. To continue your walking around the town head to Crowborough Country Park. Here you'll find more nice footpaths taking you to wet and dry woodland, grass and heath glades, marshes, streams and ponds. It's located just to the east of Jarvis Brook and the train station. Just to the west of the common you can pick up the Vanguard Way and use the waymarked trail to explore Ashdown Forest. Here you can explore 500 Acre Wood on the Pooh Walk and pay a visit to Pooh Sticks Bridge. The ancient Chelwood Vachery can also be visited near here.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just north of the common there's the Blue Anchor. The pub serves good quality food and has a lovely large garden area. You can find them at postcode TN6 1BB. The Wheatsheaf is in a lovely quiet location on the outskirts of Crowborough. The 18th century pub serves delicious genuinely home-cooked food which you can enjoy in their delightful garden area with its colourful hanging baskets. Inside there's cosy log fire and a series of photos showing the pub’s history. You can find them at Mount Pleasant with postcode TN6 2NF for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The common is a fine place for a dog walk and the two pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles south and you could try the Heathfield Walk. The trail takes you around Heathfield Park and the historic Old Heathfield where there's a noteworthy 14th century pub and 13th century church to see. Just to the east is the neighbouring village of Rotherfield where there are some nice trails across the Rotherfield Millennium Green. The green includes a pond, a stream, grassland, an ancient oak, a heritage orchard and lots of wildlife. In the village you can also visit the Grade I listed 11th century church and a 17th century pub with a particularly fine garden area. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/TY3q5hKV0mo",
  "postcode": "TN6 1GA",
  "district": "Wealden",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Crowborough, Wealden, East Sussex, England, TN6 1GA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}