{
  "created_at": "2025-01-06T02:15:11.410813+00:00",
  "objectID": "3275bc6154901552601730d06dfaafeb",
  "ref": "harrogate-ringway-walking-route",
  "title": "Harrogate Ringway Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/42/Young_crop%2C_Brackenthwaite_Lane_-_geograph.org.uk_-_1257799.jpg",
  "nearby": [
    {
      "description": "Knaresborough Round",
      "objectID": "e8c509187fc471e5f9e9dea116080a78",
      "ref": "knaresborough-round-walking-route"
    },
    {
      "description": "Plumpton Rocks",
      "objectID": "066f313ea472572dd7ed8e8225c4b39b",
      "ref": "plumpton-rocks-walking-route"
    },
    {
      "description": "Nidd Gorge",
      "objectID": "f79c5f16cea4a71ce5c530d2774545bf",
      "ref": "nidd-gorge-walking-route"
    },
    {
      "description": "Ripley Castle",
      "objectID": "18a7ae70632725d3ff3682f3aaf4897c",
      "ref": "ripley-castle-walking-route"
    },
    {
      "description": "Harlow Carr to Valley Gardens",
      "objectID": "4ceaab8aa1ccf12ff137813d8b322665",
      "ref": "harlow-carr-to-valley-gardens-walking-route"
    },
    {
      "description": "Almscliffe Crag",
      "objectID": "6b13adeb8c347d49ce46f4a1c65353a2",
      "ref": "almscliffe-crag-walking-route"
    },
    {
      "description": "Rudding Park",
      "objectID": "055826c315d81f82685460a5eacbf33a",
      "ref": "rudding-park-walking-route"
    },
    {
      "description": "Goldsborough",
      "objectID": "aa79a6d3c64691f4767e729e725a5944",
      "ref": "goldsborough-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3275bc6154901552601730d06dfaafeb.gpx",
  "_geoloc": {
    "lat": 53.9592085825,
    "lng": -1.5348667425
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Young_crop%2C_Brackenthwaite_Lane_-_geograph.org.uk_-_1257799.jpg",
      "title": "Derek Harper / Young crop, Brackenthwaite Lane",
      "caption": "Young crop, Brackenthwaite Lane. Spring cereal springing up in this field by the Harrogate Ringway, which follows the other side of the field boundary on the left towards The Warren, the wood on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/On_the_Harrogate_Ringway_-_geograph.org.uk_-_1257937.jpg",
      "title": "Derek Harper / On the Harrogate Ringway",
      "caption": "The trail enters The Warren through this gate, with a view over the wall of the Horn Beck and Crimple Beck valleys. The prominent farm is Brackenfoot Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Harrogate_Ringway_Path_behind_Harlow_Carr_Gardens_-_geograph.org.uk_-_100898.jpg",
      "title": "Chris Heaton / Harrogate Ringway Path behind Harlow Carr Gardens",
      "caption": "View of the path behind Harlow Carr Gardens. Ringway Path sandwiched between the boundary of Harlow Carr Gardens and a line of trees. This section runs north from the B6162 to Cardale Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Clark_Beck_valley_at_Yew_Tree_Lane_-_geograph.org.uk_-_1258968.jpg",
      "title": "Derek Harper / Clark Beck valley at Yew Tree Lane",
      "caption": "Clark Beck valley at Yew Tree Lane. Taken from the Ringway as it descends towards the valley. It then turns left up the valley, although a short section of footpath connects to Yew Tree Lane near the bridge. The house is on Rossett Green Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Fulwith_Mill_Farm_-_geograph.org.uk_-_222204.jpg",
      "title": "DS Pugh / Fulwith Mill Farm",
      "caption": "Fulwith Mill Farm. Standing below Crimple Viaduct is Fulwith Mill Farm, accessible from many directions on bridleways, particularly those forming the ringway footpaths."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Towards_Daw_Cross_-_geograph.org.uk_-_1258192.jpg",
      "title": "Derek Harper / Towards Daw Cross",
      "caption": "Towards Daw Cross. From the Ringway as it crosses an irregularly-shaped field, with trees along a field boundary in the evening sun, and housing at Daw Cross. The distant estate on the hill is at Spacey Houses."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Approaching_Forest_Moor_-_geograph.org.uk_-_1254510.jpg",
      "title": "Derek Harper / Approaching Forest Moor",
      "caption": "Approaching Forest Moor. The track crosses a large field inhabited by footpaths carrying the Knaresborough Round and the Ringway, although it is on neither. The Holbeck, in its shallow valley, drains (left) into the nearby Nidd. The houses beyond, on Forest Moor Road, are in SE3455."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Countryside_west_of_Buttersyke_Bar_-_geograph.org.uk_-_1257895.jpg",
      "title": "Derek Harper / Countryside west of Buttersyke Bar",
      "caption": "Countryside west of Buttersyke Bar. Seen from the Harrogate Ringway as it descends a field beside The Warren. Fields slope down towards Buttersyke. Buttersyke Bar, the roundabout of the A61/A658, is visible in the centre above the oak tree. The farms beyond it are on Walton Head Lane."
    }
  ],
  "distance_km": 32.0,
  "description": "This is a 20 mile circular walk around Harrogate. There's much to enjoy on this route including the RHS Harlow Carr Gardens. With lakes, woodland and a wildflower meadow it is well worth spending some time in. It's also a short stroll through the Pinewoods to the nearby Valley Gardens, another highlight of the town. The 17 acre gardens also include woodland trails, several mineral springs and historic buildings including the Sun Pavilion and colonnades. The path also includes a lovely long stretch along the River Nidd to the delightful market town of Knaresborough. You'll pass through the Nidd Gorge, a peaceful wooded gorge wth lots of wildlife to look out for such as tawny owl, roe deer, woodpeckers and herons on the water. Another waterside stretch along the River Crimple follows soon after Knaresborough with splendid views of the Yorkshire countryside a further attraction on this challenging walk. This trail joins with the Knaresborough Round around the historic town of Knaresborough. You can pick up this 20 mile circular trail to further explore the countryside and villages of the area. The route also passes close to the splendid Plumpton Rocks. It's well worth a small detour to visit this delightful hidden gem. Almscliffe Crag is also just off the route near North Rigton, providing splendid views over the Wharfe Valley countryside.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the little village of Old Bilton you could stop for some refreshments at the Gardeners Arms. The classic old pub has some features like wainscotting, stone flags, and stone fireplaces still remaining. There's also a nice large garden area to sit out in when the weather is fine. You can find the pub on Bilton Lane with a postcode of HG1 4DH for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you have time we recommend exploring the splendid Knaresborough Castle. The 12th century castle sits in a fine location, next to the river, just south of the train station. For a fee you can explore the interior of the castle and visit the interesting museum which details the history of the castle. The grounds include pretty gardens, attractive lawns, a bowling green and a putting green are free to access. From the castle's elevated position there are also fine views over the surrounding area. Just to the south of the town you'll pass Rudding Park. The park includes a Grade I listed Regency-style country house, a spa and an 18-hole golf course in the 18th-century parkland. You can stay at the hotel and enjoy a popular spa day here. In this area you'll also enjoy walks along the Crimple Valley Beck to the impressive Crimple Railway Viaduct. If you link with the Knaresborough Round near Rudding Park you could head north east to visit Goldsborough. Here you can explore the beautiful landscaped gardens at the 16th century Goldsborough Hall. For more walking ideas in the area see the Nidderdale Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/clN7UweZQ_U",
  "district": "Pannal",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "45, Station Road, Spacey Houses, Pannal and Burn Bridge, Pannal, North Yorkshire, York and North Yorkshire, England, HG3 1JS, United Kingdom",
  "postcode": "HG3 1JS",
  "state": "England"
}