{
  "created_at": "2025-01-06T08:15:24.634180+00:00",
  "objectID": "32931dfba66cac09cb4c1c9fd5c02561",
  "ref": "ebbor-gorge-walking-route",
  "title": "Ebbor Gorge Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Ebborgrogeplaque.jpg/512px-Ebborgrogeplaque.jpg",
  "nearby": [
    {
      "description": "Draycott Sleights",
      "objectID": "aafde175a764df9e398d7085ad8221fa",
      "ref": "draycott-sleights-walking-route"
    },
    {
      "description": "West Mendip Way",
      "objectID": "ae4e6d155e5bd663f57deea08ad1ed66",
      "ref": "west-mendip-way-walking-route"
    },
    {
      "description": "Wells",
      "objectID": "50e2bd4649d6df8c9de037c0c79f7f57",
      "ref": "wells-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/32931dfba66cac09cb4c1c9fd5c02561.gpx",
  "_geoloc": {
    "lat": 51.2331572216,
    "lng": -2.6878014385
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Ebborgrogeplaque.jpg/512px-Ebborgrogeplaque.jpg",
      "title": "Rodw at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Plaque at Ebbor Gorge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Top_of_Ebbor_Gorge_-_geograph.org.uk_-_1281212.jpg",
      "title": "Rick Crowley / Top of Ebbor Gorge, via Wikimedia Commons",
      "caption": "The picture is taken from the signposted view point at the top end of the gorge on the red sign posted route. There is a serious drop into the gorge a few feet in front of the photographer. In the distance on the skyline the Glastonbury Tor and Ruin of St Michael's Church on its summit can just be seen as a pinprick."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Mendips_near_Priddy_looking_West.jpg",
      "title": "Edwin Graham / View from Mendips near Priddy looking West, via Wikimedia Commons",
      "caption": "View from Mendips near Priddy looking West. The car park above Ebbor Gorge provides a panoramic view.This picture looks West over the isolated Nyland Hill towards the Bristol Channel. Looking South you will see Glastonbury Tor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Above_Ebbor_Gorge.jpg/512px-Above_Ebbor_Gorge.jpg",
      "title": "Derek Andrews [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The view from atop Ebbor Gorge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/A_bear_in_the_woods_near_Ebbor_Gorge_-_geograph.org.uk_-_1281252.jpg/256px-A_bear_in_the_woods_near_Ebbor_Gorge_-_geograph.org.uk_-_1281252.jpg",
      "title": "Rick Crowley / A bear in the woods near Ebbor Gorge, via Wikimedia Commons",
      "caption": "A bear in the woods near Ebbor Gorge. In the heart of the wood in the main pathway to the bottom of the gorge is this bear made of wicker and creeper. About 7 feet tall, somehow seems to fit into the scene."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/In_the_Ebbor_Gorge_-_geograph.org.uk_-_86865.jpg/256px-In_the_Ebbor_Gorge_-_geograph.org.uk_-_86865.jpg",
      "title": "Rog Frost / In the Ebbor Gorge",
      "caption": "Vegetation in the gorge"
    }
  ],
  "distance_km": 2.5,
  "description": "This circular walk explores a wonderful limestone gorge near Wookey Hole. In the gorge you will find waymarked woodland trails and a variety of interesting plants and flowers. There's also pretty streams and lots of interesting rock formations. There is some climbing involved with some of the paths reaching a height of over 700ft. From these high points at the top of the gorge there are great views towards Glastonbury and the Somerset Levels. The area is also a designated nature reserve so look out for wildlife including red deer and birds of prey. The site also attracts a large variety of butterflies including white-letter hairstreak, high brown fritillary and chalkhill blue. Flora includes bluebells, wood anemone, ancient woodland and various fungi and ferns. There is a good sized car park just off the Deerleap Road where you can start your walk. You could also follow the West Mendip Way from the nearby town of Wells to the site. It's about a two mile walk, passing Wookey Hole on the way. The West Mendip Way passes through the area so you could pick this up to extend your walk. Heading north will take you to the village of Priddy through the countryside. A couple of miles beyond Priddy you will find Rodney Stoke and Draycott Sleights Nature Reserves where there are nice footpaths and lots of flora and fauna to look out for.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Wookey Hole Inn is located just to the south of the reserve and a good choice for some post walk refreshments. The inn has an interesting interior with décor based on the local Wookey Hole caves and the old-world, new-age Glastonbury. Behind the inn there's a fantastic sculpture garden where you can sit out and enjoy your meal. There's seating for over 100 people and it's planted with bamboos, grasses and herbs. You can find the pub at postcode BA5 1BP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The wooded gorge is a fine place for a dog walk and you will probably see plenty of other owners as you make your way through the area. It's probably safest to put them on leads at the high points as there are quite sheer drops down. The Wookey Hole Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can visit the gorge from the nearby city of Wells by following the West Mendip Way to the site. Our Wells Walk shows the route which also visits the village of Wookey Hole. It's about a 2.5 mile walk from the city centre so should take around 45 minutes to an hour. The spectacular Cheddar Gorge, the historic town of Axbridge and the picturesque Cheddar Reservoir are also only a few miles north west. The circular Priddy Walk starts from the nearby village. It visits the gorge and a series of other local highlights including the ancient Priddy Nine Barrows, the Priddy Mineries Nature Reserve and Wookey Hole. There's also a fine 19th century village inn for some post walk refreshment. For more walking ideas in the area see the Mendip Hills Walks and Somerset Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/w0OA_TIE1C8",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Deerleap, St Cuthbert Out, Wookey Hole, Somerset, England, BA5 1EL, United Kingdom",
  "postcode": "BA5 1EL",
  "district": "Wookey Hole",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rock"
  ],
  "points_of_interest": [
    "nature reserve",
    "views",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}