{
  "created_at": "2025-01-06T02:31:13.807119+00:00",
  "objectID": "330c2b129f9e085e7ea900828eba9f24",
  "ref": "colley-hill-walking-route",
  "title": "Colley Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Sunrise_on_The_Saddle_Knob%2C_Colley_Hill_-_geograph.org.uk_-_621066.jpg",
  "nearby": [
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Reigate and Banstead Millennium Trail",
      "objectID": "a43ef41680490a2489ea84e47e05c346",
      "ref": "reigate-and-banstead-millennium-trail-walking-route"
    },
    {
      "description": "Reigate Hill and Gatton Park",
      "objectID": "d1cabfe0de094f88d0210e237c45b6c1",
      "ref": "reigate-hill-and-gatton-park-walking-route"
    },
    {
      "description": "Reigate Heath",
      "objectID": "f83d9593621fb4bd90df754cd5f4ff10",
      "ref": "reigate-heath-walking-route"
    },
    {
      "description": "Betchworth",
      "objectID": "49a8dfa05747c9165f36c9d292b339a5",
      "ref": "betchworth-walking-route"
    },
    {
      "description": "Brockham",
      "objectID": "263d3edaedbd061bfe1bad4fe84ace85",
      "ref": "brockham-walking-route"
    },
    {
      "description": "Tadworth",
      "objectID": "02e606dc5ec97a58e67b885cb393b9bb",
      "ref": "tadworth-walking-route"
    },
    {
      "description": "Banstead Heath",
      "objectID": "c07c73bbd9d3873ec3b4133783b6f573",
      "ref": "banstead-heath-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/330c2b129f9e085e7ea900828eba9f24.gpx",
  "_geoloc": {
    "lat": 51.2560163033,
    "lng": -0.1918248561
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Sunrise_on_The_Saddle_Knob%2C_Colley_Hill_-_geograph.org.uk_-_621066.jpg",
      "title": "Ian Capper / Sunrise on The Saddle Knob, Colley Hill, via Wikimedia Commons",
      "caption": "Sunrise on The Saddle Knob, Colley Hill. This picture along the North Downs scarp was taken on a November morning, just after sunrise. The Saddle Knob is the grassy slope, with an old quarry at its foot. In the background is the much bigger Betchworth Quarry - until a few years ago its white cliff was a landmark for miles around. Now only the top shows, the rest having been used as a large landfill, now landscaped and being managed to make new downland. In the very far distance is White Downs. Box Hill, perhaps the most famous part of this stretch of the North Downs, is not visible, lying around the corner beyond Betchworth Quarry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Pit_on_Colley_Hill_-_geograph.org.uk_-_673879.jpg",
      "title": "Ian Capper / Pit on Colley Hill, via Wikimedia Commons",
      "caption": "Pit on Colley Hill. I assume this was once a chalk pit, although it seems very shallow. The alternative is that it is the crater caused by a crashed aeroplane, which is definitely the case for a rounder depression at the other end of Colley Hill. Reigate, with the wooded ridge of Park Hill, can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Colley_Hill_-_geograph.org.uk_-_1316215.jpg",
      "title": "Ian Capper / Colley Hill, via Wikimedia Commons",
      "caption": "The path here is a section of one of the medieval routes out of Reigate over the North Downs, leading on to Walton Heath. Another section can be seen below the trees on the right, along the top of a brick retaining wall from the quarry that was sited below Colley Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Colley_Hill_-_geograph.org.uk_-_1316231.jpg",
      "title": "Ian Capper / Colley Hill, via Wikimedia Commons",
      "caption": "The scarp slope of Colley Hill viewed from the Saddle Knob, with the water tower on the skyline"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Lower_slope_of_the_Saddle_Knob_-_geograph.org.uk_-_1724423.jpg",
      "title": "Ian Capper / Lower slope of the Saddle Knob",
      "caption": "Lower slope of the Saddle Knob. Lower slope of the Saddle Knob Viewed on a frosty morning, with the former Betchworth Quarry in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/The_Inglis_Memorial%2C_Colley_Hill%2C_Surrey_-_geograph.org.uk_-_2428161.jpg/512px-The_Inglis_Memorial%2C_Colley_Hill%2C_Surrey_-_geograph.org.uk_-_2428161.jpg",
      "title": "The Inglis Memorial, Colley Hill, Surrey by Peter Trimming, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Inglis Memorial. The memorial was donated to the Borough of Reigate in 1909 by Lieutenant Colonel Sir Robert William Inglis. Originally a drinking fountain for horses at the top of the original main route over Reigate Hill. Now a scenic place for ramblers to rest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Path_junction%2C_Colley_Hill_-_geograph.org.uk_-_1654216.jpg",
      "title": "Ian Capper / Path junction, Colley Hill",
      "caption": "Path junction. Viewed in the winter when the normal white of chalk is replaced by white of snow, following a significant fall around 24 hours earlier. On the left is the main path up Colley Hill, being one of the medieval routes out of Reigate over the North Downs, leading on to Walton Heath. On the right is the direct path which runs up the slope from Pilgrims Way. In the background is Reigate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Path_up_Colley_Hill_-_geograph.org.uk_-_1316031.jpg",
      "title": "Ian Capper / Path up Colley Hill",
      "caption": "Path up Colley Hill. One of the medieval routes out of Reigate over the North Downs, leading over Colley Hill and on to Walton Heath. This is looking down the path, with central Reigate on the right in the background, with the High Trees ridge on the left. In the foreground is a the remains of a brick structure."
    }
  ],
  "distance_km": 3.0,
  "description": "Climb to the 722 ft (220 m) summit of Colley Hill on this walk in the North Downs. Colley Hill is located just to the west of Reigate Hill. It's a satisfying climb with great views over Surrey to the South Downs. You start off at the Wray Lane car park near Gatton Park and follow the North Downs Way west to the hill summit. You'll pass Reigate Fort, woodlands and grassland with pretty wildflowers in the summer. As you climb you can enjoy great views of Box Hill and Leith Hill. You'll also pass the interesting Inglis Memorial. If you'd like to extend your walk then the Reigate Hill and Gatton Park Walk also starts from the Wray Lane car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the delightful Reigate Hill Tea Rooms for some refreshments on the walk. The cafe is in a fabulous elevated position with a number of picnic tables where you can sit outside and soak in the views of the Weald and Gatwick Airport. There's a good range of snacks and it's also very reasonably priced. Skimmington Castle is a little further away but well worth a visit. They have a great menu and a nice outdoor seating area with views of Reigate Heath for warmer days. You can find it on the eastern side of the heath at a postcode of RH2 8RL. Our Skimmington Castle Walk starts from the pub and visits the heath before climbing Colley Hill."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Look out for the Inglis Memorial on the top of Colley Hill. It was donated to the Borough of Reigate in 1909 by Lieutenant Colonel Sir Robert William Inglis VC. It was originally a drinking fountain for horses, standing at the top of the original main route over Reigate Hill. Now restored, it houses a viewpoint indicator.   Pictured above The Inglis Memorial on Colley Hill, just to the west of Reigate Hil. A prominent structure on the North Downs Way, this structure contains a plinth pointing the direction to several towns that can be seen from this viewing spot. It has an ornately decorated roof representing the heavens. South west of the hill there's the village of Betchworth where you can visit the ruined Betchworth Castle which sits next to the River Mole. There's also the adjacent village of Brockham where you can explore the Brockham Quarry Nature Reserve. The interesting site was once the site of chalk extraction and the lime making industry during the Victorian Era. Just to the north is Tadworth where you can enjoy miles of cycling and walking trails across Banstead Heath."
    }
  ],
  "video_url": "https://www.youtube.com/embed/JLvh39T7TwU",
  "postcode": "RH2 9RP",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "North Downs Way, Reigate, Reigate and Banstead, Surrey, England, RH2 9RP, United Kingdom",
  "district": "Reigate and Banstead",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}