{
  "created_at": "2025-01-06T10:58:41.941178+00:00",
  "objectID": "331b3f763cfe410cabd0a4778ac8e466",
  "ref": "leechpool-woods-walking-route",
  "title": "Leechpool Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Leechpool_Woods%2C_Horsham%2C_West_Sussex_-_geograph.org.uk_-_27015.jpg",
  "nearby": [
    {
      "description": "Horsham Riverside Walk",
      "objectID": "32793c1c04a9341f64af3bcf1d839cc7",
      "ref": "horsham-riverside-walk-walking-route"
    },
    {
      "description": "Horsham",
      "objectID": "6276f61a7a1a1a12e059607426b6d713",
      "ref": "horsham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/331b3f763cfe410cabd0a4778ac8e466.gpx",
  "_geoloc": {
    "lat": 51.06924588,
    "lng": -0.29706537
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Leechpool_Woods%2C_Horsham%2C_West_Sussex_-_geograph.org.uk_-_27015.jpg",
      "title": "Pete Chapman / Leechpool Woods, Horsham, West Sussex, via Wikimedia Commons",
      "caption": "Leechpool Woods, entrance. On the fringes of the original St Leonards Forest area. These woods offer a recreation area for the people of Horsham. The overall area (administrated by Horsham District Council) includes Owlbeech and Leechpool Woods. Entrance to the area (where the picture was taken) is through Leechpool woods in grid square TQ1931. The part shown is a coniferous plantation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Owlbeech_Woods%2C_Horsham%2C_West_Sussex_-_geograph.org.uk_-_59871.jpg",
      "title": "Pete Chapman / Owlbeech Woods, Horsham, West Sussex, via Wikimedia Commons",
      "caption": "Owlbeech Woods. Owned an run by Horsham District Council, who permit general public access."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Bridge_and_steps%2C_Leechpool_Wood_-_geograph.org.uk_-_1983073.jpg",
      "title": "Bridge and steps, Leechpool Wood by Robin Webster, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridge and steps, Leechpool Wood. The woodland is mixed and includes many mature broadleaved deciduous trees in the Leechpool area. Facilities include a car park, information board, metalled path circuit and a permanent orienteering course. A popular area for dog walkers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Owlbeech_wood%2C_Horsham%2C_Sussex_-_geograph.org.uk_-_637428.jpg",
      "title": "Peter Cox / Owlbeech wood, Horsham, Sussex",
      "caption": "Owlbeech wood, Horsham, Sussex"
    }
  ],
  "distance_km": 3.2,
  "description": "A woodland walk through Leechpool Woods and Owlbeech Woods in Horsham. The woodland is mixed and includes many mature broadleaved deciduous trees in the Leechpool area. Facilities include a car park, information board, metalled path circuit and a permanent orienteering course. It's also a very popular area for dog walkers. The walk starts from the Leechpool Woods car park off Harwood Road on the eastern fringe of the town. From here you can pick up trails heading north east toward Owlbeech Woods. Leechpool is characterised by mixed woodland while Owlbeech by heathland where you can see hebridean sheep, cattle and llamas grazing at certain times of the year. It's a nice area for walkers with several waymarked paths to try, including a sculpture trail representing the wildlife you can see in the woods. Look out for various butterflies and birds such as siskins and woodlarks as you make your way along the trails. You can also see lots of pretty bluebells in the spring months. This walk uses part of the Horsham Riverside Walk which is a great way to extend your exercise if you have time.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/7lvnDJKSW5k",
  "postcode": "RH13 6SG",
  "district": "Horsham",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}