{
  "created_at": "2025-01-06T02:16:51.926862+00:00",
  "objectID": "3361982e2d0157a62a42d8a780570d22",
  "ref": "wickham-walking-route",
  "title": "Wickham Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/84/Meon_River_seen_from_Meon_Valley_Trail_-_geograph.org.uk_-_51251.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3361982e2d0157a62a42d8a780570d22.gpx",
  "_geoloc": {
    "lat": 50.9013737716,
    "lng": -1.1837505722
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Meon_River_seen_from_Meon_Valley_Trail_-_geograph.org.uk_-_51251.jpg",
      "title": "Peter Facey / Meon River seen from Meon Valley Trail",
      "caption": "Meon River seen from Meon Valley Trail. Taken from the disused railway line, now called the Meon Valley Trail, at a point where it is embanked and the Meon River passes underneath it. Looking SE."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Meon_Valley_Trail%2C_north_of_Wickham_-_geograph.org.uk_-_235033.jpg",
      "title": "Peter Facey / Meon Valley Trail, north of Wickham",
      "caption": "Meon Valley Trail, north of Wickham. The trail follows the route of a dismantled railway, here lying in a cutting. Much of the trail is rather overgrown now and, as here, this makes the surface permanently wet and muddy. Throughout the whole length of the trail there is scarcely a good view to either side, even when it is embanked."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Wickham_-_The_River_Meon_-_geograph.org.uk_-_1472141.jpg",
      "title": "Chris Talbot / Wickham - The River Meon",
      "caption": "Wickham - The River Meon. The river as it flows through the water meadows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Wickham_-_Old_Railway_Bridge_-_geograph.org.uk_-_1472048.jpg",
      "title": "Chris Talbot / Wickham - Old Railway Bridge",
      "caption": "Wickham - Old Railway Bridge. This old railway bridge now forms part of the Meon Valley Bridle Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Soberton_Mill_-_geograph.org.uk_-_237903.jpg",
      "title": "Peter Facey / Soberton Mill",
      "caption": "Soberton Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Wickham_Common_-_geograph.org.uk_-_92566.jpg",
      "title": "Paul and Karen Larcombe / Wickham Common",
      "caption": "Wickham Common"
    }
  ],
  "distance_km": 24.5,
  "description": "This route from Wickham uses part of the Meon Valley Trail and the waymarked King's Way to create a circular walk around the village. The walk first follows the old railway line along the River Meon before heading into the attractive countryside and woodland to the east of the village. The route starts in the village where you can pick up the Meon Valley Trail. This shared cycling and walking trail runs along the trackbed of a disused railway line. Follow the trail north to Close Wood, Kingsmead and Mislingford before coming to Soberton. This route then turns south east along the King's Way towards Hambledon (though you can follow the Meon Valley Trail into Droxford). The country paths then take you south towards Hoe Gate before diverting east to explore the Creech Wood section of the Forest of Bere near Denmead. There's a series of nice woodland trails to try here. After leaving the forest you head south west towards Boarhunt and Wickham Common before returning to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Square Cow in Wickham is a good choice for some post walk refreshments. It has some history having originally been “The Old Curio Shop”, an open hall timber framed building dating back to the sixteenth Century. Inside there are medieval paintings with floral/geometric patterns preserved behind glass and still on display. They do lovely home cooked food which you can enjoy in the pretty garden area if the weather is fine. You can find the pub on Wickham Square with a postcode of PO17 5JN for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail is good for dog walking though you may want to keep them on leads because of the cyclists. The woodland trails in the Forest of Bere at Creech Woods and West Walk are also very popular with dog walkers. The Square Cow pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The trailway trail skirts the western edge of the West Walk section of the Forest of Bere. You could take a small detour to explore this peaceful area. If you continue along the Meon Valley Trail it will take you to the worthy villages of West Meon and Meonstoke. The village is located on the edge of the South Downs National Park so you can continue your walking here using the South Downs Walks page."
    }
  ],
  "postcode": "PO17 5JY",
  "district": "Wickham",
  "county": "Hampshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}