{
    "objectID": "3383f81787d2812d3aed58579b967b27",
    "created_at": "2024-12-19T10:56:59.235850+00:00",
    "ref": "wye-downs-walking-route",
    "title": "Wye Downs Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Wye_Downs_NNR_7.jpg/512px-Wye_Downs_NNR_7.jpg",
    "nearby": [
        {
            "description": "North Downs Way",
            "objectID": "158891488846dc8d1f43a5eb9e491778",
            "ref": "north-downs-way-walking-route"
        },
        {
            "description": "Wye Crown",
            "objectID": "b469fdfd0d51007d0f4e171a16e68a6c",
            "ref": "wye-crown-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/CAFD6A6419EB20D780257FEB003082DF/$FILE/Wye Downs.gpx",
    "_geoloc": {
        "lat": 51.1696416293,
        "lng": 0.9728556789
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Wye_Downs_NNR_7.jpg/512px-Wye_Downs_NNR_7.jpg",
            "title": "Dudley Miles [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
            "caption": "Wye Downs is a National Nature Reserve north-east of Ashford in Kent. It is part of Wye and Crundale Downs Site of Special Scientific Interest."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Wye_from_the_Crown_on_Wye_Downs_-_geograph.org.uk_-_733618.jpg",
            "title": "Aidan Simons / Wye from the Crown on Wye Downs, via Wikimedia Commons",
            "caption": "Wye from the Crown on Wye Downs. View over Wye village from the Crown, with Wye College greenhouses in the foreground."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Wye_Downs_-_geograph.org.uk_-_993862.jpg",
            "title": "Simon Huguet / Wye Downs",
            "caption": "Wye Downs. Managing species rich grassland with cattle above the Devil's Kneading Trough on Broad Down in the Wye Downs National Nature Reserve. The reserve was declared for its downland grassland which is renowned for its assemblage of many species of orchids in the spring. The cattle are English White, a traditional and rare breed and are owned by Wye Community Farm."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Sculpture_and_Information_Board_for_the_Wye_Downs_Nature_Trail_-_geograph.org.uk_-_1772137.jpg/256px-Sculpture_and_Information_Board_for_the_Wye_Downs_Nature_Trail_-_geograph.org.uk_-_1772137.jpg",
            "title": "David Anstiss / Sculpture and Information Board for the Wye Downs Nature Trail",
            "caption": "Sculpture and Information Board for the Wye Downs Nature Trail. The information board is near the Pickersdane Scrubs. The sculpture shows the Devil's Kneading Trough. A plaque on the back reads 'Sculpted by rock-shattering frost and scoured by melt-water stream of a distant age, the cherished hills and hollows of the Wye Downs have long occupied a special place in the heart of both traveller and settler. Within each long-trodden track, earth-cast mound and ridge and bank, lie the stories of those who have sought to make a living from these hills. Help us safeguard this rich heritage for future generations, tread carefully in the steps of those who have gone before and enjoy your visit. This sculpture depicts the contour lines of the area of the Devil's Kneading Trough, a dry valley (or 'combe') believed to have been formed 10,000 years ago.'"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Wye_National_Nature_Reserve_-_geograph.org.uk_-_2480194.jpg",
            "title": "Wye National Nature Reserve by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": ""
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/View_from_Wye_Downs_-_geograph.org.uk_-_3761473.jpg/512px-View_from_Wye_Downs_-_geograph.org.uk_-_3761473.jpg",
            "title": "View from Wye Downs by Marathon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": ""
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/The_Devil%27s_Kneading_Trough%2C_Wye_Downs_-_geograph.org.uk_-_2112930.jpg/512px-The_Devil%27s_Kneading_Trough%2C_Wye_Downs_-_geograph.org.uk_-_2112930.jpg",
            "title": "The Devil's Kneading Trough, Wye Downs by Marathon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "The Devil's Kneading Trough"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/View_from_Broad_Downs_-_geograph.org.uk_-_389825.jpg",
            "title": "Thomas Grant / View from Broad Downs",
            "caption": "View from Broad Downs"
        }
    ],
    "distance_km": 5.0,
    "description": "Explore this lovely area of chalk downland and woodland near Wye in Kent. Wye Downs is a nature reserve with several dramatic coombes formed in the ice age. This includes the Devil's Kneading Trough, a steep-sided valley with views of Romney Marsh , the Weald and the English Channel. The area is also home to interesting flora and fauna including several species of rare orchid. This circular walk starts at the Wye Downs car park off Coldharbour Lane. From here you can pick up the North Downs Way and other footpaths to explore the reserve. The paths first head north to the Wye Crown. This hill figure was carved in the chalk by students in 1902 to commemorate the coronation of Edward VII. The route then heads through the woodland of Pickersdane Scrubs before crossing Broad Downs and returning to the car park. If you prefer you could visit the reserve by following the North Downs Way from the village of Wye. The village is very pretty and well worth exploring. It was voted the third best place to live in the UK in an annual broadsheet's review in 2013. See our Wye Crown Walk for details of how to reach the Downs from the village. You can virtually explore Wye Downs using the google street view link below!",
    "video_url": "https://www.youtube.com/embed/iP-ST339_Ks",
    "county": "Kent",
    "region": "South East",
    "country": "England"
}
