{
  "created_at": "2025-01-06T00:05:45.625773+00:00",
  "objectID": "338acbc29afa7c17f8c587d4f3b9b6ff",
  "ref": "biddenden-walking-route",
  "title": "Biddenden Walks Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/54/Biddenden_Place_and_its_history_-_geograph.org.uk_-_928273.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/338acbc29afa7c17f8c587d4f3b9b6ff.gpx",
  "_geoloc": {
    "lat": 51.1143641885,
    "lng": 0.6379949676
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Biddenden_Place_and_its_history_-_geograph.org.uk_-_928273.jpg",
      "title": "D Gore / Biddenden Place and its history",
      "caption": "Biddenden Place and its history. The present house almost faces the High Street. It was once a much larger mansion with gatehouse, two garden-houses and granaries. The Mayney family lived here from the 14th century until in about 1580 Anthony Mayney moved to Linton - his effigy is at Linton Church. The Mayneys were followed at Biddenden Place by the Hendens who flourished until, in about 1720, a William Henden \"having dissipated his patrimony pulled down the greatest part of the seat and left the poor remains of it and a very few acres of the old garden and park\". Thereafter the house was in divided ownership until its restoration by the Raymond family after World War II."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Tomb_of_Sir_John_Mayney_-_geograph.org.uk_-_928263.jpg/256px-Tomb_of_Sir_John_Mayney_-_geograph.org.uk_-_928263.jpg",
      "title": "D Gore / Tomb of Sir John Mayney",
      "caption": "Tomb of Sir John Mayney. This 1566 altar tomb in the north chapel of All Saints' Biddenden is that of Sir John Mayney and his wife Margaret Johnson of Biddenden Place. Sir John was Sheriff of Kent in 1566 and died during his term of office. The tomb has on it a fine brass depicting husband and wife and their fourteen children, the boys standing beside their father and the girls by their mother. Most of the inscription in raised lettering on stone cannot be read as it was chipped away by Roundhead desecraters during the Civil War. It was Sir John's father, another John, who in 1522 founded and endowed a school in Biddenden which still exists today as the \"John Mayne (C of E) Primary School\" with the Mayney crest and foundation date on its uniform."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Biddenden_-_geograph.org.uk_-_174510.jpg",
      "title": "Derek Harper / Biddenden",
      "caption": "The village green with the Biddenden Maids sign, and the High Street, taken from the east side of the A262. The Biddenden Maids were twin sisters that were born in 1100, joined at the shoulders and hips. They lived in this condition for 34 years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Biddenden_-_geograph.org.uk_-_45714.jpg",
      "title": "John Brown / Biddenden",
      "caption": "High Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/The_churchyard%2C_Biddenden%2C_Kent_-_geograph.org.uk_-_1602718.jpg",
      "title": "nick macneill / The churchyard, Biddenden, Kent",
      "caption": "The churchyard"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Seal_Oast%2C_Cranbrook_Road%2C_Biddenden%2C_Kent_-_geograph.org.uk_-_332876.jpg",
      "title": "Oast House Archive / Seal Oast, Cranbrook Road, Biddenden, Kent",
      "caption": "Seal Oast, Cranbrook Road, Biddenden, Kent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Footbridge_in_Biddenden_Millennium_Field_-_geograph.org.uk_-_1618606.jpg",
      "title": "David Anstiss / Footbridge in Biddenden Millennium Field",
      "caption": "Footbridge in Biddenden Millennium Field. This bridge is on a path from Goose Green to the village. In the background is the Memorial Wood. Trees planted on behalf of deceased village Residents."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Track_into_Hemsted_Forest_-_geograph.org.uk_-_1713957.jpg/512px-Track_into_Hemsted_Forest_-_geograph.org.uk_-_1713957.jpg",
      "title": "David Anstiss / Track into Hemsted Forest",
      "caption": "Track into Hemsted Forest"
    }
  ],
  "distance_km": 9.2,
  "description": "This delightful Kent village is a splendid place for an afternoon stroll. In the village there's a picturesque village green, a fine 15th century pub and a photogenic High Street with a number of old Flemish weavers cottages to admire. There's also miles of country and woodland footpaths to explore the surrounding landscape of the High Weald AONB. This walk from the village takes you to the nearby Hemsted Forest. The walk starts in the village and follows footpaths south to Goose Green and Fosten Green before entering the woods. There's miles of trails here with lots of woodland birds to look out for as you make your way around the expansive site.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy post walk refreshments at the 15th century Red Lion. The country pub serves good home cooked food. You can find them on the High Street at postcode TN27 8AH."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails and the woodland paths in Hemsted Forest are ideal for dog walking. The Red Lion mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the village there's one of the highlights of the area at Sissinghurst Castle. The grounds have miles of well laid out paths with beautiful gardens and a 16th century tower to see. For more walking ideas in the area see the Kent Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UBXvaF0CCzg",
  "postcode": "TN27 8EA",
  "district": "Ashford",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sissinghurst Road, Biddenden, Ashford, Kent, England, TN27 8EA, United Kingdom",
  "state": "England"
}