{
  "created_at": "2025-01-06T01:11:47.402702+00:00",
  "objectID": "3398f9b83ee5bd08a7215c52ac4d2c61",
  "ref": "trent-and-mersey-canal-walking-and-cycle-route",
  "title": "Trent and Mersey Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Approaching_Weston_%28on_Trent%29_Lock%2C_Trent_and_Mersey_Canal_-_geograph.org.uk_-_1611827.jpg",
  "nearby": [
    {
      "description": "Branston Water Park",
      "objectID": "cb78aad3a88eb15226ddfd0fc37e895a",
      "ref": "branston-water-park-walking-route"
    },
    {
      "description": "National Memorial Arboretum",
      "objectID": "102d902f9015d56a676b9a52ebc82da0",
      "ref": "national-memorial-arboretum-walking-route"
    },
    {
      "description": "Marbury Country Park",
      "objectID": "c3eb78ac07e6a1da9b885cc285175e92",
      "ref": "marbury-country-park-walking-and-cycle-route"
    },
    {
      "description": "Two Saints Way",
      "objectID": "9673d10eae69dbac7ccb923a02cd3172",
      "ref": "two-saints-way-walking-route"
    },
    {
      "description": "Mercia Marina",
      "objectID": "d4504fd5d0d87039f350d4bf0b703f07",
      "ref": "mercia-marina-walking-route"
    },
    {
      "description": "Shugborough Park",
      "objectID": "00838de229b5951c5883b2c03ba186d1",
      "ref": "shugborough-park-walking-route"
    },
    {
      "description": "Shardlow",
      "objectID": "bcaa3341b63a7725287c094afb5a600d",
      "ref": "shardlow-walking-route"
    },
    {
      "description": "Trent Lock",
      "objectID": "7e87b379acd57c1bf49c0fda3d91970a",
      "ref": "trent-lock-walking-route"
    },
    {
      "description": "Stone",
      "objectID": "b4a31f9fba4235a4d6b491c8f263fdd9",
      "ref": "stone-walking-route"
    },
    {
      "description": "Mow Cop",
      "objectID": "d016778371268db928d07f591b3f87a9",
      "ref": "mow-cop-walking-route"
    },
    {
      "description": "Willington",
      "objectID": "feb879e9f1005b6ae2d09118cf41dacc",
      "ref": "willington-walking-route"
    },
    {
      "description": "Anderton Boat Lift",
      "objectID": "dd8432d454333bf20b1163ce71e79ce9",
      "ref": "anderton-boat-lift-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3398f9b83ee5bd08a7215c52ac4d2c61.gpx",
  "_geoloc": {
    "lat": 52.8723283518,
    "lng": -1.3202243331
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Approaching_Weston_%28on_Trent%29_Lock%2C_Trent_and_Mersey_Canal_-_geograph.org.uk_-_1611827.jpg",
      "title": "Roger Kidd / Approaching Weston Lock, Trent and Mersey Canal, via Wikimedia Commons",
      "caption": "Approaching Weston Lock, Trent and Mersey Canal. This long straight approach to the deep wide lock at Weston-on-Trent also affords good mooring for overnight visitors. The ninety-three mile canal was begun in 1766, initially engineered by James Brindley, and eventually opened fully in 1777 five years after his death. It stretches from Preston Brook, near Runcorn to Derwent Mouth near Shardlow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Trent_%26_Mersey_Canal_-_geograph.org.uk_-_848064.jpg",
      "title": "Mike Harris / Trent & Mersey Canal, via Wikimedia Commons",
      "caption": "Canal, near to Rode Heath, Cheshire. Betchton - the South Cheshire Way following the towpath of the Trent & Mersey Canal just east of Chell's Aqueduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Trent_and_Mersey_Canal%2C_Burton-upon-Trent_-_geograph.org.uk_-_1583408.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal, Burton-upon-Trent, via Wikimedia Commons",
      "caption": "Burton-upon-Trent. Dallow Lock (No 7) is by the bridge ahead. The houses of Outwoods Street (off the picture to the left) enjoy very long back gardens with private mooring availability."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Trent_and_Mersey_Canal%2C_Stoke-on-Trent%2C_Staffordshire_-_geograph.org.uk_-_1599488.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal, Stoke-on-Trent, Staffordshire, via Wikimedia Commons",
      "caption": "Stoke-on-Trent, Staffordshire. The bridge across the canal carries the B5045 (Sheldon New Road). There are also three large pipes crossing the water by the road bridge. The narrow channel under the bridge leads straight into Twyford Lock, the middle of the Stoke-on-Trent flight of five. The colony of Japanese Knotweed flowering profusely by the bridge has spread to several other places up and down the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Trent_and_Mersey_Canal_at_Weston-on-Trent%2C_Derbyshire_-_geograph.org.uk_-_1553778.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal at Weston-on-Trent, Derbyshire, via Wikimedia Commons",
      "caption": "Weston-on-Trent, Derbyshire The land slopes gently down to the Trent and Mersey Canal east of Weston Lock. In the distance, the railway bridge carrying trains between Burton-upon-Trent and Nottingham, (and beyond)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Trent_and_Mersey_Canal%2C_Burton-upon-Trent_-_geograph.org.uk_-_1584971.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal, Burton-upon-Trent, via Wikimedia Commons",
      "caption": "Burton-upon-Trent Here, as the canal passes through the Horninglow area, the 1967 built dual carriageway A38 is adjacent to the left. The A38 formerly ran though Burton some distance to the east (now the A5121) along the Roman road known as Ryknild Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Trent_and_Mersey_Canal_near_Barrow-on-Trent_-_geograph.org.uk_-_1609322.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal near Barrow-on-Trent, via Wikimedia Commons",
      "caption": "Barrow-on-Trent The canal takes a fairly wide straight course through the flat lands on the Trent Valley. The railway line (freight only) between Stoke or Burton and Nottingham runs to the right of the picture less than fifty metres behind the trees. The canal was fully opened in 1777 between Derwent Mouth and Preston Brook. This allowed connection with no fewer than nine other canals or significant branches. (This information from Nicholson Waterways Guide 4)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Trent_and_Mersey_Canal_near_Aston-on-Trent%2C_Derbyshire_-_geograph.org.uk_-_1615107.jpg",
      "title": "Roger Kidd / Trent and Mersey Canal near Aston-on-Trent, Derbyshire, via Wikimedia Commons",
      "caption": "Aston-on-Trent, Derbyshire. The canal was built between 1766 and 1777, initially engineered by James Brindley, but fully opened five years after his death. Here it passes through the flat farm land of the Trent Valley. Boats up to ten feet in width can use the canal from Stenson to the River Trent at Derwent Mouth, though whether two of these actually manage to pass each other without someone scraping the bottom or becoming grounded, I wonder."
    }
  ],
  "distance_km": 153.0,
  "description": "Follow the Trent and Mersey Canal through Derbyshire, Staffordshire and Cheshire on this long distance waterside walk. The route starts at Shardlow near Long Eaton in Derbyshire and heads through Weston-on-Trent and Willington to Burton Upon Trent where you will pass Mercia Marina and the lovely Branston Water Park with its woodland, wetland and meadow. You continue to Alrewas where you will pass the National Memorial Arboretum. The Arboretum contains over 50,000 trees with nearly 300 memorials for the armed forces, civilian organisations and voluntary bodies who have played a part in serving the country. The next stage takes you through Handsacre to Rugeley where you will pass the wonderful Cannock Chase Country Park. It's worth taking a short detour to explore the Cannock Chase AONB with miles of woodland walking and cycling trails, lakes, ponds and wildlife including deer and various birds to look out for. You continue through the beautiful Trent Valley passing the National Trust Owned Shugborough Park at Great Haywood. It is worth a visit with a grand hall, museum, kitchen garden, model farm and extensive parkland with follies, woodland and a Chinese House with two Chinese-style bridges. The route continues through Weston to Stone before coming to the outskirts of Stoke-on-Trent where you will pass the splendid Trentham Gardens. Also in Stoke you will pass Westport Lake which is worth a small detour. You continue north to Kidsgrove where you will find the Grade II* listed Rode Hall, surrounded by parkland and formal gardens. The hall and gardens are open to the public from April to September and are well worth a small detour from the canal. The canal continues through Cheshire to Sandbach where you will pass close to the Watch Lane Flash Nature Reserve. Onward to Middlewhich and Northwhich where you will pass Marbury Country Park. It's a delightful area with magnificent Lime avenues, an Arboretum and the delightful Budworth Mere in Great Budworth. Near here there's the wonderful Anderton Boat Lift, a marvel of engineering and one of the highlights of the waterways of Britain. The final section takes you to Runcorn passing Barnton and Weaverham with views of the River Weaver. You finish near Runcorn where the Trent and Mersey Canal links with the Bridgewater Canal. You can walk along the towpath for the whole route while cyclists can enjoy a long section through Stoke-on-Trent and a shorter section between Weston-on-Trent and Swarkstone.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's lots of nice places to stop for refreshments on the canal. The delightful Trent Lock is one of the highlights on the route. It's a significant location as the lock marks the point where the River Trent and River Soar meet with the beginning of the Erewash canal. It also sits on the border of three counties: Leicestershire, Nottinghamshire and Derbyshire. Here you'll find the aptly named Trent Lock pub beautifully positioned next to the lock. There's a great menu and a lovely, large beer garden to sit out in. You can find it at the lock with a postcode of NG10 2FY. The Steamboat Inn is also located at Trent Lock and another nice place to go for refreshments. It's located next to both the Erewash Canal and the River Trent, dating back over 200 years to when it was well placed to quench the thirsts of passing working boatmen. Today, it is perfectly placed to serve not just the needs of leisure boaters but also those of other modern day recreation seekers such as walkers, cyclists - and those just having a day out by the water. It's dog friendly and a discount on real ales is available for CAMRA members! There's lots of waterside outdoor seating for warmer days as well. You can find it at postcode NG10 2FY for your sat navs. Just west of Trent Lock you'll find the canal village of Shardlow. There's several good options for canalside refreshments here too. The historic Clock Warehouse is housed in a converted milll, dating from 1780. There's a nice garden here right next to the water. Perfect for relaxing in on warm summer days. You can find the pub right next to the canal at a postcode of DE72 2GL. In Stone there's the canalside Star Stone to consider. You can sit outside in the lovely garden area and watch the boats go by with your refreshments. They have a good menu and decent selection of real ales too. You can find the pub at 21 Stafford Street with a postcode of ST15 8QW for your sat navs. Near Sandbach you'll find the beautiful Rode Hall which is well worth a small detour from the route. The Georgian country house is surrounded by lovely parkland with woodland, gardens and a large lake. There's also delightful tea rooms where you can stop off and enjoy afternoon tea. In the Derbyshire village of Willington there's The Dragon to consider. The 150 year old pub is in a great location right next to the canal. Here you can sit outside in the garden area and watch the boats go by. There's also a 70-seater restaurant, a cosy bar area and a beautiful conservatory. You can find them at postcode DE65 6BP. A stroll around the village is also pleasant with its village green, 12th century church and the Gravel Pits Nature Reserve where there are excellent wildlife spotting opportunities. One of the highlights of the canal is the splendid Anderton Boat Lift near Northwich. The device lifts boats 50 feet from the River Weaver Navigation to the canal. This 'Cathedral of the Canals' has been listed as one of the Seven Wonders of the British Waterways and won experience of the year 2019. Here you can enjoy a boat trip along the river which uses the lift on the way. There's also a visitor centre and cafe where you can enjoy refreshments with fine views of the lift."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Around Kidsgrove you could leave the canal to visit Mow Cop. Here you'll find Mow Cop Castle, an 18th century folly regarded as one of the landmarks of the area. From the elevated position of the castle there are splendid views over the canal and the surrounding countryside."
    }
  ],
  "video_url": "https://www.youtube.com/embed/e_TqNicnbg8",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Long Horse Bridge, Shardlow and Great Wilne, Great Wilne, South Derbyshire, Derbyshire, East Midlands, England, DE72 2HP, United Kingdom",
  "postcode": "DE72 2HP",
  "district": "South Derbyshire",
  "state": "England"
}