{
  "created_at": "2025-01-06T00:37:54.031064+00:00",
  "objectID": "3420cefbb0245d60dc532178bbd48bc7",
  "ref": "gunnislake-walking-route",
  "title": "Gunnislake Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Gunnislake%2C_Weir_-_geograph.org.uk_-_1211325.jpg",
  "nearby": [
    {
      "description": "Cotehele House",
      "objectID": "e5ead3a1d512ad5500de1318457a7d42",
      "ref": "cotehele-house-walking-route"
    },
    {
      "description": "Tamar Valley Discovery Trail",
      "objectID": "ee55b9ee756d935ffaa037bca736c52b",
      "ref": "tamar-valley-discovery-trail-walking-route"
    },
    {
      "description": "Kit Hill",
      "objectID": "22ad636b94fa1f1ba97b9317a8eee3e8",
      "ref": "kit-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3420cefbb0245d60dc532178bbd48bc7.gpx",
  "_geoloc": {
    "lat": 50.525246351,
    "lng": -4.2112292009
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Gunnislake%2C_Weir_-_geograph.org.uk_-_1211325.jpg",
      "title": "Brian / Gunnislake, Weir",
      "caption": "Gunnislake, Weir. The weir is just down the River Tamar from Gunnislake. There is a very steep sided wood on the Devon side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/New_Bridge%2C_Gunnislake_-_geograph.org.uk_-_1211279.jpg",
      "title": "Brian / New Bridge, Gunnislake",
      "caption": "New Bridge, Gunnislake. This single lane road bridge crosses the River Tamar, on the border between Devon and Cornwall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Fore_Street%2C_Gunnislake_-_geograph.org.uk_-_1383144.jpg",
      "title": "Roger Cornfoot / Fore Street, Gunnislake",
      "caption": "Fore Street, Gunnislake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/The_Viaduct%2C_Calstock_-_geograph.org.uk_-_531588.jpg",
      "title": "Rob Farrow / The Viaduct, Calstock",
      "caption": "The Viaduct, Calstock. Taken from a river launch as we approached the dramatic railway viaduct over the Tamar at Calstock. Dusk was falling so the colours are somewhat muted. This is a remarkably attractive structure considering it is made out of concrete blocks ! The blocks are huge, typically 5ft x 3ft x 2ft, but varying to allow for the tapered columns. According to (not necessarily terribly reliable) research on the internet, it is 108ft to the underside top of the arches from ground level. There are 12 arches in total, each one spanning 60ft. Of these 12, four arches actually span the river (not 6 as you will find reported elsewhere). The engineers were R. Church & William Robert Galbraith and the bridge was constructed between 1904 and 1908."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Calstock%2C_Danesbrook_Valley_House_-_geograph.org.uk_-_673399.jpg",
      "title": "Martin Bodman / Calstock: Danesbrook Valley House",
      "caption": "Calstock: Danescombe Valley House. Seen from near the chapel on the National Trust\u0092s Cothele estate, Danescombe Valley House is marked as an hotel on the Ordnance Survey, but may well now be a private residence. By one of the sharp turns on the Tamar at its confluence with the Danescombe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Calstock%2C_Cothele_House_-_geograph.org.uk_-_415331.jpg",
      "title": "Martin Bodman / Calstock: Cothele House",
      "caption": "Calstock: Cothele House. The house dates from the 15th and 16th centuries and is constructed of slatestone and granite. It is now a National Trust property, open to the public for a small entry fee. Looking north-north-west"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/The_Tamar_downstream_from_Calstock_-_geograph.org.uk_-_673402.jpg",
      "title": "Martin Bodman / The Tamar downstream from Calstock",
      "caption": "The Tamar downstream from Calstock. Looking towards the viaduct that links Plymouth, Beer Alston, Calstock and Gunnislake by rail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Gunnislake_Station_-_geograph.org.uk_-_1089106.jpg",
      "title": "roger geach / Gunnislake Station",
      "caption": "Gunnislake Train Station. The station is located south of the village and is an alternative start point for the walk if you would like to come by public transport."
    }
  ],
  "distance_km": 7.5,
  "description": "This pretty little Cornish village sits close to the Devon Border, next to the River Tamar in the Tamar Valley AONB. This walk takes you south from the village to visit one of the highlights of the area at Cotehele House. The walk starts in the village where you can pick up the Tamar Valley Discovery Trail and follow the waymarked footpath south along the River Tamar to Hatches Green. The route continues towards Hare Wood and Calstock, passing close to the pretty Morwhellham Quay on the other side of the river. You then head west along the river to Cotehele House, passing the impressive Calstock Viaduct on the way. The National Trust property dates from the Tudor period and is surrounded by beautiful gardens and orchards.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rising Sun Inn is a good choice for refreshment in the village. The charming, oak beamed country pub dates back to the 17th century. They have some lovely terraced gardens where you can enjoy a meal with a view over the Tamar Valley. You can find them at postcode PL18 9BX for your sat navs. In Calstock you could stop off at the Tamar Inn for refreshments on the walk. The historic 17th century free house sits on the banks of the River Tamar. It was allegedly once a meeting place for smugglers and highwaymen. Built on a split level, it sits close by the waterfront in the village centre at a postcode of PL18 9QA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and river trails make for a fine dog walk. The Rising Sun mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the west of the village you could climb to the nearby Kit Hill for fine views over the surrounding area. Near here there's also the town of Callington where you can enjoy a climb to the Cadson Bury Iron Age Hill fort. From the ancient site there are more great views over the River Lynher Valley. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/60ONLEQO6w0",
  "postcode": "PL18 9JH",
  "district": "Gunnislake",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Newbridge Hill, Calstock, Gunnislake, Cornwall, England, PL18 9JH, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "orchards"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}