{
  "created_at": "2025-01-05T23:50:10.811906+00:00",
  "objectID": "346d68b440468414343cafa95b753d5d",
  "ref": "staunton-harold-reservoir-walking-route",
  "title": "Staunton Harold Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Visitor_Centre%2C_Staunton_Harold_Reservoir_-_geograph.org.uk_-_258552.jpg",
  "nearby": [
    {
      "description": "Melbourne Hall and Pool",
      "objectID": "d5ca7eeb2a59bbe11c6cfc5b23c3e6e3",
      "ref": "melbourne-hall-and-pool-walking-route"
    },
    {
      "description": "Foremark Reservoir",
      "objectID": "21afd33527f96f7f6d8f57de8a3e5d97",
      "ref": "foremark-reservoir-walking-route"
    },
    {
      "description": "Calke Abbey",
      "objectID": "17139caeb345abbd83f1ab4d17669a13",
      "ref": "calke-park-walking-route"
    },
    {
      "description": "National Forest Way",
      "objectID": "33273a16668d5733c3b1e311dffdbaed",
      "ref": "national-forest-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/346d68b440468414343cafa95b753d5d.gpx",
  "_geoloc": {
    "lat": 52.8165975735,
    "lng": -1.4414281906
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Visitor_Centre%2C_Staunton_Harold_Reservoir_-_geograph.org.uk_-_258552.jpg",
      "title": "Phil Myott / Visitor Centre, Staunton Harold Reservoir",
      "caption": "Visitor Centre, Staunton Harold Reservoir. The car-park, play area and visitor centre for Staunton Harold reservoir. In the background is the remains of the old windmill that was originally built in 1797."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Staunton_Harold_reservoir_-_geograph.org.uk_-_401843.jpg",
      "title": "E Gammie / Staunton Harold reservoir",
      "caption": "Reservoir from the viewpoint at the Calke car park. A very warm, still day - slow sailing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Dinghies_parked_at_Staunton_Harold_Reservoir_-_geograph.org.uk_-_1431498.jpg",
      "title": "Trevor Rickard / Dinghies parked at Staunton Harold Reservoir",
      "caption": "Dinghies parked at Staunton Harold Reservoir. Looking south down the length of the reservoir. Derby Hills Farm on the extreme right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Staunton_Harold_Reservoir_-_geograph.org.uk_-_915480.jpg",
      "title": "Mat Fascione / Staunton Harold Reservoir",
      "caption": "The reservoir is located on the county boundary of South Derbyshire and Northwest Leicestershire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Dam_at_Staunton_Harold_Reservoir_-_geograph.org.uk_-_773562.jpg",
      "title": "Robert Haywood / Dam at Staunton Harold Reservoir",
      "caption": "Dam at the reservoir. The waterworks of Severn/Trent, formerly the River Dove Water Board works, at Staunton Harold Reservoir, though the dam and outfall is within the parish of Melbourne in Derbyshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Small_bay_of_Staunton_Harold_Reservoir_-_geograph.org.uk_-_1431472.jpg",
      "title": "Trevor Rickard / Small bay of Staunton Harold Reservoir",
      "caption": "View north-east to the children's play area and visitor centre."
    }
  ],
  "distance_km": 1.2,
  "description": "Enjoy a waterside walk along this 210 acre reservoir in Melbourne, Derbyshire. The reservoir has an excellent Visitor Centre with exhibitions, a pretty wildflower meadow with a variety of wildlife and peaceful woodland trails. There's a well surfaced footpath running from the visitor centre at the northern end of the lake. You can enjoy great views across the water to the surrounding Derbyshire countryside. If you'd like to extend your walk you could head into the adjacent Calke Abbey. Here you will find woodland, ponds, meadows and a deer park. Also nearby is Foremark Reservoir where you'll find woodland trails and waterside paths. The National Forest Way passes through the area. The long distance trail can be followed to the park, the reservoir and several of the other highlights of the National Forest area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a National Trust cafe at the site which offers a selection of light lunches, tasty snacks and refreshing drinks. The cafe is located at Calke Road, Windmill Hill with a postcode of DE73 8DN. If you head about 1 mile west of the reservoir you'll come to the village of Ticknall where there are a few refreshment options. For example there's the excellent Chequers Inn. The friendly pub has a cosy fire indoors and a good sized garden area to sit out in. You can find it in the village at 27 High St with a postcode of DE73 7JH for your sat navs. Just to the east is The Holly Bush in the worthy village of Breedon. It's a historic pub of some note, dating all the way back to the 16th century. They serve high quality locally sourced food with some particularly delicious pies. The pub can be found at 1 Melbourne Lane with a postcode of DE73 8AT."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir and surrounding woodlands are a great place for a dog walk. You will probably see plenty of other owners on your visit. The on site cafe mentioned above is also dog friendly and will provide water bowls. They also have a range of dogs treats and essentials available to buy."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The reservoir is located close to the town of Melbourne where there are some lovely walks at the southern end of the town. Our Melbourne Hall and Pool Walk visits the historic hall and the pretty pool. You can pick up the two mile trail near the north eastern end of the water. Just over a mile north of the town you can also join with the Trent and Mersey Canal near Weston-on-Trent. There's some nice easy cycling and walking along the towpath here. In Calke park you could try the interesting Ticknall Tramway Tunnel Walk. This visits the old industrial tramway which connected the brickyards, lime quarries and lime yards of Ticknall to the Ashby Canal. The horse drawn system operated from 1802 to 1913. Today part of the route makes for a nice leisurely walk or cycle. You can pick up the trail just to the west of the water at Ticknall village. About two miles east of the lake you'll find the noteworthy little village of Breedon on the Hill. Here you can try the circular Breedon Hill Walk which climbs to the village's limestone hill. On the hill top you'll find an Iron Age Hillfort and a fascinating ancient church which is something of a local landmark. You can also visit a splendid 16th century village pub for refreshment after your exercise. Just to the north east there's the interesting market town of Castle Donington to explore. Here you can visit Donington Park which is famously used as a motor racing track and is also the venue for the Download Music Festival.  For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/co-ybi9oqmo",
  "district": "South Derbyshire",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Calke Road, Melbourne CP, South Derbyshire, Derbyshire, East Midlands, England, DE73 8HU, United Kingdom",
  "postcode": "DE73 8HU",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "waterfront"
  ],
  "points_of_interest": [
    "wildflower meadow",
    "views",
    "deer park"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "footpath"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}