{
  "created_at": "2025-01-06T03:06:24.570385+00:00",
  "objectID": "34df9cb192d0824897d654e08b4ccea0",
  "ref": "north-bucks-way-walking-route",
  "title": "North Bucks Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/North_Bucks_Way_-_geograph.org.uk_-_1229396.jpg",
  "nearby": [
    {
      "description": "Claydon House",
      "objectID": "f7dc6af1f65c5cee747cb313cbe0c7d4",
      "ref": "claydon-house-walking-route"
    },
    {
      "description": "Grand Union Canal Walk",
      "objectID": "dae6d837fcdb83dc44e94da2b24b4040",
      "ref": "grand-union-canal-walk-walking-route"
    },
    {
      "description": "Waddesdon Manor",
      "objectID": "765e8c2fb65160597c46f356bdd2f87e",
      "ref": "waddesdon-manor-walking-route"
    },
    {
      "description": "Pulpit Hill and Whiteleaf Hill",
      "objectID": "c6091dac15864cb370e3321bbe747569",
      "ref": "pulpit-hill-and-whiteleaf-hill-walking-route"
    },
    {
      "description": "Quainton Hill",
      "objectID": "18c4cf55c83e7ffba9304cae6ef1d75b",
      "ref": "quainton-hill-walking-route"
    },
    {
      "description": "Eythrope Park",
      "objectID": "13976ffcdd0e6e56520e952b2dfe09dc",
      "ref": "eythrope-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/34df9cb192d0824897d654e08b4ccea0.gpx",
  "_geoloc": {
    "lat": 51.7404837063,
    "lng": -0.7999200504
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/North_Bucks_Way_-_geograph.org.uk_-_1229396.jpg",
      "title": "Shaun Ferguson / North Bucks Way",
      "caption": "North Bucks Way heading away from Sedrup towards Bishopstone"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/North_Bucks_Way_-_geograph.org.uk_-_1229361.jpg",
      "title": "Shaun Ferguson / North Bucks Way",
      "caption": "Heading towards Kimble Wick"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/North_Bucks_Way_Milton_Keynes_Boundary_Walk_-_geograph.org.uk_-_216883.jpg",
      "title": "Mr Biz / North Bucks Way Milton Keynes Boundary Walk",
      "caption": "This is the view north on the Milton Keynes Boundary Walk where just after the Midshires Way turns off and the North Buckinghamshire Way joins up."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Eythrope_Pavilion%2C_from_the_North_Bucks_Way_-_geograph.org.uk_-_1494830.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Eythrope Pavilion, from the North Bucks Way Eythrope is a hamlet and country house - the Eythrope Pavilion - located to the south east of the village of Waddesdon, Buckinghamshire. The hamlet name is Anglo Saxon in origin, and means \"island farm\", referring to an island in the River Thame that flows by the hamlet. This distant view of the Pavilion is all that is visible to the pedestrian from the footpath. The architect of the Eythrope Pavilion was George Devey (1820\u0096-1886), a specialist in lodges, cottages and country mansions, whose distinctive style included the use of tiles and timbers on external walls. A favourite architect of the Rothschild family, he received numerous commissions from family members (as did fellow architect William Huckvale at Tring)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Eythrope_Pavilion.jpg/256px-Eythrope_Pavilion.jpg",
      "title": "Ian Petticrew, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Eythrope Pavilion. The Pavilion was commissioned by Miss Alice Charlotte von Rothschild (1847-1922). When her brother Ferdinand began the construction of Waddesdon Manor in 1874, Miss Rothschild acquired a nearby property at Eythrope where, between 1876 and 1879, she had a park and garden created and Eythrope Pavilion built, near to the River Thame. Because she had suffered from rheumatic fever, she had been advised not to sleep near water because dampness would aggravate her health, so the Pavilion was originally built for daytime occupation only and at nights she returned to Waddesdon Manor. The house was later extended and today looks something of a pot pourri of styles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Bridleway_to_Eythrope_Park_-_geograph.org.uk_-_467962.jpg",
      "title": "David Hawgood / Bridleway to Eythrope Park",
      "caption": "Bridleway to Eythrope Park. This track from the North Lodge of Eythrope Park carries several named routes - Swan's Way, Midshires Way, Aylesbury Ring, and North Bucks Way. There are broad beans in fields either side of the hedged track."
    }
  ],
  "distance_km": 53.0,
  "description": "This long distance walk through Buckinghamshire visits a number of pretty villages and takes you though the beautiful countryside of the Vale of Aylesbury. The walk is well signed and waymarked with a Bucks swan logo. The walk starts near Princes Risborough at the pretty Pulpit Hill Nature Reserve in the Chilterns Area of Outstanding Natural Beauty. The walk then heads to Great Kimble and Upper Hartwell where you will find the National Trust owned Hartwell House. There are 90 acres of landscaped parkland to enjoy and a Grade I listed house where Louis XVIII, exiled King of France, lived for five years. Shortly after passing Hartwell you will come to Eythrope Park where you will cross a bridge and weir. The park was created for Alice de Rothschild as the grounds for her 19th century house, the Pavilion. After crossing the River Thame at Eythrope you continue to Waddesdon where you will find Waddesdon Manor. This exquisite French Renaissance-style chateau is surrounded by beautiful parkland and gardens. After passing through Waddesdon village you continue north to Quainton. Here there is an impressive windmill built in 1830 and a climb to Quainton Hill where there are splendid views of the surrounding countryside. The route then descends to East Claydon where you will find the 18th century Claydon House. Run by the National Trust the fine house has lavish interiors and an estate with delightful parkland and lakes. You continue north to Addington and then on to Great Horwood, where there is a nice mixture of heath common and woodland. The final section takes you through the countryside to the west of Milton Keynes, passing Whaddon and Oakhill Wood before finishing in Wolverton by the Grand Union Canal .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Quainton you could stop off at the The George and Dragon. The 18th century pub has a charming interior with a quarry tiled floor, inglenook fireplaces and beams. Outside there's a nice garden area overlooking the village green and windmill. You can find them next to the green at postcode HP22 4AR for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Around Eythrope you can pick up the circular Haddenham Walk which uses part of the Aylesbury Ring and the Thame Valley Walk to visit Dinton, Nether Winchendon and Cuddington. The route starts from Haddenham where there's a pretty duck pond, a fine old church and quaint thatched cottages to see. For more walking ideas in the area see the Buckinghamshire Walks page."
    }
  ],
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Welcome to Grangelands & The Rifle Range, Cross Dyke, Great and Little Kimble cum Marsh, Askett, Great Kimble, Buckinghamshire, England, HP17 0XH, United Kingdom",
  "postcode": "HP17 0XH",
  "district": "Askett",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland",
    "countryside"
  ],
  "points_of_interest": [
    "nature reserve",
    "historic house",
    "park",
    "windmill",
    "estate"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "canal"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}