{
  "created_at": "2025-01-06T02:10:36.042070+00:00",
  "objectID": "34eb2d21cd1e621585e8a8d6b91d63d6",
  "ref": "london-colney-walking-route",
  "title": "London Colney Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/40/London_Colney%2C_The_Golden_Lion_public_house_-_geograph.org.uk_-_742209.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/34eb2d21cd1e621585e8a8d6b91d63d6.gpx",
  "_geoloc": {
    "lat": 51.7156611324,
    "lng": -0.2983710487
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/London_Colney%2C_The_Golden_Lion_public_house_-_geograph.org.uk_-_742209.jpg",
      "title": "Nigel Cox / London Colney: The Golden Lion public house",
      "caption": "The Golden Lion public house. One of London Colney's seven public houses along its High Street, the pub is Victorian and is shown on the Ordnance Survey maps from 1898 onwards. The smoked glass windows and the grey tablet on the side at first floor level bear witness to the pub's previous owners, Trumans. However the pub has existed on the site since 1881."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Lake_at_Broad_Colney_Lakes_-_geograph.org.uk_-_39354.jpg",
      "title": "Jack Hill / Lake at Broad Colney Lakes",
      "caption": "Lake at Broad Colney Lakes. This one is fed from the main lake which is also the course of the River Colne."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Minor_Ford_at_London_Colney_-_geograph.org.uk_-_3458800.jpg/512px-Minor_Ford_at_London_Colney_-_geograph.org.uk_-_3458800.jpg",
      "title": "Minor Ford at London Colney by John Walton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Minor Ford at London Colney"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wild_Flowers%2C_River_Colne%2C_London_Colney_-_geograph.org.uk_-_1847231.jpg/512px-Wild_Flowers%2C_River_Colne%2C_London_Colney_-_geograph.org.uk_-_1847231.jpg",
      "title": "Wild Flowers, River Colne, London Colney by Christine Matthews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wild Flowers, River Colne, London Colney"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Willows_Lakes_%288134445080%29.jpg/512px-Willows_Lakes_%288134445080%29.jpg",
      "title": "Peter O'Connor aka anemoneprojectors, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Willows Lakes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/London_Colney%2C_Telford%27s_Bridge_-_geograph.org.uk_-_1029217.jpg",
      "title": "Nigel Cox / London Colney: Telford's Bridge",
      "caption": "London Colney: Telford's Bridge. Photographed on the morning after the snowstorm of 28 October 2008, the bridge carries Barnet Road over the River Colne. According to the stone plaque set into the brickwork it was originally built around 1775 and restored in 1998. Thomas Telford was born in 1757 and apprenticed to a stonemason in 1771 so this would have been one of his earliest designs. The road is an old coaching route from London to St Albans, and later became one of the main arterial routes into and out of London as the A6. With the building of the London Colney Bypass the road was completely declassified."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/London_Colney%2C_Salisbury_Hall_-_geograph.org.uk_-_1384956.jpg",
      "title": "Nigel Cox / London Colney: Salisbury Hall",
      "caption": "London Colney: Salisbury Hall. This moated site has been a place of settlement for centuries, although the current hall dates from around 1685. It has had several famous residents including the mother of Winston Churchill and, later, Sir Nigel Gresley. During the Second World War the de Havilland Aircraft Company designed the Mosquito aircraft in the hall and built the prototype in the outbuildings. After the war the hall fell into a derelict state, but was restored in the late 1950s. It remains in private ownership and is not open to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Colney_Heath_-_geograph.org.uk_-_184756.jpg",
      "title": "Nigel Cox / Colney Heath",
      "caption": "Colney Heath. Viewed looking from Colney Heath High Street the River Colne runs in the trees in the distance."
    }
  ],
  "distance_km": 8.0,
  "description": "This pleasant Hertfordshire based village is located just to the south of St Albans. It's a great place for waterside walking with easy trails along the local lakes and rivers. This circular walk from the village explores the Broad Colney Lakes Nature Reserve and the Willow Lakes before visiting the neighbouring village of Colney Heath. There's much to enjoy with pleasant footpaths along the River Colne and a series of picturesque lakes. On the way you can look out for a variety of water loving birds. The walk starts at the Broad Colney Lakes Nature Reserve on the western side of the village. From here you can pick up riverside paths heading north to the Willow Lakes and Colney Heath where you could stop for some refreshments. The route then follows footpaths across the heath which is also a local nature reserve. The river runs through the centre of the heath and there's also some pleasant woodland, grassland and interesting flora to see here. The final section leads you south west past Tyttenhanger House and Garden Wood to return to the village. To continue your riverside walking in the area head west to pick up the Ver-Colne Valley Walk. This waymarked footpath will take you north along the River Ver into St Albans .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bull is a nice place for rest and refreshment after your exercise. The historic pub dates back to the 17th century and includes a charming interior with an original fireplace. They have a lovely garden area and can be found at postcode AL2 1QU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and heathland trails make for a fine dog walk. The Bull pub mentioned above is also dog friendly."
    }
  ],
  "district": "St Albans",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Watery Lane, London Colney, St Albans, Hertfordshire, England, AL2 1PZ, United Kingdom",
  "postcode": "AL2 1PZ",
  "state": "England"
}