{
  "created_at": "2025-01-05T23:28:07.967181+00:00",
  "objectID": "35435738dacc9c9a2aa33b63f21bf5d4",
  "ref": "thorncombe-woods-walking-route",
  "title": "Thorncombe Woods and Hardy's Cottage Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/79/Hardy%27s_cottage%2C_Higher_Bockhampton_-_geograph.org.uk_-_480484.jpg",
  "nearby": [
    {
      "description": "Puddletown Forest",
      "objectID": "0fc911062a3b5906d5e12c9d5df70c2c",
      "ref": "puddletown-forest-walking-and-cycle-route"
    },
    {
      "description": "Athelhampton House",
      "objectID": "ce060ad0ec71aecb6521cced6093543b",
      "ref": "athelhampton-house-walking-route"
    },
    {
      "description": "Maiden Castle Dorset",
      "objectID": "e6e6e67a8dc501d47567109e0fddd258",
      "ref": "maiden-castle-dorset-walking-route"
    },
    {
      "description": "Dorchester",
      "objectID": "56fae3f1ae6605f53ac8b3639e378ba7",
      "ref": "dorchester-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/35435738dacc9c9a2aa33b63f21bf5d4.gpx",
  "_geoloc": {
    "lat": 50.7279702096,
    "lng": -2.3905573677
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Hardy%27s_cottage%2C_Higher_Bockhampton_-_geograph.org.uk_-_480484.jpg",
      "title": "Chris Downer / Hardy’s cottage, Higher Bockhampton",
      "caption": "Hardy's cottage, Higher Bockhampton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Footpath_past_the_Rainbarrows%2C_Duddle_Heath_-_geograph.org.uk_-_396370.jpg",
      "title": "Jim Champion / Footpath past the Rainbarrows, Duddle Heath",
      "caption": "Footpath past the Rainbarrows, Duddle Heath. This path leads across the upper terrace of Duddle Heath, with the three Bronze Age bowl barrows (known as The Rainbarrows) to the right of the fence. This is part of Puddletown Forest that has been cleared of scrub as part of a heathland restoration project. The Frome valley and the Purbeck Hills can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Rushy_Pond_on_a_hot_summer%27s_day_-_geograph.org.uk_-_506543.jpg",
      "title": "Chris Downer / Rushy Pond on a hot summer’s day",
      "caption": "Rushy Pond on a hot summer's day"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Duddle_Heath_-_geograph.org.uk_-_396031.jpg",
      "title": "Jim Champion / Duddle Heath",
      "caption": "Duddle Heath. Looking across Duddle Heath from the permissive path along the route of the Roman Road through Puddletown Forest. This area has been cleared of scrub and conifers in order to restore the heathland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Permissive_path_on_the_Roman_Road%2C_Bhompston_Heath_-_geograph.org.uk_-_398035.jpg",
      "title": "Jim Champion / Permissive path on the Roman Road, Bhompston Heath",
      "caption": "Permissive path on the Roman Road, Bhompston Heath. This is a very well-preserved section of the Roman road that ran from Dorchester to Badbury Rings, and beyond (the Ackling Dyke). In this part of Puddletown Forest it has been kept clear of trees, making it a fire-break. This section of the road, between Rushy Pond and the Rainbarrows footpath, is a permissive footpath. In the novels and poems of Thomas Hardy, this Roman road on the heath is called the Icen Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Footpath_on_to_Duddle_Heath_-_geograph.org.uk_-_460611.jpg",
      "title": "Jonathan Billinger / Footpath on to Duddle Heath",
      "caption": "Footpath on to Duddle Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Monument_to_the_memory_of_Thomas_Hardy_-_geograph.org.uk_-_395622.jpg/256px-Monument_to_the_memory_of_Thomas_Hardy_-_geograph.org.uk_-_395622.jpg",
      "title": "Jim Champion / Monument to the memory of Thomas Hardy",
      "caption": "Monument to the memory of Thomas Hardy. This monument was erected to the memory of the author Thomas Hardy by \"a few of his American admirers\" in 1931. He was born in the adjacent cottage on 2 June 1840, and in it he wrote \"Under the greenwood tree\" and \"Far from the madding crowd\". The track in the background leads to Puddletown Forest along Black Bottom. The heath on the right is Bhompston Heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Disused_pit%2C_Yellowham_Hill%2C_Puddletown_Forest_-_geograph.org.uk_-_395597.jpg",
      "title": "Jim Champion / Disused pit, Yellowham Hill, Puddletown Forest",
      "caption": "Disused pit, Yellowham Hill, Puddletown Forest. Looking into a disused pit on the east-facing slope of Yellowham Hill. The sign on the left warns that the area is used by off-road cyclists, and contains 'conditions' that the mountain bikers have to agree to if they use this area. This area of the forest is planted with beech."
    }
  ],
  "distance_km": 3.4,
  "description": "This walk visits Thorncombe Woods, Duddle Heath and Thomas Hardy's cottage, near Dorchester. It's a lovely area for a stroll with miles of woodland trails, a pretty pond and decent views from the elevated heathland area. There's also lots of wildlife to look out for including Dartmoor ponies, deer and various woodland birds. Start the walk from the car park at the Dorset Council Hardy's Birthplace Visitor Centre in Higher Brockampton. Take time to explore the centre before you start the walk. It contains interesting displays about the life and works of Thomas Hardy and his connection to the local landscape. From the centre it is a short walk to Hardy's Cottage where the author was born in 1840. The delightful cob and thatch cottage is where he wrote some of his classic novels including 'Under the Greenwood Tree' and 'Far from the Madding Crowd'. The house is surrounded by lovely gardens where you can enjoy a pleasant stroll before a longer walk in the adjacent woods. The paths head south east from the cottage onto Duddle Heath, passing the pretty Rushy Pond on the way. There is an undulating path on the heath with splendid views over the landscapes which would have inspired much of Hardy's writing. After exploring the heath the route then returns to the car park on more peaceful woodland trails. The woods form part of the expansive Puddletown Forest. You can extend your walking on miles of trails here. Athelhampton House is not far from the woods. Here you can explore the beautiful parkland and gardens surrounding the 15th century Athelhampton House",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the visitor centre there's a lovely on site cafe. They use good quality local produce to create a number of home made dishes. On the north eastern edge of the forest you'll find the little village of Puddletown. If you prefer a pub lunch you could try the Blue Vinny pub here, which is named after the local Dorset cheese. It's a fine place serving decent Mediterranean food with a lovely garden area to relax in on warmer days. You can find them at 12 The Moor with a postcode of DT2 8TE for your sat navs. You can also enjoy a stroll around the pretty village where you'll find thatched cottages and a noteworthy church. The historic church of St Mary dates to the Norman period, though much of the building we can see today a result of rebuilding in the 15th century. Inside there's a splendid 12th century font which is well worth seeing if you have time."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and the surrounding Puddletown forest are a great place for dog walking. The cafe and pub mentioned above are also very dog friendly. Dogs should be under close control in the grazing unit with the Dartmoor Ponies. There are also some seasonal restrictions with more information available at the visitor centre."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the south west of the woods you'll find the town of Dorchester where there are some riverside trails along the River Frome. The Dorchester Walk starts at the train station in the town and visits the Frome Watermeadows around Stinsford before heading to the woods and the cottage. Just to the south west of the town there's one of the highlights of the area at Maiden Castle. There are splendid views over the area from the top of this elevated Iron Age hill fort. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/k142YvoFaPw",
  "county": "Dorset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}