{
  "objectID": "356bcc05f03ab511653ebe8665af82c3",
  "created_at": "2024-12-19T13:45:49.815651+00:00",
  "ref": "rickmansworth-walking-route",
  "title": "Rickmansworth River, Lakes and Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Grand_Union_Canal_in_Rickmansworth_-_geograph.org.uk_-_603417.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/356bcc05f03ab511653ebe8665af82c3.gpx",
  "_geoloc": {
    "lat": 51.632720121,
    "lng": -0.4759548567
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Grand_Union_Canal_in_Rickmansworth_-_geograph.org.uk_-_603417.jpg",
      "title": "Nigel Cox / Grand Union Canal in Rickmansworth, via Wikimedia Commons",
      "caption": "Grand Union Canal in Rickmansworth. The bridge on the left carries the towpath over the River Colne which diverges from the Grand Union Canal at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Grand_Union_Canal_Rickmansworth_-_geograph.org.uk_-_27935.jpg",
      "title": "Jack Hill / Grand Union Canal  Rickmansworth, via Wikimedia Commons",
      "caption": "The aquadrome park is just to the right of the tow path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/River_Colne%2C_Batchworth_Lake_weir_-_geograph.org.uk_-_1244901.jpg",
      "title": "Nigel Cox / River Colne: Batchworth Lake weir, via Wikimedia Commons",
      "caption": "River Colne: Batchworth Lake weir. Old Ordnance Survey maps show this as a public footpath crossing of the Colne. Modern health and safety considerations have however forced the closure of that opportunity and the footbridge is now firmly sealed with security railings. Batchworth Lake is visible beyond the river to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Batchwood_Lake_at_the_Aquadrome_Rickmansworth_-_geograph.org.uk_-_27933.jpg",
      "title": "Jack Hill / Batchwood  Lake at the Aquadrome  Rickmansworth, via Wikimedia Commons",
      "caption": "Bury Lake at the Aquadrome"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Ye_Olde_Greene_Manne%2C_Rickmansworth%2C_Hertfordshire-geograph-4323274.jpg",
      "title": "Robin Webster / Ye Olde Greene Manne",
      "caption": "Ye Olde Greene Manne. Pleasantly positioned on Batchworth Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Rickmansworth_Batchworth_Lake_-_geograph.org.uk_-_1395810.jpg",
      "title": "Mike Bruce / Rickmansworth Batchworth Lake",
      "caption": "Rickmansworth Batchworth Lake"
    }
  ],
  "distance_km": 2.8,
  "description": "The town of Rickmansworth is ideally situated for some lovely waterside walking. This circular walk takes you along the Grand Union Canal, the River Colne, Stocker's Lake and Batchworth Lake. On the way there's rushing weirs, narrowboats and lots of wildlife to see on the lakes. Start the walk from the car park located between Bury Lake and Batchworth Lake, a short distance south of the town centre and tube station. You can then follow a series of paths around the Rickmansworth  Aquadrome, a public park and Local Nature Reserve. As well as the water features the park includes open grassland and areas of woodland with trees such as oaks and willows. It's good for wildlife too with herons, moorhens and gatekeeper butterflies to look out for. Part of this route uses the Colne Valley Trail. You could continue west along this path to visit Stocker's Lake and Lynsters Lake. The River Chess also passes through the area so you could pick up the Chess Valley Walk to continue your waterside walking. If you head north along the canal you could enjoy views of the River Gade and visit Whippendell Woods where there's some nice peaceful woodland trails to try.",
  "video_url": "https://www.youtube.com/embed/rV6WN5tsFbw",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England"
}