{
  "created_at": "2025-01-05T23:54:11.425819+00:00",
  "objectID": "356bcc05f03ab511653ebe8665af82c3",
  "ref": "rickmansworth-walking-route",
  "title": "Rickmansworth River, Lakes and Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Grand_Union_Canal_in_Rickmansworth_-_geograph.org.uk_-_603417.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/356bcc05f03ab511653ebe8665af82c3.gpx",
  "_geoloc": {
    "lat": 51.632720121,
    "lng": -0.4759548567
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Grand_Union_Canal_in_Rickmansworth_-_geograph.org.uk_-_603417.jpg",
      "title": "Nigel Cox / Grand Union Canal in Rickmansworth, via Wikimedia Commons",
      "caption": "Grand Union Canal in Rickmansworth. The bridge on the left carries the towpath over the River Colne which diverges from the Grand Union Canal at this point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Grand_Union_Canal_Rickmansworth_-_geograph.org.uk_-_27935.jpg",
      "title": "Jack Hill / Grand Union Canal Rickmansworth, via Wikimedia Commons",
      "caption": "The aquadrome park is just to the right of the tow path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/River_Colne%2C_Batchworth_Lake_weir_-_geograph.org.uk_-_1244901.jpg",
      "title": "Nigel Cox / River Colne: Batchworth Lake weir, via Wikimedia Commons",
      "caption": "River Colne: Batchworth Lake weir. Old Ordnance Survey maps show this as a public footpath crossing of the Colne. Modern health and safety considerations have however forced the closure of that opportunity and the footbridge is now firmly sealed with security railings. Batchworth Lake is visible beyond the river to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Batchwood_Lake_at_the_Aquadrome_Rickmansworth_-_geograph.org.uk_-_27933.jpg",
      "title": "Jack Hill / Batchwood Lake at the Aquadrome Rickmansworth, via Wikimedia Commons",
      "caption": "Bury Lake at the Aquadrome"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Ye_Olde_Greene_Manne%2C_Rickmansworth%2C_Hertfordshire-geograph-4323274.jpg",
      "title": "Robin Webster / Ye Olde Greene Manne",
      "caption": "Ye Olde Greene Manne. Pleasantly positioned on Batchworth Heath"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Rickmansworth_Batchworth_Lake_-_geograph.org.uk_-_1395810.jpg",
      "title": "Mike Bruce / Rickmansworth Batchworth Lake",
      "caption": "Rickmansworth Batchworth Lake"
    }
  ],
  "distance_km": 2.8,
  "description": "The town of Rickmansworth is ideally situated for some lovely waterside walking. This circular walk takes you along the Grand Union Canal, the River Colne, Stocker's Lake and Batchworth Lake. On the way there's rushing weirs, narrowboats and lots of wildlife to see on the lakes. Start the walk from the car park located between Bury Lake and Batchworth Lake, a short distance south of the town centre and tube station. You can then follow a series of paths around the Rickmansworth Aquadrome, a public park and Local Nature Reserve. As well as the water features the park includes open grassland and areas of woodland with trees such as oaks and willows. It's good for wildlife too with herons, moorhens and gatekeeper butterflies to look out for. Part of this route uses the Colne Valley Trail. You could continue west along this path to visit Stocker's Lake and Lynsters Lake. The River Chess also passes through the area so you could pick up the Chess Valley Walk to continue your waterside walking. If you head north along the canal you could enjoy views of the River Gade and visit Whippendell Woods where there's some nice peaceful woodland trails to try.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At Batchworth Lock you can enjoy some refreshments at the Cafe at Lock 81. They have a variety of sandwiches, hot food, hot and cold drinks, chocolate, crisps and sweets. There's also the adjacent Canal Centre with a wealth of information and the excellent Little Union Canal. This miniature working model canal shows how a lock and canal works. You can find the cafe at 99 Church Street with a postcode of WD3 1JJ for your sat navs. The cafe is also dog friendly if you have your canine friend with you. If you fancy a pub lunch there's Ye Olde Greene Manne on Batchworth Heath, just to the south of the lake. The 18th century inn is a historic country pub with a beautiful garden. It has starred in a variety of TV and film productions such as Genevieve (1952), Withnail & I, Raiders of the Lost Ark and Midsomer Murders."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north west you could pay a visit to the picture postcard village of Sarratt. The delightful settlement is well worth a visit with a pretty village green, quaint old cottages, a pond, a fine old pub and waterside trails along the River Chess Valley. On the eastern side of the town you can pick up the Croxley Green Boundary Walk. This waymarked circular walk explores the area around the worthy village, visiting the canal and the River Gade on the way. Also in Hillingdon is the popular Celandine Route. The trail runs along the River Pinn from Cowley to Pinner. It is named after the pretty Lesser Celandine flowers you can see on the walk. For more walking ideas in the area see the Chilterns Walks and the Hertfordshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/rV6WN5tsFbw",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Rickmansworth Aquadrome Local Nature Reserve, Goral Mead, The Cedars Estate, Batchworth, Rickmansworth, Three Rivers, Hertfordshire, England, WD3 1BP, United Kingdom",
  "postcode": "WD3 1BP",
  "district": "Three Rivers",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "woodland",
    "grassland",
    "water"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "historical sites",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}