{
  "created_at": "2025-01-06T01:53:54.215307+00:00",
  "objectID": "35dac309c5cb1e5d82a9b711683ebfcb",
  "ref": "sand-point-walking-route",
  "title": "Sand Point Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sand_Point_4_-_geograph.org.uk_-_1403646.jpg",
  "nearby": [
    {
      "description": "Weston Woods",
      "objectID": "2d8d38654e17da9203411b0ab4d12228",
      "ref": "weston-woods-walking-route"
    },
    {
      "description": "Brean Down",
      "objectID": "d1f5fb4be2ed4c5b94095a405585288a",
      "ref": "brean-down-walking-route"
    },
    {
      "description": "West Mendip Way",
      "objectID": "ae4e6d155e5bd663f57deea08ad1ed66",
      "ref": "west-mendip-way-walking-route"
    },
    {
      "description": "Clevedon to Weston-Super-Mare",
      "objectID": "3b9f923b8ddd47a03a59c29f7dae7677",
      "ref": "clevedon-to-weston-super-mare-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/35dac309c5cb1e5d82a9b711683ebfcb.gpx",
  "_geoloc": {
    "lat": 51.3888126665,
    "lng": -2.9642336865
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sand_Point_4_-_geograph.org.uk_-_1403646.jpg",
      "title": "Jonathan Billinger / Sand Point 4",
      "caption": "Looking east back along the rocky peninsula with Swallow Cliff and Sand Bay to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Ridge_near_Sand_Point_-_geograph.org.uk_-_904873.jpg",
      "title": "Trevor Harris / Ridge near Sand Point",
      "caption": "Ridge near Sand Point. This small peninsula at the northern end of Sand Bay is owned by the National Trust. On a summer's day such as this it is idyllic with a mass of wild flowers - wild thyme, saxifrages, thrift, etc - and insects, with views all around - across the Bristol Channel, across Sand Bay towards Weston-Super-Mare. This view looks east along the ridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Coastline_of_Middle_Hope_-_geograph.org.uk_-_1403529.jpg",
      "title": "Jonathan Billinger / Coastline of Middle Hope",
      "caption": "Coastline of Middle Hope. Looking north-east towards St. Thomas's Head with the cliffs at Clevedon in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Coastline_of_Middle_Hope_-_geograph.org.uk_-_1403548.jpg",
      "title": "Jonathan Billinger / Coastline of Middle Hope",
      "caption": "Coastline of Middle Hope. Looking west from near St. Thomas's Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/MOD_facility_at_St._Thomas%27s_Head_-_geograph.org.uk_-_1403544.jpg",
      "title": "Jonathan Billinger / MOD facility at St. Thomas's Head",
      "caption": "MOD facility at St. Thomas's Head. Looking east towards Woodspring Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Woodspring_Priory_Barn_circa_50_metres_north_west_of_priory_church.JPG/512px-Woodspring_Priory_Barn_circa_50_metres_north_west_of_priory_church.JPG",
      "title": "Rodw, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Woodspring Priory Barn circa 50 metres north west of priory church"
    }
  ],
  "distance_km": 5.5,
  "description": "Enjoy fine views across the Bristol Channel to Wales on this coastal walk on the edge of the Mendip Hills in Somerset. Sand Point is an extraordinary peninsula stretching out from Middle Hope over the Bristol Channel. The area is geologically significant with carboniferous limestone and unusual volcanic intrusions. It is also historically fascinating with bowl barrow and disc barrow dating from late Neolithic or Bronze Age and the site of a likely motte-and-bailey castle. It's also the site of Woodspring Priory, a former Augustinian priory, founded in the early 13th century. The area is managed by the National Trust and is a popular place for walkers with its wonderful views towards Flat Holm island, South Wales, Clevedon, the Second Severn Crossing and the Severn Bridge. There's also lots of wildlife to look out for with various coastal birds visiting the bays below. Keep your eyes peeled for curlews, little egrets, redshank and sandpipers as you make your way across the headland. Sand Point is located just to the north of Weston-Super-Mare, near the village of Kewstoke. You can start your walk from the Sand Point car park at the end of Beach Road, next to the lovely Sand Bay. Then follow the footpath east towards St Thomas Head, passing Woodspring Priory on the way. From here there's nice views down to Woodspring Bay and up the coast to Clevedon. After taking in the views from St Thomas Head you turn west and head back towards Middle Hope. On the way you can descend to the pretty beach where you can look out for seals. Also look out for the fascinating volcanic rock formations known as pillow lavas, formed as molten lava cooled quickly as it flowed under the sea. The walk finishes by climbing towards Swallow Cliff where you reach a height of about 130ft, with great views over Sand Bay to enjoy. From the high point you descend back to the finish point at the car park. To extend your walking in the area you could head south and visit Worlebury Hill where there are nice views over Weston-Super-Mare and woodland trails in the pretty Weston Woods. In Weston-Super-Mare you can also pick up the West Mendip Way long distance trail and explore the Mendip Hills. You could also visit the splendid Brean Down which is a similarly beautiful coastal promontory.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the summer months there's usually an ice cream van on site where you can pick up some refreshments. Just to the south of the reserve there's Captains Cabin Bar & Restaurant for something more substantial. It's in a fine location, right on the coast near the old Birnbeck Pier. There's a lovely terrace area where you can enjoy a drink with sea views. They also do a fine Sunday roast if you are feeling peckish. You can find them on 51 Birnbeck Road with a postcode of BS23 2EF for your sat navs. You could also stroll down to the pier which is notable as the only pier in the country linking the mainland to an island. The Grade II listed pier dates from 1867 and is located south of the reserve. The pier has been closed to the public since 1994 and is now on the Buildings at Risk Register. Sadly it remains in a largely derelict state."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking so you will probably see other owners on your visit. The Sand Bay beach and the nearby Weston Woods are also fine dog walking areas."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Weston-Super-Mare Walk starts at the Grand Pier from the town. It visits the old Birnbeck Pier and Sand Point before heading to Weston Woods. It's a nice way of visiting the reserve and some of the other local highlights from the town. For more walking ideas in the area see the Somerset Walks and the Mendip Hills Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jxU5lXmc8Zc",
  "postcode": "BS22 9UG",
  "district": null,
  "county": "North Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sand Point, Beach Road, Sand Bay, Kewstoke, North Somerset, England, BS22 9UG, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "beach",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}