{
  "created_at": "2025-01-06T01:02:42.426506+00:00",
  "objectID": "363ee78a1c92cc96afd9561d72428d2c",
  "ref": "chanctonbury-ring-walking-route",
  "title": "Chanctonbury Ring Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Chanctonbury_Ring_3.jpg/512px-Chanctonbury_Ring_3.jpg",
  "nearby": [
    {
      "description": "Clapham Wood",
      "objectID": "74be985779665723dfeb920edab7b887",
      "ref": "clapham-wood-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "d4b88df88db2f1b892c7f895ec7c1273",
      "ref": "the-south-downs-way-cycle-route"
    },
    {
      "description": "Cissbury Ring",
      "objectID": "c8d32d89ca24d6ce2b2a0c959fea1329",
      "ref": "cissbury-ring-walking-route"
    },
    {
      "description": "Amberley Circular Walk",
      "objectID": "dfc70c8eaadf50af80a5e1b81eba1291",
      "ref": "amberley-circular-walk-walking-route"
    },
    {
      "description": "Hassocks Walk",
      "objectID": "c9ca81fd1023b84efb93890cfb2f0221",
      "ref": "hassocks-walking-route"
    },
    {
      "description": "Rackham Woods",
      "objectID": "3683204c24f53c6c8d8fb76776c247ce",
      "ref": "rackham-woods-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/363ee78a1c92cc96afd9561d72428d2c.gpx",
  "_geoloc": {
    "lat": 50.8965057169,
    "lng": -0.4085340812
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Chanctonbury_Ring_3.jpg/512px-Chanctonbury_Ring_3.jpg",
      "title": "By Poliphilo (Own work) [CC0], via Wikimedia Commons",
      "caption": "A view of the footpath on the western approach in the summer of 2016. The ring has been associated with hauntings, fairies and UFOs. The trees were planted in the earthworks by the Goring family from Wiston House below in around 1760 though most of those were lost in the hurricane of 1987. However, a descendent of Charles Goring replanted the crown with beech trees soon after."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Chanctonbury_Ring.jpg",
      "title": "Jamie Kitson at the English language Wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "A group of walkers with their dogs, make their way up to the site in December 2004"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Chanctonbury_Ring_-_geograph.org.uk_-_991317.jpg",
      "title": "Simon Carey / Chanctonbury Ring",
      "caption": "View of the hill in the early autumn of 2008. Chanctonbury Hill is the highest point here and affords views to the North Downs and the Isle of Wight, you can even make out the towers of Fawley Oil Refinery in the evening sun. First inhabited by tribesman from the Bronze Age, the defensive works are from the Iron Age, whilst the Romans built a temple in the middle and the Saxons used it as a fort. Throughout the ages it has been used as a beacon and had become a tourist attraction by the early 19th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Fascinating_Tree_en_route_to_Chanctonbury_Ring_Fort_-_geograph.org.uk_-_4505.jpg",
      "title": "Pam Brophy / Fascinating Tree en route to Chanctonbury Ring Fort",
      "caption": "Fascinating Tree en route to Chanctonbury Ring Fort. This tree is in the section of woods near the reservoir near the car park in the extreme south and centre of the grid square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Chanctonbury_Hill_-_geograph.org.uk_-_3563989.jpg",
      "title": "Chanctonbury Hill by Simon Carey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Chanctonbury Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Disused_Chalk_Pits%2C_Chanctonbury_Hill_-_geograph.org.uk_-_3486632.jpg",
      "title": "Disused Chalk Pits, Chanctonbury Hill by Simon Carey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Disused Chalk Pits on the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Cross_Dyke%2C_Chanctonbury_Hill_-_geograph.org.uk_-_991395.jpg",
      "title": "Simon Carey / Cross Dyke, Chanctonbury Hill",
      "caption": "Cross Dyke. A ditch possibly associated with the Iron Age fort nearby. Viewed where the South Downs Way crosses it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/The_South_Downs_Way_south_east_of_Chanctonbury_Ring_-_geograph.org.uk_-_2454930.jpg/512px-The_South_Downs_Way_south_east_of_Chanctonbury_Ring_-_geograph.org.uk_-_2454930.jpg",
      "title": "The South Downs Way south east of Chanctonbury Ring by Tim Heaton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The South Downs Way south east of Chanctonbury Ring"
    }
  ],
  "distance_km": 6.0,
  "description": "Climb to this early Iron Age hill fort on the South Downs and enjoy wonderful views over the surrounding countryside and coast. The hill is also an important area for flora and fauna, including the protected Great Crested Newt which can be found in the dew pond on the hill. Chanctonbury hill stands at a height of 238 metres (781 ft) a few miles north of the coastal town of Worthing. You can start this circular walk from the car park on Washington Bostal, just off the A24. From here you pick up the South Downs Way and follow it east to the hill. After exploring the fort and taking in the views you descend to Chalkpit Wood where you follow the Wiston Bostal track towards Chanctonbury Ring Rd. Here you turn west and follow a bridleway through woodland passing Owlscroft Barn and Combe Holt, before returning to the car park. A shorter alternative route is to start from the car park on Chanctonbury Ring Road and climb to the hill fort from there. If you would like to extend your walk then we recommend you head south from the hill to the nearby Cissbury Ring. The historic site can be reached by following a bridleway south from Chalkpit Wood for about 2 miles. It is the second largest hill fort in England, dating back to around 250 BC. You can also continue along the South Downs Way in either direction. Head west and you will come to Kithurst Hill, Springhead Hill and the village of Amberley. Head east and you will come to Bramber Castle on the River Adur. Also nearby is the mysterious Clapham Wood near the village of Clapham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head about half a mile north west of the hill and you'll come to the little village of Washington. Here you'll find The Frankland Arms pub where you can enjoy some refreshments after your exercise. The pub has a good menu and a nice beer garden to relax in on warmer days. You can find it on London Road at a postcode of RH20 4AL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and surrounding woodland are a great place for a dog walk. You'll probably see plenty of other owners with their pets on a fine day, as the photo below shows. The Frankland Arms pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Storrington Walk visits the fort from the nearby little town. It takes you onto the downs, climbing to Kithurst Hill and then making its way to the hill fort before returning via Washington. It's a nice way to visit the fort from the attractive town. For more walking ideas in the area see the Sussex Walks, South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/r4IcyPxgQsk",
  "postcode": "RH20 4AZ",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Washington SDW Trail Car Park, Washington Bostal, Washington, Horsham, West Sussex, England, RH20 4AZ, United Kingdom",
  "district": "Horsham",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "hiking"
  ]
}