{
  "created_at": "2025-01-06T10:30:55.827941+00:00",
  "objectID": "36581a03c225a78eefff568313df61ce",
  "ref": "naseby-battlefield-walk-walking-route",
  "title": "Naseby Battlefield Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Naseby_battlefield_from_the_Royalist_positions_on_Dust_Hill_-_geograph.org.uk_-_888335.jpg",
  "nearby": [
    {
      "description": "Naseby Reservoir",
      "objectID": "00656d70f0fd5dfcb99cae9025e5ed63",
      "ref": "naseby-reservoir-walking-route"
    },
    {
      "description": "Sulby Reservoir",
      "objectID": "c8464dee08092b6cb6ff361b84500203",
      "ref": "sulby-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/36581a03c225a78eefff568313df61ce.gpx",
  "_geoloc": {
    "lat": 52.3957571198,
    "lng": -0.9901064729
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Naseby_battlefield_from_the_Royalist_positions_on_Dust_Hill_-_geograph.org.uk_-_888335.jpg",
      "title": "D Gore / Naseby battlefield from the Royalist positions on Dust Hill, via Wikimedia Commons",
      "caption": "Naseby battlefield from the Royalist positions on Dust Hill. View looking south across Broadmoor valley to the Parliamentary Army positions on the Mill Hill ridge. The panorama is viewed from roughly where Astley's infantry were located at the centre of the King's Army positions on Dust Hill at the start of the battle. The Sibbertoft-Naseby track can be seen on the left of the photo, beyond and to the left of which Cromwell's cavalry were stationed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Naseby_1645_-_the_view_of_a_King%27s_pikeman_leading_the_first_attack_on_the_Roundhead_centre_-_geograph.org.uk_-_948250.jpg",
      "title": "D Gore [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The view of a King's pikeman leading the first attack on the Roundhead centre. The final slope of Mill Hill up which the King's infantry, supported by Langdale's cavalry, advanced to attack Skippon's infantry in the first phase of the battle. Skippon's front line stood roughly along the line of the hedge behind the Roundhead monument. His troops were inexperienced and initially fell back. Skippon was wounded but the situation was retrieved when General Fairfax threw in reserves and himself took command of the centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Naseby_1645_-_Cromwell%27s_final_cavalry_charge_-_geograph.org.uk_-_948252.jpg",
      "title": "D Gore / Naseby 1645 – Cromwell’s final cavalry charge, via Wikimedia Commons",
      "caption": "Cromwell's final cavalry charge view from the approximate position occupied by Cromwell's cavalry on the right wing of the Parliamentary army looking north across Broadmoor valley. This is the slope down which he led the final devastating charge that broke the King's left wing under Sir Marmaduke Langdale. Cromwell's cavalry then wheeled left across the Naseby-Sibbertoft track (now a road visible in the centre of the photo) to attack the enemy infantry in their exposed flank - and won the day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Naseby_1645_-_the_Cavalier_monument_-_geograph.org.uk_-_948267.jpg/256px-Naseby_1645_-_the_Cavalier_monument_-_geograph.org.uk_-_948267.jpg",
      "title": "D Gore / Naseby 1645 – the Cavalier monument, via Wikimedia Commons",
      "caption": "The Cavalier monument. This obelisk was erected in 1823 by the Lord of the Manor of Naseby. It stands on the north-east side of the village about a mile from the battlefield and reminds \"British subjects never to swerve from the allegiance due to their legitimate monarch\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Naseby_1645_-_the_Roundhead_monument_-_geograph.org.uk_-_948256.jpg",
      "title": "D Gore / Naseby 1645 – the Roundhead monument, via Wikimedia Commons",
      "caption": "The Roundhead monument. This was erected by the Cromwell Association in 1946 on the northern slope of Mill Hill a mile north of Naseby village. It is roughly at the position that the Roundhead infantry front line stood to face Astley's infantry advancing up the slope on the right towards them"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Cromwell_Cottage%2C_Naseby_20%2C4%2C2007.JPG/512px-Cromwell_Cottage%2C_Naseby_20%2C4%2C2007.JPG",
      "title": "Stavros1 at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Cromwell Cottage in the Village of Naseby"
    }
  ],
  "distance_km": 15.0,
  "description": "This circular walk from the village of Naseby takes you around the site of the Battle of Naseby. The battle was fought on 14 June 1645 between the main Royalist army of King Charles I and the Parliamentarian New Model Army. It was a decisive battle in the Civil War as the main Royalist military force had been shattered at Naseby. Starting from the village the you head north along Naseby Road which runs along the Naseby Field. You will soon come to the Cromwell Monument where there is an information board and a short footpath onto the field. The route continues to Sibbertoft where you can pick up the Jurassic Way long distance trail. Follow it south west and it will take you to Sulby Reservoir and Welford Reservoir. Near Welford you pick up Shakespeare's Avon Way and follow it along the River Avon near the village. You then follow the Naseby Road back to the village where the route finishes. To continue your walking in the area head west from the village and visit Naseby Reservoir .",
  "details": [],
  "video_url": "https://www.youtube.com/embed/BvCkng-xq4s",
  "district": "Naseby",
  "county": "West Northamptonshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}