{
  "created_at": "2025-01-05T23:35:51.519799+00:00",
  "objectID": "36e7fb5e4f927dfaec7f70ff6239a05d",
  "ref": "darent-valley-path-walking-route",
  "title": "Darent Valley Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Footpath_junction_on_Darenth_Valley_Path_-_geograph.org.uk_-_1448034.jpg",
  "nearby": [
    {
      "description": "Farningham Woods",
      "objectID": "8334604406864eee773de1befddd7d30",
      "ref": "farningham-woods-walking-route"
    },
    {
      "description": "Lullingstone Country Park",
      "objectID": "e6b6a8d13f2e950a0c32b21fba6e720c",
      "ref": "lullingstone-country-park-walking-route"
    },
    {
      "description": "Darenth Country Park",
      "objectID": "ca76f114f4bbdd665ca806615ad878bf",
      "ref": "darenth-country-park-walking-and-cycle-route"
    },
    {
      "description": "Sevenoaks",
      "objectID": "02f0bd75ca5973591691858c9766256c",
      "ref": "sevenoaks-walking-route"
    },
    {
      "description": "Eynsford Circular Walk",
      "objectID": "4f653741948827d8c80ebe8a1a99b1a5",
      "ref": "eynsford-circular-walk-walking-route"
    },
    {
      "description": "Sevenoaks Wildlife Reserve",
      "objectID": "ad46f5b33b3a6572cf2399e95099653a",
      "ref": "sevenoaks-wildlife-reserve-walking-route"
    },
    {
      "description": "Chipstead Lake",
      "objectID": "c5f3290e7b70b5597e38eb9ea0e1c469",
      "ref": "chipstead-lake-walking-route"
    },
    {
      "description": "Shoreham to Eynsford Walk",
      "objectID": "6d78e5f2959862941a5fbdff592af7bf",
      "ref": "shoreham-to-eynsford-walk-walking-route"
    },
    {
      "description": "Otford Circular Walk",
      "objectID": "40d25f7370980e10cfbf78b252ebfae4",
      "ref": "otford-circular-walk-walking-route"
    },
    {
      "description": "Dartford Heath",
      "objectID": "c33e818afeceeee7abf8a552a415d852",
      "ref": "dartford-heath-walking-route"
    },
    {
      "description": "Cray Riverway",
      "objectID": "9c7bf4636e5dc113b6c46144c54f3196",
      "ref": "cray-riverway-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/36e7fb5e4f927dfaec7f70ff6239a05d.gpx",
  "_geoloc": {
    "lat": 51.2774913587,
    "lng": 0.1824971873
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Footpath_junction_on_Darenth_Valley_Path_-_geograph.org.uk_-_1448034.jpg",
      "title": "David Anstiss / Footpath junction on Darenth Valley Path, via Wikimedia Commons",
      "caption": "Footpath junction on the trail. The long distance path heads past Sevenoaks Wildlife Trust land (on right) towards the London Road. Another path heads left to Pounsley Road, Dunton Green."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Darent_Valley_Path_-_geograph.org.uk_-_1720451.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Darent Valley Path, in the Sevenoaks Wildlife Reserve. A 19 mile walk from Sevenoaks Station to the River Thames at Dartford. The River Darent flows from its source in the Greensand hills, south of Westerham, to join the Thames, north of Dartford. The walk is through a varied landscape of riverside fringed with ancient willows, hop gardens and cornfields, secretive woodlands, downland carpeted with wild flowers and expanses of marshland and has the added attractions of Roman remains, majestic viaducts, historic houses, old mills and picturesque villages with beautiful churches. There is an alternative start point at Chipstead (TQ500561)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/River_Darent_-_geograph.org.uk_-_1720419.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Darent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Darent_Valley_Path_%283%29_-_geograph.org.uk_-_1720461.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Darent Valley Path near Sevenoaks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Darenth_Valley_Path_heads_to_Chipstead_-_geograph.org.uk_-_1450241.jpg",
      "title": "David Anstiss / Darenth Valley Path heads to Chipstead, via Wikimedia Commons",
      "caption": "Darenth Valley Path heads to Chipstead. The long distance path, passes Chipstead Lake (on the left) and Chevening St Botolphs C of E Primary School playing field (on the right). The path heads to Chevening Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Darenth_Valley_Path_towards_Chipstead_-_geograph.org.uk_-_1450209.jpg",
      "title": "David Anstiss / Darenth Valley Path towards Chipstead, via Wikimedia Commons",
      "caption": "Darenth Valley Path towards Chipstead. The long distance path heads along a field boundary, then goes around Chipstead Lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/The_River_Darent_north_of_Shoreham_-_geograph.org.uk_-_1732095.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The River Darent north of Shoreham. The Darent Valley Path is 19 miles (31 km) long, following the River Darent from Sevenoaks station through the Kent Downs Area of Outstanding Natural Beauty to the banks of the River Thames at Dartford. The River Darent flows from its source in the Greensand hills, south of Westerham, to join the Thames, north of Dartford. The walk is through a varied landscape of riverside fringed with ancient willows, hop gardens and cornfields, secretive woodlands, downland carpeted with wild flowers and expanses of marshland and has the added attractions of Roman remains, majestic viaducts, historic houses, old mills and picturesque villages with beautiful churches. There is an alternative start point at Chipstead"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Stile_on_the_Darent_Valley_Path_north_of_Shoreham_-_geograph.org.uk_-_1732113.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stile on the Darent Valley Path north of Shoreham"
    }
  ],
  "distance_km": 31.0,
  "description": "Travel through the Kent Downs AONB and along the Darent River on this beautiful walk or cycle. You start off near Sevenoaks Railway Station and head north through the delightful tranquility of the Sevenoaks Wildlife Reserve. The route continues towards Otford (with its 16th century Palace) and then onto Shoreham where you'll pass Lullingstone Country Park. As one of the oldest family estates in England (1497) Lullingstone Castle has an interesting history and attractive gardens making it well worth a visit. The next section takes you on to Eynsford and Farningham where the river is particularly attractive. This section passes Eynsford Castle and the pretty Farningham Woods Nature Reserve, which is worth a small detour from the path. From Farningham you enter the outskirts of London, passing Darenth Country Park and Dartford. You then finish at Dartford flood barrier - the world's second largest movable flood barrier. The route is also suitable for cyclists. It is part of the National Cycle Network as route 125.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route we recommend you stop at the splendid Bricklayers Arms at Chipstead Lake. The lakeside public house, includes three terraced cottages and has a fine menu. There's also a nice outdoor seating area with views overlooking the pretty village green and the lake. The pub's sign represents Sir Winston Churchill, an expert bricklayer and whose home was at nearby Chartwell. You can find it in the village at postcode TN132RZ for your sat navs. In Shoreham there are two historic 16th century pubs of some note. The Kings Arms is a traditional pub with low ceilings, history on the walls and a garden area. You can find it on Church St, with a postcode of TN14 7SJ. Also on Church Street is Ye Olde George Inn. It's dog friendly and also has a great history attached to it. There's a few good options for refreshments in Eynsford as well. The Riverside Tea Room is in a great location for some afternoon tea. There's a good menu and outdoor seating for warmer days. You can find it at postcode DA4 0AE.The Malt Shovel is another nice choice. The friendly pub does great food and also has a nice beer garden to relax in. You can find it at postcode DA4 0EP your sat navs. The Rising Sun in Otford is another good option. They have a fantastic garden area with fine views over the North Downs countryside. It's a great spot to relax in on fine summer days. You can find the pub just to the west of the village on Twitton Lane with a postcode of TN14 5JS for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the northern end of the route the trail links with the Cray Riverway. This walk will take you south along the River Cray to the source at Orpington."
    }
  ],
  "postcode": "TN13 1DW",
  "district": "Sevenoaks",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hitchen Hatch Lane, Kippington, Sevenoaks, Kent, England, TN13 1DW, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "park"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserves",
    "country park"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}