{
  "created_at": "2025-01-06T10:48:56.252480+00:00",
  "objectID": "37024468a65cd0e0340851a1785bfe47",
  "ref": "pendle-way-walking-route",
  "title": "Pendle Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Footbridge_on_the_Pendle_Way_-_geograph.org.uk_-_622729.jpg",
  "nearby": [
    {
      "description": "Pendle Hill",
      "objectID": "89e427ed61da701ed6b318b943b7e5a9",
      "ref": "pendle-hill-walking-route"
    },
    {
      "description": "Pendle Hill Witches Walk",
      "objectID": "9f64d0c7ac22466c6a6a4b99eab09626",
      "ref": "pendle-hill-witches-walk-walking-route"
    },
    {
      "description": "Blacko Tower",
      "objectID": "3c7dcedff9ed8759d3ed5769beea0b88",
      "ref": "blacko-tower-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/37024468a65cd0e0340851a1785bfe47.gpx",
  "_geoloc": {
    "lat": 53.8542394527,
    "lng": -2.2103767906
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Footbridge_on_the_Pendle_Way_-_geograph.org.uk_-_622729.jpg",
      "title": "Alexander P Kapp / Footbridge on the Pendle Way",
      "caption": "Footbridge on the Pendle Way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pendle_Way_on_its_unexciting_climb_to_Pendle_Hill_%28geograph_3890008%29.jpg/512px-Pendle_Way_on_its_unexciting_climb_to_Pendle_Hill_%28geograph_3890008%29.jpg",
      "title": "John Slater / Pendle Way on its climb to Pendle Hill",
      "caption": "Pendle Way on its climb to Pendle Hill. Officially opened in 1987, the circular route spans 45 miles (72 km) and features a challenging ascent of 1,839 metres (6,033 feet), with the highest point reaching 557 metres (1,827 feet) on Pendle Hill. The path is rich in historical and cultural significance, with connections to the infamous seventeenth-century Pendle Witches, whose trials have left a lasting mark on the region's folklore. The trail also has ties to the Brontë sisters, who drew inspiration from the area's dramatic landscapes for their novels."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Pendle_Way_above_Reedley_%28geograph_2240177%29.jpg/512px-Pendle_Way_above_Reedley_%28geograph_2240177%29.jpg",
      "title": "Chris Heaton / Pendle Way above Reedley",
      "caption": "Pendle Way above Reedley. Walkers on the trail will encounter picturesque stone-built villages that are characteristic of East Lancashire and the South Pennines, as well as remnants of the area's weaving and lead mining industries. The route also takes in diverse natural scenery, including limestone meadows and the rugged millstone grit moorlands."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Pendle_Way_beside_Blacko_Water_%28geograph_3174280%29.jpg/512px-Pendle_Way_beside_Blacko_Water_%28geograph_3174280%29.jpg",
      "title": "Chris Heaton / Pendle Way beside Blacko Water",
      "caption": "Pendle Way beside Blacko Tower. This hill and monument sits just to the north of the village of Blacko. Also known as Stansfield Tower it was built in the late 19th century by John Stansfield, a local grocer who wanted to provide a viewpoint over Ribblesdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Pendle_Heritage_Centre%2C_Barrowford_-_geograph.org.uk_-_510629.jpg?20110205132843",
      "title": "Peter Worrell / Pendle Heritage Centre, Barrowford",
      "caption": "Pendle Heritage Centre, Barrowford. This historic house, once occupied by distant ancestors of Roger Bannister who ran the first four minute mile, now houses the Pendle Heritage Centre, restaurant, museum and shop. The centre is located at Park Hill, a historic two-storey former farmhouse that bears a date stone from 1661. However, the building itself evolved over a long period, with development spanning from the 16th century to the early 18th century. The centre features an 18th-century walled garden and a woodland walk and also houses the Pendle Arts Gallery. Park Hill has been meticulously restored using traditional building techniques, providing visitors with an insight into the historical development and adaptation of the house from the 15th century onwards. The centre, established in 1977, is one of the flagship projects of the Heritage Trust for the North West and attracts over 100,000 visitors annually. The permanent exhibitions at the centre include the story of Park Hill as a working farm, the history of the Bannister and Swinglehurst families who once lived there, and the infamous Pendle witches. Sir Roger Bannister, famous for breaking the four-minute mile, is a descendant of the Bannister family that once occupied the house. In 2012, to mark the 400th anniversary of the Pendle witches' trials, a new long-distance walking route called the Lancashire Witches Walk was established. Ten tercet waymarkers, designed by artist Stephen Raw and inscribed with verses of a poem by Poet Laureate Carol Ann Duffy, have been installed along the route, with the first marker located at Park Hill to signify the starting point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Barnoldswick%2C_Town_Square_-_geograph.org.uk_-_3494799.jpg/512px-Barnoldswick%2C_Town_Square_-_geograph.org.uk_-_3494799.jpg?20220507152318",
      "title": "Barnoldswick: Town Square by Dr Neil Clifton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barnoldswick: Town Square"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/00/Bancroft_engine_house_and_chimney_-_geograph.org.uk_-_1343955.jpg?20110228035327",
      "title": "Chris Allen / Bancroft engine house and chimney",
      "caption": "Bancroft engine house and chimney. This complex is all that remains of the last weaving shed built in Barnoldswick. The shed was closed in 1978 and the preserved engine house opened in 1982. The 600 horsepower cross compound engine is run at full speed and you get a real feel of what an operating mill engine was like. This is possibly the best view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Pendle_Way_near_Standridge_Farm_-_geograph.org.uk_-_3111051.jpg?20220123082236",
      "title": "Pendle Way near Standridge Farm by John Topping, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pendle Way near Standridge Farm"
    }
  ],
  "distance_km": 72.0,
  "description": "Follow the Pendle Way through Lancashire and visit Barnoldswick, Thornton-in-Craven, Wycoller, Reedley, Newchurch and Pendle Hill on this challenging walk. The climb to the 557 metre (1,827 ft) summit of Pendle Hill is a real highlight. There are fabulous views over the Pennines to the east, the Bowland Fells to the northwest, and the West Pennine Moors to the south. You also pass the beautiful Upper and Lower Ogden Reservoirs on this section of the walk. The area is famous for the Pendle Hill Witch Trials. These took place in 1612 when twelve people from the area were charged with the murders of ten people by the use of witchcraft. Ten were subsequently found guilty and executed by hanging.",
  "details": [],
  "postcode": "BB9 6JD",
  "district": "Pendle",
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Colne Road, Higherford, Barrowford, Pendle, Lancashire, England, BB9 6JD, United Kingdom",
  "state": "England"
}