{
  "objectID": "371970f0651307ba8d05d511a542270d",
  "created_at": "2024-12-19T12:27:21.040927+00:00",
  "ref": "horsey-windpump-and-horsey-mere-walking-route",
  "title": "Horsey Windpump and Horsey Mere Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_car_park_by_Horsey_windpump_-_geograph.org.uk_-_1103439.jpg",
  "nearby": [
    {
      "description": "Hickling Broad",
      "objectID": "2cbd23efa2661e0e242b3f902b2dd927",
      "ref": "hickling-broad-walking-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "Ludham",
      "objectID": "dc1dd90ff4adc12203c228e2ce9dc1c4",
      "ref": "ludham-walking-route"
    },
    {
      "description": "Sea Palling",
      "objectID": "0fdda5d404866540f6aff9f6731e4f0e",
      "ref": "sea-palling-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/371970f0651307ba8d05d511a542270d.gpx",
  "_geoloc": {
    "lat": 52.743589087,
    "lng": 1.6367514161
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/The_car_park_by_Horsey_windpump_-_geograph.org.uk_-_1103439.jpg",
      "title": "Evelyn Simak / The car park by Horsey windpump",
      "caption": "The car park by Horsey windpump"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Horsey_Windpump_%28geograph_6359900%29.jpg/512px-Horsey_Windpump_%28geograph_6359900%29.jpg",
      "title": "Michael Garlick / Horsey Windpump",
      "caption": "The present four storey mill was built in 1912, but a mill has stood on the site for over 200 years. The fully restored windpump, owned by the National Trust, is the only NT property in the Norfolk Broads which is open regularly. Horsey used to be a hotbed of smuggling and the sails of windmills were used for signalling in order to warn of approaching customs and excise men."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/View_across_Horsey_Mere_-_geograph.org.uk_-_1103435.jpg",
      "title": "Evelyn Simak / View across Horsey Mere",
      "caption": "View across Horsey Mere The Brayden Marshes adjoin its western edge (seen on the horizon, in adjacent grid square)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Horsey_Mere_-_geograph.org.uk_-_1103431.jpg",
      "title": "Evelyn Simak / Horsey Mere",
      "caption": "Horsey Mere. This view towards the northeastern edge of the mere was taken from the viewpoint at its southeastern edge. Horsey Mere is the only broad in Norfolk surrounded by a high level bank for which reason it is called a mere, rather than a broad. The term 'mere' originates from an old Dutch word meaning an artificial lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/All_Saints%27_church_in_Horsey_-_geograph.org.uk_-_1963304.jpg",
      "title": "All Saints' church in Horsey by Evelyn Simak, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "All Saints' church in Horsey. A round-tower church in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/The_Nelson_Head_pub%2C_Horsey_-_geograph.org.uk_-_1657668.jpg",
      "title": "Paul Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Nelson Head pub. A popular place to relax for locals, walkers and wildlife watchers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/View_along_The_Street_-_geograph.org.uk_-_1016399.jpg",
      "title": "Evelyn Simak / View along The Street",
      "caption": "View along The Street in Horsey village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Thatched_boat_house_on_Horsey_Mere%2C_Norfolk_-_geograph.org.uk_-_2989834.jpg/512px-Thatched_boat_house_on_Horsey_Mere%2C_Norfolk_-_geograph.org.uk_-_2989834.jpg",
      "title": "Thatched boat house on Horsey Mere, Norfolk by Richard Humphrey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Thatched boat house on the mere. The mere is part of the Broads national park area, and the Horsey Estate is part of the Norfolk Coast Area of Outstanding Natural Beauty (AONB). Horsey Estate was purchased by the National Trust from the Buxton family in 1948. The Buxton family still manage the estate in partnership with the National Trust and it is thanks to the fact that nature conservation has always been a priority for the Buxtons that Horsey remains an important place for wildlife. In winter Horsey Mere is an internationally important wildfowl refuge and home to thousands of ducks including teal, wigeon and pochard."
    }
  ],
  "distance_km": 5.0,
  "description": "A fine circular walk visiting an early 20th century drainage windmill on the Norfolk Broads with lovely waterside footpaths along Horsey Mere and other waterways. It's a beautiful area with reedbeds, marshes and the option of extending the walk to the nearby Horsey Beach where you can look out for grey seals and explore the dunes.  Horsey Dunes, together with the adjoining Winterton Dunes, also contain the largest colonies of dark green fritillary and grayling butterflies in Norfolk. The National Trust owns the mill so you can enjoy a climb to the top and enjoy fabulous views over the mere and surrounding broads. The area is also great for wildlife watching with Bitterns and Marsh Harrier to look out for in the air. Highlights on the walk include Horsey's thatched church with a Saxon round tower and fascinating interior. You will also pass the 18th century Brograve Mill. The mill is now a derelict Grade II listed building and the earliest surviving tower mill in the Broads. There's lots of good options for extending your walk. You could head just a mile to the west and visit Hickling Broad where you can pick up the Weavers' Way long distance trail. The trail runs around the broad before picking up delightful riverside paths along the River Thurne.",
  "video_url": "https://www.youtube.com/embed/0RiDcYTwhLo",
  "postcode": "NR29 4EE",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}