{
    "objectID": "37399b478ba102d4212750e3dd379c03",
    "created_at": "2024-12-18T01:25:59.254617+00:00",
    "ref": "tas-valley-way-walking-route",
    "title": "Tas Valley Way Walking Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/91/River_Yare%2C_Cringleford_-_geograph.org.uk_-_27721.jpg",
    "nearby": [
        {
            "description": "Ketts Country Walk",
            "objectID": "a755b10b7f8692ba2947f11bdc9e9ffd",
            "ref": "ketts-country-walk-walking-route"
        },
        {
            "description": "Wherryman's Way",
            "objectID": "b81d253a737b17ad07a0749a92ba69fa",
            "ref": "wherrymans-way-walking-route"
        },
        {
            "description": "Attleborough",
            "objectID": "1e988ff0790958e4adcd5f95c8ac548b",
            "ref": "attleborough-walking-route"
        },
        {
            "description": "Hethersett",
            "objectID": "cfeba38b0b9d7c8e4fb65d9ef2ab2bb2",
            "ref": "hethersett-and-swardeston-country-walk-walking-route"
        },
        {
            "description": "Caistor St Edmund",
            "objectID": "e52753381b6aae47ee83a5918b69e50b",
            "ref": "caistor-st-edmund-walking-route"
        },
        {
            "description": "Mulbarton",
            "objectID": "5278ebc4e6d00a2e45602f167a54687e",
            "ref": "mulbarton-walking-route"
        },
        {
            "description": "Cringleford",
            "objectID": "f8f91536ff750bd00737f248814dc281",
            "ref": "cringleford-walking-route"
        },
        {
            "description": "Yare Valley",
            "objectID": "0cec226e45ecad87de93b2e6c15634b8",
            "ref": "yare-valley-walking-route"
        },
        {
            "description": "Ketteringham Hall",
            "objectID": "201a04d922dc0ecd3ac644c4419cb3a2",
            "ref": "ketteringham-hall-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/D4A1E8C9C47D4A4C8025799E0040F1ED/$FILE/Tas Valley Way.gpx",
    "_geoloc": {
        "lat": 52.607050677,
        "lng": 1.2478815984
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/River_Yare%2C_Cringleford_-_geograph.org.uk_-_27721.jpg",
            "title": "Katy Walters / River Yare, Cringleford",
            "caption": "River Yare, Cringleford"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/The_Tas_Valley_Way_-_to_New_Buckenham_-_geograph.org.uk_-_1402826.jpg",
            "title": "Evelyn Simak / The Tas Valley Way - to New Buckenham",
            "caption": "Trail view to New Buckenham. This section of the Tas Valley Way leads in north-easterly direction before veering southerly and heading for New Buckenham. The trail is a long distance footpath which links Eaton and Attleborough. It connects with Kett's Country Walk and with the Yare Valley Walk - leading through a landscape which was shaped by the Enclosure Acts and where public access is now generally restricted to roads and public rights of way. The trail leads through 16 villages and past 16 churches. The walk starts by the ancient bridge at Cringleford and ends at St Mary's church in Attleborough."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/The_Tas_Valley_Way_-_to_Flordon_-_geograph.org.uk_-_1385277.jpg",
            "title": "Evelyn Simak / The Tas Valley Way - to Flordon",
            "caption": "To Flordon. This section of the Tas Valley Way leads from Flordon St Michael's to Hapton St Margaret's church further to the south-west. This view was taken looking north towards Flordon. The houses seen in the background are located on The Street."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/The_Tas_Valley_Way_-_from_Flordon_to_Hapton_-_geograph.org.uk_-_1385434.jpg",
            "title": "Evelyn Simak / The Tas Valley Way - from Flordon to Hapton",
            "caption": "From Flordon to Hapton. This section of the Way leads from Flordon St Michael's to Hapton St Margaret's church further to the south-west. The walk traverses the Hapton Estate and Parkland Rehoming Centre, managed by the Redwings Horse Sanctuary with their Norfolk headquarters housed in Hapton Hall . The site comprises a specialist horse hospital (the Mrs Coco Markus Veterinary Hospital) which has its own x-ray room and operating theatre, intensive care stables and a pharmacy as well as a rehoming centre, admin offices and more than 300 acres of paddocks and is open to the public on two weekends per year only."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Intwood_Church_-_geograph.org.uk_-_27717.jpg",
            "title": "Katy Walters / Intwood Church",
            "caption": "Intwood Church. Another of East Anglia's 172 round-towered churches."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/View_south-west_%28upstream%29_along_the_River_Tas_-_geograph.org.uk_-_1541767.jpg",
            "title": "Evelyn Simak / View south-west (upstream) along the River Tas",
            "caption": "View south-west (upstream) along the River Tas. The River Tas rises near Carlton Fen (near New Buckenham) and then flows northwards for approximately 20 miles before joining the River Yare at Trowse - just south of Norwich. The Tas valley contains many interesting historical sites including an Iron Age hill fort at Tasburgh, the old Roman settlement of Venta Icenorum - now Caistor St Edmund - and the site of a woodhenge at Arminghall. During Roman times, the river was an important resource for the people of Venta Icenorum. Over the centuries, the Tas has also been visited by two of England's finest poets: William Wordsworth in 1790, and Philip Larkin."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/View_from_Mulbarton_Common_-_geograph.org.uk_-_1586363.jpg",
            "title": "Evelyn Simak / View from Mulbarton Common",
            "caption": "View from Mulbarton Common. The driveway to the Old Hall is at right, passing the oak tree in autumn colours and the tithe barn. Harvest House can be seen to the right of the tower of St Mary Magdalen's church. This view was taken from Long Lane which traverses the eastern section of Mulbarton Common."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/St_Mary%27s_church_-_geograph.org.uk_-_701948.jpg",
            "title": "Evelyn Simak / St Mary's church",
            "caption": "St Mary's church Attleborough at the end of the route. Originally a cruciform-shaped church, the Church of the Assumption of the Blessed Virgin Mary dates from Saxon times, when St Edmund spent a year with priests at Attleborough before his coronation in 856. The church was partitioned off at the chancel for the use of a college of five priests in 1386. At the dissolution of the monasteries the college was closed and the chancel demolished. Consecration crosses survive from the original date of the building and there is a fragmented wall painting depicting St Christopher above the south doorway. The rood screen, with rood loft above, extends across both aisles and tower arch dates from 1475 and depicts St John the Baptist, St Mary, St John the Evangelist, St Thomas a Becket, the Holy Trinity and St Bartholomew. The shields of the 24 bishoprics above were added later. The large wall painting above the screen was created for the college of priests around 1500. The two Norman windows were reopened and embellished with pseudo-Norman stonework in 1844."
        }
    ],
    "distance_km": 40.0,
    "description": "This 25 mile river walk runs from Cringleford , near Norwich, to Attleborough, visiting a series of pretty villages with historic churches along the way. Settlements visited include Intwood, Swardeston, Ketteringham , Mulbarton , Hapton, New Buckenham and Old Buckenham . The walk also passes through some delightful Norfolk countryside which includes a long waterside section along the River Tas. You finish in the town of Attleborough where there's a Norman church to visit. Also of note is the Forncett Steam Museum at the village of Forncett St Mary with its unique collection of steam engines including the one which powered London's Tower Bridge. At Forncett St Peters you will pass the Norfolk Tank Musuem which houses a collection of Cold War British military vehicles, uniforms and artefacts.",
    "district": "Norwich",
    "county": "Norfolk",
    "region": "Eastern",
    "country": "England"
}
