{
  "objectID": "373cee091e543a8b53591a7574cd4ed3",
  "created_at": "2024-12-18T01:04:04.581044+00:00",
  "ref": "middleton-top-walking-route",
  "title": "Middleton Top Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Middleton_Top_engine_house._-_geograph.org.uk_-_107706.jpg",
  "nearby": [
    {
      "description": "High Peak Trail",
      "objectID": "5c146ed119db23d76f563e92b937f10f",
      "ref": "high-peak-trail-walking-and-cycle-route"
    },
    {
      "description": "Carsington Water",
      "objectID": "34d871040a2913342df849c089af1e7e",
      "ref": "carsington-water-walking-and-cycle-route"
    },
    {
      "description": "Limestone Way",
      "objectID": "c8710cae72d7105dbf3f3fc8f79b4e53",
      "ref": "limestone-way-walking-route"
    },
    {
      "description": "Black Rocks Cromford",
      "objectID": "128f1d1dd677cfb67ad2e0ee691a5a2d",
      "ref": "black-rocks-cromford-walking-route"
    },
    {
      "description": "Brassington",
      "objectID": "c6c406c05a7d6c5db26a8d4c6fc44ecd",
      "ref": "brassington-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/7081B55C1BCA722280258423004F5BB6/$FILE/Middleton Top.gpx",
  "_geoloc": {
    "lat": 53.0926622958,
    "lng": -1.5908109129
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Middleton_Top_engine_house._-_geograph.org.uk_-_107706.jpg",
      "title": "Mike Fowkes / Middleton Top engine house., via Wikimedia Commons",
      "caption": "Middleton Top engine house. This engine house is situated at the top of the Middleton incline and is the only one remaining of nine which were originally located at the top of every incline on the Cromford and High Peak Railway. It houses a Butterley beam engine which was used to haul waggons up the incline. The engine still operates one weekend a month during the summer using compressed air instead of the timber that was originally used to fire the boilers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Harboro%27_Rocks_%287872912792%29.jpg/512px-Harboro%27_Rocks_%287872912792%29.jpg",
      "title": "Paul Stephenson from London [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Just off the High Peak Trail, the Harboro' Rocks provide a grand viewpoint across Carsington Water and southern Derbyshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Middleton_Top_-_Viewpoint_Indicator_-_geograph.org.uk_-_349847.jpg",
      "title": "Alan Heardman / Middleton Top - Viewpoint Indicator, via Wikimedia Commons",
      "caption": "Viewpoint Indicator. Detailed closeup of plaque. It shows all the places of interest that you can see on a fine day from Middleton Top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Former_quarry_workings_at_Harboro_Rocks_-_geograph.org.uk_-_448676.jpg",
      "title": "Alan Murray-Rust / Former quarry workings at Harboro Rocks, via Wikimedia Commons",
      "caption": "Former quarry workings at Harboro Rocks. These concrete remains have an air of Egyptian or Aztec temple remains about them."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Footpath_crossing%2C_Griffe_Grange_-_geograph.org.uk_-_272493.jpg",
      "title": "Nikki Mahadevan / Footpath crossing, Griffe Grange, via Wikimedia Commons",
      "caption": "Footpath crossing, Griffe Grange. The footpath from which the photograph was taken, leads back to the High Peak Trail at Hopton Top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Footpath_to_Griffe_Grange_Valley_-_geograph.org.uk_-_1529678.jpg",
      "title": "Chris Wimbush / Footpath to Griffe Grange Valley, via Wikimedia Commons",
      "caption": "Footpath to Griffe Grange Valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Hopton_Top_Plaque_-_geograph.org.uk_-_1625877.jpg",
      "title": "Peter Barr / Hopton Top Plaque, via Wikimedia Commons",
      "caption": "Hopton Top. Plaque Describing the difficult climb up the steepest gradient on British railways"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Middleton_Moor_-_geograph.org.uk_-_60846.jpg",
      "title": "David Spencer / Middleton Moor, via Wikimedia Commons",
      "caption": "Middleton Moor. To the right is farmland, whereas by contrast to the left is rough grassland pasture now designated as access land."
    }
  ],
  "distance_km": 11.0,
  "description": "At Middleton Top you will find an excellent visitor centre with a number of good walking trails to try. The site includes the Middleton Top Engine House which you can visit on certain weekends throughout the year. Built in 1829 it was used to haul wagons up the Middleton incline and has been recently restored. This circular walk takes you west from the centre to Harboro Rocks, before returning via Griffe Grange and Middleton Moor. The route makes use of some of the popular waymarked trails which run through the area. Starting from the centre car park you head west along the High Peak Trail. The shared walking and cycle path follows a disused railway line from Cromford to Dowlow. This section will take past Eniscloud Farm to Harboro Rocks. There's super views from here over the Peak District and the lovely Carsington Water. Just after passing the rocks you turn north east to pick up a section of the Limestone Way. A footpath then turns south east to take you through Griffe Grange before passing the quarries on Middleton Moor. The route then turns south to return you to the visitor centre and the finish point of the walk. Another good walk to try from the centre is the hike to the Cromford Black Rocks. Follow the High Peak trail a short distance to the east and you will soon come to the site. Here you will find striking gritstone outcrop surrounded by the woodland of Cromford Moor. There are wonderful views of the Derwent Valley from the rocks which are in an elevated position above the town of Cromford.",
  "video_url": "https://www.youtube.com/embed/QTb0FFoNSkg",
  "postcode": "DE4 4LT",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}