{
  "created_at": "2025-01-06T09:12:53.164141+00:00",
  "objectID": "37c0cd74db3f71c2f8ea51e533c71534",
  "ref": "wombourne-railway-walk-walking-route",
  "title": "Wombourne Railway Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Bratch_Locks%2C_Wombourne_-_geograph.org.uk_-_360164.jpg",
  "nearby": [
    {
      "description": "Staffordshire and Worcestershire Canal",
      "objectID": "7b73e095a9e82ad1e47bcabf38c25232",
      "ref": "staffordshire-and-worcestershire-canal-walking-and-cycle-route"
    },
    {
      "description": "South Staffordshire Railway Walk",
      "objectID": "47650aa25f6e18ce9418670a16f9443c",
      "ref": "south-staffordshire-railway-walk-walking-and-cycle-route"
    },
    {
      "description": "Kingswinford Railway Walk",
      "objectID": "f818f7b396a3e20db2584255fc7ffa34",
      "ref": "kingswinford-railway-walk-walking-route"
    },
    {
      "description": "Baggeridge Country Park",
      "objectID": "73b9f0b2098478f1b40c2a05097b0f84",
      "ref": "baggeridge-country-park-walking-and-cycle-route"
    },
    {
      "description": "Wightwick Manor",
      "objectID": "2d4259f6f205afa029da4241259e3efa",
      "ref": "wightwick-manor-walking-route"
    },
    {
      "description": "Smestow Valley",
      "objectID": "82402b73d231a28f12740f6e5570f48e",
      "ref": "smestow-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/37c0cd74db3f71c2f8ea51e533c71534.gpx",
  "_geoloc": {
    "lat": 52.5433917642,
    "lng": -2.1923487239
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Bratch_Locks%2C_Wombourne_-_geograph.org.uk_-_360164.jpg",
      "title": "Roger Kidd / Bratch Locks, Wombourne",
      "caption": "Bratch Locks, Wombourne The three locks look like a staircase, but operate them as such, and you're in trouble! Opened 1772 (James Brindley)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Side_pound_at_Bratch_locks_-_geograph.org.uk_-_410290.jpg",
      "title": "Alan Murray-Rust / Side pound at Bratch locks",
      "caption": "Side pound at Bratch locks. The unusual design of The Bratch locks means that there is no traditional pound between each pair of locks to act as a local reservoir. Water can be stored in these side pounds which are at the water level between each pair of locks, but they are not accessible to craft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Bratch_Pumping_Station_-_geograph.org.uk_-_409722.jpg",
      "title": "Chris Allen / Bratch Pumping Station",
      "caption": "Bratch Pumping Station, Wombourne, Staffordshire. The wing nearest the camera housed the well pumps – since removed. These were driven by pitman and bellcranks from the main engines. Originally surface condensing, the workable engine now visibly exhausts to atmosphere."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Railway_building_at_Wombourne_Station_-_geograph.org.uk_-_290827.jpg",
      "title": "John M / Railway building at Wombourne Station",
      "caption": "Railway building at Wombourne Station. This was the main intermediate station on the Wombourne Branch Line, situated at the Bratch, an area noted for its industrial heritage. The station was opened by the Great Western Railway in 1925 and closed in 1932. The building survives today as a tea room and information centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Dismantled_Railway%2C_Wombourne%2C_Wolverhampton_-_geograph.org.uk_-_628768.jpg",
      "title": "Roger Kidd / Dismantled Railway, Wombourne, Wolverhampton",
      "caption": "Dismantled Railway, Wombourne, Wolverhampton. The former Bratch Station can just be seen as this former railway which ran its last train on 24th June 1965. This station is now a very popular tea room, open even on winter days, but phone first if the weather is foul"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Wombourne_Park_-_geograph.org.uk_-_1303771.jpg",
      "title": "Gordon Griffiths / Wombourne Park",
      "caption": "Wombourne Park. The Park runs alongside the Wom Brook, next to the South Staffs Railway walk."
    }
  ],
  "distance_km": 8.5,
  "description": "A circular walk from Wombourne taking you along a dismantled railway line before returning along the Staffordshire and Worcestershire Canal. The route follows a section of the old Wolverhampton to Dudley railway line which now forms part of the South Staffordshire Railway Walk. The line was closed in 1965 but is now a leisure route suitable for walkers and cyclists. On the way you'll also pass the old Bratch pumping station and the impressive Bratch Locks, originally built as a staircase. It's a lovely spot and ideal for a picnic or gentle stroll. The walk starts from the Wombourne Railway cafe where there is a car park. It's located just to the north of the town centre, next to Bratch Bridge. From here you can pick up the waymarked railway path and follow it north past Orton and Lower Penn to Mops Farm Bridge. Here you meet up with the canal and follow it south past some pretty lakes and locks to Awbridge Farm. You then pass Clee View before crossing the bridge and returning to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The railway cafe at the start of the route is a nice place to get some refreshments. The lovely cafe is set in restored railway station and offers a delicious selection of freshly made food, breakfast, lunch and afternoon tea. If the weather is good you can sit outside in the garden or under cover on the platform."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area makes for a fine dog walk and the railway cafe mentioned above is also dog friendly in the garden or on the old platform that is all under cover."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north east from the village and you can try the Wolverhampton Canal Walk along the Birmingham Canal. Also nearby is the circular Brewood Canal Walk. This visits the pretty Belvide Reservoir and the Georgian country house of Chillington Hall with its Capability Brown landscaped park and lake. The noteworthy Weston Park is also located just west of Belvide Reservoir and north west of Chillington Hall. There's more than 1000 acres of landscaped parkland surrounding this 17th century country mansion. A couple of miles east of Wombourne there's Baggeridge Country Park. The park has woodland trails and a decent viewpoint with fine views over the area. Adjacent to the park there's also the 18th century Himley Hall. The historic hall is surrounded by ‘Capability’ Brown landscaped parkland with woodland walks, waterfalls and a large lake. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gk3MKLFzO6Y",
  "postcode": "WV5 9BA",
  "district": "South Staffordshire",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sutherland Drive, Wombourne, South Staffordshire, Staffordshire, England, WV5 9BA, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "path"
  ],
  "points_of_interest": [
    "historical sites",
    "lakes",
    "locks"
  ],
  "facilities": [
    "car park",
    "cafe",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}