{
  "created_at": "2025-01-06T03:03:13.965143+00:00",
  "objectID": "37d951d3d729b1a8a2413416b6e7084b",
  "ref": "stoke-row-walking-route",
  "title": "Stoke Row Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/93/The_Maharajah%27s_Well%2C_Stoke_Row_-_geograph.org.uk_-_36356.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/37d951d3d729b1a8a2413416b6e7084b.gpx",
  "_geoloc": {
    "lat": 51.5514551271,
    "lng": -1.0221028929
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/The_Maharajah%27s_Well%2C_Stoke_Row_-_geograph.org.uk_-_36356.jpg",
      "title": "Colin Bates / The Maharajah's Well, Stoke Row",
      "caption": "The Maharajah's Well, Stoke Row. The local squire at Ipsden, Edward Anderton Reade, had collaborated with the Maharajah of Benares in India in the middle of the nineteenth century. In 1831, under Reade's direction, a well was dug to benefit the people of Azamgarh. After Reade's departure from the region in 1860, the Maharajah made the decision to donate to Reade's hometown of England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/The_High_Street_in_Stoke_Row_-_geograph.org.uk_-_2127263.jpg/512px-The_High_Street_in_Stoke_Row_-_geograph.org.uk_-_2127263.jpg",
      "title": "The High Street in Stoke Row by Steve Daniels, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The High Street in Stoke Row. The earliest known surviving record of the villages name is from 1435. Stoke is a common place-name derived from Old English, typically meaning a secondary settlement or outlying farmstead. With the affix \"row\" it means a \"row of houses at Stoke\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/The_Cherry_Orchard_-_geograph.org.uk_-_594998.jpg",
      "title": "Graham Horn / The Cherry Orchard",
      "caption": "The Cherry Orchard. Part of the orchard donated at the same time as the Maharajah's Well, to help fund the upkeep of the well. Now a public open space with a variety of tree species."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/The_Cherry_Orchard%2C_information_sign_-_geograph.org.uk_-_594981.jpg/256px-The_Cherry_Orchard%2C_information_sign_-_geograph.org.uk_-_594981.jpg",
      "title": "Graham Horn / The Cherry Orchard, information sign",
      "caption": "The Cherry Orchard, information sign. The Maharajah commissioned the well at Stoke Row, and it was sunk in 1863, in memory of Reade's assistance in building the Azimgurgh well in 1831 and his tales of water scarcity in his hometown of Ipsden. The well mechanism was created in 1863 by the Wallingford company RJ and H Wilder, and the pavilion over the well was finished in 1864. The open-sided pavilion has a cupola on top, an elephant in a golden colour above the well mechanism, and open sides. On the north side of the main road that runs through Stoke Row village, there is a small park where the well and pavilion can be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Woodland%2C_Stoke_Row_-_geograph.org.uk_-_2818723.jpg",
      "title": "Woodland, Stoke Row by Andrew Smith, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Woodland, Stoke Row"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Junction_%5E_Signpost%2C_Stoke_Row_-_geograph.org.uk_-_2670949.jpg/512px-Junction_%5E_Signpost%2C_Stoke_Row_-_geograph.org.uk_-_2670949.jpg",
      "title": "Junction & Signpost, Stoke Row by Des Blenkinsopp, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Village green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Crooked_Billet%2C_Stoke_Row_%28Geograph-2890038-by-Stuart-Logan%29.jpg/512px-Crooked_Billet%2C_Stoke_Row_%28Geograph-2890038-by-Stuart-Logan%29.jpg",
      "title": "Stuart Logan / The Crooked Billet",
      "caption": "Crooked Billet, Stoke Row"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Cherry_Tree_-_geograph.org.uk_-_3471127.jpg/512px-Cherry_Tree_-_geograph.org.uk_-_3471127.jpg",
      "title": "Cherry Tree by Des Blenkinsopp, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cherry Tree"
    }
  ],
  "distance_km": 1.5,
  "description": "This walk takes you around the pretty Oxfordshire village of Stoke Row. On the walk you will visit the notable features of the settlement including the village green, the Maharajah's Well and the Cherry Orchard. You'll also pass the noteworthy 17th century pub which has a splendid history and has been used as a filming location on many occasions. The distinctive Maharajah's Well is one of the highlights of the village. It dates from 1863 and is a collaboration between The Maharajah of Benares and local squire Edward Anderton Reade. A pretty cherry orchard sits next to the structure and is a nice place for a stroll in the village. To continue your walking in the area head east to visit the National Trust's Greys Court. The 16th century mansion is another local highlight and includes some beautiful parkland and gardens. Near here you will find the delightful town of Henley-on-Thames where you can enjoy lovely riverside walks along the Thames.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Crooked Billet for some post walk refreshments. Built back in 1642 the pub is reputed to have once been the hideout of notorious highwayman Dick Turpin, who was said to have been romantically attached to the landlord's daughter, Bess. It is also England's first gastropub and was the venue for Titanic star Kate Winslet's wedding reception. The pub features in all the main food guides, has been included in Time Outs ‘Best Out of London’ two years running & has been voted ‘Favourite Foodie Pub’ by Waitrose. You can find them at Newlands Lane with postcode RG9 5PU for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north there's the National Trust's Nuffield Place. The house is the former home of Lord Nuffield, founder of the Morris Motor Company, and his wife. Their home and personal possessions are just as they left them, the decor and furnishings intact. To the north west there's neighbouring Ipsden where you can explore the trails on Ipsden Heath and visit the 12th century Norman church."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QZQAOMQjSuY",
  "postcode": "RG9 5QR",
  "district": "South Oxfordshire",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stoke Row, Checkendon, South Oxfordshire, Oxfordshire, England, RG9 5QR, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "rural",
    "garden"
  ],
  "points_of_interest": [
    "historical sites",
    "village green",
    "orchard",
    "mansion"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}