{
  "created_at": "2025-01-06T00:32:05.735914+00:00",
  "objectID": "37d95a5f055eb0d342bc6a88975cafe0",
  "ref": "betws-y-coed-river-walk-walking-route",
  "title": "Betws Y Coed River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c5/River_Bank_at_Betws-y-Coed_-_geograph.org.uk_-_463190.jpg",
  "nearby": [
    {
      "description": "Swallow Falls",
      "objectID": "aff3faf0a77b447e919faf91d048d584",
      "ref": "swallow-falls-walking-route"
    },
    {
      "description": "Gwydyr Forest",
      "objectID": "be46934496ec81ce829d24f1ec6992de",
      "ref": "gwydyr-forest-walking-and-cycle-route"
    },
    {
      "description": "Llyn Parc",
      "objectID": "b89b64984af7c9621d75f59a2e2e5f70",
      "ref": "llyn-parc-walking-route"
    },
    {
      "description": "Llyn Elsi",
      "objectID": "0adbd0a48483a4430473281d080f63fa",
      "ref": "llyn-elsi-walking-route"
    },
    {
      "description": "Fairy Glen Betws y Coed",
      "objectID": "3f8e38ffd2ad3b54f87022dac392fb25",
      "ref": "fairy-glen-betws-y-coed-walking-route"
    },
    {
      "description": "Fishermans Walk and Lledr Gorge Walk",
      "objectID": "c30c0a3e53da4db07fd3074a0a24851b",
      "ref": "fishermans-walk-betws-y-coed"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/37d95a5f055eb0d342bc6a88975cafe0.gpx",
  "_geoloc": {
    "lat": 53.0933333211,
    "lng": -3.8022577256
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/River_Bank_at_Betws-y-Coed_-_geograph.org.uk_-_463190.jpg",
      "title": "Trevor Rickard / River Bank at Betws-y-Coed",
      "caption": "River Bank at Betws-y-Coed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Afon_Conwy_from_the_Sapper%27s_bridge_-_geograph.org.uk_-_556313.jpg",
      "title": "Eric Jones / Afon Conwy from the Sapper's bridge",
      "caption": "Afon Conwy from the Sapper's bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Braided_Channel_of_the_Afon_Conwy_-_geograph.org.uk_-_770969.jpg",
      "title": "Chris Carlson / Braided Channel of the Afon Conwy",
      "caption": "Braided Channel of the Afon Conwy. Here the River shows signs of braiding, unusually 30km from the sea, these islands are usually temporary but however vegetation has colonised this one and it has become permanent. Taken on a field course at the local field centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Rail_bridge_at_Betws-y-coed_-_geograph.org.uk_-_1111225.jpg",
      "title": "Bob Abell / Rail bridge at Betws-y-coed",
      "caption": "Rail bridge at Betws-y-coed. River Llugwy passing below rail line from BYC to Llandudno. The Llugwy joins the River Conwy about 1/4 mile down stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Afon_Llugwy%2C_Betws-y-Coed_-_geograph.org.uk_-_3283044.jpg",
      "title": "Afon Llugwy, Betws-y-Coed by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Afon Llugwy in spring."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Cafe_with_a_difference_-_geograph.org.uk_-_1432387.jpg",
      "title": "Richard Hoare / Cafe with a difference",
      "caption": "Cafe with a difference. Converted rail carriages now form a cafeteria in the sidings at Betws-y-coed Station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Betws-y-coed%2C_Pont-y-Pair_Bridge_-_geograph.org.uk_-_3606393.jpg",
      "title": "Betws-y-coed: Pont-y-Pair Bridge by Chris Downer, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Waterfalls at Pont-y-Pair Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/The_Rocks_-_geograph.org.uk_-_1716617.jpg/512px-The_Rocks_-_geograph.org.uk_-_1716617.jpg",
      "title": "Chris Page / The Rocks",
      "caption": "The Rocks"
    }
  ],
  "distance_km": 2.0,
  "description": "A circular walk along the River Llugy and the River Conwy in the Snowdonia village of Betws Y Coed. The short walk takes you along footpaths where the two rivers converge, close to the train station and the village centre. You can start the walk from the Snowdonia National Park Visitor Centre or from the train station. Paths will then take you around the golf course and along the rushing waters of the rivers. There's nice views across the water to the surrounding woodland and mountains of the area. You can continue your riverside walking by following the Afon Llugy west and visiting the delightful Swallow Falls and the picturesque wooden Miners Bridge. Also nearby are the Conwy Falls where there are good trails to follow along the River Conwy. To the south is the delightful Fairy Glen where there's little waterfalls, rapids and cascades in a picturesque wooded gorge.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Stables Bar for some post walk refreshments. They do very good food and also have a good sized outdoor area to relax in on warmer days. You can find the pub at postcode LL24 0AY for your sat navs. There's also The Alpine Coffee Shop, situated at Betws-y-Coed railway station. It's a popular place with eye catching decor including creative wrought-iron artwork and unusual artefacts. There is also a gallery with a permanent art exhibition of works by Jacha Potgieter, comprising of photographs, oil paintings and prints to raise awareness of apes in crisis. They serve award winning coffee which you can enjoy with a fine view of the old trains coming in and out of the station."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trails make for a nice dog walk. The Stables Bar mentioned above is also dog friendly and can provide water bowls."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the village you can visit one of the significant historical sites in the area at Dolwyddelan Castle. There are excellent views of the surrounding mountains from the ruins of the 13th century fortress. The circular walk also visits the village of Dolwyddelan and the lovely Afon Lledr Valley. To the north you will find the noteworthy market town of Llanrwst. Here you can try the circular Llanrwst Walk which visits some of the towns highlights. These include the splendid Gwydir Estate which contains a historic castle, an ancient chapel, the Grey Mare's Tail Waterfall and the expansive Gwydyr Forest. The Llyn Parc Walk starts from the village and follows a waymarked trail north through the forest to the pretty lake. On the way there's also views of the Aberllyn mine and gorge, where there is a waterfall to see. The Fishermans Walk and Lledr Gorge Walk starts just to the south west of the settlement at Pont-y-Pant railway station on the Conwy Valley line. This takes you through the beautiful scenery of the Lledr Gorge with its picturesque waterfalls, stepping stones and Pont Gethin viaduct. There's also the option of trying the Victorian Fishermans Walk, a precarious route through the gorge on a rickety old walkway. For more walking ideas in the area see the Snowdonia Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZMeBTIVyNQI",
  "postcode": "LL24 0AH",
  "district": "Betws-y-Coed",
  "county": "Conwy - Conwy",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}