{
  "created_at": "2025-01-06T04:15:26.447324+00:00",
  "objectID": "3857d94bed0386c563af9fd8be850748",
  "ref": "yorkshire-wolds-way-walking-route",
  "title": "Yorkshire Wolds Way National Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/49/Yorkshire_Wolds_Way%2C_Brantingham_-_geograph.org.uk_-_570944.jpg",
  "nearby": [
    {
      "description": "Londesborough Park",
      "objectID": "f24d55c10d34ba0fb9d00e11edd8bd02",
      "ref": "londesborough-park-walking-route"
    },
    {
      "description": "Filey Brigg Country Park",
      "objectID": "fccb9feb1b67a970d38cc665d4c61e16",
      "ref": "filey-brigg-country-park-walking-route"
    },
    {
      "description": "Hunmanby Circular Walk",
      "objectID": "ea3db66b8ea8391bd4aacaca824cd05b",
      "ref": "hunmanby-circular-walk-walking-route"
    },
    {
      "description": "Wharram Percy",
      "objectID": "7bcbebe06add1459ca7216356e4b9eb1",
      "ref": "wharram-percy-walking-route"
    },
    {
      "description": "Brantingham",
      "objectID": "fcd2a0e655d666a96eb7800808316133",
      "ref": "brantingham-walking-route"
    },
    {
      "description": "Millington Woods",
      "objectID": "d2ecadc83a2be47aca2864734ae24bd2",
      "ref": "millington-woods-walking-route"
    },
    {
      "description": "Humber Bridge",
      "objectID": "e78ba17915ca4715d066e26d93cc2a26",
      "ref": "humber-bridge-walking-route"
    },
    {
      "description": "Hull",
      "objectID": "cc5e364b3b09faea0d57a30e44a15714",
      "ref": "hull-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3857d94bed0386c563af9fd8be850748.gpx",
  "_geoloc": {
    "lat": 53.7180500584,
    "lng": -0.4523686968
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Yorkshire_Wolds_Way%2C_Brantingham_-_geograph.org.uk_-_570944.jpg",
      "title": "Paul Glazzard [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Yorkshire Wolds Way, Brantingham. Between Spout Hill and Dale Road near the southwest corner of Wandhills Plantation, Brantingham, looking north-northwest towards Bilks Hill. The Way is said to be the quietest of the National Trails."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Humber_bridge%2C_UK.jpg/256px-Humber_bridge%2C_UK.jpg",
      "title": "By Dom Hine (originally posted to Flickr as Humber Bridge) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Humber Bridge near Hull. The original Wolds Way long distance footpath was established in 1982 and covered 76 miles from the Humber Bridge at Hessle to Filey Brigg on the North Sea coast. The route headed southeast through Londesborough Park and across the old ford on the park lake before heading down to Goodmanham. The route was largely superseded by the 79-mile Yorkshire Wolds Way in 2003, the main course of which now heads due south from Londesborough along Towthorpe Beck to the western outskirts of Market Weighton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Londesborough_Park_-_geograph.org.uk_-_590097.jpg",
      "title": "Paul Glazzard / Londesborough Park",
      "caption": "Looking north from the Yorkshire Wolds Way at the eastern end of Pond Wood on the Londesborough Park estate. The house at Londesborough was demolished in 1819 by the 6th Duke of Devonshire, who under mounting financial strain sold the estate in 1845 to George Hudson \"The Railway King\". Hudson intended to live here and build a railway from York to Market Weighton with his own private station at Shiptonthorpe. He had a two-mile avenue of trees planted between the railway and the park but then things started to go wrong. \"The King\" ran into financial difficulties with the collapse of the over-inflated railway share price and was accused of corruption, bribing MPs and selling land he did not own. He left Londesborough in disgrace and was imprisoned in York Castle for debt in 1865."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Weedley_Tunnel.jpg",
      "title": "Paul Glazzard / Weedley Tunnel",
      "caption": "Weedley Tunnel, Low Hunsley, East Riding of Yorkshire, England. The western entrance to the short tunnel on the dismantled Hull & Barnsley Railway at Low Hunsley in the Yorkshire Wolds. Officially 'Weedley Tunnel' it has become known as 'Sugar Loaf Tunnel', a name presumably given to it by walkers on the nearby Yorkshire Wolds Way (there are other Sugar Loaf Tunnels including those on the Heart of Wales and the Richmond Vale railway lines). The reason for this nickname is obvious: there's a constant supply of white chalk dust spilling down from the hillside above the tunnel entrance. The Hull & Barnsley Railway was built in the 1880s together with Alexandra Dock in Hull, to break the monopoly of the North Eastern Railway Company and provide an additional trading route inland from the busy Humber port. The railway didn't last long. Services west of South Howden station were withdrawn from 1st January 1932 and the regular service between Hull and South Howden ended on 30th July 1955, although some excursion traffic continued to use this picturesque route through The Wolds until about 1958. After that only a short section of the railway remained in Hull serving the local chemical works until the 1970s when another short stretch of the line just south of Selby was reopened for delivering coal to the newly built Drax Power Station. The steep-sided cutting through the sandstone and chalk between Weedley Tunnel and Drewton Tunnel later became a quarry, operated by Stoneledge Plant & Transport of Cottingham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Mud_and_Sand_-_geograph.org.uk_-_442157.jpg",
      "title": "Paul Glazzard / Mud & Sand",
      "caption": "North bank of the River Humber at Hessle Whelps, looking east towards the north tower of the Humber Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Turtle_Hill%2C_Wauldby_-_geograph.org.uk_-_624329.jpg",
      "title": "Paul Glazzard / Turtle Hill, Wauldby",
      "caption": "Looking east-northeast along the bridleway towards Braffords Clump on the High Hunsley Circuit recreational route at Turtle Hill near Wauldby Manor Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Nunburnholme_Hill_-_geograph.org.uk_-_590016.jpg",
      "title": "Paul Glazzard / Nunburnholme Hill",
      "caption": "The view east-northeast across the northwestern slopes of Nunburnholme Hill from the Yorkshire Wolds Way, just north of Thorns Wood at the parish boundary between Nunburnholme and Hayton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/The_Yorkshire_Wolds_Way%2C_Burnby_Wold_-_geograph.org.uk_-_590029.jpg/256px-The_Yorkshire_Wolds_Way%2C_Burnby_Wold_-_geograph.org.uk_-_590029.jpg",
      "title": "Paul Glazzard / The Yorkshire Wolds Way, Burnby Wold",
      "caption": "On the building left of centre is one of the big yellow arrows which the farmer at Partridge Hall has kindly added to the national trail markers helping walkers follow the Yorkshire Wolds Way through the farm. The Yorkshire Wolds Way is a 79-mile national trail from Hessle (near the northern end of the Humber Bridge) to Filey Brigg on the North Sea coast, 7 miles south of Scarborough."
    }
  ],
  "distance_km": 127.0,
  "description": "Starting on the banks of the Humber Estuary at Hessle follow this charming route through the peaceful and beautiful Yorkshire countryside. The route runs for 79 miles passing through a series of charming villages as you wend your way through the delightful Yorkshire Dales to the finish point on the coast at Filey. Route highlights include: The picturesque landscape at Londesborough Park near Market Weighton. The lovely Filey Brigg Country Park on the coast at the end of the route is another splendid feature. Wharram Percy - the route passes through the remains of this fascinating medieval village which dates from the 10th century.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the little village of Millington you can visit the charming Gait Inn for some refreshments on the route. The pub has a delightful large garden area to relax in on warmer days. There's a good selection of drinks, a fine menu and a friendly atmosphere too. The pub also has an interesting history, dating from the 16th century. They provide accommodation in the shape of two pretty cottages so you can stay over if you need to. You can find the pub in the pretty little village with a postcode of YO42 1TY for your sat navs. In the village of Welton you'll find a historic pub well worth investigating. The Green Dragon is set in a 17th Century coaching inn and is said to have been a favourite haunt of highwayman Dick Turpin. There's a good menu and a nice outdoor seating area with views over the quaint village green. You can find the pub at Cowgate with a postcode of HU15 1NB for your sat navs. It's also dog friendly if you have your canine friend with you."
    }
  ],
  "video_url": "https://www.youtube.com/embed/8ly_KHTYip0",
  "district": "Hessle",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hessle, East Riding of Yorkshire, England, HU13 0GX, United Kingdom",
  "postcode": "HU13 0GX",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "coastal"
  ],
  "points_of_interest": [
    "historical sites",
    "landscape"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}