{
  "created_at": "2025-01-06T02:35:11.565786+00:00",
  "objectID": "3873af260fef50f26462e6845e5b9190",
  "ref": "sandscale-haws-national-nature-reserve-walking-route",
  "title": "Sandscale Haws National Nature Reserve Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Sand_dunes_at_Sandscale_Haws_-_geograph.org.uk_-_849938.jpg",
  "nearby": [
    {
      "description": "Cumbria Coastal Way",
      "objectID": "2fcd19e1d9c4bc3c8a117c9c237af3f5",
      "ref": "cumbria-coastal-way-walking-route"
    },
    {
      "description": "Broughton in Furness",
      "objectID": "e6e90f451024a3aa5e6fa3745e7e9767",
      "ref": "broughton-in-furness-walking-route"
    },
    {
      "description": "Walney Island",
      "objectID": "15b3009e5b509743c74f24d66a53da2c",
      "ref": "walney-island-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3873af260fef50f26462e6845e5b9190.gpx",
  "_geoloc": {
    "lat": 54.1708291246,
    "lng": -3.2299547542
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Sand_dunes_at_Sandscale_Haws_-_geograph.org.uk_-_849938.jpg",
      "title": "Espresso Addict / Sand dunes at Sandscale Haws, via Wikimedia Commons",
      "caption": "Sand dunes at Sandscale Haws Sandscale Haws is a 264 hectare National Nature Reserve managed by the National Trust. Sand dunes, such as these adjacent to Duddon Sands, form a major part of reserve. The northern tip of Walney Island is visible in the distance (right)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Pool_near_Sandscale_Haws_-_geograph.org.uk_-_850342.jpg",
      "title": "Espresso Addict / Pool near Sandscale Haws, via Wikimedia Commons",
      "caption": "Pool near Sandscale Haws Small pool fringed with waterlilies in the wet meadow to the south west of the National Trust carpark. It is not marked on the OS 1:25,000 map"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Dunes_near_Sandscale_Haws_-_geograph.org.uk_-_849627.jpg",
      "title": "Espresso Addict / Dunes near Sandscale Haws, via Wikimedia Commons",
      "caption": "Dunes near Sandscale Haws. This small area of sand dunes between the National Trust car park and the beach is protected from walkers by barriers. The distant windfarm (centre left) is on Hare Slack Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Wind-shaped_hawthorn_near_Sandscale_Haws_-_geograph.org.uk_-_839753.jpg",
      "title": "Espresso Addict / Wind-shaped hawthorn near Sandscale Haws, via Wikimedia Commons",
      "caption": "Wind-shaped hawthorn near Sandscale Haws Inland of the Sandscale Haws dunes lies a large area of heathland used as sheep pasture, with occasional wind-shaped hawthorns"
    }
  ],
  "distance_km": 6.0,
  "description": "Explore the sandy estuary of the River Duddon with the backdrop of Lake District mountains in this National Trust run nature reserve in Cumbria. There's some fascinating wildlife to be seen with the rare Natterjack Toad, Great Crested Newts, wintering wildfowl, Pintail, Red Knot, Curlews and Common Redshank. You can explore the sandy beach with views of the Duddon Estuary and the expansive beautiful dune habitat with Coralroot orchids.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The reserve is located just a few miles north of Barrow in Furness on the Cumbria Coastal Way. If you have time you could continue your walk along this super walkway north to Askam-in-Furness or south to Barrow-in-Furness. Just to the north of Barrow there's also Dalton-in-Furness where you can visit Dalton Castle. The 14th century Pele Tower has strong connections to Furness Abbey and is run by the National Trust. Just to the south there's Walney Island to explore. The scenic island includes two more nature reserves and the only grey seal colony in Cumbria. From here there are also fine views over to Piel Island. The island includes a ruined 14th century castle and a historic pub dating back hundreds of years. You can catch a ferry to Piel island from nearby Roa Island. The Broughton in Furness Walk visits the reserve from the nearby market town. For more walking ideas in the area see the Lake District Walks and the Cumbria Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/psMiEULJ0Go",
  "postcode": "LA14 4QJ",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Roan Head Car Park, Hawthwaite Lane, Askam and Ireleth, Askam-in-Furness, Westmorland and Furness, England, LA14 4QJ, United Kingdom",
  "district": "Askam-in-Furness",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "beach",
    "dune habitat"
  ],
  "points_of_interest": [
    "wildlife viewing",
    "estuary views"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "loop",
  "activity_type": [
    "walking",
    "bird watching"
  ]
}