{
  "created_at": "2025-01-06T00:48:16.265168+00:00",
  "objectID": "38bb691f170838e05ddfd5fc8732c107",
  "ref": "nar-valley-way-walking-route",
  "title": "Nar Valley Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/51/Ford_on_the_Nar_Valley_Way_%28geograph_1812244%29.jpg",
  "nearby": [
    {
      "description": "Castle Acre",
      "objectID": "991e111ff7aed6a1c76d339c12e1ed7b",
      "ref": "castle-acre-walking-route"
    },
    {
      "description": "Shouldham Warren",
      "objectID": "d53628c0f95a06b01cdc873d0a17a8eb",
      "ref": "shouldham-warren-walking-route"
    },
    {
      "description": "Pentney Lakes",
      "objectID": "7d87fa9f338021989c869697aba49b3e",
      "ref": "pentney-lakes-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/38bb691f170838e05ddfd5fc8732c107.gpx",
  "_geoloc": {
    "lat": 52.7521382886,
    "lng": 0.3941371693
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Ford_on_the_Nar_Valley_Way_%28geograph_1812244%29.jpg",
      "title": "Evelyn Simak / Ford on the Nar Valley Way",
      "caption": "Ford on the Nar Valley Way at West Acre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/The_Nar_Valley_Way_-_geograph.org.uk_-_1638855.jpg",
      "title": "Evelyn Simak / The Nar Valley Way",
      "caption": "The river at Narborough. The River Nar is a tributary of the River Great Ouse. It rises near Litcham and flows 15 miles west through the villages of Castle Acre and Narborough. When in the mid 18th century the Industrial Revolution gathered pace the River Nar was already a major navigation. At that time it was owned by the Marriott family, Lords of the Manor from 1857 - 1875, and used to bring in timber, coal, grain, malt and bones from Kings Lynn by horse drawn lighters or barges, carrying up to 10 tons. Return cargoes included sand and gravel from Pentney pits and bonemeal fertilizer from Narborough Bone Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Along_the_River_Nar_on_the_Nar_Valley_Way_-_geograph.org.uk_-_1638964.jpg",
      "title": "Evelyn Simak / Along the River Nar on the Nar Valley Way",
      "caption": "The river was canalised to connect the village of Narborough to King's Lynn and beyond: the Nar system included one pound-lock, and ten staunches were built in the five miles below the village. Navigation to Narborough ended in 1884, although steam tugs and barges still used the lowest reaches of the river until well into the 20th century, notably those of the West Norfolk Farmers Manure Company which brought ammonia-rich gas water to their factory from Cambridge gasworks until 1932."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/The_railway_once_used_to_run_along_here_-_geograph.org.uk_-_1638937.jpg",
      "title": "Evelyn Simak / The railway once used to run along here",
      "caption": "The railway once used to run along here at Narborough. What at first sight appears to be short sections of a hedge are the remaining overgrown brick piers of a dismantled railway bridge which carried the former King's Lynn to Dereham line - part of the Great Eastern Railway - over the River Nar. The Lynn & Dereham Railway, which weaved a 42 kilometre route to East Dereham via Narborough and Swaffham, was opened in stages between 1846 and 1848. The line to Dereham closed in 1968. Part of it is now a Norfolk Wildlife Trust Railway Line Nature Reserve, with the car park being situated about one kilometre south of Narborough village. The unique strip of chalk grassland here was created when engineers who built the railway line exposed the underlying chalk as they dug a borrow pit to build up the embankment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Castle_Acre_Priory%2C_Castle_Acre%2C_Norfolk_-_geograph.org.uk_-_687676.jpg",
      "title": "Christine Matthews / Castle Acre Priory, Castle Acre, Norfolk",
      "caption": "The trail as you pass the noteworthy Castle Acre Priory. Remains of Castle Acre Priory, which is one of the largest and best preserved monastic sites in England, the foundation of Castle Acre Priory in about 1090 sprang directly from a visit by William de Warenne II and his wife Gundrada to the great French monastery of Cluny. So impressed were they by its beauty and holiness that they vowed to introduce the Cluniac order of monks to England. Through the opening you can see St James's Church in the delightful village of Castle Acre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Walking_the_dogs_-_geograph.org.uk_-_1739287.jpg",
      "title": "Evelyn Simak / Walking the dogs",
      "caption": "Walking the dogs in the Shouldham Warren Nature Reserve. The trail passes right through this wooded area near King's Lynn. The tracks and paths traversing Shouldham Warren are favoured by horse riders and walkers, with or without dogs. The warren is a wooded area on the edge of the fens, located a short distance to the north of the village of Shouldham with a track to the parking and picnic area turning off Spring Lane. The undulating site is traversed by numerous unmarked paths offering good views across the open fenland. Much of the northern part, which slopes upwards towards a central plateau, is covered by conifers, some of which has recently been cleared. A deep ditch crossable only in three places - separates the northern from the southern parts of the woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/West_Acre_village_sign_-_geograph.org.uk_-_774161.jpg",
      "title": "Martin Pearman / West Acre village sign",
      "caption": "West Acre village sign. The trail passes through this historic village which is well worth exploring. Near to the village church are the remains of a Priory which was founded for the monks of the Cluniac Order in the 13th century. There's also a decent village pub if you'd like a pit stop to refresh yourself."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Pentney_gatehouse_-_geograph.org.uk_-_823325.jpg",
      "title": "Keith Evans / Pentney gatehouse",
      "caption": "Pentney Priory gatehouse. The ruins of the priory, mostly comprising the flint-built gatehouse, are Grade I listed. The Priory was founded c.1130 by Robert de Vaux and dedicated to the Holy Trinity, Blessed Virgin Mary and Mary Magdalene."
    }
  ],
  "distance_km": 54.0,
  "description": "Follow the River Nar from King's Lynn to Gressenhall on this delightful waterside walk through Norfolk. The walk passes Shouldham, West Acre and Litcham following footpaths and country lanes close to or beside the River Nar. Walk highlights include Pentney Abbey, Pentney Lakes, West Acre Priory and Castle Acre castle and priory. The fascinating and atmospheric ruins date back to the late 11th century and are a major highlight on the walk. The section through Shouldham Warren is also lovely. The nature reserve includes beautiful pine woodlands and a fine Rhododendron Avenue. The associated village is also worth a detour from the route with its pretty village green and 14th century church to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "You could stop off in Shouldham village and visit The King's Arms. The 17th century pub is located in a nice spot next to the village green. It is notable as West Norfolk's first community owned pub. It was West Norfolk CAMRA Pub of the Year 2016, 2017, 2018 and 2020. They have a good menu and a sunny garden at the back of the pub. You can find them at 28 The Green with a postcode of PE33 0BY for your sat navs. At Castle Acre there's the Ostrich Inn to consider. It's a historic pub of some note, being set in a former coaching inn from the 16th century. The inn is located in a lovely spot by the village green and has a charming olde worlde interior with beams, brick fireplaces and an old stable entrance. Outside there's a beautiful landscaped garden where you can relax on warmer days. They have a great menu and can be found at Stocks Green with a postcode of PE32 2AE for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the Gressenhall end the trail links up with the Wensum Way. This long distance footpath will take you through the lovely River Wensum Valley to Swanton Morley and Lenwade."
    }
  ],
  "video_url": "https://www.youtube.com/embed/TR8JkJ0yq_E",
  "district": "King's Lynn and West Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Samaritans, 26, Queen Street, South Lynn, King's Lynn, King's Lynn and West Norfolk, Norfolk, England, PE30 1HT, United Kingdom",
  "postcode": "PE30 1HT",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "village"
  ],
  "facilities": [
    "church",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}