{
    "objectID": "38d80bbe2ce24083898deb6f247c70ae",
    "created_at": "2024-12-18T05:44:11.704580+00:00",
    "ref": "withernsea-walking-route",
    "title": "Withernsea Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/56/The_Sandcastle%2C_Withernsea_-_geograph.org.uk_-_201645.jpg",
    "nearby": [
        {
            "description": "Spurn Point",
            "objectID": "db5a31ae1b9ae138d73bd401a31de1a7",
            "ref": "spurn-point-walking-route"
        },
        {
            "description": "Hornsea Mere",
            "objectID": "493137a1f89d53ded8551b18e6bb3af1",
            "ref": "hornsea-mere-walking-route"
        },
        {
            "description": "Tophill Low",
            "objectID": "76fd0f54fc0a4dd891276e726f6d066f",
            "ref": "tophill-low-walking-route"
        },
        {
            "description": "Hull",
            "objectID": "cc5e364b3b09faea0d57a30e44a15714",
            "ref": "hull-walking-route"
        },
        {
            "description": "Burton Constable",
            "objectID": "9e4da4b0ff5b80c5a5c543ba7c501f4a",
            "ref": "burton-constable-walking-route"
        },
        {
            "description": "Brandesburton",
            "objectID": "5fbff958c6c8c24edef4fec1a118fa98",
            "ref": "brandesburton-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/875533D5CBBB9511862587A50050E474/$FILE/Withernsea.gpx",
    "_geoloc": {
        "lat": 53.7312555111,
        "lng": 0.0352013458
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/The_Sandcastle%2C_Withernsea_-_geograph.org.uk_-_201645.jpg",
            "title": "Paul Glazzard / The Sandcastle, Withernsea",
            "caption": "The Sandcastle, Withernsea, East Riding of Yorkshire. Built between 1875 and 1877, Withernsea's ill-fated pier was plagued by accidents even before completion. It eventually opened in 1878, its ornate iron girders reaching 1,196 feet across the beach and out to sea. It suffered much damage in the Great Storm of 1880 and was hit by many ships before being dramatically demolished by the Grimsby bound Henry Parr in 1893. The remaining 50ft. pier was removed in 1903 during the reconstruction of the sea wall, but its unique gateway, nicknamed 'The Sandcastle', still stands."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Withernsea_Lighthouse_-_geograph.org.uk_-_215664.jpg/256px-Withernsea_Lighthouse_-_geograph.org.uk_-_215664.jpg",
            "title": "Paul Glazzard / Withernsea Lighthouse",
            "caption": "Withernsea Lighthouse. The annual garden party hosted by The Friends of Withernsea Lighthouse (the vehicle on the lawn belongs to the coast guard). Built in 1893 by London Trinity House and opened on 1st March 1894, the lighthouse was sited in the middle of the town to keep it safe from coastal erosion. The beam reached for seventeen miles on a clear night and flashed the morse code letter 'U' meaning 'You are standing into danger'. The structure rises around 127 feet (39 m) above Hull Road. The lighthouse closed in 1976 an now houses a museum to 1950s actress Kay Kendall, who was born in the town."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Withernsea_beach_%28geograph_3607051%29.jpg/512px-Withernsea_beach_%28geograph_3607051%29.jpg",
            "title": "Ian S / Withernsea beach",
            "caption": "Withernsea beach"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Cliff_House%2C_Holmpton_-_geograph.org.uk_-_983374.jpg",
            "title": "Paul Glazzard / Cliff House, Holmpton",
            "caption": "Cliff House, Holmpton. Eroded farm track off Seaside Road near the pond on the site of Cliff House. The remains of collapsed buildings were demolished before the North Sea had the chance to claim them."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Holmpton_Cliffs_-_geograph.org.uk_-_281716.jpg",
            "title": "Paul Glazzard / Holmpton Cliffs",
            "caption": "Holmpton Cliffs. A relic of WWII north of Holmpton village - basically a box shaped shed with buttressed walls built in three courses of brick and a 20cm thick concrete roof. Presumably all but the front was previously covered by the earth mound. The large entrance doesn't match the concrete lintels so it may have been altered for farm use after the war. Coastal erosion has been dramatic in this region since the structure was built so it would originally have been some distance from the sea, probably serving other installations in more advanced positions."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Easington_Clays_-_geograph.org.uk_-_305288.jpg",
            "title": "Paul Glazzard / Easington Clays",
            "caption": "Easington Clays. These two boats moored off the end of Humber Side Lane have used the same anchor points for some time now and have scraped circular channels in the mudflats as they swing around on the ebb and flow of the tides."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/High_Street%2C_Easington_-_geograph.org.uk_-_983241.jpg",
            "title": "Paul Glazzard / High Street, Easington",
            "caption": "High Street, Easington"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Lighthouses_at_Spurn_Head_-_geograph.org.uk_-_200519.jpg",
            "title": "Paul Glazzard / Lighthouses at Spurn Head",
            "caption": "Lighthouses at Spurn Head. The first reference to a lighthouse on Spurn dates back to 1427 when a hermit, William Reedbarrow, was granted dues from passing ships to complete a lighthouse he was building there. In the late seventeenth century high and low lights were erected on what was then the tip of the spit, probably about two miles north of the present tip. The low light had to be rebuilt several times but the high light lasted until the late eighteenth century when John Smeaton, the celebrated engineer who had built the Eddystone lighthouse in 1759, designed and built two new lighthouses at Spurn under the direction of the Hull and London Trinity Houses. In 1852 a new low lighthouse was built on the Humber foreshore and in 1895 the high one was also replaced because there was evidence that the foundations of Smeaton's lighthouse were giving way. The low lighthouse was then redundant since lights shone out at several levels from the new one, and it was used to store explosives for a while before being topped by a water storage tank. The high lighthouse shone out over Spurn until 1985 when modern technology meant that it too became redundant."
        }
    ],
    "distance_km": 32.0,
    "description": "This coastal village in East Riding of Yorkshire has some nice beach walks to enjoy. In the village there's a nice wide promenade and interesting old buildings including the pier towers and the lighthouse which are significant local landmarks. This walk from the village takes you south along the beach to visit the neighbouring villages of Holmpton and Easington. You then have the option of continuing to one of the highlights of the area at the Spurn Point . The narrow sand spit is a nature reserve with sand dunes and huge variety of wildlife to see. At the end of the walk you can catch the bus back to Withernsea from Easington.",
    "video_url": "https://www.youtube.com/embed/PUNW4-Nkmeo",
    "district": "Withernsea",
    "county": "East Riding of Yorkshire",
    "region": "Yorkshire and the Humber",
    "country": "England"
}
