{
  "created_at": "2025-01-06T05:08:20.848174+00:00",
  "objectID": "38e07d37032964150f38618d2d23ad2a",
  "ref": "box-walking-route",
  "title": "Walks around Box Wiltshire Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Church_Lane%2C_Box%2C_Wiltshire_-_geograph.org.uk_-_1443566.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/38e07d37032964150f38618d2d23ad2a.gpx",
  "_geoloc": {
    "lat": 51.4150535374,
    "lng": -2.2539630234
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Church_Lane%2C_Box%2C_Wiltshire_-_geograph.org.uk_-_1443566.jpg",
      "title": "Brian Robert Marshall / Church Lane, Box, Wiltshire",
      "caption": "Church Lane, Box, Wiltshire. The lane leads up from the church of St Thomas à Becket to the A4 old coaching road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/The_By_Brook_-_geograph.org.uk_-_445890.jpg",
      "title": "Graham Horn / The By Brook",
      "caption": "The By Brook. Magnificent riverside scenery north of Bath. The Macmillan Way long distance path follows this river valley for seven miles to Castle Combe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Squeeze_stile_south_of_Drewett%27s_Mill_-_geograph.org.uk_-_445885.jpg",
      "title": "Graham Horn / Squeeze stile south of Drewett's Mill",
      "caption": "Squeeze stile south of Drewett's Mill. The Macmillan Way long distance footpath follows the valley of the By Brook for seven miles between Box and Castle Combe. There is a complicated set of fields to cross here, mostly through gates although this stile for thin people is included. The brook is never more than 100 yards away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Meander_on_the_By_Brook_-_geograph.org.uk_-_445887.jpg",
      "title": "Graham Horn / Meander on the By Brook",
      "caption": "Meander on the By Brook. The By Brook is now a substantial stream, close to being promoted to a river at this point. It has the characteristics here, flowing in a wide valley with significant meanders such as seen here. The clump in the middle may well soon (in geological terms) be cut through leaving this as an oxbow lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/The_By_Brook_-_geograph.org.uk_-_212434.jpg",
      "title": "Sharon Loxton / The By Brook",
      "caption": "The By Brook flows in a south-easterly direction until it joins the river Avon at Bathford, on the outskirts of Bath. In spite of the dry weather, the brook appeared to be very full."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Roman_Villas%2C_Church_Lane%2C_Box%2C_Wiltshire_-_geograph.org.uk_-_1443556.jpg",
      "title": "Brian Robert Marshall / Roman Villas, Church Lane, Box, Wiltshire",
      "caption": "Roman Villas, Church Lane, Box, Wiltshire. The large scale map shows the site of an old Roman villa behind and to the left of the Victorian villas seen here. The viewpoint is the churchyard of St Thomas à Becket church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Public_drinking_fountain%2C_Box_-_geograph.org.uk_-_811696.jpg/512px-Public_drinking_fountain%2C_Box_-_geograph.org.uk_-_811696.jpg",
      "title": "Maurice Pullin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Public drinking fountain. A typical piece of Victoriana, note the railings. There is a horse trough built into the other side and an inscription"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/The_Blind_House%2C_Box_-_geograph.org.uk_-_812752.jpg",
      "title": "Maurice Pullin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Blind House. A small stone lockup from former times where miscreants could be kept overnight until they could be dealt with by the local court, or until they had sobered up."
    }
  ],
  "distance_km": 3.4,
  "description": "This Wiltshire based village is located close to Corsham and Bath in a nice rural part of the county. There's some nice waterside walking along the By Brook and a significant waymarked trail running through the area. It's also quite close to the Cotswolds, one of the premier walking areas of the country. The village is probably most well known for the Box railway tunnel created by Isambard Kingdom Brunel between December 1838 and June 1841. This circular walk takes you north along the Macmillan Way and the pretty By Brook to Drewitt's Mill. You can easily extend the walk by continuing north along the waymarked trail and the river towards Slaughterford, Biddestone and Castle Combe. You could extend the walk by continuing north to visit neighbouring Colerne. Here you will find nearly 90 historic listed buildings including a 13th century church and a noteworthy 17th century stone pub.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Quarryman's Arms in Box Hill is a good choice for some post walk refreshment. The handsome pub has a fine interior and a lovely garden with terrace for warmer weather. You can find them at postcode SN13 8HN for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk. The Quarryman's Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east there's the splendid Corsham Court to explore. The house is surrounded by lovely grounds with gardens, woodland a lake. Just west of the village you can pick up the Fosse Way. The trail follows the path of the ancient Roman Road north towards Culkerton. To the south there's the worthy village of Monkton Farleigh where you can explore the attractive estate of the 18th century Monkton Farleigh Manor House. The circular walk also visits South Wraxall with its 15th century manor house. Just to the north west of the village you can climb to Bathford Hill and visit Brown's Folly. The 19th century tower is surrounded by a nature reserve with woodland, wildlife and countryside views.  For more walking ideas in the area see the Cotswolds Walks and Wiltshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Bc5A1WICTCg",
  "postcode": "SN13 8NN",
  "district": "Box",
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Box Pharmacy, 10, High Street, Box, Wiltshire, England, SN13 8NN, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "water",
    "trail"
  ],
  "points_of_interest": [
    "tunnel",
    "historic buildings"
  ],
  "facilities": [
    "pub"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}