{
  "created_at": "2025-01-06T01:33:49.333272+00:00",
  "objectID": "392710c05a6a23e71cefc13e668a8ef2",
  "ref": "copper-trail-walking-route",
  "title": "Copper Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Disused_mine_at_Minions%2C_Cornwall_%28geograph_4491632%29.jpg",
  "nearby": [
    {
      "description": "Crowdy Reservoir",
      "objectID": "33399575aa1fa533dc3b36d30c2e466b",
      "ref": "crowdy-reservoir-walking-route"
    },
    {
      "description": "Colliford Lake",
      "objectID": "3a8792071d140959a2a2cd83a2c8bd62",
      "ref": "colliford-lake-walking-route"
    },
    {
      "description": "Camel Trail",
      "objectID": "dcae27896312abf1091e5973a84ef27e",
      "ref": "camel-trail-walking-and-cycle-route"
    },
    {
      "description": "Golitha Falls",
      "objectID": "8fafffa6c22d7225549e4510c1dcc105",
      "ref": "golitha-falls-walking-route"
    },
    {
      "description": "Minions Cheesewring",
      "objectID": "85d8c0f6f69467335581fd56ffc956aa",
      "ref": "minions-cheesewring-walking-route"
    },
    {
      "description": "Camelford",
      "objectID": "31218d6bcd5d74ce108298072583dc67",
      "ref": "camelford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/392710c05a6a23e71cefc13e668a8ef2.gpx",
  "_geoloc": {
    "lat": 50.5143177841,
    "lng": -4.4546436027
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Disused_mine_at_Minions%2C_Cornwall_%28geograph_4491632%29.jpg",
      "title": "Edmund Shaw / Disused mine at Minions, Cornwall",
      "caption": "Disused mine at Minions, Cornwall. This is the Phoenix United mine complex, with the landmark Pumping Engine House and its prominent chimney at the right and other mining buildings to its left. This mine produced over 16,000 tons of tin and 83,000 tons of copper between 1842 and 1898, and was re-opened after the sinking of a new shaft in 1907. However, the expected tin resources were not in place and it was re-closed in 1914."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Standing_stones_in_the_central_Hurlers_stone_circle_-_geograph.org.uk_-_525755.jpg/256px-Standing_stones_in_the_central_Hurlers_stone_circle_-_geograph.org.uk_-_525755.jpg",
      "title": "Jim Champion / Standing stones in the central Hurlers stone circle",
      "caption": "Standing stones in the central Hurlers stone circle. There are the partially restored remains of three stone circles - collectively called \"The Hurlers\" - near Minions. These standing stones are on the south side of the central circle. Little remains of the south circle. The stone on the right has been set in a concrete base. The engine house in the distance is now the Minions \"heritage centre\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Clapper_bridge.jpg/256px-Clapper_bridge.jpg",
      "title": "Paul Smith (Romfordian/Sootyskye), CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "A clapper bridge at Bowithick on Bodmin Moor. The stream here is Penpont Water, a tributary of the River Inny."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/View_of_St_Neot_Church_-_geograph.org.uk_-_1569412.jpg",
      "title": "Amanda King / View of St Neot Church",
      "caption": "View of St Neot Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Carn_Galver_Engine_Houses_-_geograph.org.uk_-_1961519.jpg/256px-Carn_Galver_Engine_Houses_-_geograph.org.uk_-_1961519.jpg",
      "title": "Carn Galver Engine Houses by Chris Andrews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Carn Galver Engine Houses"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Draynes_Bridge_and_the_River_Fowey_-_geograph.org.uk_-_1510534.jpg",
      "title": "Rod Allday / Draynes Bridge and the River Fowey",
      "caption": "Draynes Bridge and the River Fowey Dating from 1876."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/King_Doniert%27s_Stone_-_geograph.org.uk_-_955412.jpg",
      "title": "Rod Allday / King Doniert's Stone",
      "caption": "King Doniert's Stone. Two ancient cross bases decorated in late 9th Century style. The shorter cross bears a latin inscription referring to Doniert,probably Durngarth, King of Cornwall, who was drowned in AD 875."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Across_One_Arm_of_Colliford_Lake_-_geograph.org.uk_-_1957110.jpg/512px-Across_One_Arm_of_Colliford_Lake_-_geograph.org.uk_-_1957110.jpg",
      "title": "Across One Arm of Colliford Lake by Tony Atkin, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Across One Arm of Colliford Lake"
    }
  ],
  "distance_km": 97.0,
  "description": "Visit some of the most beautiful parts of Bodmin moor on this circular route which takes you on a tour of the historic Cornish Copper mines. The Trail begins at Minions village and visits St. Neot, Bodmin, St. Breward, Camelford, Five Lanes and back to Minions. The first section takes you from Minions and heads towards the delightful village of St Neot, passing the River Fowey and the photogenic Golitha Falls. You continue from St Neot to Bodmin with lovely waterside sections along the River St Neot and past Colliford Lake. Just outside Bodmin there is a peaceful wooded section through Devlock Wood. At Bodmin you join the delightful Camel Trail, following the River Camel to St Breward and onto Camelford. From Camelford you head through Davidstow Moor, passing Crowdy Reservoir, Davidstow Woods and the old WW2 Control Tower. The path continues through Stonaford and Henwood before returning to Minions. As well as the beautiful countryside scenery you will also pass a series of ancient stone structures including King Doniert's Stones, Hurlers Stone Circle and the Cheesewring Tor near Minions. The walk also visits several historic mines including the Prince of Wales Mine and South Caradon mine.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the start in Minions there's the Cheesewring Hotel. This 19th century freehouse is the highest pub in Cornwall at 303m above sea level. They do a fine Sunday roast and have a garden area to sit outside in. You can find them in the village at postcode PL14 5LE for your sat navs. If you fancy a delicious cream tea then you could head across the street to the Minions Shop & Tearoom. In Camelford there's a few good refreshment options. The Masons Arms does good food and has a lovely garden area to sit in when the weather is good. The interior is full of character with a ceiling full of old bottles, mugs, cups, tankards and old newspaper clippings. You can find the pub in the market place at a postcode of PL32 9PB for your sat navs. It's also dog friendly if you have your canine friend with you. In Blisland be sure to make a pit stop at the excellent Blisland Inn. It's an award winning pub of some note, having been voted three times Cornwall CAMRA Pub of the Year and in 2001 becoming the campaign's national Pub of the Year. The interior is full of character with items such as pumps, barometers, toby jugs and coffee mugs to admire. They serve good quality homemade food and also have a nice garden to sit out in. You can find them at postcode PL30 4JF for your sat navs. In the town of Camelford there's the Masons Arms to consider. The 18th century pub includes a restaurant and a nice garden area which backs onto the River Camel. They serve a good selection of Cornish Ales and have a decent food menu as well. You can find them in the Market Place at postcode PL32 9PB for your sat navs. The Camelford Way long distance footpath can also be picked up in the town. The trail explores the River Camel Valley to the south of the riverside settlement."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the start of the walk you'll pass close to the Cheesewring which is well worth a short detour. The distinctive granite tor sits atop Stowe's Hill just to the west of the path near Minions. For more walking ideas in the area see the Bodmin Moor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QBEimY7GkUI",
  "postcode": "PL14 5LR",
  "district": null,
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Minions, Linkinhorne, Cornwall, England, PL14 5LR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland",
    "river"
  ],
  "points_of_interest": [
    "historic mines",
    "stone structures",
    "waterfalls",
    "reservoirs"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}