{
  "objectID": "39b20e0f868cb2f3a266f568e45adc87",
  "created_at": "2024-12-18T11:47:08.653552+00:00",
  "ref": "shotley-peninsula-walking-route",
  "title": "Shotley Peninsula Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Shotley_Marina_entrance_lock_-_geograph.org.uk_-_1543315.jpg",
  "nearby": [
    {
      "description": "Suffolk Coast Path",
      "objectID": "0e29c3db92e53d17066c601df86904be",
      "ref": "suffolk-coast-path-walking-route"
    },
    {
      "description": "Pin Mill",
      "objectID": "80cedc5563ab1047ca3877589924f88b",
      "ref": "pin-mill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/39b20e0f868cb2f3a266f568e45adc87.gpx",
  "_geoloc": {
    "lat": 51.9693717665,
    "lng": 1.2549268384
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Shotley_Marina_entrance_lock_-_geograph.org.uk_-_1543315.jpg",
      "title": "Bob Jones / Shotley Marina entrance lock",
      "caption": "Shotley Marina entrance lock. At low water, as here, only small vessels are able to enter and leave the entrance lock. The larger yacht on the landing stage beyond will have to wait until the tide turns and rises a metre or so. The lock gates are beginning to close in order to raise the water level to the height in the marina."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Shotley_Marina_approach_channel_-_geograph.org.uk_-_1543323.jpg",
      "title": "Bob Jones / Shotley Marina approach channel",
      "caption": "Shotley Marina approach channel.  Seen here at low water, the mud and shingle banks can be seen on either side of the dredged channel in the approach to Shotley Marina, at the confluence of the Stour and Orwell rivers. A yacht waits on the landing stage for the tide to turn, to be able to enter the lock. The three posts, which are high enough to remain exposed at high water, indicate the eastern edge of the channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Bloody_Point_at_low_water_-_geograph.org.uk_-_1543310.jpg",
      "title": "Bob Jones / Bloody Point at low water",
      "caption": "Bloody Point at low water. At low water the rocks and shingle at Bloody Point are exposed, south-east of the entrance lock to Shotley Marina. In the distance the busy Felixstowe Docks can be seen. 'Bloody Point', at the confluence of the rivers Orwell and Stour, is believed to have been named after the naval battle of 885 when King Alfred fought the Danish invaders."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Crane%27s_Creek_-_geograph.org.uk_-_493219.jpg",
      "title": "Bob Jones / Crane's Creek",
      "caption": "Crane's Creek on the eastern side of the peninsula. A network of inlets fills at high water, but as the tide recedes large areas of mud flats are exposed. The River Orwell can be seen as a thin blue strip in the background, beyond which loom the ship-to-shore gantry cranes at Felixstowe's Trinity Terminal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/River_Orwell_foreshore_-_geograph.org.uk_-_493221.jpg",
      "title": "Bob Jones / River Orwell foreshore",
      "caption": "River Orwell foreshore. Here at Crane's Creek the foreshore consists of mudflats which are mostly covered at spring tides. The town of Harwich is silhouetted on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Chelmondiston_Marsh_-_geograph.org.uk_-_493223.jpg",
      "title": "Bob Jones / Chelmondiston Marsh",
      "caption": "Chelmondiston Marsh. Low-lying land to the west of the River Orwell. The footpath to Pin Mill runs along the top of the river bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/The_Orwell_near_Collimer_Point_-_geograph.org.uk_-_941374.jpg",
      "title": "Andrew Hill / The Orwell near Collimer Point",
      "caption": "The Orwell near Collimer Point on the north eastern tip of the peninsula. A receding tide reveals the main channel just after it has turned to the south. Felixstowe docks in the background. Nearby is the remains of Collimer Hard. There are a number of 'hards' on both banks of the River Orwell. They consist of compacted stone and ballast, usually marked by wooden posts. Although seldom used nowadays, they are relics of former landing points."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Erwarton_Ness_from_mid-channel_-_geograph.org.uk_-_1543414.jpg",
      "title": "Bob Jones / Erwarton Ness from mid-channel",
      "caption": "Erwarton Ness from mid-channel. Viewed from mid-channel in the River Stour, Erwarton Ness protrudes into the river, upstream of Parkeston Quay. The white building to the right is Ness Farm. Erwarton Ness is on the southern side of the peninsula."
    }
  ],
  "distance_km": 21.0,
  "description": "Starting from Shotley, this circular walk takes you along the banks of the Stour, with good views of Harwich. Cutting back across rolling farmland to Chelmondiston, you then follow the Orwell downstream, opposite Levington, before cutting back up to Shotley. A nice combination of countryside and riverside walking, with opportunities for pub stops on the way, the most notable being at Pin Mill. Here you will find the 17th century Butt and Oyster pub with great views over the little boats in the River Orwell. The walk makes use of the Suffolk Coast Path for part of the way. You could extend your walk by following the long distance path north west from Chelmondiston to the nearby Woolverstone Park.",
  "video_url": "https://www.youtube.com/embed/cf00Glok0B8",
  "postcode": "IP9 1PQ",
  "district": "Shotley",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England"
}