{
  "created_at": "2025-01-06T04:48:50.409944+00:00",
  "objectID": "3a3bc42c97847e6fc1fe51d994dbc143",
  "ref": "ingleborough-mountain-walking-route",
  "title": "Ingleborough Mountain Walking Route",
  "nearby": [
    {
      "description": "Norber Erratics",
      "objectID": "492cd4408250e9940bcb188da210c06e",
      "ref": "norber-erratics-walking-route"
    },
    {
      "description": "Pen y ghent",
      "objectID": "79d3869bc9e30ac4433b014d2821cc25",
      "ref": "pen-y-ghent-walking-route"
    },
    {
      "description": "Whernside",
      "objectID": "2eeca025ba0e941aa4aed887cff721e3",
      "ref": "whernside-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "Whernside Ingleborough Circular Walk",
      "objectID": "765ab189faaf4e4c8711764d982f7621",
      "ref": "whernside-ingleborough-circular-walk-walking-route"
    },
    {
      "description": "Ribblehead Viaduct",
      "objectID": "e8a283ca7535d6ba759add7152252016",
      "ref": "ribblehead-viaduct-walking-route"
    },
    {
      "description": "Gaping Gill",
      "objectID": "5951401fd8262c1c00e3abb3f8b58c34",
      "ref": "gaping-gill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3a3bc42c97847e6fc1fe51d994dbc143.gpx",
  "_geoloc": {
    "lat": 54.1212228091,
    "lng": -2.3918648317
  },
  "distance_km": 13.0,
  "description": "This walk climbs to Ingleborough, one of Yorshire's Three Peaks, standing at a height of 723 metres (2,372 ft). This circular walk starts in the village of Clapham and takes you along Clapham lake to Clapdale Woods. You continue along Clapham Beck toward Ingleborough Cave. You can take a short detour from the route to visit this show cave which has a long fossil gallery and interesting stalagmitic formations. From the cave you continue to Trow Gill where you will pass through a lovely, wooded limestone ravine before reaching Gaping Gill natural cave. You continue north to the summit where there are fantastic views over the Yorkshire Dales. The descent takes you through Newby Moss to Newby Cote where you pick up a country lane which takes you back to Clapham. If you'd like to continue your walking in the area then you could try climbing the other two of the Yorkshire Dales three peaks:- Pen y ghent and Whernside. On the southern slopes of Ingleborough you will find the fascinating Norber Erratics. The geologically significant set of glacial boulders were probably deposited by melting ice sheets at the end of the last ice age, around 12,000 years ago. They can be reached by heading south from Sulber Nick to Moughton Scar and Crummack Dale. You can also approach the mountain from the north from the famous Ribblehead Viaduct on our Whernside, Ingleborough Circular Walk. This route climbs to the summit via Park Fell and Simon Fell before heading to nearby Whernside.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Clapham village head to the Old Manor House for refreshments after your walk. The historic mullioned farmhouse was built in 1640 and has since been renovated to house the Clapham Bunkhouse (Group Accommodation) and The Reading Room Cafe/Bar licensed to sell hot food, alcohol, arts, crafts and gifts. It's got a great menu and sells some fine real ales. You can find it on Church Avenue at postcode LA2 8EQ.The New Inn is another good option, set in an 18th-century coaching inn overlooking the Clapham Beck (Postcode:LA2 8HH). There's also the Game Cock in Austwick which is a traditional Dales pub on the village green, serving good British food with a French/Mediterranean twist (postcode: LA2 8BB)."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The area surrounding the mountain is also designated as a National Nature Reserve. The limestone habitats promote a range of interesting wildflowers including Yorkshire primrose, limestone pavement with bloody crane's-bill, calcareous grassland with common rock-rose and limestone rock outcrops, cliffs and scree with juniper. Wildlife also thrives with the northern brown argus butterfly, curlew and roe deer to look out for in the area. The Dales High Way passes over the mountain. This long distance waymarked trail explores many of the highlights of the Dales, running from Saltaire to Appleby-in-Westmorland for a distance of approximately 90 miles."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bx8Eh7HR5ts",
  "postcode": "LA2 8EF",
  "district": "Clapham",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Clapdale Lane, Clapham cum Newby, Clapham, North Yorkshire, York and North Yorkshire, England, LA2 8EF, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain",
    "limestone"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "geological features"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}