{
  "objectID": "3a9426fea249fb02bb25516e43aaa5f6",
  "created_at": "2024-12-18T18:19:57.036258+00:00",
  "ref": "loch-duich-and-glen-shiel-walking-route",
  "title": "Loch Duich and Glen Shiel Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Loch_Duich_-_geograph.org.uk_-_3044629.jpg?20220112134657",
  "nearby": [
    {
      "description": "Plockton",
      "objectID": "c2e4400519e73d2b7ddb463681e4c36b",
      "ref": "plockton-walking-route"
    },
    {
      "description": "Lochcarron",
      "objectID": "601a87180dcfcfc13d9177f313d3bf38",
      "ref": "lochcarron-walking-route"
    },
    {
      "description": "Knoydart and Inverie",
      "objectID": "ae354b490745cbe1e89e5d3c2a763b0f",
      "ref": "knoydart-and-inverie-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3a9426fea249fb02bb25516e43aaa5f6.gpx",
  "_geoloc": {
    "lat": 57.2140171772,
    "lng": -5.4205397793
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Loch_Duich_-_geograph.org.uk_-_3044629.jpg?20220112134657",
      "title": "Loch Duich by Douglas Nelson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Loch Duich. The area has an interesting history as in 1719, British forces burned many homesteads along the loch's shores in the month preceding the Battle of Glen Shiel. The battle took place on 10 June 1719 during the Jacobite rising of the same year. It was a confrontation between a Jacobite army, composed of Scottish Highlanders and Spanish marines, and the British government forces. This skirmish marked a decisive defeat for the Jacobites and effectively ended the 1719 rising. The uprising was part of a larger conflict involving Spain, which was then engaged in the War of the Quadruple Alliance against Britain and other European powers. Initially, the Spanish had planned a larger-scale invasion of Britain, including a landing in south-west England to coincide with the uprising in Scotland. However, due to bad weather and other logistical issues, the main invasion was abandoned, leaving the smaller force in the Highlands unsupported. The Jacobite forces, led by William Murray, Marquess of Tullibardine, and supported by around 300 Spanish marines, took up a defensive position in the narrow pass of Glen Shiel. They were met by a British government force under General Joseph Wightman, which included regular infantry, dragoons, and artillery. Despite fierce resistance, the Jacobites were eventually overwhelmed by the superior firepower and numbers of the government troops. The Spanish contingent surrendered, and many of the Jacobite leaders fled into exile. The battle's significance lies not only in its immediate impact but also in its broader consequences for the Jacobite cause. It demonstrated the inability of the Jacobites to sustain a major rebellion without substantial foreign support, which Spain was unable to provide after the failure of the main invasion. The battlefield is now protected as part of the Inventory of Historic Battlefields in Scotland, managed by Historic Scotland, ensuring its preservation as a site of historical importance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Loch_Duich_-_geograph.org.uk_-_2987977.jpg/512px-Loch_Duich_-_geograph.org.uk_-_2987977.jpg?20220102211840",
      "title": "Loch Duich by Stephen Darlington, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The legend associated with Loch Duich tells the story of three brothers who encountered three seal-maidens dancing in the moonlight. Having removed their seal skins and assumed human form, the maidens were entrancing. The brothers, captivated by their beauty, stole the seal skins, intending to marry the maidens. The youngest brother, however, was moved by the distress of his chosen seal-girl and returned her skin. This act of kindness allowed him to visit her every ninth night, thanks to her father's consent. The fate of the other brothers was less fortunate. The middle brother’s wife eventually found her stolen seal-skin and returned to the sea, leaving him behind. The eldest, in a desperate attempt to prevent a similar outcome, burnt his wife's fur. Tragically, he accidentally burned her as well, losing her forever. Another mysterious tale connected to the area involves the \"McRae film,\" an elusive piece of footage allegedly showing a creature in Loch Ness. Some accounts suggest that a second, equally secretive film exists, purportedly showing a similar creature in Loch Duich. These films, if they exist at all, are said to be in a secret trust, with only a few people having seen them. Their existence remains a topic of speculation among Loch Ness researchers and enthusiasts."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Causeway_across_Loch_Duich_-_geograph.org.uk_-_3377521.jpg?20220417003534",
      "title": "Causeway across Loch Duich by Jim Barton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Causeway across Loch Duich"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Cottage_by_road%2C_on_lochside_-_geograph.org.uk_-_487840.jpg?20110205011649",
      "title": "RH Dengate / Cottage by road, on lochside",
      "caption": "Cottage by road, on lochside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Totaig%2C_Loch_Duich_-_geograph.org.uk_-_908640.jpg?20110221210248",
      "title": "Lisa Jarvis / Totaig, Loch Duich",
      "caption": "Totaig, Loch Duich"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Eilean_Donan_Castle_-_geograph.org.uk_-_134915.jpg?20100131035823",
      "title": "Ken Crosby / Eilean Donan Castle",
      "caption": "Eilean Donan Castle. Eilean Donan is a small tidal island located in the western Highlands of Scotland, near the village of Dornie. It lies at the meeting point of three sea lochs: Loch Duich, Loch Long, and Loch Alsh. The island is connected to the mainland by a footbridge, which was added in the early 20th century. The island is best known for its picturesque castle, which is a popular subject for photographers and has appeared in numerous films and television shows. The original castle on Eilean Donan was built in the 13th century and served as a stronghold for the Clan Mackenzie and their allies, the Clan MacRae. However, it was destroyed in 1719 by government forces in response to the Mackenzies' involvement in the Jacobite rebellions. The castle we see today is a 20th-century reconstruction carried out by Lieutenant-Colonel John Macrae-Gilstrap, who meticulously restored it to its former glory between 1919 and 1932. Eilean Donan is part of the Kintail National Scenic Area, one of Scotland's 40 designated National Scenic Areas, recognised for their exceptional landscapes. According to the 2001 census, the island had a recorded population of just one person, although there were no \"usual residents\" noted during the 2011 census. The island's name, Eilean Donan, translates to \"island of Donnán,\" named after the Celtic saint Donnán of Eigg, who was martyred in 617. It is believed that he established a church on the island, although no trace of this early structure remains today."
    }
  ],
  "distance_km": 10.1,
  "description": "This walk or cycle takes you along Loch Duich in the Scottish Highlands. Along the way you can enjoy some splendid views over the expansive lake to the Glen Shiel Mountains. The route can be extended by heading north west along the Old Military Road to Ratagan Forest and Glen More. The route starts at Shiel Bridge at the southern end of the loch. From here you can follow a pleasant track along the western side of the water to Totaig. The quiet minor road is suitable for both walkers or cyclists. At the end of the route you can enjoy views across the water to Eilean Donan Castle at Dornie. See the photos below for more details of the history of the area.",
  "video_url": "https://www.youtube.com/embed/j_nrGdN6DQ4?si=lNSSb_xvP1d6S2Vc",
  "county": "Highland",
  "region": "Scotland",
  "country": "Scotland"
}