{
  "created_at": "2025-01-06T00:39:03.591901+00:00",
  "objectID": "3bdbd40d5eed33da673ec68a417f47ed",
  "ref": "abinger-roughs-walking-route",
  "title": "Abinger Roughs - Rhododendron Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Bridleway_in_Abinger_Roughs_-_geograph.org.uk_-_818904.jpg",
  "nearby": [
    {
      "description": "Abinger Common",
      "objectID": "cbbfe861d4988621af770748e8083ed5",
      "ref": "abinger-common-walking-route"
    },
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Ranmore Common",
      "objectID": "e65b70df28890a705c173ed6fcd48c05",
      "ref": "ranmore-common-walking-route"
    },
    {
      "description": "Friday Street",
      "objectID": "b3ff91772988e6b175ba57f909058a6c",
      "ref": "friday-street-walking-route"
    },
    {
      "description": "Gomshall",
      "objectID": "ac6c904252cf350c0e2212a59d9c50c8",
      "ref": "gomshall-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3bdbd40d5eed33da673ec68a417f47ed.gpx",
  "_geoloc": {
    "lat": 51.2202130684,
    "lng": -0.4109660829
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Bridleway_in_Abinger_Roughs_-_geograph.org.uk_-_818904.jpg",
      "title": "Colin Smith / Bridleway in Abinger Roughs, via Wikimedia Commons",
      "caption": "Bridleway in Abinger Roughs Sandy and wide track following the northern edge of deciduous woodland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Abinger_Roughs_car_park_-_geograph.org.uk_-_1508172.jpg",
      "title": "Hugh Craddock / Abinger Roughs car park, via Wikimedia Commons",
      "caption": "Abinger Roughs car park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Paths_on_Abinger_Roughs_-_geograph.org.uk_-_1509099.jpg",
      "title": "Hugh Craddock / Paths on Abinger Roughs, via Wikimedia Commons",
      "caption": "Paths on Abinger Roughs"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Rhododendron_in_The_Roughs_-_geograph.org.uk_-_818922.jpg",
      "title": "Colin Smith / Rhododendron in The Roughs, via Wikimedia Commons",
      "caption": "Rhododendron in The Roughs. These purple flowers brighten up the woodland here in late spring"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Late_Spring_in_The_Roughs_-_geograph.org.uk_-_818919.jpg",
      "title": "Colin Smith / Late Spring in The Roughs, via Wikimedia Commons",
      "caption": "Late Spring in The Roughs. A large bank of flowering rhododendrons, some 15 feet high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/The_Roughs_-_geograph.org.uk_-_818911.jpg",
      "title": "Colin Smith / The Roughs, via Wikimedia Commons",
      "caption": "The Roughs Rhododendrons in bloom beside the circular sandy footpath through the site, by Abinger Hammer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Abinger_Hammer_Cricket_Pitch_-_geograph.org.uk_-_523348.jpg",
      "title": "Ben Gamble / Abinger Hammer Cricket Pitch, via Wikimedia Commons",
      "caption": "Abinger Hammer Cricket Pitch. A summer weekend scene with cricket on the green, and children playing in the Tillingbourne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Clock_at_Abinger_Hammer_-_geograph.org.uk_-_1160838.jpg",
      "title": "Peter Trimming / Clock at Abinger Hammer, via Wikimedia Commons",
      "caption": "Clock at Abinger Hammer"
    }
  ],
  "distance_km": 3.0,
  "description": "This circular walk in Abinger Hammer takes you around an attractive, elevated woodland area. Start your walk from the car park at the eastern end of the site. From here you can pick up nature trails heading west towards Arbinger Hammer. There's a series of nice shady woodland paths and in the spring months you can see carpets of bluebells and lots of lovely Rhododendrons flowering. The Roughs also include magnificent oak trees, open glades and fine views over the North Downs from the high points. At the western side of the woods you will find the delightful village of Arbinger Hammer. In summer the village green is popular with people picnicing on the grass whilst watching a game of cricket in surroundings which are quintessentially English. The River Tillingbourne also flows through the village. Brown trout regurlarly swim in the stream and the occasional larger rainbow trout can also be sighted. You can enjoy refreshments in the delightful Abinger Hammer Village Shop & Tea Rooms which has a nice garden from which you can watch the cricket. The sister site of Abinger Common is located just over mile south east of the Roughs at Friday Street. There's miles of nice woodland trails, ponds, streams and great views from the many viewpoints on the expansive common. The National Trust's Holmwood Common is also located very near here. The North Downs Way passes just to the north of the site so it's easy to extend your walking in the immediate area. You could pick up the trail and head north east to visit Ranmore Common. It's an excellent area for walking with miles of good footpaths taking you through woodland and open downland, with great views of the Surrey Hills. Also nearby on the trail is Box Hill Country Park. Here you will find more great walking trails with panoramic views of the western Weald and a riverside path along the River Mole. On the eastern edge of Ranmore common you will find the National Trust owned Denbies Hillside where there are waymarked trails with more nice viewpoints to enjoy the beautiful countryside of this area of southern England.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the west is the neighbouring Gomshall where you'll find nice trails along the Tilling Bourne stream and a fine pub in the shape of the Compasses Inn. The pub includes a delightful riverside garden where you can it out on warmer days. They serve good quality food and also have a large parking area. You can find them on Station Road at postcode GU5 9LA for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Friday Street Walk can be picked up on nearby Abinger Common. It explores the pretty Friday Street Mill Pond and the 17th century Wotton House Estate before heading to the Tillingbourne Waterfall on the River Tillingbourne."
    }
  ],
  "postcode": "RH5 6BF",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Abinger Roughs, Abinger Roughs Nature Trail, Abinger, Mole Valley, Surrey, England, RH5 6BF, United Kingdom",
  "district": "Mole Valley",
  "state": "England"
}