{
  "created_at": "2025-01-05T23:27:06.070868+00:00",
  "objectID": "3cc86a6a6c74fa8c4b917e7d16d82831",
  "ref": "monsal-head-walking-route",
  "title": "Monsal Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/32/Monsal_Head_-_geograph.org.uk_-_307195.jpg",
  "nearby": [
    {
      "description": "Monsal Trail",
      "objectID": "725064cd118a55da0f494227d083e732",
      "ref": "monsal-trail-walking-and-cycle-route"
    },
    {
      "description": "Miller's Dale",
      "objectID": "b1b5451a34708ce105fcf182f5d6a29b",
      "ref": "millers-dale-walking-route"
    },
    {
      "description": "Cressbrook Dale",
      "objectID": "f40731d3529f879bfbb4df2819707045",
      "ref": "cressbrook-dale-walking-route"
    },
    {
      "description": "Monsal Dale",
      "objectID": "0497624bd85f35d6a4053c68dd682da8",
      "ref": "monsal-dale-walking-route"
    },
    {
      "description": "Great Longstone",
      "objectID": "30d5cfe123b4dde0820638e2441aa837",
      "ref": "great-longstone-walking-route"
    },
    {
      "description": "Chelmorton",
      "objectID": "c51d2a582cf2823244a59466ce8b9692",
      "ref": "chelmorton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3cc86a6a6c74fa8c4b917e7d16d82831.gpx",
  "_geoloc": {
    "lat": 53.2406872836,
    "lng": -1.7246669752
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Monsal_Head_-_geograph.org.uk_-_307195.jpg",
      "title": "Philip Halling / Monsal Head, via Wikimedia Commons",
      "caption": "Monsal Head View over the Wye valley and the River Wye."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Monsal_Head_Viaduct_from_Monsal_Head_Pub_-_geograph.org.uk_-_344292.jpg",
      "title": "Roy Turner / Monsal Head Viaduct from Monsal Head Pub, via Wikimedia Commons",
      "caption": "Monsal Head Viaduct from Monsal Head Pub"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Monsal_Head%2C_Hotel%2C_Monsal_Head_-_geograph.org.uk_-_1589834.jpg",
      "title": "Dave Hitchborne / Monsal Head, Hotel, Monsal Head, via Wikimedia Commons",
      "caption": "Monsal Head, Hotel. The hotel has one of the best views in Derbyshire, that of Monsal Dale, a valley carved out by the River Wye."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Footpath_to_Monsal_Dale_from_Monsal_Head_-_geograph.org.uk_-_756337.jpg",
      "title": "Alan Heardman / Footpath to Monsal Dale from Monsal Head, via Wikimedia Commons",
      "caption": "Footpath to Monsal Dale from Monsal Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Monsal_Dale%2C_Monsal_Head_-_geograph.org.uk_-_1589853.jpg",
      "title": "Dave Hitchborne / Monsal Dale, Monsal Head, via Wikimedia Commons",
      "caption": "Monsal Dale, Monsal Head. This steep-sided limestone valley was carved out by the River Wye on its way to the River Derwent. A railway line was laid through here in the 1870s and in order to negotiate the river and valley, the Midland Railway had to build the viaduct, which can be seen below. This Matlock to Buxton line was bitterly opposed, but it went ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Monsal_Dale_from_Monsal_Head_Pub_-_geograph.org.uk_-_344296.jpg",
      "title": "Roy Turner / Monsal Dale from Monsal Head Pub, via Wikimedia Commons",
      "caption": "Monsal Dale from Monsal Head Pub"
    }
  ],
  "distance_km": 2.0,
  "description": "This circular walk from Monsal Head crosses the Headstone Viaduct for fine views across the Derbyshire Dales. You can start the walk from the public car park, located behind the Monsal Head Hotel. The hotel is in an elevated position with tremendous views down to the valley and the viaduct from the viewpoint. From the car park you can pick up footpaths heading west to the bridge which you can cross on foot. The viaduct was built by the Midland Railway over the River Wye in 1836 and is some is 300 feet (91 m) long. The footpaths then run along both sides of the River Wye with weirs and attractive woodland to see on the way. After your walk you can enjoy refreshments at the Monsal Head Hotel. This includes the Stables Bar which has a nice outdoor seating area for relaxing in during the warmer months. The building's origin is a little uncertain, however it was part of The Railway Hotel, which was rebuilt around the late 1800’s early 1900’s from an earlier Inn on the site called, The Bulls Head. To continue your walking in the area pick up the popular Monsal Trail and follow it west to the lovely Cressbrook Dale and Miller's Dale. This popular beauty spot includes shady wooded valleys, rushing rivers and lots of interesting flora and fauna.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the east you will find the village of Little Longstone. Here you can pay a visit to the excellent Packhorse Inn. This historic pub has a fine range of ales and a cosy real fire indoors. Outside there's a lovely garden area where you can relax on warmer days. You can find the pub in the pretty little village at postcode DE45 1NN. At neighbouring Great Longstone you can investigate the excellent Crispin. The inn dates back to the 1600s and includes a charming interior with ceiling beams studded with a wonderful array of beer mugs and old horse buckles. They do a fine Sunday lunch which you can enjoy in the sunny garden area. You can find them on Main Street at postcode DE45 1TZ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east is the worthy village of Great Longstone. The historic village includes a 13th century church and a fine 17th century pub. Our circular walk from the village climbs to the splendid limestone ridge at Longstone Edge, just to the north of the settlement. Just to the west there's Chelmorton, an interesting settlement which makes a fine start point for exploring the area. The village includes an ancient 11th century church and a fine 18th century pub too. Just to the south you will find the village of Sheldon and the noteworthy Magpie Mine. Here you can explore a series of well preserved Lead Mines which date back to the 1600s. The historical site is a Scheduled Ancient Monument and another of the local area highlights. For more walking ideas in the area see the White Peak Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_2RDJz7lAcs",
  "postcode": "DE45 1NL",
  "district": "Monsal Head",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}