{
  "created_at": "2025-01-06T04:33:43.620834+00:00",
  "objectID": "3cd6658b220f3ff92f2c39acf0bb436f",
  "ref": "dart-valley-trail-walking-route",
  "title": "Dart Valley Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Dart_Valley_Trail_-_geograph.org.uk_-_1131864.jpg",
  "nearby": [
    {
      "description": "Dartmouth to Dittisham",
      "objectID": "1720ebcbf9c539413bcb0ea12f948c22",
      "ref": "dartmouth-to-dittisham-walking-route"
    },
    {
      "description": "Dartmouth and the Dart Estuary",
      "objectID": "b65b1207c04694366394cb64ab98c180",
      "ref": "dartmouth-and-the-dart-estuary-walking-route"
    },
    {
      "description": "Totnes River Walk",
      "objectID": "aef271cd17d3396197255c8e2b5e90f5",
      "ref": "totnes-river-walk-walking-route"
    },
    {
      "description": "Coleton Fishacre",
      "objectID": "126b04fac500cf86ff6ead2f989ed5cb",
      "ref": "coleton-fishacre-walking-route"
    },
    {
      "description": "John Musgrave Heritage Trail",
      "objectID": "315c508a5a2e96b2374de6c0afd38855",
      "ref": "john-musgrave-heritage-trail-walking-route"
    },
    {
      "description": "Kingswear to Greenway Walk",
      "objectID": "9f21ef4053b486c9006f9a5b94e48053",
      "ref": "kingswear-to-greenway-walk-walking-route"
    },
    {
      "description": "Sharpham Estate",
      "objectID": "f80cd0ea7bb172c11f324426229819a3",
      "ref": "sharpham-estate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3cd6658b220f3ff92f2c39acf0bb436f.gpx",
  "_geoloc": {
    "lat": 50.430297131,
    "lng": -3.6828574829
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Dart_Valley_Trail_-_geograph.org.uk_-_1131864.jpg",
      "title": "Derek Harper / Dart Valley Trail",
      "caption": "The trail, accompanied by the John Musgrave Heritage Trail and following Ashprington Footpath 8, crosses a small tributary of the Dart below Sharpham Barton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Shadows_by_the_Dart_Valley_Trail_-_geograph.org.uk_-_1131908.jpg",
      "title": "Derek Harper / Shadows by the Dart Valley Trail",
      "caption": "Shadows by the Dart Valley Trail. Tall trees cast shadows across a field by the cyclable alternative of two arms of the trail near the Sharpham Estate. The two variations meet at the signpost under the oak in the side-valley; the reed beds by the River Dart are beyond. To the left in the valley is a willow bed area with boardwalk. The estate is now run as a mindfulness retreat but is open to the public on certain days."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Dart_valley_-_geograph.org.uk_-_1516987.jpg",
      "title": "Derek Harper / Dart valley",
      "caption": "Dart valley From NCN 2 as it follows the Sharpham carriage drive, looking across the Home Reach of the river's estuary. The Dart Valley Trail runs along the foot of the slope here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Old_Mill_Creek_from_the_Dart_Valley_Trail_-_geograph.org.uk_-_1271291.jpg",
      "title": "Derek Harper / Old Mill Creek from the Dart Valley Trail",
      "caption": "Old Mill Creek from the trail. The trail is descending a permissive footpath by the side of Peppersheen Plantation; it then turns right past the oak on the right, before following close to the creek's edge through SX8652. On the far side of the creek is Newfoundland Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Boats_on_the_River_Dart_-_geograph.org.uk_-_1188630.jpg/256px-Boats_on_the_River_Dart_-_geograph.org.uk_-_1188630.jpg",
      "title": "Derek Harper / Boats on the River Dart",
      "caption": "Boats on the River Dart. Looking from the Dart Valley Trail. On the far bank is Lower Kilngate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Oak_tree_above_Dart_-_geograph.org.uk_-_269292.jpg",
      "title": "Derek Harper / Oak tree above Dart",
      "caption": "Oak tree above Dart. The Dart estuary seen from the Dart Valley Trail south of Dittisham. Maypool boathouse is on the far side of the Dart, beneath Long Wood. On the extreme right is Glebe Plantation, and beyond that is Lord's Wood. Below left are outbuildings of The River Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/River_Dart_at_Dittisham_-_geograph.org.uk_-_1479694.jpg",
      "title": "Ian Petticrew [CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "River Dart at Dittisham. Dittisham is situated on the banks of the tidal River Dart, some 2 miles (3.2 km) upstream of Dartmouth. A most attractive and unspoilt village, it has become a popular destination for yachtsmen, tourists and a sought after place to live, which is reflected its relatively high property prices. The village is believed to be named after 'Deedas', a Saxon chief, who probably settled here soon after the Saxon invasion of Devon in about 660 A.D. The village hosts an interesting and pleasing variety of building styles (and colours); this view is towards the ferry that crosses the River Dart."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Dartmouth_-_geograph.org.uk_-_474020.jpg",
      "title": "Trevor Rickard / Dartmouth",
      "caption": "Dartmouth. View upstream towards the harbour and town centre."
    }
  ],
  "distance_km": 19.0,
  "description": "This beautiful trail takes you along the River Dart from Totnes to Dartmouth. The trail passes through the villages of Ashprington, Cornworthy and Dittisham before finishing at Dartmouth Harbour. Highlights near the route include the splendid National Trust owned Greenway Estate. Formerly owned by Agatha Christie it boasts an 18th century Georgian house and lovely riverside gardens. This is a fairly easy walk with very few climbs and links with the South West Coast Path. The northern end of the trail links with the circular Totnes River Walk which follows the Franklin Totnes Trail along a different part of the river.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Maltsters in Tuckenhay is a nice place for a pit stop. The 18th century pub is located in a lovely riverside spot with fine views over the wide quay. The pub featured in The Times ‘Best 50 Places to Eat Al Fresco’ and was described by The Independent as ‘One of Britain’s Best Riverside Locations’. The pub was once owned by the famous TV chef Keith Floyd. They serve fine food and also provide good quality accommodation. The little hamlet is very pretty with a picturesque old mill and waterside trails along the Bow Creek, one of the River Dart tributaries."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative way of seeing the river valley try the splendid South Devon Railway. The heritage railway can be picked up at Buckfastleigh Station and runs for about 6 miles with nice views over the river valley. It was initially known as the Dart Valley Railway and stretches from Totnes (Riverside) to Buckfastleigh. For most of its route, the line runs to the east or north of the River Dart. This means that the river views are best seen to the left of the train when facing Buckfastleigh and to the right of the train when facing Totnes. For steam train enthusiasts the rolling stock preserved on the line include many examples of steam locomotives typical of the Great Western Railway. These include GWR 1400 Class number 1420. There are also other types of steam locomotives and a number of diesel locomotives.   Pictured above the South Devon Railway at Buckfastleigh. On the right former Great Western Railway locomotive No. 5786 and train awaiting departure for Totnes in an idyllic rural setting on a warm Sunday afternoon. It's a fine way to relax and enjoy the beautiful scenery of the area while taking the weight of your feet. In Dartmouth you could catch the ferry to Kingswear and visit the splendid gardens at Coleton Fishacre. The John Musgrave Heritage Trail links up with the trail near Totnes. The waymarked trail runs from Maidencombe to Brixham, visiting several of South Devon's interesting historical sites on the way."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sHsTFiXm-IQ",
  "postcode": "TQ9 5DW",
  "district": "Totnes",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}