{
  "objectID": "3cea821030f480821c47a211bd53961c",
  "created_at": "2024-12-19T21:54:25.899890+00:00",
  "ref": "chertsey-walking-route",
  "title": "Chertsey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Chertsey_Bridge._-_geograph.org.uk_-_112866.jpg",
  "nearby": [
    {
      "description": "Weybridge",
      "objectID": "2fa92082b2ba914451fd952378c3c5fc",
      "ref": "weybridge-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Walton on Thames",
      "objectID": "c9f18fde8f770c6582ffc987380f00cd",
      "ref": "walton-on-thames-walking-route"
    },
    {
      "description": "Shepperton",
      "objectID": "c191b8bcfcdefb30850661ffd3ff9954",
      "ref": "shepperton-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/9733ECC53D4BDCE486258575005AA7FE/$FILE/Chertsey.gpx",
  "_geoloc": {
    "lat": 51.3886638491,
    "lng": -0.4872388562
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Chertsey_Bridge._-_geograph.org.uk_-_112866.jpg",
      "title": "Colin Smith / Chertsey Bridge.",
      "caption": "Chertsey Bridge. The bridge was built in 1785, replacing a ruinous timber bridge about 70 feet downstream. The architect was James Paine, and Charles Brown, who built Richmond Bridge, was the successful tenderer for the construction work with a fee of £7,325. The bridge as originally designed by Paine had five arches, but the bridge as built needed extending so a further two arches were added. Today the bridge carries the B375 road over the River Thames."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Chertsey_Meads_-_geograph.org.uk_-_1452215.jpg",
      "title": "Maxwell Hamilton / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Looking across the Chertsey Meads (meadows)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Shepperton_to_Weybridge_Ferry.jpg",
      "title": "Rick Hall / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Shepperton to Weybridge Ferry, linking the towns of Shepperton and Weybridge across the River Thames in the English county of Surrey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Thames_Lock_-_geograph.org.uk_-_949036.jpg",
      "title": "Graham Horn / Thames Lock",
      "caption": "Thames Lock. The first lock on the Wey Navigation, used in conjunction with the stop lock below the bridge to provide enough depth of water over the bottom cill. This is also the point where you pay for a licence to cruise on the navigation, the price varying upon size of boat and length of stay. You also have to buy a specific sized windlass to operate the locks of the navigation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/P%C3%A9niche_and_houseboat_at_Dumsey_Eyot_-_geograph.org.uk_-_948824.jpg",
      "title": "Graham Horn / Péniche and houseboat at Dumsey Eyot",
      "caption": "Péniche and houseboat at Dumsey Eyot. Both semi-permanently moored, this is a contrast in styles between a French péniche and a very Thamesian houseboat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/The_Kingfisher_-_geograph.org.uk_-_931240.jpg",
      "title": "David Lally / The Kingfisher",
      "caption": "The Kingfisher. With gardens with river views. Across the minor, humped road to Laleham's riverside only on the left from the eastern end of Chertsey Bridge."
    }
  ],
  "distance_km": 8.0,
  "description": "A circular walk around the Surrey town of Chertsey, visiting the Chertsey Meads, the River Bourne, the Abbey River, the Wey Navigation and the River Thames. Along the way there's nice countryside views, pretty locks and easy riverside paths. The walk starts from the picturesque Chertsey Bridge over the River Thames. This noteworthy structure is a seven-arch white stone bridge built in 1785 and is designated as a Grade II* listed building. Follow the public footpaths south east from the bridge and they will take you to Chertsey Meads where you can enjoy a stroll along the Bourne River and views across the open meadows. You'll pass Woburn Park and Hamm Court Farm where you pick up the Thames Path . This will take you north east past Hamhaugh Island in Weybridge . At the quay you can pick up the Weybridge to Shepperton Ferry . The ferry has been running for 500 years and enables people walking or cycling the Thames Path to continue their journey past Shepperton Lock without being diverted by the Wey Navigation. On the other side of the river you can pick up the Thames Path again and follow it west past Dumsey Eyot to Chertsey Bridge.",
  "postcode": "KT16 8LQ",
  "district": "Chertsey",
  "county": "Surrey",
  "region": "South East",
  "country": "England"
}