{
  "created_at": "2025-01-06T03:56:21.506183+00:00",
  "objectID": "3d27e1e1e935b254be750d2f13869c0a",
  "ref": "west-island-way-walking-route",
  "title": "West Island Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/31/Kilchattan_Bay_-_geograph.org.uk_-_3684986.jpg",
  "nearby": [
    {
      "description": "Five Ferries",
      "objectID": "2d12a15ab76d09d96250752a8290d43c",
      "ref": "five-ferries-cycle-route"
    },
    {
      "description": "Rothesay to Ettrick Bay",
      "objectID": "5383f39c1d248db28eefb7b7fc531236",
      "ref": "rothesay-to-ettrick-bay-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Kilchattan_Bay_-_geograph.org.uk_-_3684986.jpg",
      "title": "Kilchattan Bay by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Kilchattan Bay. This remote village is located at the island's southern end, along the coast road at the foot of a steep hill called the Suidhe Chattan which shields the village from the prevailing westerly wind. The village faces the mainland to the east across the Firth of Clyde. A sandy bay known locally as the Wee Bay sweeps around to the north. To the south along the coast is the start of the West Island Way which leads along the rocky shore and past the lighthouse which marks the southern end of the island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Graveyard_at_St_Blane%27s_Church_-_geograph.org.uk_-_2156133.jpg/512px-Graveyard_at_St_Blane%27s_Church_-_geograph.org.uk_-_2156133.jpg",
      "title": "Graveyard at St Blane's Church by Leslie Barrie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Graveyard at St Blane's Church. There are extensive ruins of this ancient church close to the southern tip of the Isle of Bute. The 12th century church was built in a sheltered hollow near the top of a south facing slope. From here there are beautiful views south to the Isle of Arran and its outlier, Holy Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Bute%2C_Loch_Fad_-_geograph.org.uk_-_79730.jpg",
      "title": "william craig / Bute, Loch Fad",
      "caption": "Bute, Loch Fad. Loch Fad is a freshwater loch located on the walk, just south of Rothesay. The trail passes over the causeway between the loch and the adjacent Kirk Dam Reservoir. Its name means \"long loch\" in Scottish Gaelic and it lies on the Highland Boundary Fault. Its surface area is 71 hectares (180 acres), fairly large for a freshwater loch on an island in Scotland. It is the site of one of the largest rainbow trout cage farms in the UK. In 2018, it was used for tests of Donald Campbell's boat, Bluebird."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Bute%2C_Loch_Ascog_-_geograph.org.uk_-_112509.jpg",
      "title": "william craig / Bute, Loch Ascog",
      "caption": "Bute, Loch Ascog. The loch supplies water to the town of Rothesay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Rothesay_Castle_-_geograph.org.uk_-_3147169.jpg/512px-Rothesay_Castle_-_geograph.org.uk_-_3147169.jpg",
      "title": "Rothesay Castle by James T M Towill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rothesay Castle. This ruined castle has been described as \"one of the most remarkable in Scotland\", for its long history dating back to the beginning of the 13th century, and its unusual circular plan."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Rothesay_-_Rhubodach%2C_Lay-By_-_geograph.org.uk_-_166756.jpg",
      "title": "william craig / Rothesay - Rhubodach, Lay-By",
      "caption": "Eastern coast"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/West_Island_Way_marker_-_geograph.org.uk_-_370182.jpg",
      "title": "Andrew Spenceley / West Island Way marker",
      "caption": "West Island Way marker in the northern part of the island. The Bute long distance footpath,the West Island Way, climbs across the moorland on a boggy, faint path before entering forest behind the photographer. The highest point on Bute, Windy Hill, can just be seen above the ridge across the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Harbour%2C_Port_Bannatyne_-_geograph.org.uk_-_3682581.jpg",
      "title": "Harbour, Port Bannatyne by Richard Webb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Harbour, Port Bannatyne. The walk finishes in this coastal village which is home to many steamers. Port Bannatyne developed into the 1900s as a quieter and more unusual alternative to Rothesay. It is a popular harbour, with a small yacht marina and boatyard and an unusual 13-hole golf course rather than the standard 18."
    }
  ],
  "distance_km": 48.0,
  "description": "Explore the beautiful Isle of Bute on this stunning walk. The walk starts near Kilchattan Bay towards the southern end of the island. Here you first head south on a circular loop visiting St Blane's Church and the remains of an ancient monastery. The walk then heads north towards Rothesay, passing a series of lochs on the way. Here you can visit the substantial ruins of the 13th century Rothesay castle. The route continues to the northern part of the island, passing Kilbride Hill before a woodland section. The final section then takes you along the coast and the Kyles of Bute on the eastern part of the island. You'll head south before finishing at Kames Bay in Port Bannatyne.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Five Ferries Cycle Route passes through the island. It uses 5 ferry crossings to explore the Isle of Arran, the Kintyre Peninsula and the Cowal Peninsula. Much of the route is on quiet lanes so suitable for walkers as well. The Rothesay to Ettrick Bay circular walk uses part of the trail to visit the picturesque Ettrick Bay on the western side of the island."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mLizO1uX5qE",
  "gazetteer_found": false
}