{
  "created_at": "2025-01-06T00:02:48.396329+00:00",
  "objectID": "3e369c17bf5ffe62945735163bfd167f",
  "ref": "river-teign-walk-walking-route",
  "title": "River Teign Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/River_Teign%2C_7_September_2012_%282%29.jpg/512px-River_Teign%2C_7_September_2012_%282%29.jpg",
  "nearby": [
    {
      "description": "Stover Country Park",
      "objectID": "87465cf07237d2185f9c72b1b861ebd3",
      "ref": "stover-country-park-walking-and-cycle-route"
    },
    {
      "description": "Fernworthy Reservoir",
      "objectID": "795bfefc9262ec21e8b620118557ede6",
      "ref": "fernworthy-reservoir-walking-route"
    },
    {
      "description": "Bellever Forest",
      "objectID": "85077e1b59350bc84ced5819ee7acb87",
      "ref": "bellever-forest-walking-and-cycle-route"
    },
    {
      "description": "Fingle Woods",
      "objectID": "f3249f8567e57792017b386bced05a94",
      "ref": "fingle-woods-walking-route"
    },
    {
      "description": "Castle Drogo",
      "objectID": "f6c966e23c25bf8f635b039f2fb63eea",
      "ref": "castle-drogo-walking-route"
    },
    {
      "description": "Stover Canal",
      "objectID": "60bd1f2dce91c4d9a07a4129b091ee06",
      "ref": "stover-canal-walking-route"
    },
    {
      "description": "Chudleigh",
      "objectID": "ee5c352c3e14f9c01f1c344d166dcea5",
      "ref": "chudleigh-walking-route"
    },
    {
      "description": "Scorhill Stone Circle",
      "objectID": "8fe91fd19baadf3701a0c727c44b575b",
      "ref": "scorhill-stone-circle-walking-route"
    },
    {
      "description": "Labrador Bay",
      "objectID": "da79d3bfc12c804fa49a929921e54839",
      "ref": "labrador-bay-walking-route"
    },
    {
      "description": "Dunsford Daffodil Circular Walk",
      "objectID": "4792bf4403f6d505df813f245561af41",
      "ref": "dunsford-daffodil-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3e369c17bf5ffe62945735163bfd167f.gpx",
  "_geoloc": {
    "lat": 50.5934277983,
    "lng": -3.9131131306
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/River_Teign%2C_7_September_2012_%282%29.jpg/512px-River_Teign%2C_7_September_2012_%282%29.jpg",
      "title": "By Barry Lewis (River Teign Evening - 2) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "River Teign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/River_Teign_-_geograph.org.uk_-_941138.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Teign near Arch Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/River_Teign_-_geograph.org.uk_-_1371723.jpg",
      "title": "David Smith [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "River Teign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/River_Teign_at_Teignmouth.jpg/512px-River_Teign_at_Teignmouth.jpg",
      "title": "By Geof Sheppard (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Virgin Cross Country Voyager DMU approaching the Shaldon Bridge on the River teign at Teignmouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Scorhill_stone_circle_-_geograph.org.uk_-_18693.jpg",
      "title": "Rowena Ford / Scorhill stone circle",
      "caption": "Scorhill stone circle near Chagford. The site is an English Heritage scheduled monument and has been described as Devon's finest, most intact stone circle. It was constructed during the Bronze Age. The route climbs past the site near Gidleigh, just west of Chagford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Clapper_bridge_on_the_North_Teign_-_geograph.org.uk_-_1508704.jpg",
      "title": "Guy Wareham / Clapper bridge on the North Teign",
      "caption": "Clapper bridge on the North Teign near Scorhill."
    }
  ],
  "distance_km": 71.0,
  "description": "This walk explores the beautiful Teign Valley, following the River Teign from its source on Dartmoor to Shaldon on the Devon coast. It's a splendid riverside trail with lots of pretty villages and great scenery to enjoy. The walk starts at the car park in Postbridge, just to the north of Bellever Forest in Dartmoor. The pretty village includes the famous old clapper bridge. The ancient bridge was built in the 13th century to enable pack horses to cross the river, carrying tin to the stannary town of Tavistock. From here you head north to Gidleigh passing Fernworthy Reservoir, Fernworthy Forest, Chagford Common and Scorhill Down where you will pass the impressive Scorhill Stone Circle. From Gidleigh you head east towards Chagford and then on to the splendid Fingle Woods and Castle Drogo at Drewsteignton. This is a lovely section of the river which includes the iconic Fingle Bridge and the Iron Age Hill Fort of Wooston Castle. If you have time visit Castle Drogo and try the Hunters Path which gives great views of the river gorge below. From Fingle Woods you continue east towards Dunsford, passing through a series of woods including Cod Wood, Dunsford Wood and Bridford Wood. These areas include nature reserves where you can look out for interesting flora and fauna by the river. At Dunsford the route starts to turn to the south, passing Doddiscombleigh, Lower Ashton and Trusham before arriving at Chudleigh Knighton. You continue south to Newton Abbot passing Stover Country Park and the Stover Canal on the way. The route then turns east to take you along the Teign Estuary to the finish point at Shaldon, near Teignmouth on the coast. It's a lovely final section with lots of birdlife to look out for on the estuary. You can see a nice view of this on the google street view link below.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "One of the highest pubs in England is located in the area and well worth a visit for refreshments. The 19th century Warren House Inn is one of the most famous on Dartmoor, sitting in an isolated position some 1425ft (434m) above sea level. Originally built to serve the busy local tin mining community, the Inn was always a favourite haunt with miners from the neighbouring Tin Mines, including Golden Dagger, Vitifer and Birch Tor Mines. From the elevated position of the inn there are breathtaking views over the area. Indoors there's a cosy interior with oak beams and open fires. They do great food and are also dog friendly. The Warren House Inn lies at the very centre of Dartmoor between Moretonhampstead and Princetown on the B3212 with a postcode of PL20 6TA. Just follow the B3212 north east from the Postbridge car park and you will soon come to the inn. At Fingle Bridge you'll find the Fingle Bridge Inn in a great location right next to the river. You can sit outside in the large garden area which overlooks the woods and the river, which is just a few feet away from the tables. On a fine day it's the perfect place to relax with a cream tea after your exercise. Inside there's a cosy interior with a stone hearth and wood ceiling beams. You can find the inn right next to the old bridge at postcode EX6 6PW for your sat navs. At the end of the walk in Shaldon there's the excellent Ness House. The inn is in a splendid position overlooking the Teign Estuary. It also has an interesting history having originally been built in 1810 as the summer home of the Clifford family. Rumour has it that the family subsequently enlarged their fortune through smuggling (via the smugglers tunnel which you can find just behind the Ness). Inside there's a splendid interior with a roaring fire. Outside there's a beautiful terrace and garden with lovely views. You can find them on Ness Drive with a postcode of TQ14 0HP for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Fingle Bridge and Castle Drogo there's the Stone Lane Gardens. Here you'll find botanical gardens and an arboretum with many different types of trees and a series of lovely wooden sculptures. It's a tranquil place to go for a stroll and another of the area's worthy attractions. You can find the gardens about 1 mile due west of Drewseignton. The postcode is TQ13 8JU for your sat navs. The route finishes near the interesting town of Chudleigh where you can visit Chudleigh Rocks, Ugbrooke Park and the Castle Dyke Iron Age Hillfort. At the end of the route at Shaldon you could visit the lovely RSPB nature reserve at Labrador Bay. There's great views here and lots of wildlife to see including cirl buntings and dolphins. Just off the path in Newton Abbot you'll find Decoy Country Park. There's a Wildlife Discovery Centre, Nature Reserve and a watersports centre next to a pretty lake to enjoy here. Near Teignmouth you can enjoy views over the river to the worthy village of Bishopsteignton. There's a ruined 14th century chapel, a small museum, a 16th century pub and fine views over the estuary in this historic riverside settlement."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mxUiRWXM7R4",
  "postcode": "PL20 6TH",
  "district": "West Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B3212, Dartfordleigh, Dartmoor Forest, Postbridge, West Devon, Devon, England, PL20 6TH, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "forest",
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical bridge",
    "stone circle",
    "hill fort",
    "country park"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly",
    "nature reserves"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "bird watching"
  ]
}