{
  "created_at": "2025-01-06T05:05:36.216871+00:00",
  "objectID": "3e6e6dc730082c974ffa6f7a41b581d8",
  "ref": "medway-megaliths-walking-route",
  "title": "Medway Megaliths Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Three_Medway_Megaliths.jpg/512px-Three_Medway_Megaliths.jpg",
  "nearby": [
    {
      "description": "North Downs Way",
      "objectID": "158891488846dc8d1f43a5eb9e491778",
      "ref": "north-downs-way-walking-route"
    },
    {
      "description": "Pilgrims Way",
      "objectID": "c9060cc7e9b3607fe230e1cdf4b33022",
      "ref": "pilgrims-way-walking-route"
    },
    {
      "description": "Blue Bell Hill",
      "objectID": "464200c8e426e8893cb72f3ffb0b6cd8",
      "ref": "blue-bell-hill-walking-route"
    },
    {
      "description": "Medway Valley Walk",
      "objectID": "aac959bb6db8589e8c3ce6a74e4089ca",
      "ref": "medway-valley-walk-walking-route"
    },
    {
      "description": "Coldrum Long Barrow",
      "objectID": "05d8c15fcdf6a5c9f4e6c1e3a1755c75",
      "ref": "coldrum-long-barrow-walking-route"
    },
    {
      "description": "Capstone Farm Country Park",
      "objectID": "2b321213344ffd7e37807e70c63e95cf",
      "ref": "capstone-farm-country-park-walking-and-cycle-route"
    },
    {
      "description": "Allington Lock",
      "objectID": "8f54659bdcd45cc54ee30dc8c39163e4",
      "ref": "allington-lock-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3e6e6dc730082c974ffa6f7a41b581d8.gpx",
  "_geoloc": {
    "lat": 51.33118814,
    "lng": 0.50106883
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Three_Medway_Megaliths.jpg/512px-Three_Medway_Megaliths.jpg",
      "title": "Midnightblueowl at English Wikipedia [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Three images of different Medway Megaliths; Kit's Coty House (left), Little Kit's Coty House (top right), and the Coldrum Stones (bottom left)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Stones_at_Little_Kit%27s_Coty.jpg/512px-Stones_at_Little_Kit%27s_Coty.jpg",
      "title": "User:Ethan Doyle White [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Sarsence in the Early Neolithic chambered tomb of Little Kit's Coty House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Coldrum_Long_Barrow_03.jpg/512px-Coldrum_Long_Barrow_03.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Coldrum Long Barrow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Kit%27s_Coty_House_02.jpg/512px-Kit%27s_Coty_House_02.jpg",
      "title": "Simon Burchell [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Kit's Coty House, a neolithic dolmen near Blue Bell Hill"
    }
  ],
  "distance_km": 5.3,
  "description": "This interesting walk visits the site of a number of Early Neolithic chambered long barrows and megalithic monuments located in the lower valley of the River Medway, near Chatham. The circular walk starts from the car park at the Blue Bell Hill picnic site, just to the south of the village. From here you can pick up the Maidstone Centenary Walk and follow it south west towards Eccles. You then turn south towards Hale Farm towards the site of the megaliths. These include Kit's Coty House and Little Kit's Coty House, constructed circa 4000 BCE, during the Early Neolithic period of British prehistory, surviving today in a ruined state. Archaeologists have established that the monument was built by pastoralist communities shortly after the introduction of agriculture to Britain from continental Europe. You'll also pass the Coffin Stone, a large sarsen stone located close to the other two monuments. Various archaeologists have argued, that the stone was part of a chambered long barrow constructed in the fourth millennium BCE, during Britain's Early Neolithic period. It is a rectangular stone lying flat and measuring 4.4 metres (14 ft) long and 2.8 metres (9.2 ft) wide. After exploring the stones the walk picks up a section of the North Downs Way to take you back to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Robin Hood in Blue Bell Hill village is an interesting pub worthy of some investigation. The pub dates back over 700 years and includes a charming interior with a wood burner for colder days. Outside there's a lovely garden area with BBQ facilities during the warmer months. You can find the pub on Common Road with a postcode of ME5 9RJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The are makes for a pleasant dog walk and there are some nice woodland areas nearby which are also ideal. The Robin Hood pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend the walk you can head west of the Medway to visit three other chambered tombs: the Coldrum Stones, Addington long barrow, and Chestnuts long barrow. The circular Coldrum Long Barrow Walk visits the stones and Trosley Country Park. The Long Barrow is about 3,000 years old and the only one in the Medway Valley to remain virtually intact. A couple of miles north east of the site there's the pretty Capstone Farm Country Park. The park has some nice trails around ancient woodland and a small lake. You could also pick up the Medway Valley Walk and enjoy a stroll along the river. Part of this walk uses the Pilgrims Way long distance trail which is another good option for further exploring the area. Just to the south of the site you'll find the attractive riverside village of Aylesford. Here there are a number of interesting sites to see including Allington Castle, Allington Lock, Aylesford Priory and the Museum of Kent Life. The open-air museum includes a thatched barn, an oast house and a farm with animals. The priory is also well worth a visit. Also known as The Friars this historic site dates back to the 13th century. You can explore the lovely grounds and take in the stunning medieval buildings, before enjoying walks down the Peace Garden and Rosary Way. For more walking ideas in the area see the Kent Walks and North Downs Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/IsDV8wKdMIQ",
  "district": "Tonbridge and Malling",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bluebell Hill Picnic Area, Common Road, Kit's Coty, Aylesford, Bluebell Hill, Tonbridge and Malling, Kent, England, ME5 9RG, United Kingdom",
  "postcode": "ME5 9RG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "stone"
  ],
  "points_of_interest": [
    "archaeological sites",
    "historical monuments"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}