{
  "created_at": "2025-01-06T00:33:01.121346+00:00",
  "objectID": "3e7bc3fde9574c0926d11fb1b2480c4a",
  "ref": "swinsty-reservoir-walking-route",
  "title": "Swinsty Reservoir Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/da/Swinsty_Reservoir_-_geograph.org.uk_-_16465.jpg",
  "nearby": [
    {
      "description": "Lindley Wood Reservoir",
      "objectID": "50596b8bdef83bc09cc4db26480f90e1",
      "ref": "lindley-wood-reservoir-walking-route"
    },
    {
      "description": "Fewston Reservoir",
      "objectID": "f870c6905352a5cd4636cb7612225f48",
      "ref": "fewston-reservoir-walking-route"
    },
    {
      "description": "Thruscross Reservoir",
      "objectID": "d55780f68eb358f7b92cfd5f99dca9d7",
      "ref": "thruscross-reservoir-walking-route"
    },
    {
      "description": "Stainburn Forest",
      "objectID": "368c5275552dfe8226c2d3fed0d2928b",
      "ref": "stainburn-forest-cycle-route"
    },
    {
      "description": "Beaver Dyke Reservoir",
      "objectID": "7ecaaee01555bbe0723b9794be841ee6",
      "ref": "beaver-dyke-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3e7bc3fde9574c0926d11fb1b2480c4a.gpx",
  "_geoloc": {
    "lat": 53.9789639383,
    "lng": -1.6984806478
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Swinsty_Reservoir_-_geograph.org.uk_-_16465.jpg",
      "title": "Mick Melvin / Swinsty Reservoir, via Wikimedia Commons",
      "caption": "Swinsty Reservoir. A view looking North from Swinsty Embankment, with two fly fishermen in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Swinsty_Reservoir_-_geograph.org.uk_-_16466.jpg",
      "title": "Mick Melvin / Swinsty Reservoir, via Wikimedia Commons",
      "caption": "A summer view of the nice lakeside picnic area at Swinsty, taken looking North west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Swinsty_Reservoir_-_geograph.org.uk_-_1050194.jpg",
      "title": "Gordon Hatton / Swinsty Reservoir, via Wikimedia Commons",
      "caption": "One of a series of reservoirs constructed in the Washburn valley, initially to supply the rapidly growing city of Leeds with drinking water. Swinsty was completed in 1876 and is the lowest of the reservoirs that supply drinking water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Sprinksburn_end_of_Swinsty_Reservoir_-_geograph.org.uk_-_1721384.jpg/512px-Sprinksburn_end_of_Swinsty_Reservoir_-_geograph.org.uk_-_1721384.jpg",
      "title": "Matthew Hatton / Sprinksburn end of Swinsty Reservoir, via Wikimedia Commons",
      "caption": "Sprinksburn end of Swinsty. Sprinksburn was engulfed by Swinsty Reservoir when the dam was built. and due to the causeway that the road is on, this end of the reservoir has far more ice than the main stretch of open water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Swinsty_Reservoir_-_geograph.org.uk_-_16463.jpg",
      "title": "Mick Melvin / Swinsty Reservoir, via Wikimedia Commons",
      "caption": "The car park and picnic area. There are toilet facilities and good views over the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Swinsty_Reservoir_Dam_-_geograph.org.uk_-_405900.jpg",
      "title": "Gordon Hatton / Swinsty Reservoir Dam, via Wikimedia Commons",
      "caption": "Swinsty Reservoir Dam. Taken from Jack Hill Lane, this view shows the earth embankment on the south side of the dam, which is stone faced on the reservoir side. Swinsty is the 3rd of 4 reservoirs as one goes downstream along the washburn Valley, and was originally constructed to serve the city of Leeds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Eastern_arm_of_Swinsty_Reservoir_-_geograph.org.uk_-_1050180.jpg",
      "title": "Gordon Hatton / Eastern arm of Swinsty Reservoir, via Wikimedia Commons",
      "caption": "Eastern arm of the reservoir. Separated from the main body of the reservoir by a causeway carrying a minor road, this 'bay' occupies the lower end of the valley of Spinksburn Beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Stack_Point%2C_Swinsty_Reservoir%2C_Yorkshire_-_geograph.org.uk_-_997891.jpg",
      "title": "I Love Colour / Stack Point, Swinsty Reservoir, Yorkshire, via Wikimedia Commons",
      "caption": "Yorkshire Winter sun and snow at Stack Point by the reservoir"
    }
  ],
  "distance_km": 5.0,
  "description": "This is a nice, easy circular walk around Swinsty Reservoir in the Yorkshire Dales. The path is well surfaced and largely flat making the walk suitable for all abilities. The trail runs for a distance of about 3 miles so it's perfect for a peaceful afternoon stroll. The walk starts at the car park on the eastern side of the reservoir and follows the footpath through woodland to the Fewston Embankment, passing Fewston on the way. You head along the Fewston Embankment with splendid views of both Swinsty Reservoir and the adjacent Fewston Reservoir. A woodland section through the Swinsty Moor plantation then takes you to Swinsty Hall, before coming to the Swinsty Embankment with great views of the River Washburn Valley to the south. A short waterside section past more woodland then returns you to the car park. It's easy to extend your walking in this lovely area by heading to the nearby Fewston Reservoir, Thruscross Reservoir and Lindley Wood Reservoir for more waterside walks.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Fewston Farm Shop is another nice place to visit in the area. Located just to the east of Fewston Reservoir the shop includes a cafe serving a large variety of teas and coffee and a selection of cakes and scones to accompany them. It's a lovely country spot with adjacent fields holding ponies, goats and other animals. On warmer days you can relax outside and enjoy the views of the surrounding Yorkshire countryside. You can find the shop just off the Skipton Road (A59) at a postcode of HG3 1SR."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir is a great place for a dog walk and the tea room at the Washburn Valley Heritage Centre is also dog friendly with water bowls and treats provided in the outdoor seating area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just north of the car park you'll find the interesting Washburn Valley Heritage Centre. Inside there's informative exhibitions about the history and heritage of the Valley. This includes the history of Fewston Church from its 14th century tower and its rebuilding in 1697. There's also a series of information boards on the geology and natural landscape of the valley. The building includes a nice tea room where you can enjoy some refreshments after your exercise too. Head about a mile south east and you can visit the expansive Stainburn Forest. The forest has good mountain bike trails and miles of footpaths to explore. Follow the Dales Way Link east for a mile or so and you will come to Beaver Dyke Reservoir and John O'Gaunt Reservoir. The photogenic ruins of John O'Gaunt Castle can also be found in this area."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Yr10gmGXsxI",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swinsty Path, Norwood, Timble, North Yorkshire, York and North Yorkshire, England, HG3 1SU, United Kingdom",
  "postcode": "HG3 1SU",
  "district": "Timble",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "waterside"
  ],
  "points_of_interest": [
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}