{
  "objectID": "3e8623668dc6c190e6bd54c0e28f057e",
  "created_at": "2024-12-20T04:17:04.574584+00:00",
  "ref": "mynydd-du-forest-walking-and-cycle-route",
  "title": "Mynydd Du Forest Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Barrier_in_Mynydd_Du_Forest_-_geograph.org.uk_-_703839.jpg",
  "nearby": [
    {
      "description": "Grwyne Fawr Reservoir",
      "objectID": "fa64d25cd9face1dba4ee3aaeccef50c",
      "ref": "grwyne-fawr-reservoir-walking-route"
    },
    {
      "description": "Waun Fach",
      "objectID": "e514703d28d9403561825fbe78fde490",
      "ref": "waun-fach-walking-route"
    },
    {
      "description": "Llanthony Priory Circular Walk",
      "objectID": "029e6e001ec815c67266a8077eee139a",
      "ref": "llanthony-priory-circular-walk-walking-route"
    },
    {
      "description": "Mynydd Troed",
      "objectID": "4164436d6679a69084fad10411b26e5d",
      "ref": "mynydd-troed-walking-route"
    },
    {
      "description": "Talgarth",
      "objectID": "351a36f40ea2024c164374f1ed375f15",
      "ref": "talgarth-walking-route"
    },
    {
      "description": "Bronllys",
      "objectID": "a3c52ed7348d05ee8ee10ca1821deb81",
      "ref": "bronllys-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/48E792AD354A15DE852580C0004B3F37/$FILE/Mynydd Du Forest.gpx",
  "_geoloc": {
    "lat": 51.94868251,
    "lng": -3.08835983
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Barrier_in_Mynydd_Du_Forest_-_geograph.org.uk_-_703839.jpg",
      "title": "Graham Horn / Barrier in Mynydd Du Forest",
      "caption": "Barrier in Mynydd Du Forest. The square virtually is wholly forestry. Walking and cycling is encouraged, with good access from a car park near the head of the valley. Mountain biking is popular, as evidenced by the trail coming down from the left. The gate is to deter cyclists from rushing across the road and off down another trail to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/In_Mynydd_Du_Forest_-_geograph.org.uk_-_705451.jpg",
      "title": "Graham Horn / In Mynydd Du Forest",
      "caption": "Many gently graded rides and forest breaks give easy walking within the forest, albeit with limited views. The eastern slopes of Pen y Gadair Fawr can just be seen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Gwryne_Fawr_-_geograph.org.uk_-_705486.jpg?20110218220543",
      "title": "Graham Horn / Gwryne Fawr",
      "caption": "Gwryne Fawr. The river that forms the main drainage for this valley of the same name. This is about two miles below its reservoir near the car park at the head of the valley road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Mynydd_Du_Forest_-_geograph.org.uk_-_413526.jpg?20110204014017",
      "title": "David Pearson / Mynydd Du Forest",
      "caption": "Mynydd Du Forest. View across the valley from a forestry track to fields at Ffawydden and the ridge above the forestry. 6\" of snow fell in one afternoon- photo taken 2 days after this during rapid thaw."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/East_of_Pen_y_Gadair_Fawr_-_geograph.org.uk_-_705423.jpg?20110218214654",
      "title": "Graham Horn / East of Pen y Gadair Fawr",
      "caption": "East of Pen y Gadair Fawr. A cwm descends directly from the summit (not seen). Mynydd Du Forest is to the left and forms a good handrail. A path is developing between the woodland and the stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/The_southern_edge_of_Mynydd_Du_Forest_at_Cwm_Ffrwd_-_geograph.org.uk_-_2436301.jpg?20210804060107",
      "title": "The southern edge of Mynydd Du Forest at Cwm Ffrwd by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The southern edge of Mynydd Du Forest at Cwm Ffrwd"
    }
  ],
  "distance_km": 13.0,
  "description": "This large area of woodland in the Black Mountains has miles of forest tracks suitable for walking and mountain biking. The waters of the Grwyne Fawr run through the woods so there is the option of a waterside walk to the nearby Grwyne Fawr Reservoir along the river. You can start your exercise from the Mynydd Du car park at the northern end of the woods, a few miles west of the splendid Llanthony Priory . It's situated in a nice spot at the end of a country lane just next to the river. From here you can pick up the forest trails through the western side of the woods before crossing the river at Pont Cadgwan and returning on the eastern side of the river. There's lots of attractive trees and plants and some steep climbs with great views of the surrounding hills. The riverside sections are lovely too with lots of pretty waterfalls to enjoy. If you would like to continue your walking in the area then you could climb the nearby Waun Fach . It is the highest mountain in the Black Mountains and located just a few miles north west of the forest. From here you can pick up the Dragons Back circular walk which provides magnificent views over the area. The climb to Mynydd Troed and Cockit Hill from Pengenffordd is also located in this area. Just to the north of the car park is the lovely Grwyne Fawr Reservoir . You can follow a riverside path right to the water from the same start point as this walk.",
  "county": "Powys - Powys",
  "region": "Wales",
  "country": "Wales"
}