{
  "created_at": "2025-01-06T00:19:54.441634+00:00",
  "objectID": "3e8f6e31a8b62507a6a10609f42ab32e",
  "ref": "sycamore-gap-walking-route",
  "title": "Sycamore Gap Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/96/Sycamore_Gap_-_geograph.org.uk_-_599737.jpg",
  "nearby": [
    {
      "description": "Housesteads",
      "objectID": "fc4970e2ccbdc33de9c32fbc7ee26ec1",
      "ref": "housesteads-walking-route"
    },
    {
      "description": "Hadrian's Wall Path",
      "objectID": "25270502c1c6b89b9bc84cfcdd28ab2c",
      "ref": "hadrians-wall-path-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3e8f6e31a8b62507a6a10609f42ab32e.gpx",
  "_geoloc": {
    "lat": 55.002407837,
    "lng": -2.3912657525
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Sycamore_Gap_-_geograph.org.uk_-_599737.jpg",
      "title": "Mike Quinn / Sycamore Gap",
      "caption": "Sycamore Gap taken from near the top of the steep hillside to the west of the Gap."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/The_Sycamore_Trees_-_geograph.org.uk_-_381860.jpg",
      "title": "John Poyser / The Sycamore Trees",
      "caption": "The trees in the gap, a young tree has also been planted recently in the enclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Remains_of_two_16th_C_buildings_behind_Hadrian%27s_Wall_near_Sycamore_Gap_-_geograph.org.uk_-_750530.jpg",
      "title": "Mike Quinn / Remains of two 16th C buildings behind Hadrian's Wall near Sycamore Gap",
      "caption": "Remains of two 16th C buildings behind Hadrian's Wall near Sycamore Gap"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Sycamore_Gap_-_geograph.org.uk_-_2678.jpg",
      "title": "Andy Stephenson / Sycamore Gap",
      "caption": "On Hadrian's Wall at the gap, looking West; Milecastle 39 is in the next dip."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Twice_Brewed_Inn_-_geograph.org.uk_-_46724.jpg",
      "title": "Dave Dunford / Twice Brewed Inn",
      "caption": "Twice Brewed Inn. The hamlet of Once Brewed on the B6318 near Hadrian's Wall consists of a Visitor Centre, a Youth Hostel, and the Twice Brewed Inn. Legend has it that the name Twice Brewed came about when a group of soldiers found the beer too weak and insisted it was brewed again."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Crag_Lough_-_geograph.org.uk_-_1433396.jpg",
      "title": "Peter McDermott / Crag Lough",
      "caption": "Crag Lough. The walk offers nice views of this small lake."
    }
  ],
  "distance_km": 5.5,
  "description": "Sycamore Gap was voted England's tree of the year in 2016. It stands in a dramatic dip next to Hadrian's wall in the Northumberland National Park. The tree is known as the 'Robin Hood' tree after famously featuring in the film 'Robin Hood Prince of Thieves' starring Kevin Costner. This circular walk makes use of the Hadrian's Wall Path and the Pennine Way to take you to the iconic tree and around the pretty Crag Lough. The walk starts at the Steel Rigg car park just to the west of the tree. You then pick up the footpath to Steel Rigg and on to Sycamore Gap. After taking some photos of the strikingly positioned tree the path continues around Crag Lough. The route then follows public footpaths back to the car park, passing Hound Hill on the way. You can extend your walk by continuing east along the path to Hotbank Crags and Housesteads Wood. Here you can physically walk on Hadrian's Wall for a short section. There's some magnificent views on this elevated section of the path. If you keep heading east you will soon come to the famous Housteads Roman Fort. The fascinating fort dates from AD 124 and is well worth a visit. The barracks block, hospital, Commander's House, granaries and communal toilets are all still visible today. You can virtually explore the footpath around Sycamore Gap on the google street view link below. N.B Sadly the iconic tree was felled in the early morning of 28th September 2023 in an act of vandalism. It is hoped the tree will regrow but will not be the same again.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Twice Brewed Inn is conveniently located just to the south of the car park. Here you can enjoy home-cooked meals in a comfy, cosy restaurant with a roaring fire. There's car parking, cycle storage and a nice beer garden for warmer weather too. They also offer tours of their brew house in an area with a brewing tradition dating back nearly 2,000 years. If you need to stay over they have several rooms with fine views over the area. You can find the pub near the Gap at a postcode of NE47 7AN."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area around the Gap is great for dog walking and you're bound to see other owners with their pets on a fine day. There's also an expansive area of woodland just to the north, past Greenlee Lough. There's miles of woodland trails here which is nice for the dog. In the Housesteads area you will need to keep them on leads though. The Twice Brewed Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For a longer route try the Steel Rigg Circular Walk which starts from the car park and visits the tree before heading to Housesteads Fort. For more walking ideas in the area see the Northumberland Walks and Northumberland National Park Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Jt9nL2T8uck",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Once Brewed, Henshaw, Northumberland, North East, England, NE47 7AW, United Kingdom",
  "postcode": "NE47 7AW",
  "district": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "path"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}