{
  "created_at": "2025-01-06T09:52:31.981546+00:00",
  "objectID": "3e9e8424c552e43cde4428d00dcba52f",
  "ref": "brockenhurst-to-boldre-via-roydon-woods-walking-and-cycle-route",
  "title": "Brockenhurst to Boldre via Roydon Woods Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Bluebells_in_Roydon_Woods_-_geograph.org.uk_-_170453.jpg",
  "nearby": [
    {
      "description": "Brockenhurst",
      "objectID": "b377a5f27f5582099b6d186c99f40598",
      "ref": "brockenhurst-walking-route"
    },
    {
      "description": "Brockenhurst to Burley",
      "objectID": "ccdc6bc8e25e6b866ba9eaa2e936442c",
      "ref": "brockenhurst-to-burley-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3e9e8424c552e43cde4428d00dcba52f.gpx",
  "_geoloc": {
    "lat": 50.8166859185,
    "lng": -1.571719727
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Bluebells_in_Roydon_Woods_-_geograph.org.uk_-_170453.jpg",
      "title": "Jim Champion / Bluebells in Roydon Woods",
      "caption": "Bluebells in Roydon Woods. In many parts of Roydon Woods during May bluebells can be found - the woods are a nature reserve but accessible via bridleways."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Path_through_Calveslease_Copse%2C_Roydon_Woods%2C_New_Forest_-_geograph.org.uk_-_408513.jpg",
      "title": "Jim Champion / Path through Calveslease Copse, Roydon Woods, New Forest",
      "caption": "Path through Calveslease Copse in Roydon Woods. The path on the right leads through Calveslease Copse to Dilton Gardens. It is a public bridleway through the Roydon Woods nature reserve, managed by the Hampshire and Isle of Wight Wildlife Trust. At this time of year the bluebells are in flower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Bridleway_descending_into_Dawkins_Bottom%2C_Roydon_Woods_-_geograph.org.uk_-_170444.jpg",
      "title": "Jim Champion / Bridleway descending into Dawkins Bottom, Roydon Woods",
      "caption": "Bridleway descending into Dawkins Bottom, Roydon Woods. A view northwest along the bridleway leading down into Dawkins Bottom. The path eventually leads to Church Lane through the northwestern parts the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Edge_of_Roydon_Woods_and_Brockenhurst_Park%2C_New_Forest_-_geograph.org.uk_-_62516.jpg",
      "title": "Jim Champion / Edge of Roydon Woods and Brockenhurst Park, New Forest",
      "caption": "Edge of Roydon Woods and Brockenhurst Park. The field in the foreground is grazed by horses on the Brockenhurst Park estate, and the trees beyond on the right are part of the Roydon Woods nature reserve. The only right of way through this grid square is a bridleway through the woods which just grazes the SW corner of the square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Roydon_Woods_nature_reserve%2C_New_Forest_-_geograph.org.uk_-_60470.jpg",
      "title": "Jim Champion / Roydon Woods nature reserve, New Forest",
      "caption": "Roydon Woods nature reserve. A typical view of beech trees on the bridleway through the woods. The Hampshire County Council website says: \"Roydon Woods contains a wonderful patchwork of habitats which support wildlife typical of the New Forest but without the pressures of grazing. The 750 acre site, which is designated a Site of Special Scientific Interest, is mainly woodland with small areas of meadow heath, ponds and a section of the Lymington River. It was gifted freehold to the Trust by Peter Barker-Mill in 1978. Roydon has been privately owned since the time of the Domesday Book. For a time it was monastic property but following the Dissolution of the Monasteries became Crown land for a short time. Banks and ditches provide visual evidence of centuries of forestry and farming which have produced the landscape seen and enjoyed today.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Boldre%2C_village_green_-_geograph.org.uk_-_1705108.jpg",
      "title": "Mike Faherty / Boldre, village green",
      "caption": "Boldre, village green. At the southern end of Royden Lane; with postbox, parish notice-board, litter bins & benches."
    }
  ],
  "distance_km": 5.0,
  "description": "This route follows bridleways between Brockenhurst and the village of Boldre in the New Forest. It's suitable for both cyclists and walkers, following country lanes and traffic free forest paths through a really pretty section of the forest. The route also passes the delightful Roydon Woods which consists of ancient woodland, pastures, ponds, heaths and the Lymington River. It's worth exploring this area and looking out for the wide variety of wildlife that dwells here. This includes Tawny owls, nightjars, various butterflies and deer.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the New Forest Walks, Hampshire Walks page."
    }
  ],
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Lane, Brockenhurst, New Forest, Hampshire, England, SO42 7UB, United Kingdom",
  "postcode": "SO42 7UB",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "pastures",
    "forest"
  ],
  "points_of_interest": [
    "wildlife viewing"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}