{
  "created_at": "2025-01-06T11:18:36.569570+00:00",
  "objectID": "3f03aa914b8babb63366b67f13becc7d",
  "ref": "walkington-walking-route",
  "title": "Walkington Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/East_End%2C_Walkington_-_geograph.org.uk_-_4476820.jpg/512px-East_End%2C_Walkington_-_geograph.org.uk_-_4476820.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3f03aa914b8babb63366b67f13becc7d.gpx",
  "_geoloc": {
    "lat": 53.8224667095,
    "lng": -0.4884036688
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/East_End%2C_Walkington_-_geograph.org.uk_-_4476820.jpg/512px-East_End%2C_Walkington_-_geograph.org.uk_-_4476820.jpg",
      "title": "East End, Walkington by Ian S, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "East End, Walkington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Village_Hall_Walkington_IMG_1634_-_panoramio.jpg/512px-Village_Hall_Walkington_IMG_1634_-_panoramio.jpg",
      "title": "Paul Lakin, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Village Hall Walkington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Picnic_site_near_Walkington_-_geograph.org.uk_-_704421.jpg",
      "title": "Paul Harrop / Picnic site near Walkington",
      "caption": "Walkington Wold picnic area. Walkington Wold, located a few miles west of Walkington, boasts a Bronze Age barrow complex known for its historical significance. The Walkington Wold Burials, remnants of the Bronze Age, offer insights into ancient burial practices. Additionally, to the east of the village lies a medieval stone boundary marker, once delineating the sanctuary of Saint John of Beverley. This marker, now a Scheduled Ancient Monument, stands as a testament to the area's medieval history. The village is also linked to intriguing discoveries such as the Walkington Hoard, a collection of Corieltauvi Celtic coins. Unearthed between 2001 and 2008, these coins provide a glimpse into the coinage and economic activities of the Corieltauvi tribe. Notably, the artifacts are currently housed in the Yorkshire Museum, contributing to the preservation of local history and cultural heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Risby_Folly%2C_from_across_the_pond_-_panoramio.jpg/512px-Risby_Folly%2C_from_across_the_pond_-_panoramio.jpg",
      "title": "irlsey, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Risby Folly, from across the pond. Risby, situated in the civil parish of Rowley in the East Riding of Yorkshire, England, holds historical significance as the location of a deserted village and a former stately home. Positioned approximately 3.5 miles southwest of Beverley and 1 mile west of the A164 road, Risby is characterised by an open, partially wooded parkland, which was once one of the largest deer parks in Yorkshire. This parkland has become a popular destination for local walkers, offering a picturesque setting. Within the area, Risby encompasses Risby Park, a farm, and the Folly Lake Cafe. The former stately home featured ornamental lakes with several fishponds, and since 1990, these have been utilized as coarse fishing locations. The lakes add a serene and recreational dimension to the landscape. Additionally, Risby boasts an octagonal brick folly, recognized with a Grade II designation, contributing to the architectural and historical richness of the site."
    }
  ],
  "distance_km": 6.0,
  "description": "This village is located on the Beverley Twenty Walk just west of Beverley in East Riding of Yorkshire. On this walk you can follow the waymarked trail south from the village to visit the medieval village of Risby and enjoy some fine views over the surrounding countryside. The High Hunsley Circuit also passes through the village. Please scroll down for the full list of walks near and around Walkington. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [],
  "district": "Walkington",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "44, Northgate, Walkington, East Riding of Yorkshire, England, HU17 8ST, United Kingdom",
  "postcode": "HU17 8ST",
  "state": "England"
}