{
  "created_at": "2025-01-05T23:51:48.339087+00:00",
  "objectID": "3f225f6bb846986f3875c97315194965",
  "ref": "llantrisant-walking-route",
  "title": "Llantrisant Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Llantrisant_gateway_to_the_Rhondda_Valley.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3f225f6bb846986f3875c97315194965.gpx",
  "_geoloc": {
    "lat": 51.5417232565,
    "lng": -3.3760119058
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Llantrisant_gateway_to_the_Rhondda_Valley.jpg",
      "title": "Mick Lobb / Llantrisant gateway to the Rhondda Valley",
      "caption": "Llantrisant gateway to the Rhondda Valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Autumnal_forest_path_at_Llantrisant_-_geograph.org.uk_-_1009719.jpg",
      "title": "Mick Lobb / Autumnal forest path at Llantrisant",
      "caption": "Autumnal forest path at Llantrisant Although the forest is populated with pine species the roads and tracks are often edged with beech. The fall of their leaves gives the tracks their autumn blanket."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Disused_railway_bridge_across_river_Ely_-_geograph.org.uk_-_159416.jpg",
      "title": "nantcoly / Disused railway bridge across river Ely",
      "caption": "Disused railway bridge across river Ely. This bridge is on the confluence of the river Ely and Nant Muchudd, and was the principal railway line up the Ely valley towards tonyrefail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Dr_William_Price_-_Statue.jpg/256px-Dr_William_Price_-_Statue.jpg",
      "title": "User:FruitMonkey, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Statue of Dr William Price in the town. Price was a Welsh doctor known for his support of Welsh nationalism, Chartism and his involvement with the Neo-Druidic religious movement. He has been recognized as one of the most significant figures of 19th-century Wales, and one of the most unusual in Victorian Britain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Track_on_the_west_flank_of_Mynydd_Meiros_above_Llanharan_-_geograph.org.uk_-_1009750.jpg",
      "title": "Mick Lobb / Track on the west flank of Mynydd Meiros above Llanharan",
      "caption": "Track on the west flank of Mynydd Meiros above Llanharan"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Rock_outcrops_on_Mynydd_Meiros_-_geograph.org.uk_-_1009755.jpg",
      "title": "Mick Lobb / Rock outcrops on Mynydd Meiros",
      "caption": "Rock outcrops on Mynydd Meiros"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Mynydd_Meiros_above_Llanharan_-_geograph.org.uk_-_1009787.jpg",
      "title": "Mick Lobb / Mynydd Meiros above Llanharan",
      "caption": "Mynydd Meiros above Llanharan"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/View_across_the_fields_towards_Llantrisant_Old_Church_-_geograph.org.uk_-_991885.jpg",
      "title": "Eric Jones / View across the fields towards Llantrisant Old Church",
      "caption": "View across the fields towards Llantrisant Old Church. This Grade II building was declared redundant in 1899 when Llantrisant New Church was built some two kilometres down the road. Both churches are dedicated to SS Afran, Ieuan and Sannan. The old church, which dates from the medieval period, is now under the care of the Friends of Friendless Churches Society. There is a holy well by the gate."
    }
  ],
  "distance_km": 11.0,
  "description": "This Welsh town has some nice trails though the Ely Valley and some fine local hill climbs to try. It's located in the county of Rhondda Cynon Taf, on the River Ely and the Afon Clun. Llantrisant is also notable as being the home of the Royal Mint, a government-owned mint that produces coins for the United Kingdom. This walk from the town follows the waymarked Glamorgan Ridgeway Walk walk to Llantrisant Forest, Mynydd Garth Maelwg and Mynydd Meiros to the west. There's some nice peaceful woodland trails, river crossings and splendid views from the high points on the ridge. The walk starts in the town and follows the Ffordd Bryniau and Glamorgan Ridgeway walk west past Talbot Green and the River Ely and into Llantrisant Forest. The trail then heads up to Mynydd Meiros where there are some excellent views over the surrounding hills and countryside. The route then turns around to follow alternative paths through the forest.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Cross Inn for some post walk refreshment. The friendly pub serves good food and can be found at postcode CF72 8AZ."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and hills make for a fine dog walk and the Cross Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head to the Llantrisant Guildhall Heritage & Visitors Centre to find out more about the remarkable history of the town, stretching back more than 1,500 years. The restored 14th century Grade II Listed Building re-opened following National Lottery Heritage Fund support in 2019. To celebrate the history of the building, its Freemen and the town, the film below was produced by Calan Films. It plays in the Llantrisant Guildhall every day for its many visitors and can be bought as a DVD. The Taff Ely Ridgeway Walk also runs through the town. You could follow it east to visit Garth Hill and the popular Caerphilly Mountain. Near here there's also Castle Coch and the expansive Fforest Fawr near to Cardiff. The long distance Penrhys Pilgrimage also passes through the town on its way to the historic village of Penrhys or to the 12th century Llandaff Cathedral in Cardiff."
    }
  ],
  "video_url": "https://www.youtube.com/embed/RtpPkBGBhj8",
  "district": "Llantrisant",
  "county": "Rhondda Cynon Taf - Rhondda Cynon Taf",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}