{
  "created_at": "2025-01-06T04:49:59.722782+00:00",
  "objectID": "3f2442f749a6a5fa848deb0453f84dd6",
  "ref": "red-screes-walking-route",
  "title": "Red Screes Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Summit_of_Red_Screes_-_geograph.org.uk_-_1164412.jpg",
  "nearby": [
    {
      "description": "Ambleside",
      "objectID": "6fe5f39486b7c84acaa4072c9ba5d1c1",
      "ref": "ambleside-walking-route"
    },
    {
      "description": "Kirkstone Pass",
      "objectID": "94d5704fbe28d62c9024940a5031e189",
      "ref": "kirkstone-pass-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3f2442f749a6a5fa848deb0453f84dd6.gpx",
  "_geoloc": {
    "lat": 54.4338825558,
    "lng": -2.9615858923
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Summit_of_Red_Screes_-_geograph.org.uk_-_1164412.jpg",
      "title": "Jonathan Clitheroe / Summit of Red Screes",
      "caption": "Summit of Red Screes. Ice formations cover the north face of the Triangulation Pillar. This picture was taken on a clear day in mid February 2009, following heavy snowfall earlier in the month."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Red_Screes_-_geograph.org.uk_-_8714.jpg",
      "title": "Andy Beecroft / Red Screes",
      "caption": "The view looking northwards towards Brothers Water from the top of Red Screes. This photograph taken during the summer of 2004, contrasting nicely with the previous photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Wall_Under_Red_Screes_-_geograph.org.uk_-_1763129.jpg",
      "title": "Michael Graham / Wall Under Red Screes",
      "caption": "Wall Under the hill. The wall runs up and over the Middle Dodd ridge. Looking over Kirkstone towards Rough Edge on Caudale Moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Brown_Cove_from_Red_Screes%2C_Keppel_Cove_-_geograph.org.uk_-_1532719.jpg",
      "title": "P Leedell / Brown Cove from Red Screes, Keppel Cove",
      "caption": "Brown Cove from Red Screes, Keppel Cove"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/On_the_path_down_from_Red_Screes_-_geograph.org.uk_-_10563.jpg",
      "title": "Andy Beecroft / On the path down from Red Screes",
      "caption": "Descending the hill on a nice grassy path with views towards Windermere as you go"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Looking_up_Towards_Red_Screes_-_geograph.org.uk_-_551876.jpg",
      "title": "Mick Garratt / Looking up Towards Red Screes",
      "caption": "Looking up towards the hill From the upper reaches of Caiston Glen."
    }
  ],
  "distance_km": 6.0,
  "description": "This circular route takes you up Red Screes fell in the Lake District National Park. The walk begins in the popular town of Ambleside and ascends to Scandale Fell and Scandale Pass along the Scandale Beck. From Scandale Pass you turn east to the summit of Red Screes. Here you will find cairns, a circular stone shelter and the pretty Red Screes tarn. There are magnificent views of the coast, Helvellyn, Dove Crag, Fairfield and over Deepdale Hause. To the west you can see the Coniston, Bowfell and Scafell fells. You descend passing Raven Crag to Snarker Moss where the ground can be quite boggy. You continue to Snarker Pike before reaching the Kirkstone Road which will take you back into Ambleside. For a shorter route to the summit you could park at the Kirkstone Pass car park just to the east of the mountain. From here you can pick up a rocky path heading up the Kilnshaw Chimney. It's a shorter route with a series of stone steps and a couple of tricky scrambles but the views of the Kirkstone Pass below are wonderful. If you're coming by public transport then a seasonal bus route will drop you at the Kirkstone Pass Inn opposite the car park and the signed footpath.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Ambleside reward yourself with some refreshments at the Unicorn Inn. This quintessential traditional Lakeland public house is the oldest pub in Ambleside, dating back to the 18th century. They do good home cooked food and have a fine selection of ales. You can find the pub in the town at postcode LA22 9DT for your sat navs. It's also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Kirkstone Pass Walk climbs to the summit from the nearby Kirkstone Pass Inn. It's a popular way of reaching the summit with just a short climb from the remote inn. For more walking ideas in the area see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GjxC5TWMxG4",
  "postcode": "LA22 9DZ",
  "district": "Ambleside",
  "county": "Westmorland and Furness",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}