{
  "created_at": "2025-01-05T23:46:13.462200+00:00",
  "objectID": "3f2448c6451101bbfd616cfc4c7ad65f",
  "ref": "tanygrisiau-walking-route",
  "title": "Tanygrisiau Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Tanygrisiau_Reservoir_-_geograph.org.uk_-_481354.jpg",
  "nearby": [
    {
      "description": "Cwmorthin",
      "objectID": "7be7f2a58c239220174f281a4f12a890",
      "ref": "cwmorthin-walking-route"
    },
    {
      "description": "Cwm Penmachno",
      "objectID": "c35a060e89f4b21f62828ee3fee25c03",
      "ref": "cwm-penmachno-walking-route"
    },
    {
      "description": "Llyn Stwlan Dam",
      "objectID": "28b843c3981e2928a9fa06fe9bbe4d12",
      "ref": "llyn-stwlan-dam-walking-route"
    },
    {
      "description": "Snowdonia Slate Trail",
      "objectID": "11f87e2a3b44309978dabb386cd806e7",
      "ref": "snowdonia-slate-trail-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3f2448c6451101bbfd616cfc4c7ad65f.gpx",
  "_geoloc": {
    "lat": 52.9857031043,
    "lng": -3.9635831202
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Tanygrisiau_Reservoir_-_geograph.org.uk_-_481354.jpg",
      "title": "Leonore Kegel / Tanygrisiau Reservoir",
      "caption": "Tanygrisiau Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tanygrisiau_village_-_geograph.org.uk_-_540511.jpg",
      "title": "Andrew Hill / Tanygrisiau village",
      "caption": "Tanygrisiau village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Tanygrisiau_reservoir_dam_-_geograph.org.uk_-_520049.jpg",
      "title": "rob bishop / Tanygrisiau reservoir dam",
      "caption": "Reservoir dam"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Ffestiniog_-_Tanygrisiau_-_geograph.org.uk_-_1621198.jpg",
      "title": "Ken Bagnall / Ffestiniog - Tanygrisiau",
      "caption": "Ffestiniog. Tanygrisiau or more properly 'Tan y grisiau', is Welsh for \"below the steps\", referring to steps, which have long since disappeared, leading up to the original slate mine above the village. The village was famous for its slate mining, producing a high quality black slate that was used across the world."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Tanygrisiau_Station_-_geograph.org.uk_-_1473335.jpg",
      "title": "Stephen McKay / Tanygrisiau Station",
      "caption": "Tanygrisiau Station. The guard checks that his train is ready for departure to Blaenau Ffestiniog."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Ffestiniog_-_Tanygrisiau_-_geograph.org.uk_-_1621193.jpg",
      "title": "Ken Bagnall / Ffestiniog - Tanygrisiau",
      "caption": "The village is located in the upper end of the Vale of Ffestiniog in the county of Gwynedd. It can be found along the southern side of the Moelwyn mountain range and dates to around 1750. It joins on to the semi-urban area of Blaenau Ffestiniog, and is in the community of Ffestiniog; located between 650 feet (200 m) and 750 feet (230 m) above sea level."
    }
  ],
  "distance_km": 3.0,
  "description": "This circular walk takes you around Tanygrisiau Reservoir in North Wales. It's an attractive area with waterside trails, a heritage steam railway and wonderful mountain scenery. The walk starts from Tanygrisiau Train Station on the splendid Ffestiniog Railway. From here you can pick up footpaths heading south along the western side of the water. You'll pass the power station, Camfa Derw and the disused Moelwyn Mine. The route then follows paths round the eastern side of the water, passing a disused quarry and Moel Ystradau before returning to the train station. You can extend your outing on the circular Llyn Stwlan Dam Walk. The impressive dam lies just to the west of the Tanygrisiau Reservoir, with the accompanying power station on the western shores. There's some great views back down to both lakes from the vantage point on Moel-yr-Hydd to the north west.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Cwmorthin Walk also starts from the village, just north of the train station. There's a lovely trail here taking you to the old Cwmorthin Quarry and Llyn Cwmorthin. On the way there's a pretty stream, mountains, Japansese gardens, waterfalls and some interesting mining history. Just to the east there's the slate mining town of Blaenau Ffestiniog to explore. Here you'll find another station on the Ffestiniog Railway and the fascinating Llechwedd Slate Caverns. Near here there's also Cwm Penmachno where you can explore a number of striking slate mining quarries, enjoy views of the River Machno and visit the pretty Llyn Bowydd. You can use the long distance Snowdonia Slate Trail to visit the sites. If you catch the railway west you can pick up the Maentwrog Walk. Here you'll find the beautiful Plas Tan y Bwlch Gardens at the Snowdonia National Park environmental studies centre. It's a fine place for a walk with the picturesque Llyn Mair to see as well. Head south and there's the neighbouring village of Llan Ffestiniog where you can visit the Afon Cynfal gorge and the photogenic Cynfal waterfalls. For more walks in the area see the Snowdonia Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_rzrNFIzv5M",
  "postcode": "LL41 3SY",
  "district": "Tan-y-grisiau",
  "county": "Gwynedd",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Glan yr Afon Terrace, Ffestiniog, Tan-y-grisiau, Gwynedd, Cymru / Wales, LL41 3SY, United Kingdom",
  "state": "Cymru / Wales"
}