{
  "created_at": "2025-01-05T23:27:43.606419+00:00",
  "objectID": "3f875e147dc723f57262c945a493643d",
  "ref": "sheringham-park-walking-and-cycle-route",
  "title": "Sheringham Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/07/Sheringham_Park_-_geograph.org.uk_-_1018388.jpg",
  "nearby": [
    {
      "description": "Kelling Heath",
      "objectID": "dcc5b570459b882a884a2ff9800dbc2c",
      "ref": "kelling-heath-walking-route"
    },
    {
      "description": "Peddars Way and Norfolk Coast Path",
      "objectID": "4e358890f1c641370cd442450ff77e93",
      "ref": "peddars-way-and-norfolk-coast-path-walking-route"
    },
    {
      "description": "Cromer to Sheringham",
      "objectID": "00aa38d47847e18fcb357b1b3ebd6c6c",
      "ref": "cromer-to-sheringham-walking-route"
    },
    {
      "description": "Holt Country Park",
      "objectID": "0770ab9c0b0351730e4d4c22929ec8bf",
      "ref": "holt-country-park-walking-and-cycle-route"
    },
    {
      "description": "Rebellion Way",
      "objectID": "ce673553ec15d7a7286596120f836ac9",
      "ref": "rebellion-way-cycle-route"
    },
    {
      "description": "Weybourne To Sheringham",
      "objectID": "e4304931d4db0d7565b2514ec06a85d9",
      "ref": "weybourne-to-sheringham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3f875e147dc723f57262c945a493643d.gpx",
  "_geoloc": {
    "lat": 52.9263782044,
    "lng": 1.18137519
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Sheringham_Park_-_geograph.org.uk_-_1018388.jpg",
      "title": "Jay Haywood / Sheringham Park",
      "caption": "Rhododendrons in flower at Sheringham Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/House_in_Sheringham_Park_-_geograph.org.uk_-_562039.jpg",
      "title": "DS Pugh / House in Sheringham Park",
      "caption": "House in Sheringham Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Sheringham_Park%2C_National_Trust_-_geograph.org.uk_-_279537.jpg",
      "title": "Stuart Warrington / Sheringham Park, National Trust",
      "caption": "The wonderful Humphry Repton landscaped park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Sheringham_Park.jpg",
      "title": "Stephen D Bennett / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Sheringham Hall, a private residence; Sheringham Park, in which it stands, belongs to the National Trust"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Entrance_to_Sheringham_Park_-_geograph.org.uk_-_609432.jpg",
      "title": "Evelyn Simak / Entrance to Sheringham Park",
      "caption": "Entrance to Sheringham Park from car park. The information board depicts a large map of the park; there is also a green car park ticket automat. A short distance further into the park the path leads past the Courtyard café, the visitor information centre and shop. The converted barn at Wood Farm houses an exhibition explaining history and wildlife. The park is open daily from dawn to dusk. Sheringham Park, by many considered to be the finest work of the landscape designer Humphry Repton, was purchased by the National Trust in 1986. The property - encompassing altogether 20 hectares of parkland - is traversed by the main estate drive as well as by a number of marked footpaths that lead through woods and farmland, and north towards the coast and cliffs below Sheringham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/View_tower_on_the_Tree_Trail_-_geograph.org.uk_-_609521.jpg/256px-View_tower_on_the_Tree_Trail_-_geograph.org.uk_-_609521.jpg",
      "title": "Evelyn Simak / View tower on the Tree Trail",
      "caption": "View tower on the Tree Trail. A number of viewpoints and towers offer panoramic views; a tower at treetop height, offering all-around views across the surrounding countryside, has been erected near the gazebo on the Repton Walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/A_carpet_of_rhododendrons_-_geograph.org.uk_-_609513.jpg",
      "title": "Evelyn Simak / A carpet of rhododendrons",
      "caption": "A carpet of rhododendrons. Sheringham Park features extensive stands of mature rhododendron, mainly in Sheringham Wood, but also alongside Caroline's Plantation. Solitary plants and smaller clusters can be found growing throughout the parkland, beside the paths and along the main estate drive. This view was taken from the top of one of the view towers alongside the Tree Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Visitor_Information_Centre_and_Shop_-_geograph.org.uk_-_609441.jpg",
      "title": "Evelyn Simak / Visitor Information Centre and Shop",
      "caption": "Visitor Information Centre and Shop. The barn at Wood Farm houses an exhibition explaining the history and wildlife of the park; the shop and visitor information centre are tucked in at the far corner."
    }
  ],
  "distance_km": 8.0,
  "description": "Enjoy a long cycle or walk through this large National Trust owned park and estate in Norfolk. The parkland surrounds the 19th century Sheringham Hall and includes miles of peaceful woodland trails, beautiful landscaped gardens full of rhododendrons and azaleas and fabulous views of the Norfolk coast. There is also an abundance of wildlife with 3 species of deer and a wide variety of birds and butterflies. There are 4 lovely way-marked trails in the park. They are colour coded with orange, blue, red and white waymarkers. Cycling is permitted in the park but please do not cycle on the orange trail and keep to reasonable speeds. Sheringham Park is located about 5 miles west of Cromer and about 6 miles east of Holt. It is just a short walk from the coast where you could pick up the Peddars Way and Norfolk Coast Path which runs through Sheringham. You can head east to Cromer along the coast on the Cromer to Sheringham Walk. The route also gives you the option of climbing to Beacon Hill, Norfolk's highest point. It's located just over 2 miles east of Sheringham Park and has more nice woodland trails and sea views. Just to the west of the path you will find Kelling Heath. The expansive area of heathland includes miles of footpaths, heather, western gorse, bracken, and mixed woodland. It's a short walk from the park or you can catch the North Norfolk Railway (NNR) to Kelling Heath Park railway station from Holt or Sheringham.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The expansive park makes for an excellent dog walk with many off lead areas. It's requested to put your dog lead in the car park and around the visitor centre, the toilets and courtyard café."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to hop on the North Norfolk Railway, a splendid heritage steam railway with a station at Sheringham. Also known as the Poppy line, the old steam trains will take you along the beautiful coast to the Georgian town of Holt where you can explore Holt Country Park. Just to the east you can pick up the West Runton and Beeston Bump Circular Walk. This will take you up to the highest point in Norfolk and an ancient Roman Camp. To the west there's a ruined priory and Grade II listed windmill to visit in Weybourne. Here you can also pick up the Salthouse Circular Walk and enjoy a climb to Kelling Heath where there are some fine trails and excellent views over the area. The long distance Rebellion Way Cycle Route passes through the park. The epic 232 mile circular ride visits some of the major highlights of Norfolk, using a series of quiet country lanes and traffic free paths. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/h-vZBm9UhXQ",
  "postcode": "NR26 8TL",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Bower, Lodge Hill, Hall Farm, Upper Sheringham, North Norfolk, Norfolk, England, NR26 8TL, United Kingdom",
  "district": "North Norfolk",
  "state": "England"
}