{
  "created_at": "2025-01-06T03:31:33.505239+00:00",
  "objectID": "3f8e38ffd2ad3b54f87022dac392fb25",
  "ref": "fairy-glen-betws-y-coed-walking-route",
  "title": "Fairy Glen Betws y Coed Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/63/The_Fairy_Glen_Hotel_-_geograph.org.uk_-_1373527.jpg",
  "nearby": [
    {
      "description": "Conwy Falls",
      "objectID": "df534110d4eccf131b58ac212584b09a",
      "ref": "conwy-falls-walking-route"
    },
    {
      "description": "Swallow Falls",
      "objectID": "aff3faf0a77b447e919faf91d048d584",
      "ref": "swallow-falls-walking-route"
    },
    {
      "description": "Llyn Parc",
      "objectID": "b89b64984af7c9621d75f59a2e2e5f70",
      "ref": "llyn-parc-walking-route"
    },
    {
      "description": "Betws Y Coed River Walk",
      "objectID": "37d95a5f055eb0d342bc6a88975cafe0",
      "ref": "betws-y-coed-river-walk-walking-route"
    },
    {
      "description": "Fishermans Walk and Lledr Gorge Walk",
      "objectID": "c30c0a3e53da4db07fd3074a0a24851b",
      "ref": "fishermans-walk-betws-y-coed"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3f8e38ffd2ad3b54f87022dac392fb25.gpx",
  "_geoloc": {
    "lat": 53.07564875,
    "lng": -3.79519701
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/The_Fairy_Glen_Hotel_-_geograph.org.uk_-_1373527.jpg",
      "title": "Phil Champion / The Fairy Glen Hotel",
      "caption": "The Fairy Glen Hotel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Afon_Conwy_below_the_Fairy_Glen_-_geograph.org.uk_-_1375101.jpg",
      "title": "Phil Champion / Afon Conwy below the Fairy Glen",
      "caption": "Afon Conwy below the Fairy Glen. The narrowest part of the gorge is upstream from here. A little further downstream the river is joined by the Lledr at Tyn y Cae Pool."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Benches_beside_Ty%27n-y-Cae_Pool_-_geograph.org.uk_-_1373150.jpg",
      "title": "Phil Champion / Benches beside Ty'n-y-Cae Pool",
      "caption": "Benches beside Ty'n-y-Cae Pool. By the confluence of the Lledr and Conwy, downstream from the Fairy Glen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Fairy_Glen_%28Ffos_Noddum%29_-_geograph.org.uk_-_1457539.jpg",
      "title": "Damon Knight / Fairy Glen (Ffos Noddum)",
      "caption": "Fairy Glen (Ffos Noddum). Taken from the river side facing upstream (SSE) towards Conwy Falls"
    }
  ],
  "distance_km": 1.0,
  "description": "Visit this delightful glen in Betws y Coed and enjoy little waterfalls, rapids and cascades in a wooded gorge on the River Conwy. You can pick up the Fairy Glen footpath from the A470 north of the falls, next to the Fairy Glen Hotel. It is located just where the road crosses the river and runs for about half a mile through the glen. There are some steep steps to climb down so please take car when wet as they can be a bit slippery. The glen is a delightfully peaceful area with the rushing water surrounded by interesting vegetation and attractive woodland. If you enjoy this walk then you could head to the nearby Swallow Falls. These can be reached from Betws-y-Coed by following the Afon Llugwy to the falls. It's a lovely riverside walk, with woodland trails, the picturesque wooden Miners Bridge and a series of waterfalls to enjoy. Just south of Fairy Glen you will find Conwy Falls. It's about a mile down the river and consists of a short circular trail through the Conwy Forest Park. This takes you to the River Conwy where you will find the lovely 50 ft waterfall.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Betws-y-Coed the Stables Bar is a popular choice for post walk refreshments. They do very good food and also have a good sized outdoor area to relax in on warmer days. You can find the pub at postcode LL24 0AY for your sat navs. There's also The Alpine Coffee Shop, situated at Betws-y-Coed railway station. It's a popular place with eye catching decor including creative wrought-iron artwork and unusual artefacts. There is also a gallery with a permanent art exhibition of works by Jacha Potgieter, comprising of photographs, oil paintings and prints to raise awareness of apes in crisis. They serve award winning coffee which you can enjoy with a fine view of the old trains coming in and out of the station."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The glen is a nice place for a dog walk though you are advised to keep them on leads as it can be a bit slippy. The Stables Bar mentioned above is also dog friendly and can provide water bowls."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north of the town you will find the noteworthy market town of Llanrwst. Here you can try the circular Llanrwst Walk which visits some of the towns highlights. These include the splendid Gwydir Estate which contains a historic castle, an ancient chapel, the Grey Mare's Tail Waterfall, Llyn Parc and the expansive Gwydyr Forest. The Fishermans Walk and Lledr Gorge Walk starts just to the west at Pont-y-Pant railway station on the Conwy Valley line. This takes you through the beautiful scenery of the Lledr Gorge with its picturesque waterfalls, stepping stones and Pont Gethin viaduct. There's also the option of trying the Victorian Fishermans Walk, a precarious route through the gorge on a rickety old walkway. For more walking ideas in the area see the Snowdonia Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/o3a6KWHjs6U",
  "county": "Conwy",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pont yr Afanc, Bro Garmon, Conwy, Cymru / Wales, LL24 0SH, United Kingdom",
  "postcode": "LL24 0SH",
  "district": null,
  "state": "Cymru / Wales"
}