{
  "created_at": "2025-01-06T00:26:49.457483+00:00",
  "objectID": "3fabf07f813132bc1f97724d49e0d4fa",
  "ref": "bodiam-castle-walking-route",
  "title": "Bodiam Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Bodiam_Castle_-_geograph.org.uk_-_133190.jpg",
  "nearby": [
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Brede High Woods",
      "objectID": "61d011b6ad74d6068ade7ddf8b54f123",
      "ref": "brede-high-woods-walking-route"
    },
    {
      "description": "Powdermill Reservoir",
      "objectID": "0de62c79cfeb3c7511d57530696c3836",
      "ref": "powdermill-reservoir-walking-route"
    },
    {
      "description": "Burwash",
      "objectID": "6033aee99bc610fe07a28c8f35f65a58",
      "ref": "burwash-walking-route"
    },
    {
      "description": "Hawkhurst",
      "objectID": "86a522d59255ab3d8cc6aac2323a3f7a",
      "ref": "hawkhurst-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3fabf07f813132bc1f97724d49e0d4fa.gpx",
  "_geoloc": {
    "lat": 51.000471833,
    "lng": 0.5402011543
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Bodiam_Castle_-_geograph.org.uk_-_133190.jpg",
      "title": "Hywel Williams / Bodiam Castle, via Wikimedia Commons",
      "caption": "Bodiam Castle. A picture of the castle, taken from the public footpath that runs north of the castle. The 14th century structure was built by Sir Edward Dalyngrigge, a former knight of Edward III, to defend the area against French invasion during the Hundred Years' War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Entrance_to_Bodiam_Castle_-_geograph.org.uk_-_1412776.jpg",
      "title": "PAUL FARMER / Entrance to Bodiam Castle, via Wikimedia Commons",
      "caption": "Entrance to Bodiam Castle. Taken from within the castle, the wall is all that remains of the original gatehouse. As a Grade I listed structure and Scheduled Monument, the castle is protected. Since 1925, Lord Curzon's bequest to The National Trust has owned the property, which is accessible to the general public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Bodiam_Castle_entrance_-_geograph.org.uk_-_19386.jpg",
      "title": "Nigel Freeman / Bodiam Castle entrance, via Wikimedia Commons",
      "caption": "Bodiam Castle entrance. Dating from 1385, one of the most 'romantic' castle settings in the South East of England. Lord Thanet had control of Bodiam Castle by the time the English Civil War broke out in 1641. He backed the Royalist cause and sold the castle to help pay the fines Parliament levied against him. After that, the castle was destroyed, and it remained an attractive ruin until John Fuller bought it in 1829."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Bodiam%2C_castle_footbridge_-_geograph.org.uk_-_560770.jpg",
      "title": "Chris Downer / Bodiam: castle footbridge, via Wikimedia Commons",
      "caption": "Bodiam: castle footbridge. The footbridge across the moat to the castle provides an impressive symmetrical sight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Bodiam_Bridge_across_River_Rother_-_geograph.org.uk_-_1412755.jpg",
      "title": "PAUL FARMER / Bodiam Bridge across River Rother",
      "caption": "Bodiam Bridge across River Rother. Road bridge across the Rover Rother taken from Bodiam Castle car park. A plaque nearby states that the walls were taken off the bridge during WWII to provide soldiers with a clear view to the road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Village_sign%2C_Bodiam_-_geograph.org.uk_-_2191529.jpg",
      "title": "Village sign, Bodiam by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Village sign, Bodiam. Although most well known for its castle, the village was also in a main hop-growing area in the last century and was famous for growing hops for Guinness. A railway was constructed to provide transport for the hoppers, the Kent and East Sussex Railway (K&ESR), which is a tourist attraction. There is also a noteworthy 12th-century church, which contains a brass of a knight with the arms of the de Bodeham family, one of the first lords of the manor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/River_Rother_upstream_of_Bodiam_Bridge_-_geograph.org.uk_-_2194956.jpg",
      "title": "River Rother upstream of Bodiam Bridge by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Rother upstream of Bodiam Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/National_Trust_gift_Shop%2C_Bodiam_Castle_-_geograph.org.uk_-_2191511.jpg",
      "title": "National Trust gift Shop, Bodiam Castle by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "National Trust gift Shop"
    }
  ],
  "distance_km": 1.0,
  "description": "This 14th century moated castle in Sussex is one of the National Trust's most visited properties. There's spiral staircases, battlements and the castle's original wooden portcullis, an extremely rare example of its kind. You can also listen to an interesting talk about medieval life from one of the authentically dressed medieval characters in the castle. The grounds are particularly lovely with wide lawns, views of the moat and the River Rother. Also look out for bats roosting in the castle structure. The Sussex Border Path long distance walking trail runs past the castle so you could pick this up and walk east to Northiam if you wanted to continue your walk. There is also a pleasant public footpath heading west along the River Rother.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "You could head west into the pretty village of Robertsbridge where you'll find several nice pubs including the George Inn. The pub is set in an old 18th century coaching inn and has a good menu and lots of character. Inside there's a cosy interior with warming fires and outside there's a sunny south facing patio for warmer days. You can find the pub in the centre of the village with a postcode of TN32 5AW for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs on short leads are welcome in the grounds around Bodiam Castle and in the Castle-view café but not inside the castle itself. The George Inn mentioned above is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south from the castle and you can visit Powdermill Reservoir where there's a circular walk around the encompassing Brede High Woods. It's a lovely place for a peaceful stroll with heathland, coppice, ghyll woodland, broadleaf woodland, ponds, springs and streams to enjoy. South west of the castle there's the pretty Darwell Reservoir. Here you can enjoy footpaths through Darwell Wood with views across the water. Nearer the castle there's a public footpath heading west along the River Rother. This will take you into Robertsbridge, passing the remains of Robertsbridge Abbey on the way. Just to the east is the beautiful Great Dixter House & Gardens in Northiam. There's a 15th-century manor house and the late Christopher Lloyd's exemplary gardens to explore here. Postcode is TN31 6PH."
    }
  ],
  "video_url": "https://www.youtube.com/embed/w7Y2OPWCxNs",
  "postcode": "TN32 5UJ",
  "district": "Rother",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Castle Inn, Peters Green Road, Bodiam, Ewhurst Green, Rother, East Sussex, England, TN32 5UJ, United Kingdom",
  "state": "England"
}