{
  "created_at": "2025-01-06T10:52:43.741758+00:00",
  "objectID": "3fe2465073cea44b2485bfae313e7965",
  "ref": "wolstonbury-hill-walking-route",
  "title": "Wolstonbury Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Trig_Point%2C_Wolstonbury_Hill_-_geograph.org.uk_-_1637866.jpg",
  "nearby": [
    {
      "description": "Devils Dyke",
      "objectID": "559c4472c28b81a7e291de92d4226085",
      "ref": "devils-dyke-walking-route"
    },
    {
      "description": "Ditchling Beacon",
      "objectID": "e7d5d940b5ebafa9b63be4b3a8b3092d",
      "ref": "ditchling-beacon-walking-route"
    },
    {
      "description": "Fulking",
      "objectID": "ab51140ef3d2c52b4e42f795aeed8f98",
      "ref": "fulking-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Chanctonbury Ring",
      "objectID": "363ee78a1c92cc96afd9561d72428d2c",
      "ref": "chanctonbury-ring-walking-route"
    },
    {
      "description": "Hassocks",
      "objectID": "c9ca81fd1023b84efb93890cfb2f0221",
      "ref": "hassocks-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/3/3fe2465073cea44b2485bfae313e7965.gpx",
  "_geoloc": {
    "lat": 50.9126790809,
    "lng": -0.1540223939
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Trig_Point%2C_Wolstonbury_Hill_-_geograph.org.uk_-_1637866.jpg",
      "title": "Simon Carey / Trig Point, Wolstonbury Hill",
      "caption": "Trig Point. Located within the former Bronze Age Fort which was built to guard a gap in the Downs. There is also an Iron Age fort to the north east and the Saxons also used it, King Alfred was alleged to have fought a battle here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Iron_Age_Fort%2C_Wolstonbury_Hill_-_geograph.org.uk_-_933459.jpg",
      "title": "Simon Carey / Iron Age Fort, Wolstonbury Hill",
      "caption": "Iron Age Fort, Wolstonbury Hill. Dated around late Bronze Age, early Iron Age the fort is at the peak of a chalk spur that looks out across the Weald. Its prominence meant that Romans, Saxons and Normans used it. Viewed from the fence of the bridleway that runs down to Pyecombe Street. The line of bushes crossing left to right marks the course of another bridleway whilst the orangey-red colour is courtesy of the late evening sunset."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Pyecombe%2C_Wolstonbury_Hill_bridleway_-_geograph.org.uk_-_643932.jpg",
      "title": "Peter Cox / Pyecombe, Wolstonbury Hill bridleway",
      "caption": "Pyecombe bridleway. This track runs west then north around Wellcombe Bottom from the Nore Track to New Way Lane. An ancient track it is clearly terraced."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Quarry%2C_Wolstonbury_Hill_-_geograph.org.uk_-_1637853.jpg",
      "title": "Simon Carey / Quarry, Wolstonbury Hill",
      "caption": "Quarry, Wolstonbury Hill Looking down into a disused chalk quarry on the north western side of the old bronze age fort. To the left is the northern escarpment of the South Downs with the tree fringed crown of Chanctonbury Ring prominent centre left. The clear skies also enable a fine view towards Blackdown Hill on the Sussex/Hampshire border in the far distance to the right. Of the wooded areas, Newtimber and Park Woods are beyond the working quarry to the left whilst Shaves Wood is to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/View_towards_Clayton_Windmills_from_the_east_side_of_Wolstonbury_Hill_-_geograph.org.uk_-_39763.jpg",
      "title": "Ian Cunliffe / View towards Clayton Windmills from the east side of Wolstonbury Hill",
      "caption": "View towards Clayton Windmills from the east side of the hill. Known locally as Jack and Jill, the structures comprise a post mill, a tower mill, and the roundhouse of a former post mill. All three are Grade II* listed buildings"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Footpath_Down_Wolstonbury_Hill_-_geograph.org.uk_-_1637881.jpg",
      "title": "Simon Carey / Footpath Down Wolstonbury Hill",
      "caption": "Footpath Down the hill. Quite literally down and not for the faint hearted. Despite it being twenty minutes after sunrise passed by a couple of breathless lads who had just walked up the slope using the small footholds that have appeared over time as a necessity for those climbing the slope. In the frost covered fields below are Little Danny in the foreground and Danny House, an Elizabethan mansion, behind it with Old Wood to its left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Pyecombe%2C_Wolstonbury_hill_top_-_geograph.org.uk_-_644060.jpg",
      "title": "Peter Cox / Pyecombe, Wolstonbury hill top",
      "caption": "Pyecombe, Wolstonbury hill top. The northern end of the hill top is covered in small hollows. Allegedly caused by paupers from Hurstpierpoint workhouse in the early part of the nineteenth century digging flints"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/View_West_from_Wolstonbury_Hill_-_geograph.org.uk_-_1637839.jpg",
      "title": "Simon Carey / View West from Wolstonbury Hill",
      "caption": "View West from the hill. Taken just before sunrise with the wooded slopes of Newtimber Hill to the left, beyond that is Fulking Hill, Perching Hill, Edburton Hill and Truleigh Hill with the masts just visible."
    }
  ],
  "distance_km": 5.7,
  "description": "This walk climbs to the splendid viewpoint on Wolstonbury Hill in the South Downs. It's a lovely area with woodland trails, chalk grassland, wildflowers and wonderful views to the coast. The walk starts from the Jack and Jill Inn near Clayton, just to the north east of the hill. From here you pick up tracks heading west and then south to Wellcombe Bottom. You continue north west on paths surrounding the hill before climbing to the 206 metres (676 ft) summit. From here there are fine views over the hills and countryside of the South Downs and the Weald. View highlights include the Clayton Windmills, Chanctonbury Ring, the Devil's Dyke and Ditchling Beacon. After taking in the views you head north east on footpaths and a country lane before returning to the pub.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Jack and Jill at the start of the route is a fine place for refreshments. They do great food and also have a lovely large garden area to relax in. You can find the pub at Brighton Rd, Clayton with a postcode of BN6 9PD for your sat nav. For some local history you could head into Hurstpierpoint and visit The New Inn. The inn dates back to 1450 and was built from old ships timbers, though the building now has a Georgian façade. The cellar also has a strange tunnel (now bricked up) that is rumoured to lead to the church and Danny House some two miles away. Outside there's a lovely large garden area surrounded by beautiful flowers and old walls. In the Summer the Inn becomes there's garden parties, BBQ's, Hog Roasts, open air music & plays. You can find them on the High Street at postcode BN6 9RQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and woods make for a fine dog walk and the Jack and Jill pub is also dog friendly. They will provide water bowls for your thirsty friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south west of the hill and you can pick up the South Downs Way National Trail. Follow it west and you can visit the popular Devils Dyke and climb to Fulking Hill. The Ditchling Beacon Nature Reserve is just a few miles east along the trail. You can visit the beacon and Wolstonbury Hill on the Hassocks Walk which starts from the train station in the nearby village.The circular Brighton and Hove Five Peaks Walk visits the hill and 4 of the other peaks in the area. The Hurstpierpoint Walk visits the hill from the village to the north, passing the striking Danny House on the way. The Grade I listed Elizabethan red brick mansion is an impressive sight and includes parkland with Bronze age settlements. Hurstpierpoint is also worthy of exploration with a number of historic properties dating from the 18th century. For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/i76KBX0SRgw",
  "district": "Clayton",
  "county": "West Sussex",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}