{
  "created_at": "2025-01-06T00:58:47.102968+00:00",
  "objectID": "1046e2dffd781b40bc029f0c79fc6d7c",
  "ref": "midland-railway-centre-walking-route",
  "title": "Midland Railway Centre - Golden Valley, Butterley Reservoir Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/25/Midland_Railway_Centre_-_Butterley_-_geograph.org.uk_-_1022105.jpg",
  "nearby": [
    {
      "description": "Alfreton",
      "objectID": "6b7dac2b6f3263ffdd4fe874acabcd61",
      "ref": "alfreton-walking-route"
    },
    {
      "description": "Codnor Park Reservoir",
      "objectID": "629fcf2e4fd7ebea83e914d8ca447126",
      "ref": "codnor-park-reservoir-walking-route"
    },
    {
      "description": "Heage Windmill",
      "objectID": "e78a34bfa75e6196150d17c6b0c32042",
      "ref": "heage-windmill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1046e2dffd781b40bc029f0c79fc6d7c.gpx",
  "_geoloc": {
    "lat": 53.0629019537,
    "lng": -1.4081458241
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Midland_Railway_Centre_-_Butterley_-_geograph.org.uk_-_1022105.jpg",
      "title": "Alan Heardman / Midland Railway Centre - Butterley",
      "caption": "Midland Railway Centre, Butterley. Preserved locomotive 80098 in steam at the end of the platform."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Midland_Railway_Centre_-_Butterley_-_geograph.org.uk_-_1035621.jpg",
      "title": "Ashley Dace / Midland Railway Centre - Butterley",
      "caption": "Butterley. The line looking towards Hammersmith station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Butterley_Reservoir_-_geograph.org.uk_-_1307438.jpg",
      "title": "Alan Murray-Rust / Butterley Reservoir",
      "caption": "Butterley Reservoir. Constructed as a feedwater reservoir for the Cromford Canal. The embankment carried the former Midland Railway branch from Crich Junction to Pye Bridge Junction, and now forms part of the Midland Railway Centre's operating line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Paths_next_to_Codnor_Park_Reservoir_-_geograph.org.uk_-_1463257.jpg",
      "title": "Alan Heardman / Paths next to Codnor Park Reservoir",
      "caption": "Paths next to Codnor Park Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Butterley_Tunnel_-_geograph.org.uk_-_1805393.jpg/512px-Butterley_Tunnel_-_geograph.org.uk_-_1805393.jpg",
      "title": "Alan Murray-Rust / Butterley Tunnel",
      "caption": "Butterley Tunnel. This carried the Cromford Canal through the watershed between the Erewash and Amber Valleys. It was closed due to subsidence from the coal mining in the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Footpath_in_Golden_Valley_-_geograph.org.uk_-_43959.jpg",
      "title": "Alan Walker / Footpath in Golden Valley",
      "caption": "Footpath in Golden Valley. This photograph is looking in an easterly direction towards the Riddings to Codnor road. A number of woodland trails and other visitor amenities have been created to extend the appeal of visiting the Midland Railway Centre at Butterley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Butterley_Gangroad_-_geograph.org.uk_-_1304482.jpg",
      "title": "Alan Murray-Rust / Butterley Gangroad",
      "caption": "Butterley Gangroad. This fine stone embankment carried the old Butterley Gangroad. This was a narrow gauge railway linking Hilt's Quarry at Crich with the Cromford Canal at Bull Bridge. It was owned by the Butterley Company and was a source of limestone for use in the smelting of iron at the nearby Butterley Works. The gangroad was in use from 1793 to 1933, originally using horses, with steam locomotives being used from around 1860."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Cromford_and_Butterley_-_geograph.org.uk_-_1450989.jpg",
      "title": "Alan Murray-Rust / Cromford and Butterley",
      "caption": "Cromford and Butterley. The track follows the course of a railway which was part of the private network of the Butterley Company. To the left of the track is the alignment of the former Cromford Canal, here filled in."
    }
  ],
  "distance_km": 5.0,
  "description": "This heritage railway in Derbyshire's Butterley has a delightful 35 acre country park with a wide range of wildlife areas and great views of the passing steam trains. The walk takes you around Butterley Reservoir, through Butterley park and on to Codnor Park Reservoir before finishing at Riddings station where you could catch the train back to the start point at Butterley. It's a lovely place for a stroll with views of the Golden Valley and a section of the disused Cromford Canal to see too.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can pick up the circular Alfreton Walk at nearby Pentrich. This route explores the area around the town, visiting the woodland of the Oakerthorpe Nature Reserve on the way. Head north west from the centre and you will soon come to expansive Ogston Reservoir. This large lake is located near the village of Brackenfield and is notable as one of Derbyshire's premier bird watching sites. A few miles west of the town you can pick up another section of the old Cromford Canal near Crich. You'll also find the excellent Tramway Village in this area too. This fascinating museum contains over 60 trams built between 1873 and 1982 and is set within a recreated period village containing a working pub, cafe, old-style sweetshop and tram depots.  Just to the west there's another local historic highlight at Heage Windmill. The Grade II listed mill dates from the 18th century and has recently been restored to working order. You can tour the mill and enjoy a stroll through the surrounding countryside before visiting the village of Heage. For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Pp4I7HM-4X0",
  "district": "Ripley",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}