{
  "created_at": "2025-01-06T01:26:04.360333+00:00",
  "objectID": "10cecdad4b682e8a0ca4ead897f79f8f",
  "ref": "bakewell-walking-route",
  "title": "Bakewell Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Bakewell_Ford_%28geograph_3432987%29.jpg/512px-Bakewell_Ford_%28geograph_3432987%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/10cecdad4b682e8a0ca4ead897f79f8f.gpx",
  "_geoloc": {
    "lat": 53.2140039318,
    "lng": -1.6681600973
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Bakewell_Ford_%28geograph_3432987%29.jpg/512px-Bakewell_Ford_%28geograph_3432987%29.jpg",
      "title": "John Walton / Bakewell Ford",
      "caption": "Bakewell Ford. Found beside the packhorse bridge on the River Wye and adjacent to Holme Hall this ford has been blocked to by concrete bollards on the A6 side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Rutland_Arms_Hotel%2C_Bakewell_-_geograph.org.uk_-_768196.jpg",
      "title": "Row17 / Rutland Arms Hotel, Bakewell",
      "caption": "Rutland Arms Hotel, Bakewell. This reputed to be the place where Bakewell Pudding (Tart) was invented."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Castle_Street%2C_Bakewell_-_geograph.org.uk_-_1160567.jpg",
      "title": "Peter Barr / Castle Street, Bakewell",
      "caption": "Castle Street, Bakewell. The only Castle is the pub at the end of the street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Chatsworth_Park_Bridge_-_geograph.org.uk_-_1567813.jpg",
      "title": "jeff collins / Chatsworth Park Bridge",
      "caption": "Chatsworth Park Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Chatsworth_House_-_geograph.org.uk_-_1296687.jpg",
      "title": "Wally Haines / Chatsworth House",
      "caption": "Chatsworth House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Haddon_Hall_%28geograph_2270973%29.jpg/512px-Haddon_Hall_%28geograph_2270973%29.jpg",
      "title": "Trevor Rickard / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Haddon Hall"
    }
  ],
  "distance_km": 15.5,
  "description": "The market town of Bakewell makes and excellent base for exploring the Derbyshire Dales area of the Peak District National Park. This long circular walk visits some of the villages, parks, woods and hills surrounding the town. There's lots to see with riverside paths, historic halls and beautiful countryside. The walk starts in the centre of the town and then climbs past Bakewell Hill Golf Club towards Calton Pasture where there are nice pockets of woodland and good views of the surrounding area. On this section you climb to a height of well over 800ft with a trig point on Calton Pasture to look out for. From here you descend to New Piece Wood before reaching the village of Edensor. The little village is noted for the Grade I listed St Peter's Church. Many of the Dukes of Devonshire, are buried in the churchyard. There is also the Cavendish Memorial, an early 17th century church monument to Henry and William Cavendish, commemorating the sons of Sir William Cavendish and Bess of Hardwick. Near the church you can enjoy refreshments at the delightful Edensor Tea Cottage. The walk continues to the nearby Chatsworth Park. The magnificent park is one of the highlights of the Peak District and well worth visiting if you have time. In the park you will find 1000 acres of parkland and gardens with views of the River Derwent, woodland trails and fallow deer. At Chatsworth you can pick up the Derwent Valley Heritage Way and enjoy a waterside walk south along the River Derwent. On this section you pass Calton Lees before coming to the village of Rowsley. The little village is notable as the point where the River Wye flows into the River Derwent. There's also the Grade-II listed Peacock hotel, which dates from the middle of the 17th century. The 19th century St Katherine’s Church is also noteworthy. The 7th Duke of Rutland laid coins of every value, from a sovereign to half a farthing in the foundation of the church. After leaving Rowsley the walk heads west through Manners Wood before coming to Haddon Hall and Park. The fine country house on the River Wye is one of the seats of the Duke of Rutland. The hall originates from the 11th century with the medieval and Tudor hall dating from the 13th to the 17th centuries. Haddon Hall was used as the setting for Thornfield Hall in the 2006 BBC television version of Jane Eyre, starring Toby Stephens and Ruth Wilson. You can explore the lovely grounds with Elizabethan terraced gardens and views over the River Wye. You can generally visit the hall during the summer months. The final section of the walk follows the River Wye, back into Bakewell where you can enjoy refreshments at one of the many pubs and cafes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rutland Arms is a nice choice for some post walk refreshments. The pub dates all the way back to 1804 and is reputed to be the origin of the famous Bakewell Pudding. The pudding is though to have originated through a mistake by the cook at the hotel in the 1860s. A Strawberry Tart was ordered for the guest and instead of stirring the egg mixture into the pastry, the cook poured it over the strawberry jam. The pudding was so well received by the guest that the recipe became recognised as the Bakewell Pudding. The hotel can also boast a unique connection with author, Jane Austen. Local legend has it that she stayed in one of the rooms whilst writing her most famous text, Pride and Prejudice. The hotel does fine food in both the bar and restaurant and also provide good quality accommodation if you need to stay over. You can find the hotel on The Square at a postcode of DE45 1BT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland, parkland and countryside surrounding the town are great dog walking country. The Rutland Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's lots of other walks to try in the Bakewell area. The excellent Monsal Trail starts in Bakewell and runs to Chee Dale along a disused railway line.You can also head to the nearby Lathkill Dale. The dale is a peaceful, atmospheric area flanked with large limestone cliffs and woodland. There's nice views of the Lathkill River with its pretty weirs and waterfalls. Just to the south of the dale you can also visit the fascinating Neolithic henge monument of Arbor Low.The picture postcard village of Ashford in the Water is just over a mile away. You can follow a footpath along the River Wye to Lumford Mill and Ashford Lake before coming to the lovely village. Just to the south of Bakewell you can pick up the Limestone Way long distance trail at Youlgreave. The circular Bakewell Railway Walk starts from the town. It uses part of the Monsal Trail to visit Monsal Head before looping round through the countryside to Ashford in the Water. The circular Rowsley Walk starts from the nearby village and visits Bakewell, Chatsworth and the 11th century Haddon Hall which is another local historic highlight. The village is home to the modern Peak Shopping Village where there's a good range of stores and plenty of eateries for refreshment. In this area you can also visit the neighbouring village of Beeley where you can explore the expansive Beeley Moor and visit the village's excellent 18th century coaching inn. Just to the west you will find the village of Sheldon and the noteworthy Magpie Mine. Here you can explore a series of well preserved Lead Mines which date back to the 1600s. The historical site is a Scheduled Ancient Monument and another of the local area highlights. For more walking ideas in the area see the Peak District Walks and White Peak Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bmL494QY5GU",
  "district": "Derbyshire Dales",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Coombs Road, Bakewell CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE45 1AR, United Kingdom",
  "postcode": "DE45 1AR",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland",
    "river"
  ],
  "points_of_interest": [
    "historic halls",
    "countryside",
    "church",
    "gardens"
  ],
  "facilities": [
    "tea room",
    "pub/cafe",
    "hotel",
    "church"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}