{
  "objectID": "10ea707afab28ce67f098301c9ba89b9",
  "created_at": "2024-12-18T23:13:26.596691+00:00",
  "ref": "chesil-beach-walking-route",
  "title": "Chesil Beach Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Northwestern_end_of_Chesil_beach%2C_near_Seawell_Knap_-_geograph.org.uk_-_25113.jpg",
  "nearby": [
    {
      "description": "Burton Bradstock",
      "objectID": "cc6725eca4d9a9a20abd7a5a5f48c4e7",
      "ref": "burton-bradstock-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Abbotsbury Subtropical Gardens",
      "objectID": "1906a4292514a355a3960ae21eac74e7",
      "ref": "abbotsbury-subtropical-gardens-walking-route"
    },
    {
      "description": "Golden Cap Estate",
      "objectID": "183cadcb76d8e0ba508b40b23241b42c",
      "ref": "golden-cap-estate-walking-route"
    },
    {
      "description": "Rodwell Trail",
      "objectID": "e959d8d8516cf3f298f8e363a3c2bf85",
      "ref": "rodwell-trail-walking-and-cycle-route"
    },
    {
      "description": "Isle of Portland",
      "objectID": "13b7dffbffa85409b9dca90d0c28ffad",
      "ref": "isle-of-portland-walking-route"
    },
    {
      "description": "Portland Quarry",
      "objectID": "6429338157aaa69761358c5169be240a",
      "ref": "portland-quarry-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/D8E907EBF8E276D285257F70005A0865/$FILE/Chesil Beach.gpx",
  "_geoloc": {
    "lat": 50.5768264705,
    "lng": -2.4687070082
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Northwestern_end_of_Chesil_beach%2C_near_Seawell_Knap_-_geograph.org.uk_-_25113.jpg",
      "title": "Jim Champion / Northwestern end of Chesil beach, near Seawell Knap",
      "caption": "Northwestern end of Chesil beach, near Seawell Knap. A lone seafisherman braves the wind on this section of the beach. The beach shelves rapidly along the whole of the shingle bank. The huge cliff at the Golden Cap Estate can be seen through the spray in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Cogden_Beach%2C_Chesil_Bank_-_geograph.org.uk_-_300199.jpg/256px-Cogden_Beach%2C_Chesil_Bank_-_geograph.org.uk_-_300199.jpg",
      "title": "Jim Champion / Cogden Beach, Chesil Bank",
      "caption": "Cogden Beach, Chesil Bank. View along the shore of Cogden Beach, itself a western stretch of the larger Chesil Bank. In the distance are the limestone cliffs at Burton Cliff, and lost in the spray is Golden Cap. The static caravans on the right are perched on a slope labelled as 'Cliff End' on the old maps, presumably because this is where the cliffs behind the bank end. From here to the Isle of Portland (in the opposite direction) there are no cliffs behind the bank - in fact for much of the Bank's length the lagoon known as \"The Fleet\" lurks behind the tomobolo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Kite_flying_on_the_landward_side_of_Chesil_Beach%27s_northwestern_end_-_geograph.org.uk_-_25114.jpg",
      "title": "Jim Champion / Kite flying on the landward side of Chesil Beach's northwestern end",
      "caption": "Kite flying on the landward side of the Beach's northwestern end. This photo was taken from a point on the landward side of the shingle bank, sheltered from the prevailing SW wind. The wooden handrail follows a walkway up to the top of the bank from the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Reed_beds_at_the_northwestern_end_of_the_Fleet%2C_behind_Chesil_Beach_-_geograph.org.uk_-_25117.jpg",
      "title": "Jim Champion / Reed beds at the northwestern end of the Fleet, behind Chesil Beach",
      "caption": "Reed beds at the northwestern end of the Fleet, behind the beach. At the extreme end of West Fleet is this broad bed of reeds. On the right is the distance is Linton Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/The_end_of_West_Fleet%2C_with_anti-tank_defences_on_the_landward_side_of_Chesil_beach_-_geograph.org.uk_-_25118.jpg",
      "title": "Jim Champion / The end of West Fleet, with anti-tank defences on the landward side of Chesil beach",
      "caption": "The end of West Fleet, with anti-tank defences on the landward side of the beach. The marshes and WWII anti-tank defences on the shingle bank lie within the grid square. On the other side of the water is Abbotsbury Swannery and the hills on the left and right of the photo are Linton Hill and Chesters Hill respectively. The anti-tank defences on the seaward side of the beach have been removed by the action of the sea over the past 60 years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Chesil_Beach_and_West_Fleet_from_Berry%27s_Knap_-_geograph.org.uk_-_620204.jpg",
      "title": "Nigel Mykura / Chesil Beach and West Fleet from Berry's Knap",
      "caption": "Chesil Beach and West Fleet from Berry's Knap. Berry's Knap is a small hill on the north side of the Fleet opposite the beach. The small amount of land in this square is mainly pasture fields."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Huts_on_Chesil_Beach_-_geograph.org.uk_-_1286396.jpg",
      "title": "Nigel Mykura / Huts on Chesil Beach",
      "caption": "Huts on the beach. These huts on the crest of the shingle bank probably have a military connection. View south east along the beach towards Portland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/West_Weare_from_West_Cliff_-_geograph.org.uk_-_1029709.jpg/256px-West_Weare_from_West_Cliff_-_geograph.org.uk_-_1029709.jpg",
      "title": "Jim Champion / West Weare from West Cliff",
      "caption": "West Weare from West Cliff. The landslides of West Weare are where stone has naturally collapsed (or been tipped from the cliff-top quarries) over the Kimmeridge Clay below. Beyond this is Chesil Cove at the southern end of Chesil Beach."
    }
  ],
  "distance_km": 33.0,
  "description": "This walk takes you along Chesil Beach to St Catherine's Chapel in Weymouth , Dorset. The walk starts from the Chesil Beach Centre car park at Portland Harbour. The centre has a welath of information about the area, wildlife exhibitions and a good cafe. The pebble beach runs for 18 miles with a series of beautiful lagoons on one side and the sea on the other. The Fleet lagoons are also a nature reserve so look out for a variety of coastal birds including Goldeneye and Manx shearwater. This walk runs from the car park to Abbotsbury where you will find the delightful Abbotsbury Subtropical Gardens and St Catherine's Chapel which is dated from the 14th century. You can return along the beach or pick up the South West Coast Path at Abbotsbury and return on the other side of the lagoons. You can also continue all the way along the beach to Burton Bradstock. This section of the beach passes West Bexington Nature Reserve and Burton Mere. The reserve consists of reedbed with grazing marsh and mixed coastal scrub. It is home to a variety of flora and fauna including Cetti's warbler, reed warbler, reed bunting, dormouse and water vole. As such it is another highlight of this wonderful stretch of Dorset coast. At the end of the beach you will find the splendid Burton Bradstock Estate run by the National Trust.",
  "video_url": "https://www.youtube.com/embed/N4DTguXkXGw",
  "postcode": "DT4 9XE",
  "county": "Dorset",
  "region": "South West",
  "country": "England"
}