{
  "created_at": "2025-01-06T04:15:17.762358+00:00",
  "objectID": "11b3cd68add3a7e458f139523d9a3fc9",
  "ref": "seaford-to-eastbourne-walking-route",
  "title": "Seaford to Eastbourne Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Seaford_beach%2C_East_Sussex_%282003%29.jpg",
  "nearby": [
    {
      "description": "Vanguard Way",
      "objectID": "d526829c942476c5ae331b2b89b7b812",
      "ref": "vanguard-way-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Brighton to Eastbourne",
      "objectID": "426a04cc4f6904f72627e94480ea1e2c",
      "ref": "brighton-to-eastbourne-walking-route"
    },
    {
      "description": "Seaford",
      "objectID": "89116560f817741153e1999bc1f153d7",
      "ref": "seaford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/11b3cd68add3a7e458f139523d9a3fc9.gpx",
  "_geoloc": {
    "lat": 50.7711529245,
    "lng": 0.0958674891
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Seaford_beach%2C_East_Sussex_%282003%29.jpg",
      "title": "Peter Jordan [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Seaford Beach"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Cuckmere_River_at_Seven_Sisters_Country_Park.JPG/512px-Cuckmere_River_at_Seven_Sisters_Country_Park.JPG",
      "title": "By Editor5807 (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Cuckmere River at Seven Sisters Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Seven_Sisters_Country_Park_Sign_-_geograph.org.uk_-_1282013.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Seven Sisters Country Park Sign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Birling_Gap_March_2017_04.jpg/512px-Birling_Gap_March_2017_04.jpg",
      "title": "By Arild Vågen (Own work) [CC BY-SA 4.0 (http://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Birling Gap"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Beachy_Head_March_2017_01.jpg/512px-Beachy_Head_March_2017_01.jpg",
      "title": "By Arild Vågen (Own work) [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Beachy Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Eastbourne_Pier_March_2017_03.jpg/512px-Eastbourne_Pier_March_2017_03.jpg",
      "title": "By Arild Vågen (Own work) [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Eastbourne Pier - route end!"
    }
  ],
  "distance_km": 21.0,
  "description": "This is a popular coastal walk between these two East Sussex towns. It passes through many of the highlights of this beautiful area of the South Downs. This includes visits to Cuckmere River and Cuckmere Haven, Birling Gap, Seven Sisters Country Park, Friston Forest and Beachy Head. The route uses sections of the long distance Vanguard Way and South Downs Way to guide you along the coast. As such the footpaths are waymarked and generally in good condition. It's about a 13 mile walk with the option of returning to Seaford on a splendid coastal bus ride from Eastbourne. The walk starts in Seaford and heads east along the coast, passing the Martello Tower and the Seaford Head Nature Reserve. From here there are spectacular views of the Seven Sisters Cliffs and the Cuckmere Valley. It's also a great place for flora and fauna with nationally rare and significant species of plants, birds and insects. The route then follows a riverside path north along the Cuckmere River. It's a very pretty area with species-rich chalk grassland and wildflowers in the summer months. Look out for wildlife which includes a variety of butterflies and wildfowl. The route crosses the Exceat Bridge over the river to enter Seven Sisters Country Park. Here you will find 700 acres of parkland with lots of footpaths and cycling trails. You pick up the South Downs Way here and follow it south through the park to the coast. The next section takes you to Birling Gap where you can visit the National Trust owned Belle Tout lighthouse. It's a good place to stop for refreshments with a nice cafe and great views. The next stage takes you from Birling Gap to Beachy Head. Here you will find the highest chalk sea cliff in Britain, rising to a height of 162 metres (531 ft) with fabulous views along the coast to West Sussex and Dungeness in Kent. The final section descends into Eastbourne, passing along the beach before finishing at the pier. For a longer, marathon length route try our Brighton to Eastbourne Walk .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the Birling Gap you could stop off at the nice National Trust on site cafe. There's a good selection of light lunches and snacks with fine views from the outdoor seating area. You could also stop at the pleasant village of Friston. Here we recommend heading to the noteworthy Tiger Inn. It's a quintessentially English pub, with its open fire, low-slung oak beams, real ales and hearty food. Dating from the 16th century the pub has been serving surrounding residents, farmers, soldiers, walkers and smugglers for hundreds of years. There's a nice large outdoor area looking onto the pretty village green. It's a great spot to rest your legs and enjoy a drink before continuing the walk. You can find the pub in the centre of the village at a postcode of BN20 0BY. The Saltmarsh Cafe & Rooms is located at Exceat, close to the main entrance of the Seven Sisters Park. The delightful cafe is set in a 16th Century farmhouse and includes a pretty courtyard where you can relax on warmer days. The rustic café, kitchen and bar serves a delicious menu with a focus on fresh Sussex produce. Dishes make good use of foraged and seasonal ingredients for a rich and distinctive flavour. Saltmarsh also does high quality accommodation if you'd like to stay in the area. The cafe can be found at postcode BN25 4AD. At Beachy Head there's the splendid Beachy Head Inn. The pub dates back to 1880 and has a charming interior with cosy fires. Outside there's a good sized garden area with nice views of the surrounding South Downs countryside. You can find the pub a short hop from the car park and lighthouse on Beachy Head Road. The outdoor area is also dog friendly if you have your four legged friend with you.  Pictured above the Beachy Head Pub and countryside centre. Two worthy places to stop at on the route."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the route consider taking some time to explore the Beachy Head Countryside Centre. There's some interesting exhibitions detailing the history of the area and the bravery of the people who have had to rescue people off the notorious cliffs. There's also a good gift shop and a gallery of photos of this stunning area. You'll find it right on the route on the headland, just west of Eastbourne. It's well worth popping in on your outing if you have time."
    }
  ],
  "postcode": "BN25 1EB",
  "district": "Seaford",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Marine Parade, East Blatchington, Seaford, Lewes, East Sussex, England, BN25 1EB, United Kingdom",
  "state": "England"
}