{
  "created_at": "2025-01-06T04:11:24.368215+00:00",
  "objectID": "1222de0093598614c8a24d2ae45be524",
  "ref": "narberth-walking-route",
  "title": "Narberth Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Narberth_Town_Hall_-_geograph.org.uk_-_2501621.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1222de0093598614c8a24d2ae45be524.gpx",
  "_geoloc": {
    "lat": 51.7984483646,
    "lng": -4.7418734266
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Narberth_Town_Hall_-_geograph.org.uk_-_2501621.jpg",
      "title": "Narberth Town Hall by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Narberth Town Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Narberth_castle_from_Market_square_-_geograph.org.uk_-_529641.jpg",
      "title": "ceridwen / Narberth castle from Market square",
      "caption": "Narberth castle from Market square. Looking down Market Street, past the old court house on the right, the eastern part of the castle is visible. Norman, dating from C13, it was burnt/destroyed by the Welsh, and rebuilt, several times before C14. It was inhabited until 1677. Opened to public access in recent years."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Narberth_Town_Moor_-_geograph.org.uk_-_530551.jpg",
      "title": "ceridwen / Narberth Town Moor",
      "caption": "Narberth Town Moor. A lovely open space at the top of the town where all sorts of community activities take place including an annual food festival."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Tabernacle_Lane_and_chapel%2C_Narberth_-_geograph.org.uk_-_529601.jpg",
      "title": "ceridwen / Tabernacle Lane and chapel, Narberth",
      "caption": "Tabernacle Lane and chapel. The lane runs off the southwest end of James Street. The chapel is United Reformed, an 1858 replacement of a simpler chapel which was once the ministry of Caleb Morris (1800-1865) a celebrated preacher. From the Welsh DNB: \"In 1822 he received a call to Narberth, Pembs., he was ordained there 2 April 1823. Morris moved to Fetter Lane, London, in 1827... Large crowds flocked to Fetter Lane to hear him. Owing to periods of physical weakness he was in the habit of returning to Wales to seek a renewal of his strength. He also sought for health in Switzerland and Germany but had to relinquish the care of his church and retire to Pembrokeshire... He possessed unusual gifts as a preacher and delighted in spiritual meditation. In spite of physical weakness he became one of the leading lights of the London pulpit.\" In September 1829 a man was sentenced at the Old Bailey to 7 years transportation for stealing Caleb Morris's hat from the vestry at Fetter Lane,"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/%22Rebecca%27s_cell%22_at_Narberth_-_geograph.org.uk_-_530506.jpg",
      "title": "ceridwen / \"Rebecca's cell\" at Narberth",
      "caption": "\"Rebecca's cell\" at Narberth. In the 1830s and 40s local people in West Wales took the law into their own hands in protest against English-imposed tolls, taxes and repressive legislation. They disguised themselves in women's clothes and operated under the name of Rebecca. I do not know if there is evidence that any of the 'Rebeccas' occupied this lock-up under the town hall but the freedom fighters were active in Narberth, attacking the workhouse and the tollgate, so it is very possible that they did."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Part_of_the_Knight%27s_Way_on_Narberth_Mountain_-_geograph.org.uk_-_2501605.jpg",
      "title": "Part of the Knight's Way on Narberth Mountain by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Part of the Knight's Way on Narberth Mountain"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Canaston_Wood_-_geograph.org.uk_-_243958.jpg",
      "title": "Jeremy Owen / Canaston Wood",
      "caption": "Canaston Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/32/Blackpool_Mill_-_geograph.org.uk_-_14031.jpg",
      "title": "Garth Newton / Blackpool Mill",
      "caption": "Blackpool Mill"
    }
  ],
  "distance_km": 21.0,
  "description": "This delightful market town in Pembrokeshire includes an attractive High Street with many Edwardian and Georgian buildings to admire. There's also the historic ruins of Narberth Castle which dates back to the 13th century. For walkers there's two long distance waymarked footpaths and some peaceful local woodland to enjoy. This circular walk from the town uses sections of the Knight's Way and the South of the Landsker Trail to explore the surrounding countryside and woodland. On the way you'll visit Canaston Woods, the 19th century Blackpool Mill, Minwear Wood and Naberth Mountain. The route runs for about 14 miles with some moderate hill climbs. There's some splendid views over the area from the high points and a nice waterside stretch along the River Cleddau to enjoy on the way. For cyclists there's some good mountain bike trails through Canaston Woods to try.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Angel is a nice place for some post walk refreshments. The 18th century coaching inn includes a cosy interior with real fires. Outside there's a sunny beer garden for warmer days. You can find them at 43 High St, SA67 7AS."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and country trails make for a fine dog walk. The Angel mentioned above is dog friendly in the garden area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you were to follow the Landsker Trail south it would take you to Templeton, Kilgetty and Saundersfoot on the beautiful Pembrokeshire Coast. Here you could pick up the popular Tenby to Saundersfoot Walk and the Tenby to Lydstep Walk. For more walking ideas in the area see the Pembrokeshire Coast Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dZh96PDSDyg",
  "postcode": "SA67 7DD",
  "district": "Narberth",
  "county": "Pembrokeshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "4, St James Street, Narberth, Pembrokeshire, Cymru / Wales, SA67 7DD, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain",
    "coastal"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}