{
  "created_at": "2025-01-06T11:14:37.112419+00:00",
  "objectID": "12a3a5fd31cb98081341737059fa4634",
  "ref": "tenterden-walking-route",
  "title": "Tenterden Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Footbridge_to_SE_of_Tenterden_-_geograph.org.uk_-_64878.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/12a3a5fd31cb98081341737059fa4634.gpx",
  "_geoloc": {
    "lat": 51.0680016354,
    "lng": 0.6878115957
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Footbridge_to_SE_of_Tenterden_-_geograph.org.uk_-_64878.jpg",
      "title": "Barry Hunter / Footbridge to SE of Tenterden, via Wikimedia Commons",
      "caption": "Footbridge to SE of Tenterden. Footbridge where path leaves main path down valley leading away from Tenterden. The path rises out of the valley towards Ratsbury."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Appledore_Lane%2C_Tenterden_-_geograph.org.uk_-_64875.jpg",
      "title": "Barry Hunter / Appledore Lane, Tenterden, via Wikimedia Commons",
      "caption": "Appledore Lane, Tenterden. Seen here the start of a lane leading off the main road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Tenterden_Railway_Station_-_geograph.org.uk_-_1005659.jpg",
      "title": "David Anstiss / Tenterden Railway Station, via Wikimedia Commons",
      "caption": "Tenterden Town Railway Station, with the parish church in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Smallhythe_Place_-_geograph.org.uk_-_14479.jpg",
      "title": "Vernon Dunhill / Smallhythe Place, via Wikimedia Commons",
      "caption": "Smallhythe Place. Ellen Terry's early 16th century house"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/View_From_Smallhythe_Bridge_-_geograph.org.uk_-_231190.jpg",
      "title": "Stephen Nunney / View From Smallhythe Bridge, via Wikimedia Commons",
      "caption": "Country view From Smallhythe Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Raspberry_Oast%2C_Smallhythe_Road%2C_Tenterden%2C_Kent_-_geograph.org.uk_-_570234.jpg",
      "title": "Oast House Archive / Raspberry Oast, Smallhythe Road, Tenterden, Kent, via Wikimedia Commons",
      "caption": "Raspberry Oast, Smallhythe Road, Tenterden, Kent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Footbridge_and_stile_near_Belcot_Manor_Farm_-_geograph.org.uk_-_1742347.jpg/512px-Footbridge_and_stile_near_Belcot_Manor_Farm_-_geograph.org.uk_-_1742347.jpg",
      "title": "David Anstiss / Footbridge and stile near Belcot Manor Farm, via Wikimedia Commons",
      "caption": "Footbridge and stile near Belcot Manor Farm. The bridge (over a field ditch) and stile is on the High Weald Landscape Trail heading from the Tilder Gill towards Smallhythe Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Stile_on_High_Weald_Landscape_Trail_near_Dumbourne_Farm_-_geograph.org.uk_-_1742622.jpg/512px-Stile_on_High_Weald_Landscape_Trail_near_Dumbourne_Farm_-_geograph.org.uk_-_1742622.jpg",
      "title": "David Anstiss / Stile on High Weald Landscape Trail near Dumbourne Farm, via Wikimedia Commons",
      "caption": "Stile on High Weald Landscape Trail near Dumbourne Farm. This stile is on the long distance path as it heads from Belcot Manor Farm (via the Tilden Gill) towards Small Hythe. The footbridge leads over a small field ditch."
    }
  ],
  "distance_km": 11.5,
  "description": "This Kent town has some nice walks to try around the High Weald AONB in which it sits. This walk makes use of the waymarked High Weald Landscape Trail to take you through the countryside to take you to the historic Smallhythe Place to the south of the town. The walk starts just to the south of the town where you can pick up the High Weald Landscape Trail. This signed, long distance path will take you south to Belcot Manor Farm, passing the Tilder Gill on the way. You then head past more farmland and some peaceful woodland before coming to Small Hythe Place. This National Trust half-timbered house was built in the late 15th or early 16th century. It was the home of the Victorian actress Ellen Terry from 1899 to her death in the house in 1928. The house contains Ellen Terry's theatre collection, while the cottage grounds include her rose garden, orchard, nuttery and the working Barn Theatre. There's also a nice tea room in the pretty garden for refreshments. After exploring the house the route then follows a public footpath west past the vineyard and Pheasantry, before looping round through Ashenden to rejoin the trail. You can then follow this north back into Tenterden.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Vine Inn in Tenterden has a nice walled garden to sit out in on finer days. You can find it on the High Street at postcode TN30 6AU."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the north west of the town you will find one of the highlights of the county at Sissinghurst Castle. There's lovely footpaths around the grounds with a the gazebo by the pretty moat, and the 16th century tower with vast panoramic views from the top. The castle can be easily reached on foot from the nearby town of Cranbrook on the Cranbrook Walk. The neighbouring town is also well worth exploring with its medieval buildings, a church known as the 'Cathedral of the Weald' and a very photogenic working windmill to see. It's about a 3 mile walk from the town to the castle, passing through some attractive woodland and farmland on the way. Near here there's also the neighbouring village of Biddenden. It's a worthy place to visit with a picturesque village green, a fine 15th century pub and a photogenic High Street with a number of old Flemish weavers cottages to admire. If you head a few miles south east from the town you could pick up the Royal Military Canal Path at Appledore and enjoy some easy waterside walking. The town is accessible by public transport on the splendid Kent and East Sussex Railway. The heritage railway actually has its terminus here. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "postcode": "TN30 6BJ",
  "district": "Tenterden",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "1;3, Bells Lane, Tenterden, Ashford, Kent, England, TN30 6BJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "farmland"
  ],
  "points_of_interest": [
    "historic house",
    "theatre"
  ],
  "facilities": [
    "tea room",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}