{
  "created_at": "2025-01-06T03:25:23.212876+00:00",
  "objectID": "12cee43b0cc0c074bf34ec52893b5b0f",
  "ref": "lanhydrock-walking-and-cycle-route",
  "title": "Lanhydrock Walks and Cycle Trails",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/22/Geometric_garden_beds%2C_Lanhydrock_-_geograph.org.uk_-_660157.jpg",
  "nearby": [
    {
      "description": "Cornish Way",
      "objectID": "f5219fac3a40f9d105417783afad01c1",
      "ref": "cornish-way-cycle-route"
    },
    {
      "description": "Saints Way",
      "objectID": "8d883d251886cb93951db47f4c100ddb",
      "ref": "saints-way-walking-route"
    },
    {
      "description": "Camel Trail",
      "objectID": "dcae27896312abf1091e5973a84ef27e",
      "ref": "camel-trail-walking-and-cycle-route"
    },
    {
      "description": "Helman Tor",
      "objectID": "2956a00a7723ca895f02b04b938012ea",
      "ref": "helman-tor-walking-route"
    },
    {
      "description": "Helman Tor",
      "objectID": "2956a00a7723ca895f02b04b938012ea",
      "ref": "helman-tor-walking-route"
    },
    {
      "description": "Luxulyan Valley",
      "objectID": "28a9e6a1b2b0d111b23365fdc7d14509",
      "ref": "luxulyan-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/12cee43b0cc0c074bf34ec52893b5b0f.gpx",
  "_geoloc": {
    "lat": 50.4454226663,
    "lng": -4.6659306994
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Geometric_garden_beds%2C_Lanhydrock_-_geograph.org.uk_-_660157.jpg",
      "title": "Humphrey Bolton / Geometric garden beds, Lanhydrock",
      "caption": "Geometric garden beds. A large lawn in front of the house is divided into six sections each with four clipped yews and small garden beds, edged by miniature box hedges."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/The_garden_-_Lanhydrock_-_geograph.org.uk_-_1351015.jpg",
      "title": "Sarah Smith / The garden - Lanhydrock",
      "caption": "The garden - Lanhydrock. The gardens are extensive around the house. This shows the edge of a woodland garden up behind the house. The vegetation in the foreground borders a stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/The_walk_through_the_Park_-_Lanhydrock_-_geograph.org.uk_-_1351027.jpg",
      "title": "Sarah Smith / The walk through the Park - Lanhydrock",
      "caption": "The walk through the Park. From the Visitors Centre and car parks there is quite a long but pleasant walk down through parkland to the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Lanhydrock_-_geograph.org.uk_-_1351022.jpg",
      "title": "Sarah Smith / Lanhydrock",
      "caption": "View of the gatehouse and gardens. As one arrives at the bottom of the hill an impressive sight meets the eye. The gatehouse is 17th century and all that remains - except for the North Wing -of the original house. The present house is Grade I and mostly Victorian."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/The_church_of_St_Hydroc_-_Lanhydrock_-_geograph.org.uk_-_1351006.jpg",
      "title": "Sarah Smith / The church of St Hydroc - Lanhydrock",
      "caption": "The church of St Hydroc. Named after a 5th century Cornish saint who is the patron saint of Lanhydrock and whose feast day is 5th May. The church dates back to the 15th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Rhododendron_petals%2C_Lanhydrock_-_geograph.org.uk_-_1289015.jpg",
      "title": "Derek Harper / Rhododendron petals, Lanhydrock",
      "caption": "Rhododendron petals. The fallen petals make a vivid carpet a little northeast of the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Parterre%2C_Lanhydrock_House_-_geograph.org.uk_-_660197.jpg",
      "title": "Humphrey Bolton / Parterre, Lanhydrock House",
      "caption": "Parterre. This part of the garden is a complicated arrangement of small beds edged by miniature box hedges, and is planted with bedding-out plants in Spring and Summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Border_plants_at_Lanhydrock_-_geograph.org.uk_-_1426148.jpg",
      "title": "Richard Hoare / Border plants at Lanhydrock",
      "caption": "Border plants at Lanhydrock"
    }
  ],
  "distance_km": 4.0,
  "description": "This walk takes you to the beautiful Lanhydrock estate from Bodmin Parkway Train Station. You can catch a train from Truro or St Austell to Bodmin Parkway and then follow footpaths to Lanhydrock. It's a nice two mile walk along the River Fowey and through woodland to the National Trust owned Victorian country house. The estate is very special with wonderful architecture and beautiful gardens. There are 1000 acres of woodland, parkland and gardens to explore on a network of good footpaths. Highlights include the magnolia arch by the thatched cottage and beautiful herbaceous borders. You can also visit the magnificent house and explore the kitchen area, servants' quarters and museum. Although the whole of this route is designed for walkers cyclists can also enjoy a number of trails in the estate. There are easy, moderate and difficult trails to try. Click here to see a trail map or look at the Open Street Map link below which shows the trails marked in blue just to the north of the car park. You can also hire bikes within the estate. To continue your walking in the area head a couple of miles south and you can pick up the Saints Way long distance trail. You can then visit Helman Tor and the Breney Common Nature Reserve where you can enjoy fine views over Bodmin Moor and look out for wildlife including Ponies and the rare Orange Top butterfly. In nearby Bodmin you can pick up the Camel Trail cycling and walking route which will take you along the River Camel on a splendid traffic free path. The Cornish Way cycle route also passes close to the estate.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The parkland and woodland are ideal for dog walking so you will see plenty of other owners on your visit. Please keep them on leads in the parkland when you see livestock grazing there. Only assistance dogs are permitted in the garden though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Lostwithiel Walk starts from the nearby town and visits the house. It's a nice way of visiting the site if you plan to come by public transport as there is a train station in Lostwithiel. The town is well worth exploring with a notable range of antique shops and a fine museum. The route also visits the wonderful viewpoint at Helman Tor and the historic ruins of Restormel Castle just north of the town. The English Heritage run castle is now a photogenic ruin set in beautiful Cornish countryside next to the River Fowey. It's located just south of the estate and makes a fine addition to your outing. Also nearby is the splendid Luxulyan Valley, a designated World Heritage Site. The valley is one of the highlights of the area with nice trails along the River Par, a series of historical industrial remains and the impressive Treffry Viaduct to see. For more walking ideas in the area see the Bodmin Moor Walks and the Cornwall Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/2oTMcb4Rp60",
  "postcode": "PL30 4RA",
  "county": "Cornwall",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}