{
  "created_at": "2025-01-06T01:17:08.492961+00:00",
  "objectID": "12f3f82d7570479a6dce4958f0a8e924",
  "ref": "challacombe-walking-route",
  "title": "Challacombe Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/30/Footbridge_at_Challacombe_-_geograph.org.uk_-_558387.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/12f3f82d7570479a6dce4958f0a8e924.gpx",
  "_geoloc": {
    "lat": 51.1535749925,
    "lng": -3.8699793368
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Footbridge_at_Challacombe_-_geograph.org.uk_-_558387.jpg",
      "title": "Claire Seyler / Footbridge at Challacombe",
      "caption": "Footbridge at Challacombe. This bridge leads to Moles Chamber and Woodbarrow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Challacombe%2C_near_Barton_Gate_-_geograph.org.uk_-_165857.jpg",
      "title": "Martin Bodman / Challacombe: near Barton Gate",
      "caption": "Challacombe, near Barton Gate"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Challacombe_Mill_with_Barton_Town_above_-_geograph.org.uk_-_558379.jpg",
      "title": "Claire Seyler / Challacombe Mill with Barton Town above",
      "caption": "Challacombe Mill with Barton Town above"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Lych_gate%2C_Challacombe_Church_%28geograph_4497919%29.jpg",
      "title": "Basher Eyre / Lych gate, Challacombe Church",
      "caption": "Lych gate, Challacombe Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Challacombe%2C_Challacombe_Mill_site_-_geograph.org.uk_-_58606.jpg",
      "title": "Martin Bodman / Challacombe: Challacombe Mill site",
      "caption": "Challacombe: Challacombe Mill site. The miller\u0092s house survives on the right of the lane and a barn to the left. The mill appears to have been demolished"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Challacombe%2C_Simonsbath_road_at_the_Black_Venus_-_geograph.org.uk_-_58598.jpg",
      "title": "Martin Bodman / Challacombe: Simonsbath road at the Black Venus",
      "caption": "Challacombe: Simonsbath road at the Black Venus. The Black Venus Inn is on the B3358 which links Simonsbath with Blackmoor Gate. The pub was earlier named the Ring of Bells, although it is nowhere near Challacombe church. Here the drayman from St Austell Brewery takes empty kegs back to his lorry. The Black Venus was called that originally because of a sheep in the area that had black wool and was specific to Challacombe. It was named The ring O Bells in the 1950's when new church bells were hung but John Green (The Landlord) changed it to Black Venus in 1965 after he took over the pub."
    }
  ],
  "distance_km": 3.8,
  "description": "This small Devon village sits on the edge of the Exmoor National Park. The peaceful area includes pleasant country trails, an old mill and a noteworthy pub dating back to the 1500s. This circular walk from the village takes you to Barton Town and Challacombe Mill which lies just to the south west. The final section runs along a B road so you may prefer to return along the same footpaths. Head east onto Exmoor and you can pick up the popular Tarka Trail and the Two Moors Way. These waymarked, long distance trails are a great way of further exploring the area. To the west there's Wistlandpound Reservoir where you can enjoy some peaceful waterside trails. Near here is the National Trust's Arlington Court. There's a fascinating old carriage museum and some lovely trails through the gardens and parkland of this 19th century house.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Black Venus Inn is an attractive stone pub dating to the 16th century. There's a car park, good food and a nice garden area to sit out in. They are dog friendly with treats available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east is the village of Simonsbath, a popular starting point for a number of walks on Exmoor. Our circular walk visits the River Barle and the source of the River Exe at Exe Head. Also to the east is Pinkery Pond, a remote beauty spot with a picturesque pond popular with wild swimmers. You'll also find the 487m high Chains Barrow Hill in this area. For more walking ideas in the area see the Exmoor Walks page."
    }
  ],
  "district": "Challacombe",
  "county": "Devon",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}