{
  "created_at": "2025-01-06T01:14:51.369222+00:00",
  "objectID": "132d9dc762e3426de4d38f39ec71d778",
  "ref": "corbridge-walking-route",
  "title": "Walk around Corbridge - River and Fort Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/36/Corbridge_Bridge_-_geograph.org.uk_-_1409768.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/132d9dc762e3426de4d38f39ec71d778.gpx",
  "_geoloc": {
    "lat": 54.9766368011,
    "lng": -2.0306305235
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Corbridge_Bridge_-_geograph.org.uk_-_1409768.jpg",
      "title": "G Laird / Corbridge Bridge",
      "caption": "Corbridge Bridge. Completed with seven arches in 1674, it was the only bridge over the River Tyne to survive the very destructive floods of 1771."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Roman_bridge_at_Corbridge_-_geograph.org.uk_-_1723421.jpg",
      "title": "Oliver Dixon / Roman bridge at Corbridge",
      "caption": "Roman bridge at Corbridge. These massive blocks of dressed stone formed part of the original ramp leading to the Roman bridge at Corbridge (some way upstream from the present bridge). In 2004, they were rescued from the bed of the river and re-erected some distance from the original site."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Main_Street%2C_Corbridge_-_geograph.org.uk_-_1409948.jpg",
      "title": "G Laird / Main Street, Corbridge",
      "caption": "Main Street, Corbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/The_River_Tyne_at_Corbridge_-_geograph.org.uk_-_1589460.jpg",
      "title": "Mike Quinn / The River Tyne at Corbridge",
      "caption": "The River Tyne at Corbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Mouth_of_Devils_Water_as_it_reaches_River_Tyne_-_geograph.org.uk_-_248427.jpg",
      "title": "P Glenwright / Mouth of Devils Water as it reaches River Tyne",
      "caption": "Mouth of Devils Water as it reaches River Tyne. Located near Dilston, home of the jacobite Earl of Derwentwater"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Dilston_Scout_Camp_Site_-_geograph.org.uk_-_361431.jpg",
      "title": "27th Newcastle Scouts / Dilston Scout Camp Site",
      "caption": "Dilston Scout Camp Site. This is a lovely secluded corner."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Dilston_Weir_and_Fish_Ladder_on_Devil%27s_Water_-_geograph.org.uk_-_1721058.jpg/512px-Dilston_Weir_and_Fish_Ladder_on_Devil%27s_Water_-_geograph.org.uk_-_1721058.jpg",
      "title": "John Clive Nicholson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dilston Weir and Fish Ladder on Devil's Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Dilston_Castle.jpg",
      "title": "Peter Brooks, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dilston Castle. A ruined 15th-century tower house and Grade I listed building."
    }
  ],
  "distance_km": 6.5,
  "description": "This Northumberland village is in a lovely spot on the River Tyne, just east of Hexham. It's a fine place for a stroll with a historic Roman Fort and a pleasant riverside trail to try. This walk from the town explores the Roman Fort before heading along the River Tyne and visiting the nearby Dilston Castle. The walk starts from the Roman Fort, just to the west of the village centre and the train station. The fort is one of the historical highlights of the area and well worth exploring. Here you will find information boards detailing the Roman occupation which ran until the 5th century. You can also discover Roman armour and trinkets uncovered with the Corbridge Hoard at the museum. The Hoard was one of the most significant finds in Roman history, providing a fascinating insight into the life of a soldier on the Hadrian's Wall. From the fort you can pick up a riverside path heading east towards the 17th century bridge over the Tyne. Cross to the other side and head west and you will come to the point where the river meets with Devil's Water. Here you'll find a number of pretty waterfalls and a weir. You can pick up a footpath heading south along the water to Dilston where there's a notable old chapel and Dilston Castle. This photogenic 15th century ruin is designated as a Scheduled Ancient Monument. After exploring Dilston the route returns to Corbridge on the same paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village the Black Bull is a good choice for some post walk refreshments. The historic pub dates back to 1755 and includes a cosy interior with a coal fire. Outside there's a pretty garden area for warmer days. They do very good food and can be found at Middle Street with a postcode of NE45 5AT for your sat navs. The Dyvels Inn is another good option if the weather is good. They have a larger garden area and also provide accommodation. You can find them on Station Road at postcode NE45 5AY."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river paths make for a fine dog walk and the Dyvels Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A stroll through the town is also very pleasant with a number of fine little shops. Another must see here is the Church of Saint Andrew which dates back to the 7th century. The Church was built largely from stone taken from Hadrian's Wall. The entrance to the Church is through glass doors given by actor Rowan Atkinson and etched in memory of his mother, a parishioner of the church. The site also includes a 14th century Vicar's Pele, one of only three fortified vicarages in the county. Head north of the village and you will soon come to the famous wall where you can pick up the epic Hadrian's Wall Path. If you follow the waymarked trail west you can visit Chester's Roman Fort, one of the highlights on the wall. Also known as Cilurnum it is considered to be the best preserved Roman cavalry fort along Hadrian's Wall. The site is now preserved by English Heritage an includes a museum, housing finds from the fort and elsewhere along the wall. If you follow the wall east it will take you to Welton and the Whittle Dene Reservoir where there are good wildlife watching opportunities. Also of note is the nearby Aydon Castle. The 13th century castle has delightful grounds with a circular walk along the Cor Burn and the walled orchard. It's located just a mile north east of the village centre. If you follow the river south east it will take you to the neighbouring village of Riding Mill. There's a train station and a 17th century pub here. For more walking ideas in the area see the Northumberland Walks and North Pennines Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/9rPtWd52uus",
  "postcode": "NE45 5NT",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stanegate, Corbridge, Northumberland, North East, England, NE45 5NT, United Kingdom",
  "district": "Corbridge",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "historical"
  ],
  "points_of_interest": [
    "historical sites",
    "waterfalls",
    "ruins"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "loop",
  "activities": [
    "walking"
  ]
}