{
  "created_at": "2025-01-06T02:43:11.383575+00:00",
  "objectID": "1370b2e0b4aed09829da4d4088abcd24",
  "ref": "burnham-market-walking-route",
  "title": "Burnham Market Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Memorial_Cross%2C_Burnham_Market_-_geograph.org.uk_-_805267.jpg",
  "nearby": [
    {
      "description": "Holkham National Nature Reserve",
      "objectID": "8c91c1b2d984a54cc2904bf82168bb95",
      "ref": "holkham-national-nature-reserve-walking-route"
    },
    {
      "description": "Holkham Park",
      "objectID": "37ea007c40230fe734a6dafc8a188749",
      "ref": "holkham-park-walking-and-cycle-route"
    },
    {
      "description": "Wells-Next-the-Sea to Blakeney",
      "objectID": "9b13761cbba0085066edb65843a2ef63",
      "ref": "wells-next-the-sea-to-blakeney-walking-route"
    },
    {
      "description": "Peddars Way and Norfolk Coast Path",
      "objectID": "4e358890f1c641370cd442450ff77e93",
      "ref": "peddars-way-and-norfolk-coast-path-walking-route"
    },
    {
      "description": "Blakeney Point Nature Reserve",
      "objectID": "2522c877fea31a0d119931d386891c5b",
      "ref": "blakeney-point-nature-reserve-walking-route"
    },
    {
      "description": "Cley Marshes Nature Reserve",
      "objectID": "d3f72ebb05b448abfa3e91dec245899f",
      "ref": "cley-marshes-nature-reserve-walking-route"
    },
    {
      "description": "Pensthorpe",
      "objectID": "e970087586aa6306c534de8392af1050",
      "ref": "pensthorpe-walking-route"
    },
    {
      "description": "Brancaster",
      "objectID": "0b12fb971dcbc812b2af6afa15b018af",
      "ref": "brancaster-walking-route"
    },
    {
      "description": "Walsingham Way",
      "objectID": "30e51cb2690e80ea946d3b969e61fdb3",
      "ref": "walsingham-way-walking-route"
    },
    {
      "description": "Burnham Overy Staithe",
      "objectID": "4597f7c8ba4d3601a16f0a2c0ea0b3ed",
      "ref": "burnham-overy-staithe-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1370b2e0b4aed09829da4d4088abcd24.gpx",
  "_geoloc": {
    "lat": 52.9451545072,
    "lng": 0.724759881
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Memorial_Cross%2C_Burnham_Market_-_geograph.org.uk_-_805267.jpg",
      "title": "Katy Walters / Memorial Cross, Burnham Market",
      "caption": "Memorial Cross, Burnham Market. On the expanse of village green/market place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Birthplace_of_Admiral_Lord_Nelson%2C_Burnham_Thorpe_-_geograph.org.uk_-_377940.jpg",
      "title": "Nigel Jones / Birthplace of Admiral Lord Nelson, Burnham Thorpe",
      "caption": "Birthplace of Admiral Lord Nelson, Burnham Thorpe. There is a bronze plaque on the wall near the round mirror which states: The Old Rectory in which the Admiral was born stood twenty yards back from this wall. It was pulled down in 1803."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Church_of_St_Margaret%2C_Burnham_Norton_-_geograph.org.uk_-_803189.jpg",
      "title": "Tim Heaton / Church of St Margaret, Burnham Norton",
      "caption": "Church of St Margaret, Burnham Norton. One of Norfolk's famous 'round tower' churches. This, a Saxon round tower built in the early 11th century, is one of the most complete. The interior is also worth seeing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Cottages_at_Brothercross_Corner_%2C_The_Busts_represent_the_four_seasons_-_geograph.org.uk_-_1327377.jpg",
      "title": "William Howard / Cottages at Brothercross Corner : The Busts represent the four seasons",
      "caption": "Cottages at Brothercross Corner : The Busts represent the four seasons The busts were originally intended by William Kent for a Temple at Holkham Hall never completed: left to right a youthful 'Simon Spring', an old 'Willy Winter', 'Sally Summer'(with roses round her head) and 'Alice Autumn' garlanded with corn - so they're not really in the right order. When first erected here, over 100 years ago, the male figures were above the female ones. They have been like this since the early 1980's."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Burnham_Overy_Staithe_quay_-_geograph.org.uk_-_853589.jpg",
      "title": "Bob Jones / Burnham Overy Staithe quay",
      "caption": "Burnham Overy Staithe quay. This small quay allows leisure sailors to access the water at most states of the tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Wildlife_Water_Scrapes_beside_the_Norfolk_Coast_Path_-_geograph.org.uk_-_427845.jpg",
      "title": "Nigel Stickells / Wildlife Water Scrapes beside the Norfolk Coast Path",
      "caption": "Wildlife Water Scrapes beside the Norfolk Coast Path. These various scrapes are a magnet for the wildlife within the Overy Marshes, part of which includes the Holkham National Nature Reserve. The Norfolk Coast Path continues northwards from this point until it meets the sand dunes where it turns and heads eastwards along Holkham Bay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Famous_sands_of_Holkham_-_geograph.org.uk_-_908877.jpg/256px-Famous_sands_of_Holkham_-_geograph.org.uk_-_908877.jpg",
      "title": "Zorba the Geek / Famous sands of Holkham",
      "caption": "Famous sands of Holkham. These are the very sands graced by Gwyneth Paltrow as the credits rolled on \"Shakespeare in Love\". More pedestrianly, this particular sand pattern is immortalised on the current cover of the OS Landranger map for the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Deer_in_park_at_Holkham_Hall_-_geograph.org.uk_-_105416.jpg",
      "title": "chris cox / Deer in park at Holkham Hall",
      "caption": "Deer in park at Holkham Hall"
    }
  ],
  "distance_km": 18.0,
  "description": "This Norfolk based village is located in a lovely spot near to the coast and the delightful neighbouring village of Burnham Overy Staithe. The village is very picturesque with a village green, traditional shops and two noteworthy old churches. The area also has strong links with Horatio Nelson who was born nearby. His father Edmund was also rector of both village churches in the 1760s and 1770s. This circular walk from the village visits some of the highlights of the area including Burnham Overy Staithe, Holkham Beach Nature Reserve, Holkham Park and Nelson's Birthplace at Burnham Thorpe. The walk starts in Burnham Market and follows country lanes north east to Burnham Overy Town and then up to Burnham Overy Staithe. Here you can pick up the Peddars Way and Norfolk Coast Path and follow it east through the Holkham Nature Reserve to Holkham Meals. It's a lovely stretch of coast with an expansive National Trust beach, sand dunes and lagoons. At Holkham Meals you can pick up Lady Ann's Drive and follow it south into Holkham Park. The large park includes Holkham Hall, woodland, a deer park and a large picturesque lake. After exploring the park the walk heads west to visit Burnham Thorpe. Here you'll find the birthplace of Vice Admiral Horatio Nelson, victor at the Battle of Trafalgar. The house in which Nelson was born was demolished soon after his father's death, though the rectory that replaced it and the church at which his father preached can still be seen. The site of the former rectory is marked by a roadside plaque. After exploring the village the route follows a country lane back into Burnham Market.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Burnham Market head to The Nelson for some post walk refreshments. The building has an interesting history dating back to 1685 when it was originally called ‘The Mermaid’. Horatio Nelson’s father was present when The Mermaid was renamed in tribute as ‘The Admiral Nelson’ in 1805, directly after the Battle of Trafalgar. They have a good menu with a bar area and a restaurant. There's a charming interior with local artwork available for sale. There's also an outdoor area for warmer days.  You can find them on Creake Road with a postcode of PE31 8EN for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The walk is a nice one to do with your dog though you are asked to keep them on leads in Holkham Park. The Nelson pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north of the village you'll find the noteworthy Church of St Margaret, in Burnham Norton. The church is well worth seeing as it includes an 11th century Saxon round-tower. The Grade I listed building also retains an elaborately decorated 15th-century pulpit, considered one of the finest surviving examples of its type. If you continue east along the coast path you can visit the neighbouring town of Wells-Next-the Sea. Here you can try the Wells-Next-the-Sea to Blakeney Walk and visit the wonderful Blakeney Point Nature Reserve. If you head west you can visit Brancaster and the Titchwell Nature Reserve where there are more wildlife watching opportunities. Head south east to Great Walsingham and you could pick up the Walsingham Way. This long distance trail runs from the mediaeval abbey at Great Walsingham to the city of Norwich, passing several fascinating historic sites on the way. The abbey in Walsingham is one of the highlights of the area and well worth a visit. There's some lovely grounds with the snowdrop and bluebell walks particularly popular. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "district": "King's Lynn and West Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Saint Henry's Catholic Church, 87, Market Place, Foundry Field, Burnham Market, King's Lynn and West Norfolk, Norfolk, England, PE31 8HD, United Kingdom",
  "postcode": "PE31 8HD",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "nature reserve",
    "park",
    "beach"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}