{
  "created_at": "2025-01-06T00:21:00.947804+00:00",
  "objectID": "13918039b9340a3fad78abf3fd9f69f9",
  "ref": "milford-haven-walking-route",
  "title": "Milford Haven Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Milford_Haven_Docks.jpg",
  "nearby": [
    {
      "description": "Dale Peninsula",
      "objectID": "9a89167dbb465a389cc2766f31e27937",
      "ref": "dale-peninsula-walking-route"
    },
    {
      "description": "Marloes Sands",
      "objectID": "449250b4e85976afd1d9b1aa89ee837a",
      "ref": "marloes-sands-walking-route"
    },
    {
      "description": "Skomer Island",
      "objectID": "9020a17729884ffc3acc86948c662a7e",
      "ref": "skomer-island-walking-route"
    },
    {
      "description": "Martin's Haven",
      "objectID": "c1fb90b7b1663eb414ecf6d833e6fcbd",
      "ref": "martins-haven-walking-route"
    },
    {
      "description": "Pembrokeshire Coast Path",
      "objectID": "ad6d6081a04362874fc894b50c9a12b7",
      "ref": "pembrokeshire-coast-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13918039b9340a3fad78abf3fd9f69f9.gpx",
  "_geoloc": {
    "lat": 51.7118986825,
    "lng": -5.0322573853
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Milford_Haven_Docks.jpg",
      "title": "Deborah Tilley / This IS Milford Docks, via Wikimedia Commons",
      "caption": "Milford Docks The upmarket marina may be out of camera shot but this is the working side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Gelliswick_Bay_oil_pipeline_and_jetty_-_geograph.org.uk_-_369636.jpg",
      "title": "ceridwen / Gelliswick Bay oil pipeline and jetty, via Wikimedia Commons",
      "caption": "Gelliswick Bay oil pipeline and jetty. One of several oil pipelines comes ashore here at this small working beach just west of Milford Haven. The to-ing and fro-ing of vast oil and liquid gas tankers in the Haven keeps this coastline constantly at risk of pollution incidents of which the most catastrophic was the grounding of Sea Empress in 1996. The resulting environmental damage cost 60 million pounds to clean up."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Jetty_at_Gelliswick_Bay_-_geograph.org.uk_-_1025466.jpg",
      "title": "Robin Lucas / Jetty at Gelliswick Bay, via Wikimedia Commons",
      "caption": "Jetty at Gelliswick Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Sandy_haven_path_view.jpg",
      "title": "User:Alvear24 [Public domain], via Wikimedia Commons",
      "caption": "Sandy haven path view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/The_crab_bridge_Sandy_Haven_Pill_-_geograph.org.uk_-_171164.jpg",
      "title": "nantcoly / The crab bridge Sandy Haven Pill, via Wikimedia Commons",
      "caption": "The crab bridge Sandy Haven Pill. This bridge and stepping stones on the coast path have been used by generations of children to collect crabs. The bridge is only above the tide for around 2 hours either side of low tide."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/St._Ishmael%27s_-_Lindsway_Bay_-_geograph.org.uk_-_143395.jpg",
      "title": "Dara Jasumani / St. Ishmael's - Lindsway Bay, via Wikimedia Commons",
      "caption": "St. Ishmael's - Lindsway Bay. Beautiful beach. Taken looking west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Cliffs_at_Musselwick_-_geograph.org.uk_-_1532012.jpg",
      "title": "David Smith / Cliffs at Musselwick, via Wikimedia Commons",
      "caption": "Cliffs at Musselwick. In the far distance is Tower Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Raggle_Rocks_at_Marloes_Sands_-_geograph.org.uk_-_537289.jpg",
      "title": "Chris Gunns / Raggle Rocks at Marloes Sands, via Wikimedia Commons",
      "caption": "Raggle Rocks at Marloes Sands"
    }
  ],
  "distance_km": 21.0,
  "description": "The town of Milford Haven is in an ideal location for exploring the wonderful Pembrokeshire Coast. This walk heads west along the coast path to visit the Dale Peninsula and Marloes Sands. The route runs for 13 miles but at the end you can catch a bus back to Milford Haven from Marloes village. The route starts on the front in Limford Haven, close to the train station. From here you head west past the docks to Hakin and Gelliswick Bay. Here you can see several oil pipelines which come ashore at this small working beach just west of Milford Haven. The route continues to the pretty Sandy Haven where you will find stepping stones and a crab bridge where people can collect crabs. It also provides a low tide route for crossing the estuary at low tide. There's a nice cliff-backed rocky beach here with lots of little rock pools to explore. The next stage takes you on to Lindsway Bay, near St Ishmael's, before coming to the cliffs at Musselwick Point. Shortly after you arrive at the pretty village of Dale. Here you can take a short detour to visit Dale Fort on the Dale Peninsula. The fort is a Victorian era fort located on a rocky promontory that now houses a field studies centre, for study of local marine biology, biology, geology, geomorphology, and other related fields. This route continues west to Marloes Sands. Here you'll find lots of interesting rock formations. A feature of the beach are the Three Chimneys, three vertical lines of hard silurian sandstone and mudstone. There's also lots of interesting wildlife with Welsh Mountain ponies, various sea birds and seal pups to look out for. After passing the sands the route heads north to the village of Marloes where you can enjoy refreshments at the cafe before catching the bus back. To extend the walk you can continue west to visit Martin's Haven. Here you can catch a boat to Skomer Island where you can look out for a huge variety of wildlife including Puffins, Manx Shearwaters, Dolphins, Harbour Porpoises, Razorbills, Gannets and Fulmars. Heading east along the Pembrokeshire Coast Path will take you to Neyland and Pembroke.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the opposite side of the river there's a major local historic highlight at Pembroke Castle. The medieval castle dates to the 12th century and is Grade I listed. You can stroll around the pleasant castle grounds and enjoy some fine views of the millpond and the River Pembroke in the attractive town."
    }
  ],
  "postcode": "SA73 3JA",
  "district": "Milford Haven",
  "county": "Pembrokeshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Hamilton Terrace, Hakin, Milford Haven, Pembrokeshire, Cymru / Wales, SA73 3JA, United Kingdom",
  "state": "Cymru / Wales"
}