{
  "created_at": "2025-01-06T08:13:08.270549+00:00",
  "objectID": "13b7dffbffa85409b9dca90d0c28ffad",
  "ref": "isle-of-portland-walking-route",
  "title": "Isle of Portland and Portland Bill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Portland_Bill_from_the_Pulpit_%283139378620%29.jpg/512px-Portland_Bill_from_the_Pulpit_%283139378620%29.jpg",
  "nearby": [
    {
      "description": "Chesil Beach",
      "objectID": "10ea707afab28ce67f098301c9ba89b9",
      "ref": "chesil-beach-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Weymouth Circular Walk",
      "objectID": "87b0bc795e2227db49a86db0e9a2b880",
      "ref": "weymouth-circular-walk-walking-route"
    },
    {
      "description": "Weymouth to Durdle Door",
      "objectID": "a4b85fae1957376cbe109f83c525270e",
      "ref": "weymouth-to-durdle-door-walking-route"
    },
    {
      "description": "Weymouth",
      "objectID": "3418f5ad1bbd31e3fcc2897926ffd74b",
      "ref": "weymouth-walking-route"
    },
    {
      "description": "Portland Quarry",
      "objectID": "6429338157aaa69761358c5169be240a",
      "ref": "portland-quarry-walking-route"
    },
    {
      "description": "Radipole Lake",
      "objectID": "df6082a9e0a98c639ffcd5542d18b635",
      "ref": "radipole-lake-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13b7dffbffa85409b9dca90d0c28ffad.gpx",
  "_geoloc": {
    "lat": 50.5572287619,
    "lng": -2.4380543352
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Portland_Bill_from_the_Pulpit_%283139378620%29.jpg/512px-Portland_Bill_from_the_Pulpit_%283139378620%29.jpg",
      "title": "Jim Champion from Southampton, UK, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lighthouse on the left, obelisk on the right. The ledges on the shore are of Portland Cherty Series. Most of the overlying Portland Freestone was quarried away in the nineteenth century when this was the Bill Quarry. Some of the stone was used in the construction of the lighthouse tower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/West_Weares%2C_Isle_of_Portland_-_geograph.org.uk_-_944855.jpg",
      "title": "A-M-Jervis / West Weares, Isle of Portland, via Wikimedia Commons",
      "caption": "West Weares, Isle of Portland. The embankment in the middle left of the picture once carried a tramway from Trades Quarry. At the pile of stone blocks at the end waste stone was simply tipped over the cliff edge. The coastal footpath round the Isle passes between the embankment and the tipping point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/West_coast_of_the_Isle_of_Portland_-_geograph.org.uk_-_1029515.jpg",
      "title": "Jim Champion / West coast of the Isle of Portland, via Wikimedia Commons",
      "caption": "West coast of the Isle of Portland. The cliffs in the distance are on the south-west side of the Blacknor headland. The exposed cliffs are of Portland Sand, topped with Portland Stone. Below the cliffs are landslides where stone collapses over Kimmeridge clay. Chesil Beach and the hills above Weymouth are visible in the far distance (on the left of the photo). This view is from the coast path close to the Old Higher Lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Priory_Corner%2C_Isle_of_Portland_-_geograph.org.uk_-_942666.jpg",
      "title": "A-M-Jervis / Priory Corner, Isle of Portland, via Wikimedia Commons",
      "caption": "Priory Corner, Isle of Portland. From approximately where the bus is, New Road was diverted away from the cliff edge in 1996; there is a near-hairpin bend just out of shot to the right. At this point Portland stone brought out of the quarries in the north-west part of the Isle were transferred to the Merchants Tramway for onward passage to Castletown and shipment. The crane in the foreground was erected in 1997 to commemorate this exchange point. The tramway contoured along the hillside from the top of the buff path to the right of the road and is the lower step (immediately above the crane jib) across the Verne hill in the distance. At the white houses it descended a rope-worked incline to the harbour. The upper step below the summit marks the course of a dry vertical-walled \"moat\" around the prison inside the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Obelisk_and_boat%2C_Portland_Bill_-_geograph.org.uk_-_1092950.jpg",
      "title": "Jim Champion / Obelisk and boat, Portland Bill",
      "caption": "Obelisk and boat, Portland Bill. On the left is a seven metre tall white stone obelisk which was built in 1844 at the southern tip of Portland Bill as a warning of a low shelf of rock extending 30 metres south into the sea. The obelisk was saved from threatened demolition in 2002. Just offshore a small yacht rounds the headland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Disused_coastal_quarry%2C_Portland_Bill_-_geograph.org.uk_-_1032802.jpg",
      "title": "Jim Champion / Disused coastal quarry, Portland Bill",
      "caption": "Disused coastal quarry, Portland Bill. On the left the smooth worked face of Portland Freestone is visible. To the right of the trench the worked stone has been piled up. One pile stands tall, while the pile to the right has toppled. Above the Portland stone are the basal Purbeck limestones and dirt beds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Cave_Hole_-_geograph.org.uk_-_1098571.jpg",
      "title": "Jim Champion / Cave Hole",
      "caption": "Cave Hole. This crater is the top of Cave Hole - appropriately enough a hole above a cave. The cave below has retreated back from the cliff face and at the top of the cave some of the overlying stone has collapsed. The soil and debris of the raised beach has funnelled down into the cave, leaving this pit. The hole itself has had horizontal iron bars set into it to prevent the unwary or foolish from dropping down to their doom."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Cliffs_at_the_north_end_of_White_Hole_-_geograph.org.uk_-_1099825.jpg",
      "title": "Jim Champion / Cliffs at the north end of White Hole",
      "caption": "Cliffs at the north end of White Hole. White Hole is a shallow embayment to the north of Pulpit Rock on the west side of the Bill of Portland. The fenced-off military area sits on top of raised beach deposits from the end of the last ice age. The geological succession can be seen in these cliffs :the reddish undercut Portland Cherty Series close to sea level, then the light grey Portland Freestone, then the thin-bedded limestones of the Basal Purbeck Caps."
    }
  ],
  "distance_km": 13.0,
  "description": "Follow the Portland Coast Path around the Isle of Portland on this wonderful coastal circular walk in Dorset. There's spectacular cliffs, wide ranging views and lots of seabirds to look out for on this exhilarating walk. The walk starts near the village of Fortuneswell at the northern end of the Isle. You'll start by passing the King Barrow Quarry Nature Reserve which is well know for its wildflowers, blue butterflies and bird species. The path then takes you to the coast at West Cliff where there are lovely views over West Bay. You head south along the coast to Weston and Portland Bill Lighthouse at the southern tip of the Isle of Portland. Here you can enter the lighthouse and climb to the top for some truly wonderful views. This is probably the most expansive view along the south coast with Durlston Head and Start Point in Devon visible on a clear day. The return leg takes you along the eastern side of the Isle, passing Southwell, Easton and the Broadcroft Quarry Butterfly Reserve. Other highlights include Durdle Pier, a disused 17th-century stone shipping quay. Look out for wildlife including peregrines, guillemots, fulmars and kittiwakes. To extend your walking in the area you can visit the wonderful Chesil Beach .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the southern end of the island you could enjoy some refreshments at The Lobster Pot. The restaurant is located in a wonderful spot on the coast, next to the famous Portland Bill lighthouse. They are well known for their delicious Dorset Cream Teas, fine Sunday Roasts and crab sanwiches. There's lots of outdoor seating with wonderful views out to sea. You can find them at postcode DT5 2JT for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the north western side of the island near the start of the walk you will pass Portland Quarry. This area includes the Tout Quarry Sculpture Park, a popular attraction on the island. The site includes many interesting sculptures by artist's such as Anthony Gormley. There's also a nature reserve with lots of interesting wildflowers and butterflies. Just to the north you can pick up the Weymouth Circular Walk and visit the promenade, the ruins of Sandsfoot Castle and the pretty Radipole Lake Nature Reserve."
    }
  ],
  "video_url": "https://www.youtube.com/embed/76PFryB46jY",
  "district": "Fortuneswell",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "New Ground, Portland, Fortuneswell, Dorset, England, DT5 1LL, United Kingdom",
  "postcode": "DT5 1LL",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "wildflower areas",
    "bird watching",
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}