{
  "created_at": "2025-01-06T00:57:01.213827+00:00",
  "objectID": "13b74d007ec0b740835d202be7380a77",
  "ref": "santon-downham-walking-route",
  "title": "Santon Downham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1c/The_Little_Ouse_at_Santon_Downham_-_geograph.org.uk_-_306816.jpg",
  "nearby": [
    {
      "description": "Thetford Forest",
      "objectID": "c754503315c7047bb884243a9b4b3ec5",
      "ref": "thetford-forest-walking-and-cycle-route"
    },
    {
      "description": "Little Ouse Path",
      "objectID": "2c313ceb6bcc1fd8b8dfbbf05e0e5b08",
      "ref": "little-ouse-path-walking-route"
    },
    {
      "description": "Hereward Way",
      "objectID": "eb70237db71b27b0ed597128a0456162",
      "ref": "hereward-way-walking-route"
    },
    {
      "description": "Thetford River Walk",
      "objectID": "4b824524faf9d51bdcb619d3a8941bf8",
      "ref": "thetford-river-walk-walking-route"
    },
    {
      "description": "Brandon Country Park",
      "objectID": "ce9580ffc900fd36a3cca16ed209c29d",
      "ref": "brandon-country-park-walking-and-cycle-route"
    },
    {
      "description": "St Edmund Way",
      "objectID": "40befcc98f0036085f815e38b0a9bdec",
      "ref": "st-edmund-way-walking-route"
    },
    {
      "description": "Grimes Graves",
      "objectID": "b1fdfdc4036b8e7eaff91c7987adff8f",
      "ref": "grimes-graves-walking-route"
    },
    {
      "description": "Lynford Arboretum",
      "objectID": "3f269227c668742c2a398f507301b752",
      "ref": "lynford-arboretum-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13b74d007ec0b740835d202be7380a77.gpx",
  "_geoloc": {
    "lat": 52.4566878031,
    "lng": 0.6709813041
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/The_Little_Ouse_at_Santon_Downham_-_geograph.org.uk_-_306816.jpg",
      "title": "Alan Kent / The Little Ouse at Santon Downham",
      "caption": "The Little Ouse at Santon Downham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Santon_Downham_-_geograph.org.uk_-_795604.jpg",
      "title": "Stephen McKay / Santon Downham",
      "caption": "Santon Downham - Forestry Commission sign and offices. Looking along the road towards Thetford, at its junction with the minor road that leads across the Little Ouse River into Norfolk and Santon Warren. This village is in the heart of Thetford Forest; the Forestry Commission is an institution of major importance in the district."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Santon_Downham_Church_-_geograph.org.uk_-_795638.jpg",
      "title": "Stephen McKay / Santon Downham Church",
      "caption": "Santon Downham Church. Dedicated to St Mary the Virgin, parts of this church date back to the 12th century, although the tower was built in the 15th century. There is a brick high up on the north side of the tower which is said to mark the height reached by sand during the great sandstorm of 1668."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/The_bridge_at_Santon_Downham%2C_nr_Thetford%2C_Norfolk_-_geograph.org.uk_-_40509.jpg",
      "title": "Ron Strutt / The bridge at Santon Downham, nr Thetford, Norfolk",
      "caption": "The bridge at Santon Downham. The bridge at may seem familiar to viewers of the Dad's Army TV series. It featured in an episode when the platoon, dressed in firemen's uniforms, crossed the bridge on board a vintage fire engine. Most of the location scenes were shot in Norfolk, and in the Thetford area in particular."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Little_Ouse_path_at_Brandon_-_geograph.org.uk_-_1025848.jpg",
      "title": "Bob Jones / Little Ouse path at Brandon",
      "caption": "Little Ouse path at Brandon. The waymarked path follows the north bank of the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/River_Little_Ouse_-_geograph.org.uk_-_104740.jpg",
      "title": "dave bloom / River Little Ouse",
      "caption": "River Little Ouse. Taken from a footbridge over The River Little Ouse between Santon Downham & Two Mile Bottom on a beautiful autumn day."
    }
  ],
  "distance_km": 8.7,
  "description": "This little village is located in a lovely spot in Thetford Forest next to the River Little Ouse. It's a very pretty area with a 12th century church, quaint cottages and some Forestry Commission offices based here. This circular walk takes you along a section of the Little Ouse Path to nearby Brandon in Thetford Forest. It then returns using part of the waymarked Hereward Way. The walk starts in the public car park in the village. From here it is a short stroll north to the river where you can pick up the waterside path. Follow it west and it will take you to Brandon where you cross the river to link up with the Herward Way. The path runs along the outskirts of Brandon before re-entering the forest where you can follow woodland paths back to Santon Downham.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking around Santon Downham head east along the Little Ouse Path to visit the town of Thetford on the Thetford River Walk. Here you can visit the fascinating ruins of the historic Thetford Priory. Along the way you'll pass the St Helen's Picnic Site. The site is located in a lovely spot next to the river. There's free parking and a number of good walking trails branching off from the car park. Snowdrops can also be seen at in the early spring in the woodland opposite the village shop. In Brandon there's the lovely Brandon Country Park to explore. Here you'll find lakeside lawns, a delightful walled garden and an excellent visitor centre. A few miles north of the park there's the splendid Lynford Arboretum. It's another lovely place for a walk with woodland trails, pretty lakes and an impressive 19th century Sequoia Avenue to see. Just to the north of the village you can pick up the Grime's Graves and Weeting Castle Walk. This route visits two interesting English Heritage run historical sites in the area. The first is a prehistoric flint mine dug over 5000 years ago where you can descend on a ladder to view the fascinating pit. The route then visits nearby Weeting Castle where you'll find the ruins of a 12th century manor house. Both sites are well run with information boards detailing the history of the area. The long distance St Edmund Way also passes the village, providing and opportunity for further exploring the surrounding area on a waymarked footpath. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/scor4cb37Nc",
  "postcode": "IP27 0TQ",
  "district": "West Suffolk",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Santon Downham, West Suffolk, Suffolk, England, IP27 0TQ, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "forest"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}