{
  "created_at": "2025-01-05T23:24:32.794615+00:00",
  "objectID": "13baca9cfcce8f494dc698c77578e4f4",
  "ref": "enfield-walking-route",
  "title": "Enfield Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Enfield_Town_Park_looking_East_-_geograph.org.uk_-_667489.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13baca9cfcce8f494dc698c77578e4f4.gpx",
  "_geoloc": {
    "lat": 51.6486343944,
    "lng": -0.0883873214
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Enfield_Town_Park_looking_East_-_geograph.org.uk_-_667489.jpg",
      "title": "Christine Matthews / Enfield Town Park looking East",
      "caption": "Enfield Town Park. Looking East The Tower Point complex can be seen in the distance on the left hand side. This image was taken on the day of the annual firework display in 2006 and the fireworks are in the foreground in the process of being set up for the display that evening."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Enfield_Town_Park_in_Autumn%2C_Enfield_-_geograph.org.uk_-_345696.jpg",
      "title": "Christine Matthews / Enfield Town Park in Autumn, Enfield",
      "caption": "Enfield Town Park in Autumn looking towards the New River Loop, with the low sun casting shadows on the grass."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Hilly_Fields_Park%2C_Clay_Hill_-_geograph.org.uk_-_9541.jpg",
      "title": "Stephen Dawson / Hilly Fields Park, Clay Hill",
      "caption": "Hilly Fields Park, Clay Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Lake_in_Whitewebbs_Park_-_geograph.org.uk_-_47682.jpg",
      "title": "Christine Matthews / Lake in Whitewebbs Park",
      "caption": "Lake in Whitewebbs Park. The lake in Whitewebbs Park is home to many wildfowl."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Whitewebbs_House%2C_Enfield_-_geograph.org.uk_-_1260603.jpg",
      "title": "Christine Matthews / Whitewebbs House, Enfield",
      "caption": "Whitewebbs House, as seen from the garden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Forty_Hall_Lake_-_geograph.org.uk_-_479914.jpg",
      "title": "John Salmon / Forty Hall Lake",
      "caption": "Forty Hall Lake. There's also some fine specimen trees and wonderful rhododendrons to see in the garden here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Forty_Hall_-_geograph.org.uk_-_9837.jpg",
      "title": "Stephen Dawson / Forty Hall",
      "caption": "Forty Hall. Forty Hall was built from 1629 for Sir Nicholas Rainton, a prominent member of the corporation of the City of London. It is now owned by the London Borough of Enfield, and its grounds make a popular open space."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Enfield_Town_centre%2C_Enfield_-_geograph.org.uk_-_1076300.jpg",
      "title": "Christine Matthews / Enfield Town centre, Enfield",
      "caption": "Enfield Town centre"
    }
  ],
  "distance_km": 12.6,
  "description": "This North London based market town has some nice local parks, several waymarked trails, a historic local hall and waterside trails along the New River which runs past the town. This circular walk from the town visits some of the local walking highlights including Enfield Town Park, Whitewebbs Park, Forty Hall and the New River Path. There's a nice mix of woodland, parkland, gardens and waterside paths to enjoy on the route. It also uses some of the long distance waymarked footpaths that run through the area. The walk starts in the Enfield Town Park, located just south of the town centre and east of the train station. In the park you can follow a trail north along the New River before passing through the town centre to emerge at Hilly Fields and Clay Hill. Here you can pick up a section of the London Loop and follow it north east to Whitewebbs Park, crossing the Cuffley Brook on the way. There's some nice woodland trails in the park, an ornamental pond and some picturesque small lakes. The route then heads south east to pick up the London Loop again and follow it along the Turkey Brook towards Forty Hall. Here you'll find a fine Grade 1 Listed Jacobean Manor House, surrounded by beautiful gardens and a lake. After exploring the hall it's a short walk north east to join with the New River. The man made river has a nice walking trail running south back towards Enfield town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town The Cricketers is a good choice for post walk refreshments. There's good food and a nice garden area if the weather is fine. It's located near the river at Chase Side Place with a postcode of EN2 6QA for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the town you'll find Trent Country Park. There's 413 acres of rolling meadows, brooks, lakes and ancient woodland to explore on foot or by bike here. To the east you can pick up the Lea Valley Walk and enjoy more waterside walking along the Walthamstow Reservoirs. You can also pick up the Pymmes Brook Trail near here and enjoy an easy stroll along the pretty brook to Monken Hadley Common in Hadley Wood. There's a network of good trails on the common with fine views from the high points and some pretty lakes. For more walking ideas in the area see the London Walks page."
    }
  ],
  "postcode": "EN2 6HF",
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Carrs Lane, London Borough of Enfield, London, Greater London, England, EN2 6HF, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "parkland",
    "gardens",
    "waterside"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "long distance footpaths"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}