{
  "created_at": "2025-01-06T04:26:34.113750+00:00",
  "objectID": "13c6b54ede9b6cf873a733cf0241e81c",
  "ref": "durham-riverside-walk-walking-route",
  "title": "Durham Riverside Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Durham_Castle_-_panoramio_-_PJMarriott_%28cropped_2%29.jpg/512px-Durham_Castle_-_panoramio_-_PJMarriott_%28cropped_2%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13c6b54ede9b6cf873a733cf0241e81c.gpx",
  "_geoloc": {
    "lat": 54.7758700327,
    "lng": -1.577434099
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Durham_Castle_-_panoramio_-_PJMarriott_%28cropped_2%29.jpg/512px-Durham_Castle_-_panoramio_-_PJMarriott_%28cropped_2%29.jpg",
      "title": "PJMarriott [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Durham Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Cathedral_towers_-_geograph.org.uk_-_228813.jpg/256px-Cathedral_towers_-_geograph.org.uk_-_228813.jpg",
      "title": "John Illingworth [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Cathedral towers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Stone_Seat_Near_Prebends_Bridge_-_geograph.org.uk_-_987471.jpg",
      "title": "Mick Garratt [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stone Seat Near Prebends Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Folly_on_the_North_Bank_of_the_Wear_-_geograph.org.uk_-_987465.jpg",
      "title": "Mick Garratt [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Folly on the North Bank of the Wear"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Shincliffe_Bridge%2CRiver_Wear_-_geograph.org.uk_-_1718018.jpg",
      "title": "brian clark [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Shincliffe Bridge,River Wear"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Landing_stage_on_the_River_Wear%2C_Durham_-_geograph.org.uk_-_1317138.jpg",
      "title": "Dylan Moore / Landing stage on the River Wear, Durham, via Wikimedia Commons",
      "caption": "Landing stage on the River Wear, Durham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Maiden_Castle_Bridge_-_geograph.org.uk_-_408016.jpg",
      "title": "Jim Barton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Maiden Castle Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Heron_in_Durham_Botanic_Gardens.jpg",
      "title": "Ken Walton [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Heron in Durham Botanic Gardens"
    }
  ],
  "distance_km": 13.2,
  "description": "This splendid walk around Durham visits many of the city highlights including the River Wear, Durham Castle, the cathedral, Old Durham Gardens and the Durham Botanical Gardens. There's so much to see with wonderful architecture, historical sites, beautiful gardens and countryside views across the river. The walk starts next to Durham Castle on the east bank of the River Wear. The Norman castle stands on top of a hill above the river on Durham's peninsula, opposite Durham Cathedral. It was originally built in the 11th century as a projection of the Norman kings' power in the north of England. It is now owned by the University College but the public can view the castle's wonderful architecture through guided tours. The castle is part of a UNESCO World Heritage Site with the nearby Durham Cathedral. It dates from the 11th century and includes fine Romanesque and Norman architecture. You can climb the 217ft (66m) high central tower for fantastic views over the city and surrounding area. After exploring the castle and cathedral rejoin the riverside path and head south past the stone-arched Prebends Bridge. The path rounds the peninsula, passing close to several historic sites including university buildings, Durham Market Square, the Grade I listed Kingsgate Bridge and the mediaeval Elvet Bridge. The trail then heads east, passing Pelaw Wood before leaving the river to visit Old Durham Gardens. The delightful gardens are on two levels and include orchards, a walled garden and a gazebo. After exploring the gardens you return to the waterside path and continue to Shincliffe Bridge, where you cross the river and follow the Houghall Discovery trail through the woods to the Durham University Botanic Garden. Here you'll find exotic plants from all over the world including many from the far east. There's also glasshouses, an arboretum, an Alpine garden and a bamboo grove. After strolling round the gardens you return to the riverside path and head back to the city centre along the Wear. Much of this walk uses the Weardale Way long distance trail. You can extend your walking in the area by following the trail south towards Willington, while heading north will take you to Chester-le-Street. There's also several nice trails to pick up just to the west of the city centre. The Brandon - Bishop Auckland Walk, the Lanchester Valley Walk and the Deerness Valley Way all follow disused railway lines through the countryside surrounding the city.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a short distance south of the city and you could visit the historic village of Shincliffe and pick up the circular Shincliffe Walk. The route visits Shincliffe Wood and the River Wear before heading to Croxdale Wood, Croxdale Hall and Sunderland bridge. Near here there's also Houghall Woods where there's lots of pretty bluebells in the spring months. Just to the north you'll find Waldridge Fell Country Park where you can look out for Roe Deer in the lowland heath and woods. If you follow the Weardale Way north for a few miles you could visit one of the area's historic highlights at Finchale Abbey. Here you can explore the photogenic ruins of the ancient abbey which dates back to the 13th century. The Grade I listed priory site is run by English Heritage and includes woodland and riverside walks. For more walking ideas in the area see the County Durham Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CoTqk3hG234",
  "postcode": "DH1 3RB",
  "district": "Durham",
  "county": "County Durham",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}