{
  "objectID": "13d03ba2a382835586969212e96eaf0f",
  "created_at": "2024-12-18T16:41:25.577515+00:00",
  "ref": "shaldon-walking-route",
  "title": "Shaldon Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Shaldon%2C_the_Ness_Inn_-_geograph.org.uk_-_1469556.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/AB9E1118BB97AFED862587600051F827/$FILE/Shaldon.gpx",
  "_geoloc": {
    "lat": 50.5421776705,
    "lng": -3.5092616664
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Shaldon%2C_the_Ness_Inn_-_geograph.org.uk_-_1469556.jpg",
      "title": "Chris Downer / Shaldon: the Ness Inn",
      "caption": "Shaldon, the Ness Inn, with a fine view over the water to the town of Teignmouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Ness_Beach_-_geograph.org.uk_-_309548.jpg",
      "title": "Tony Atkin / Ness Beach",
      "caption": "Ness Beach. Taken from the Coast Path above Bundle Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Overlooking_Labrador_Bay_-_geograph.org.uk_-_2413044.jpg",
      "title": "Overlooking Labrador Bay by Alex McGregor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Overlooking Labrador Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Field_by_Butterfly_Lane_-_geograph.org.uk_-_784941.jpg",
      "title": "Derek Harper / Field by Butterfly Lane",
      "caption": "Field by Butterfly Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Teignharvey_Road_-_geograph.org.uk_-_786111.jpg",
      "title": "Derek Harper / Teignharvey Road",
      "caption": "Teignharvey Road. Teignharvey Road is a green lane between Teignharvey and Stokeinteignhead, following the western slopes of the Arch Brook valley, probably usable by all traffic a few decades ago. Here it approaches a side combe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Shaldon_-_geograph.org.uk_-_433548.jpg",
      "title": "Derek Harper / Shaldon",
      "caption": "Shaldon. Facing the boats drawn up on the Salty is a row of terraced houses, the blue part being Dolphin Court, a former hotel. On the extreme right is the east end of St Peter's church (1893-1902)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/The_Salty%2C_Shaldon_-_geograph.org.uk_-_218839.jpg",
      "title": "Stephen McKay / The Salty, Shaldon",
      "caption": "The Salty, Shaldon. The Salty is the name given to this area of sand and mud in the Teign Estuary, which is exposed at low tide leaving a varied selection of craft high and dry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/The_Embankment%2C_Shaldon_-_geograph.org.uk_-_433530.jpg",
      "title": "Derek Harper / The Embankment, Shaldon",
      "caption": "The Embankment, Shaldon. The western end of the attractive new houses which overlook the Teign estuary, seen from the Teignmouth and Shaldon bridge."
    }
  ],
  "distance_km": 9.1,
  "description": "This pretty South Devon village is in a lovely location on the River Teign Estuary. There's some great riverside trails, coastal paths and the splendid Botanical Gardens to explore in the village. There's also a fine riverside pub to relax in after your exercise. This circular walk takes you along the South West Coast Path to the lovely Labrador Bay Nature Reserve before heading through the countryside to pick up the River Teign Walk . The walk starts next to the Teignmouth and Shaldon Bridge which crosses the River Teign estuary on the northern side of the village. Here you can pick up the Templer Way and follow it east along the river to meet with the coast path at The Ness. On the way you'll pass close to the Botanical Gardens which are well worth a small detour. Here you'll find a castle folly, pond, rill garden and an Italianate Garden. From the elevated position of the gardens there's also wonderful views across the river, Lyme Bay and the East Devon and Dorset coastline. You can find them at Torquay Rd, TQ14 0BH. Follow the coast path south and it will take you along the lovely Ness Beach and Bundle Head to Labrador Bay. This area is a nature reserve with wonderful coastal views to enjoy from the high points. Look out for wildlife including cirl buntings and dolphins in this area. The route then heads west along Butterfly Lane to Forches Hill before turning north along Teignharvey Road. This country lane will take you toward the river where you can pick up the River Teign Walk. Follow it east past Gravel Point and it will take you back into Shaldon.",
  "video_url": "https://www.youtube.com/embed/H1GvO4s5nag",
  "postcode": "TQ14 0DB",
  "district": "Shaldon",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}