{
  "created_at": "2025-01-06T02:30:08.389508+00:00",
  "objectID": "13d03ba2a382835586969212e96eaf0f",
  "ref": "shaldon-walking-route",
  "title": "Shaldon Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Shaldon%2C_the_Ness_Inn_-_geograph.org.uk_-_1469556.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13d03ba2a382835586969212e96eaf0f.gpx",
  "_geoloc": {
    "lat": 50.5421776705,
    "lng": -3.5092616664
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Shaldon%2C_the_Ness_Inn_-_geograph.org.uk_-_1469556.jpg",
      "title": "Chris Downer / Shaldon: the Ness Inn",
      "caption": "Shaldon, the Ness Inn, with a fine view over the water to the town of Teignmouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Ness_Beach_-_geograph.org.uk_-_309548.jpg",
      "title": "Tony Atkin / Ness Beach",
      "caption": "Ness Beach. Taken from the Coast Path above Bundle Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Overlooking_Labrador_Bay_-_geograph.org.uk_-_2413044.jpg",
      "title": "Overlooking Labrador Bay by Alex McGregor, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Overlooking Labrador Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Field_by_Butterfly_Lane_-_geograph.org.uk_-_784941.jpg",
      "title": "Derek Harper / Field by Butterfly Lane",
      "caption": "Field by Butterfly Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Teignharvey_Road_-_geograph.org.uk_-_786111.jpg",
      "title": "Derek Harper / Teignharvey Road",
      "caption": "Teignharvey Road. Teignharvey Road is a green lane between Teignharvey and Stokeinteignhead, following the western slopes of the Arch Brook valley, probably usable by all traffic a few decades ago. Here it approaches a side combe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Shaldon_-_geograph.org.uk_-_433548.jpg",
      "title": "Derek Harper / Shaldon",
      "caption": "Shaldon. Facing the boats drawn up on the Salty is a row of terraced houses, the blue part being Dolphin Court, a former hotel. On the extreme right is the east end of St Peter's church (1893-1902)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/The_Salty%2C_Shaldon_-_geograph.org.uk_-_218839.jpg",
      "title": "Stephen McKay / The Salty, Shaldon",
      "caption": "The Salty, Shaldon. The Salty is the name given to this area of sand and mud in the Teign Estuary, which is exposed at low tide leaving a varied selection of craft high and dry."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/The_Embankment%2C_Shaldon_-_geograph.org.uk_-_433530.jpg",
      "title": "Derek Harper / The Embankment, Shaldon",
      "caption": "The Embankment, Shaldon. The western end of the attractive new houses which overlook the Teign estuary, seen from the Teignmouth and Shaldon bridge."
    }
  ],
  "distance_km": 9.1,
  "description": "This pretty South Devon village is in a lovely location on the River Teign Estuary. There's some great riverside trails, coastal paths and the splendid Botanical Gardens to explore in the village. There's also a fine riverside pub to relax in after your exercise. This circular walk takes you along the South West Coast Path to the lovely Labrador Bay Nature Reserve before heading through the countryside to pick up the River Teign Walk. The walk starts next to the Teignmouth and Shaldon Bridge which crosses the River Teign estuary on the northern side of the village. Here you can pick up the Templer Way and follow it east along the river to meet with the coast path at The Ness. On the way you'll pass close to the Botanical Gardens which are well worth a small detour. Here you'll find a castle folly, pond, rill garden and an Italianate Garden. From the elevated position of the gardens there's also wonderful views across the river, Lyme Bay and the East Devon and Dorset coastline. You can find them at Torquay Rd, TQ14 0BH. Follow the coast path south and it will take you along the lovely Ness Beach and Bundle Head to Labrador Bay. This area is a nature reserve with wonderful coastal views to enjoy from the high points. Look out for wildlife including cirl buntings and dolphins in this area. The route then heads west along Butterfly Lane to Forches Hill before turning north along Teignharvey Road. This country lane will take you toward the river where you can pick up the River Teign Walk. Follow it east past Gravel Point and it will take you back into Shaldon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Ness House is a fine place for some post walk refreshments. The inn is in a splendid position overlooking the Teign Estuary. It also has an interesting history having originally been built in 1810 as the summer home of the Clifford family. Rumour has it that the family subsequently enlarged their fortune through smuggling (via the smugglers tunnel which you can find just behind the Ness). Inside there's a splendid interior with a roaring fire. Outside there's a beautiful terrace and garden with lovely views. You can find them on Ness Drive with a postcode of TQ14 0HP for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The coast and country paths are great for dog walking. The Ness House mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south towards Torquay and you'll find the peaceful Brunel Woods on the northern outskirts of the town. The site is named after Isambard Kingdom Brunel who loved the area and intended to set up home at Watcombe Park before he died. The John Musgrave Heritage Trail can be picked up in this area too. The waymarked trail runs from Maidencombe to Brixham, visiting several of South Devon's interesting historical sites on the way. Head west from Teignmouth and you could pay a visit to the interesting village of Bishopsteignton. There's a ruined 14th century chapel, a small museum, a 16th century pub and fine views over the estuary in this historic settlement. For more walking ideas in the area see the Devon Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/H1GvO4s5nag",
  "postcode": "TQ14 0DA",
  "district": "Teignbridge",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Albion Street, Shaldon, Teignbridge, Devon, England, TQ14 0DA, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "nature reserve",
    "gardens",
    "views"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}