{
  "created_at": "2025-01-06T04:37:41.052904+00:00",
  "objectID": "13e450f106c81769da1e23452fdb96c5",
  "ref": "ouse-valley-viaduct-walking-route",
  "title": "Balcombe Ouse Valley Viaduct Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Ouse_Valley_Viaduct.JPG/512px-Ouse_Valley_Viaduct.JPG",
  "nearby": [
    {
      "description": "Ardingly Reservoir",
      "objectID": "ddc1247dbb53d0bf77a93005b5a7ed58",
      "ref": "ardingly-reservoir-walking-route"
    },
    {
      "description": "Sussex Ouse Valley Way",
      "objectID": "e56c776d51b4c62318eb5a4367e48ab3",
      "ref": "sussex-ouse-valley-way-walking-route"
    },
    {
      "description": "Lindfield",
      "objectID": "c3cbbcf0bff982ce91aa8ca94631dfcd",
      "ref": "lindfield-walking-route"
    },
    {
      "description": "Cuckfield",
      "objectID": "be23f3d86f2a0bc60573706cd7f1c9d1",
      "ref": "cuckfield-walking-route"
    },
    {
      "description": "Bolney",
      "objectID": "0216fb014b8e9c9dec51e0c82aacec7c",
      "ref": "bolney-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/13e450f106c81769da1e23452fdb96c5.gpx",
  "_geoloc": {
    "lat": 51.042231589,
    "lng": -0.0995911685
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Ouse_Valley_Viaduct.JPG/512px-Ouse_Valley_Viaduct.JPG",
      "title": "Antiquary [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "The northern end of Ouse Valley Viaduct, 2 miles south of Balcombe, West Sussex, photographed from the east. The construction of the viaduct took about 11 million bricks which were mostly shipped up the River Ouse (via Newhaven and Lewes) from the Netherlands. The viaduct was officially opened to train services in the summer of 1841, although the structure was not fully completed until the following year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Ouse_Valley_Viaduct_-_geograph.org.uk_-_516446.jpg",
      "title": "Michael of Crawley / Ouse Valley Viaduct, via Wikimedia Commons",
      "caption": "Ouse Valley Viaduct, West Sussex. Also known locally as Balcombe Viaduct, photographed from Haywards Heath Road just south of Balcombe. Known for its ornate design, the structure has been described as \"probably the most elegant viaduct in Britain.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/View_of_Balcombe_Viaduct_and_Stone_Hall_from_Borde_Hill_-_geograph.org.uk_-_20202.jpg",
      "title": "thorpe [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View of Balcombe Viaduct and Stone Hall from Borde Hill. The viaduct is 96 feet (29 m) high and is carried on 37 semi-circular arches, each of 30 feet (9.1 m), surmounted by balustrades, spanning a total length of 1,480 feet (450 m). The structure suffered considerable decay during the 20th century. During the 1990s it was subject to an extensive restoration by national rail infrastructure owner Railtrack."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Stone_Hall_%28geograph_4575741%29.jpg",
      "title": "Simon Carey / Stone Hall, via Wikimedia Commons",
      "caption": "Stone Hall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Balcombe_Place%2C_Balcombe_%28geograph_3486199%29.jpg",
      "title": "Stephen Richards / Balcombe Place, Balcombe, via Wikimedia Commons",
      "caption": "Balcombe Place, Balcombe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Ardingly_Reservoir_-_geograph.org.uk_-_21836.jpg",
      "title": "Nigel Freeman / Ardingly Reservoir, via Wikimedia Commons",
      "caption": "Ardingly Reservoir. Next to the old Balcombe mill pond, the stream used to meander through the woods. Now the reservoir makes an inlet and the herons can search for fish."
    }
  ],
  "distance_km": 3.5,
  "description": "This circular walk takes you to the impressive Ouse Valley Viaduct from Ardingly Reservoir near Balcombe. It's a short but popular walk with the ornate structure one of the most photographed sights in the area. The walk starts from the car park at the southern end of Ardingly Reservoir. From here you can pick up footpaths heading south to meet with the River Ouse. A riverside path then heads west towards the viaduct. The Grade II listed structure carries the London-Brighton Railway Line over the River Ouse and is particularly photogenic. Built in the mid 19th century the viaduct is 96 feet (29 m) high and is carried on 37 semi-circular arches, each of 30 feet (9.1 m), surmounted by balustrades, spanning a total length of 1,480 feet (450 m). After taking in the views the route then heads to Rylands Fram before heading north to Stonehall Cottages. You then follow countryside trails east back to the reservoir car park, where the route finishes. To continue your exercise try our Ardingly Reservoir Walk which will take you along the water to the village of Balcombe. You could also pick up the epic Sussex Ouse Valley Way. The splendid waterside walk follows the River Ouse from its source near Lower Beeding to the coast at Seaford Bay. The first part of this walk uses a section of the trail which you can follow south to Lindfield or west to Staplefield.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Lindfield Walk starts from the worthy village, located just south of the site. The settlement is well worth a visit with a lovely large village pond, a 13th century church and a fascinating High Street. The historic street is lined with lime trees, and includes over forty medieval and post medieval timber-framed houses. Head south west towards Cuckfield and you could explore the beautiful Nymans Gardens. Also to the south west of Cuckfield there's Bolney where you could pay a visit to the impressive Bolney Wine Estate. Here you can enjoy guided tours of the vineyard and learn all about the history of the wine making process. The pretty village also includes a noteworthy 12th century church, several listed buildings and the well known Bolney Stage pub which is hundreds of years old. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aaF5BvOQwow",
  "county": "West Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Balcombe Lane, Ardingly, Mid Sussex, West Sussex, England, RH17 6QY, United Kingdom",
  "postcode": "RH17 6QY",
  "district": "Mid Sussex",
  "state": "England"
}