{
  "created_at": "2025-01-06T00:37:59.971095+00:00",
  "objectID": "14996e614698e6b9b4b985b81e4efba5",
  "ref": "wheathampstead-walking-route",
  "title": "Walk around Wheathampstead Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e0/River_Lee_near_Wheathampstead_-_geograph.org.uk_-_213329.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/14996e614698e6b9b4b985b81e4efba5.gpx",
  "_geoloc": {
    "lat": 51.8125294986,
    "lng": -0.2939270819
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/River_Lee_near_Wheathampstead_-_geograph.org.uk_-_213329.jpg",
      "title": "Richard Thomas / River Lee near Wheathampstead, via Wikimedia Commons",
      "caption": "River Lee near Wheathampstead. A tranquil scene with a posing swan."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/River_Lee_in_Wheathampstead_-_geograph.org.uk_-_466057.jpg",
      "title": "Nigel Cox / River Lee in Wheathampstead, via Wikimedia Commons",
      "caption": "River Lee in Wheathampstead"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/River_Lee_in_Wheathampstead_-_geograph.org.uk_-_466082.jpg",
      "title": "Nigel Cox / River Lee in Wheathampstead, via Wikimedia Commons",
      "caption": "This is the mill bypass channel showing the head of water in the main river above the low sluice gate. The main river is flowing from right to left towards the mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/The_Broadwater_and_Brocket_Hall.jpg",
      "title": "Ian Capper [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A swan takes off from The Broadwater, an artificial lake on the River Lea, with Brocket Hall behind. Brocket Hall was built by James Paine in 1760, although there had been two previous buildings on the site, the first dating from 1239. It was the home of two Prime Ministers, Lord Melbourne and Lord Palmerston, who died at Brocket in 1865 while in office. It was later the home of the Baronets Brocket, the third Baronet converting it into a hotel, which is its current use. It is grade I listed"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Sherrardspark_Wood_6.JPG/512px-Sherrardspark_Wood_6.JPG",
      "title": "Dudley Miles [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Sherrardspark Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Part_of_the_Ayot_Greenway_Path_-_geograph.org.uk_-_1264640.jpg",
      "title": "Robert Edwards / Part of the Ayot Greenway Path, via Wikimedia Commons",
      "caption": "Part of the Ayot Greenway Path. This public pathway follows part of the disused Luton & Welwyn railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Wheathampstead_Village_-_geograph.org.uk_-_908506.jpg",
      "title": "Gary Fellows / Wheathampstead Village, via Wikimedia Commons",
      "caption": "Wheathampstead Village. Looking up from the bottom of the High Street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Wheathampstead_Cricket_Pavilion_-_geograph.org.uk_-_1221497.jpg",
      "title": "Gary Fellows / Wheathampstead Cricket Pavilion, via Wikimedia Commons",
      "caption": "Wheathampstead Cricket Pavilion. Situated on Nomansland Common"
    }
  ],
  "distance_km": 12.9,
  "description": "This pretty Hertfordshire village near St Albans has some nice trails to follow around the area's rivers, woodland and countryside. This nice circular walk explores the area to the east of the village, visiting the River Lee, Brocket Hall, Lemsford and Sherrardspark Wood. It's a varied route, with waterside sections and peaceful woodland trails to enjoy. The walk starts in the town centre where you can pick up the Lea Valley Walk long distance trail. The waymarked footpath heads east along the river to Waterend and Brocket Hall. This is a very pretty spot with the 18th century hall surrounded by parkland and a lake known as the Broadwater. Here the route turns north to Ayot Green and Sherrardspark Wood. There's lots of nice woodland trails here with various woodland birds to see including nuthatches, treecreepers, woodpeckers, thrushes, robins, tits and wrens. After exploring the wood you head west to pick up the Ayot Greenway. This shared cycling and walking trail will lead you all the way back into Wheathampstead. To continue your walking around the village you could head south and visit Nomansland Common. There's 52 acres of heathland and woodland here which is popular with dog walkers. If you continue west along the river you can explore the town of Harpenden, while Welwyn Garden City lies just to the east. The expansive Heartwood Forest is also not too far away.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Miller & Carter is in a nice position next to the river in the village. The pub is housed in an old Tudor building and has a very good menu. There's also a nice outdoor seating area with lovely views. You can find it at 11 High Street with a postcode of AL4 8BS for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you have time explore the Devil's Dyke near the village. Here you can see the remains of a prehistoric defensive ditch which lies at the east side of Wheathampstead. The site is a candidate for the strongly defended place where Julius Caesar fought Cassivellaunus in 54 BC. See the interesting video below for more details. Just to the north of the village you will find the noteworthy village of Ayot St Lawrence. The village is notable for its connections with the playwright George Bernard Shaw and is the site of Shaw's Corner, his old residence. There's also a ruined 12th century church and a lovely pub which dates from the 14th century. You can reach the village on foot by following the Hertfordshire Way north through the countryside. Near here there's Codicote where you can visit the nearby Hoo Park and enjoy some pretty bluebell woods and a rather fine old bridge over the River Mimram. The village is also very attractive with several timber framed buildings and a historic 16th century pub to admire. Another good option is to follow the Lea Valley Walk east and visit the historic Hatfield House. The expansive grounds include several waymarked walking trails with woodland, parkland and gardens to see. For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gYC_Z31wkNk",
  "district": "Wheathampstead",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}