{
  "objectID": "150b33a802d1548989b7a643d1d3a04b",
  "created_at": "2024-12-19T06:54:13.229312+00:00",
  "ref": "newlands-horseshoe-walking-route",
  "title": "Newlands Horseshoe - Robinson, Dale Head and High Spy Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cc/High_Snab_Bank_-_geograph.org.uk_-_28225.jpg",
  "nearby": [
    {
      "description": "Buttermere",
      "objectID": "9e5cd22c37b1be41a492341eb97fe4f6",
      "ref": "buttermere-walking-route"
    },
    {
      "description": "Newlands Valley",
      "objectID": "cb9ce800f360eaecbe6c18b7d4df54f8",
      "ref": "newlands-valley-walking-route"
    },
    {
      "description": "Catbells",
      "objectID": "a6b9c91df4606d2f6994b45a02d7ca90",
      "ref": "catbells-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/2F45F51862497FD586258508007B2A6E/$FILE/Newlands Horseshoe.gpx",
  "_geoloc": {
    "lat": 54.5647569768,
    "lng": -3.1877290147
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/High_Snab_Bank_-_geograph.org.uk_-_28225.jpg",
      "title": "Nigel Davies / High Snab Bank",
      "caption": "High Snab Bank. This is the view northeast from under Robinson Crags. We can see along the descent down High Snab Bank towards the Newland Valley. On the north horizon is Skiddaw. In the midfield on the left is Sleet Hause"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/On_Robinson_-_geograph.org.uk_-_283908.jpg",
      "title": "Richard Webb / On Robinson",
      "caption": "On Robinson. Near the summit, with High Stile and Red Pike seen across Buttermere."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/On_Hindscarth_Edge_-_geograph.org.uk_-_497355.jpg",
      "title": "Michael Graham / On Hindscarth Edge",
      "caption": "On Hindscarth Edge. Above Molds looking towards Buttermere"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Dale_Head_Tarn_-_geograph.org.uk_-_497331.jpg",
      "title": "Michael Graham / Dale Head Tarn",
      "caption": "Dale Head Tarn. Most of the Tarn is in the square. Once named Beck Head Tarn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Hindscarth_Summit_Cairn_-_geograph.org.uk_-_497346.jpg",
      "title": "Michael Graham / Hindscarth Summit Cairn",
      "caption": "Hindscarth Summit Cairn. The untidy Cairn has been fashioned into a windshelter.Eel Crag in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/High_Spy_Summit_Cairn_-_geograph.org.uk_-_778811.jpg",
      "title": "Steve Partridge / High Spy Summit Cairn",
      "caption": "High Spy Summit Cairn with Blencathra beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Maiden_Moor_-_geograph.org.uk_-_1544296.jpg",
      "title": "Shaun Ferguson / Maiden Moor",
      "caption": "Maiden Moor summit cairn by Bull Crag with in the far distance Cat Bells and Skiddaw"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Catbells_Summit_-_geograph.org.uk_-_1514641.jpg",
      "title": "Shaun Ferguson / Catbells Summit, via Wikimedia Commons",
      "caption": "Catbells Summit Cairn"
    }
  ],
  "distance_km": 18.0,
  "description": "This is one of the Lake District's classic circuits, climbing to some famous peaks with fabulous views throughout. The challenging circular walk runs for a distance of about 11 miles so can be completed in a day by fit walkers. Start the walk from the public car park at Little Town. It's located about 1.5 miles west of the southern part of Derwent Water. From here you head south west to High Snab before picking up a path along the Scope Beck. You then climb to the first major fell of Robinson which stands at a height of 737 m (2,418 ft).  According to Alfred Wainwright its name comes from a Richard Robinson who purchased estates in the Buttermere area many centuries ago. The fell is a popular climb with magnificent views over Buttermere Lake and the beautiful Newlands Valley . From Robinson you descend to Littledale Edge before climbing Hindscarth which stands at an impressive 727 m (2,385 ft). The name Hindscarth is derived from two words from the Old Norse language, Hind and Skarth, meaning the pass used by the red deer. All of the major fell groups with the exception of High Street can be seen from this fine viewpoint. From Hinfdscarth you descend to Hindscarth Edge before climbing to Dale Head. Another significant fell it stands at 753 m (2,470 ft) above sea level. The little tarn on the fell is a popular resting place for walkers with varied flora to see in the area. After rounding the tarn you turn north towards High Spy at 653 m (2,142 ft). From here you descend to Maiden Moor with fine views towards Catbells and Skiddaw. The trail continues up to Catbells, one of the most popular spots in the area. There's fine views here over Derwentwater, Bassenthwaite Lake and Borrowdale. After enjoying the beauty of Catbells the final section heads south west to return to Little Town car park where the route finishes.",
  "video_url": "https://www.youtube.com/embed/gaygCrstumU",
  "postcode": "CA12 5TU",
  "county": "Cumberland",
  "region": "North West",
  "country": "England"
}