{
  "created_at": "2025-01-06T03:40:17.607999+00:00",
  "objectID": "1599414e9e02f74ffd69805d1417f882",
  "ref": "sheffield-round-walk-walking-route",
  "title": "Sheffield Round Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/13/The_Round_Walk%2C_Graves_Park_-_geograph.org.uk_-_1411880.jpg",
  "nearby": [
    {
      "description": "Endcliffe Park",
      "objectID": "78e27b286e213b7c71d5b96e50bb9db8",
      "ref": "endcliffe-park-walking-route"
    },
    {
      "description": "Ecclesall Woods",
      "objectID": "8b2ab21f1b5b83d581ba4685cf891bff",
      "ref": "ecclesall-woods-walking-route"
    },
    {
      "description": "River Sheaf Walk",
      "objectID": "06b559f08c3608dc5720163e2e35bfff",
      "ref": "river-sheaf-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1599414e9e02f74ffd69805d1417f882.gpx",
  "_geoloc": {
    "lat": 53.36763438,
    "lng": -1.50268077
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/The_Round_Walk%2C_Graves_Park_-_geograph.org.uk_-_1411880.jpg",
      "title": "Martin Speck [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The Round Walk, Graves Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Endcliffe_Park%2C_Sheffield.jpg/256px-Endcliffe_Park%2C_Sheffield.jpg",
      "title": "By Shanerounce (Own work) [CC BY-SA 4.0 (http://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Endcliffe Park, Sheffield"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/The_Roundhouse%2C_Ringinglow_-_geograph.org.uk_-_1363485.jpg/256px-The_Roundhouse%2C_Ringinglow_-_geograph.org.uk_-_1363485.jpg",
      "title": "Martin Speck / The Roundhouse, Ringinglow, via Wikimedia Commons",
      "caption": "The Roundhouse, Ringinglow. The Roundhouse, a toll house at the end of the Houndkirk turnpike road. Some older maps show this section of the road as Houndkirk Road, but the modern street sign on the building shows it as Sheephill Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Gatehouse_-_geograph.org.uk_-_1397818.jpg",
      "title": "Derek Henry / Gatehouse, via Wikimedia Commons",
      "caption": "Gatehouse at Whirlow Brook Park off Ecclesall Road South"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Ecclesall_Woods.jpg/256px-Ecclesall_Woods.jpg",
      "title": "By 0742 Mark Mozaz Wallis (Flickr) [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Lovely Autumn colours in the woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Lord_mayor_at_Abbeydale_Miniature_Railway.jpg/512px-Lord_mayor_at_Abbeydale_Miniature_Railway.jpg",
      "title": "Aden Davies [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A train at Abbeydale miniature railway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Beauchief_Abbey_-_geograph.org.uk_-_743172.jpg/256px-Beauchief_Abbey_-_geograph.org.uk_-_743172.jpg",
      "title": "Bill Henderson / Beauchief Abbey, via Wikimedia Commons",
      "caption": "Church of St Thomas Becket, Beauchief Abbey. The historic abbey was founded by Robert FitzRanulph de Alfreton in the 12th century. It was dedicated to Saint Mary and Saint Thomas Becket, who had been canonised in 1172. Today only the western tower of the Abbey remains, as well as some ruined walls to the immediate south-east. The tower is attached to a chapel (now a church) built in the 17th century, but what remains is a Scheduled Ancient Monument. Several areas of ancient woodland remain: Parkbank Wood to the East of the Abbey, Old Park Wood and Little Wood Bank to the south, Gulleys Wood in the centre of the park and Ladies Spring Wood to the west. The Sheffield Round Walk arrives from Park Bank Wood, running eastwards through Chancet Wood and on to Graves Park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Footpath_by_Limb_Brook_-_geograph.org.uk_-_1753579.jpg",
      "title": "Chris Wimbush / Footpath by Limb Brook, via Wikimedia Commons",
      "caption": "Footpath by Limb Brook"
    }
  ],
  "distance_km": 24.0,
  "description": "This circular walk takes you on a tour of the parks, countryside, woods, waterways and villages surrounding the Yorkshire city of Sheffield. The walk is signposted and runs for about 14 miles so can be completed in a day. You can start the walk from any number of places but this route starts from the lovely Endcliffe Park in the Sharrow Vale area of the city. You enter the park at Hunters Bar and then follow the pretty Porter Brook through woodland to Bingham Park at the western end. You continue along the brook through Bingham Park and Whiteley Woods passing Endcliffe Park and Forge Dam on the way. After emerging from the woods you head through the lovely countryside of the Mayfield Valley along Clough Lane. This leads to the peaceful wooded area of Porter Clough where you turn south to the little village of Ringinglow on the edge of the Peak District National Park. After passing through the village you then head through the pretty Limb Valley with the Limb Brook and nice woodland trails to enjoy on this section. The next stage takes you through one of the real highlights in Whirlow Brook Park. Here you'll find Rhododendrons, Azaleas, woodland, surfaced footpaths, gorgeous gardens and a rock pool with a waterfall. After leaving the park you continue south east through Ecclesall Woods where you'll pass the delightful Abbeydale Miniature railway. You continue towards Beauchief Abbey passing through Ladies Spring Wood on the way. The Limb Brook runs through this area of ancient woodland with a variety of birds to look out for. These include nuthatch, the green woodpecker, the great spotted woodpecker and the lesser spotted woodpecker. Beauchief Park includes the remains of the 12th century Beauchief Abbey, a 17th century church and a pretty mill pond. You can also pick up the River Sheaf Walk near here. This will take you to the lovely Millhouses park and then on into the city centre. The route continues east to Meadow Head and Graves Park. The park is a mixture of open parkland and woodland, with several streams and three lakes. There is also an animal farm with many rare breeds of cattle, pigs, chickens and donkeys. After Graves park you turn north through Lees Hall golf club and Meersbrook Park. The final section takes you through Chelsea Park and Brincliffe before finishing back at Endcliffe Park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the pretty Forge Dam, near Endcliffe Park, there is a nice cafe overlooking a lake. There's a good range of meals and snacks with outdoor seating for finer days. It's a nice place to stop on the route and enjoy refreshments while taking a rest. In Graves Park you'll find the delightful Rose Garden Cafe. On warm days there's seating available outside on the Rose Garden Terrace. There's lots of nice sandwiches and cakes to choose from and it's also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Round Sheffield Run follows the route of the Sheffield Round Walk. The annual event takes place in June as a fundraiser for the Weston Park Cancer Charity. It's a popular event with 11 timed stages and a great social atmosphere with food, drink and a dj afterwards. Find out more on their website by clicking here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/yu-VtIGqq40",
  "postcode": "S11 8TG",
  "district": "Sheffield",
  "region": "South Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Porter Brook Trail, Sharrow Vale, Endcliffe, Sheffield, South Yorkshire, England, S11 8TG, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "countryside",
    "wooded trails",
    "parkland"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "bird watching",
    "waterfall",
    "miniature railway"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly",
    "wheelchair accessible",
    "animal farm"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}