{
  "objectID": "15ab8b84075d062e7dfd7cc73cdd3693",
  "created_at": "2024-12-18T00:50:28.177540+00:00",
  "ref": "widnes-walking-route",
  "title": "Widnes Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Spike_Island_Widnes_-_geograph.org.uk_-_291463.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/15ab8b84075d062e7dfd7cc73cdd3693.gpx",
  "_geoloc": {
    "lat": 53.354956483,
    "lng": -2.7313811474
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Spike_Island_Widnes_-_geograph.org.uk_-_291463.jpg",
      "title": "Alan Pennington / Spike Island Widnes",
      "caption": "Spike Island Widnes. Looking from the St.Helens canal towards the River Mersey and across to the other side of the river is the Manchester Ship Canal, to the right of this picture is the Widnes Runcorn road bridge and next to that the railway bridge, both just out of sight. Access to the river Mersey by the boats in Spike Island is still possible but as the river is tidal this is only possible with the tidal conditions. Up until the early 1960s the river could be crossed by a few vehicles and foot passengers on the old transporter bridge. The transporter was a massive steel structured bridge high above the water, a moving platform was hung from the main structure and was pulled across the river slung some 70 feet below the main frame of the bridge. It was like a giant moving swing, and it felt like a swing whenever you travelled on it. Only a small number of vehicles could be carried on each crossing of the river, but back then the traffic requiring to cross from one bank to the other was far smaller than today's hustle & bustle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Swans_and_pleasurecraft_at_Spike_Island%2C_Widnes_-_geograph.org.uk_-_40758.jpg",
      "title": "Sue Adair / Swans and pleasurecraft at Spike Island, Widnes",
      "caption": "This is the very end of the Sankey canal just before it enters the river Mersey near to the Runcorn Bridge. Spike Island was the birthplace of the British chemical industry. In the late 19th century the area was dominated by huge factories and a maze of railway lines criss-crossed the Island. A network of footpaths has replaced the railway lines on the Island, allowing you to explore the site and enjoy expansive views across the River and up the Sankey Canal to Warrington and beyond. Many different kinds of birds and other animals can be seen at Spike Island and on the marshes towards Fiddler's Ferry. The catalyst museum is nearby and with canalside walks, acres of grassland and woodland to explore, visitor centre, picnic area, quiet spots for fishing and many water fowl this is a good spot to take the family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Toll_Booth_for_Transporter_Bridge%2C_Widnes_-_geograph.org.uk_-_285623.jpg",
      "title": "Sue Adair / Toll Booth for Transporter Bridge, Widnes",
      "caption": "Toll Booth for Transporter Bridge, Widnes. This is the redundant sandstone toll booth for the original transporter bridge which crossed the Mersey at this point before the building of the Silver Jubilee Bridge. The transporter bridge opened in 1905 at a cost of £137,663 6s 4d. With a span of 1000 ft and height above high water of 82 ft it took two and a half minutes to cross the river and could carry twelve vehicles and 300 passengers. It closed on July 22nd 1961 and was demolished a year or so later costing £2,000 more than it cost to build."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Spring_Tide_at_Widnes_Warth_-_geograph.org.uk_-_374362.jpg",
      "title": "Sue Adair / Spring Tide at Widnes Warth",
      "caption": "Spring Tide at Widnes Warth. Widnes Warth is an area of saltmarsh and mudflats, usually a green marshy area between the river Mersey and Sankey Canal but occasionally during the year, at very high tides, it is covered by the incoming water. Widnes Warth, a haven for birds and wildlife, will soon receive Local Nature Reserve status. It is designated as a Special Protection Area for birds and a Site of Special Scientific Interest and at present major environmental and visitor facility improvements are being made, including the construction of raised boardwalks with improved visitor access. Fiddler's Ferry power station can clearly be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Victoria_Promenade%2C_West_Bank%2C_Widnes_-_geograph.org.uk_-_285631.jpg",
      "title": "Sue Adair / Victoria Promenade, West Bank, Widnes",
      "caption": "Victoria Promenade, West Bank, Widnes. This promenade was popular with the Victorians before the building of the transporter bridge when the river Mersey offered fresh air and there were uninterrupted views to the Cheshire countryside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Lighthouse_at_Hale_point_-_geograph.org.uk_-_40618.jpg",
      "title": "Sue Adair / Lighthouse at Hale point",
      "caption": "Hale Head Light, Merseyside (Liverpool Area). Lighthouse at Hale point. Standing on a sandstone cliff, the present Hale Lighthouse dates from 1906. It replaced a shorter tower built seventy years earlier. The 45 ft tower put the lamp chamber 70ft above mean sea level, which is not much as lighthouses go. Yet the lamp's beam could be seen from as far away as forty miles. Unfortunately, it's now many years since the lighthouse was operational. Its 250 candlepower oil lamp last shone out in 1958, when it was tentatively decommissioned on a trial basis. The trial became permanent and the lighting equipment was removed. It is now a private residence. Note Helsby Hill in the distance and the stacks and towers of Stanlow Oil Refinery on the horizon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Speke_Hall_-_geograph.org.uk_-_47998.jpg",
      "title": "Sue Adair / Speke Hall",
      "caption": "Speke Hall. In a most unlikely setting, at the edge of a modern industrial estate and bordering on the runway of Liverpool Airport, stands this enchanting black and white, half-timbered Tudor mansion. Having suffered long periods of desertion and neglect, it is little short of a miracle that the building has survived at all, but even more surprising is that is has remained virtually unaltered since it was first built for the Norris family some 500 years ago. It is considered to be one of the most outstanding examples of its kind. Its present form dates from the period 1490-1612, but there was an earlier house on or near the site of the present building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Light_Gantry%2C_John_Lennon_Airport_-_geograph.org.uk_-_303832.jpg",
      "title": "Sue Adair / Light Gantry, John Lennon Airport",
      "caption": "Light Gantry, John Lennon Airport. Light gantry for the runway at Liverpool John Lennon Airport which juts out into the river Mersey near Speke Hall. The known history of the manor of Speke, or 'Spec' (brushwood in Old English), goes back to the Domesday survey of 1086 which records that it was one of several properties held by Uctred in 1066. When Adelaide Watt came into her inheritance of Speke Hall, she set about developing a huge new farm complex, and was determined that such an historic property should be preserved for all time, irrespective of the massive amount of industrial development that was fast spreading out from the city. Having made a limited provision in her will to save the house, the estate was sold after she died in 1921, and the farm complex transformed into an aerodrome. It is amazingly surreal to be wandering along the uneven corridors of the hall, quietly absorbed in the atmosphere of a romantic Elizabethan courtyard house, when suddenly the throaty sounds of a 21st century jet rudely interrupts the visions of a more genteel way of life."
    }
  ],
  "distance_km": 30.5,
  "description": "This Cheshire based town has some fine walks along the river and canal which run through the area. There's also an excellent waterside park with connections to the town's chemical industry history. This walk from the town follows the Mersey Way west to visit two of the local highlights of the area at Hale Lighthouse and Speke Hall. The walk starts at Spike Island in Widnes. This lovely local park is located next to the St Helen's Canal and the River Mersey in the town centre. The area is thought of the birthplace of the British chemical industry and is now a splendid green space on the banks of the Mersey Estuary. From here you can pick up the Mersey Way and the Trans Pennine Trail and follow the waymarked trails west towards the Runcorn - Widnes Bridge. You continue west along the river for about 3 miles before coming to the pretty village of Hale. From here you can access a footpath down to the photogenic Hale Lighthouse. The lighthouse is in a splendid position with great views over the Mersey to Ellesmere Port. The route continues west along Dungeon Banks to Speke Hall, passing John Lennon Airport on the way. The National Trust owned hall includes a Grade I listed house surrounded by lovely parkland and gardens. After exploring the hall the route returns to Widnes on the same paths.",
  "video_url": "https://www.youtube.com/embed/oDVgASnl6tA",
  "county": "Halton",
  "region": "North West",
  "country": "England"
}