{
  "objectID": "16086532fefd4079ef9a0e34b7597118",
  "created_at": "2024-12-18T16:34:35.632295+00:00",
  "ref": "lymington-walking-route",
  "title": "Lymington Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Pylewell_Shore_-_geograph.org.uk_-_178285.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/16086532fefd4079ef9a0e34b7597118.gpx",
  "_geoloc": {
    "lat": 50.7611819862,
    "lng": -1.5369927827
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Pylewell_Shore_-_geograph.org.uk_-_178285.jpg",
      "title": "Jim Champion / Pylewell Shore",
      "caption": "Pylewell Shore. The edge of the Pylewell estate meets the Solent mudflats here, with a border of oak trees. Some have fallen onto the beach as a result of slow erosion by the sea - the trunk of one such tree can be seen in the centre of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Pylewell%2C_foreshore_-_geograph.org.uk_-_1376115.jpg",
      "title": "Mike Faherty / Pylewell, foreshore",
      "caption": "Pylewell, foreshore. Foreshore to the South of Pylewell House; to the right, note tree props, postponing their inevitable fall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Pylewell_House_-_geograph.org.uk_-_178281.jpg",
      "title": "Jim Champion / Pylewell House",
      "caption": "Pylewell House. The house dates from the 18th century, and was enlarged in the 20th century. It is English Heritage-listed. As seen from the permissive path that runs along the edge of the estate by the Solent shore. The Hampshire Treasures resource lists the following facts about the house: \"Brick, partly plastered with slate roof. Cellars and basement of stone, considerably older construction. 3 storeys and attic in main block. 2 storeys and attic in wings. 11-window front. Doric pillared porch with pediment, Roman-Catholic chapel once built into house destroyed in C.19.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Footbridge_over_Plummers_Water%2C_New_Forest_-_geograph.org.uk_-_302662.jpg",
      "title": "Jim Champion / Footbridge over Plummers Water, New Forest",
      "caption": "Footbridge over Plummers Water, New Forest. This footbridge carries the permissive footpath across Plummers Water on the Solent shore, west of the end of Tanners Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Plummers_Water_enters_the_Solent_-_one_hour_later_-_geograph.org.uk_-_464481.jpg",
      "title": "Jim Champion / Plummers Water enters the Solent - one hour later",
      "caption": "Plummers Water enters the Solent from beneath the footbridge to the left of the photo. The tide is ebbing here. Yachts sailing in the Solent near Cowes can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Bridge_over_Plummers_Water_-_geograph.org.uk_-_647510.jpg",
      "title": "Gillian Moy [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "Bridge over Plummers Water. Seen from Tanners Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Lymington_High_Street_-_geograph.org.uk_-_161283.jpg",
      "title": "Jim Champion / Lymington High Street",
      "caption": "Lymington High Street. Looking east along the High Street in the town on a Sunday - still busy although few of the high street shops are open. In the distance is the top of the Walhampton Obelisk, presumably erected on that spot so that it was visible from the town's principal street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Wightlink_ferry_approaching_the_Lymington_terminal_-_geograph.org.uk_-_161421.jpg",
      "title": "Jim Champion / Wightlink ferry approaching the Lymington terminal",
      "caption": "Wightlink ferry approaching the Lymington terminal. The ferry Caedmon approaching the Lymington terminal (on the left). Its symmetric design is ideally suited to this shuttle service between Lymington and Yarmouth on the Isle of Wight. According to the Wightlink history website, the vessel is 61 metres long and 15 metres wide and is capable of carrying 52 cars. It was brought into service in 1973 on the Ryde-Portsmouth link and moved to Lymington in 1983."
    }
  ],
  "distance_km": 11.0,
  "description": "The Hampshire town of Lymington is in a great location for exploring the New Forest, the south coast and the Isle of Wight. This circular walk explores the countryside to the east of the town using part of the Solent Way long distance footpath. The area is home to the Pylewell Estate where you'll pass lakes, beaches, woodland and attractive countryside with fine views to the Isle of Wight. The route runs for just under 7 miles on a series of flat paths and country lanes. Start the walk from Lymington Town train station and head north to cross the bridge over the Lymington River. You then head east past Walhampton before turning south along Shotts Lane. This will take you down to the foreshore at Pylewell where there's a footpath running along the coast on the southern edge of the estate. There's some lovely views as you pass along the beach to Tanners Lane where you turn north. The route then turns left past Pylewell Home Farm and the pretty cricket ground on the northern edge of the estate. The final section retraces your steps, passing Walhampton Wood before returning to the train station.",
  "district": "Lymington",
  "county": "Hampshire",
  "region": "South East",
  "country": "England"
}