{
  "objectID": "167b3f310a466c4b898210799af3a480",
  "created_at": "2024-12-18T13:53:53.498324+00:00",
  "ref": "runnymede-walking-route",
  "title": "Runnymede Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/09/Memorial_Pillars%2C_Runnymede-geograph-4083020.jpg",
  "nearby": [
    {
      "description": "Windsor Great Park",
      "objectID": "299b1b589aad6bf5c5355a757888424e",
      "ref": "windsor-great-park-walking-and-cycle-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Staines Moor",
      "objectID": "dee4fb3fbeb3261a6e6a487beb27d936",
      "ref": "staines-moor-walking-route"
    },
    {
      "description": "Colne Valley Way",
      "objectID": "ef83d9fcf0c06fd142b76a312a49c598",
      "ref": "colne-valley-way-walking-route"
    },
    {
      "description": "Wraysbury",
      "objectID": "a3d28ae57da5f5ca20805a295c9ee65f",
      "ref": "wraysbury-walking-route"
    },
    {
      "description": "Egham",
      "objectID": "a28ca810a460cb6016f12728d27469e7",
      "ref": "egham-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/C487A6DD7EC48EC18525811D003763DF/$FILE/Runnymede.gpx",
  "_geoloc": {
    "lat": 51.4484538586,
    "lng": -0.5671474511
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Memorial_Pillars%2C_Runnymede-geograph-4083020.jpg",
      "title": "David Dixon / Memorial Pillars, Runnymede",
      "caption": "Memorial Pillars, Runnymede. The two pillars and the lodges either side of Windsor Road were designed by Sir Edwin Lutyens after the death of Urban Broughton in 1929. The lodge on the left is used as a National Trust visitor centre and café."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Roadside_lodge%2C_Runnymede-geograph-3075330-by-Alan-Hunt.jpg/512px-Roadside_lodge%2C_Runnymede-geograph-3075330-by-Alan-Hunt.jpg",
      "title": "Alan Hunt / Roadside lodge, Runnymede",
      "caption": "Roadside lodge, Runnymede. One of the pair of roadside lodges on either side of the A308 near the Runnymede roundabout. There is a similar pair on the A308 as it leaves the Runnmede estate on the outskirts of Old Windsor. Taken in August 2012."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Kennedy_Memorial%2C_Runnymede_-_geograph.org.uk_-_1501468.jpg",
      "title": "Colin Smith / Kennedy Memorial, Runnymede",
      "caption": "Kennedy Memorial. Britain's Portland stone memorial to J.F. Kennedy at Runnymede, the site chosen for its historical connections with freedom."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Park_at_Runnymede_-_geograph.org.uk_-_948668.jpg",
      "title": "Graham Horn / Park at Runnymede",
      "caption": "Park at Runnymede Between the road and the river is this park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Magna_Carta_memorial%2C_Runnymede_-_geograph.org.uk_-_1264714.jpg",
      "title": "Brian Slater / Magna Carta memorial, Runnymede",
      "caption": "Magna Carta Memorial, Runnymede. The memorial was erected in 1957 by the American Bar Association. It was designed by Sir Edward Maufe, reflecting the role that the Magna Carta has had on the American Bill of Rights and Constitution."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/The_Magna_Carta_Tea_Room%2C_Runnymede-geograph-4314742-by-David-Howard.jpg/512px-The_Magna_Carta_Tea_Room%2C_Runnymede-geograph-4314742-by-David-Howard.jpg",
      "title": "David Howard / The Magna Carta Tea Room, Runnymede",
      "caption": "The Magna Carta Tea Room. Situated by the Magna Carta memorial"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Cooper%27s_Hill%2C_Egham_-_geograph.org.uk_-_2661907.jpg?20210922014242",
      "title": "Cooper's Hill, Egham by Eirian Evans, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cooper's Hill, Egham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Oak_Trees%2C_Coopers_Hill_-_geograph.org.uk_-_2823559.jpg/512px-Oak_Trees%2C_Coopers_Hill_-_geograph.org.uk_-_2823559.jpg?20211204052809",
      "title": "Oak Trees, Coopers Hill by Alan Hunt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Oak Trees, Coopers Hill"
    }
  ],
  "distance_km": 4.0,
  "description": "Visit the birthplace of the Magna Carta on this riverside walk near Egham in Surrey. Runnymede Park includes nice footpaths running through woodland, wildflower meadows and along the River Thames. There's also the Langham Ponds wetland area where you can look out for interesting plants and insects. You may also see fallow or muntjac deer grazing in the meadows. You can start your walk from the large car park just off Windsor Road opposite Magna Carta Island. You then cross the road and pick up footpaths to the Magna Carta Monument. Here you can learn about the history of the charter which was agreed by King John at Runnymede on the 15th June 1215. It promised the protection of church rights, protection for the barons from illegal imprisonment, access to swift justice, and limitations on feudal payments to the Crown. Many consider it to be the the foundation of the free world and of individual freedom. Around here you can also find the John F. Kennedy Memorial Stone. The memorial consists of a block of Portland stone set in a symbolic acre of American soil. You reach it by climbing a steep path of granite steps, intended to symbolise a pilgrimage. From here there are great views back towards the River Thames. After leaving the monument you head to Cooper's Hill where there are some nice woodland trails. Look out for the ancient oak trees, wood anemones and carpets of pretty bluebells in the spring months. After leaving the woods you can follow other paths across the wide fields before returning to the car park. Before you finish your walk you could visit the Runnymede Pleasure Grounds where you can buy refreshments. The pretty gardens have nice wide lawns running down to the Thames and a good cafe with picnic tables. You can extend your walk by enjoying a stroll along the Thames Path . Heading north along the trail will take you towards Windsor where you can explore the expansive Windsor Great Park . Also nearby is the lovely Staines Moor Site of Special Scientific Interest. Here you can enjoy waterside paths around Wraysbury Reservoir with nice views of the River Colne. There's also a series of streams, rivers, ponds and lakes with lots of wildlife to look out for. The moor is located very close to Runnymede so well worth a visit if you have time. You can also pick up the Colne Valley Way long distance path from here.",
  "video_url": "https://www.youtube.com/embed/vjWEdMUXUsE",
  "postcode": "TW19 5AE",
  "county": "Windsor and Maidenhead",
  "region": "South East",
  "country": "England"
}