{
  "created_at": "2025-01-06T01:35:45.398703+00:00",
  "objectID": "16c48ff4ff3923e2b952bb9976eb0cef",
  "ref": "st-neots-walking-route",
  "title": "St Neots Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/River_Ouse_Riverside_Park_St_Neots.jpg/512px-River_Ouse_Riverside_Park_St_Neots.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/16c48ff4ff3923e2b952bb9976eb0cef.gpx",
  "_geoloc": {
    "lat": 52.2282444366,
    "lng": -0.2715166668
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/River_Ouse_Riverside_Park_St_Neots.jpg/512px-River_Ouse_Riverside_Park_St_Neots.jpg",
      "title": "Bear 1975 [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "River Ouse Riverside Park St Neots"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/River_Great_Ouse%2C_St_Neots_-_geograph.org.uk_-_684755.jpg",
      "title": "David Kemp / River Great Ouse, St Neots, via Wikimedia Commons",
      "caption": "River Great Ouse, St Neots Taken from the Ouse Valley Way where it passes through Lammas Meadow"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Paxton_Pits_Nature_Reserve_-_geograph.org.uk_-_1547986.jpg",
      "title": "Mick Lobb / Paxton Pits Nature Reserve, via Wikimedia Commons",
      "caption": "Paxton Pits. Gravel pits by the River Great Ouse were dug out here between the 1940s and 1960s; the area was designated a nature reserve in the 1980s and is now an important visitor attraction as well as a haven for aquatic wildlife. The lake in this photo is called Heronry South Lake; no herons were in evidence on this occasion, but a swan can be seen in the shadow of the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/The_Great_River_Ouse%2C_St_Neots_-_geograph.org.uk_-_1260311.jpg",
      "title": "Eirian Evans / The Great River Ouse, St Neots, via Wikimedia Commons",
      "caption": "The Great River Ouse, St Neots Taken from the Mill Lane bridge. The Ouse Valley way runs along the bank on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Riverside_Park%2C_St_Neots_-_geograph.org.uk_-_381927.jpg",
      "title": "Gary and Caroline Kidd / Riverside Park, St Neots, via Wikimedia Commons",
      "caption": "Riverside Park, St Neots. Swans and ducks in boating pond at Riverside Park, St Neots. Beyond the footbridge in the distance is the Great River Ouse and St Neots town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/St_Neots_lock%2C_Little_Paxton_-_geograph.org.uk_-_707098.jpg",
      "title": "David Kemp / St Neots lock, Little Paxton, via Wikimedia Commons",
      "caption": "St Neots lock, Little Paxton This is Lock 9 on the River Great Ouse. The mainstream of the river flows on the far side of The Island - which is the land on which the flats seen here have been built."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Market_Square%2C_St_Neots_-_geograph.org.uk_-_1206649.jpg",
      "title": "Stephen McKay / Market Square, St Neots, via Wikimedia Commons",
      "caption": "Market Square, St Neots. The largest town in the modern county of Cambridgeshire (after Cambridge and Peterborough, which are both cities) has at its heart this handsome market square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/The_Bridge_House%2C_St_Neots%2C_Huntingdonshire_-_geograph-3151933.jpg/512px-The_Bridge_House%2C_St_Neots%2C_Huntingdonshire_-_geograph-3151933.jpg",
      "title": "Paul Gillett / The Bridge House, St Neots, via Wikimedia Commons",
      "caption": "The Bridge House"
    }
  ],
  "distance_km": 14.6,
  "description": "This pretty town in Cambridgeshire has some lovely country and riverside walks to try. St Neots is the largest town in the county and an interesting place to visit. The town dates back over 1,000 years to the Medieval Priory of St. Neot and includes an award winning museum which is well worth a visit. This circular walk uses part of the Ouse Valley Way to visit the lovely Riverside Park and the nearby Paxton Pits Nature Reserve. The walk starts from St Neots Bridge and follows the waymarked Ouse Valley Way north through the attractive Lammas Meadows on the eastern side of the river. The river eventually winds its way round to Paxton Pits where there's a series of nice ponds and lakes. In all there's 200 acres to explore with habitats including meadow, reedbed, scrub and woodland. It's a great place for bird watching so be sure to bring your binoculars. After exploring the reserve the walk returns to St Neots Bridge on the same paths. You then pass through the Riverside Park on the western side of the river, just to the south of the bridge. Follow the paths south past the cricket ground to Eaton Socon where you cross the river at the pretty lock. You can then follow the Ouse Valley Way past Eynesbury before returning to the bridge. The town is located close to the popular Grafham Water where there's more waterside walks along the large lake. Near here you can also pick up the The Three Shires Way long distance trail. The waymarked footpath is a great way of exploring the countryside and villages to the east of the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Snacks are available in the Paxton Pits visitors centre but if you'd like something more substantial head to The Anchor in Little Paxton. The friendly pub has a cosy log fire for colder days and for the summer months there is a lovely outdoor dining area as well as an outside patio and play area. You can find the pub on the High Street in the village just to the west of the reserve. The postcode is PE19 6HA. In St Neots there's also the splendid River Mill pub. The riverside pub has dining area opening out on to the lower mill pond viewing deck. Outside there are lots of picnic tables alongside the upper mill pond and the marina. It's a lovely place to relax on a summer day. You can find it about 1 mile south of the reserve at postcode PE19 8GW. In the Riverside Park there's also the Ambiance Cafe which serves light refreshments during the day."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Paxton Pits and the riverside are a nice place for a dog walk but please keep them under close control. Both the Anchor pub and River Mill mentioned above welcomes dogs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Pay a visit to St Neots Museum if you have time. It runs a variety of permanent and temporary exhibitions detailing the history of the area. You can find it at 8 New St with a postcode of PE19 1AE. Head south and you could pick up the popular Biggleswade Green Wheel which explores the River Ivel and visits the Victorian Jordan's Mill and gardens. For more walking ideas in the area see the Cambridgeshire Walks page."
    }
  ],
  "postcode": "PE19 2PU",
  "district": "Huntingdonshire",
  "county": "Cambridgeshire",
  "region": "Cambridgeshire and Peterborough",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Priory Lane, Eaton Ford, St. Neots, Huntingdonshire, Cambridgeshire, Cambridgeshire and Peterborough, England, PE19 2PU, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "meadow"
  ],
  "points_of_interest": [
    "nature reserve",
    "historical sites",
    "villages"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "bird watching"
  ]
}