{
  "created_at": "2025-01-06T04:07:41.135507+00:00",
  "objectID": "172eac8dcd167900bb6568cf154ebad3",
  "ref": "ickworth-park-walking-and-cycle-route",
  "title": "Ickworth Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Ickworth_House4.jpg",
  "nearby": [
    {
      "description": "Bury St Edmunds",
      "objectID": "7c182c67561de8a03c542a5c8b840812",
      "ref": "bury-st-edmunds-walking-route"
    },
    {
      "description": "Nowton Park",
      "objectID": "16c3bcc4d2b6761b9134c0475da25125",
      "ref": "nowton-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/172eac8dcd167900bb6568cf154ebad3.gpx",
  "_geoloc": {
    "lat": 52.2208961926,
    "lng": 0.6582255412
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Ickworth_House4.jpg",
      "title": "Bob Jones, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ickworth House - the Rotunda and West Wing"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Ickworth_pond_-_geograph.org.uk_-_832130.jpg",
      "title": "Bob Jones / Ickworth pond",
      "caption": "Ickworth pond. The restored West Wing of Ickworth House can be seen behind the trees in the background. The pond is a haven for wildlife, especially mallard and coot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Woodland_clump_in_Ickworth_Park_-_geograph.org.uk_-_1094638.jpg",
      "title": "Bob Jones / Woodland clump in Ickworth Park",
      "caption": "Woodland clump in Ickworth Park. This clump of trees is situated in the centre of the park, near Bury St Edmunds. The track across the ploughed field towards the River Linnet in the foreground is made by deer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Ickworth_vineyard_-_geograph.org.uk_-_1220357.jpg",
      "title": "Bob Jones / Ickworth vineyard",
      "caption": "Ickworth vineyard. This is the only commercial vineyard on National Trust property. The tower of St Mary's Church can be seen above the brick wall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/%27Mistletoe%27_trees_at_Ickworth_-_geograph.org.uk_-_1213042.jpg",
      "title": "Bob Jones / 'Mistletoe' trees at Ickworth",
      "caption": "'Mistletoe' trees at Ickworth. Viewed from the curved wall that surrounds the garden of Ickworth House, these parkland trees have attracted unusually large quantities of mistletoe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/River_Linnet_in_Ickworth_Park_-_geograph.org.uk_-_1220051.jpg/256px-River_Linnet_in_Ickworth_Park_-_geograph.org.uk_-_1220051.jpg",
      "title": "Bob Jones / River Linnet in Ickworth Park",
      "caption": "River Linnet in the park. This 'river' is only a stream, narrow enough at this point to leap across. It winds through sandy soil, leaving an exposed bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Track_to_Ickworth_church_-_geograph.org.uk_-_1143958.jpg",
      "title": "Bob Jones / Track to Ickworth church",
      "caption": "Track to Ickworth church. This church, once an integral part of the village, is disused and in a poor state of repair. Ickworth is a 'lost village', swallowed up by the estate of the Marquesses of Bristol."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Mordaboys_Cottage_in_Ickworth_Park_-_geograph.org.uk_-_1624976.jpg",
      "title": "Bob Jones / Mordaboys Cottage in Ickworth Park",
      "caption": "Mordaboys Cottage in the snpw. This 'chocolate box' thatched cottage was once the blacksmith's shop on the old droving route into Bury St Edmunds, known as the Chevington Way."
    }
  ],
  "distance_km": 8.0,
  "description": "A circular walk around the parks and gardens at Ickworth in Bury St Edmunds. There are 1,800 acres of parkland to explore with lakes, woodland and arable fields to enjoy. The walk also takes you through the beautiful Italianate garden which is the oldest of its kind in England. Here you'll also find the 18th century Italian Rotunda, built by the 4th Earl of Bristol to house his collection of Italian art and sculpture. The route below is devised for walkers but much of the park is also great for cycling, with bike hire available from the Ickworth hotel. Please click here for more information. Also of interest is the Newmarket to Bury St Edmunds cycle route which runs along National Cycle Route 51 and passes close to Ickworth Park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's two fine National Trust cafes at the site. They serve excellent fresh food made from sustainable sources. Another nice option is to head into Bury St Edmunds and visit The Nutshell. It's a quirky little place confirmed to be Britain's smallest pub, with a bar that measures just 15ft by 7ft. Despite its size there's a number of unusual items inside including a mummified cat, currency notes on the ceiling, historical photos, military items and an aeroplane propeller. As such the Victorian pub is a local tourist attraction and well worthy of some investigation. You can find them at 17 The Traverse, with a postcode of IP33 1BJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The expansive park is ideal for dog walking with woodland trails and lovely parkland for them to explore. You are asked to please keep them on leads throughout the estate because of the wildlife. Dogs are not allowed in the Italianate garden, Walled Garden or inside the buildings. Just to the east of the park there's Hardwick Heath which is a popular place for dog walkers. They can run around off lead here."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east of the park you'll find Hardwick Heath and Nowton Park. The Victorian landscaped park includes a lime avenue, sculptures and a visitor centre. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UugSlRxKbxM",
  "county": "Suffolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}