{
  "created_at": "2025-01-06T04:18:31.488051+00:00",
  "objectID": "17c628d8a920bec4f253febceb624514",
  "ref": "llangollen-canal-walking-and-cycle-route",
  "title": "Llangollen Canal Walk and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/45/Llangollen_Canal_-_geograph.org.uk_-_130740.jpg",
  "nearby": [
    {
      "description": "Horseshoe Falls Llangollen",
      "objectID": "a584fc7e8c31c94d807a05221fa1c546",
      "ref": "horseshoe-falls-llangollen-walking-route"
    },
    {
      "description": "Colemere Country Park",
      "objectID": "efca73395ee6cac48220a700cd129470",
      "ref": "colmere-country-park-walking-route"
    },
    {
      "description": "Chirk Castle",
      "objectID": "c655ad75b91663f6b9f62d43b269491e",
      "ref": "chirk-castle-walking-and-cycle-route"
    },
    {
      "description": "Ellesmere Lake",
      "objectID": "3efa463b8913b6489f2ec41d666bb00d",
      "ref": "ellesmere-country-park-walking-route"
    },
    {
      "description": "Montgomery Canal",
      "objectID": "605c10f32c89ee8678b6f53a681eaca3",
      "ref": "montgomery-canal-walking-and-cycle-route"
    },
    {
      "description": "Trevor to Llangollen Canal Walk",
      "objectID": "bf2942ae8cef27d7a52970702be7cab0",
      "ref": "trevor-to-llangollen-canal-walk-walking-route"
    },
    {
      "description": "Hurleston Reservoir",
      "objectID": "3d95a7f96e064b8b40d20fc22579734f",
      "ref": "hurleston-reservoir-walking-route"
    },
    {
      "description": "Wrenbury",
      "objectID": "dd81bbe44f7a23e65a54efe7b01e7972",
      "ref": "wrenbury-walking-route"
    },
    {
      "description": "Dee Valley",
      "objectID": "adb33fb44bda87242b42341e6873fd0a",
      "ref": "dee-valley-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/17c628d8a920bec4f253febceb624514.gpx",
  "_geoloc": {
    "lat": 52.9809520312,
    "lng": -3.1988602144
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Llangollen_Canal_-_geograph.org.uk_-_130740.jpg",
      "title": "Pierre Terre / Llangollen Canal",
      "caption": "Looking SE between Coachman's and Clay Pit bridges with rapeseed in bloom"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/The_Llangollen_Canal_-_geograph.org.uk_-_1452185.jpg",
      "title": "Andy Beecroft / The Llangollen Canal",
      "caption": "Taken from the start of the Ellesmere Basin branch where the main Llangollen Canal makes a right-angled turn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Llangollen_Canal_-_geograph.org.uk_-_892827.jpg",
      "title": "Graham Taylor / Llangollen Canal",
      "caption": "The end of the line. The start of the canal. Water extracted from the River Dee, just beyond the building, flows through the building and into the canal at the rate of 6 1/4 million gallons per day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Narrowboat_on_Llangollen_Canal_-_geograph.org.uk_-_1067110.jpg",
      "title": "Patrick / Narrowboat on Llangollen Canal",
      "caption": "A bright late autumn afternoon revealed this picture behind a service station and cafe on the A5/A483. The couple on the boat were clearly enjoying the peace of the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Canal_Boat_on_the_Llangollen_Canal_-_geograph.org.uk_-_1451582.jpg",
      "title": "Andy Beecroft / Canal Boat on the Llangollen Canal",
      "caption": "A barge goes through an attractive archway of trees in the summer of 2009. The canal at this point passes within a few metres of Blake Mere."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Llanddyn_Bridge%2C_Llangollen_Canal_-_geograph.org.uk_-_1001185.jpg",
      "title": "Stephen McKay / Llanddyn Bridge, Llangollen Canal",
      "caption": "Llanddyn Bridge - no. 43 - conveys a track off the A539 leading up to Llanddyn Hall over this attractive stretch of canal. The house is Llanddyn Cottage. A small group of ramblers are heading through the bridge along the towpath towards Llangollen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Llangollen_Canal%2C_Froncysyllte_-_geograph.org.uk_-_1001213.jpg",
      "title": "Stephen McKay / Llangollen Canal, Froncysyllte",
      "caption": "The canal at Froncysyllte. After Pontcysyllte Aqueduct, the canal takes a left turn to continue along the south side of the Vale of Llangollen, with Froncysyllte village immediately ahead. The wide bend here is the turning point for trip boats from Llangollen. The white building is the Aqueduct Inn, temporarily closed on this date pending takeover by a new tenant. Note that light rain is splashing in the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Grazings_beside_the_Llangollen_Canal_-_geograph.org.uk_-_644145.jpg",
      "title": "John Haynes / Grazings beside the Llangollen Canal",
      "caption": "Grazings beside the Llangollen Canal. This stretch of the canal is as it would have been in Telford's day, a \"contour navigation\" cut through the side of a valley with the spoil thrown downhill to support the weight of the water. It is just beautiful on a pleasant summer evening."
    }
  ],
  "distance_km": 79.0,
  "description": "Enjoy a waterside walk or cycle along the Llangollen Canal. The canal runs from Llangollen in Wales to Hurleston Reservoir near Nantwich in Cheshire. You can walk along the canal towpath from start to finish, while cyclists can enjoy the section from Llangollen to Chirk using National Cycle Network routes 85 and 84. This first section starts at the wonderful Horseshoe Falls just to the west of Llangollen. You then head through Llangollen to the wonderful Pontcysyllte Aqueduct where the canal is carried over the valley of the River Dee. The magnificent structure is the longest and highest aqueduct in Britain and a World Heritage Site. There are wonderful views of the Dee Valley and up to the medieval Castell Dinas Bran from this major highlight on the route. You can explore the Aqueduct by clicking on the google street view link below. You continue to Chirk where you will pass the National Trust owned Chirk Castle. The castle has award-winning gardens and a 460 acre estate to explore so is well worth the small detour from the canal. The next section runs to Ellesmere passing Hindford and the pretty Frankton Locks on the way. At Frankton Junction you can pick up the Montgomery Canal which runs to Newton. When you reach Ellesmere you will pass close to the lovely Ellesmere Lake where you can enjoy lakeside and woodland walks. You continue east to Whitchurch passing the delightful Colemere Country Park, the Ellesmere Canal and Bettisfield on the way. The final section runs from Whitchurch to Hurleston passing Marbury (with its series of meres) and Wrenbury .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Corn Mill is a fine canalside pub of some note. The pub is housed in an histroric mill with an interior full of character. There's a jumble of old beams and even a water wheel turning slowly behind the bar. The decks outside are built directly over the mill race and the rapids, and on the opposite bank of the river, steam trains arrive and leave from the restored station. It's a wonderful location and the ideal pit spot on the walk. You can find the pub in Llangollen on Dee Lane with a postcode of LL20 8PN for your sat navs. At the end of the route you'll come to the Nantwich Canal centre where you can visit the Waterside Cafe. The cafe is in a splendid location right next to the canal so you can enjoy your lunch outside and watch the boats go by. It's located on Chester Road at postcode CW5 8LB. The centre also includes the lovely canal basin, some fine wooden sculptures and good facilities with toilets and a shop. In Wrenbury there's the Dusty Miller to try. They have a lovely garden area next to the canal so you can sit outside and enjoy a fine meal with views over the water. The pub is located in a 19th century converted corn mill with many of the original features retained. You can find them on the Cholmondeley Road at a postcode of CW5 8HG for your sat navs. The village itself is also worth exploring with conservation area including a number of historic properties such as an early 16th century church overlooking the pretty village green."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The canal is an excellent place to walk your dog and the Corn Mill pub and Waterside Cafe mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just east of Ellesmere you will pass the Fenns, Whixall and Bettisfield Mosses National Nature Reserve. The reserve straddles the border between England and Wales. It is a significant site being one of the biggest and best raised bogs in Britain. The area is great for flora and fauna and also includes the old Ellesmere Canal. To the south of Llangollen you can visit the worthy villages of Glyn Ceiriog and Llanarmon Dyffryn Ceiriog where you can explore the beautiful Upper Ceiriog Valley. The splendid Berwyn Mountains can also be explored on the North Berwyn Way in this area. The Dee Valley starts/finishes in the town. It will take you west to the settlements of Carrog and Corwen on a challenging waymarked trail."
    }
  ],
  "postcode": "LL20 8BS",
  "district": "Berwyn",
  "county": "Sir Ddinbych - Denbighshire",
  "region": "Wales",
  "country": "Wales",
  "gazetteer_found": true
}