{
  "created_at": "2025-01-06T01:29:33.475909+00:00",
  "objectID": "17e939ffdd82e05dd2b4bcdee9e2454b",
  "ref": "glen-affric-walking-route",
  "title": "Glen Affric Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/40/River_Affric_-_geograph.org.uk_-_1088506.jpg",
  "nearby": [
    {
      "description": "Dog Falls Trail",
      "objectID": "60f48f3ca16103cbfd6c98d7fa3a70e9",
      "ref": "dog-falls-trail-walking-route"
    },
    {
      "description": "Plodda Falls",
      "objectID": "bb3e48483e4ef9f70f059a5b6b9bb788",
      "ref": "plodda-falls-walking-route"
    },
    {
      "description": "Affric Kintail Way",
      "objectID": "d6544e157d17595eb9c87b8811f6635b",
      "ref": "affric-kintail-way-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/17e939ffdd82e05dd2b4bcdee9e2454b.gpx",
  "_geoloc": {
    "lat": 57.2649647703,
    "lng": -4.9845553234
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/River_Affric_-_geograph.org.uk_-_1088506.jpg",
      "title": "Hugh Venables / River Affric",
      "caption": "River Affric. Looking downstream from the bridge near the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Glen_Affric_-_geograph.org.uk_-_1088529.jpg",
      "title": "Hugh Venables / Glen Affric",
      "caption": "Glen Affric view. Looking down the glen. The fence is to keep deer out so the population inside can be controlled to a level that allows the woodland to regenerate. Non-native species are also being removed and plantations of native Scots Pine thinned to enhance the woodland for wildlife. Timber production is continuing but is a secondary priority in this area. This is a good example of the basic tenet behind the phrase \"enhancing biodiversity\", that is \"making best use of a site's characteristics to enhance the native biodiversity of the wider area in a ecologically and economically sustainable manner\". This site has some native ancient woodland (a significant part of the remaining 1% in Scotland) so the best use of the site is to enhance that and build on the populations of native species that exist. This will also enhance tourism. Other areas, with lower existing wildlife value, can be prioritised for timber production."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Coire_Loch_-_geograph.org.uk_-_1088505.jpg",
      "title": "Hugh Venables / Coire Loch",
      "caption": "Coire Loch In Glen Affric. A notable site for dragonflies, especially Azure Hawker."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Track_through_the_Forest_-_geograph.org.uk_-_1088557.jpg",
      "title": "Hugh Venables / Track through the Forest",
      "caption": "Track through the Forest. Running along the south-eastern side of Loch Beinn a' Mheadhoin. Would be great to explore this area with a mountain bike."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Commemorative_cairn_and_viewpoint_-_geograph.org.uk_-_1088535.jpg",
      "title": "Hugh Venables / Commemorative cairn and viewpoint",
      "caption": "Commemorative cairn and viewpoint. Looking up Glen Affric to Sgurr na Lapaich. The cairn commemorates all foresters and custodians of environmental heritage, especially H M Steven."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Loch_an_Amair_-_geograph.org.uk_-_734628.jpg",
      "title": "Hugh Venables / Loch an Amair",
      "caption": "Loch an Amair. Small loch within the woodland on the southern side of the glen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Commemorative_plaque_-_geograph.org.uk_-_1088548.jpg",
      "title": "Hugh Venables / Commemorative plaque",
      "caption": "Commemorative plaque. The Caledonian Forest Tribute text: This plaque was erected by the Forestry Commission and the Institute of Chartered Foresters as a lasting testament to all the foresters and custodians of environmental heritage who worked tirelessly for the restoration and regeneration of the Caledonian Forest. None more so than H M Steven (1893-1969), Professor of Forestry University of Aberdeen and President of the Society of Foresters (1950-51) who visited this place in September 1959. \"My plea is that because these woodlands are a unique heritage, they should be managed to ensure that they will be perpetuated and developed alike for their historical, ecological and practical forestry importance\" Hopefully the forest itself will be a longer lasting testament to their work."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Trees_in_the_river_-_geograph.org.uk_-_1088564.jpg",
      "title": "Hugh Venables / Trees in the river",
      "caption": "Trees in the river. Some sallows have found a spot to grow in the River Affric. A bit exposed but it's working so far."
    }
  ],
  "distance_km": 18.0,
  "description": "Explore this beautiful National Nature Reserve in the Scottish Highlands on this circular walk around Loch Affric. It's a stunning area with lochs, rivers, mountains, pine forest and lots of wildlife to look out for. Keep your eyes peeled for golden eagles, mountain hares and red deer as you make your way through the reserve. The walk starts from the River Affric car park at the eastern end of the loch. The area is managed by the forestry commission who have devised the River Affric walking trail which runs south from the car park on well laid out paths. The short trail gives great views of the rushing waters of the river and Loch Beinn a Mheadhoi. The route then follows the Loch Affric Circuit around the Loch Affric. It's a challenging 11 mile path which climbs high above the loch giving wonderful views over the glen. Along the way you'll pass a series of smaller lochs and majestic towering pine forest. There's also fine views of the mountains of Mullach Fraoch-Choire and Mam Sodhail. To extend your walking in the glen you can head to Plodda Falls where you'll find a spectacular 46 metre high waterfall plunging into the Abhainn Deabhag river. You can also try the Dog Falls Trail at the north eastern end of Loch Beinn a' Mheadhain. The lovely waymarked trail takes you along a series of waterfalls to a fabulous viewpoint overlooking the loch.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails in the forest are ideal for dog walking."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The southern part of the route passes along the Affric Kintail Way. This long distance trail runs from Loch Ness to Morvich via Glen Urquhart and Glen Affric. If you were to follow the trail east it would take you along Loch Beinn a`Mheadhoin to the village of Cannich. Heading west takes you through the Glenaffric Forest to the Kintail Forest and the River Croe."
    }
  ],
  "video_url": "https://www.youtube.com/embed/fB1h13VFyPQ",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Glen Affric Road, Highland, Alba / Scotland, United Kingdom",
  "postcode": null,
  "district": null,
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "forest",
    "waterfall"
  ],
  "points_of_interest": [
    "viewpoints",
    "waterfalls",
    "wildlife"
  ],
  "facilities": [
    "car park",
    "waymarked trail"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}