{
  "created_at": "2025-01-06T04:31:36.817021+00:00",
  "objectID": "17e9010f021f4deca2f2271979cf96c6",
  "ref": "wilstone-reservoir-walking-route",
  "title": "Wilstone Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Wilstone_Reservoir_-_geograph.org.uk_-_129694.jpg",
  "nearby": [
    {
      "description": "Grand Union Canal Walk",
      "objectID": "dae6d837fcdb83dc44e94da2b24b4040",
      "ref": "grand-union-canal-walk-walking-route"
    },
    {
      "description": "Tring Reservoirs",
      "objectID": "fa68832f07583c10caac77a926a2f363",
      "ref": "tring-reservoirs-walking-route"
    },
    {
      "description": "Pitstone Windmill",
      "objectID": "22345e9dcc1d1d342878a58d4f94c9b0",
      "ref": "pitstone-windmill-walking-route"
    },
    {
      "description": "Tring Circular Walk",
      "objectID": "82bec53cc1f7705d51a3bf5965b15fa7",
      "ref": "tring-circular-walk-walking-route"
    },
    {
      "description": "Tring Park",
      "objectID": "675fda18ef31291e750c51fec5fee587",
      "ref": "tring-park-walking-route"
    },
    {
      "description": "Wiggington",
      "objectID": "75f14471bfa9edf310a3aef9e17d8aaa",
      "ref": "wiggington-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/17e9010f021f4deca2f2271979cf96c6.gpx",
  "_geoloc": {
    "lat": 51.8124846134,
    "lng": -0.6901079744
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Wilstone_Reservoir_-_geograph.org.uk_-_129694.jpg",
      "title": "Chris Cole / Wilstone Reservoir",
      "caption": "Wilstone Reservoir. The shelving shoreline seen from the Western extremity of the reservoir, looking South East"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Polygonia_c-album_-_geograph.org.uk_-_1440356.jpg",
      "title": "Chris Reynolds / Comma Butterfly on Burdock, near Wilstone Reservoir",
      "caption": "Comma Butterfly on Burdock, near Wilstone Reservoir. One of many butterflies seen on the verge-side vegetation on the track through a wheat field in early August."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/The_heron_waits_at_Wilstone_-_geograph.org.uk_-_87568.jpg/256px-The_heron_waits_at_Wilstone_-_geograph.org.uk_-_87568.jpg",
      "title": "Rob Farrow / The heron waits at Wilstone",
      "caption": "The heron waits at Wilstone. The reservoir's mix of deep and shallow water, reedbeds and marsh make it a wonderful place for wildlife. Whilst the reservoir is owned by British Waterways, it is managed by Herts and Middlesex Wildlife Trust. Projects to encourage wildlife include cutting the reed beds to stimulate growth, installing floating rafts of gravel to entice terns to nest and retaining grassy banks, favoured by water voles. Around 250 different types of bird have been recorded here including some rare species, like osprey and little egret, which call in to rest and feed on their journeys elsewhere. Willow warblers and sedge warblers are attracted by the reed beds, whilst herons nest in waterside trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Wilstone_Reservoir_%28Information%29_-_geograph.org.uk_-_1413858.jpg",
      "title": "Chris Reynolds / Wilstone Reservoir (Information)",
      "caption": "Wilstone Reservoir (Information). There are five notice boards giving information on Wilstone (and other) reservoirs. Selected Extracts. WATER STORE & WILDLIFE RESERVE: As boat traffic increased on the Grand Union Canal so did the demand for water to refill the locks. By 1802 spring water supplies could no longer keep pace with this demand and so Wilstone Reservoir was constructed. The reservoir was created by building retaining walls to trap water from chalk streams and springs. It was enlarged in 1836 and again in 1839, and today stores around 240 million gallons of water. When this water is needed it is channelled through underground culverts into a 23 metre (75 foot) deep well below Tringford Pumping Station. It is then pumped into the Wendover Arm Canal to flow to Tring Summit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/The_Half_Moon_Public_House%2C_Wilstone_-_geograph.org.uk_-_4963606.jpg/512px-The_Half_Moon_Public_House%2C_Wilstone_-_geograph.org.uk_-_4963606.jpg",
      "title": "The Half Moon Public House, Wilstone by Chris Reynolds, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Half Moon Public House, Wilstone village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/On_the_NW_Bank_looking_East_at_Wilstone_Reservoir_-_geograph.org.uk_-_4757101.jpg/512px-On_the_NW_Bank_looking_East_at_Wilstone_Reservoir_-_geograph.org.uk_-_4757101.jpg",
      "title": "On the NW Bank looking East at Wilstone Reservoir by Chris Reynolds, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "On the NW Bank looking East at Wilstone Reservoir"
    }
  ],
  "distance_km": 5.7,
  "description": "Enjoy a circular walk around Wilstone Reservoir on this pleasant route in Buckinghamshire. The area is a significant wildfowl sanctuary with a huge range of species to look out for. Highlights include great bittern, blackcap, black-headed gull, black-necked grebe, black-tailed godwit, black tern, blue tit, Cetti's warbler, common chiffchaff, corn bunting, common crane, common sandpiper, common scoter, common snipe and Eurasian curlew. The walk starts from the car park on the northern side of the lake, just south of Wilstone village. From here you can pick up footpaths taking you around the water towards Drayton Beauchamp and Little Tring. After rounding the reservoir you can continue north to visit the village and meet with the Grand Union Canal. You can then return to the car park on footpaths around the farmland in Chapel End.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the north there's Wilstone village where you could enjoy some refreshments at the Half Moon. The classic village pub includes a fine interior with an inglenook fireplace, exposed wooden beams and old photographs featuring village scenes and personalities past and present. They serve good food and have a nice garden area for warmer days. You can find them on Tring Road at postcode HP23 4PD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a nice place to walk the dog but it's probably best to keep them on leads with all the wildlife. The Half Moon mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The longer Tring Reservoirs Walk visits the other local lakes in the group. These include Startops End, Marsworth and Tringford just to the east. Just to the east of the lake you'll find a significant local historical site at Pitstone Windmill. The National Trust owned mill dates back to the 17th century and as is Grade II listed. For a small fee you can explore both the inner and outer workings of the mill and learn about the grinding of the flour in the milling process. The climb to the iconic Ivinghoe Beacon also starts from the windmill car park. From here you can enjoy wonderful views over the surrounding area. For more walking ideas in the area see the Chilterns Walks and Buckinghamshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/9KzzkOnNEZU",
  "postcode": "HP23 4NW",
  "district": "Wilstone",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}