{
  "created_at": "2025-01-06T04:09:46.466595+00:00",
  "objectID": "183cadcb76d8e0ba508b40b23241b42c",
  "ref": "golden-cap-estate-walking-route",
  "title": "Golden Cap Estate from Langdon Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Summit_of_Langdon_Hill_-_geograph.org.uk_-_412619.jpg",
  "nearby": [
    {
      "description": "Lyme Regis to Golden Cap",
      "objectID": "bd243ddabd44ddff7a452ea94937c699",
      "ref": "lyme-regis-to-golden-cap-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Golden Cap Walk from Seatown",
      "objectID": "76fe4688567ba30d917cb128fdc05968",
      "ref": "golden-cap-walk-from-seatown-walking-route"
    },
    {
      "description": "Shipton Gorge",
      "objectID": "cdd424fed1ee309107ffda9f18035157",
      "ref": "shipton-gorge-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/183cadcb76d8e0ba508b40b23241b42c.gpx",
  "_geoloc": {
    "lat": 50.7340456653,
    "lng": -2.8344899511
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Summit_of_Langdon_Hill_-_geograph.org.uk_-_412619.jpg",
      "title": "Ray Beer / Summit of Langdon Hill",
      "caption": "Summit of Langdon Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/From_Golden_Cap._-_panoramio.jpg/512px-From_Golden_Cap._-_panoramio.jpg",
      "title": "Bob&Anne Powell, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "From Golden Cap."
    }
  ],
  "distance_km": 5.0,
  "description": "Enjoy miles of beautiful woodland, countryside and coastal walking trails in this stunning section of the Dorset AONB. The Golden Cap Estate is located between Bridport and Charmouth on the Dorset coast. It contains the highest cliffs on the south coast and is part of the Jurassic Coast, a UNESCO World Heritage Site. This walk starts at the Langdon Hill car park near the village of Chideock. You then follow a footpath through the Scots pine and larch woodland on Langdon Hill. It's a nice start to the walk particularly in spring and summer when the woods are covered in bluebells and foxgloves. After leaving the woods you climb towards the high point on Golden Cap which stands at 191 metres (627 ft). It's worth the climb as the views along the coast in both directions are simply wonderful. The route then descends along the South West Coast Path towards Gabriel's mouth and then inland to the ruined medieval St Gabriel's chapel. From here you return to Langdon Hill where a short woodland stretch takes you back to the car park. It's a splendid area with a variety of flora and fauna to enjoy. Look out for rare orchids, wildflowers, haymeadows and unusual fungi in the woodland areas. In the spring and summer you can also see a variety of butterflies while dragonflies can be spotted near the ponds. The estate is located close to the settlements of Lyme Regis and Charmouth. You could reach the site on foot by following our Lyme Regis to Golden Cap Walk which passes the fascinating Charmouth Heritage Centre on the way. Or you could come from the lovely village of Seatown located just to the east of the estate. See the Golden Cap Walk from Seatown for more details.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east there's the climb to Colmers Hill from the picturesque village of Symondsbury. The historic village includes an ancient church and a noteworthy 15th century, thatched pub. Just a couple of miles to the east of Bridport there's the worthy little village of Shipton Gorge where you can enjoy a climb to Shipton Hill and visit the splendid 15th century church of St Martin."
    }
  ],
  "video_url": "https://www.youtube.com/embed/mEc0kCbaR-U",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Langdon Lane, Seatown, Chideock, North Chideock, Dorset, England, DT6 6LB, United Kingdom",
  "postcode": "DT6 6LB",
  "district": "North Chideock",
  "state": "England"
}