{
  "created_at": "2025-01-06T02:26:34.979276+00:00",
  "objectID": "18843dfa08f4ad18c002e5a340c36c12",
  "ref": "dering-woods-walking-route",
  "title": "Dering Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Dering_Wood_-_geograph.org.uk_-_398030.jpg",
  "nearby": [
    {
      "description": "Stour Valley Walk",
      "objectID": "ada7df515b04aaba1bd691eabe995139",
      "ref": "stour-valley-walk-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Pluckley",
      "objectID": "8bcf0b16ad3ce833eadff696bd4898db",
      "ref": "pluckley-walking-route"
    },
    {
      "description": "Biddenden",
      "objectID": "338acbc29afa7c17f8c587d4f3b9b6ff",
      "ref": "biddenden-walking-route"
    },
    {
      "description": "Smarden",
      "objectID": "75c9c465dfd3f642c5c30f49c5817c28",
      "ref": "smarden-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/18843dfa08f4ad18c002e5a340c36c12.gpx",
  "_geoloc": {
    "lat": 51.1705487801,
    "lng": 0.717524457
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Dering_Wood_-_geograph.org.uk_-_398030.jpg",
      "title": "Robin Webster / Dering Wood, via Wikimedia Commons",
      "caption": "Dering Wood. This Woodland Trust wood is open access and has many paths, including waymarked routes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Level_Crossing_near_Dering_Wood_and_Mainey_Wood_-_geograph.org.uk_-_1428042.jpg",
      "title": "David Anstiss / Level Crossing near Dering Wood and Mainey Wood, via Wikimedia Commons",
      "caption": "Level Crossing near Dering Wood and Mainey Wood. This crossing is on a path from Pluckey Road, it leads past Mainey Wood, across the railway heading right to Ashford from Pluckley. Then the path enters the very large Dering Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Path_into_Dering_Wood_-_geograph.org.uk_-_1428116.jpg",
      "title": "David Anstiss / Path into Dering Wood, via Wikimedia Commons",
      "caption": "Path into the woods. This woodland path is on a path from the public footpath from Oaklands Farm to Berry Court, and Pluckley Road. The wood is an open access wood, managed by the Woodland Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Footpath_past_Dering_Wood_-_geograph.org.uk_-_1428109.jpg",
      "title": "David Anstiss / Footpath past Dering Wood, via Wikimedia Commons",
      "caption": "Footpath past Dering Wood. This path leads from Oaklands Farm, past the large wood to Berry Court, and then onto Pluckley Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/A_black_pond%2C_Dering_Wood_-_geograph.org.uk_-_408487.jpg",
      "title": "Robin Webster / A black pond, Dering Wood, via Wikimedia Commons",
      "caption": "A black pond, Dering Wood. This pond looked evilly black, but the yellow scum is merely catkins. In the part of Dering Wood which is not Woodland Trust owned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Dering_Wood_-_main_path_-_geograph.org.uk_-_408477.jpg",
      "title": "Robin Webster / Dering Wood - main path, via Wikimedia Commons",
      "caption": "View of the main waymarked path through the woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/King_George_Star%2C_Dering_Wood_-_geograph.org.uk_-_1430648.jpg",
      "title": "David Anstiss / King George Star, Dering Wood, via Wikimedia Commons",
      "caption": "King George Star. This footpath junction is the meeting of six paths within the wood. King George was a visitor to the wood. The bench on the left is for visitors on the Surrenden Walk, marked by the Woodland Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Coppiced_area_in_Dering_Wood_-_geograph.org.uk_-_1426205.jpg",
      "title": "David Anstiss / Coppiced area in Dering Wood, via Wikimedia Commons",
      "caption": "Coppiced area in Dering Wood. A small area of this large wood, managed by the Woodland Trust has been coppiced."
    }
  ],
  "distance_km": 3.0,
  "description": "These woods near Pluckley are also known as \"Screaming\" wood due to reports of paranormal activity in the area. If you can pluck up the courage there are some nice waymarked walking trails to try in the woods. Start the walk from the car park off Smarden Bell Road. From here you can pick up the trails heading south into the woods. Here you'll find ancient trees with wood anemones and pretty bluebells to see in the spring months. Look out for lots of different types of butterfly fluttering around the flours and nightingales flying through the trees above. As you make your way along the two waymarked trails look out for the King George Star. This footpath junction is the meeting of six paths within the wood and named after King George IV who was a visitor to the wood. There's good scope for continuing your walking in the area. Head east towards Pluckley and you can pick up the Greensand Way and the Stour Valley Walk. These long distance trails are a great way of exploring the surrounding countryside of the Kent Downs AONB. Pluckley train station is also located just to the east and makes an alternative start point if you are coming on public transport.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the west there's the worthy village of Smarden where there's a couple of fine options for post walk refreshment. The Chequers Inn is a 14th-century coaching inn located on The Street in the village centre. This venerable establishment even has its own resident ghost, a Napoleonic War soldier who met a tragic end within its walls. The pub includes a mature garden overlooking the village church and offering a peaceful setting next to a large, lilly-topped carp pond. The pub located at postcode TN27 8QA.In comparison, The Bell on Bell Lane, dating back to 1536, represents a relatively recent addition to Smarden's rich tapestry of history. The village is also well worth exploring with a number of picturesque cottages and a noteworthy church which has been described as the 'Barn of Kent' due to its high scissor beam roof."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods are ideal for a dog walk so you'll probably see other owners on your visit. The Chequers Inn mentioned above is also dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ct7YnZYTT7Y",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Smarden Bell Road, Smarden, Ashford, Kent, England, TN27 0SY, United Kingdom",
  "postcode": "TN27 0SY",
  "district": "Ashford",
  "state": "England"
}