{
  "created_at": "2025-01-06T02:03:07.223714+00:00",
  "objectID": "1886f0c70dfde03cb8b99b19f95c893c",
  "ref": "loch-humphrey-walking-route",
  "title": "Loch Humphrey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Loch_Humphrey_-_geograph.org.uk_-_30703.jpg",
  "nearby": [
    {
      "description": "Forth and Clyde Canal",
      "objectID": "c8d5b3b26a6b05f4901cfed442d6b116",
      "ref": "forth-and-clyde-canal-walking-and-cycle-route"
    },
    {
      "description": "Burncrooks Reservoir",
      "objectID": "569fa0a354226338cc8d1e5c735e0fce",
      "ref": "burncrooks-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1886f0c70dfde03cb8b99b19f95c893c.gpx",
  "_geoloc": {
    "lat": 55.9511820445,
    "lng": -4.4628557718
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Loch_Humphrey_-_geograph.org.uk_-_30703.jpg",
      "title": "Richard Webb / Loch Humphrey",
      "caption": "Taken from northeastern shores of Loch Humphrey. Looking north across the square towards the volcanic plugs west of Duncolm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Track_to_Loch_Humphrey_-_geograph.org.uk_-_284697.jpg",
      "title": "Chris Upson / Track to Loch Humphrey",
      "caption": "Joggers making their way along the track to Loch Humphrey. With some fine views overlooking the Clyde Estuary and Erskine Bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Sheepfold_near_Loch_Humphrey_-_geograph.org.uk_-_991509.jpg",
      "title": "Lairich Rig / Sheepfold near Loch Humphrey",
      "caption": "This sheepfold lies a little off the footpath that leads to Loch Humphrey, and is not seen very well from that path; to see it properly, it is necessary to scramble up a neighbouring slope. The photo shows the gate of the outer enclosure, with the inner enclosure visible in the background. The hills in the background lie on the other side of the River Clyde."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Stile_beside_Loch_Humphrey_-_geograph.org.uk_-_1335294.jpg",
      "title": "Lairich Rig / Stile beside Loch Humphrey",
      "caption": "Stile beside the loch. From the western end of Loch Humphrey, there is a short resurfaced track that leads partway along the southern shore. After that, the original narrow footpath closely follows the remainder of the southern shore (which is visible in this photo behind the stile); the path ends at the stile, since, after that point, the terrain is level grassland that is easy to cross, and there is therefore no particular need for a footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/View_across_Loch_Humphrey_-_geograph.org.uk_-_830855.jpg",
      "title": "Stephen Sweeney / View across Loch Humphrey",
      "caption": "View across the loch from the west. The small \"island\" in the loch can be seen to the right of the centre of the image."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/The_western_end_of_Loch_Humphrey_-_geograph.org.uk_-_961058.jpg",
      "title": "Lairich Rig / The western end of Loch Humphrey",
      "caption": "The western end of the loch. It is possible to reach this point from the west; a footpath from the Black Linn (a reservoir) passes Greenland Reservoir Number 1 before leading here. A footpath continues from this point, following the southern shoreline. The ground at the western tip of Loch Humphrey Reservoir is extremely marshy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Path_beside_southern_shore_of_Loch_Humphrey_-_geograph.org.uk_-_1335247.jpg",
      "title": "Lairich Rig / Path beside southern shore of Loch Humphrey",
      "caption": "Path beside southern shore. At the end of March 2009, several footpaths in the area were improved, including a section that extends from the western end of the loch to the point from which this photo was taken (this is also the point at which the path emerges from the woods). From here on, the original footpath continues along the shore towards a stile."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Tongue_of_land_reaching_into_Loch_Humphrey_-_geograph.org.uk_-_961037.jpg",
      "title": "Lairich Rig / Tongue of land reaching into Loch Humphrey",
      "caption": "Tongue of land reaching into the loch. This strip of land is barely attached (by means of a patch of often marshy ground) to the shoreline."
    }
  ],
  "distance_km": 2.5,
  "description": "Enjoy a walk along the pretty Loch Humphrey on this walk in the Kilpatrick Hills. The loch is a very peaceful place for a walk with fine views of the surrounding hills and the nearby Clyde Estuary. There's also some woodland trails on the southern side of the water and a series of smaller lochs nearby. You can find the loch a few miles north east of Dumbarton, near to Duncolm and Clydebank. The loch is also a popular spot for Perch fishing and occasional trout by members of the Bearsden Angling Club, who have a boat and a boatshed at the loch.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At nearby Bowling Harbour there's a nice cafe and the The Bay Inn. The pub can be found at postcode G60 5AQ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east of the reservoir there's Greenside Reservoir, Cochno Loch, Jaw Reservoir and Kilmannan Reservoir to visit. Near here there's also the Burncrooks Reservoir Walk which visits the unusual narrow chasm at the Whangie before heading to the pretty reservoir. Just north of the reservoir there's also something of a hidden gem at the Devil's Pulpit in Finnich Glen. There's a wonderful deep sandstone gorge and rushing waterfall to see in this geologically fascinating area. Head south of the loch to Bowling and there's some nice trails along the River Clyde. You can also visit Bowling Harbour where there's nice walks along the canal. See the Forth and Clyde Canal Walk page for more details."
    }
  ],
  "video_url": "https://www.youtube.com/embed/OGNHkPO-tRg",
  "county": "West Dunbartonshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Sauchen Braes, West Dunbartonshire, Alba / Scotland, G60 5NH, United Kingdom",
  "postcode": "G60 5NH",
  "district": null,
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "views",
    "lakes"
  ],
  "facilities": [
    "boat access",
    "fishing"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}