{
  "objectID": "188f92ffe1e90c096bbfef13efae864b",
  "created_at": "2024-12-18T01:35:52.470903+00:00",
  "ref": "addington-hills-walking-route",
  "title": "Addington Hills Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Addington_Hills_-_Viewpoint_-_geograph.org.uk_-_1357664.jpg",
  "nearby": [
    {
      "description": "Croham Hurst",
      "objectID": "a28a4cf56ee79b86530bc71e9b366869",
      "ref": "croham-hurst-walking-route"
    },
    {
      "description": "Selsdon Wood",
      "objectID": "01ccbdb1232cbeda6c5c9a8881a4c81f",
      "ref": "selsdon-wood-walking-route"
    },
    {
      "description": "London Loop",
      "objectID": "2b405d14b22f13eb43479ae8a57645c7",
      "ref": "london-loop-walking-route"
    },
    {
      "description": "Vanguard Way",
      "objectID": "d526829c942476c5ae331b2b89b7b812",
      "ref": "vanguard-way-walking-route"
    },
    {
      "description": "Hayes Common",
      "objectID": "569ed3abd77beb78a0b69aa433e2b599",
      "ref": "hayes-common-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/5F1606EEF9FF257380258073004B8466/$FILE/Addington Hills.gpx",
  "_geoloc": {
    "lat": 51.3617495305,
    "lng": -0.0570562586
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Addington_Hills_-_Viewpoint_-_geograph.org.uk_-_1357664.jpg",
      "title": "Peter Trimming / Addington Hills - Viewpoint, via Wikimedia Commons",
      "caption": "Addington Hills - Viewpoint. In this view we are looking to the north-west, and the distant hills are at least 20 miles away. The viewpoint gives views through a 90 degree arc from the Millennium Dome (O2 Arena) near Greenwich to the offices of Central Croydon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/View_From_Addington_Hills_%287%29_-_geograph.org.uk_-_1357579.jpg",
      "title": "Peter Trimming / View From Addington Hills (7), via Wikimedia Commons",
      "caption": "Looking towards the offices of South Croydon to the left of picture, and Central Croydon to the right of picture. This series of 7 pictures was taken from the viewpoint on the top of Addington Hills. 50 years ago, this area seemed better known as Shirley Hills. The viewpoint is a short walk from the car park, which also serves a Chinese restaurant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/View_From_Addington_Hills_%285%29_-_geograph.org.uk_-_1357538.jpg",
      "title": "Peter Trimming / View From Addington Hills (5), via Wikimedia Commons",
      "caption": "Towards the right of picture, and just visible above the skyline, is the arch of Wembley Stadium, 15 miles away. On the extreme left of picture, and a mere 2.5 miles away, are the offices and flats at West Croydon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/View_From_Addington_Hills_%286%29_-_geograph.org.uk_-_1357556.jpg",
      "title": "Peter Trimming / View From Addington Hills (6), via Wikimedia Commons",
      "caption": "On the extreme left of picture are the offices of Central Croydon. Towards the centre of picture are the offices and flats at West Croydon, 2.5 miles away. The hills in the far distance are at least 20 miles away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/View_From_Addington_Hills_%283%29_-_geograph.org.uk_-_1357506.jpg",
      "title": "Peter Trimming / View From Addington Hills (3), via Wikimedia Commons",
      "caption": "Looking towards Crystal Palace, and the two television transmitters, some 4 miles away. The BBC transmitter is on the right, ITV on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/View_From_Addington_Hills_%281%29_-_geograph.org.uk_-_1357450.jpg",
      "title": "Peter Trimming / View From Addington Hills (1), via Wikimedia Commons",
      "caption": "Just below the skyline, in the centre of picture, is the Millennium Dome (O2 Arena). To the left are the offices at Canary Wharf, some 9 miles away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/View_From_Addington_Hills_%282%29_-_geograph.org.uk_-_1357469.jpg",
      "title": "Peter Trimming / View From Addington Hills (2), via Wikimedia Commons",
      "caption": "To the right of picture are the offices at Canary Wharf, some 9 miles away. Towards the left of picture, the tops of the offices in the City of London can just be seen above the skyline; also 9 miles away. On the extreme left of picture is one of the television transmitters at Crystal Palace, a mere 4 miles away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Claydon_Brook_near_Addington_2_-_geograph.org.uk_-_491480.jpg",
      "title": "Andy Gryce / Claydon Brook near Addington 2, via Wikimedia Commons",
      "caption": "Claydon Brook near Addington. This is Claydon Brook where it is crossed by the footpath between Claydon Hill Farm and Addington, which is on the Cross Bucks Way. In this view looking south-east, the brook flows towards the camera, with a wood on the west bank. The brook drains a large area from Botolph Claydon in the west, to Oving and Whitchurch in the south, and Mursley in the east, a distance east-west of about 10km."
    }
  ],
  "distance_km": 1.5,
  "description": "Climb to this viewpoint in Croydon and enjoy great views across the City of London and the North Downs. You can park at the Addington Hills car park in Upper Shirley and pick up the footpaths from there. It's a short climb to the viewpoint where you can enjoy far reaching views towards Parliament Hill and Docklands. There's 130 acres to explore in the park with woodland and London's largest area of heathland to enjoy. It's great for flora and fauna with bell heather, gorse, marsh violet, common lizards and green woodpeckers to look out for. The London Loop passes through the park so you can pick this up to continue your walking. If you head east you'll come to the Addington Golf Course, Threehalfpenny Wood, Coney Hall and Keston Common and Hayes Common . Heading south will take you to Littleheath Woods and Selsdon Wood where there is a nature reserve with lots of wildlife, ponds, open meadows and miles of waymarked walking trails. Just to the west is Croham Hurst Woods where you'll find ancient woodland and a climb to Breackneck Hill. Croydon is also just a short walk along the Vanguard Way . To visit the park by tram you can get off at the Coombe Road tram stop.",
  "video_url": "https://www.youtube.com/embed/KAibWvH-j2g",
  "district": "London",
  "county": "Greater London",
  "region": "London",
  "country": "England"
}