{
  "created_at": "2025-01-06T01:47:55.848373+00:00",
  "objectID": "18c4cf55c83e7ffba9304cae6ef1d75b",
  "ref": "quainton-hill-walking-route",
  "title": "Quainton Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/69/Quainton_Windmill_-_geograph.org.uk_-_1280043.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/18c4cf55c83e7ffba9304cae6ef1d75b.gpx",
  "_geoloc": {
    "lat": 51.8739308998,
    "lng": -0.9168159051
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Quainton_Windmill_-_geograph.org.uk_-_1280043.jpg",
      "title": "Andy Gryce / Quainton Windmill",
      "caption": "Quainton Windmill. Looking north from Church Street at the top of The Green in Quainton, the top of Quainton Windmill can be seen behind a cottage. The tower windmill, built in 1832, is the highest in Buckinghamshire at 75ft 8in, which was made necessary apparently by the strange requirement that it was built in the lee of Quainton Hill. The top of the hill at 148m is 300m beyond the windmill. The mill was abandoned in 1881, but ongoing restoration work since 1970 by volunteers has restored the mill to working order."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/The_Green%2C_Quainton_-_geograph.org.uk_-_436572.jpg",
      "title": "Andy Gryce / The Green, Quainton",
      "caption": "This view is from the top of The Green in Quainton which slopes south, with the famous windmill and stone cross behind the camera, to Lower Street at the bottom. On the east side of the green - just left of centre in the photograph - is the George & Dragon inn, with tables outside. The green originally had a pond, stocks and animal pound, but these have long since gone. Quainton is one of Buckinghamshire's ancient villages. It has a Roman road as a parish boundary and was given its name following the Anglo-Saxon invasion of this part of the country around 613AD. The name of Quainton derives from two Old English words - 'cwen', meaning queen, and 'tun' meaning farm - that is an estate of one of the Anglo-Saxon regional queens. Quainton has a population of about 1,260, compared with 1880 in 1900, when half of the principal householders listed their occupations as farmer or farm labourer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Plaque%2C_Almshouses%2C_Church_Street%2C_Quainton_-_geograph.org.uk_-_435722.jpg",
      "title": "Andy Gryce / Plaque, Almshouses, Church Street, Quainton",
      "caption": "Plaque on Winwood Almshouses, Church Street. Plaques with identical inscriptions have been placed above each of the two entrances to the almshouses. Each plaque reads 'Anno Dom 1687. These almeshouses were then erected and endow'd by Richard Winwood Esq, son and heir of The Right Hon Sir Ralph Winwood Knt, Principal Secretary of State to King James The First'. This plaque is above the eastern or left hand entrance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Quainton_Hill_-_geograph.org.uk_-_658784.jpg",
      "title": "Andrew Smith / Quainton Hill",
      "caption": "The top of the hill, at an altitude of 187 metres, is crowned with a telecommunications mast, covered reservoir and trig point. Also in view here is a large stack of straw bales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Quainton_and_Simber_Hill_with_Grange_Hill_on_right_-_geograph.org.uk_-_118699.jpg",
      "title": "Pip Rolls / Quainton and Simber Hill with Grange Hill on right",
      "caption": "Quainton and Simber Hill with Grange Hill on right. The undulations at the top of the hill are the result of stone quarrying."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Quainton_Hill_-_geograph.org.uk_-_658837.jpg",
      "title": "Andrew Smith / Quainton Hill",
      "caption": "Looking east across the northern slopes of the hill with North Marston in the background. The hill is capped with limestone so it is not surprising to see signs of former quarrying."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Quainton_Memorial_Hall%2C_Station_Road%2C_Quainton_-_geograph.org.uk_-_435733.jpg",
      "title": "Andy Gryce / Quainton Memorial Hall, Station Road, Quainton",
      "caption": "This modern village hall, which is about 100m from The Green, the centre of Quainton, was opened in October 2005, the cost being met by public subscriptions, fund raising events, and grants from numerous charities including £196,700 from the National Lottery Community Fund. This building replaced the original Memorial Hall which opened in 1924 on the same site, and which was built in remembrance to the 23 men of Quainton lost in the 1914-18 war. In the 1939-45 war, a further 3 men were lost. The hall remains a memorial to those who died in military service, and the commemoration plaques have been re-instated in the new building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Almshouses%2C_Church_Street%2C_Quainton_-_geograph.org.uk_-_435713.jpg",
      "title": "Andy Gryce / Almshouses, Church Street, Quainton",
      "caption": "Almshouses, Church Street. These almshouses are close by the 14th century church of St Mary & Holy Cross, which can be seen in the background. A plaque over both entrances, one of which can be seen in this view says 'Anno Dom 1687. These almeshouses were then erected and endow'd by Richard Winwood Esq, son and heir of The Right Hon Sir Ralph Winwood Knt, Principal Secretary of State to King James The First'. The will of Richard Winwood, who died in 1688, gave 'the sum of 200 l [£] to build eight alms-houses at this place for four widowers and four widows, and endowed them with lands in the parish for the payment of two shillings weekley to each, and providing them with gowns &c'. Buckinghamshire County Council records has a photograph of the almshouses in 1904."
    }
  ],
  "distance_km": 3.4,
  "description": "This circular walk climbs to Quainton Hill from the Buckinghamshire village of Quainton. It's a very pretty village with a well known old windmill, a picturesque village green, a 14th century church, a row of 17th century almshouses and a rather fine 1700s pub to visit after your exercise. The hill lies just to the north of the settlement and makes for a fine walk and viewpoint. The walk starts in the village where you can pick up the North Bucks Way and the Midshires Way. Follow the waymarked footpath north past the windmill and it will take you past Simber Hill before coming to Quainton Hill which stands at a height of 187 metres. There's some fine views over the surrounding Buckinghamshire countryside from this vantage point. The route then descends to the south passing Denham Lees before returning to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to The George and Dragon for some post walk refreshments. The 18th century pub has a charming interior with a quarry tiled floor, inglenook fireplaces and beams. Outside there's a nice garden area overlooking the village green and windmill. You can find them next to the green at postcode HP22 4AR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and the country trails are great for a dog walk. The George and Dragon mentioned above is dog friendly too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you can explore the lovely grounds of Waddesdon Manor. You can pick up the Bernwood Jubilee Way, Aylesbury Ring, Midshires Way, the Tramway Trail and the Waddesdon Greenway cycling and walking trail here too. A few miles south west of the village you can visit an interesting local historical site on the Brill Windmill Walk. The 17th century mill is one of the earliest and best preserved examples of a post mill in the whole of the UK. Another nice idea is to follow the Bernwood Jubilee Way south to link up with the Thame Valley Walk at Eythrope Park. There's lovely trails to be found here along the scenic River Thame. In this area you can also pick up the circular Haddenham Walk which uses part of the Aylesbury Ring and the Thame Valley Walk to visit Dinton, Nether Winchendon and Cuddington. The route starts from Haddenham where there's a pretty duck pond, a fine old church and quaint thatched cottages to see. For more walking ideas in the area see the Chilterns Walks and the Buckinghamshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/HAZcThG38qw",
  "district": "Quainton",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Strand, Quainton, Buckinghamshire, England, HP22 4AS, United Kingdom",
  "postcode": "HP22 4AS",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "pub/cafe",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}