{
  "created_at": "2025-01-06T00:29:46.675489+00:00",
  "objectID": "1938aabe055c1f51548f641b2e70b06e",
  "ref": "bredon-hill-walking-route",
  "title": "Bredon Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Parson%27s_Folly_on_Bredon_Hill_-_geograph.org.uk_-_301495.jpg",
  "nearby": [
    {
      "description": "Wychavon Way",
      "objectID": "098eca580895bbbf6dcdadde38f1c351",
      "ref": "wychavon-way-walking-route"
    },
    {
      "description": "Elmley Castle",
      "objectID": "3de9c2fab4b85e41c173b00deff2140c",
      "ref": "elmley-castle-walking-route"
    },
    {
      "description": "Ashton Under Hill",
      "objectID": "8b7d86a3c00dfafad03e3b9733cf7f88",
      "ref": "ashton-under-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1938aabe055c1f51548f641b2e70b06e.gpx",
  "_geoloc": {
    "lat": 52.0385971331,
    "lng": -2.0600540764
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Parson%27s_Folly_on_Bredon_Hill_-_geograph.org.uk_-_301495.jpg",
      "title": "Bob Embleton / Parson's Folly on Bredon Hill, via Wikimedia Commons",
      "caption": "Parson's Folly on Bredon Hill. Built so that the top of the tower was to be exactly 1,000 feet above \"sea level\". As can be seen the tower is used as a communications building. A satellite dish adorns the north face and a second is planned."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Holcomb_Nap%2C_Bredon_Hill_-_geograph.org.uk_-_759543.jpg",
      "title": "Philip Halling / Holcomb Nap, Bredon Hill, via Wikimedia Commons",
      "caption": "Holcomb Nap, Bredon Hill. Holcomb Nap viewed from the Wychavon Way above Ashton-under-Hill. The trig point can be seen in the middle of a field in front of the wood. The woodlands on Bredon Hill are predominantly composed of ancient trees, including oak and ash, providing a habitat for numerous invertebrate species. Notably, the area is home to the violet click beetle (Limoniscus violaceus), a rare species associated with decaying timber in ancient trees. The scrub and understorey vegetation are largely dominated by hawthorn, with occasional occurrences of elder, sloe, and willow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Bridleway_on_Bredon_Hill_-_geograph.org.uk_-_524994.jpg",
      "title": "Philip Halling / Bridleway on Bredon Hill, via Wikimedia Commons",
      "caption": "Bridleway on Bredon Hill. This bridleway forms path of the Wychavon Way, a 40 miles LDP from Holt Fleet near Ombersley to Winchcombe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Track_up_Bredon_Hill_-_geograph.org.uk_-_301079.jpg",
      "title": "Bob Embleton / Track up Bredon Hill, via Wikimedia Commons",
      "caption": "Track up Bredon Hill. Gentle climb up from where the road from Westmancote turns into a farm track. The wide flat area ahead showed no signs of occupation. It may be natural. Birdlife is abundant on Bredon Hill, with species such as the common redstart, tree pipit, garden warbler, and spotted flycatcher arriving in spring to breed. Other common breeders include the yellowhammer, meadow pipit, and Eurasian skylark. During autumn migration, species like the ring ouzel can be observed, and rarer sightings have included the hawfinch and snow bunting."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/The_Banbury_Stone%2C_Bredon_Hill_-_geograph.org.uk_-_1336449.jpg",
      "title": "Philip Halling / The Banbury Stone, Bredon Hill",
      "caption": "The Banbury Stone. The distinctive stone is located in a hollow below Parsons Folly near the summit of the hill. This stone is also known as the 'Elephant Stone' and seen here in evening sun the resemblence to an elephant is quite remarkable."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Toposcope_on_Bredon_Hill_-_geograph.org.uk_-_300626.jpg",
      "title": "Bob Embleton / Toposcope on Bredon Hill",
      "caption": "A group of walker investigate the Toposcope on top of the hill. The toposcope plate is inscribed \"THE RAMBLERS 1935 - 1995\". In the distance is Parsons Folly. Lots of towns marked and the main hills etched on the disc are (clockwise from north with distances in miles) Meon Hill 14, Broadway Tower 10, Cleeve Hill 9, May Hill 21, Skirrid Fawr 42, Sugar Loaf 49, Brecknock Beacon 60, Midsummer Hill 12, Herefordshire Beacon 13, Worcestershire Beacon 12, Clee Hill 33, Clent Hill 25."
    }
  ],
  "distance_km": 7.5,
  "description": "Climb to the 299 m (981 ft) summit of this hill in the Cotswolds and enjoy fine views over the surrounding countryside. The walk starts from the Worcestershire village of Overbury and climbs to Bredon Hill on good footpaths, passing woodland and streams on the way. At the summit you will find the Iron Age Hill Fort of Kemerton Camp and a small stone tower known as Parsons Folly or Banbury Stone Tower. There's also Roman earthworks and several ancient standing stones. The hill is also a nature reserve so there is a wide variety of flora and fauna to look out for. This includes wild thyme, common rock rose, pyramidal orchid and dwarf thistle. These attract butterflies such as marbled white, brown argus and dingy skipper. Bredon hill is mentioned in a poem of A. E. Housman's anthology A Shropshire Lad: 'In summertime on Bredon, The bells they sound so clear, Round both the shires they ring them, In steeples far and near, A happy noise to hear.' The whole of this circular walk is more suited for walkers as it uses some public footpaths but much of it uses bridleways which cyclists can also use. The Wychavon Way long distance footpath passes close to the hill so you could pick this up to extend your walking. An alternative circular walk to the hill is to follow the Wychavon Way from the nearby village of Ashton Under Hill before visiting nearby Elmley Castle .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Elmley Castle and there's a historic pub to visit in the shape of the Queen Elizabeth Inn. It's a pub of some note, dating from the 16th century and named after the famous monarch who is reputed to have stayed there. According to local legend Elizabeth I was presented with a hat on her arrival in the village on the road from the nearby town of Pershore. It is thought the Queen and her entourage stayed for two nights as guests of William Savage. They have a lovely interior with timber beams, an original flagstone floor and a roaring log fire in the winter. Outside there's a patio and a small garden area for warmer days. They do high quality food and can be found at Main Street with a postcode of WR10 3HS for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The hill can also be reached from the north from the village of Elmley Castle. Country lanes and footpaths will take you past Comberton Wood and Castle Hill to Bredon Hill with more details on the Elmley Castle Walk page. The village itself is well worth a vist too. It's one of the prettiest in the county and includes delightul old cottages, a village pond and an historic church dating from the 12th century. To the south is the worthy village of Kemerton where there are two wildlife rich nature reserves to explore. The village is very pretty with the 16th century Kemerton Court and a Grade II listed church to see as well. For more walking ideas in the area see the Cotswolds Walks and Worcestershire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tEF4qjp96xU",
  "postcode": "GL20 7PE",
  "district": "Wychavon",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Woodlands, Overbury, Wychavon, Worcestershire, England, GL20 7PE, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}