{
  "created_at": "2025-01-06T02:50:00.427083+00:00",
  "objectID": "193e59a0622066affe2e1d4deaff31ff",
  "ref": "whittington-walking-route",
  "title": "Whittington Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Whittington_Castle_-_geograph.org.uk_-_558764.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/193e59a0622066affe2e1d4deaff31ff.gpx",
  "_geoloc": {
    "lat": 52.874238537,
    "lng": -3.0030977323
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Whittington_Castle_-_geograph.org.uk_-_558764.jpg",
      "title": "Peter Craine / Whittington Castle",
      "caption": "Whittington Castle. The gatehouse shown here is only 200 years old, but the fortifications were started about 500 BC and a stockade was built in the 7th century AD. The castle was rebuilt in stone in 1221 AD by the Fitz-Warin family (who may have been partly the inspiration for the Robin Hood Stories). Although only a few parts of the castle remain, the site is charismatic and beautiful, especially after a recent facelift aided by a large lottery grant. It is worth seeing lit up at night."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Whittington_-_castle_moat_-_geograph.org.uk_-_2334182.jpg",
      "title": "Whittington - castle moat by Eirian Evans, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The moat"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Looking_north_up_Castle_Street%2C_Whittington_-_geograph.org.uk_-_2334206.jpg",
      "title": "Looking north up Castle Street, Whittington by Eirian Evans, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Looking north up Castle Street, Whittington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/%27Ye_Olde_Boote_Inn%27_at_Whittington_-_geograph.org.uk_-_1027760.jpg",
      "title": "Row17 / 'Ye Olde Boote Inn' at Whittington",
      "caption": "Ye Olde Boote Inn at Whittington"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Maestermyn_Marine_-_geograph.org.uk_-_1006537.jpg",
      "title": "Stephen McKay / Maestermyn Marine",
      "caption": "Maestermyn Marina. Just west of Maestermyn Bridge is this boatyard operating a fleet of hire boats and offering a range of services to boaters."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Montgomery_Canal%2C_Frankton_Locks_-_geograph.org.uk_-_130746.jpg",
      "title": "Pierre Terre / Montgomery Canal, Frankton Locks",
      "caption": "Montgomery Canal, Frankton Locks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Montgomery_Canal_at_Frankton_Junction_-_geograph.org.uk_-_551956.jpg",
      "title": "Penny Mayes / Montgomery Canal at Frankton Junction",
      "caption": "Montgomery Canal at Frankton Junction. The Montgomery Canal, which joins the Llangollen Canal, was originally the main line, while the Llangollen section was a water feeder. Navigation on the Montgomery Canal became impossible after a very serious breach occurred in 1936 and it has remained closed ever since, but is now being restored and one day will be navigable again. The Montgomery Canal falls through the still-derelict Frankton Locks from this junction."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Graham_Palmer_Lock%2C_Montgomery_Canal_-_geograph.org.uk_-_1002720.jpg",
      "title": "Stephen McKay / Graham Palmer Lock, Montgomery Canal",
      "caption": "Graham Palmer Lock, Montgomery Canal. This shallow lock was not part of the canal's original infrastructure but had to be built as part of the restoration project to compensate for ground subsidence. It is named after Graham Palmer, founder of the Waterway Recovery Group, who worked tirelessly to restore the canal."
    }
  ],
  "distance_km": 17.0,
  "description": "This Shropshire village near Oswestry has a historic moated castle and some fine canalside trails to try nearby. There's also an ancient 16th century inn to rest and relax in afterwards. This circular walk from the village visits the castle before heading into the countryside to meet with the Llangollen Canal and Montgomery Canal branches of the Shropshire Union Canal. The photogenic 13th century castle includes a moat and 12 acres of lovely grounds. It's a lovely place for a stroll with meadows, flowers, picnic lawns and a variety of waterfowl to see. The route starts in the village and first explores the castle grounds. You then follow footpaths north to Fern Lees and Hindford where you meet up with the Llangollen Canal. Follow the towpath east and it will take you to Paddock Bridge, Pollett's Bridge and the pretty Maestermyn Marina. You continue to Lower Frankton where you meet with the Montgomery Canal, following it south past Frankton Locks to Keeper's Bridge. Here you leave the canal and head west to Middleton before turning north to return to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village head to Ye Olde Boot Inn for some refreshments after your walk. The 16th century pub is located in a fine spot opposite the castle and moat. You can find them at postcode SY11 4DF for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and canal side trails make for a fine dog walk. The castle grounds are also dog friendly, though you are asked to please keep them on leads."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ujYat2ufUU4",
  "district": "Whittington",
  "county": "Shropshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Street, Whittington, Shropshire, England, SY11 4DT, United Kingdom",
  "postcode": "SY11 4DT",
  "state": "England"
}