{
  "created_at": "2025-01-06T08:37:14.988100+00:00",
  "objectID": "194625dc6c0829f6ced66369d74d3b1a",
  "ref": "the-roaches-walking-route",
  "title": "The Roaches Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Rock_climber_on_The_Roaches_-_geograph.org.uk_-_906629.jpg",
  "nearby": [
    {
      "description": "Tittesworth Reservoir",
      "objectID": "907d7e43fecb632bad6ec80f0e68e09f",
      "ref": "tittesworth-reservoir-walking-route"
    },
    {
      "description": "Lud's Church",
      "objectID": "9bac060ba17e107bdca38060132daa54",
      "ref": "luds-church-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/194625dc6c0829f6ced66369d74d3b1a.gpx",
  "_geoloc": {
    "lat": 53.1560823756,
    "lng": -1.9940897815
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Rock_climber_on_The_Roaches_-_geograph.org.uk_-_906629.jpg",
      "title": "Bob Jones / Rock climber on The Roaches, via Wikimedia Commons",
      "caption": "Rock climber on The Roaches. This climber is feeding a line down to his colleague below, who is about to make the vertical ascent to this rock outcrop."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Doxey_Pool%2C_The_Roaches_-_geograph.org.uk_-_680750.jpg",
      "title": "michael ely / Doxey Pool, The Roaches, via Wikimedia Commons",
      "caption": "Doxey Pool. Situated on the line of the footpath that runs along the gritstone edge. Legend has it that it is home to a mermaid who seduces young men to a watery grave."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Summit_of_the_Roaches_-_geograph.org.uk_-_1586692.jpg",
      "title": "ron layters / Summit of the Roaches, via Wikimedia Commons",
      "caption": "The summit trig point on an autumn day"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Paved_path_on_the_Roaches_-_geograph.org.uk_-_852839.jpg",
      "title": "Raymond Knapman / Paved path on the Roaches, via Wikimedia Commons",
      "caption": "Paved path on the ridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Gritstone_boulders_beneath_the_Roaches_-_geograph.org.uk_-_210917.jpg",
      "title": "Espresso Addict / Gritstone boulders beneath the Roaches, via Wikimedia Commons",
      "caption": "Gritstone boulders beneath the ridge. The pastureland below the gritstone edges of the Roaches and Five Clouds retains occasional exposed gritstone boulders, shown here among the roots of a stand of trees"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/Rock_outcrops_on_The_Roaches_-_geograph.org.uk_-_906625.jpg",
      "title": "Bob Jones / Rock outcrops on The Roaches, via Wikimedia Commons",
      "caption": "Rock outcrops. Looking out across the Dane Valley from the path leading to the summit"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Five_Clouds_from_The_Roaches_-_geograph.org.uk_-_906642.jpg",
      "title": "Bob Jones / Five Clouds from The Roaches, via Wikimedia Commons",
      "caption": "Five Clouds from the hill. There are two distinct levels; one about 100 metres below the viewpoint. This is known as Five Clouds and from the road below, only the lower level is visible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Hen_Cloud_from_The_Roaches_-_geograph.org.uk_-_1170027.jpg",
      "title": "Wayne Molyneux / Hen Cloud from The Roaches, via Wikimedia Commons",
      "caption": "Hen Cloud from The Roaches"
    }
  ],
  "distance_km": 5.5,
  "description": "This circular walk is one of the most popular in the Peak District and a favourite for many. It runs along an elevated rocky ridge, with fascinating rock formations and wonderful views of the surrounding countrsyide and the nearby Tittesworth Reservoir. Ridge walking is always a joy but this one is something special. Highlights include a series of weathered gritstone boulders and the mystical Doxy Pool. The pool is said to be inhabited by a malicious water spirit which drags victims into the depths. The area is also great for unusual wildlife. In the 1930s five Australian Bennett's wallabies were released into the wild from a private collection. A small colony is believed to continue to live around the area with occasional sightings. The circular walk starts from the roadside parking area on Roach Road (ST13 8UA). You will see a gate and information board on the eastern side of the road where you can pick up the nice path up to the ridge. The path runs north past the Doxy Pool to the high point on the ridge at 505 m (1,657 ft). You descend to Bearstone Rock where you turn south and follow the Roach Road back to the car park. If you'd like to continue you walking in the area then you can head to the southern end of the escarpment and enjoy a climb to the distinctive Hen Cloud. There is also a super circular route around Tittesworth Reservoir just over a mile from the start of the Roaches walk. Just off the northern top of this route you will find the fascinating deep rocky chasm of Lud's Church. The geologically fascinating area is well worth a short detour if you have time. Also nearby is the wonderful Three Shires Head where the counties of Cheshire, Derbyshire and Staffordshire meet. The area includes a series of pretty waterfalls on the River Dane.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a few good options for some post walk refreshments near the ridge, in the Upper Hulme area. The Winking Man is a family friendly country pub with a nice outdoor seating area to relax in on warmer days. There's a good menu and a nice large car park with electric hook up points. You can find the pub just to the east of the ridge on Buxton Rd, Upper Hulme with a postcode of ST13 8UH. The delightful Roaches Tea Rooms are located near the car park at the start of the route. They are wonderfully located nesting on the hillside of the ridge, some 300 metres above sea level with breathtaking views stretching over the valley. There's a splendid outside patio seating which includes a pretty herb garden. They also have a couple of nice holiday cottages if you are looking for accommodation. You can find the tea rooms at Paddock Farm, Roach Road, with a postcode of ST13 8TY for your sat navs. Just to the west near Tittesworth Reservoir there's the Lazy Trout. It's a nice place to go if you'd like to combine a visit to the ridge with a visit to the reservoir. It's full of character and has a nice big garden area as well. You can find it at postcode ST13 8SN. To the south there's the village of Blackshaw Moor and The Three Horseshoes. The high quality inn includes beautiful gardens, a patio, and stunning views over the Roaches and surrounding countryside. The pub was named by CAMRA in 2019 as having one of the top ten beer gardens in the UK. The interior is charming too with oak beams and open fires for colder days. You can find them on the Buxton Road at postcode ST13 8TW for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The ridge is a fantastic place to take fit dogs for a walk and the Lazy Trout pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One nice idea is to head a few miles south west and visit the interesting town of Leek. There's good facilities here and easy walks along the attractive Caldon Canal. It's ideal if you're looking for something less strenuous. The waymarked Staffordshire Moorlands Walks will take you all the way into the town from nearby Tittesworth if you'd like to go there on foot. The longer Gradbach Walk starts from the car park in the little hamlet, located a couple of miles north of the site. It visits the eery chasm at Lud's Church before heading to The Roaches, Hen Cloud and Three Shires Head. It's a nice way of seeing several of the highlights of the area on one trail loop. On the way you'll also pass the picturesque Gradbach Mill on the River Dane. The 18th century mill was used to manufacture sewing silk and is an interesting reminder of the historic past of Gradbach. Today it's a Youth Hostel providing accommodation if you wish to stay over in this lovely area. The little village of Wincle is also nearby. There's a fine old pub and the excellent Wincle Brewery to visit here. For more walking ideas in the area see the White Peak Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/1tHL_v0Lnjw",
  "postcode": "ST13 8UB",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bog Boulder, Roach Road, Leekfrith, Staffordshire Moorlands, Staffordshire, England, ST13 8UB, United Kingdom",
  "district": "Staffordshire Moorlands",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "3-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "rocky ridge",
    "gritstone"
  ],
  "points_of_interest": [
    "rock formations",
    "waterfalls",
    "countrside views",
    "wildlife",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "information board"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}