{
  "created_at": "2025-01-06T02:26:52.634596+00:00",
  "objectID": "19da58101a62a2e312a761fc24992df1",
  "ref": "grindleford-walking-route",
  "title": "Grindleford Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Grindleford_Station_-_geograph.org.uk_-_1220703.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/19da58101a62a2e312a761fc24992df1.gpx",
  "_geoloc": {
    "lat": 53.3059009347,
    "lng": -1.626291649
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Grindleford_Station_-_geograph.org.uk_-_1220703.jpg",
      "title": "Martin Speck / Grindleford Station",
      "caption": "Grindleford Station As the light fades a freight train of empty stone wagons thunders through Grindleford station, heading for the quarry at Hope."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Padley_House_or_Chapel_641954_6a41d1b7.jpg",
      "title": "Colin Park / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Padley House or Chapel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/The_Derwent_in_Grindleford_-_geograph.org.uk_-_1491160.jpg",
      "title": "David Lally / The Derwent in Grindleford",
      "caption": "The Derwent in Grindleford. Looking downstream from the village bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Woodland_footpath_by_the_Derwent_near_Calver_-_geograph.org.uk_-_1428089.jpg",
      "title": "Martin Speck / Woodland footpath by the Derwent near Calver",
      "caption": "Woodland footpath with bluebells by the Derwent near Calver"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Calver_bridge_-_geograph.org.uk_-_555578.jpg",
      "title": "David Stowell / Calver bridge",
      "caption": "Calver bridge. The older of the two road bridges over the River Derwent, seen from the Bridge Inn gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Along_Curbar_Edge_-_geograph.org.uk_-_52379.jpg",
      "title": "Alan Fleming / Along Curbar Edge",
      "caption": "Along Curbar Edge. View from Curbar Edge at SK251759 looking south towards Curbar Village and the Derwent Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Climbers_on_Froggatt_Edge_-_geograph.org.uk_-_1282419.jpg",
      "title": "Penny Mayes / Climbers on Froggatt Edge",
      "caption": "Climbers on Froggatt Edge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Derwent_Bridges_-_geograph.org.uk_-_238923.jpg",
      "title": "Michael Patterson / Derwent Bridges",
      "caption": "Derwent Bridges. Both the footbridge and the road bridge carry traffic over the River Derwent in Grindleford."
    }
  ],
  "distance_km": 12.8,
  "description": "This Derbyshire village makes an ideal starting point for exploring a beautiful part of the Peak District. It's a popular place for walkers with open moorland, rushing rivers and several wonderful climbs to try. This circular walk visits some of the highlights of the area including the ancient Padley Chapel, the River Derwent, Curbar Edge and Froggatt Edge. The walk starts from Grindleford railway station which is reachable from Sheffield and Manchester Piccadilly. From here you follow footpaths west to Padley Chapel. The chapel is a Grade I listed building and sits next to the ruins of Padley Hall which is a Scheduled Monument. Soon after passing the chapel you pick up the waymarked Derwent Valley Heritage Way and follow it south along the river to Calver. Here you cross the river and head east to climb Curbar Edge. This area is popular with rock climbers and provides magnificent views over the surrounding hills. You can also look out for red deer on the moors and rare birdlife such as the Ring Ouzel. The route then continues north along the neighbouring Froggatt Edge before descending back to the station. There's more great views over the White Peak on this final section. The Edge also includes interesting rock formations, sheltered birch woodland and lots of lovely heather in the late summer.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Grindleford there's The Sir William Hotel, housed in a fine 18th century stone building. They have a decent bar menu and a beautiful terraced garden over-looking the Derwent river valley. If the weather is fine it's a great place to enjoy a drink and a bite to eat. You can find it in the village on Sir William Hill Road with a postcode of S32 2HS for your sat navs. On the route stop off at the Bridge Inn at Calver Bridge for some refreshments. There's a lovely garden area with views of the old bridge and the river. It's a good spot to relax in before the climb to Curbar Edge. You can find it at a postcode of S32 3XA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area around the village is excellent for dog walking. The Bridge Inn mentioned above is also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "There's lots of good options for continuing your walking around the village. You could head north east and explore the expansive Longshaw Estate. There's also the excellent Padley Gorge Trail to try. To the east you can pick up the circular Barbrook Reservoir And Stone Circle Walk. The route visits a scenic 19th century reservoir and an ancient stone circle on Big Moor and Ramsley Moor. Next to the moors there's White Edge where you'll find more wonderful geology and pretty heather."
    }
  ],
  "district": "Derbyshire Dales",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grindleford, Station Road, Upper Padley, Grindleford, Derbyshire Dales, Derbyshire, East Midlands, England, S32 2HQ, United Kingdom",
  "postcode": "S32 2HQ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "river",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "rock formations"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}