{
  "created_at": "2025-01-05T23:23:23.057342+00:00",
  "objectID": "1a5304aea5b8925dffc8e0cbea306d3b",
  "ref": "latchmore-brook-and-hasley-hill-inclosure-walking-route",
  "title": "Latchmore Brook and Hasley Hill Inclosure Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Latchmore_Bottom_and_the_Latchmore_Brook_-_geograph.org.uk_-_24147.jpg",
  "nearby": [
    {
      "description": "Cadman's Pool",
      "objectID": "74ac829c1a2c74cf0a1f8e00f8123108",
      "ref": "cadmans-pool-walking-route"
    },
    {
      "description": "Fordingbridge",
      "objectID": "f6b8024033c64b8164b85712621b4eea",
      "ref": "fordingbridge-walking-route"
    },
    {
      "description": "Godshill",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    },
    {
      "description": "Frogham to Fritham Circular Walk",
      "objectID": "fb922606b779c86a40973f22a05f8aa8",
      "ref": "frogham-to-fritham-circular-walk-walking-route"
    },
    {
      "description": "Ashley Walk",
      "objectID": "b1a21754a420ef3adbe8adb4fd8b6500",
      "ref": "ashley-walk-walking-route"
    },
    {
      "description": "Godshill",
      "objectID": "7811d731a6d0cffeb34d1bc89c8be003",
      "ref": "godshill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1a5304aea5b8925dffc8e0cbea306d3b.gpx",
  "_geoloc": {
    "lat": 50.9103301272,
    "lng": -1.7435346131
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Latchmore_Bottom_and_the_Latchmore_Brook_-_geograph.org.uk_-_24147.jpg",
      "title": "Jim Champion / Latchmore Bottom and the Latchmore Brook",
      "caption": "Latchmore Bottom and the Latchmore Brook. Looking east along the brook as it meanders through the bottom. A drinking and gathering place for the New Forest ponies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Ponies_grazing_at_Latchmore_Shade%2C_New_Forest_-_geograph.org.uk_-_156938.jpg",
      "title": "Jim Champion / Ponies grazing at Latchmore Shade, New Forest",
      "caption": "Ponies grazing at Latchmore Shade. This view is looking upstream at the Latchmoor Brook, with Hampton Ridge in the far distance. The name \"shade\" does not refer to a shady area (there are few trees on this wet heathland anyway), but instead it refers to something the ponies do: when they \"shade\" they stand out the heat of the day away from the undergrowth where insects are more of a nuisance. On a mild spring day such as this the ponies (and some cattle) are more likely to be grazing on the lawn rather than standing - food supplies are low and they have used up their fat reserves accumulated last year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Bridge_over_Latchmore_Brook%2C_Islands_Thorns_Inclosure%2C_New_Forest_-_geograph.org.uk_-_386684.jpg",
      "title": "Jim Champion / Bridge over Latchmore Brook, Islands Thorns Inclosure, New Forest",
      "caption": "Bridge over Latchmore Brook, Islands Thorns Inclosure. This track runs north through Islands Thorns Inclosure towards Bur Bushes, just to the north east of this route. The enclosure was first planted in 1852 and this area is dominated by oak. The bridge in the foreground crosses Latchmore Brook (sometimes spelt Latchmoor Brook) which flows towards the left here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Footbridge_over_Latchmore_Brook%2C_Studley_Wood%2C_New_Forest_-_geograph.org.uk_-_386668.jpg",
      "title": "Jim Champion / Footbridge over Latchmore Brook, Studley Wood, New Forest",
      "caption": "Footbridge over Latchmore Brook, Studley Wood. This footbridge crosses Latchmore Brook at the centre of an old rectangular enclosure between Eyeworth Wood and Studley Wood. According to a number painted on the far side of the bridge, this is number 21."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Heathland_view_towards_Hasley_Hill%2C_New_Forest_-_geograph.org.uk_-_236204.jpg",
      "title": "Jim Champion / Heathland view towards Hasley Hill, New Forest",
      "caption": "Heathland view towards Hasley Hill. The sandy path in the foreground leads from Splash Bridge across Dockens Water to the track at the eastern end of the Hasley Hill Inclosure (seen in the distance on the left). As summer ends the heathland colours make a varied palette - heather and bracken are in various stages of dying off."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Southern_entrance_to_Hasley_Inclosure%2C_New_Forest_-_geograph.org.uk_-_236206.jpg/256px-Southern_entrance_to_Hasley_Inclosure%2C_New_Forest_-_geograph.org.uk_-_236206.jpg",
      "title": "Jim Champion / Southern entrance to Hasley Inclosure, New Forest",
      "caption": "Southern entrance to Hasley Inclosure. This gate is the southern entrance to the Hasley Inclosure, a mixed plantation on the sandy summit of Hasley Hill, surrounded by open heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Track_from_Hasley_Inclosure_to_Sloden_Inclosure%2C_New_Forest_-_geograph.org.uk_-_157293.jpg",
      "title": "Jim Champion / Track from Hasley Inclosure to Sloden Inclosure, New Forest",
      "caption": "Track from Hasley Inclosure to Sloden Inclosure. Track leads east from the Hasley Inclosure and curves to the north (left) to enter the Sloden Inclosure, whose conifers can be seen on the left of the photo. The hill to the right - with its oak, holly and yew trees - is the site of a royal hunting lodge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/View_across_Ogden%27s_Purlieu_towards_the_Hasley_Inclosure%2C_New_Forest_-_geograph.org.uk_-_185104.jpg",
      "title": "Jim Champion / View across Ogden's Purlieu towards the Hasley Inclosure, New Forest",
      "caption": "View across Ogden's Purlieu towards the Hasley Inclosure. Looking roughly north-east across the knoll-scape of Ogden's Purlieu. The conifers in the distance are at the western end of the Hasley Inclosure on Hasley Hill. The usual well-drained heath vegetation can be seen in the foreground - bracken, gorse, silver birch and heather."
    }
  ],
  "distance_km": 4.5,
  "description": "Enjoy a waterside walk along the delighful Latchmore Brook, near Fordingbridge in the New Forest. The brook and surrounding countryside are an idyllic area, often surrounded by horses, ponies and deer. The walk continues into the Hasley Hill Inclosure where you will find a series of pretty woodland paths. The walk begins from the Ogdens car park near Fordingbridge on the eastern side of the New Forest. If you'd like to extend your walk then the pretty Cadman's Pool is only about a mile to the east. You could also try our Fordingbridge River Walk which takes you along the River Avon to Ibsley.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north you can pick up the Godshill Walk and enjoy the rhododendrons of the Godshill Inclosure before a climb to the Castle Hill viewpoint. The Ashley Walk area is also located near here and another popular area to start a walk with its large car park and pleasant heathland trails."
    }
  ],
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ogdens, Hyde, Frogham, New Forest, Hampshire, England, SP6 2PY, United Kingdom",
  "postcode": "SP6 2PY",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "countryside",
    "wildlife"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}