{
  "created_at": "2025-01-05T23:27:49.381839+00:00",
  "objectID": "1a6f7c6ccaead88a7186dbdaef393f97",
  "ref": "langport-walking-route",
  "title": "Langport Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Langport_-_geograph.org.uk_-_11907.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1a6f7c6ccaead88a7186dbdaef393f97.gpx",
  "_geoloc": {
    "lat": 51.0359258383,
    "lng": -2.828458041
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Langport_-_geograph.org.uk_-_11907.jpg",
      "title": "Liz Martin / Langport",
      "caption": "Langport. The River Parrett from Town Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Great_Bow_Bridge%2C_Langport_-_geograph.org.uk_-_29886.jpg",
      "title": "Bill Stilling / Great Bow Bridge, Langport",
      "caption": "Great Bow Bridge, Langport. The river Parrett flows under this ancient bridge on its way to the sea at Bridgwater. In times of flood the water is almost up to the top of the arches."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Hanging_chapel_Langport.jpg",
      "title": "Pam Goodey / The Hanging chapel Langport",
      "caption": "Hanging chapel. This 13th-century archway is one of the historic highlights of the town. It's also a Scheduled Ancient Monument. It houses a room which has been used as a church, an armory, a Sunday school, and now a Masonic hall. You can find it on The Hill at a postcode TA10 9QN. From the structure's elevated position there are marvellous views over the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/River_Parrett_at_Westover_bridge_-_geograph.org.uk_-_443480.jpg",
      "title": "Martin Southwood / River Parrett at Westover bridge",
      "caption": "River Parrett at Westover bridge. Looking north towards Langport. The church just visible beyond the next bend will be Huish Episcopi."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Remains_of_Anglo-Saxon_church_Muchelney_-_geograph.org.uk_-_1260481.jpg",
      "title": "Sarah Smith / Remains of Anglo-Saxon church Muchelney",
      "caption": "Remains of Anglo-Saxon church Muchelney. The apse of the 10th century church is clearly visible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Muchelney_Abbey_-_Abbot%27s_House.jpg/512px-Muchelney_Abbey_-_Abbot%27s_House.jpg",
      "title": "DeFacto, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "The Abbot's House at Muchelney Abbey, Somerset. The Abbot's house, built in the 14th and 15th century, is a grade 1 listed building"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Abbot%27s_Lodging_Muchelney_-_geograph.org.uk_-_1260536.jpg",
      "title": "Sarah Smith / Abbot's Lodging Muchelney",
      "caption": "Abbot's Lodging Muchelney. The Lodging contains kitchens, antechambers, the great staircase leading to the Abbot's great chamber and the remains of a cloister behind. The refectory with panelled wall can be seen on the righthand side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/The_Church_of_SS_Peter_and_Paul%2C_Muchelney._%28geograph_1645141%29.jpg",
      "title": "Pam Goodey / The Church of SS Peter and Paul, Muchelney.",
      "caption": "The Church of SS Peter and Paul, Muchelney."
    }
  ],
  "distance_km": 6.0,
  "description": "This small market town in South Somerset has some nice riverside trails and country trails through the lovely scenery of the Somerset Levels. A stroll around the town is also very interesting with a number of historic buildings. Of particular note is the Grade 1 listed Hanging Chapel, a 15th century structure with 12th century origins. The photogenic structure is well worth a visit as there are fine views from it's elevated position above the town. This circular walk from Langport takes you south along the River Parret to the historic Muchelney Abbey. The walk starts on the river in the town centre where you can pick up the River Parret Trail. Follow the waymarked trail east to Huish Bridge where you cross the river and head south. The trail will take you to Westover Bridge where you cross again and head east to Muchelney Abbey. The abbey is run by English Heritage who provide good facilities with a free car park, shop, vending maching and information boards. The abbey has a fascinating history having once been a wealthy Benedictine house and the second oldest religious foundation in Somerset. As part of the dissolution the abbey’s principal buildings were demolished by Henry VIII in 1538. After exploring the abbey you can follow footpaths north along the river to Bicknell's Bridge where you cross and return in to Langport.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town head to the Black Swan for some post walk refreshment. It's a historic pub of some note, dating all the way back to the 16th century. The inn has an interior full of character with rustic butchers blocks and stools as well as large sherry brandy barrels to stand and drink around. Outside there's a nice garden area for warmer weather. There's also a fine selection of ales and lovely home cooked food to try. You can find them on North Street with a postcode of TA10 9RQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river trails make for a pleasant dog walk. Please keep them on leads in the Mulcheney Abbey area. The Black Swan mentioned above is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking from the town you could pick up the Macmillan Way West and follow the waymarked trail east along the River Yeo to Long Sutton and Somerton. If you head north west the River Parret Trail will take you along the Parret and the River Sowy towards Stathe and Burrowbridge. Here you can enjoy a climb to Burrow Mump where you'll find the striking 18th century ruined church of St Michael's. To the east you will find the National Trust's Lytes Cary. There's some lovely trails around the grounds and gardens of this fine manor house. The Somerton Walk takes you to the house and also visits the village of Kingsdon. Just to the north of Somerton you'll find the neighbouring village of Compton Dundon where you can try the Compton Dundon and Combe Hill Wood Walk. The circular walk includes a climb to Iron Age Hillfort on Dundon Beacon and a visit to the Hood Monument, which is something of a historic local landmark. If you head north into Glastonbury you can climb to the iconic Glastonbury Tor. The hill is a very popular local walk, providing fine views over the county from the summit. You can also pick up the Glastonbury Canal and enjoy an easy waterside walk here.  For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/NCbWhzhTLDQ",
  "postcode": "TA10 9RA",
  "district": "Langport",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Whatley, Langport, Somerset, England, TA10 9RA, United Kingdom",
  "state": "England"
}