{
  "objectID": "1b039c09ea317ebf6d2706de0a32da6a",
  "created_at": "2024-12-18T14:34:56.033240+00:00",
  "ref": "henrhyd-falls-walking-route",
  "title": "Henrhyd Falls Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Henrhyd_Falls_-_geograph.org.uk_-_550505.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1b039c09ea317ebf6d2706de0a32da6a.gpx",
  "_geoloc": {
    "lat": 51.7945335661,
    "lng": -3.6624429864
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Henrhyd_Falls_-_geograph.org.uk_-_550505.jpg",
      "title": "Martin Edwards / Henrhyd Falls",
      "caption": "The elegant Henrhyd Falls"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Iced_debris_at_Henrhyd_Falls_-_geograph.org.uk_-_1107512.jpg",
      "title": "Nigel Davies / Iced debris at Henrhyd Falls",
      "caption": "Iced debris at the falls. The directional spray from the waterfall is accumulating as ice on the surfaces it lands on. Stones get glazed on one surface and sticks acquire a thick smooth skin of ice that grows towards the falls. Taken in January 2009"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Henrhyd_Waterfall_near_Abercraf_-_geograph.org.uk_-_39930.jpg",
      "title": "David Neale / Henrhyd Waterfall near Abercraf",
      "caption": "This is a small tributary of the Afon Tawe that runs down to Swansea. This great waterfall is just after its run off from the Brecon Beacons area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Behind_Henrhyd_waterfall_-_geograph.org.uk_-_408858.jpg",
      "title": "Nigel Davies / Behind Henrhyd waterfall",
      "caption": "Behind Henrhyd waterfall. There is a huge amount of space that has been cut out behind this waterfall. It is perfectly dry here today and probably most days too, since some boulders seem to have been arranged as a bench and footrest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Sgwd_Henrhyd_in_flood_conditions_-_geograph.org.uk_-_1404464.jpg/256px-Sgwd_Henrhyd_in_flood_conditions_-_geograph.org.uk_-_1404464.jpg",
      "title": "Alan Bowring / Sgwd Henrhyd in flood conditions",
      "caption": "Sgwd Henrhyd in flood conditions in July 2009. After a full night of heavy rain the flow of the Nant Llech had increased significantly though it was evident that levels were lower when this shot was taken than they had been a few hours earlier. Photography closer to the falls than this was impossible due to the wind and spray. The water has picked up some peaty colouration during its flow over the moorland to the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Henrhyd_Falls_from_the_path_down_from_the_car_park_-_geograph.org.uk_-_1459586.jpg",
      "title": "CHARLES GORDON CLARK / Henrhyd Falls from the path down from the car park",
      "caption": "The Falls from the path down from the car park. When the leaves are off the trees the distant view is very appealing"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Henrhyd_Falls_icing_up_-_geograph.org.uk_-_1107507.jpg/256px-Henrhyd_Falls_icing_up_-_geograph.org.uk_-_1107507.jpg",
      "title": "Nigel Davies / Henrhyd Falls icing up",
      "caption": "View of the falls icing up in January 2009 All the rock faces sport icicles and the top of the falls is frosted up despite the flowing water. The plunge pool is completely iced over allowing careful access to the very unusual pile of \"snow\" at the base of the fall. It is actually grains of ice about the consistency of cous-cous."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Footbridge_over_Nant_Llech_heading_towards_Henrhyd_Waterfall_-_geograph.org.uk_-_932048.jpg",
      "title": "Kev Griffin / Footbridge over Nant Llech heading towards Henrhyd Waterfall",
      "caption": "Footbridge over Nant Llech heading towards  the falls"
    }
  ],
  "distance_km": 5.0,
  "description": "Visit the spectacular Henrhyd Falls and the rushing Nant Llech River on this splendid walk in the Brecon Beacons National Park.  The falls are the highest in South Wales at 90 feet (27m). There's the additional bonus of being able to walk around the back of the falls and see it from a completely different perspective. The walk starts at the National Trust car park at Dol Henrhyd, Coelbren (postcode:SA10 9PH). From here you follow a footpath heading west to the falls and then along the Nant Llech River towards Ynyswen. On the way you will pass through a lovely wooded valley where you will see another small waterfall and a disused watermill before coming to the River Tawe. Return to the start point on the same path. The final scene of the film The Dark Knight Rises was filmed at Henrhyd Falls, where it doubled as the entrance for the Batcave. This has drawn extra visitors to the site so it can be busy at peak times in the summer holidays.",
  "video_url": "https://www.youtube.com/embed/THt7Cc6WtuA",
  "county": "Powys - Powys",
  "region": "Wales",
  "country": "Wales"
}