{
  "created_at": "2025-01-06T01:34:42.866668+00:00",
  "objectID": "1b18b5ddd63c4aa49c9e0e2e9aaa7a23",
  "ref": "cors-caron-walking-route",
  "title": "Cors Caron Tregaron Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Pond_on_Cors_Caron_-_geograph.org.uk_-_1254607.jpg",
  "nearby": [
    {
      "description": "Aberystwyth to Tregaron",
      "objectID": "c1bf7ef5d25f5ff31b9899195711c257",
      "ref": "aberystwyth-to-tregaron-cycle-route"
    },
    {
      "description": "Llyn Eiddwen",
      "objectID": "7ab45fd6e33fe31024cfc7a8a978414e",
      "ref": "llyn-eiddwen-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1b18b5ddd63c4aa49c9e0e2e9aaa7a23.gpx",
  "_geoloc": {
    "lat": 52.24136126,
    "lng": -3.92400741
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Pond_on_Cors_Caron_-_geograph.org.uk_-_1254607.jpg",
      "title": "Nigel Brown / Pond on Cors Caron, via Wikimedia Commons",
      "caption": "Pond on Cors Caron. This probably originated as a peat cutting. However, the level has been artificially raised; the photograph was taken from the top of an embankment which holds back the water, together with a coffer-dam which lies across the natural drainage channel. A nature trail follows a boardwalk which has been built on top of the embankment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Hide_on_the_Cors_Caron_-_geograph.org.uk_-_1254649.jpg",
      "title": "Nigel Brown / Hide on the Cors Caron, via Wikimedia Commons",
      "caption": "Hide on the Cors Caron Providing a sheltered spot for viewing the bog,"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/The_Edge_of_Cors_Caron%2C_Ceredigion_-_geograph.org.uk_-_1223077.jpg",
      "title": "Roger Kidd / The Edge of Cors Caron, Ceredigion, via Wikimedia Commons",
      "caption": "The Edge of Cors Caron, Ceredigion. This narrow strip of pasture by the old railway trackbed is only just above bog level, so probably also becomes waterlogged quite quickly during prolonged wet weather."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Lake_at_Maes-llyn%2C_Cors_Caron_-_geograph.org.uk_-_1214676.jpg",
      "title": "Rudi Winter / Lake at Maes-llyn, Cors Caron, via Wikimedia Commons",
      "caption": "Lake at Maes-llyn, Cors Caron"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Ystwyth_Trail_near_Allt_Ddu_-_geograph.org.uk_-_1214126.jpg",
      "title": "Rudi Winter / Ystwyth Trail near Allt Ddu, via Wikimedia Commons",
      "caption": "Ystwyth Trail near Allt Ddu. Although this is the valley of the Teifi, the cycle path that follows the old alignment of the railway line from Aberystwyth to Caerfyrddin/Carmarthen is known as the Ystwyth Trail. It follows the Ystwyth valley for most of its length before climbing up to meet the Teifi as it enters Cors Caron. The lake in the background is probably man-made and is surrounded by improved land by the side of the bog."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/View_of_Cors_Caron_-_Tregaron_Bog_-_geograph.org.uk_-_1214199.jpg",
      "title": "Rudi Winter / View of Cors Caron - Tregaron Bog, via Wikimedia Commons",
      "caption": "View of Cors Caron - Tregaron Bog. The wide valley of the Afon Teifi was formed by glaciation in pre-historic times. Rocks and silt from the end moraine of the glacier formed a natural dam near to present day Tregaron, resulting in a large shallow lake which later silted up. Cors Caron is notable for its three raised bogs which have accumulated peat to over 10 metres above the river. These raised bogs are an important habitat for many species including a large number of birds. The lakes shown in the picture ('flashes') have formed where tributary streams merge into the Afon Teifi, although some linear water-filled ditches are the result of peat digging in the past. The river itself flows behind, in the centre of the bog. Some of it meanders naturally while a short section has been straightened when some of the land was improved for agriculture. The former Aberystwyth to Caerfyrddin/Carmarthen railway crossed the bog on a linear embankment. This is now used as a recreational path and for the Ystwyth cycle trail. An accessible boardwalk with interpretation and bird observation hides is provided from a roadside entrance near Glan Gors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Cors_Caron_-_geograph.org.uk_-_1214671.jpg",
      "title": "Rudi Winter / Cors Caron, via Wikimedia Commons",
      "caption": "One of the many small lakes in Cors Caron. Taken from the Tregaron to Pontrhydygroes road near the southern tip of the bog and nature reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Plantation_above_Cors_Caron_-_geograph.org.uk_-_1214259.jpg",
      "title": "Rudi Winter / Plantation above Cors Caron, via Wikimedia Commons",
      "caption": "Plantation above Cors Caron. One of several small patches and strips of newly planted deciduous trees, with an older specimen to inspire them. The wide glacial valley of the Afon Teifi and Cors Caron can be seen beyond."
    }
  ],
  "distance_km": 1.5,
  "description": "This short walk explores the delightful Cors Caron National Nature Reserve in Ceredigion. There is a lovely boardwalk at the south eastern end of the reserve. It's a nice easy stroll with great views over the reserve's raised bogs with surrounding reedbeds, grasslands, woodland, rivers, streams and ponds. It's a peaceful place with views of the River Teifi and the surrounding hills and countryside. The area supports a wide variety of wildlife including badger, blackcap, buzzard, Dartford warbler, fallow deer, nightingale, nightjar and willow warbler. You can also look out for otters around the Teifi and the rare red kite in the air. The reserve is located just north of Tregaron with a car park just off the B4343 . The Ystwyth Trail Cycle Route also passes the reserve so if you are visiting by bike you can follow this route from nearby Tregaron or Aberystwyth. The trail follows a disused railway line so can be used to extend your walk too.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west is the lovely Llyn Eiddwen where you will find a nature reserve with rare plants and wildlife."
    }
  ],
  "video_url": "https://www.youtube.com/embed/hElyfB6KGPo",
  "postcode": "SY25 6JF",
  "county": "Ceredigion",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B4343, Tregaron, Ceredigion, Cymru / Wales, SY25 6JF, United Kingdom",
  "district": "Tregaron",
  "state": "Cymru / Wales"
}