{
  "objectID": "1b8c1e0f82e483abe3eb8ad7900d8710",
  "created_at": "2024-12-19T11:13:33.894488+00:00",
  "ref": "hungerford-walking-route",
  "title": "Hungerford Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Hungerford_High_Street_-_geograph.org.uk_-_836357.jpg/256px-Hungerford_High_Street_-_geograph.org.uk_-_836357.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/F904CA23AB25FFB28625882F002FEEAE/$FILE/Hungerford.gpx",
  "_geoloc": {
    "lat": 51.4124142294,
    "lng": -1.509422831
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Hungerford_High_Street_-_geograph.org.uk_-_836357.jpg/256px-Hungerford_High_Street_-_geograph.org.uk_-_836357.jpg",
      "title": "Graham Horn / Hungerford High Street",
      "caption": "Hungerford High Street. Looking south from the bridge carrying the A338 over the Kennet and Avon Canal. The next bridge is the railway line, with the town hall clock tower behind. The alley to the right leads down to the canal towpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Hungerford_Common_-_geograph.org.uk_-_6292.jpg",
      "title": "Pam Brophy / Hungerford Common",
      "caption": "Hungerford Common. This view is of the section of common along the road taken from north of the parking and looking more or less east along the line of the trees along the road. It is situated in the southern half of the grid square towards the edge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Hungerford_Common_-_geograph.org.uk_-_6294.jpg",
      "title": "Pam Brophy / Hungerford Common",
      "caption": "Hungerford Common. This is a view of the wide lane that runs south east across the grid square and is situated in the north east section of the grid square. The picture was taken somewhat south east of the parking, looking southeast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Cattle_on_Hungerford_Common_-_geograph.org.uk_-_164221.jpg",
      "title": "Peter Jordan / Cattle on Hungerford Common",
      "caption": "Cattle on Hungerford Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Dun_Mill_Lock_-_geograph.org.uk_-_1340214.jpg",
      "title": "Graham Horn / Dun Mill Lock",
      "caption": "Dun Mill Lock Lock 75, with a fall of 5 feet 8 inches. This lock is regularly used by the canal trip boat Rose of Hungerford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/River_and_canal_-_geograph.org.uk_-_1340247.jpg",
      "title": "Graham Horn / River and canal",
      "caption": "River and canal. On the left is the River Kennet. On the right, a few feet higher, is the Kennet and Avon Canal. The canal follows the Dun valley from Crofton to near here where the River Dun joins the River Kennet. At times the River Kennet is higher than the canal (not here) and various weirs allow the canal to be fed by the river and to get rid of any excess. Here the towpath runs between the two."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/%22Rose_of_Hungerford%22_at_Hungerford_Wharf_-_geograph.org.uk_-_746105.jpg",
      "title": "Graham Horn / \"Rose of Hungerford\" at Hungerford Wharf",
      "caption": "\"Rose of Hungerford\" at the Wharf. Rose is a trip boat operated by volunteers of the Kennet and Avon Canal Trust. Here she is waiting for Sunday afternoon passengers. Public trips on Saturdays, Sundays and Wednesdays, and you may even meet yours truly as I am one of the volunteer captains. The bridge behind is Hungerford town bridge, carrying the A338. The houses to the right are contemporary with the canal, first built in about 1796."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/Hungerford_wharf_-_geograph.org.uk_-_836347.jpg",
      "title": "Graham Horn / Hungerford wharf",
      "caption": "Hungerford wharf. The town bridge carrying the A338 is to the left, leading into High Street stretching up to the railway bridge and the town hall with the clock in the distance. These cottages are contemporary with the age of the canal, 1796. Today it is a popular place for feeding the ducks, and the ducks know that."
    }
  ],
  "distance_km": 8.4,
  "description": "This market town in Berkshire is a fine place for walkers with easy river and canalside walking to enjoy. It's also close to the North Wessex Downs , an Area of Oustanding Natural Beauty with numerous options for walkers. This circular walk from the town explores Hungerford Common before picking up a pleasant section of the Kennet and Avon Canal Walk . The walk starts from the car park on Hungerford Common and picks up footpaths heading south east across the common to Templeton Stud. The expansive common is a great place for walks in the town with miles of footpaths to explore. You continue north east along a country lane towards Kintbury where you can link up with the canal. Follow the towpath west and it will take you back towards Hungerford with views of the River Kennet which runs alongside the canal. There's also lots of boats and pretty locks to see in this picturesque area.",
  "video_url": "https://www.youtube.com/embed/eSBXbg_P46Y",
  "postcode": "RG17 0ED",
  "district": "Hungerford",
  "county": "West Berkshire",
  "region": "South East",
  "country": "England"
}