{
  "created_at": "2025-01-06T18:52:44.382462+00:00",
  "objectID": "1b9965af3a2f1beeb38c231cbe246432",
  "ref": "combe-valley-greenway-walking-and-cycle-route",
  "title": "Combe Valley Way Country Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Combe_Valley_Greenway_-_geograph.org.uk_-_6310022.jpg?20240508100732",
  "nearby": [
    {
      "description": "Bexhill",
      "objectID": "60ad5be456784c327958d71e8138036b",
      "ref": "bexhill-walking-route"
    },
    {
      "description": "Hastings Circular Walk",
      "objectID": "5d3cab92a0ba18e8c3d6cc8c44c39708",
      "ref": "hastings-circular-walk-walking-route"
    },
    {
      "description": "1066 Country Walk",
      "objectID": "9bd57595ddfd3ba764d3b6c788f098b6",
      "ref": "1066-country-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1b9965af3a2f1beeb38c231cbe246432.gpx",
  "_geoloc": {
    "lat": 50.85662,
    "lng": 0.47878
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Combe_Valley_Greenway_-_geograph.org.uk_-_6310022.jpg?20240508100732",
      "title": "Combe Valley Greenway by Simon Carey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Combe Valley Greenway. The Greenway is a multi-use route designed for pedestrians, cyclists, and horse riders. It stretches from Sidley in the west to Crowhurst Road near Upper Wilting Farm in the east. This route predominantly runs just east and south of the new Combe Valley Way link road. In the eastern part of the park, the Greenway is planned to connect with the proposed Hastings Greenway, further enhancing the network of accessible paths in the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Combe_Valley_Countryside_Park%2C_Bexhill_%282%29.jpg/512px-Combe_Valley_Countryside_Park%2C_Bexhill_%282%29.jpg?20180711112159",
      "title": "Alexis Markwick, CC0, via Wikimedia Commons",
      "caption": "Combe Valley Countryside Park, Bexhill. View from Little Worsham Farm looking towards Crowhurst. The park features an extensive network of paths, including a new cycleway that connects Sidley in the west to Hollington in the east. The park's central valley experiences seasonal flooding in winter, creating an ideal habitat for waterfowl such as ducks, geese, herons, and egrets. In summer, the area is alive with dragonflies and other insects, and it supports a diverse array of aquatic and wetland plants. Raptors like kestrels and buzzards are frequently observed hunting in the valley. Additionally, the park encompasses a 2-mile stretch of coastline at Bulverhythe, extending from Galley Hill in Bexhill to St Leonards in the east, offering a varied landscape that includes coastal environments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Footbridges_at_Combe_Valley_Countryside_Park_-_geograph.org.uk_-_4455898.jpg/512px-Footbridges_at_Combe_Valley_Countryside_Park_-_geograph.org.uk_-_4455898.jpg?20230224182119",
      "title": "Footbridges at Combe Valley Countryside Park by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footbridges at the park. Combe Valley Countryside Park is a significant natural space located between Hastings and Bexhill, spanning approximately 2.3 square miles (about 1480 acres). It serves as a vital area for public recreation and enjoyment, offering a blend of privately owned farmland and public lands owned by Hastings, Rother, or East Sussex. The park is notable for its ecological importance, housing two Sites of Special Scientific Interest (SSSIs) and a rich biodiversity with 2,456 recorded species, including several rare species. This makes it a cherished area for both wildlife enthusiasts and the general public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Combe_Valley_Countryside_Park_sign_-_geograph.org.uk_-_3304470.jpg?20220313002828",
      "title": "Combe Valley Countryside Park sign by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Combe Valley Countryside Park sign"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Watermill_Stream_by_1066_Country_Walk%2C_Bexhill_Link_-_geograph.org.uk_-_3301758.jpg?20220312141955",
      "title": "Watermill Stream by 1066 Country Walk, Bexhill Link by Oast House Archive, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Watermill Stream by 1066 Country Walk, Bexhill Link"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Site_of_Crowhurst_Viaduct_-_geograph.org.uk_-_1357513.jpg/256px-Site_of_Crowhurst_Viaduct_-_geograph.org.uk_-_1357513.jpg?20110228084952",
      "title": "Simon Carey / Site of Crowhurst Viaduct",
      "caption": "Site of Crowhurst Viaduct. Looking northward from Watermill Stream towards the trees on higher ground where the northern part of a former 17 span viaduct began which bridged the valley. The railway was a four and a half mile branch to Bexhill from Crowhurst that was opened by the South Eastern Railway in 1902 in attempt to take traffic away from rivals London, Brighton & South Coast Railway. The line failed to do this and was closed as part of the Beeching cuts in 1964. The viaduct survived until it was demolished in two parts during the early summer of 1969. This view may change as a proposal for a western by-pass for Bexhill and Hastings hopes to reuse this trackbed and bridge the valley once more. An initial plan was rejected in 2001 but were resubmitted in 2008."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Lake_in_Filsham_Reedbed_Nature_Reserve_-_geograph.org.uk_-_5363679.jpg/512px-Lake_in_Filsham_Reedbed_Nature_Reserve_-_geograph.org.uk_-_5363679.jpg?20230901011250",
      "title": "Lake in Filsham Reedbed Nature Reserve by Patrick Roper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lake in Filsham Reedbed Nature Reserve.  At the southern end of the Combe Haven Valley, lies Filsham Reedbed, one of the largest reedbeds in Sussex. This area is part of a vital green space that includes a variety of wetland habitats and serves as an essential resource for water and flood storage. The valley features grazing marshes, reedbeds, reed-fens, swamp communities, and areas of ancient woodland, supporting a diverse range of plants, invertebrates, and birds. Filsham Reedbed, owned by Hastings Borough Council and designated as a Local Nature Reserve, has been managed by Sussex Wildlife Trust since the mid-1970s. Along with the rest of the valley, it is recognized as a Site of Special Scientific Interest (SSSI), noted for its diverse habitats, including alluvial meadows and fen. The area is particularly significant for its dragonfly populations and bird assemblages. Historically, the reedbed was grazing meadow, but with the cessation of grazing, reeds present in the ditches spread naturally, forming the reedbed seen today within a few decades."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Combe_Haven_-_geograph.org.uk_-_1358902.jpg?20110228072825",
      "title": "Simon Carey / Combe Haven",
      "caption": "Combe Haven. Looking across what was once a tidal inlet used by the Romans as a port to serve the nearby bloomeries in Beauport and Crowhurst Parks. There is also evidence to suggest that William of Conqueror landed here rather than Pevensey which is five miles to the west on his way to fight the Battle of Hastings in 1066. The field on the left over the far side of the valley is believed to be next to the ancient Roman landing place."
    }
  ],
  "distance_km": 11.0,
  "description": "This walk follows the Combe Valley Greenway and other footpaths around the Combe Valley Countryside park in Sussex. The park is located between Bexhill and Hastings and includes a series of trails with fine countryside views. The first section along the greenway is waymarked and suitable for cyclists as well as walkers. The diverse habitats at the site include Reedbed, Fen, Woodland and Beach. Walkers can also enjoy some pleasant waterside paths along Combe Haven to create a circular walk through the area. On the way look out for a wide variety of wildlife including Herons, Egrets, Buzzards and Kestrels. The 1066 Country Walk runs through the park so you could pick this up to continue your walking in the area.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/kIRY08dCUF0?si=CnbJGN_nKlEmginx",
  "postcode": "TN39 5JF",
  "district": "Rother",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Combe Valley Way, Sidley, Bexhill-on-Sea, Rother, East Sussex, England, TN39 5JF, United Kingdom",
  "state": "England"
}