{
  "created_at": "2025-01-06T00:41:26.773279+00:00",
  "objectID": "1c2f74e94b86c62210d62ff867df82d7",
  "ref": "rutland-water-walking-and-cycle-route",
  "title": "Rutland Water Walk and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Cycleway%2C_Rutland_Water_-_geograph.org.uk_-_161750.jpg",
  "nearby": [
    {
      "description": "Macmillan Way",
      "objectID": "cf3f4a199da30cc9ae551d49d13ec8f4",
      "ref": "macmillan-way-walking-route"
    },
    {
      "description": "Hereward Way",
      "objectID": "eb70237db71b27b0ed597128a0456162",
      "ref": "hereward-way-walking-route"
    },
    {
      "description": "Viking Way",
      "objectID": "78956b3cfa21f626c540fd93bec83413",
      "ref": "viking-way-walking-route"
    },
    {
      "description": "Rutland Round",
      "objectID": "cfd97ffdd4b9be1801099384fd6d46ff",
      "ref": "rutland-round-walking-route"
    },
    {
      "description": "Eyebrook Reservoir",
      "objectID": "4ac1b3f36daa899cfdc61fd7f3fbcfaa",
      "ref": "eyebrook-reservoir-walking-route"
    },
    {
      "description": "Uppingham",
      "objectID": "dd663db0e4c960f9992e38a21f8682a0",
      "ref": "uppingham-walking-route"
    },
    {
      "description": "Oakham",
      "objectID": "e9582a42de8e265c7ca8779ee9776be6",
      "ref": "oakham-walking-route"
    },
    {
      "description": "Exton",
      "objectID": "21be9ceae72cec7449000760d136c67e",
      "ref": "exton-walking-route"
    },
    {
      "description": "Harringworth Welland Viaduct",
      "objectID": "6402c801bd00042c8f38254b0a54dabf",
      "ref": "harringworth-welland-viaduct-walking-route"
    },
    {
      "description": "Kings Cliffe Railway Walk",
      "objectID": "4ab67c0af9f67651b479fcc04e650522",
      "ref": "kings-cliffe-railway-walk-walking-route"
    },
    {
      "description": "Blatherwycke Lake",
      "objectID": "51e4d2d8c50251fa499c614cb8a6e2ab",
      "ref": "blatherwycke-lake-walking-route"
    },
    {
      "description": "National Cycle Route 63",
      "objectID": "f637254e8de4b440d68f3d7437cfe7fb",
      "ref": "national-cycle-route-63"
    },
    {
      "description": "Empingham",
      "objectID": "b195bb22510f833470341df12f238258",
      "ref": "empingham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1c2f74e94b86c62210d62ff867df82d7.gpx",
  "_geoloc": {
    "lat": 52.6686081996,
    "lng": -0.7262153213
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Cycleway%2C_Rutland_Water_-_geograph.org.uk_-_161750.jpg",
      "title": "Kate Jewell / Cycleway, Rutland Water",
      "caption": "Cycleway, Rutland Water. The route used to go straight ahead here but has been diverted to avoid the sensitive water line in the Nature Reserve."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Rutland_Water_-_geograph.org.uk_-_34257.jpg",
      "title": "Kate Jewell / Rutland Water",
      "caption": "Rutland Water. This is the final part of the road from Hambleton to Normanton before it disappears under the water. Normanton Park Hotel and the Museum can be seen on the opposite shore"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Rutland_Water_-_geograph.org.uk_-_492071.jpg",
      "title": "Derek Bradley / Rutland Water",
      "caption": "Rutland Water Visitor Centre. The visitor centre is located at the bottom of the main car park. It consists of a café, souvenir shop and information kiosk. At the rear of the building can be seen the Fishing Lodge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Boats_on_Barnsdale_Creek%2C_Rutland_Water_-_geograph.org.uk_-_42219.jpg",
      "title": "Chris J Dixon / Boats on Barnsdale Creek, Rutland Water",
      "caption": "Boats on Barnsdale Creek, Rutland Water. Looking E from the southern shore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/From_Crake_Hide%2C_Rutland_Water_-_geograph.org.uk_-_246307.jpg",
      "title": "Kate Jewell / From Crake Hide, Rutland Water",
      "caption": "View from the Crake Bird Hide. This part of the south arm of Rutland Water is divided up by stone \"breakwaters\" into linked lagoons. Water flowing from Lagoon III can be seen between the willows on the left of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Pump_House_at_Rutland_Water_-_geograph.org.uk_-_160883.jpg",
      "title": "Kate Jewell / Pump House at Rutland Water",
      "caption": "A 20th century pumphouse by the dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Atop_the_dam_at_Rutland_Water_-_geograph.org.uk_-_1004845.jpg/512px-Atop_the_dam_at_Rutland_Water_-_geograph.org.uk_-_1004845.jpg",
      "title": "Mat Fascione / Atop the dam at Rutland Water",
      "caption": "Atop the dam. The Rutland Water Circular Route runs along the top of the dam with track shown in this photo. The trees are Cow Croft Spinney near Empingham in Rutland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/View_from_Lapwing_Hide%2C_Rutland_Water_-_geograph.org.uk_-_246284.jpg",
      "title": "Kate Jewell / View from Lapwing Hide, Rutland Water",
      "caption": "View from Lapwing Hide. The west end of Rutland Water is devoted to a large nature reserve. This view is looking southeast along the South Arm of the reservoir from one of the many birdwatching hides along the shore."
    }
  ],
  "distance_km": 24.0,
  "description": "This splendid Nature Reserve has a fabulous cycling and walking path around the perimeter of the huge artificial lake. The route starts at Oakham and soon joins the waterside path towards Whitwell and the nearby Butterfly centre. You continue to Edith Weston, Manton and Egleton where you will find the birdwatching centre at Egleton Bay. Rutland water is excellent for birdwatching with a wide variety of winged visitors including Osprey, Cormorant and Lapwing. Cycle hire is available at Whitwell. Three long distance walking trails run along the lake. You can pick up the Macmillan Way, Hereward Way or Viking Way to extend your walking in the area. For cyclists National Cycle Route 63 runs along the lake. It will take you through the heart of the National Forest from Burton on Trent to Wisbech",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Harbour Cafe is in a lovely spot overlooking Whitwell Harbour. The cafe is open 7 days a week from March until November then they open Friday, Saturday and Sunday through the Winter. They offer a wide variety of, cooked breakfasts, home cooked lunches, snacks, great coffee and cakes in a relaxed family friendly environment. There's a great outdoor seating area with fine views of the water. You can find the cafe on Bull Brigg Lane with a postcode of LE15 8BL for your sat navs.In Oakham there's the noteworthy Lord Nelson. Dating back to the 1500’s, the historic building has since been completely restored. There's a nice beer garden and a good menu here. It's nicely located on the market square at a postcode of LE15 6DT."
    },
    {
      "subtitle": "Dog Walking",
      "content": "You can enjoy the designated dog walking area at Sykes Lane, Rutland Water, as well as the rest of the paths around the water when on lead. The Lord Nelson pub in Oakham will provide water bowls and treats for your dog."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Rutland Round is a fine waymarked circular walk which passes the lake. You can pick up this trail and head south to visit the attractive market town of Uppingham and the nearby Eyebrook Reservoir. There's more nice waterside walking trails to be found here. The Oakham Walk explores the historic market town before heading across the northern section of the lake. There's more details of the town and this section of the lake on the route. A few miles to the south there's some excellent mountain bike trails and walking routes to be found at Wakerley Woods and Fineshade Woods. Near here there's also the noteworthy Harringworth Welland Viaduct to admire. The Grade II listed viaduct is about a kilometre long, and was completed in 1878. It contains 82 arches and is notable as the longest masonry viaduct across a valley in Britain. Just to the east of Fineshade you'll find the pretty village of King's Cliffe where you can pick up the Kings Cliffe Railway Walk. The easy trail runs along a now disused railway line to the east of the village. King's Cliffe is also a pleasant place for a stroll with a Norman church, picturesque 17th century almshouses and nice views of the Willow Brook, a tributary of the River Nene. There's also a fine old 18th century pub for refreshments afterwards. Near here there's also Blatherwycke Lake to explore. There's some lovely waterside trails with lots of birdlife to see on the water at this scenic spot. Just to the north of Whitwell you could follow the Viking Way north to visit the worthy village of Exton. There's a pleasant circular walk here taking you around the parkland of the old Exton Hall before visiting the two pretty lakes at Fort Henry. For more walking ideas around Rutland Water see the Rutland Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/W41JwZiLDU8",
  "postcode": "LE15 6EA",
  "district": "Oakham",
  "county": "Rutland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mill Street, Catmose, Oakham, Rutland, England, LE15 6EA, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "lake",
    "path"
  ],
  "points_of_interest": [
    "butterfly centre",
    "birdwatching centre",
    "walking trails"
  ],
  "facilities": [
    "cycle hire",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "cycling",
    "walking",
    "bird watching"
  ]
}