{
  "created_at": "2025-01-06T01:21:53.561628+00:00",
  "objectID": "1c8969a67e3f43ad1c56c46ff4f8da7d",
  "ref": "hambledon-hill-walking-route",
  "title": "Hambledon Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/98/Hambledon_Hill_-_geograph.org.uk_-_370095.jpg",
  "nearby": [
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "Wessex Ridgeway",
      "objectID": "43cab8ae3f5228bfec0a5cd93960fe13",
      "ref": "wessex-ridgeway-walking-route"
    },
    {
      "description": "Hod Hill",
      "objectID": "fbe69c0bd2345ed5bff3209ab46f1bde",
      "ref": "hod-hill-walking-route"
    },
    {
      "description": "Fontmell and Melbury Downs",
      "objectID": "03cf67ba8b713677fdcb97a2f30471e3",
      "ref": "fontmell-and-melbury-downs-walking-route"
    },
    {
      "description": "Compton Abbas",
      "objectID": "6e8cf4a07f14db831275084029a55e19",
      "ref": "compton-abbas-walking-route"
    },
    {
      "description": "Win Green Hill",
      "objectID": "6b5d3aac497b3f71b65271779eaf11e4",
      "ref": "win-green-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1c8969a67e3f43ad1c56c46ff4f8da7d.gpx",
  "_geoloc": {
    "lat": 50.9138548098,
    "lng": -2.2367200804
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Hambledon_Hill_-_geograph.org.uk_-_370095.jpg",
      "title": "Simon Barnes / Hambledon Hill, via Wikimedia Commons",
      "caption": "Hambledon Hill. A view across the hill on a bright, clear spring day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Child_Okeford_from_Hambledon_Hill_-_geograph.org.uk_-_370106.jpg",
      "title": "Simon Barnes / Child Okeford from Hambledon Hill, via Wikimedia Commons",
      "caption": "View of Child Okeford from Hambledon Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Hambledon_Hill_-_geograph.org.uk_-_169867.jpg",
      "title": "David Squire / Hambledon Hill, via Wikimedia Commons",
      "caption": "Although not the largest, Hambledon Hill is often regarded as the most dramatic of the iron age hill forts in Dorset. This photograph captures only a fragment of the extensive earth fortifications."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Hambledon_Hill_-_geograph.org.uk_-_169873.jpg",
      "title": "David Squire / Hambledon Hill, via Wikimedia Commons",
      "caption": "The multiple earth ditches and walls that surround this iron age hill fort can be seen by the different shades of green on the slopes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Signpost_near_Hambledon_Hill_-_geograph.org.uk_-_645001.jpg",
      "title": "Nigel Mykura / Signpost near Hambledon Hill, via Wikimedia Commons",
      "caption": "Signpost on the road between Shroton and Farrington with Hambledon Hill in the back ground"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Slipped_earthworks%2C_Hambledon_Hill_-_geograph.org.uk_-_646117.jpg",
      "title": "Jim Champion / Slipped earthworks, Hambledon Hill, via Wikimedia Commons",
      "caption": "Slipped earthworks on the hill. The northern spur of Hambledon Hill was an iron-age hillfort, surrounded by a double rampart. Here in the foreground, in the concavity on the western side of the hill, a section of the ramparts were carried down the slope by a land-slip."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Iron-age_earthworks%2C_Hambledon_Hill_-_geograph.org.uk_-_646199.jpg",
      "title": "Jim Champion / Iron-age earthworks, Hambledon Hill, via Wikimedia Commons",
      "caption": "Iron-age earthworks on the hill. Looking along a ditch on the south-eastern side of the hill fort on Hambledon Hill. The village in the distance, down in the Stour valley, is Shillingstone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Hambledon_Hill%2C_Dorset_-_geograph.org.uk_-_1624407.jpg",
      "title": "Clive Perrin / Hambledon Hill, Dorset, via Wikimedia Commons",
      "caption": "Lovely view over Blackmoor Vale. Standing high above Blackmoor Vale on this clear late summer day."
    }
  ],
  "distance_km": 4.0,
  "description": "Climb Hambledon Hill and enjoy far reaching views over the Cranborne Chase AONB on this walk near Child Okeford in Dorset. On the hill you will find one of the country's best preserved Iron Age hill forts. The area is also a National Nature Reserve so there is an abundance of interesting flora and fauna to look out for. Plants include pyramidal orchid and wild thyme while butterfly species include dingy skipper, grizzled skipper, chalkhill blue and adonis blue. From the 192 m (630 ft) summit there are fabulous views over rhe Blackmore Vale, the river Stour, Wiltshire and Somerset. This circular walk starts from the village of Child Okeford and follows country lanes and the Stour Valley Way to the hill summit. You then descend back to the village via Fernhayes Copse. The Stour Valley Way and the Wessex Ridgeway both cross the hill so you could pick up either of the long distance trails to extend your walk. One option would be to continue south east to Hod Hill for more great views and another historic hill fort.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Baker Arms in nearby Child Okeford for some post walk refreshments. It's a quintessential Dorset pub located right in the village. The pub dates back to circa 1770 and is perfectly situated at the foot of Hambledon hill. There's a cosy log burner indoors for the winter and a nice beer garden for warm summer days. There's a very good menu and an associated cottage if you need overnight accommodation. You can find the pub at The Cross with a postcode of DT118ED for your sat navs. To the south is the pretty village of Stourpaine and the White Horse. The classic village pub dates from the early 18th Century and includes a bar, restaurant, shop, post office, games room, wood burning stoves & an open fire. Outside there's a covered outdoor decking area at the rear and a seating area out the front. They serve good quality food and can be found at postcode DT11 8TA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hills and woods are ideal for a dog walk and the White Horse mentioned above is also very dog friendly with water and treats available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the west there's the picturesque old town of Sturminster Newton to explore. There's nice riverside trails along the Stour Valley Walk and the historic Sturminster Mill to visit here. To the south west there's another climb to Okeford Hill to try. There's more great views here and some popular mountain bike trails for cyclists as well. The epic Wessex Ridgeway can be picked up on the hill too. To the north is the pretty village of Compton Abbas where you can visit Fontmell and Melbury Downs, Compton Abbas Airfield and the highest point in the Cranborne Chase AONB at Win Green Hill. For more walking ideas in the area see the Cranborne Chase Walks and the Dorset Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BrTbRgb7cBc",
  "district": "Child Okeford",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Bakers Arms, The Cross, Child Okeford, Dorset, England, DT11 8ED, United Kingdom",
  "postcode": "DT11 8ED",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "valley",
    "woodland"
  ],
  "points_of_interest": [
    "hill fort",
    "nature reserve",
    "historic site"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}