{
  "created_at": "2025-01-06T05:03:50.622730+00:00",
  "objectID": "1caaf602b60f5a08e1767d41d2856d09",
  "ref": "holcombe-moor-walking-route",
  "title": "Holcombe Hill and Moor Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/37/Holcombe_Village_-_geograph.org.uk_-_444170.jpg",
  "nearby": [
    {
      "description": "Peel Tower",
      "objectID": "cc1ad1dce04225c45f904ca3ca1cb8d8",
      "ref": "peel-tower-walking-route"
    },
    {
      "description": "Rossendale Way",
      "objectID": "86428bb01bf01a8eb2e0a003212a2f22",
      "ref": "rossendale-way-walking-route"
    },
    {
      "description": "Wayoh Reservoir",
      "objectID": "fdeb42a6585b702a0dea8167e776a0ce",
      "ref": "wayoh-reservoir-walking-route"
    },
    {
      "description": "Calf Hey Reservoir",
      "objectID": "2631d333250fa2b0eb46511233d8496c",
      "ref": "calf-hey-reservoir-walking-route"
    },
    {
      "description": "Musbury Tor",
      "objectID": "3411d4da389e97c543134a41810dd4bd",
      "ref": "musbury-tor-walking-route"
    },
    {
      "description": "Haslingden",
      "objectID": "5b2c2a2c8d408441d32b3aee91698a9a",
      "ref": "haslingden-walking-route"
    },
    {
      "description": "Whalley Abbey and the River Calder",
      "objectID": "eab5c82aeaaf8b327588aca78aa566d1",
      "ref": "whalley-abbey-and-the-river-calder-walking-route"
    },
    {
      "description": "Ramsbottom",
      "objectID": "6e2284c42d1f1ef1bc5c3bf28132b703",
      "ref": "ramsbottom-walking-route"
    },
    {
      "description": "Summerseat",
      "objectID": "9fecf42c6853e4fd34e6f45ab32b2dd0",
      "ref": "summerseat-walking-route"
    },
    {
      "description": "Redisher Wood",
      "objectID": "a1a1f69c43853a321f1503c5977ed7c5",
      "ref": "redisher-wood-walking-route"
    },
    {
      "description": "Stubbins Estate",
      "objectID": "16e53df672bc1b443dd6345b23910f57",
      "ref": "stubbins-estate-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1caaf602b60f5a08e1767d41d2856d09.gpx",
  "_geoloc": {
    "lat": 53.6424149792,
    "lng": -2.3334890448
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Holcombe_Village_-_geograph.org.uk_-_444170.jpg",
      "title": "Paul Anderson / Holcombe Village",
      "caption": "Holcombe Village. The village of Holcombe is in the middle of all the trees with Emmanuel Church on the right. The village occupies a picturesque position on the slopes of Holcombe Hill. The buildings in the area are predominantly made up of stone cottages a public house, a restaurant, church and primary school. At one time the village also boasted a shop, post office, and a regular bus service linking it to Holcombe Brook, a neighbouring village in the valley bottom one mile to the south. The main road to the left is Helmshore Road with the sign on wall of Shoulder of Mutton pub in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Emmanuel_Church_Holcombe_-_geograph.org.uk_-_330268.jpg",
      "title": "Paul Anderson / Emmanuel Church Holcombe",
      "caption": "Emmanuel Church Holcombe. Built in 1853 the imposing stone spire of the church can be seen from miles around because of its elevated location on the lower slopes of Holcombe Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Shoulder_of_Mutton_Holcombe_Village_444148.jpg",
      "title": "Paul Anderson / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The Shoulder of Mutton pub in Helmshore Road, Holcombe. The pub was built in the late 18th century and is a Grade II listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Chapel_Lane_Holcombe_-_geograph.org.uk_-_589178.jpg",
      "title": "Paul Anderson / Chapel Lane Holcombe",
      "caption": "Chapel Lane Holcombe. These stone built cottages date from the early part of the 1800s."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Peel_Tower_on_Holcombe_Moor_-_geograph.org.uk_-_260529.jpg",
      "title": "John Darch / Peel Tower on Holcombe Moor",
      "caption": "Peel Tower on Holcombe Moor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Holcombe_Moor_NT_sign_-_geograph.org.uk_-_341806.jpg",
      "title": "Kevan Corr / Holcombe Moor NT sign",
      "caption": "Holcombe Moor NT sign. There is a dog's waterproof jacket fastened to the post this sign is on."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/The_%22Pilgrim%27s_Cross%22_Holcombe_-_geograph.org.uk_-_482543.jpg",
      "title": "Peter Worrell / The \"Pilgrim's Cross\" Holcombe",
      "caption": "The \"Pilgrim's Cross\" Holcombe A wayside cross stood on this site from at least 1176 marking the route from Manchester to Whalley Abbey. In 1901 only the base remained and that was broken up by unknown hands. The vicar of Holombe, Rev. H. Dowsett was instrumental in starting a public collection which resulted in the memorial stone being erected in 1902. Another cross on the same route was at Holden, Haslingden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Holcombe_Village_School_-_geograph.org.uk_-_330251.jpg",
      "title": "Paul Anderson / Holcombe Village School",
      "caption": "Holcombe Village School. The Emmanuel Holcomde Church Of England Primary School ,as known by its proper title, was built in 1864. The first major change to the building was in 1964 when offices,staffroom and toilets were added."
    }
  ],
  "distance_km": 6.5,
  "description": "A circular walk around Holcombe Moor visiting Peel Tower on the way. The moorland is owned by the National Trust and a popular place for walkers, cyclists and bird watchers. The walk starts from the public car park in the village of Holcombe on Lumb Carr Road. From here it is a short walk up to Peel Tower, just to the north east. The tower is dedicated to Sir Robert Peel, the 19th century Prime Minister considered the father of modern British policing. There are fabulous over the surrounding area from the elevated position of the tower. The route then follows a footpath north to the Pilgrim's Cross. This notable landmark includes a cubed shaped monument whose sides tell the story and history of the cross. It dates all the way back to A.D. 1176 and was the site where Pilgrims to Whalley Abbey prayed and rested. After examining the cross the route continues north towards Beetle Hill. Here you turn east along a section of the Rossendale Way before picking up a bridleway track to take you back to Holcombe.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Shoulder of Mutton pub is conveniently located in Holcombe village. The old traditional inn dates from 1751 and includes two nice beer gardens for warmer days. You can find the inn, near the car park, on Lumb Carr Road at postcode BL8 4LZ. The Eagle and Child in nearby Ramsbottom is a pub also worthy of some investigation. It was named Great British Pub Awards ‘Pub of the Year’ in September 2017 and has a whole host of other awards to its name. It's a pub with a social conscience targeting young people who are marginalised and need extra help such as young offenders and disabled young people. They're rated as one of the best food pubs in Greater Manchester, having consistently featured in all the main national newspapers ‘Top 50 Sunday Lunch’ features. One of the main attractions is a stunning Orangery dining room, with fine views across the Irwell valley to Holcombe. The expansive garden area includes an outdoor kitchen and bar, polytunnel, veg beds, compost beds, fruit shrubs and ornamental beds and a mini orchard with chickens. It's a lovely setting and the ideal place to round off your walk. You can find the pub in the town on Whalley Rd with a postcode of BL0 0DL for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The tower and surrounding moorland are a good place for a dog walk. There is some livestock in the area so please keep your dog under control here. The Shoulder of Mutton Pub mentioned above is also very dog friendly and will provide treats and water for your pet."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The area is also an army training camp and is sometimes used for live firing. Red flags by day and red lamps by night indicate that live firing is taking place. The range Danger Area is strictly out of bounds to the public on these occasions. The public have access to the public rights of way on the remainder of the training area at all times, but should be aware that dry training may be in progress with blank and pyrotechnic ammunition. You can find out more about the firing times by clicking here. There are a number of pretty reservoirs in the area with waterside walking trails. Head west and you can visit the expansive Wayoh Reservoir while to the north you'll find Calf Hey Reservoir. Also nearby are the climbs to Musbury Tor and the Haslingden Halo. These are both great viewpoints with an impressive art structure to see at the latter. Just south of Ramsbottom there's the worthy Redisher Wood to explore. In the woods there are peaceful woodland trails and water features including the Holcombe Brook, a picturesque lake and photogenic waterfalls. The circular Stubbins Estate Walk takes you to the Tentering Tower, a ruined industrial building on the eastern side of the moor. For more walking ideas in the county see the Lancashire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xIiAoNB2p1M",
  "postcode": "BL8 4NG",
  "region": "Greater Manchester",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Holcombe Old Road, Nuttall, Hazelhurst, Bury, Greater Manchester, England, BL8 4NG, United Kingdom",
  "district": "Bury",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "moorland"
  ],
  "points_of_interest": [
    "historical landmarks",
    "monument",
    "viewpoints"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "bird watching"
  ]
}