{
  "created_at": "2025-01-06T01:48:37.407144+00:00",
  "objectID": "1cd07fabbb435e9e438cda1fbe09b646",
  "ref": "keyhaven-marshes-walking-and-cycle-route",
  "title": "Keyhaven Marshes Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Keyhaven_-_geograph.org.uk_-_226294.jpg",
  "nearby": [
    {
      "description": "Solent Way",
      "objectID": "eaa121d258e86ee84d70f570788add37",
      "ref": "solent-way-walking-route"
    },
    {
      "description": "Bournemouth Coast Path",
      "objectID": "d50c66d416dab7c728178083d4565e12",
      "ref": "bournemouth-coast-path-walking-route"
    },
    {
      "description": "Hurst Castle",
      "objectID": "30674ea3bc7bdc238654c18b7bfeff16",
      "ref": "hurst-castle-spit-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1cd07fabbb435e9e438cda1fbe09b646.gpx",
  "_geoloc": {
    "lat": 50.7611158067,
    "lng": -1.5373124405
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Keyhaven_-_geograph.org.uk_-_226294.jpg",
      "title": "DACP / Keyhaven",
      "caption": "Moorings in the channel to Keyhaven"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Keyhaven_Marshes_-_geograph.org.uk_-_145593.jpg",
      "title": "Footprints / Keyhaven Marshes",
      "caption": "Keyhaven Marshes. This pool can hold a large number of birds but they tend to be distant and can only be seen through this hole in the hedge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Gun_Inn_at_Keyhaven_-_geograph.org.uk_-_333925.jpg",
      "title": "Gillian Moy / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Gun Inn at Keyhaven. Fresh crab sandwiches are delicious at this location. This pub overlooks the car parking area but has a lovely back garden for the summer"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Keyhaven_%2C_Keyhaven_Harbour_-_geograph.org.uk_-_1720831.jpg/512px-Keyhaven_%2C_Keyhaven_Harbour_-_geograph.org.uk_-_1720831.jpg",
      "title": "Lewis Clarke / Keyhaven : Keyhaven Harbour",
      "caption": "Here comes the Hurst Castle ferry with it's passengers who have enjoyed a nice day at the castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Balancing_pond_at_the_end_of_Avon_Water%2C_Keyhaven_-_geograph.org.uk_-_503254.jpg",
      "title": "Jim Champion / Balancing pond at the end of Avon Water, Keyhaven",
      "caption": "Balancing pond at the end of Avon Water, Keyhaven. The body of water in this photo is Avon Water, which must pass through a sluice beneath the road (off to the left) before it reaches the tidal estuary at Keyhaven. The river enters the sheltered sea behind the shingle bank of Hurst Beach, and winds its way through salt marshes to the Solent. Avon Water itself rises in the heathland to the south of Burley in the New Forest."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Keyhaven_Harbour_-_geograph.org.uk_-_505124.jpg",
      "title": "Jim Champion / Keyhaven Harbour",
      "caption": "A classic view of the most sheltered corner of Keyhaven Harbour. The small tower in the centre of the photo is the harbourmaster's office. The long building on the right is the Milford and Keyhaven Sea Scout hut."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Crabbing_on_the_bridge_at_the_head_of_Mount_Lake%2C_Keyhaven_-_geograph.org.uk_-_505145.jpg",
      "title": "Jim Champion / Crabbing on the bridge at the head of Mount Lake, Keyhaven",
      "caption": "Photo of families crabbing on the bridge at the head of Mount Lake. The vehicles in the background are parked on the verges of New Lane (from Milford on Sea), which meets with the end of Saltgrass Lane (from Keyhaven) just off to the right. The pebbles in the foreground are on the landward side of the Hurst Beach bank. Water from Sturt Pond is channelled along the back of the pebble bank (from the right) and out into the marshes behind Hurst Spit (off to the right) where it is called Mount Lake. The many children and parents on the bridge are crabbing. Some bigger scale sea angling takes place on the seawards side of the spit, but it's not particularly safe for children due to the undertow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Footpath_alongside_the_inlet%2C_near_Woodside_-_geograph.org.uk_-_503950.jpg",
      "title": "Jim Champion / Footpath alongside the inlet, near Woodside",
      "caption": "Footpath alongside the inlet, near Woodside Following the path along and round to the left brings you to Moses Dock. The water on the right is an inlet filled with seawater through a sluice in Moses Dock. The hills of the Isle of Wight are in the far distance."
    }
  ],
  "distance_km": 10.0,
  "description": "This coastal cycle or walk takes you from Lymington to Keyhaven through the beautiful Keyhaven and Pennington Marshes. The path runs along a sea wall with the marshes on one side and the sea on the other. As such you are surrounded by varied and beautiful scenery for the length of the route. In the marsh area you will pass a number of pretty lagoons where you can look out for a wide variety of birdlife including Egret, Shelduck, Curlew and Heron. On the coastal side there are fabulous views of the Isle of Wight which is less than 2 miles away. Hurst Castle is also visible for most of the way - you could extend your walk by walking along the shingle spit to Henry VIII's Device Fort if you have time. The Solent Way and the Bournemouth Coast Path long distance walking routes also run through Keyhaven so you could also continue your exercise along these paths.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Gun Inn in Keyhaven is a nice place to stop for refreshments. The 18th century pub has a large garden area with a summer bar. They do good food including lovely fresh crab sandwiches. Near the pub you can pick up the ferry to visit Hurst Castle if you have time. You can find the pub at a postcode of SO41 0TP for your sat navs. At the other end of the route there's The Ship Inn in Lymington. The inn is located in a great spot next to the quay, in the town centre. In the summer you can sit outside and enjoy views to all the boats in the marina. Inside there's a stylish and contemporary decor with a cosy log fire for the winter months. They do excellent food and can be found at Quay Hill with a postcode of SO41 3AY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reserve is a great place for a dog walk but you might like to keep them on leads near the wildlife. The Gun Inn mentioned above is also dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/WeaY1p554BI",
  "district": "New Forest",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Station Street, Lymington, Lymington and Pennington, Lymington, New Forest, Hampshire, England, SO41 3BA, United Kingdom",
  "postcode": "SO41 3BA",
  "state": "England"
}