{
  "created_at": "2025-01-06T04:09:28.065898+00:00",
  "objectID": "1d6560825cb37c1ff41ff63d928e9b80",
  "ref": "reepham-walking-route",
  "title": "Reepham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Old_Reepham_Station_-_geograph.org.uk_-_517028.jpg",
  "nearby": [
    {
      "description": "Marriot's Way",
      "objectID": "ac67b521462a354e31726a78bd96d2bc",
      "ref": "marriots-way-walking-and-cycle-route"
    },
    {
      "description": "Norwich Riverside Walk",
      "objectID": "384fcd894f6a38346574000e43d48f68",
      "ref": "norwich-riverside-walk-walking-route"
    },
    {
      "description": "Hellesdon Circular Walk",
      "objectID": "2c4042b4806ce4f6b61d451a856c21aa",
      "ref": "hellesdon-circular-walk-walking-route"
    },
    {
      "description": "Swanton Morley",
      "objectID": "2510ab2ef0f253f44f1de6629e049580",
      "ref": "swanton-morley-walking-route"
    },
    {
      "description": "Foxley Wood",
      "objectID": "43613f82844b42b84e584f5774dbcbd4",
      "ref": "foxley-wood-walking-route"
    },
    {
      "description": "Dereham",
      "objectID": "73b42b007b90e57c1b818417b78bc8e0",
      "ref": "dereham-walking-route"
    },
    {
      "description": "North Elmham",
      "objectID": "799a5cfa941aff20cca587150011d6ef",
      "ref": "north-elmham-walking-route"
    },
    {
      "description": "Lyng",
      "objectID": "c777dfe5c8bf33e6682bd9daf911c591",
      "ref": "lyng-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1d6560825cb37c1ff41ff63d928e9b80.gpx",
  "_geoloc": {
    "lat": 52.7682574127,
    "lng": 1.114802838
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Old_Reepham_Station_-_geograph.org.uk_-_517028.jpg",
      "title": "Tom Offord / Old Reepham Station",
      "caption": "The old Reepham Railway Station on the Marriotts way cycle path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Open_Land_and_Woodland_by_Marriott%27s_Way_-_geograph.org.uk_-_454701.jpg",
      "title": "Ian Robertson / Open Land and Woodland by Marriott's Way",
      "caption": "Open Land and Woodland by Marriott's Way to the east of Reepham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Along_Marriott%27s_Way_towards_Reepham_-_geograph.org.uk_-_454706.jpg",
      "title": "Ian Robertson / Along Marriott's Way towards Reepham",
      "caption": "Along Marriott's Way towards Reepham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Booton_Common_-_geograph.org.uk_-_756000.jpg",
      "title": "Evelyn Simak / Booton Common",
      "caption": "Booton Common viewed from The Moor. The Moor is an area on the eastern fringe of the village of Reepham; 'moor' in this context means low, wet land. South of the cul-de-sac also called The Moor is Booton Common, a SSSI of international importance, managed by the Norfolk Wildlife Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Booton_Hall_-_geograph.org.uk_-_755696.jpg",
      "title": "Evelyn Simak / Booton Hall",
      "caption": "Booton Hall. The Booton estate consists of a number of fine houses. Booton Hall dates from the early 17th century. It is the ancestral home of John Rolfe, who married the Native American princess Pocahontas. In 1677 the hall was home to Christopher Layer, Squire of Booton and Sheriff of Norwich. His nephew and heir, also Christopher Layer, was born in 1683. Four years after this later Christopher's marriage to Elizabeth Elwin he sold the Hall to his father-in-law Peter Elwin. The Reverend Whitwell Elwin, a relation, built Booton's church (St Michael and All Angels) as well as the village school."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/The_Moor_past_paddock_-_geograph.org.uk_-_755936.jpg/256px-The_Moor_past_paddock_-_geograph.org.uk_-_755936.jpg",
      "title": "Evelyn Simak / The Moor past paddock",
      "caption": "The Moor past paddock. Many of the historically interesting houses along this road were altered in Victorian times and the only remaining thatched cottage is located on the junction with Orchard Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Reepham_Moor_-_geograph.org.uk_-_255134.jpg",
      "title": "Richard Croft / Reepham Moor",
      "caption": "Reepham Moor. Looking north across Reepham Moor from Moor Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Salle_Hall_and_its_Orangery_-_geograph.org.uk_-_935153.jpg/256px-Salle_Hall_and_its_Orangery_-_geograph.org.uk_-_935153.jpg",
      "title": "Evelyn Simak / Salle Hall and its Orangery",
      "caption": "Salle Hall and its Orangery. The hall is located just to the north of the town and reachable on public footpaths. It has certain open days throughout the year when the public can explore the footpaths in the gardens. The orangery shown here is integrated into the east wing and houses exotic plants; it is frequently used for social functions and on open days tea is being served here. Salle Hall was built in 1761 for Edward Hase; alterations were made in 1862, and east and west service blocks were added in 1910 for Sir Woolmer White. The east wing contains an Orangery. (N. Pevsner & B. Wilson, The Buildings of England, Norfolk 1: Norwich and North-East, 2002). Presently, Salle Hall and gardens are part of the Salle Park Estate, owned by Sir John White."
    }
  ],
  "distance_km": 8.2,
  "description": "This small market town in Norfolk lies in a pleasant spot between the River Bure and River Wensum valleys. There's immediate access to miles of countryside trails, two interesting local old halls and a small pocket of ancient woodland to the south east of the town. This circular walk from the town takes you along a section of the Marriot's Way to the neighbouring village of Cawston before returning via Booton Common and Booton Hall. On the way there's nice country views across Reepham Moor and an interesting 17th century manor house to see. The walk starts at the northern end of the village where you can pick up the old dismantled railway line on the Marriot's Way. Follow the shared cycling and walking trail north east and it will take you to Cawston. The route then picks up other public footpaths to take you south east along Green Lane to Booton Common and Booton Hall. The hall dates from the early 17th century and is notable as the ancestral home of John Rolfe, one of the early English settlers of North America. He is credited with the first successful cultivation of tobacco as an export crop in the Colony of Virginia. He is also known as the man who married the Native American princess Pocahontas. The adjacent common lies in the valley of a tributary of the River Wensum. It consists of ancient woodland nd and wet heathland with several rare plants including the Fragrant Orchid. Shortly after passing the hall and the common you return to Reepham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Kings Arms for some refreshments after your walk. The noteworthy pub dates all the way back to 1667 and maintains most of its original features. They have a good menu and a nice garden area to sit out in on warmer days. You can find the pub in the Market Place at postcode NR10 4JJ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails on the route make for a fine dog walk. The Kings Arms mentioned above is also dog friendly. There is even a dog treat tin situated on the bar for well behaved doggies!"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head south along the Marriot's Way it will take you towards Norwich where you can try the Norwich Riverside Walk and the Hellesdon Circular Walk where there's nice views of the River Wensum to enjoy. On the way you'll pass Whitwell Common and Lenwade where there's series of pretty lakes. Just to the south west is the award winning village of Swanton Morley where you'll find a noteworthy 14th century church and an early 17th century pub with strong connections to the ancestors of Abraham Lincoln. In the village you can pick up the Walsingham Way and the Wensum Way long distance footpaths. The historic market town of Dereham is also located in this area. Just to the west is the Foxley Wood Nature Reserve where there's some peaceful woodland trails and lots of wildlife to see. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "district": "Reepham",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}