{
  "created_at": "2025-01-06T04:14:11.097272+00:00",
  "objectID": "1db2bdb68acf7b373ebe5cb0f07ea9b2",
  "ref": "jurassic-coast-walking-route",
  "title": "Jurassic Coast Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Exmouth_seafront_in_south_devon_arp.jpg/512px-Exmouth_seafront_in_south_devon_arp.jpg",
  "nearby": [
    {
      "description": "Orcombe Point",
      "objectID": "f4e5e6abf9be642f935a1be694eb7354",
      "ref": "orcombe-point-walking-route"
    },
    {
      "description": "Lyme Regis to Seaton Undercliff Walk",
      "objectID": "739b76d283016a4fd013ecf36f5f88bf",
      "ref": "lyme-regis-to-seaton-undercliff-walk-walking-route"
    },
    {
      "description": "Golden Cap Estate",
      "objectID": "183cadcb76d8e0ba508b40b23241b42c",
      "ref": "golden-cap-estate-walking-route"
    },
    {
      "description": "Branscombe to Beer",
      "objectID": "cdca9aea7e5cf4937525fdb2040b377c",
      "ref": "branscombe-to-beer-walking-route"
    },
    {
      "description": "Lyme Regis to Golden Cap",
      "objectID": "bd243ddabd44ddff7a452ea94937c699",
      "ref": "lyme-regis-to-golden-cap-walking-route"
    },
    {
      "description": "Burton Bradstock",
      "objectID": "cc6725eca4d9a9a20abd7a5a5f48c4e7",
      "ref": "burton-bradstock-walking-route"
    },
    {
      "description": "Chesil Beach",
      "objectID": "10ea707afab28ce67f098301c9ba89b9",
      "ref": "chesil-beach-walking-route"
    },
    {
      "description": "Isle of Portland",
      "objectID": "13b7dffbffa85409b9dca90d0c28ffad",
      "ref": "isle-of-portland-walking-route"
    },
    {
      "description": "Osmington White Horse",
      "objectID": "68dd451a6005d70868fb6e73ae29e092",
      "ref": "osmington-white-horse-walking-route"
    },
    {
      "description": "Lulworth Cove to Durdle Door",
      "objectID": "6321b4c73790bac4f9f4fff0a21ec1db",
      "ref": "lulworth-cove-to-durdle-door-walking-route"
    },
    {
      "description": "Kimmeridge Bay to Chapmans Pool",
      "objectID": "8bf494265d0239bbd58479ec4d6f762c",
      "ref": "kimmeridge-bay-to-chapmans-pool-walking-route"
    },
    {
      "description": "Durlston Country Park",
      "objectID": "1129d02e294cd49c09e3881bc416cc3f",
      "ref": "durlston-country-park-walking-route"
    },
    {
      "description": "Old Harry Rocks",
      "objectID": "81ed0a247662caab56f014fd2ac0cb92",
      "ref": "old-harry-rocks-walking-route"
    },
    {
      "description": "Lulworth Cove to Osmington Mills Coastal Walk",
      "objectID": "2ce78bd4a80f7f4211fb17b1f55cd7ae",
      "ref": "lulworth-cove-to-osmington-mills-coastal-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1db2bdb68acf7b373ebe5cb0f07ea9b2.gpx",
  "_geoloc": {
    "lat": 50.617061,
    "lng": -3.424293
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Exmouth_seafront_in_south_devon_arp.jpg/512px-Exmouth_seafront_in_south_devon_arp.jpg",
      "title": "By Photographed by Adrian Pingstone (on a chilly Monday before the school holidays, hence so few people) and placed in the public domain. [Public domain], from Wikimedia Commons",
      "caption": "Exmouth seafront"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Beer_Cliffs_from_Seaton_Seafront_-_geograph.org.uk_-_308118.jpg",
      "title": "Tony Atkin / Beer Cliffs from Seaton Seafront",
      "caption": "Beer Cliffs from Seaton Seafront"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Landslip_near_Lyme.JPG/512px-Landslip_near_Lyme.JPG",
      "title": "Ballista at the English language Wikipedia [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons",
      "caption": "Landslip near Lyme Regis"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Charmouth_beach_-_and_Golden_Cap_view_-_geograph.org.uk_-_503850.jpg",
      "title": "Chris Downer / Charmouth beach – and Golden Cap view",
      "caption": "Charmouth beach and Golden Cap view"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Chesil_Beach_-_geograph.org.uk_-_113002.jpg",
      "title": "C Massey / Chesil Beach",
      "caption": "Chesil Beach"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Durdle_Door_Overview.jpg/512px-Durdle_Door_Overview.jpg",
      "title": "By Saffron Blaze [CC BY-SA 3.0  (https://creativecommons.org/licenses/by-sa/3.0 )], from Wikimedia Commons",
      "caption": "Durdle Door"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Lulworth_Cove.jpg/512px-Lulworth_Cove.jpg",
      "title": "By Paste at English Wikipedia (Transferred from en.wikipedia to Commons.) [Public domain], via Wikimedia Commons",
      "caption": "Lulworth Cove"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Chalk_cliffs_at_Handfast_Point_-_geograph.org.uk_-_499630.jpg",
      "title": "Chris Downer / Chalk cliffs at Handfast Point",
      "caption": "Old Harry Rocks"
    }
  ],
  "distance_km": 177.0,
  "description": "Walk the entire length of the spectacular Jurassic Coast on this epic route in south west England. The UNESCO World Heritage Site runs for 95 miles from Exmouth in Devon to Old Harry Rocks in Dorset. The walk uses a section of the South West Coast Path visiting a series of pretty villages and beautiful beaches with fascinating geological rock formations along the way. The walk starts in Exmouth and heads east along the River Exe Estuary to Orcombe Point and the lovely Sandy Bay. The next stage takes you to Budleigh Salterton, where you head through the Otter Estuary Nature Reserve, before turning north to Sidmouth. From here you head to Seaton, passing a very popular section of the path from Branscombe to Beer. Around here there are some fantastic cliff tops including the stunning Hooken Cliffs, a Jurassic Coast UNESCO World Heritage Site. At Seaton you pick up the Undercliff Walk to take you to Lyme Regis. You'll pass through the Undercliff National Nature Reserve where there is a wide variety of interesting flora and fauna to look out for. The stretch of coast is of high geological significance containing rocks from the Triassic, Jurassic and Cretaceous periods. It's also botanically diverse with species rich chalk grassland, holm oak, rhododendron, orchids and laurel. The next section takes you from Lyme Regis to Golden Cap, passing the pretty village of Charmouth on the way. This section is popular with fossil hunters and includes the Charmouth Heritage Centre where you can see fossil collections and learn all about the geology of the Jurassic Coast. The Golden Cap Estate is another major highlight of the route with a high point standing at a height of 191 metres (627 ft), providing spectacular coastal views. The estate also includes some lovely woodland trails and a wide variety of flora and fauna to look out for. You continue past Bridport to Burton Bradstock where you reach the western end of Chesil Beach. The unusal pebble beach runs for 18 miles with a series of beautiful lagoons on one side and the sea on the other. You'll pass Abbotsbury, before coming to Weymouth where there are fine views of the Isle of Portland. From Weymouth you continue past the Osmington White Horse to another route highlight at Lulworth Cove and Durdle Door. Here you find two of the Jurassic Coast's most spectacular natural features. At Lulworth you can enjoy views of a beautiful sheltered bay enclosed almost in a circle and formed 10,000 years ago by the combined forces of a river and the sea. Next to the cove you will pass the West Lulworth Heritage Centre which contains a museum about the coast and the village. Near the cove the route passes Durdle Door, a spectacular natural limestone arch with an adjacent beach and caves. The next stage takes you to the Purbeck Marine Wildlife Reserve at Kimmeridge where you pick up the Kimmeridge Bay to Chapman's Pool Walk. In the marine reserve you can explore the beach where there are a number of rock-pools with a variety of marine wildlife. Chapman's Pool is another photogenic spot with a delightful cove just to the west of Worth Matravers on the Isle of Purbeck. The route continues to the popular seaside resort of Swanage where you will pass the lovely Durlston Country Park. From here it's just a few miles to the finish point at Old Harry Rocks. The three striking chalk formations mark the most easterly point of the Jurassic Coast. The rocks are thought to be named after Harry Paye, the infamous Poole pirate. His ship would lay in wait for passing merchant ships, using the rocks as cover.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route head we recommend you stop at the The Three Horseshoes Pub in Burton Bradstock for refreshments. The pub is set in a beautiful three hundred year old thatched stone property on the Jurassic Coast in the idyllic village. They are in walking distance of the coastal path and the stunning “Hive” beach. In the summer you can relax in the lovely suntrap beer garden. You can find it on Mill street at postcode DT6 4QZ for your sat navs. You could stop at the delightful Clavell’s Restaurant in the picture box village of Kimmeridge. There's a fine menu and a nice outdoor seating area to relax in during the summer months. You can find the pub at postcode BH20 5PE. In Osmington Mills you'll find the noteworthy Smuggler's Inn. Situated on the cliff tops of the South West Coast Path, just outside the village of Osmington, the Smugglers Inn is a traditional English pub with stunning views overlooking the Isle of Portland. The pub also has an interesting history having been the headquarters of the French smuggler Pierre Latour and one of the main landing places for smuggled goods in the 17th century. Notably the Inn was originally built in the 13th century, with its own brewery at the rear. There's a lovely large garden area which is perfect for relaxing in when the weather is fine. You can fine the pub right on the coast at a postcode of DT3 6HF for your sat navs. In Charmouth there are two small cafes on the sea front serving a good range of meals and snacks in an excellent location. If you fancy a pub lunch head into the village and visit the Royal Oak. They serve a great Sunday Roast and can be found at a postcode of DT6 6PE for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iTuZCiOLLtk",
  "postcode": "EX8 1ER",
  "district": "East Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pier Head, Exmouth, East Devon, Devon, England, EX8 1ER, United Kingdom",
  "state": "England"
}