{
  "created_at": "2025-01-06T00:16:33.451016+00:00",
  "objectID": "1dc1a9d15dcfcbe99f3d1eea098b2f79",
  "ref": "horncastle-walking-route",
  "title": "Horncastle Canal and River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Horncastle_Canal_-_geograph.org.uk_-_381725.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1dc1a9d15dcfcbe99f3d1eea098b2f79.gpx",
  "_geoloc": {
    "lat": 53.2072734632,
    "lng": -0.1181962232
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Horncastle_Canal_-_geograph.org.uk_-_381725.jpg",
      "title": "Richard Croft / Horncastle Canal",
      "caption": "Canal view in the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Mouth_of_the_Horncastle_Canal_-_geograph.org.uk_-_418730.jpg",
      "title": "Alan Murray-Rust / Mouth of the Horncastle Canal",
      "caption": "Mouth of the Horncastle Canal. The Horncastle Canal provided an outlet for agricultural produce from the Horncastle area, linking the town to the navigable River Witham. The Canal was closed in 1889 and is now completely severed from the river, but parts are still in water. The first stretch can just be seen over the top of the bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/South_Basin_of_the_Horncastle_Canal%2C_Horncastle_-_geograph.org.uk_-_563238.jpg",
      "title": "Dave Hitchborne / South Basin of the Horncastle Canal, Horncastle",
      "caption": "South Basin of the Horncastle Canal. Looking towards the Bull Ring."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Footbridge_over_disused_Horncastle_canal_-_geograph.org.uk_-_820675.jpg",
      "title": "trevor willis / Footbridge over disused Horncastle canal",
      "caption": "Footbridge over disused Horncastle canal. Kirkby on Bain church can be seen in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Horncastle_Canal%2C_North_basin_-_geograph.org.uk_-_381724.jpg",
      "title": "Richard Croft / Horncastle Canal, North basin",
      "caption": "North basin View towards Bridge Street from Hares Warehouse on the River Bain"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/River_Bain_-_geograph.org.uk_-_1422570.jpg",
      "title": "Richard Croft / River Bain",
      "caption": "Canalised stretch of the River Bain as the disused Horncastle Canal, seen from Haltham lock bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Bull_Ring%2C_Horncastle_-_geograph.org.uk_-_561379.jpg",
      "title": "Dave Hitchborne / Bull Ring, Horncastle",
      "caption": "Bull Ring, Horncastle. At centre, the shot includes Wilkin Chapman Solicitors, the former Lloyds Bank building, which stands on the corner of Bank Street."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/St.Marys_Square_%28geograph_4309825%29.jpg/512px-St.Marys_Square_%28geograph_4309825%29.jpg",
      "title": "Richard Croft / St.Mary's Square",
      "caption": "St.Marys Square, Horncastle"
    }
  ],
  "distance_km": 6.7,
  "description": "This walk takes you along the old Horncastle Canal and the River Bain from the town centre of this Lincolnshire town. From here you can pick up the Viking Way, a waymarked footpath which will take you south along a section of the old canal. It originally ran for 11 miles from the River Witham at Dogdyke to Horncastle, through twelve locks largely following the course of River Bain. The canal opened in 1802, and was abandoned for navigation in 1889. This walk runs for the first couple of miles along the waterway, finishing near Martin. You could extend the walk by continuing south through Roughton to Haltham and Kirkby On Bain where there's a noteworthy 16th century pub and an ancient Norman church to see.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The King's Head is a fine thatched pub with a low ceilings and an old worlde feel. They serve good quality food and have a lovely floral rear courtyard. Reputedly the pub inspired an OO gauge Hornby model, an example of which is displayed behind the bar. You can find them at 16 Bull Ring with postcode LN9 5HU for your sat navs. The pub is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "This walk uses a section of the Viking Way to take you along the river. You could extend the walk by following the Spa Trail along a disused railway line to Woodhall Spa. The shared cycling and walking path will take you to the neighbouring town where there are some lovely trails through The Pinewoods in the centre of the village. This area also includes the interesting Kinema in the Woods. It dates from 1922, and it is the only fully functioning cinema in the UK to employ back projection. If you were to follow the Viking Way north it would take you to the worthy village of Donington on Bain where there's a 12th century church, a fine 18th century pub and nice views of the River Bain. Near here there's also Biscathorpe, Binbrook and East Wykeham where there are the sites of two deserted medieval villages to explore. The other end of the canal was at Dogdyke near the village of Tattershall. Here you can enjoy a visit to Tattershall Lakes where there's some nice waterside paths to try. Just a few miles east of the town you'll find Snipe Dales Country Park. There's miles of heathland and woodland trails to follow around this 220 acre site. It's also a nature reserve so there's good wildlife spotting opportunities too. Near here you'll find the villages of Hagworthingham and Winceby, where there's the site of a civil war battlefield. For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "district": "East Lindsey",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cagthorpe, Horncastle, East Lindsey, Lincolnshire, England, LN9 5HJ, United Kingdom",
  "postcode": "LN9 5HJ",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "canal",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "footpath"
  ],
  "facilities": [
    "pub"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}