{
  "created_at": "2025-01-06T08:52:05.516402+00:00",
  "objectID": "1e21b179b83477712b121640794ba73c",
  "ref": "lichfield-city-walk-walking-route",
  "title": "Lichfield City Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Lichfield%2C_Garden_of_Remembrance_and_cathedral_-_geograph.org.uk_-_493394.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1e21b179b83477712b121640794ba73c.gpx",
  "_geoloc": {
    "lat": 52.6836177404,
    "lng": -1.8267756866
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Lichfield%2C_Garden_of_Remembrance_and_cathedral_-_geograph.org.uk_-_493394.jpg",
      "title": "Chris Downer / Lichfield: Garden of Remembrance and cathedral",
      "caption": "Lichfield: Garden of Remembrance and cathedral"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Lichfield%2C_lake_and_cathedral_-_geograph.org.uk_-_499188.jpg",
      "title": "Chris Downer / Lichfield: lake and cathedral",
      "caption": "Lichfield: lake and cathedral. The central tallest spire is 258' high (rebuilt after the Civil War). The other pair of spires are the originals, built in 1320AD."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Beacon_Park_Museum_Gardens.jpg/512px-Beacon_Park_Museum_Gardens.jpg",
      "title": "Bs0u10e01, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Beacon Park Museum Gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Erasmus_Darwin_House.jpg/512px-Erasmus_Darwin_House.jpg",
      "title": "Bs0u10e01, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Stowe Pool. Picture taken from the central spire of Lichfield Cathedral."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Stowe_Pool.jpg/512px-Stowe_Pool.jpg",
      "title": "Bs0u10e01, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Stowe Pool"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Lichfield_Garrick_Theatre.jpg/512px-Lichfield_Garrick_Theatre.jpg",
      "title": "Bs0u10e01, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Garrick Theatre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Johnsons_Birthplace.jpg/512px-Johnsons_Birthplace.jpg",
      "title": "Bs0u10e01, CC BY 3.0 <https://creativecommons.org/licenses/by/3.0>, via Wikimedia Commons",
      "caption": "Johnsons Birthplace"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/St._Chad%27s_Church_and_Stowe_Pool_-_geograph.org.uk_-_121236.jpg",
      "title": "Geoff Pick / St. Chad's Church and Stowe Pool",
      "caption": "St. Chad's Church and Stowe Pool. The Grade II* Listed Building dates back to the 12th century."
    }
  ],
  "distance_km": 3.0,
  "description": "This fascinating city walk explores the area around the magnificent cathedral in the Staffordshire city of Lichfield. There's much to enjoy with interesting architecture, historic sites, pretty parks and lakeside trails. The walk starts from the tourist information centre on Market Street and heads north west to the lovely Minster Pool. The pool lies directly south of Lichfield Cathedral with views over the water to the wonderful building. It's a beautiful spot with an ancient avenue of lime trees that are lit up at night. The trails pass along the pool before entering Beacon Park. There's 69 acres to explore here with the pretty Museum Gardens, Beacon Pool Lake and interesting sculptures including Captain Smith of the RMS Titanic and King Edward VII. After exploring the park the walk turns to the north east passing Erasmus Darwin House and the cathedral. The building dates from the 12th century and is the only medieval English cathedral with three spires. Highlights include a medieval wall painting, the famous Herkenrode stained glass and the Lichfield Angel. There's also a nice cafe which is a good place to stop for refreshments. Entry to the cathedral is free but you are encouraged to make a donation. You can also visit Erasmus Darwin House the home of Charles Darwin's Grandfather. Erasmus led a scientific revolution, founding the Lunar Society in the 18th century. There's a museum where you can explore Darwin's work through interactive exhibits, replica costumes and historical objects. There's also a restored Georgian herb garden that has been faithfully recreated with plantings of the period and features a relief sculpture of Erasmus Darwin. After exploring the cathedral area the walk heads to the delightful Stowe Pool reservoir. Nice footpaths take you around the water before returning to the tourist information centre. Just to the south of the tourist information centre you will find the Garrick Theatre, which is also well worth a visit. Also near here is the Samuel Johnson Birthplace Museum which is dedicated to the life and works of the author and lexicographer Samuel Johnson who wrote the first authoritative Dictionary of the English Language. Two long distance trails pass through the city so you can easily extend your walk. Heading north west along the Heart of England Way or the Two Saints Way will take you to the splendid Cannock Chase Country Park. Here you will find miles of great walking and cycling trails in an Area of Outstanding Natural Beauty. Heading south east takes you through the countryside to Kingsbury.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The King's Head is a historic pub of some note. The inn dates from the 15th century and is the oldest coaching inn in the city. You can find them at 21 Bird Street, with postcode WS13 6PW for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Dog Walking",
      "content": ""
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area pick up the Lichfield Canal Walk and enjoy an easy waterside walk and a pretty canalside park. To the south there's the village of Shenstone where you can pick up the Shenstone Walk to the Wall Roman Site. The English Heritage run site includes the ancient remains of the town and an interesting museum. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FKowrri3SiQ",
  "postcode": "WS13 6JR",
  "district": "Lichfield",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Earl of Lichfield (Drum), 8, Conduit Street, Dimbles, Lichfield, Staffordshire, England, WS13 6JR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "park",
    "lakeside",
    "urban"
  ],
  "points_of_interest": [
    "historical sites",
    "museums",
    "sculptures",
    "architecture"
  ],
  "facilities": [
    "visitor center",
    "cafe",
    "museum",
    "car park",
    "theatre",
    "museum"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}