{
  "created_at": "2025-01-06T00:25:34.017818+00:00",
  "objectID": "1e7deba0adf88e693257adb035e97934",
  "ref": "elie-and-earlsferry-chain-walk",
  "title": "Elie and Earlsferry Chain Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a9/At_Kincraig_Point_-_geograph.org.uk_-_5764717.jpg?20231119133329",
  "nearby": [
    {
      "description": "Fife Coastal Path",
      "objectID": "636c198ff6841e6415f206ca7cfb9ab8",
      "ref": "fife-coastal-path-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1e7deba0adf88e693257adb035e97934.gpx",
  "_geoloc": {
    "lat": 56.1872715753,
    "lng": -2.8126046887
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/At_Kincraig_Point_-_geograph.org.uk_-_5764717.jpg?20231119133329",
      "title": "At Kincraig Point by Mary and Angus Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "At Kincraig Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Elie_Chain_Walk_-_geograph.org.uk_-_1006382.jpg/256px-Elie_Chain_Walk_-_geograph.org.uk_-_1006382.jpg?20110223070925",
      "title": "ronnie leask / Elie Chain Walk",
      "caption": "Elie Chain Walk. This 'walk' is only possible from half ebb to half flood tide over low tide and traverses the base of the cliff at Kincraig, in places utilising chains both horizontal and vertically to ascend and descend short sections.It runs for around a quarter of a mile. Steps have also been cut in the rock. A most enjoyable adventure with much of geological interest. Whilst nowhere difficult care needs to be taken and it does need a certain stamina and head for heights.It can be easily avoided by taking the path over the top of the cliff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Devil%27s_Cave%2C_Kincraig_Point_-_geograph.org.uk_-_2774809.jpg/256px-Devil%27s_Cave%2C_Kincraig_Point_-_geograph.org.uk_-_2774809.jpg?20211124062544",
      "title": "Devil's Cave, Kincraig Point by Jackie Proven, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Devil's Cave, Kincraig Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Kincraig_volcano_%2810115885895%29.jpg?20190206225748",
      "title": "Oor Woolie, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Kincraig volcano"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/The_Elie_Chain_Walk_-_geograph.org.uk_-_1003418.jpg?20110223084116",
      "title": "ronnie leask / The Elie Chain Walk",
      "caption": "In 1929 chains were secured to the rocks at Kincraig cliff to create an exhilarating and strenuous traverse along the base of the cliff.The original chains were recently replaced by stainless steel chains securely bolted to the rocks.This 'walk'is only possible during low water period from half-tide and great care should be taken since it could be potentially dangerous."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Chain_walk_entry_to_Macduff%27s_cave_-_geograph.org.uk_-_537904.jpg?20110205192432",
      "title": "James Allan / Chain walk entry to Macduff's cave",
      "caption": "Entry to Macduff's cave. Almost 45 years after the similar photo already submitted, the old rusty chain has been replaced by sturdier stainless-steel chains and eyes, but the excitement of the expedition is still the same."
    }
  ],
  "distance_km": 9.0,
  "description": "This exhilarating scramble and climb takes you along a rocky path in Elie and Earlsferry, on the Fife Coast. You'll follow the chain along a challenging trail which requires a fair degree of nerve, skill and balance. Please also note that the route should not be attempted at high tide. You should check tide times before you go and be sure to start the chain section of the walk at least two hours before high tide. The full walk from Elie should obviously be started even earlier as it takes nearly an hour to reach the chain section from the town. The walk starts at the public car parking area in the village of Elie. From here you can follow the Fife Coastal Path west towards Earlsferry and its golf course. Around Kincraig you can pick up the Chain Walk and continue west past Macduff's Cave, Kincraig Point and Devil's Cave. You'll pass some splendid rock formations and enjoy some stunning coastal views as you make your way along the path. Please be sure to take great care as you make your way along the uneven and often steep surfaces. Good footwear is essential for this walk.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The chain walk is not suitable for dogs as some of the areas are very steep with uneven surfaces."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can continue your walking on the Elie to Pittenweem Walk and the Lower Largo and Shell Bay Walk. The delightful bay and the ancient fishing village are well worth exploring. Alexander Selkirk the prototype for Defoe's fictional Robinson Crusoe was born in Lower Largo in 1676. There is a statue dedicated to him in the village."
    },
    {
      "subtitle": "Visitor Reviews",
      "content": "\"An amazing experience, but definitely not for the faint-hearted! Some of the chains are quite challenging, but the views make it all worthwhile.\" \"A thrilling coastal walk with stunning scenery. It was a bit scary at times, but the sense of accomplishment at the end was incredible!\" \"Perfect adventure for those looking for something unique in Scotland. The chains add an exciting edge, and the landscape is breathtaking.\" \"Great mix of hiking and climbing. Not too difficult if you’re fit, but be cautious with the tides—certain parts are impossible at high tide.\" \"Really fun and different! There were a few tricky spots, but it’s well worth it if you want a coastal walk with a twist.\""
    }
  ],
  "video_url": "https://www.youtube.com/embed/ELGWbY4xBDs?si=oo8pTTVX7ai6s2sl",
  "county": "Fife",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wadeslea, Elie, Elie and Earlsferry, Fife, Alba / Scotland, KY9 1BJ, United Kingdom",
  "postcode": "KY9 1BJ",
  "district": "Elie and Earlsferry",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "1 hour",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rocky"
  ],
  "points_of_interest": [
    "viewpoints",
    "rock formations"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}