{
  "created_at": "2025-01-06T02:25:16.721330+00:00",
  "objectID": "1e8c5799de9d1a0c2c3049f9be3a7437",
  "ref": "caledonian-canal-walking-and-cycle-route",
  "title": "Caledonian Canal Walk and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/37/The_Caledonian_Canal._-_geograph.org.uk_-_981474.jpg",
  "nearby": [
    {
      "description": "River Ness",
      "objectID": "9d5d66930ea9d51336f73e979b51458a",
      "ref": "river-ness-walking-route"
    },
    {
      "description": "Loch Ness",
      "objectID": "dc49d24d3791e41f770e85bff9835181",
      "ref": "loch-ness-walking-and-cycle-route"
    },
    {
      "description": "Great Glen Way",
      "objectID": "b94ae1a45d71491d745f5c4e27b02dd1",
      "ref": "great-glen-way-walking-and-cycle-route"
    },
    {
      "description": "Loch Lochy",
      "objectID": "d36057e132870a010648b1e27ed625b0",
      "ref": "loch-lochy-walking-and-cycle-route"
    },
    {
      "description": "Dores Beach",
      "objectID": "18675c2039efd4bcb066b3830ca1c014",
      "ref": "dores-beach-walking-route"
    },
    {
      "description": "Loch Duntelchaig",
      "objectID": "a64789ee55d0707936bec88febbdb542",
      "ref": "loch-duntelchaig-walking-route"
    },
    {
      "description": "Loch Ruthven",
      "objectID": "404fdf3c3f9ef74d81137209a609afb2",
      "ref": "loch-ruthven-walking-route"
    },
    {
      "description": "Inverness Canal and Forest Walk",
      "objectID": "dc35edc24e3b8c443bafa82499e95a87",
      "ref": "inverness-canal-and-forest-walk-walking-route"
    },
    {
      "description": "Clava Cairns and Culloden Viaduct",
      "objectID": "c5db0386ff4a30d511bff76c97ceb097",
      "ref": "clava-cairns-and-culloden-viaduct-walking-route"
    },
    {
      "description": "Beauly River Walk",
      "objectID": "ffede12dda6536aa261f2932132d9234",
      "ref": "beauly-river-walk"
    },
    {
      "description": "Muir of Ord",
      "objectID": "66e70e97108ff53910fc9bfa708c2abf",
      "ref": "muir-of-ord-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1e8c5799de9d1a0c2c3049f9be3a7437.gpx",
  "_geoloc": {
    "lat": 57.4890787482,
    "lng": -4.2555466396
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/The_Caledonian_Canal._-_geograph.org.uk_-_981474.jpg",
      "title": "james denham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Caledonian Canal. In the old days the canal was an important route, allowing fishing boats from the east coast of Scotland to take a 'short cut' in order to fish the west coast, and vice versa.It was the A1 of Scottish waterways. While fishermen still use the route, it is much less busy now. Now the old canal is the domain of pleasure craft, still making use of the short cut across land or simply cruising up and down taking in the wonderful Highland scenery. Here we see pleasure craft approaching the lift bridge of Oich."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Caledonian_Canal_-_geograph.org.uk_-_999996.jpg",
      "title": "John Allan / Caledonian Canal",
      "caption": "Looking towards Loch Ness from the swing bridge on the A82. Designed by Thomas Telford in the early 19th century, the Caledonian Canal was constructed to provide a navigable route across Scotland, linking the east coast near Inverness to the west coast at Corpach near Fort William. The canal incorporates several natural lochs, including Loch Dochfour and the famous Loch Ness, with only one third of its length being man-made."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Caledonian_Canal_-_geograph.org.uk_-_642588.jpg",
      "title": "Jo Turner / Caledonian Canal",
      "caption": "Taken from the railway swing bridge at the foot of Neptune's Staircase. The stretch of the Caledonian Canal from Inverness to Loch Dochfour offers a diverse array of flora and fauna. Along the canal banks, you'll encounter a variety of plant species, including reeds, sedges, and wildflowers that thrive in the moist environment. These plants provide habitat and food sources for numerous insects and bird species. In the surrounding woodlands, trees such as Scots pine and birch support wildlife including red squirrels and various bird species. The canal's waters are home to fish species like brown trout and pike, attracting herons and otters that may be spotted by observant visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Caledonian_Canal_at_Gairlochy_-_geograph.org.uk_-_14194.jpg",
      "title": "J M Briscoe / Caledonian Canal at Gairlochy",
      "caption": "Caledonian Canal at Gairlochy."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/On_the_Caledonian_Canal_at_Banavie_-_geograph.org.uk_-_888735.jpg",
      "title": "Colin Smith / On the Caledonian Canal at Banavie",
      "caption": "Banavie. Canoes and pleasure craft sharing the water near the southern end of the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Mooring_jetties_by_the_Caledonian_Canal_-_geograph.org.uk_-_1544117.jpg",
      "title": "Stanley Howe / Mooring jetties by the Caledonian Canal",
      "caption": "Near the Beauly Firth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/The_Caledonian_Canal_to_the_southwest_of_Gairlochy_-_geograph.org.uk_-_1343484.jpg",
      "title": "Walter Baxter / The Caledonian Canal to the southwest of Gairlochy",
      "caption": "To the southwest of Gairlochy"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Caledonian_Canal_at_Loy_Sluices_-_geograph.org.uk_-_888755.jpg",
      "title": "Colin Smith / Caledonian Canal at Loy Sluices",
      "caption": "Loy Sluices. The sluices carry excess water down to the River Lochy. In the distance is Monadh Uisge Mhuilinn."
    }
  ],
  "distance_km": 9.0,
  "description": "Follow the Caledonian Canal from Inverness to Loch Dochfour on this waterside walk or cycle in the Scottish Highlands. The flat towpath is ideal for an easy cycle or walk in beautiful surroundings. The route starts at the Muirtown Basin in Clachnaharry on the Beauly Firth. You then head south through Inverness passing the Ship Space interactive maritime museum and Whin Park where you can board the Ness Islands Miniature Railway. The canal then leaves the city and heads through some beautiful countryside to Loch Dochfour which feeds Loch Ness. You can continue your walking in the area by picking up the Great Glen Way. The long distance trail also starts in Inverness, running parallel to the canal. It will take you to Fort William via Loch Ness and Loch Lochy. The canal also runs alongside the River Ness so you could try the waterside trail to Whin Park, through the city. The Caledonia Way also runs along the canal. This epic cycle route runs for 234 miles from Campbeltown to Inverness. It's a great way of continuing your cycling or walking in the area. You can virtually follow the first section of the canal from Inverness using the google street view link below!",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Moorings Hotel overlooks the canal in Banavie. You can sit outside on the decking area and enjoy fine views of Ben Nevis and Neptune's Staircase, the longest lock flight in Scotland."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Inverness Canal and Forest Walk will take you along the canal before heading to Craig Phadrig Forest, which lies just to the west of the city. The forest is a peaceful place for walks and includes a viewpoint with an Iron Age Hillfort.Near Inverness you could head a short distance north east to visit one of the historic highlights of the area at Culloden Battlefield. There's a circular walking trail here which explores the site of the famous battle of 1746. The site includes an informative visitor centre where you can learn all about this fascinating conflict. On the south eastern side of the battlefield there's also the Clava Cairns and the Culloden Viaduct. The ancient Bronze Age site includes prehistoric burial monuments and the remains of a medieval chapel. It's also a short walk from the eye catching Culloden Viaduct which carries the Highland Main Line over the River Nairn. A few miles to the west there's the popular village of Beauly. It's a lovely place to visit with a number of independent shops, cherry blossom trees, a pretty square and the ruins of the 13th century priory to see. The Beauly River Walk will take you along the River Beauly with fine views across the Beauly Firth. For more walking ideas in the area see the Scottish Highlands Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/as-meSBcbY0",
  "postcode": "IV3 8RA",
  "district": "Inverness",
  "county": "Highland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "2, High Street, Clachnaharry, Muirtown, Inverness, Highland, Alba / Scotland, IV3 8RA, United Kingdom",
  "state": "Alba / Scotland"
}