{
  "objectID": "1e9455c9f12a184f6c7a757f4928c610",
  "created_at": "2024-12-18T00:38:54.479004+00:00",
  "ref": "penzance-walking-route",
  "title": "Penzance Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/96/North_Pier%2C_Penzance_-_geograph.org.uk_-_930441.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/27EFE1A8B768426A8625868500427BA7/$FILE/Penzance.gpx",
  "_geoloc": {
    "lat": 50.1203315407,
    "lng": -5.5316676826
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/North_Pier%2C_Penzance_-_geograph.org.uk_-_930441.jpg",
      "title": "Bob Embleton / North Pier, Penzance",
      "caption": "North Pier, Penzance. Built to enclose a large area of calm harbour water. The northern end of the harbour has been converted into a large, popular car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Penzance_Harbour_-_geograph.org.uk_-_163959.jpg",
      "title": "Phil Williams / Penzance Harbour",
      "caption": "Penzance Harbour. A view looking east to the harbour entrance as the motor cruiser 'Jo-Jo' waits for the tide before entering. The South Pier is at right and St. Michaels Mount can be seen in the distance at centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Bowling_Green%2C_Wherry_Town_-_geograph.org.uk_-_925832.jpg",
      "title": "Bob Embleton / Bowling Green, Wherry Town",
      "caption": "Bowling Green, Wherry Town"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Fishermen_memorial%2C_Newlyn_-_geograph.org.uk_-_925167.jpg",
      "title": "Bob Embleton / Fishermen memorial, Newlyn",
      "caption": "Fishermen memorial, Newlyn. A nearby plaque reads: \"This Memorial To Fishermen Lost At Sea Was Unveiled By HRH The Princess Royal 11 October 2007\". With a footnote: \"Their names are recorded at the Mission, Newlyn\". The town and harbour of Penzance can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/St_Peter%27s_Church%2C_Newlyn_-_geograph.org.uk_-_501812.jpg",
      "title": "Tony Atkin / St Peter's Church, Newlyn",
      "caption": "St Peter's Church, Newlyn. In the cramped confines of Newlyn's narrow streets it is tricky getting a view of the whole church. This shot shows the southern aspect of the eastern half of the church. The parish of Newlyn was formed in 1848 as a response to the growth of this fishing village, the church however was not built for some years and was opened in 1866."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Drift_Reservoir_-_geograph.org.uk_-_80955.jpg",
      "title": "Sheila Russell / Drift Reservoir",
      "caption": "Drift Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/View_from_the_terrace_of_Trengwainton_Garden_-_geograph.org.uk_-_1388308.jpg",
      "title": "Sarah Charlesworth / View from the terrace of Trengwainton Garden",
      "caption": "View from the terrace of Trengwainton Garden. St Michael's Mount can be seen in the distance over the pine trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/The_Turks_Head_Pub%2C_Penzance_%28geograph_3650940%29.jpg/512px-The_Turks_Head_Pub%2C_Penzance_%28geograph_3650940%29.jpg",
      "title": "Mike Smith / The Turks Head Pub, Penzance",
      "caption": "The Turks Head Pub, Penzance. This is in Chapel Street, and is the oldest public house in Penzance. It was also the first pub in England to be named the Turks Head. As with other taverns in Penzance, there is a smuggler's tunnel leading directly from the harbour."
    }
  ],
  "distance_km": 16.0,
  "description": "This Cornish fishing port has some lovely coastal trails, countryside paths, a local reservoir, nearby parks and two scenic gardens to visit. It's also the place where you can catch the boat over to the Isles of Scilly where you can try the splendid St Mary's Coast Path . This circular walk from the town takes you along the coast before visiting some of the inland local highlights at Drift Reservoir , Trewidden Gardens, Trengwainton Gardens and the neighbouring village of Newlyn. The walk starts next to the Albert Pier where you can pick up the South West Coast Path and follow the waymarked footpath along the harbour and the docks towards Chimney Rocks. You continue south west to the promenade at Wherrytown, passing the coastal Bolitho Gardens before coming to Newlyn. The pretty village includes another nice harbour, a noteworthy art gallery and the Newlyn Coombe River. The route then heads inland to visit Drift reservoir where there's some lovely views across the water to the surrounding Cornish countryside. On the eastern side of the water there's the scenic Trewidden Gardens where there's some lovely trees, flowers and ponds to see. After exploring the gardens you head north towards Tremethick Cross and Boswednen where you can visit the Trengwainton Gardens. Here you'll find woodland trails, walled gardens, tranquil ponds and excellent views over the area from the elevated position of the site. From the gardens you head past the Boscathnoe Reservoir before descending back into the town. To continue your walking from the town pick up the St Michaels Way and head east to visit St Michael's Mount.",
  "video_url": "https://www.youtube.com/embed/N0Dk3-5Tx-w",
  "district": "Penzance",
  "county": "Cornwall",
  "region": "South West",
  "country": "England"
}