{
  "created_at": "2025-01-06T03:42:17.840610+00:00",
  "objectID": "1e988ff0790958e4adcd5f95c8ac548b",
  "ref": "attleborough-walking-route",
  "title": "Attleborough Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Attleborough_railway_station_-_geograph.org.uk_-_1408035.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1e988ff0790958e4adcd5f95c8ac548b.gpx",
  "_geoloc": {
    "lat": 52.5146383943,
    "lng": 1.0216428665
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Attleborough_railway_station_-_geograph.org.uk_-_1408035.jpg",
      "title": "Evelyn Simak / Attleborough railway station",
      "caption": "Attleborough railway station. Attleborough started out as a station of the Norfolk Railway and was later run by the Great Eastern Railway, before becoming part of the London and North Eastern Railway in 1923. As part of the 'Rural Stations Restaffing Initiative' a new Ticket Office opened in 2008, and presently the station is served by local services operated by East Midlands Trains and the Breckland Line, running from Norwich to Ely, Cambridge and Peterborough. The old signal box is still in place and staffed, and the crossing gates on Station Road (B 1077) have to be manually closed and opened by the signalman"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/St_Mary%27s_church_-_geograph.org.uk_-_701948.jpg",
      "title": "Evelyn Simak / St Mary's church",
      "caption": "St Mary's church. Originally a cruciform-shaped church, the Church of the Assumption of the Blessed Virgin Mary dates from Saxon times, when St Edmund spent a year with priests at Attleborough before his coronation in 856. The church was partitioned off at the chancel for the use of a college of five priests in 1386. At the dissolution of the monasteries the college was closed and the chancel demolished. Consecration crosses survive from the original date of the building and there is a fragmented wall painting depicting St Christopher above the south doorway. The rood screen, with rood loft above, extends across both aisles and tower arch dates from 1475 and depicts St John the Baptist, St Mary, St John the Evangelist, St Thomas a Becket, the Holy Trinity and St Bartholomew. The shields of the 24 bishoprics above were added later. The large wall painting above the screen was created for the college of priests around 1500. The two Norman windows were reopened and embellished with pseudo-Norman stonework in 1844."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Houses_in_Hargham_Road_-_geograph.org.uk_-_1402761.jpg",
      "title": "Evelyn Simak / Houses in Hargham Road",
      "caption": "Houses in Hargham Road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Attleborough_Village_-_geograph.org.uk_-_879823.jpg",
      "title": "Beryl Allcoat / Attleborough Village",
      "caption": "Attleborough Village"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/54/Old_Buckenham_Post_Office_and_Shop_-_geograph.org.uk_-_1402765.jpg",
      "title": "Evelyn Simak / Old Buckenham Post Office and Shop",
      "caption": "Old Buckenham Post Office and Shop"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/All_Saints_Church%2C_Old_Buckenham%2C_Norfolk_-_geograph.org.uk_-_1394269.jpg",
      "title": "Evelyn Simak / All Saints Church",
      "caption": "All Saints Church, Old Buckenham, Norfolk"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Old_Buckenham_Mill.jpg/256px-Old_Buckenham_Mill.jpg",
      "title": "Jim Woodward-Nutt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The restored windmill at Old Buckenham, Norfolk. The mill dates from 1818."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Castle_at_New_Buckenham%2C_Norfolk._-_geograph.org.uk_-_150554.jpg",
      "title": "Andy Peacock / Castle at New Buckenham, Norfolk.",
      "caption": "Castle at New Buckenham, Norfolk."
    }
  ],
  "distance_km": 14.2,
  "description": "This Norfolk based town has some nice trails to follow through the surrounding valley of the River Tas. It's easily accessible by public transport with a train station providing a main line rail service to both Norwich and Cambridge. The historic settlement also includes a noteworthy parish church which dates from the Norman period. This walk from the town uses part of the Tas Valley Way to take you to the neighboring village of Old Buckenham where you'll find England's largest village green and a 17th century pub. You then follow other country lanes back to Attleborough. The walk starts from the train station and heads through the town to pick up the Tas Valley Way. You can follow the waymarked trail south west along a country lane to Hargham Heath. You then head south east past Fen Street to Old Buckenham. The village includes a picturesque restored windmill and a pretty a village green. Nearby there's also Buckenham Castle and Old Buckenham Priory to visit. After exploring the village you retrace your steps to Inkerman Farm where you turn north along Leys Lane and Slough Lane. From here it is a short walk back to the train station where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The White Lodge is a good choice for post walk refreshment. The delightful old thatched pub includes a good sized outdoor area where you can relax on warmer days. You can find them on London Road at a postcode of NR17 1AY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the White Lodge mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could extend the walk by continuing along the Tas Valley Way to New Buckenham where there's the remains of the old castle. Head west from the town and you could pick up the Peddars Way and Norfolk Coast Path National Trail around Hockham Heath. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/krgOCo9iqDY",
  "district": "Breckland",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "New North Road, Attleborough, Besthorpe, Breckland, Norfolk, England, NR17 2BG, United Kingdom",
  "postcode": "NR17 2BG",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "country lane"
  ],
  "points_of_interest": [
    "historic church",
    "village green",
    "windmill",
    "priory",
    "countryside"
  ],
  "facilities": [
    "train station",
    "pub",
    "village green"
  ],
  "route_type": "loop",
  "activities": [
    "walking"
  ]
}