{
  "created_at": "2025-01-06T10:35:37.208424+00:00",
  "objectID": "1ed31211a3d8992fa0de9f13f05e12a5",
  "ref": "chatsworth-park-walking-route",
  "title": "Chatsworth Park Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Chatsworth_House_-_geograph.org.uk_-_406902.jpg",
  "nearby": [
    {
      "description": "Derwent Valley Heritage Way",
      "objectID": "13871570524b1197efa9f0e608a7b222",
      "ref": "derwent-valley-heritage-way-walking-route"
    },
    {
      "description": "Birchen Edge",
      "objectID": "9ed906d8f5bb7f38957f9d962e7d5457",
      "ref": "birchen-edge-walking-route"
    },
    {
      "description": "Bakewell",
      "objectID": "10cecdad4b682e8a0ca4ead897f79f8f",
      "ref": "bakewell-walking-route"
    },
    {
      "description": "Baslow",
      "objectID": "047af676015cbfb08d7d625412b4d21a",
      "ref": "baslow-walking-route"
    },
    {
      "description": "Baslow Edge",
      "objectID": "a30c2856cce983c6c9f40becdbdf4292",
      "ref": "baslow-edge-walking-route"
    },
    {
      "description": "Rowsley",
      "objectID": "1a8828de3f50ab477824d89c9ab1e7ce",
      "ref": "rowsley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1ed31211a3d8992fa0de9f13f05e12a5.gpx",
  "_geoloc": {
    "lat": 53.2290134723,
    "lng": -1.6113685975
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Chatsworth_House_-_geograph.org.uk_-_406902.jpg",
      "title": "Roger Cornfoot / Chatsworth House",
      "caption": "Chatsworth House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Chatsworth_Bridge_-_geograph.org.uk_-_112435.jpg",
      "title": "George Mahoney / Chatsworth Bridge",
      "caption": "Chatsworth Bridge. The decorated and balustraded bridge leading from Edensor towards Chatsworth House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Kitchen_Garden_and_Stables_-_Chatsworth_-_geograph.org.uk_-_1712734.jpg/512px-Kitchen_Garden_and_Stables_-_Chatsworth_-_geograph.org.uk_-_1712734.jpg",
      "title": "Chris Page / Kitchen Garden & Stables - Chatsworth",
      "caption": "Kitchen Garden and Stables"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Chatsworth_Gardens_-_geograph.org.uk_-_597271.jpg",
      "title": "Alan Heardman / Chatsworth Gardens",
      "caption": "Flatbed Trailer by Wim Delvoye. Another work in the Sotheby's 'Beyond Limits' exhibition."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/The_Cascade%2C_Chatsworth_-_geograph.org.uk_-_26066.jpg",
      "title": "GaryReggae / The Cascade, Chatsworth",
      "caption": "The Cascade. A unique stepped waterfall in the grounds of one of Britain's finest stately homes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Hunting_Tower_Chatsworth_Geograph-1849122-by-Chris-Wimbush.jpg",
      "title": "Chris Wimbush, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hunting Tower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Chatsworth_sculpture_-_geograph.org.uk_-_947557.jpg",
      "title": "James Allan / Chatsworth sculpture",
      "caption": "Sculpture in the park. The sheer size of this sculpture dwarfs the visitors on Chatsworth lawn. Examine the statue carefully and you'll find it is made up of hundreds of the letters of the alphabet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Deer_in_Chatsworth_Park._-_geograph.org.uk_-_107732.jpg",
      "title": "Mike Fowkes / Deer in Chatsworth Park.",
      "caption": "Deer in the Park."
    }
  ],
  "distance_km": 9.0,
  "description": "This circular walk takes you around the splendid Chatsworth Park in the Derbyshire Peak District. There's 1000 acres of parkland to explore with views of the River Derwent, woodland trails and fallow deer. The park is in a great location for walking with some great options for extending your exercise. You could pick up the Derwent Valley Heritage Way long distance footpath which runs past the estate. You can follow it north to Baslow or south to Calton Lees. About a mile north east of Chatsworth you can enjoy a climb to Birchen Edge. The gritstone edge provides stunning views over the Derwent Valley from the high points. The park is not far from the lovely town of Bakewell. You could reach it by following the Bakewell Circular Walk from the town. This visits the nearby village of Edensor and the medieval Haddon Hall which is also well worth a visit.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the estate there's a good range of cafes and restaurants for refreshment. Click here for more information. Just to the north there's the village of Baslow where you could visit The Prince of Wales. The friendly pub does very good food and includes a roaring fire for winter days. In warmer weather you can relax on the Terrace garden and enjoy fine views of the surrounding hills. You can find the pub on Church Lane at a postcode of DE45 1RY for your sat navs. The inn is also dog friendly if you have your pet with you. Also in the village is the splendid Cafe on the Green. There's fine homemade food here with some particularly delicious cakes. You can find them at Nether End at postcode DE45 1SR. Head south and you could visit the village of Rowsley where you'll find the Peak Shopping Village. There's a good range of stores to browse at the attractively laid out modern shopping village. There's also plenty of good quality eateries for refreshment. Also in the village there's The Peacock hotel with a fine restaurant which has been awarded three AA rosettes. The hotel dates from the 1830s and is part of the Haddon Estate, owned by Lord and Lady Edward Manners who live at nearby Haddon Hall. At The Peacock there's also an informal bar area with an open fire and a good lunch menu. They have a lovely garden area and are located in a fine spot close to the river in the village. You can find them on Bakewell Road at postcode DE4 2EB for your sat navs. The 11th century Haddon Hall to the west of the village is another local highlight and well worth a visit if you have time. In the village there's also the Grouse and Claret which is housed in an attractive 18th Century building. They have a light conservatory and a beautiful beer garden with fine views of the Derbyshire countryside. There's a delightful interior with books, pictures and charming country farmhouse décor. They serve high quality food including delicious Rotisserie chicken. You can find them on Station Road with a postcode of DE4 2EB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The estate is a fine place for a dog walk with miles of woodland and parkland trails. You are requested to keep them on leads in the grounds and they are not allowed in the house. There are bins dotted around the estate and doggy drinking stations are available near the toilets, adjacent to the gate that leads to the entrance to the house, and also in the Stables courtyard near the Carriage House Cafe exit. The Grouse and Claret pub mentioned above is also dog friendly. On the southern side of the estate you'll find the worthy village of Beeley where you can explore the expansive Beeley Moor and visit the village's excellent 18th century coaching inn. The Devonshire Arms originated as three separate cottages in 1726 and was subsequently converted into an Inn in 1747. Visitors were transported by coaches from London and the Peak, stopping in Beeley's coaching inn so the horses could rest. Among them was the renowned author Charles Dickens, who visited frequently during his lifetime. It is also said that King Edward VII often met his mistress Alice Keppel at the inn. The inn serves good quality food and includes a pleasant garden area for warmer days. They also provide roooms if you would like to stay in the area. You can find them at Devonshire Square with postcode DE4 2NZ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can reach the house from the nearby village of Baslow by following the Derwent Valley Heritage Way along the river for just under 2 miles. See the Baslow to Chatsworth Walk for more details."
    }
  ],
  "video_url": "https://www.youtube.com/embed/j7GzV-tB_CA",
  "postcode": "DE45 1PP",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Chatsworth, Broadwalk, Chatsworth CP, Derbyshire Dales, Derbyshire, East Midlands, England, DE45 1PP, United Kingdom",
  "district": "Derbyshire Dales",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}