{
  "created_at": "2025-01-06T18:43:43.000167+00:00",
  "objectID": "1f20ed7db9fbad008500b8700e4f6aa9",
  "ref": "inistioge-walking-route",
  "title": "Inistioge Walks - Inistioge to Thomastown Walk",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Inistioge_bridge_-_geograph.org.uk_-_1539707.jpg",
  "nearby": [
    {
      "description": "Graiguenamanagh to St Mullins Walk",
      "objectID": "1ccb5fbbbc1908c9da397c9eb82c3f14",
      "ref": "graiguenamanagh-to-st-mullins-walk-walking-route"
    },
    {
      "description": "Barrow Way",
      "objectID": "0fedf8678227fffab5e7fb6777d66ba4",
      "ref": "barrow-way-walking-route"
    },
    {
      "description": "Kilkenny River and Canal Walk",
      "objectID": "189a945262bfbe88f4210c273ed85ebe",
      "ref": "kilkenny-canal-and-river-walk"
    },
    {
      "description": "Nore Valley Walk",
      "objectID": "56b3be97c892b939b219607f8e173354",
      "ref": "nore-valley-walk"
    },
    {
      "description": "South Leinster Way",
      "objectID": "84914fd23b624c4a9d1287db0ad14bac",
      "ref": "south-leinster-way-walking-route"
    },
    {
      "description": "Brandon Hill Loop",
      "objectID": "ef0d66bbd5c02c5ce6f0d530009405ce",
      "ref": "brandon-hill-loop-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1f20ed7db9fbad008500b8700e4f6aa9.gpx",
  "_geoloc": {
    "lat": 52.48835,
    "lng": -7.06341
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Inistioge_bridge_-_geograph.org.uk_-_1539707.jpg",
      "title": "Eirian Evans / Inistioge bridge",
      "caption": "Inistioge bridge. Located on the banks of the River Nore, Inistioge is accessed via a picturesque 10-arch stone bridge. The village features a charming tree-lined square and a collection of elegant 18th and 19th-century residences lining the riverbanks. Notably, Inistioge and its scenic village green have served as filming locations for several movies. Its growth during the 18th and 19th centuries was closely tied to the development of the Woodstock Estate, owned by the Tighe family."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/River_Nore_Trail_-_geograph.org.uk_-_966750.jpg",
      "title": "kevin higgins / River Nore Trail",
      "caption": "River Nore Trail just north of Inistioge. The earliest recorded mention of Inistioge dates back to a clash between the kingdom of Osraighi and a Norse army, documented in the Annals of the Four Masters in the year AD 962. Given its strategic position at the River Nore's lowest crossing point and the noted conflict between the Osraige and Olaf Cuaran, King of Dublin, in 964, it's plausible that Inistioge was initially settled by Vikings. In 1169, Thomas FitzAnthony was granted the land, and he established the Augustinian Priory in 1206. The priors played a pivotal role in expanding the community, but Inistioge faced adversity following the dissolution of the monasteries in 1540. By 1566, ownership of the Priory's assets had passed to Sir Edmond Butler. In 1608, Inistioge was officially designated as a town, with James I instituting weekly markets on Fridays and an annual fair on December 13th. However, the town endured turmoil during the Cromwellian attack in 1649, eventually falling under Cromwellian control. During the 18th and 19th centuries, significant development occurred as the village's central square was transformed into a planned estate village by the Tighe family of the Woodstock Estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Brownsbarn_Bridge_over_the_River_Nore_-_geograph.org.uk_-_64519.jpg",
      "title": "Crispin Purdye / Brownsbarn Bridge over the River Nore",
      "caption": "Brownsbarn Bridge over the River Nore. View from the west bank of the river. The Bridge now carries the R700, Thomastown to Inistioge road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/The_River_Nore_at_Brownsbarn_Bridge_-_geograph.org.uk_-_534000.jpg",
      "title": "Philip Halling / The River Nore at Brownsbarn Bridge",
      "caption": "The River Nore at Brownsbarn Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Dysart_Castle%2C_Thomastown%2C_Co._Kilkenny_-_geograph.org.uk_-_1106083.jpg/256px-Dysart_Castle%2C_Thomastown%2C_Co._Kilkenny_-_geograph.org.uk_-_1106083.jpg",
      "title": "Kieran Campbell / Dysart Castle, Thomastown, Co. Kilkenny",
      "caption": "Dysart Castle, Thomastown, Co. Kilkenny. Dysart is renowned as the childhood residence of George Berkeley (1685–1753), the distinguished Irish philosopher after whom Berkeley, California, and the Trinity College Dublin Berkeley Library are named. Presently under private ownership, the castle is in dire need of restoration. Situated to the south of Thomastown, the site once encompassed a medieval church, the castle, and other structures. Positioned low along the sharp bend of the River Nore, the castle and church grounds were initially contiguous. However, they became distinct entities, separated by a 21-foot gap. Dysart Castle, described as modestly constructed, featured a stone arch dividing it, with a pathway on the second floor leading to the church. The lands and edifices of Dysart were bestowed to the Priory of Kells by founder Geoffrey fitz Robert in 1193. Historical records indicate that it was referred to as Dysart of St. Mo-Colm-óg, suggesting that St. Colman was revered as the patron saint of the area. Until its dissolution in 1540, the church, castle, and adjacent property were under the ownership of the Priory of Kells. There are conflicting accounts regarding Berkeley's birthplace; nevertheless, he spent his formative years at Dysart, his family's residence situated beside Dysart Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Castle_near_Thomastown_-_geograph.org.uk_-_534005.jpg/256px-Castle_near_Thomastown_-_geograph.org.uk_-_534005.jpg",
      "title": "Philip Halling / Grenan (or Grennan) Castle",
      "caption": "Castle and river view near Thomastown"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Bridge_over_the_River_Nore%2C_Thomastown_-_geograph.org.uk_-_4452556.jpg/512px-Bridge_over_the_River_Nore%2C_Thomastown_-_geograph.org.uk_-_4452556.jpg",
      "title": "Bridge over the River Nore, Thomastown by Humphrey Bolton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Bridge over the River Nore, Thomastown. Thomastown, known in Irish as Baile Mhic Andáin and historically referred to as Grennan, is situated in the Leinster province of the southeastern region of Ireland. It stands as a bustling market town along the scenic River Nore, renowned for its abundant salmon and trout population, and boasts an array of historical landmarks in its vicinity. Notable attractions in the area include Jerpoint Abbey, Kilfane Glen gardens, and the esteemed Mount Juliet Golf Course. A prominent feature within Thomastown is Kilfane Glen, a meticulously restored historic garden dating back to the 1790s, complete with a picturesque waterfall, serene woodland trails, and charming ornamental cottages. Recognized as an Irish Heritage Garden, Kilfane Glen received assistance from the European Union Cultural Commission in 1993 to support its preservation and upkeep. The exquisite landscape within the Kilfane House demesne was meticulously crafted during the 1790s by the estate's proprietors, Sir John and Lady Power, with contributions from Sir Richard Power, Sir John's twin brother. Adjacent to the town lies the remarkable ruins of Jerpoint Abbey, a magnificent structure dating back to the 12th century. Furthermore, Thomastown boasts the nearby Grennan Castle, an imposing oblong-shaped fortress erected in the 13th century by Thomas FitzAnthony. While the castle remained well-maintained until the early 19th century, portions of it were subsequently dismantled for construction purposes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Herbaceous_borders%2C_Woodstock%2C_Inistioge%2C_Co._Kilkenny_-_geograph.org.uk_-_205298.jpg",
      "title": "Humphrey Bolton / Herbaceous borders, Woodstock, Inistioge, Co. Kilkenny",
      "caption": "Herbaceous borders, Woodstock, Inistioge, Co. Kilkenny. Woodstock Gardens are situated just on the outskirts of the picturesque village of Inistioge. Offering captivating views of the River Nore Valley, these gardens provide visitors with a diverse range of attractions, making it an ideal spot for a leisurely and enchanting day out. The gardens boast a delightful blend of formal and informal designs, featuring an arboretum, walled garden, terraced garden, yew walk, and rose garden as its main highlights. Noteworthy features include two magnificent avenues: the Monkey Puzzle Avenue, reputedly the longest in Europe, and the Noble Fir Avenue. Within the arboretum, visitors will encounter a plethora of exquisite specimen trees, with a particular emphasis on species from Asia and South America. Many of these trees have attained champion status due to their impressive size. Adjacent to the arboretum lies the Walled Garden, where fruit trees, a vegetable garden, and a captivating herbaceous border delight the senses. Just outside the Walled Garden stands a splendid cast iron conservatory, which is home to the charming Gardens Tea Room. Managed by Kilkenny County Council, the Gardens are currently undergoing continuous restoration efforts, with new features and plantings being introduced regularly."
    }
  ],
  "distance_km": 12.0,
  "description": "Inistioge is renowned as one of the most picturesque villages in Ireland, nestled in the stunning Nore valley and graced by a striking ten-arched bridge. Its charm emanates from a diverse collection of buildings, spanning from medieval structures to those from the Georgian and Victorian periods. Despite its compact size, Inistioge boasts a rich architectural heritage set against a backdrop of breathtaking panoramic views, making it a truly remarkable destination. This popular walk from the village takes you along the Nore Valley Way from Inistioge to Thomastown in County Kilkenny. You'll follow some pleasant riverside paths before heading through some lovely countryside towards Thomastown. To continue your riverside walking you can try the Nore Valley Walk which runs from nearby Kilkenny to Bennettsbridge. In Inistioge the beautiful Woodstock gardens are another lovely place for a stroll. See the photo below for more information on the gardens.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The South Leinster Way runs through the area. You could follow it north east to pick up the Barrow Way, a 100km walk following the River Barrow from Robertstown, County Kildare to St Mullins Walk in County Carlow. The Graiguenamanagh to St Mullins Walk is a popular section along the trail which starts in neighbouring Graiguenamanagh. Here you can also pick up the Brandon Hill Loop. The circular waymarked trail climbs to the summit of the the highest mountain in County Kilkenny. There are great views over the countryside to the coast from this fine vantage point."
    }
  ],
  "video_url": "https://www.youtube.com/embed/-WfYvW_oDcc?si=l_zlbNq83IxU9OlL&start=45",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Inistioge, The Municipal District of Callan — Thomastown, County Kilkenny, Leinster, R95 RK29, Éire / Ireland",
  "postcode": "R95 RK29",
  "district": null,
  "county": "County Kilkenny",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "river",
    "countryside"
  ],
  "points_of_interest": [
    "historical sites",
    "panoramic views"
  ],
  "facilities": [
    "visitor center",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}