{
  "created_at": "2025-01-05T23:46:40.753611+00:00",
  "objectID": "1f32f95eeb63267b803871dd746345ac",
  "ref": "claude-duval-bridleroute-walking-and-cycle-route",
  "title": "Claude Duval Bridleroute Walking and Cycle Route",
  "headline_image_url": "http://www.gps-routes.co.uk/routes/home.nsf/Counties/isle%20of%20wight/$FILE/isleofwight.jpg/",
  "nearby": [
    {
      "description": "Chipping Norton",
      "objectID": "d5f4e92a81e8142052c97b1ec1bfbdef",
      "ref": "chipping-norton-walking-route"
    },
    {
      "description": "Heythrop Park",
      "objectID": "97d8dc6138f52030cd615e48939f88ec",
      "ref": "heythrop-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1f32f95eeb63267b803871dd746345ac.gpx",
  "_geoloc": {
    "lat": 51.8738286492,
    "lng": -0.9154747004
  },
  "distance_km": 102.0,
  "description": "This shared walking and cycle path runs from Quainton, near Aylesbury in Oxfordshire to Great Barrington in the Cotswolds. This route is named after the well-known local highwayman, Claude Duval. It starts at Quainton and passes Stratton Audley, Bicester and Bucknell before crossing the Oxford Canal near Woodstock. The route then heads towards Chipping Norton and then Spelsbury where you join the River Evenlode for a short waterside stretch to Ascott d'Oyley. You then head onto Great Barrington via Fifield. For cyclists a hybrid or mountain bike is required for this route. This is a fairly challenging route but with some fabulous Cotswolds scenery to enjoy.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Chipping Norton has a fine selection of old pubs for some refreshments after your walk. The Cheqeurs is a great choice with its cosy atmosphere, traditional decor and open fire. There's also a lovely bright conservatory area. The pub is in fact the oldest building in town - built more than 500 years ago. You can find it right at the old entrance to the town’s famous market place on Goddard Lane with a postcode of OX7 5NP."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just east of Chipping Norton there's Heythrop Park to explore. The 18th century hotel is surrounded by some beautiful parkland and gardens with miles of walking and cycling trails to try."
    }
  ],
  "district": "Quainton",
  "county": "Buckinghamshire",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}