{
  "created_at": "2025-01-06T03:57:31.501828+00:00",
  "objectID": "1f3c435121926abfdb3810d10830f690",
  "ref": "bray-to-greystones-walking-route",
  "title": "Bray to Greystones Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/97/Bray_Strand_-_geograph.org.uk_-_1590320.jpg",
  "nearby": [
    {
      "description": "Lough Bray Loop",
      "objectID": "6d09a3ab8832017f3bda29900774b7f2",
      "ref": "lough-bray-loop-walking-route"
    },
    {
      "description": "Barnaslingan and Carrickgollogan",
      "objectID": "d20a0e333b8a6e53b2ad238f6615c3e4",
      "ref": "barnaslingan-and-carrickgollogan-walking-route"
    },
    {
      "description": "Crone Woods",
      "objectID": "c7127a322940f00c0783c17fe68a775b",
      "ref": "crone-woods-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1f3c435121926abfdb3810d10830f690.gpx",
  "_geoloc": {
    "lat": 53.2040298675,
    "lng": -6.0985648258
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Bray_Strand_-_geograph.org.uk_-_1590320.jpg",
      "title": "Dean Molyneaux / Bray Strand",
      "caption": "Bray Strand"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Looking_along_the_railway_at_Bray_Head_-_geograph.org.uk_-_1323345.jpg",
      "title": "Stuart Fisher / Looking along the railway at Bray Head",
      "caption": "Looking along the railway at Bray Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/View_of_Bray_Head_-_geograph.org.uk_-_1353208.jpg",
      "title": "sarah gallagher / View of Bray Head",
      "caption": "View of Bray Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/The_DART_passing_around_Bray_Head_-_geograph.org.uk_-_917332.jpg",
      "title": "David Quinn / The DART passing around Bray Head",
      "caption": "The DART passing around Bray Head"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/The_Bray-Greystones_Cliff_Path_-_geograph.org.uk_-_917307.jpg",
      "title": "David Quinn / The Bray-Greystones Cliff Path",
      "caption": "The Bray-Greystones Cliff Path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/View_of_Greystones_and_Coast_-_geograph.org.uk_-_917304.jpg",
      "title": "David Quinn / View of Greystones and Coast",
      "caption": "View of Greystones and Coast"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/The_Bray-Greystones_Cliff_Path_-_geograph.org.uk_-_917300.jpg",
      "title": "David Quinn / The Bray-Greystones Cliff Path",
      "caption": "The Bray-Greystones Cliff Path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Greystones_Harbour_-_geograph.org.uk_-_85267.jpg",
      "title": "Steve Edge / Greystones Harbour",
      "caption": "Greystones Harbour"
    }
  ],
  "distance_km": 8.5,
  "description": "This spectacular cliff top route in County Wicklow is one of the most popular walks in Ireland. It runs between the towns of Bray and Greystones, for a distance of just over 5 miles, on an undulating well trodden path. You'll pass along the Dublin-Wicklow railway line which runs outside of Bray Head along the coast, sometimes travelling within a few feet of the cliffs. The line, designed by Isambard Kingdom Brunel, is referred to as Brunel's Folly, due to the high costs of maintaining such a precariously positioned line. There are train stations in both towns so you can catch a ten minute service back to Bray at the end of the walk. The area is great for wildlife watchers. Look out for dolphins, whales, porpoises and basking sharks as you make your way along the path. Many varieties of sea birds can also be seen around the cliff tops. Keep your eyes peeled for Gannet, Kittiwake, Great Black-Backed Gull, Guillemots, Kestrels and Fulmar. The variety of flora on the route is also impressive. In the summer months you can see several types of wildflower, heather, bracken and gorse. The walk starts on the sea front in Bray, next to Bray Daly train station. Head south along the beach to Crab Rock where you cross the train line. Here you have the option of heading up to Bray Head. The hill stands at a height of 241 m (791 ft), commanding wonderful views over the area. At the summit you will find a concrete cross, placed there in 1953 during the holy year. Every Good Friday, hundreds of local people climb to the top of the head in a Good Friday procession marking the stations of the Cross. The route then descends back to the cliff top path where you continue south east to Brandy Hole and on to Greystones with fabulous views of the Irish Sea, The Wicklow Mountains and Bray. The final section takes you past Greystones Harbour before finishing on the front, close to the train station. At the end of your exercise you can enjoy refreshments at one of the fine pubs or cafes in Greystones. To continue your walking in the area head inland to visit the Lough Bray Loop, Crone Woods and Powerscourt Waterfall. The falls are located in a beautiful spot on the River Dargle and is the highest waterfall in Ireland.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north you can pick up the epic Dublin Mountains Way in Shankill. The popular waymarked trail takes you west into the stunning scenery of the Wicklow Mountains. Here you can visit Barnaslingan and Carrickgollogan where there's fine viewpoints, woodland trails, historic leadmines and a noteworthy ruined ancient church. To the south is the village of Delgany and try the Delgany Heritage Trail. The waymarked circular loop walk visits some of the interesting historical landmarks in the village. Near here there's also the Glen Of The Downs. The nature reserve includes some fine ancient woodland, the interesting remains of an historic estate and some wonderful viewpoints."
    }
  ],
  "video_url": "https://www.youtube.com/embed/IKFr2M3BdRE",
  "gazetteer_found": false
}