{
  "created_at": "2025-01-06T00:53:32.396573+00:00",
  "objectID": "1ff613659d385d1b03bc54cdab981f59",
  "ref": "pennard-castle-walking-route",
  "title": "Pennard Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Footsteps_towards_Pennard_Castle_-_geograph.org.uk_-_1499485.jpg",
  "nearby": [
    {
      "description": "Bishopston Valley",
      "objectID": "81c2514bbc7891834b1da169a61df769",
      "ref": "bishopston-valley-walking-route"
    },
    {
      "description": "Three Cliffs Bay",
      "objectID": "55dc69e0b8dec6ed32484cc1408678bd",
      "ref": "three-cliffs-bay-walking-route"
    },
    {
      "description": "Gower Way",
      "objectID": "78289f2774ce7719915e1994568502d9",
      "ref": "gower-way-walking-route"
    },
    {
      "description": "Cefn Bryn",
      "objectID": "fba63d03bdc61f60db42021d5c4aa48f",
      "ref": "cefn-bryn-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1ff613659d385d1b03bc54cdab981f59.gpx",
  "_geoloc": {
    "lat": 51.5671206147,
    "lng": -4.0875851054
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Footsteps_towards_Pennard_Castle_-_geograph.org.uk_-_1499485.jpg",
      "title": "Kev Griffin / Footsteps towards Pennard Castle, via Wikimedia Commons",
      "caption": "Footsteps towards Pennard Castle, Inland about 500 yards from the main beach on high ground above Pennard pill is Pennard Castle. It was built in the early 12th century, and is imbued with legends of fairies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Pennard_Castle_1.jpg/512px-Pennard_Castle_1.jpg",
      "title": "Eiona Roberts from Wales [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "The castle sits precariously at the top of a very sandy cliff."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Pennard_Castle_Ruins_-_geograph.org.uk_-_415060.jpg",
      "title": "Andy Jenkins / Pennard Castle Ruins, via Wikimedia Commons",
      "caption": "An ideal site for a castle, the remains of the one at Pennard overlooks the magnificent views of Three Cliffs Bay. The castle is believed to date back to the 14th Century although there may have been earlier settlements on the site previous to that."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Ruins_of_Pennard_Castle_-_geograph.org.uk_-_70556.jpg",
      "title": "Christine Matthews / Ruins of Pennard Castle, via Wikimedia Commons",
      "caption": "Ruins of Pennard Castle with coastal view beyond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Pennard_Burrows_-_geograph.org.uk_-_1307929.jpg",
      "title": "ceridwen / Pennard Burrows",
      "caption": "Pennard Burrows. This view, from close to the castle, shows grassed-over sand dunes which, during the C13-15, were responsible for the be-sanding of the castle, the old church, an earlier settlement and agricultural land in this area. Climatic conditions during the period included strong westerlies which blew loose sand inland. The inhabitants found it hard to make a living and to maintain tithes and taxes so were eventually forced out. Subsequently there was a rabbit warren here (although the word burrows, used in South Wales for sand dunes, is not I think rabbit-related in this case.) The burrows are more stable now but could impending climate change result in further land loss?"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/St_Mary%27s_church%2C_Pennard_-_geograph.org.uk_-_1308290.jpg",
      "title": "ceridwen / St Mary's church, Pennard",
      "caption": "St Mary's church. The history of this church is something of a puzzle: it succeeded as parish church another, now-ruined, St Mary's, on Pennard Burrows, which was inundated by sand and abandoned in the C16. However it would appear from several mediaeval features here that this church is as old, if not older, than the ruined church which lay a mile away, by Pennard castle and the settlement that once existed there. This church stands on the road between Southgate and Kittle near the settlement called Highway and just south of Kilvrough Manor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Shifting_sands_at_Pennard_-_geograph.org.uk_-_1305975.jpg",
      "title": "ceridwen / Shifting sands at Pennard",
      "caption": "Shifting sands. Pennard Burrows is an unstable terrain where wind-blown sand has covered pre-historic and mediaeval settlement remains alike. It was part of the manorial demesne for both hunting and grazing and continued as a coney warren until more recent times. In this image, showing the descent to Pobbles bay from Bendrick Drive, below the golf course, typical vegetation such as gorse, bracken and scrub is visible together with occasional stands of coniferous and broad-leaved trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/View_over_the_rough_-_geograph.org.uk_-_1307637.jpg",
      "title": "ceridwen / View over the rough",
      "caption": "View over the rough. The links at Pennard is full of natural contours; the view beyond, across the valley, reveals the eastern end of Cefn Bryn with the village of Pen Maen below."
    }
  ],
  "distance_km": 6.0,
  "description": "Visit this ruined 12th century castle and explore the beautiful Pennard Burrows on this circular walk on the Gower Peninsula. It's a stunning area with a wooded valley and the fresh water river of Pennard Pill. The walk starts from the large parking area at West Cliff and heads along the coast to Shire Combe with wonderful views over Three Cliffs Bay (you can actually explore this section of the coast path on the google street view link below). There are nice wide grassy footpaths through fields surrounded by gorse bushes on this section. You then head through Pennard Burrows to Pennard Castle, crossing the delightful Pennard Pill on the way. The walk continues to the ruins on sandy paths. The castle is a grade II listed building and a scheduled ancient monument with a fascinating history stretching back several centuries. There's great phot opportunities with the beautiful coast making a splendid backdrop to the atmospheric ruins. If you would like to extend your walking in the area then you could try the Three Cliffs Bay Walk for more fabulous views. You could also pick up the Gower Way long distance walk or climb the sandstone ridge of Cefn Bryn for magnificent views over the area. Just a mile to the east is the lovely Bishopston Valley with a pretty river running through a wooded valley to Pwll Du Bay.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Mill Tea Rooms at Parkmill (postcode SA3 2EH) for some refreshments after your exercise. There's also the Gower Inn with a good menu and an outdoor seating area to relax in. You can find it in Parkmill at postcode SA3 2EQ.The Bishopston Valley Hotel is located just to the east of the castle in the lovely Bishopston Valley. The friendly pub welcome walkers, families, and dogs. There's a dedicated restaurant area that seats up to 40 people. with a lite bite menu, grill menu and daily specials. You can relax outside in the nice beer garden during the warmer months too. You can find the hotel at 41 Bishopston Rd, with a postcode of SA3 3EJ for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/WmTq5alPI68",
  "postcode": "SA3 2DJ",
  "district": "Southgate",
  "county": "Swansea",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Southgate National Trust Car Park, Southgate Road, Pennard, Southgate, Swansea, Cymru / Wales, SA3 2DJ, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "coastal",
    "sand",
    "grass"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "coastal path"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}