{
  "created_at": "2025-01-06T03:49:54.800553+00:00",
  "objectID": "1ffa86d8d8da072775afc30babe47d5e",
  "ref": "croydon-walking-route",
  "title": "Croydon Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Crown_Hill%2C_Croydon_-_geograph.org.uk_-_1729253.jpg/512px-Crown_Hill%2C_Croydon_-_geograph.org.uk_-_1729253.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/1/1ffa86d8d8da072775afc30babe47d5e.gpx",
  "_geoloc": {
    "lat": 51.3626004653,
    "lng": -0.0924288962
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Crown_Hill%2C_Croydon_-_geograph.org.uk_-_1729253.jpg/512px-Crown_Hill%2C_Croydon_-_geograph.org.uk_-_1729253.jpg",
      "title": "Kevin Steinhardt / Crown Hill, Croydon",
      "caption": "Crown Hill, Croydon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Lloyd_Park%2C_Croydon_-_geograph.org.uk_-_1357891.jpg",
      "title": "Peter Trimming / Lloyd Park, Croydon",
      "caption": "Lloyd Park just to the east of the town. View towards Central Croydon, with the tower blocks just visible above the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Addington_Hills_-_Viewpoint_-_geograph.org.uk_-_1357664.jpg",
      "title": "Peter Trimming / Addington Hills - Viewpoint",
      "caption": "Addington Hills viewpoint. In this view we are looking to the north-west, and the distant hills are at least 20 miles away. The viewpoint gives views through a 90 degree arc from the Millennium Dome (O2 Arena) near Greenwich to the offices of Central Croydon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/View_From_Addington_Hills_%287%29_-_geograph.org.uk_-_1357579.jpg",
      "title": "Peter Trimming / View From Addington Hills (7)",
      "caption": "Another view From Addington Hills. Looking towards the offices of South Croydon to the left of picture, and Central Croydon to the right of picture. This series of 7 pictures was taken from the viewpoint on the top of Addington Hills. 50 years ago, this area seemed better known as Shirley Hills. The viewpoint is a short walk from the car park, which also serves as a Chinese restaurant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Selsdon_Wood_Bird_Sanctuary_-_geograph.org.uk_-_931866.jpg",
      "title": "Roger / Selsdon Wood Bird Sanctuary",
      "caption": "Selsdon Wood Bird Sanctuary. Bluebells in Selsdon Woods, South Croydon"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Littleheath_Woods%2C_Selsdon_-_geograph.org.uk_-_38311.jpg",
      "title": "Philip Talmage / Littleheath Woods, Selsdon",
      "caption": "Littleheath Woods, Selsdon. 64 acres of woodland with footpaths, bridle path and children's playground, Littleheath Woods is now a collective name for a number of woods which over the past 100 years have grown together, with a field on the north eastern side. The photo shows Littleheath Wood itself, across Clears Croft, from just inside the Brent Road entrance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Croham_Hurst_Round_Barrow_%28Marker_Stone%29.JPG/512px-Croham_Hurst_Round_Barrow_%28Marker_Stone%29.JPG",
      "title": "Eagleash, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Croham Hurst Round Barrow (Marker Stone)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Buses_in_George_Street%2C_Croydon_-_geograph.org.uk_-_2835011.jpg/512px-Buses_in_George_Street%2C_Croydon_-_geograph.org.uk_-_2835011.jpg",
      "title": "Peter Trimming / Buses in George Street, Croydon",
      "caption": "Buses in George Street, Croydon"
    }
  ],
  "distance_km": 14.0,
  "description": "This south London town has several nearby countryside trails, woodland areas, hill climbs, country parks and nature reserves to visit on foot. The town has good transport links being at the centre of the only tramway system in southern England. It's also well known for the Whitgift Centre, one of the largest shopping centres in the country with a monthly footfall of 2.08 million. This circular walk from the town visits some of the walking highlights of the area including Addington Hills, Selsdon Wood and Croham Hurst. The route makes use of the waymarked London Loop which runs through the area. The walk starts from the train station in the town centre. From here head east to pick up the London Loop which you can follow up to Addington Hill. This section passes Lloyd Park and Coombe Park where there are some nice trails to try. There's a good viewpoint in the Addington Hills where you can enjoy views over the town to some of the landmarks in the city of London. The route then heads south through Heathfield and Little Heath Woods before coming to Selsdon Wood. After exploring the woods you then retrace your steps to Littleheath Woods where you can follow an alternative path north west to visit Croham Hurst. From the woods it is a short walk back into the town centre to the train station where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the town The Spread Eagle is a good choice for some post walk refreshment. The Victorian pub is particularly well known for its excellent pies and also has an outdoor seating area if the weather is fine. You can find them at 39-41 Katharine Street with postcode CR0 1NX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland on the route make for a fine dog walk and the Spread Eagle mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north is the popular South Norwood Country Park where there are more good walking and cycling trails to pick up. For more walking ideas in the area see the London Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iZP1tDtee3c",
  "postcode": "CR2 7DW",
  "district": "Croydon",
  "county": "Greater London",
  "region": "London",
  "country": "England",
  "gazetteer_found": true
}