{
  "created_at": "2025-01-05T22:30:51.214519+00:00",
  "objectID": "806f45c20865df8f31e23f192bf3aa76",
  "ref": "glastonbury-tor-walking-route",
  "title": "Glastonbury Tor Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Glastonbury_Tor_-_geograph.org.uk_-_772.jpg",
  "nearby": [
    {
      "description": "Street Somerset",
      "objectID": "56f1e9bbb3c83db4cba52da6a6281b08",
      "ref": "street-somerset-walking-route"
    },
    {
      "description": "Westhay Moor",
      "objectID": "d1ec40f32a98940fbfdf9884f1b86daf",
      "ref": "westhay-moor-walking-route"
    },
    {
      "description": "Polden Way",
      "objectID": "245fa70afc011435f81020ea71f45d8a",
      "ref": "polden-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/806f45c20865df8f31e23f192bf3aa76.gpx",
  "_geoloc": {
    "lat": 51.1466660141,
    "lng": -2.7120685367
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Glastonbury_Tor_-_geograph.org.uk_-_772.jpg",
      "title": "Alan Simkins / Glastonbury Tor, via Wikimedia Commons",
      "caption": "Glastonbury Tor. Taken from the north, in Well Lane. The tor is associated with a number of legends. It is rumoured that below the hill lies a secret cavern, providing passage into the mystical realm of Annwn, where Gwyn ab Nudd, the ruler of the Celtic underworld, resides alongside the Cauldron of Rebirth. According to later folklore, the Holy Grail is believed to be located in this area, brought by Joseph of Arimathea, Jesus' uncle. Both the Cauldron and the Grail were sought after by King Arthur and his knights on legendary quests."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Glastonbury_Tor_-_geograph.org.uk_-_1105318.jpg",
      "title": "Michael Cobb / Glastonbury Tor, via Wikimedia Commons",
      "caption": "The tor taken from Havyatt/Edgarley close to the \"welcome to Glastonbury\" sign on the A361. (Photo actually taken from the orchard alongside). Glastonbury has a rich tradition of being referred to as 'The Isle of Avalon', believed to be the resting place of King Arthur following his final battle. The monks of Glastonbury Abbey asserted that they discovered his tomb in 1191. According to legend, Jesus visited Glastonbury during his childhood, accompanying Joseph of Arimathea. Joseph, a tin merchant, journeyed to the southwest of England in search of this valuable metal. This tale served as inspiration for William Blake's renowned poem 'Jerusalem': 'And did those feet in ancient time, Walk upon England’s mountains green? And was the Holy Lamb of God, On England’s pleasant pastures seen?'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/St_Michael%27s_Tower_-_geograph.org.uk_-_3578838.jpg/512px-St_Michael%27s_Tower_-_geograph.org.uk_-_3578838.jpg",
      "title": "St Michael's Tower by Bill Nicholls, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Michael's Tower. The tower stands as the sole remnant of the 14th-century St Michael's church, which supplanted a church devastated by an earthquake. Before its Christian use, this hilltop was utilised by the Romans. Despite being reduced to just a tower, some carvings endure, offering glimpses into its former adornment. Among these carvings is one depicting St Bridget tending to a cow. During the English Reformation, when Glastonbury Abbey faced suppression, the tower observed a gruesome event. The final Abbot of Glastonbury Abbey, Richard Whiting, was executed by hanging, drawing, and quartering here, alongside two of his monks in 1539."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Walkers_on_Glastonbury_Tor_-_geograph.org.uk_-_668528.jpg",
      "title": "Edwin Graham / Walkers on Glastonbury Tor, via Wikimedia Commons",
      "caption": "Walkers on Glastonbury Tor. Even on a winter's afternoon, a file of walkers can be found making their way down the Tor's zig-zag paths. The camera is near Cow Bridge on the Butleigh Road. A persistent modern myth is that of the Glastonbury Zodiac, an alleged astrological zodiac of enormous proportions believed to have been carved into the landscape along ancient hedgerows and trackways. According to this myth, the Tor constitutes part of the figure representing Aquarius. The theory was initially proposed in 1927 by Katherine Maltwood, an artist with a keen interest in the occult, who suggested that the zodiac was created around 5,000 years ago. However, it is worth noting that the majority of the land purportedly covered by the zodiac was submerged under several feet of water during the proposed time of its construction. Additionally, many of the features, such as field boundaries and roads, are of more recent origin."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/View_from_Glastonbury_Tor._-_geograph.org.uk_-_1322718.jpg",
      "title": "Pam Goodey / View from Glastonbury Tor., via Wikimedia Commons",
      "caption": "View from Glastonbury Tor. The hill ascends 158 metres (518 feet) above the flat land surrounding it, offering a splendid 360-degree view to those at its summit. Its distinctive shape results from a combination of unique geology and artificial terraces. Interestingly, the rock prompts two closely situated springs, one red and one white, below the tor to flow with distinct waters. The origins of these seven terraces remain uncertain. Were they constructed for cultivating vines or for ploughing? Or did they serve as a sacred labyrinth for pilgrims?"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Western_end_of_Glastonbury_Tor_-_geograph.org.uk_-_939468.jpg",
      "title": "Jim Champion / Western end of Glastonbury Tor, via Wikimedia Commons",
      "caption": "Western end of the tor. Approaching the tor from the bottom of Wellhouse Lane, the path up to the summit is mainly of concrete to withstand the large number of visitors that walk this way."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Glastonbury_Tor_from_Chalice_Well_-_geograph.org.uk_-_922495.jpg",
      "title": "Ken Grainger / Glastonbury Tor from Chalice Well, via Wikimedia Commons",
      "caption": "The Tor from Chalice Well Gardens in Spring. The Chalice Well, also recognised as the Red Spring, is a well positioned near the peak of Chalice Hill, a small elevation adjacent to Glastonbury Tor in Glastonbury, Somerset, England. Owned and overseen by the Chalice Well Trust (registered charity no. 204206), established by Wellesley Tudor Pole in 1959, the natural spring and its surrounding gardens are managed by this organisation. A study conducted by the Exeter University School of Geology in 2009 revealed that the Chalice Well is supplied by a deep aquifer located in the lower strata of the Pennard Sands. Archaeological findings indicate that the well has been consistently used for nearly two millennia. Philip Rahtz discovered numerous flints from the upper Paleolithic and Mesolithic eras, along with a fragment of Iron Age pottery nearby. Roman and medieval pottery shards were also unearthed in more recent layers. Water flows from the spring at a rate of 25,000 imperial gallons (110,000 litres) per day and has remained uninterrupted, even during periods of drought. The water's reddish tint is attributed to iron oxide deposits, as dissolved ferrous oxide oxidizes upon contact with the surface and precipitates. Like the thermal springs found in the nearby Roman baths of Bath, the water is believed to possess therapeutic properties. Another spring, referred to as the White Spring, emerges slightly to the east of the Chalice Well or Red Spring. The water from this source originates from a shallower aquifer and is devoid of color. Initially constructed as a waterworks, a building now stands over it, serving as a place of worship, with visitor access available at irregular opening times."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/The_Tor_taken_from_Bere_Lane_Glastonbury._-_geograph.org.uk_-_949992.jpg",
      "title": "Michael Murray / The Tor taken from Bere Lane Glastonbury., via Wikimedia Commons",
      "caption": "The Tor taken from Bere Lane Glastonbury. Evidence from timber trackways like the Sweet Track indicates that Glastonbury has been inhabited since Neolithic times. The Glastonbury Lake Village, an Iron Age settlement situated near the former course of the River Brue and Sharpham Park approximately 2 miles (3 km) west of Glastonbury, dates back to the Bronze Age. Centwine was the initial Saxon benefactor of Glastonbury Abbey, which exerted significant influence over the town for the subsequent 700 years. As one of the most important abbeys in England, it hosted the coronation of Edmund Ironside as King of England in 1016. Numerous of the town's oldest extant structures, such as the Tribunal, George Hotel, Pilgrims' Inn, and the Somerset Rural Life Museum, which occupies the site of a 14th-century abbey manor barn commonly referred to as a tithe barn, are linked to the abbey. The Church of St John the Baptist traces its origins back to the 15th century."
    }
  ],
  "distance_km": 2.6,
  "description": "This popular walk takes you from the ruins of Glastonbury Abbey to the summit of the iconic Glastonbury Tor. The circular walk runs for about 2 miles with a moderate climb on the way. You start off at the Grade I listed, Scheduled Ancient Monument of Glastonbury Abbey. The abbey was originally founded in the 7th century and rebuilt in the 14th century after a fire in 1184 destroyed the buildings. The site is 36 acres and open to the public so its well worth exploring the area and marvelling at the fascinating architecture and history of the abbey before climbing the Tor. From the abbey you head to the Tor summit on good footpaths passing Bushy Combe and Chalice Hill on the way. At the summit you will find the 15th century St Michael's Tower where you can enjoy marvellous views over Somerset, Dorset, Wiltshire, Wales and the nearby Polden Hills. You can also explore the apple orchards at the bottom of the Tor before returning to the abbey.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rifleman's Arms is a great choice for some refreshments after your walk. It's just a short downhill stroll from the Tor and within a stone's throw of the Chalice Well Gardens. The pub has a nice beer garden with views towards the tor. You can find it at 4 Chilkwell St with a postcode of BA6 8DB for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs will love climbing up the tor and you will probably see many other dog walkers on your outing. Please keep them on leads near grazing sheep though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Tor is located in the middle of the Summerland Meadows, part of the Somerset Levels, rising to an elevation of 518 feet (158 m). It is thought to be the location of Avalon, the place where King Arthur's sword Excalibur was forged and later where Arthur was taken to recover from his wounds after the Battle of Camlann. If you enjoy this short climb then you may also like to try the walk up Burrow Mump which is quite similar. The small hill includes the striking 18th century ruined church of St Michael's. It's located about 10 miles south west of Glastonbury in the pretty village of Burrowbridge. From the hill summit there are nice views back towards Glastonbury Tor and over the Somerset Levels. Just to the south west you'll find the neighbouring village of Street. Here you can enjoy another climb on the Polden Way to the National Trust's Walton Hill in the Polden Hills. Just to the south of Street you'll also find the neighbouring village of Compton Dundon where you can try the Compton Dundon and Combe Hill Wood Walk. The circular walk includes a climb to Iron Age Hillfort on Dundon Beacon and a visit to the Hood Monument, which is something of a historic local landmark. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/x5jcri9h1m4?si=2AKCWSCNz6UM02NK",
  "postcode": "BA6 8AY",
  "district": "Glastonbury",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Chilkwell Street, Beckery, Glastonbury, Somerset, England, BA6 8AY, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "footpath",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}