{
  "objectID": "8074ce714efcf34d80922da1fc4c0114",
  "created_at": "2024-12-18T09:54:06.506435+00:00",
  "ref": "chalford-and-the-toadsmoor-valley-walking-route",
  "title": "Chalford Canal and the Toadsmoor Valley Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/49/Chalford_Bottom_-_geograph.org.uk_-_144340.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8074ce714efcf34d80922da1fc4c0114.gpx",
  "_geoloc": {
    "lat": 51.7205943274,
    "lng": -2.1585036347
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Chalford_Bottom_-_geograph.org.uk_-_144340.jpg",
      "title": "David Stowell [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Chalford Bottom. Looking west along the weed clogged line of the Thames and Severn Canal. This was during the early days of the canal restoration, and slow but steady progress has been made since. Recently a lottery grant has been awarded for the restoration of a significant length of the adjoining Stroudwater Canal further down the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Belvedere_Mill%2C_Chalford_-_geograph.org.uk_-_2922356.jpg",
      "title": "Belvedere Mill, Chalford by Chris Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Belvedere Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Chalford_Hill%2C_Chalford_-_geograph.org.uk_-_1020406.jpg",
      "title": "Brian Robert Marshall [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Chalford Hill. Taken from Coppice Hill, this view shows the start of the open country east of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/South_across_the_Frome_valley%2C_Chalford_-_geograph.org.uk_-_1020381.jpg",
      "title": "Brian Robert Marshall [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "South across the Frome valley, Chalford. The valley carries not only the river but a disused canal and the Gloucester to Swindon railway. All are hidden in the view by the trees that feature along both sides of the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Chalford_-_geograph.org.uk_-_1054675.jpg",
      "title": "David Stowell / Chalford",
      "caption": "Looking across the Golden Valley from the Thames & Severn Canal. Much of Chalford is built on the steep hillsides with no road access. Supplies, and even the post were delivered here until relatively recently by donkey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Chalford_Roundhouse_-_geograph.org.uk_-_1054672.jpg",
      "title": "David Stowell / Chalford Roundhouse",
      "caption": "Chalford Round House, London Road. This is an example of a style of house unique to the Thames and Severn Canal. It is at the site of Chalford Wharf and would have housed the local canal lengthman."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Site_of_Ballingers_Lock_-_geograph.org.uk_-_1054670.jpg",
      "title": "David Stowell / Site of Ballingers Lock",
      "caption": "Site of Ballingers Lock. The Thames & Severn Canal and the main Stroud - Cirencester Road run side by side approaching Chalford. In 1967 some road widening and re-alignment took place over the abandoned canal. At this point a bridge has been demolished and Ballingers Lock has been buried under the patch of grass and the pre-fab garages."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Bourne_Lock_-_geograph.org.uk_-_1054664.jpg",
      "title": "David Stowell / Bourne Lock",
      "caption": "Bourne Lock. The first lock on the Thames & Severn Canal east of Brimscombe Port. It is an interesting hybrid capable of taking both 90ft Thames Barges and the wider, but shorter, Severn Trows. The combination of the additional length and width made it greedy in its use of water so it was shortened by building an arch over the upper part of the lock and the relocation of the top gates."
    }
  ],
  "distance_km": 11.0,
  "description": "Enjoy a walk along the Thames and Severn Canal before exploring the woodland of the Toadsmoor Valley on this walk from Chalford. There's nice views of the River Frome and interesting old mills to see in the area. The walk starts at Chalford Bottom and heads through the Golden Valley, passing along the canal and the River Frome. Near Brimscombe you turn north, heading through the wooded Toadsmoor Valley before finishing at Toadsmoor Pond. To extend your walk, head towards the Chalford Hill. Around here the the valleys are Alpine in in character, deep, narrow and well wooded. Other walks near Chalford include the Sapperton Circular Walk where you can visit the interesting Sapperton Canal Tunnel and the pretty little village of Frampton Mansell. Misarden Park at the pretty village of Miserden is located a few miles to the north east and well worth a visit. The long distance Wysis Way also passes through the area.",
  "video_url": "https://www.youtube.com/embed/_YHMLTd1lEQ",
  "district": "Chalford",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England"
}