{
  "created_at": "2025-01-06T04:32:01.360434+00:00",
  "objectID": "807d1951bafb2e690dff2a1055c826b1",
  "ref": "newburn-to-wylam-walk-walking-route",
  "title": "Newburn to Wylam Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tyne_Riverside_Country_Park_-_geograph.org.uk_-_1362753.jpg",
  "nearby": [
    {
      "description": "Hadrian's Wall Path",
      "objectID": "25270502c1c6b89b9bc84cfcdd28ab2c",
      "ref": "hadrians-wall-path-walking-route"
    },
    {
      "description": "Whittle Dene Reservoir",
      "objectID": "3d3409af55409a80af70b70eb3510e03",
      "ref": "whittle-dene-reservoir-walking-route"
    },
    {
      "description": "Newcastle",
      "objectID": "6d7640b8fe8eb1824cbbcd7e702ab8f0",
      "ref": "newcastle-walking-route"
    },
    {
      "description": "Tyne Riverside Country Park",
      "objectID": "04d8764a367a1de64fa21b7296a69728",
      "ref": "tyne-riverside-country-park-walking-and-cycle-route"
    },
    {
      "description": "Wylam",
      "objectID": "4ded77191ee311b9a0b02c6824395e8c",
      "ref": "wylam-walking-route"
    },
    {
      "description": "Heddon on the Wall",
      "objectID": "c2462c9e8b6b4551dbbd31ee8479dd83",
      "ref": "heddon-on-the-wall-walking-route"
    },
    {
      "description": "Clara Vale",
      "objectID": "5604396101084511ee0307c1196d4874",
      "ref": "clara-vale-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/807d1951bafb2e690dff2a1055c826b1.gpx",
  "_geoloc": {
    "lat": 54.9831722645,
    "lng": -1.7517122096
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Tyne_Riverside_Country_Park_-_geograph.org.uk_-_1362753.jpg",
      "title": "Anthony Foster / Tyne Riverside Country Park",
      "caption": "Tyne Riverside Country Park. The Country Park is situated over two sites - at Prudhoe and at Newburn. This is the Newburn site looking east towards the village and the site of the Battle of Newburn Ford. The walk can be started from the car park here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/River_Tyne_Tide_Stone_-_geograph.org.uk_-_79774.jpg/256px-River_Tyne_Tide_Stone_-_geograph.org.uk_-_79774.jpg",
      "title": "Alan Fearon / River Tyne Tide Stone",
      "caption": "River Tyne Tide Stone. Near Newburn Haughs, by the side of river, the Tide Stone marks the tidal limit of the River Tyne, nineteen miles from the mouth of the river. The stone bears the 'three castles' emblem of Newcastle and the date 1783."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/The_Wylam_Wagonway_-_geograph.org.uk_-_1558247.jpg",
      "title": "Andrew Curtis / The Wylam Wagonway",
      "caption": "The Wylam Wagonway. At one time this was the route of the road between Newcastle and Hexham, preceding both the Military Road and the A69. A waggonway linking Wylam colliery with the coal staithes at Lemington was built alongside it before 1763, one of the earliest on Tyneside. Wagons were drawn by horses along wooden rails. Iron rails and two steam locomotives made by William Hedley, Wylam Dilly and Puffing Billy were in use by 1815. George Stephenson was born by the waggonway and went on to develop further locomotives that were to revolutionise railways for passenger transport. The waggonway is now part of Hadrian's Way path, which turns right at this signpost, and a national cycle route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/George_Stephenson%27s_cottage_-_geograph.org.uk_-_5428.jpg",
      "title": "Ken Brown / George Stephenson's cottage",
      "caption": "George Stephenson's cottage. This small stone cottage, built around 1750, has earned a place in history by being the birthplace of railway pioneer George Stephenson. Stephenson was born here in 1781, and went on to make his name at nearby Wylam colliery. The cottage was once home to four pitmen's families, and the room in which Stephenson was born, and in which the whole family lived can be seen today, furnished in period style."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Site_of_the_former_North_Wylam_Railway_Station_%28geograph_2743634%29.jpg/512px-Site_of_the_former_North_Wylam_Railway_Station_%28geograph_2743634%29.jpg",
      "title": "Andrew Curtis / Site of the former North Wylam Railway Station",
      "caption": "Site of the former North Wylam Railway Station. North Wylam was the most westerly station on the Scotswood, Newburn & Wylam Railway. It was opened in 1876 and closed in 1968. The site was cleared in January 1975 leaving few visible remains. It is now a grassy open space adjacent to the car park of the Tyne Riverside Park and the former track ('Wylam Waggonway') a walking and cycle route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Wylam_Bridge2.jpg/512px-Wylam_Bridge2.jpg",
      "title": "Graham Robson / Wylam Bridge, Wylam",
      "caption": "Looking up the River Tyne towards Wylam Bridge which carries Station Road across the wide river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Keelmans_way_-_geograph.org.uk_-_515129.jpg",
      "title": "Newbiggin Hall Scouts / Keelmans way",
      "caption": "Keelmans way on the south side of the river. Part of the national cycleway South of the Tyne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/River_Tyne_east_of_Stephenson%27s_Cottage_-_geograph.org.uk_-_1296752.jpg",
      "title": "Andrew Curtis / River Tyne east of Stephenson's Cottage",
      "caption": "River Tyne east of Stephenson's Cottage. Every day by the river is different. Today at full tide, the water was deep, still and dark reflecting the huge clouds in a blue sky and the trees along both banks."
    }
  ],
  "distance_km": 10.0,
  "description": "This circular walk takes you from Newburn to Wylam along a section of the River Tyne. The route runs for just over 6 miles on a series of flat footpaths, visiting the historic Stephenson's Cottage on the way. The walk starts from the car park in the Tyne Riverside Country Park just west of Newcastle in Ovingham. Here you can pick up the Hadrian's Wall Path and follow the waymarked trail west along the riverside path. Near Wylam you'll come to Stephenson's Cottage, the birthplace of railway pioneer, George Stephenson. It's now a National Trust property where you can learn all about his early life and the Stephenson gauge', the basis for the standard gauge used by most of the world's railways. He also designed the Locomotion No. 1, which was the first steam locomotive to carry passengers on a public rail line, the Stockton and Darlington Railway in 1825. The route continues into Wylam where you cross to the other side on the Wylam Bridge. You can then follow another path on the southern side of the water, passing Clara Vale and Ryton on the way. Here you cross the river on Newburn Bridge and return to the car park where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the riverside park there's Hedley's Riverside Coffee Shop for some post walk refreshment. They serve a good range of meals and snacks at reasonable prices. On the route you could stop off at The Boathouse next to Wylam Bridge and the train station. You can sit outside here and enjoy views of the boats on the river if the weather is good. They serve good quality Thai food and have a decent selection of ales too. You can find them at roughly the halfway point on the route at postcode NE41 8HR for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The riverside trail is a nice one to do with your dog. The coffee shop mentioned above and The Boathouse pub are also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Part of the walk uses a section of the Keelmans Way. This shared cycling and walking path runs along the south side of the river to the upper reaches of the Tyne and the Derwent Walk Country Park in Gateshead. Head north from the park and you could pick up the epic Hadrian's Wall Path National Trail and visit the fascinating Vindobala Roman Fort at Rudchester. Near here there's also a nice trail around the picturesque Whittle Dene Reservoir. At Heddon on the Wall to the north there's a significant section of Hadrian's Wall to see. It includes the longest section of unbroken wall at its original and planned width, now known as Broad Wall. There's also an ancient Saxon church with features daing back to the 7th century.  For more walking ideas in the area see the Tyne and Wear Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/igLzKCw91No",
  "district": "Newcastle upon Tyne",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Grange Road, Newburn, Newcastle upon Tyne, North East, England, NE15 8HE, United Kingdom",
  "postcode": "NE15 8HE",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "pathway",
    "river"
  ],
  "points_of_interest": [
    "historical sites",
    "museum"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}