{
  "objectID": "808f117279541a6017acb3d5f294604f",
  "created_at": "2024-12-19T09:44:02.634431+00:00",
  "ref": "start-point-devon-walking-route",
  "title": "Start Point Devon Lighthouse Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Start_Point_headland_-_geograph.org.uk_-_1490455.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Slapton Ley",
      "objectID": "28824a83a65521fc3d0debc552889a76",
      "ref": "slapton-ley-walking-and-cycle-route"
    },
    {
      "description": "Prawle Point",
      "objectID": "97bdfc45b624dc269a08d3d312a508f2",
      "ref": "prawle-point-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/709E8D73576B99248025816E0051E4A9/$FILE/Start Point Devon.gpx",
  "_geoloc": {
    "lat": 50.2257867601,
    "lng": -3.6540214957
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Start_Point_headland_-_geograph.org.uk_-_1490455.jpg",
      "title": "Derek Harper / Start Point headland",
      "caption": "Start Point headland. A view from the road below the Start Farm car park, along the north side of the headland with the top of lighthouse visible in the distance. The raised beach so prominent between the point and Prawle Point is also evident."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Start_Point_Lighthouse_-_geograph.org.uk_-_1490417.jpg/256px-Start_Point_Lighthouse_-_geograph.org.uk_-_1490417.jpg",
      "title": "Derek Harper / Start Point Lighthouse",
      "caption": "Start Point Lighthouse. Taken from the foot of the road that leads down the north side of the headland. The lighthouse was built in \"1836 by James Walker engineer, with minor alterations of 1871. Tarred and white-painted granite ashlar with cast-iron lantern roofed in copper. Tall circular tower of about 28 metres high with moulded plinth and pedestal stage and 2 diminishing stages above that, the top stage with a corbelled embattled parapet and a cast-iron lattice lantern with a copper canopy surrounded by weathervane. Rectangular and small round-headed window openings with plain raised architraves and blind panel on west side under the parapet ... lighthouse originally had the keepers' living accommodation on the ground and first floor but the floor was taken out in 1871 when new keepers' houses were built nearby ... The light was powered by oil until 1959 when it was electrified. Originally the fog-sounder was a bell mounted outside, but this was soon replaced, in about 1851, because the new steam ships could not hear the bell.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/The_Southern_Side_of_Start_Point_-_geograph.org.uk_-_1767505.jpg/512px-The_Southern_Side_of_Start_Point_-_geograph.org.uk_-_1767505.jpg",
      "title": "Tony Atkin / The Southern Side of Start Point",
      "caption": "The Southern Side of Start Point. The Lighthouse is perched on the end of this wild-looking ridgeback promontory."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Coastline_west_of_Start_Point_-_geograph.org.uk_-_1490294.jpg",
      "title": "Derek Harper / Coastline west of Start Point",
      "caption": "Coastline west of the site. The steep coastal slope, with rocks above and below it, runs out to the lighthouse. View from the South West Coast Path above Foxhole Cove."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Coast_northwest_of_Start_Point_-_geograph.org.uk_-_1490359.jpg",
      "title": "Derek Harper / Coast northwest of Start Point",
      "caption": "Coast northwest. A view from Nestley Point over the reefs and coves between Start Point and Hallsands. The most prominent rocks are Shoelodge Reef. The first beach is at Greenstraight, just beyond Hallsands, with Tinsey Head to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Hallsands_-_geograph.org.uk_-_368313.jpg/256px-Hallsands_-_geograph.org.uk_-_368313.jpg",
      "title": "Carol Walker / Hallsands",
      "caption": "Hallsands, just north of the Point. This was formerly a fishing village but is now only a collection of ruined cottages set on a rocky shelf at the cliff foot. It finally succumbed after a storm in 1917. In 1897 a contractor was given permission to take away shingle from the beach for use at Devonport.In a few years, half a million tons was removed and the beach lowered up to 3.7m(12ft) in places. Natural erosion took over, and even with concrete walls in place, nothing could beat the shingle beach as a defence.So we have a supreme example of man's folly in interfering with nature."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/Rocks_near_Nestley_Point_-_geograph.org.uk_-_1490366.jpg",
      "title": "Derek Harper / Rocks near Nestley Point",
      "caption": "Rocks near Nestley Point"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Stokenham%2C_rock_outcrop_near_Start_Point_-_geograph.org.uk_-_812017.jpg",
      "title": "Martin Bodman / Stokenham: rock outcrop near Start Point",
      "caption": "Stokenham, rock outcrop near Start Point"
    }
  ],
  "distance_km": 3.5,
  "description": "This is a popular circular walk around this beautiful headland on the South Devon coast. It's about a 2 mile walk with great views over Start Bay, a visit to the lighthouse and the option of descending to a delightful secluded beach. The area is also great for wildlife watching. Look out for marine wildlife such as seals and dolphins, and birds including black-throated divers, gannets, kittiwakes and auks. Begin the walk from the Start Point car park, near Start Farm. From here it is a short walk along the coast path to the lighthouse. On some days you can enjoy a guided tour here and climb the tower to hear stories about storms, shipwrecks and lighthouse living . After exploring the lighthouse the walk heads along the coast path to Great Mattiscombe Sand. It is a steep climb down to the beautiful sandy cove where you can look out for Grey seals and basking sharks in the summer. The walk then heads north back to the car park. It's easy to extend your walk if you have time. You can head west along the South West Coast Path and visit Prawle Point , the southernmost point of Devon. Heading a few miles north will take you to the splendid Slapton Ley Nature Reserve. Here you'll find the largest natural freshwater lake in South West England, a lovely shingle beach and great birdwatching opportunites.",
  "video_url": "https://www.youtube.com/embed/G7EnyCOUOSg",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}