{
  "created_at": "2025-01-06T10:35:16.621226+00:00",
  "objectID": "819a9074afd59c6f8b33702f3c70d5c5",
  "ref": "york-millennium-way-walking-route",
  "title": "York Circular Walk - The Millennium Way Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/York_Millennium_Bridge_-_geograph.org.uk_-_574496.jpg/256px-York_Millennium_Bridge_-_geograph.org.uk_-_574496.jpg",
  "nearby": [
    {
      "description": "York Walls Walk",
      "objectID": "9cd9dd3b7ecfe332939346de434003f2",
      "ref": "york-walls-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/819a9074afd59c6f8b33702f3c70d5c5.gpx",
  "_geoloc": {
    "lat": 53.9603295972,
    "lng": -1.0868966275
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/York_Millennium_Bridge_-_geograph.org.uk_-_574496.jpg/256px-York_Millennium_Bridge_-_geograph.org.uk_-_574496.jpg",
      "title": "Paul Glazzard / York Millennium Bridge",
      "caption": "York Millennium Bridge Footbridge over the River Ouse between Nunthorpe and Fulford, south of York city centre. The 150 metre long cantilever bridge, inspired by the spokes of a bicycle wheel, is suspended by 19mm diameter stainless steel cables from an arch inclined at 50 degrees to the horizontal. The bridge was designed by Whitby Bird and Partners of London and opened to pedestrian and cycle traffic in autumn 2000."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/York_Minster_-_geograph.org.uk_-_730711.jpg/256px-York_Minster_-_geograph.org.uk_-_730711.jpg",
      "title": "Paul Glazzard / York Minster",
      "caption": "York Minster. Looking southwest from the city walls near the site of the gateway to the Roman fortress. A brief history of the minster can be found on the cathedral's official website"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/York_City_Walls_-_geograph.org.uk_-_608486.jpg/256px-York_City_Walls_-_geograph.org.uk_-_608486.jpg",
      "title": "Paul Glazzard / York City Walls",
      "caption": "York City Walls. Looking south along the stretch of wall between The Red Tower and Walmgate Bar. In 1855, the Board of Health Committee in York proposed to remove \"the whole or such part of the city walls between Walmgate Bar and Red Tower as may be considered requisite to improve that locality\". They argued that the walls here had \"no particular historic interest about them and had been little noticed until the proposed improvement had been projected\". The committee apparently thought the walls were a cause of ill-health as they obstructed the free circulation of air. The committee's proposal was rejected."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Walmgate_Bar%2C_York_-_geograph.org.uk_-_608475.jpg",
      "title": "Paul Glazzard / Walmgate Bar, York",
      "caption": "Walmgate Bar, York. Looking west from Jenny's Fish & Chips on the corner of Lawrence Street. The gate or 'bar' in York's city walls still has its original 12th century archway with portcullis and 15th century wooden gates (the archway on the right of the picture is more modern). The 14th century barbican protruding from the front would once have spanned a water-filled ditch and worked by trapping attackers in deadly crossfire between two sets of gates. Walmgate Bar was leased out as a house from 1376 right up until 1957."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/The_Red_Tower%2C_York_-_geograph.org.uk_-_608505.jpg",
      "title": "Paul Glazzard / The Red Tower, York",
      "caption": "The Red Tower, York. Looking south-southeast from the children's playground in Rosemary Place. Built in brick in 1490, the tower caused friction between bricklayers and stonemasons over division of labour, to the extent that in 1491 two stonemasons were implicated in the murder of a bricklayer named John Patrick although they were later acquitted. The tower was originally built to guard the King's Fishpool, a flooded stretch of the River Foss where the city had no defensive wall and where only a select few were allowed to fish. The building was later used as a stable, a cowshed and a brimstone factory for making gunpowder, when it became known as \"Brimstone House\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Micklegate_Bar%2C_York_-_geograph.org.uk_-_730740.jpg",
      "title": "Paul Glazzard / Micklegate Bar, York",
      "caption": "Micklegate Bar. The main entrance to the medieval city of York from London and the south, built between 1196 and 1230 on earlier foundations and restored in 1952. The heads of many 'traitors' were hung from Micklegate Bar as a warning to others, including Lord Scrope of Masham (1415), Richard Duke of York (1460), the Earl of Devon (1461) and the Earl of Northumberland (1572). The last people to have the honour were the Jacobites William Connolly and James Mayne in 1746."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Skeldergate_Bridge%2C_York_-_geograph.org.uk_-_608459.jpg",
      "title": "Paul Glazzard / Skeldergate Bridge, York",
      "caption": "Skeldergate Bridge. Looking north from Terry Avenue on the west bank of the River Ouse. The foundation stone for the road bridge was laid on 12 June 1878 and it took the best part of three years to complete, opening to foot traffic on January 1st, 1881 and to general traffic on the 10th of March. Skeldergate Bridge was formally declared free of tolls on April Fools' Day in 1914 (apparently it wasn't a hoax)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Bootham_Bar%2C_York_-_geograph.org.uk_-_608522.jpg",
      "title": "Paul Glazzard / Bootham Bar, York",
      "caption": "Bootham Bar. Looking east from Monument Pond outside the City Art Gallery in St Leonard's Place. Bootham Bar is built on the site of a much older Roman gateway in the city walls at York, the earliest pieces of the remaining structure dating from the 11th and 12th centuries. Until the 13th century the gate was known as Galmanlith or Gate of Galmou, the name of the hill on which St. Mary's Abbey was built. In 1501 an enormous door knocker was fitted at Bootham Bar and any visiting Scots had to knock and wait for permission to enter from the Lord Mayor, the Warden or the Constable."
    }
  ],
  "distance_km": 37.0,
  "description": "A circular walk around the outskirts of this historic city. The route runs for about 23 miles visiting some of the highlights of the area. The walk includes lovely riverside stretches along the Rivers Ouse and Foss with splendid views of the countryside surrounding York.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/HUjmL7svFgI",
  "postcode": "YO1 7DR",
  "district": "York",
  "county": "York",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Star Inn The City, Museum Street, Bootham, Bishophill, York, York and North Yorkshire, England, YO1 7DR, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "countryside"
  ],
  "points_of_interest": [
    "historical highlights",
    "views"
  ],
  "facilities": [],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}