{
  "created_at": "2025-01-05T23:25:46.045015+00:00",
  "objectID": "821c4db7a62f147679f1001f0e78fee7",
  "ref": "clwydian-way-walking-route",
  "title": "Clwydian Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/70/View_from_the_Clwydian_Way_-_geograph.org.uk_-_349584.jpg",
  "nearby": [
    {
      "description": "Llyn Brenig",
      "objectID": "0e27383dad9e75025ecac89f7c828a40",
      "ref": "llyn-brenig-walking-route"
    },
    {
      "description": "Rhuddlan To Rhyl - River and Coast Walk",
      "objectID": "d9928f3a6719d5d1f6d91db1a83aa03e",
      "ref": "rhuddlan-to-rhyl---river-and-coast-walk-walking-route"
    },
    {
      "description": "St Asaph",
      "objectID": "a3b5c90a2a8f538b9ddf8a5f84b81cd9",
      "ref": "st-asaph-walking-route"
    },
    {
      "description": "Alwen Reservoir Trail",
      "objectID": "158ebb80f0b845efc5e21a4fe9662aa9",
      "ref": "alwen-trail-walking-and-cycle-route"
    },
    {
      "description": "Moel Y Parc",
      "objectID": "9f1f03a419686fe345a65c145959a9fa",
      "ref": "moel-y-parc-walking-route"
    },
    {
      "description": "Carrog",
      "objectID": "6da9f8647412377a2510d109c2b86dfb",
      "ref": "carrog-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/View_from_the_Clwydian_Way_-_geograph.org.uk_-_349584.jpg",
      "title": "John S Turner / View from the Clwydian Way, via Wikimedia Commons",
      "caption": "Looking north west, from the Clwydian Way, along a stream, which is flowing towards Allt Gymbyd Farm. There are several springs feeding the streams in this limestone area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/Trees_near_the_Clwydian_Way_-_geograph.org.uk_-_327341.jpg",
      "title": "Peter Craine / Trees near the Clwydian Way, via Wikimedia Commons",
      "caption": "Trees on the Clwydian Way near the Aled Isaf Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/A_Spring_on_the_Clwydian_Way_-_geograph.org.uk_-_349599.jpg",
      "title": "John S Turner / A Spring on the Clwydian Way, via Wikimedia Commons",
      "caption": "A Spring on the Clwydian Way. This hollow ahead is another spring feeding a stream in this limestone area. The Clwydian Way sensibly skirts it to the right, heading for the stile straight ahead."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Clwydian_Way_-_geograph.org.uk_-_1023558.jpg",
      "title": "Bryan Pready / Clwydian Way, via Wikimedia Commons",
      "caption": "Walker on the Clwydian Way near Berwyn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Byway_near_Penycloddiau_-_geograph.org.uk_-_624528.jpg",
      "title": "David Quinn / Byway near Penycloddiau",
      "caption": "Byway near Penycloddiau"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Clwydian_Way_-_geograph.org.uk_-_247638.jpg",
      "title": "Eirian Evans / Clwydian Way",
      "caption": "The Way as it leads east towards Nant y Madwen. This is on the western side of the Llantysilio mountains."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Taith_Clwyd_%28Clwydian_Way%29_crossing_from_Tan-y-fron_-_geograph.org.uk_-_1219868.jpg",
      "title": "John Haynes / Taith Clwyd (Clwydian Way) crossing from Tan-y-fron",
      "caption": "Taith Clwyd (Clwydian Way) crossing from Tan-y-fron. The path crosses by the large tree in the hedge, there is a marker post to the right of the gap. I think the ridge is the site of a stone dyke that has been removed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Forestry_at_Tan-y-bwlch_-_geograph.org.uk_-_237720.jpg",
      "title": "John Haynes / Forestry at Tan-y-bwlch",
      "caption": "Forestry at Tan-y-bwlch. From high up on the Way you look down into the valley, forest is coniferous high up but broadleaf lower down. The white colouration on the Rowan in the foreground are dying leaves."
    }
  ],
  "distance_km": 196.0,
  "description": "Explore the Clwydian Range of mountains on this circular walk through north east Wales. From the range there are splendid views of north Wales, Snowdonia, the Cheshire Plain and the Peak District. The walk starts at Prestatyn on the coast, taking you through some beautiful countryside and also visiting the historic towns of Ruthin, Llangollen, Corwen, and Denbigh. You'll also pass the small city of St Asaph where there are nice riverside paths along the River Elwy and a notable cathedral which dates from the 13th century. Just north of here is the town of Rhuddlan with a significant 13th century castle and footpaths along the River Clwyd. Also of interest are waterside sections along the beautiful Llyn Brenig, the River Alwen, the River Aled and the the River Dee. You'll also climb to a number of significant hills including the large hill fort at Penycloddiau, Moel Arthur, Moel Famau, Moel Y Parc and the Moel-y-Gaer Hill fort in Bodfari. The walk is waymarked with a black buzzard on a white disc.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Llyn Brenig Visitor Centre is a great place to stop at for refreshments. Here you can head to the cafe where you can enjoy a meal from the balcony and enjoy fabulous views over the lake. They use fine Welsh produce for their meals and also have a lovely selection of cakes. In Flintshire you will pass through Cilcain where you can visit The White Horse Inn. The building dates back to the early 1800s and includes a set of antique beer engines. It's a popular place for walkers, serving a fine Sunday lunch. You can find them at postcode CH7 5NN for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the start of the route you can try the circular Dyserth Waterfall Walk and visit the splendid 70ft falls. There's also caves, woodland trails, a 16th century church and some nice tea rooms to see in this historic and scenic area. Just north of the village there's the climb to Graig Fawr where you can enjoy some wonderful views to the coast. In Corwen the Crown Hotel is worthy of some investigation. The historic inn dates all the way back to 1628. The interior is full of olde worlde character with interesting features including pewter tankards hanging from the ceiling. They serve good food and are designated as a Camra Welsh Heritage pub. There's also a snooker table upstairs. You can find them on Bridge Street at postcode LL21 0AH. Around Corwen the trail is coincident with the Dee Valley Way. The 15 mile waymarked trail runs to Llangollen on challenging paths."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QMDYxlWiO7g",
  "gazetteer_found": false,
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/821c4db7a62f147679f1001f0e78fee7.gpx",
  "_geoloc": {
    "lat": 53.3426515807,
    "lng": -3.4127869815
  },
  "nominatim_found": true,
  "display_address": "Beach Road West, Prestatyn, Denbighshire, Cymru / Wales, LL19 7EY, United Kingdom",
  "postcode": "LL19 7EY",
  "district": "Prestatyn",
  "county": "Denbighshire",
  "region": null,
  "state": "Cymru / Wales",
  "country": "United Kingdom",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "hill fort"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}