{
  "created_at": "2025-01-05T22:30:56.945386+00:00",
  "objectID": "827ea03a10bca37ada8a981f94f7a5bd",
  "ref": "beeston-castle-walking-route",
  "title": "Beeston Castle Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Beeston_-_Beeston_Castle_Ramparts.jpg",
  "nearby": [
    {
      "description": "Sandstone Trail",
      "objectID": "820c3e87805731081e451f661a9e79d4",
      "ref": "sandstone-trail-walking-route"
    },
    {
      "description": "Peckforton Castle and Peckforton Hills",
      "objectID": "3647f3b43e5157163d7ebd8099beae48",
      "ref": "peckforton-castle-and-peckforton-hills-walking-route"
    },
    {
      "description": "Tarporley",
      "objectID": "30580f9a4d85fdd7defbc729dee5fa26",
      "ref": "tarporley-walking-route"
    },
    {
      "description": "Burwardsley",
      "objectID": "91769fede91a52546a8eb90883996d5a",
      "ref": "burwardsley-walking-route"
    },
    {
      "description": "Kelsall",
      "objectID": "4be74012bd5136c8eec7d9995c35ca82",
      "ref": "kelsall-walking-route"
    },
    {
      "description": "Cholmondeley",
      "objectID": "4efa7d2134b47884c1f86ad2e115b026",
      "ref": "cholmondeley-walking-route"
    },
    {
      "description": "Malpas",
      "objectID": "b0f699d8ed63c9ba51df884742dd41a1",
      "ref": "malpas-walking-route"
    },
    {
      "description": "Bunbury",
      "objectID": "f61ed7f4ca9d753e32ad12f63592052e",
      "ref": "bunbury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/827ea03a10bca37ada8a981f94f7a5bd.gpx",
  "_geoloc": {
    "lat": 53.1268991188,
    "lng": -2.6886267356
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Beeston_-_Beeston_Castle_Ramparts.jpg",
      "title": "Bev Dickinson [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Beeston castle Ramparts. The castle stands proudly atop Beeston Crag, situated in the southern section of the Mid Cheshire Ridge, a series of modest sandstone hills stretching from the River Mersey to the heart of the Cheshire Plain. The flat expanse between the southern and northern segments of the ridge is referred to as the Beeston Gap, a geological feature formed by a meltwater channel as the Ice Age drew to a close. Comprising part of the broader New Red Sandstone sequence, Beeston Crag, akin to its nearby Peckforton Hills, is fashioned from layers of Triassic sandstone with an easterly dip. The lower slopes primarily consist of the Wilmslow Sandstone Formation, while the upper layers belong to the Helsby Sandstone Formation, boasting an age of approximately 245 million years. Crowning the hillock is a small outcrop of sandstones attributed to the Tarporley Siltstone Formation, previously identified as the Keuper Waterstones. Sandstone from both formations was once extracted from multiple sites within the castle's environs. Running along the hill's eastern edge is the Peckforton Fault, a significant geological fault aligned in a north–south direction, resulting in a displacement of strata to the east. Additionally, a gentle ridge of glacial moraine extends eastward from the castle lodge, believed to denote an ice front during the recession or halt of the Irish Sea ice sheet, which encroached upon Cheshire from the northwest during the last ice age."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Beeston_Castle_-_geograph.org.uk_-_1566429.jpg",
      "title": "Eirian Evans / Beeston Castle, via Wikimedia Commons",
      "caption": "The medieval ruins of Beeston Castle stand on a rocky summit 500ft above the Cheshire plain, offering views from the Pennines in the east to the mountains of Wales in the west. It dates from 1225 when it was built by Ranulf, the sixth Earl of Chester, and contains one of the deepest castle wells in the country. It was seized by King Henry III in 1237 and used by him and later his son, King Edward I, as a base for their campaigns against the Welsh. The castle was finally destroyed at the end of the Civil War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Beeston_Castle_-_geograph.org.uk_-_2057598.jpg",
      "title": "David Dixon / Beeston Castle, via Wikimedia Commons",
      "caption": "The Inner Gatehouse and Inner Curtain Wall. Beeston Castle was commissioned by Ranulf de Blondeville, the 6th Earl of Chester, during the early 13th century. Strategically situated, the castle's outer bailey walls were strategically positioned to utilize the remnants of an earlier Iron Age rampart, enhancing its defensive capabilities. Referred to as Castellum de Rupe in medieval documents, meaning \"Castle on the Rock,\" it was one of three major castles erected by Ranulph in the 1220s upon his return from the Fifth Crusade. The other two castles, Bolingbroke in Lincolnshire and Chartley in Staffordshire, share architectural similarities with Beeston, particularly in the design of the towers. Unlike many contemporary castles, Beeston does not feature a traditional keep as its primary defense. Instead, the natural terrain, coupled with robust walls, formidable gatehouses, and strategically positioned towers, rendered the baileys themselves as strongholds. The castle's defenses comprised two main elements. Firstly, a rectangular castle atop the hill, surrounded by sheer drops on three sides and a defensive ditch up to 30 feet (9 m) deep on the fourth side, carved into the rock. Secondly, an outer bailey was constructed on the lower slopes, featuring a substantial gatehouse safeguarded by a 16-foot (5 m) wide and 10-foot (3 m) deep ditch. The outer bailey, roughly rectangular in shape, boasted walls 6 feet (2 m) thick, crafted from sandstone and filled with rubble. Some sections of these walls still endure today, featuring several D-shaped towers—a pioneering feature in English castles at the time. These towers allowed defenders to fire both across and forward from the walls, and their open-backed design ensured they wouldn't provide cover for any attackers who breached the outer bailey. Situated at the western end of the crag's rocky summit, the inner bailey offered additional fortification. To ensure a reliable water supply for the castle's inhabitants, two wells were excavated into the rock. One of these wells, reaching a depth of 370 feet (113 m), stands as one of the deepest castle wells in England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Beeston_Castle_-_geograph.org.uk_-_442529.jpg",
      "title": "Jeff Buck / Beeston Castle, via Wikimedia Commons",
      "caption": "View of the castle from Stonehouse Lane. A private road to the Peckforton Estate is just to the left of the picture where the sign is. While most of the defensive structures at Beeston Castle were established by the time of Ranulph's death in 1232, the site lacked living quarters. This situation persisted even after the passing of Ranulph's successor, John, in 1237. John's demise without a male heir allowed King Henry III to inherit the Earldom of Cheshire. Henry subsequently expanded Beeston Castle during his conflicts with Wales and repurposed it as a prison for Welsh prisoners. The castle was not outfitted with permanent residential facilities such as halls and chambers; it is believed that garrisons were accommodated in wooden structures within the outer bailey. In 1254, Henry granted Beeston, along with other Cheshire lands, to his son Prince Edward, whom he also bestowed with the title Earl of Chester—a title that has since been bestowed on the heir to the English throne. During the Montfortian rebellion in 1265, Beeston Castle was recaptured from the rebels by James de Audley and Urian de Saint Pierre after Edward's escape from captivity. Edward ascended to the English throne in 1272 and completed the conquest of Wales. In the mid-14th century, individuals from Cheshire were appointed as constables of the royal castle, likely residing in or near the gatehouse. A description of the castle in 1593 by Sampson Erdeswicke portrays it as having \"a goodly strong gatehouse, and strong wall with other buildings, which when they flourished were a convenient habitation for any great personage.\" Beeston underwent maintenance and enhancements during Edward's reign and throughout the 14th century. However, by the 16th century, the castle was deemed obsolete by the English Crown, leading to its sale in 1602 to Sir Hugh Beeston of Beeston Hall. Persistent rumors suggest that Richard II concealed a treasure somewhere within the castle grounds during his journey to Chester in 1399, before departing for Ireland to quell a rebellion. Following his deposition by Henry, Duke of Lancaster, the future Henry IV, the treasure is said to have remained undiscovered. Despite numerous searches, including investigations focused on the deep well in the inner bailey, no treasure has ever been found. The validity of these rumors is questionable, as historical records indicate that Henry IV recovered Richard's gold and jewelry from various hiding spots."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Beeston_Castle%2C_Cheshire_-_geograph.org.uk_-_1935296.jpg/512px-Beeston_Castle%2C_Cheshire_-_geograph.org.uk_-_1935296.jpg",
      "title": "Jeff Buck / Beeston Castle, Cheshire, via Wikimedia Commons",
      "caption": "A view of the steps and the footbridge up to the castle. Beeston Castle, currently under the ownership of English Heritage, stands as a testament to its rich history. Despite being in ruins, significant portions of its walls and towers remain intact, offering visitors a vivid glimpse into its former grandeur. Open to the public, the castle features a modest museum and visitor's centre, providing insights into its past. Constructed during the 19th century by Tollemache, a lodge house adds to the site's charm. Expanded in the 20th century, the lodge boasts two stories and is adorned with two circular towers flanking a central archway. Recognised for its historical and architectural significance, the lodge is designated as a Grade II listed building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/View_towards_Beeston_Castle_-_geograph.org.uk_-_814816.jpg",
      "title": "Andrew Tatlow / View towards Beeston Castle, via Wikimedia Commons",
      "caption": "A large area of the slopes up to Beeston Castle have been cleared of bracken, trees and shrubs and have now been planted with meadow grass. Beeston is a haven for wildlife, with its resident foxes, rabbits, and bats, along with the majestic presence of buzzards and even peregrine falcons. It's truly a place where nature thrives and offers a glimpse into the beauty of the natural world."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/The_Sandstone_Trail_and_Beeston_Castle_-_geograph.org.uk_-_396353.jpg/256px-The_Sandstone_Trail_and_Beeston_Castle_-_geograph.org.uk_-_396353.jpg",
      "title": "John S Turner / The Sandstone Trail and Beeston Castle, via Wikimedia Commons",
      "caption": "The Sandstone Trail and Beeston Castle. The trail crosses this bridge stile and then veers left to cross the next field. The halfway point on the trail is Beeston Castle, which is disguised by the prominent tree on the far side of the field. During the English Civil War, many castles that had been neglected were repurposed for military use. Beeston Castle was seized on 20 February 1643 by Parliamentary forces under the command of Sir William Brereton. The fortifications were repaired, and efforts were made to clear out the motte. In 1643, a portion of the royal army of Ireland arrived at Chester. On 13 December 1643, Captain Thomas Sandford and eight soldiers from that army infiltrated Beeston under cover of darkness, possibly with the aid of treachery, and surprised the castle governor, Captain Thomas Steele. So rattled by the event, Steele surrendered under the condition that he and his men would be allowed to exit the castle with dignity. Steele was subsequently tried and executed for his failure to defend the castle. The Royalists endured a siege by Parliamentary forces from November 1644 until November 1645, when their dwindling food supplies compelled them to surrender. To prevent its further use as a military stronghold, the castle was partially demolished in 1646. In the late 17th century, Sir Thomas Grosvenor, 3rd Baronet, commissioned William Samwell to construct Eaton Hall. The positioning of the hall was intended to draw attention to the ruins of Beeston Castle. During the 18th century, quarrying activities were conducted in the castle grounds, leading to the demolition of the gatehouse that provided access to the outer bailey. The gatehouse was dismantled to facilitate the removal of stones from the site. In 1840, the castle was acquired by John Tollemache, 1st Baron Tollemache, who was then the largest landowner in Cheshire, as part of a larger estate. In the mid-19th century, the castle hosted an annual two-day fete, which raised funds for local widows and orphans. This event attracted over 3,000 visitors per day."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Beeston_Castle%2CCheshire._-_geograph.org.uk_-_618741.jpg",
      "title": "Phil Newton / Beeston Castle,Cheshire., via Wikimedia Commons",
      "caption": "View across the rolling Cheshire countryside. Evidence suggests that Beeston Castle's history extends back to the Neolithic era, with excavations revealing pits dating to the 4th millennium BC, indicating habitation or communal gatherings during that time. Neolithic flint arrowheads have been unearthed on the crag, along with remnants of a Bronze Age settlement and an Iron Age hill fort. Archaeological findings point to Bronze Age activity on the crag, with the rampart associated with this period dated to approximately 1270–830 BC. Seven circular structures discovered in the vicinity are believed to have originated from either the late Bronze Age or early Iron Age. This site may have functioned as a specialized center for metalworking during ancient times."
    }
  ],
  "distance_km": 1.0,
  "description": "Climb to the ruins of this 13th century castle and enjoy wonderful views over the Cheshire Plain on this short circular walk in the Peckforton Hills. The site is a significant historical structure and is one of the more popular walks in the area. You can park at the car park on Chapel Road and then follow the nice walking trail up to the castle ruins. From here you can enjoy one of the most spectacular views of any castle in England. You can see across eight counties from the Pennines in the east to the Welsh mountains in the west. There's also an exhibition detailing 4000 years of the castle's history and 40 acres of woodland trails. The Sandstone Trail runs past the castle so you can pick this up to extend your walk. If you head south you will soon come to Peckforton Castle and the Peckforton Hills where you can enjoy some nice woodland trails. You can virtually explore some of the castle grounds on the google street view link below. The circular Burwardsley Walk starts from the nearby village and climbs to the castle as well as exploring the Peckforton Hills, Bickerton Hill and the nearby Bulkeley Hill .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Sandstone Cafe is conveniently located right next to the hill, near the car park. They do a good selection of snacks and have a number of nice picnic tables so you can sit outside. You could also head to the Pheasant Inn for some refreshments after your walk. The pub has a lovely garden area with wonderful views over the Cheshire Plain. It's the perfect place to relax outside after your exercise. There's a great menu and it's also dog friendly. You can find the pub in Burwardsley with a postcode of CH3 9PF."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The castle hill and the surrounding woodland are a great place for a dog walk and you will probably see plenty of other owners on a fine day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east from the castle you will soon come to Beeston Locks on the Shropshire Union Canal. It's a nice place for an additonal easy stroll if you have time. The circular Tarporley Walk visits the canal and the castle from the nearby village using part of the Sandstone Trail. Bunbury locks and the associated village of Bunbury are also just to the east. The impressive staircase locks and the delightful historic settlement are well worth a visit. A few miles to the west you will find the pleasant village of Tattenhall. Here you can visit the noteworthy Ice Cream Farm, the largest ice cream shop in the world. The popular tourist attraction includes expansive children's play areas, farm animals and quad bikes. You can find them at Drumlan Hall, Newton Ln, CH3 9NE. Just to the south east of Bickerton you'll find Cholmondeley where you can explore the 19th century Cholmondeley Castle. The castle is surrounded by 70 acres of beautiful parkland and gardens with an arboretum, herbaceous borders, lakes and a fine viewpoint to enjoy. Near here there's also the market town of Malpas with its timber framed properties and noteworthy 14th century church. For more walking ideas in the area see the Cheshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/CRzrifhh-nc",
  "county": "Cheshire West and Chester",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Beeston Castle and Woodland Park, Tattenhall Lane, Beeston, Cheshire West and Chester, England, CW6 9UA, United Kingdom",
  "postcode": "CW6 9UA",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}