{
  "created_at": "2025-01-06T02:36:25.322179+00:00",
  "objectID": "82ae62dc23f6c8a73bda9a588d8812da",
  "ref": "paston-way-walking-route",
  "title": "Paston Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/View_south_towards_Paston_-_geograph.org.uk_-_600798.jpg",
  "nearby": [
    {
      "description": "North Walsham and Dilham Canal",
      "objectID": "62985357e8c2c1ecd8e8b9591442e931",
      "ref": "north-walsham-and-dilham-canal-walking-route"
    },
    {
      "description": "Cromer to Overstrand",
      "objectID": "4d06f4d5e111433208f88f17e19e25ae",
      "ref": "cromer-to-overstrand-walking-route"
    },
    {
      "description": "Gunton Park",
      "objectID": "e6bbde2f1fdf54bf6388eebde68756ae",
      "ref": "gunton-park-walking-route"
    },
    {
      "description": "Weavers' Way",
      "objectID": "7131b312a7084ac4f9a14e1988ba6a2c",
      "ref": "weavers-way-walking-route"
    },
    {
      "description": "North Walsham and Dilham Canal",
      "objectID": "62985357e8c2c1ecd8e8b9591442e931",
      "ref": "north-walsham-and-dilham-canal-walking-route"
    },
    {
      "description": "Cromer to Mundesley Walk",
      "objectID": "af8455745f601d7222be0667bbd051b1",
      "ref": "cromer-to-mundesley-walk-walking-route"
    },
    {
      "description": "Cromer to Overstrand",
      "objectID": "4d06f4d5e111433208f88f17e19e25ae",
      "ref": "cromer-to-overstrand-walking-route"
    },
    {
      "description": "Cromer to Sheringham",
      "objectID": "00aa38d47847e18fcb357b1b3ebd6c6c",
      "ref": "cromer-to-sheringham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/82ae62dc23f6c8a73bda9a588d8812da.gpx",
  "_geoloc": {
    "lat": 52.9324472895,
    "lng": 1.300993734
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/View_south_towards_Paston_-_geograph.org.uk_-_600798.jpg",
      "title": "Evelyn Simak / View south towards Paston",
      "caption": "View south towards Paston St Margaret's church and the roof of Paston Great Barn can be seen amidst the trees in mid-distance. The Great Barn (a Site of Special Scientific Interest restored by English Nature, in cooperation with the North Norfolk Historic Buildings Trust) is used as a breeding and hibernation site by a number of rare bat species."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/The_Paston_Way_-_geograph.org.uk_-_961102.jpg/256px-The_Paston_Way_-_geograph.org.uk_-_961102.jpg",
      "title": "Evelyn Simak / The Paston Way",
      "caption": "A view of the trail just north of North Walsham. Following the course of a dismantled railway line, the Paston Way takes its name from the Pastons - a landowning and merchant family during the Medieval and Tudor periods - who adopted their name from the small village of the same name, located on the north east coast of Norfolk. The walk starts by the gates of Paston College in North Walsham, crossing the Market Place. Traversing the churchyard of St. Nicholas from the south it finishes in the church of St Peter and St Paul at Cromer. The trail leads through sixteen villages and towns and links with the Weavers Way both at Cromer and North Walsham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/The_Market_Place_-_geograph.org.uk_-_617099.jpg",
      "title": "Evelyn Simak / The Market Place",
      "caption": "The Market Place in North Walsham. After the arrival of Flemish weavers during the 14th century the village of North Walsham grew into a town, and by 1739 altogether 68 families were involved in producing the so-called light Walsham cloth, which was less heavy than the cloth made in the nearby village of Worstead. North Walsham was the centre of the Peasant's Revolt of 1381 and the final battle took place nearby - a 15th century stump cross was erected to mark the exact location. Many houses were destroyed in a fire in 1600. Thanks to the bypass built in 1977 heavy traffic is kept out of the town centre, where a weekly market is still being held."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Two_footbridges_-_geograph.org.uk_-_1216036.jpg",
      "title": "Evelyn Simak / Two footbridges",
      "caption": "Two footbridges on the trail. Several footbridges take the Paston Way over drains and Mundesley Beck. This section of footpath links Heath Lane with Hall Road, further in the south. Hall Farm can be seen in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Hall_Farmhouse_-_geograph.org.uk_-_1216379.jpg",
      "title": "Evelyn Simak / Hall Farmhouse",
      "caption": "Hall Farmhouse, just west of Gimingham. Hall Farmhouse is a flint and brick house with 19th century windows. The south gable bears the date 1752. This view was taken from the Paston Way which leads past here, linking Heath Lane with Hall Road, a short distance further to the south."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Disused_railway_bridge_-_geograph.org.uk_-_961099.jpg",
      "title": "Evelyn Simak / Disused railway bridge",
      "caption": "Disused railway bridge. Over the Paston Way; the steps seen at left lead from the end of Mundesley Road down to the former railway track bed which now serves as a long distance footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/The_church_of_All_Saints_-_the_Paston_Door_-_geograph.org.uk_-_720107.jpg/256px-The_church_of_All_Saints_-_the_Paston_Door_-_geograph.org.uk_-_720107.jpg",
      "title": "Evelyn Simak / The church of All Saints - the Paston Door",
      "caption": "The church of All Saints at Edingthorpe - the Paston Door. The church of All Saints houses a number of interesting medieval survivals. A medieval font ; the original 12th century north door, the so-called \"Paston door\" (seen here); a rood screen with elaborately carved tracery, depicting six apostles on its panels. There are wall paintings dating from the 14th century depicting scenes from the Seven Works of Mercy and a St Christopher. The Elizabethan reading desk dates from 1587. The church is kept locked but a key is available."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/The_church_of_SS_Peter_and_Paul_-_geograph.org.uk_-_873394.jpg",
      "title": "Evelyn Simak / The church of SS Peter & Paul",
      "caption": "The church of SS Peter & Paul in Cromer. The church of SS Peter and Paul has the tallest tower of any Norfolk parish church and three porches, the west porch being the most elaborately executed, with groined roof, image niches and decorated battlements. By 1757 the building was in such a derelict condition that total demolition was considered but with increasing visitor numbers to the newly-discovered seaside resort the architect Arthur Blomfield was brought in, in 1882, resulting in extensive restoration work. Furnishings and font date from that time; the south aisle east window is by Morris & Co (1874) and the chancel east window was made by Hardman & Co in 1875. The Rudland and Clark memorial windows in the south aisle depict scenes of local interest."
    }
  ],
  "distance_km": 29.0,
  "description": "Follow the Paston Way and the Norfolk Coast from Cromer to North Walsham on this splendid walk. You start at the seaside town of Cromer and head to Overstrand along the cliff top path. After a short inland stretch the route rejoins the coast at Mundesley, passing along the sea front towards Bacton. The final stretch takes you inland towards the finish point at North Walsham. Highlights on the route include the wonderful coastal scenery and pretty seaside towns. Much of the route is also suitable for cyclists. See the video below for more details. At the end of the route you can extend your walk by visiting the North Walsham and Dilham Canal and Pigney's Wood Nature Reserve. The trail passes both just before finishing in the town.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Gunton Arms is located just of the path near Antingham. They serve excellent seafood and also provide accommodation with views over the adjacent Gunton Park. This includes a room formerly occupied in the 1890s by society beauty Lillie Langtry with photographs of her and her lover The Prince of Wales, who was later to be King Edward VII. The marble in the bathrooms was found in Egypt by Robert Kime and came out of derelict mansions in Alexandria. There's a large outdoor area where you can enjoy views of the deer in the next field. You can find them at postcode NR11 8TZ for your sat navs. In the park itself there's a herd of deer and a 19th century working sawmill to see. The picturesque thatched mill is notable as the only surviving water powered sawmill in Norfolk. In Overstrand The White Horse is a good pub and hotel providing rooms if you wish to stay in the area. They serve fine quality food and have a large, lawned garden area with a children's play area. You can find them on the High Street at postcode NR27 0AB for your sat navs. They are dog friendly as well."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At Cromer and North Walsham the trail links with the Weavers' Way. In Cromer you can pick up a few coastal walks including the Cromer to Mundesley Walk, the Cromer to Overstrand Walk and the Cromer to Sheringham Walk. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Bp2WwI1xFfI",
  "district": "North Norfolk",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Litter, Cromer Promenade, Cromer, North Norfolk, Norfolk, England, NR27 9HE, United Kingdom",
  "postcode": "NR27 9HE",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "coastal scenery",
    "seaside towns",
    "nature reserve"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}