{
  "created_at": "2025-01-06T03:55:31.458141+00:00",
  "objectID": "82d96ac2c28e80e32fdeea9d6a3ccc43",
  "ref": "fontburn-reservoir-walking-route",
  "title": "Fontburn Reservoir Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/69/Fontburn_Reservoir%2C_Northumberland_-_geograph.org.uk_-_125346.jpg",
  "nearby": [
    {
      "description": "Cragside Country Park",
      "objectID": "5d44009a19e4c39db3a68490767c1861",
      "ref": "cragside-country-park-walking-route"
    },
    {
      "description": "Simonside Hills",
      "objectID": "b57d4d3432f4e77e22779ef7fc49285d",
      "ref": "simonside-hills-walking-route"
    },
    {
      "description": "St Oswald's Way",
      "objectID": "cdb9d3229e413d00e7a4e7b4b2ff2136",
      "ref": "st-oswalds-way-walking-route"
    },
    {
      "description": "Harewood Forest",
      "objectID": "c5d680fcb4e8486f3dbcc8e5e8e6d33a",
      "ref": "harewood-forest-walking-route"
    },
    {
      "description": "Harwood Forest",
      "objectID": "82f81ec20a2ddc3f5d6493e2d699447e",
      "ref": "harwood-forest-cycle-route"
    },
    {
      "description": "Harbottle",
      "objectID": "78044d2725cc73985214462786f169ea",
      "ref": "harbottle-walking-route"
    },
    {
      "description": "Otterburn Ranges",
      "objectID": "a47cb9e29a5afa6abe3379af6101951b",
      "ref": "otterburn-ranges-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/82d96ac2c28e80e32fdeea9d6a3ccc43.gpx",
  "_geoloc": {
    "lat": 55.2355243102,
    "lng": -1.9239411973
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Fontburn_Reservoir%2C_Northumberland_-_geograph.org.uk_-_125346.jpg",
      "title": "Ralph Rawlinson / Fontburn Reservoir, Northumberland",
      "caption": "Fontburn Reservoir was opened to the west of the railway in 1901 by the Waterworks Department of Tynemouth Corporation. This is a view of the reservoir tower looking north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/Footpath_near_Fontburn_Reservoir_-_geograph.org.uk_-_196981.jpg",
      "title": "Les Hull / Footpath near Fontburn Reservoir",
      "caption": "Footpath view near the Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Cup_and_ring_marked_rock_at_west_end_of_Fontburn_Reservoir_-_geograph.org.uk_-_1172600.jpg",
      "title": "Andrew Curtis / Cup and ring marked rock at west end of Fontburn Reservoir",
      "caption": "Cup and ring marked rock at west end of Fontburn Reservoir. The rock, marked on the upper surface, is in the right foreground, under the lower branches of the coniferous trees which line the south side of the reservoir. The view to its left extends over a richly wooded and marshy landscape to Lough Hill in the Harwood Forest plantations and to the Simonside Hills in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Fontburn_Reservoir_four_poster_stone_circle_-_geograph.org.uk_-_1172627.jpg",
      "title": "Andrew Curtis / Fontburn Reservoir four poster stone circle",
      "caption": "Four poster stone circle and unusual tree near the water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Disused_Railway_Viaduct_and_Water_Treatment_Works%2C_Fontburn%2C_Northumberland._-_geograph.org.uk_-_125344.jpg",
      "title": "Ralph Rawlinson / Disused Railway Viaduct & Water Treatment Works, Fontburn, Northumberland.",
      "caption": "Disused Railway Viaduct & Water Treatment Works, Fontburn, Northumberland. On its way north the Northumberland Central Railway's branch from Scotsgap to Rothbury had to bridge the River Font. The result was this fine twelve arch viaduct which today stands disused alongside Fontburn Reservoir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Fishing_-_geograph.org.uk_-_281401.jpg",
      "title": "george hurrell / Fishing",
      "caption": "Fishing at the reservoir on a fine day"
    }
  ],
  "distance_km": 6.0,
  "description": "This circular walk takes you around the lovely Fontburn Reservoir in Northumberland. The walk starts at the car park on the eastern edge of the reservoir and follows a waterside path along the southern shoreline. At the western end of the reservoir the path heads through woodland before climbing towards Priest's Knowe where there are lovely views of the reservoir. You then descend to Ritton White House before another short woodland section takes you back to the car park. All the while there are wonderful views of the surrounding countryside, particularly the Simonside Hills and Harwood Forest. The route runs for about 4 miles with some small climbs, so suitable for most abilities. If you would like to continue your walking in the area then you could pick up the St Oswald's Way and explore the beautiful Simonside Hills.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Gate is located just to the north east of the reservoir at Forestburn Gate. The remote inn has a cosy real fire and beer garden for warmer days. You can find the pub about a mile from the site on the B6342 road at a postcode of NE61 4PS."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The reservoir and the surrounding countryside are a nice place for a dog walk. The Gate pub mentioned above is also dog friendly. There's also some nice dog walking to be found to the west of the site at Harwood Forest."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head a little south of the site then you can visit Rothley Lakes where there is a pretty reservoir. Near here there's also Broomfield Fell where there are some woodland trails to try. Head a few miles north west from the lake and you can pick up the circular Alwinton Walk. The route starts in the nearby little village and visits the River Alwin, River Coquet, the ruins of Harbottle Castle, West Wood and the excellent viewpoint at the Drake Stone. There's also a 12th century Norman church and a couple of classic old village pubs to visit in the area. From the village car park you can also pick up the circular Usway Burn - River Coquet - Upper Coquetdale Walk. The delightful villages of Elsdon and Otterburn are well worthy of a visit. The former includes an ancient church, a large village green, the remains of the old motte and bailey castle and a noteworthy Pele tower. The latter has nice trails along the pretty Otter Burn and the historic Otterburn Hall with its fine architecture and deer park. For more walking ideas in the area see the Northumberland Walks and the Northumberland National Park Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/OUKpOOotJ-w",
  "county": "Northumberland",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}