{
  "created_at": "2025-01-06T02:02:41.252447+00:00",
  "objectID": "82f4c21d16ec6bf29baad4d914db7060",
  "ref": "east-devon-way-walking-route",
  "title": "East Devon Way - East Devon AONB Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/East_Devon_Way_-_geograph.org.uk_-_1066536.jpg",
  "nearby": [
    {
      "description": "Woodbury Common Devon",
      "objectID": "0fef657b2c57fabfd5d3980ac08de5de",
      "ref": "woodbury-common-devon-walking-and-cycle-route"
    },
    {
      "description": "Exmouth to Lympstone Walk",
      "objectID": "03ecfc58bd4216b322e81438eb769432",
      "ref": "exmouth-to-lympstone-walk-walking-route"
    },
    {
      "description": "Exe Estuary Trail",
      "objectID": "5c2d93304647c7002c0f1c2912b04c2d",
      "ref": "exe-estuary-trail-cycle-route"
    },
    {
      "description": "Colyton",
      "objectID": "5ff077312ba16c357a0f8453b96dcd7d",
      "ref": "colyton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/82f4c21d16ec6bf29baad4d914db7060.gpx",
  "_geoloc": {
    "lat": 50.6204426806,
    "lng": -3.4160599318
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/East_Devon_Way_-_geograph.org.uk_-_1066536.jpg",
      "title": "Peter Holmes / East Devon Way, via Wikimedia Commons",
      "caption": "East Devon Way. Public Bridleway between Woodhouse Lane and Trinity Hill Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/East_Devon_Way_-_geograph.org.uk_-_1065296.jpg",
      "title": "Peter Holmes / East Devon Way, via Wikimedia Commons",
      "caption": "The footpath approaches Uplyme and Lyme Regis Cricket Clubhouse and grounds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Fields_from_East_Devon_Way_-_geograph.org.uk_-_448978.jpg",
      "title": "Derek Harper / Fields from East Devon Way, via Wikimedia Commons",
      "caption": "Fields from East Devon Way. A green lane to Combpyne climbs past the small wood on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/East_Devon_Way_below_Bulmoor_-_geograph.org.uk_-_448581.jpg",
      "title": "Derek Harper / East Devon Way below Bulmoor, via Wikimedia Commons",
      "caption": "East Devon Way below Bulmoor. The footpath running along the edge of a field and passing a rather gaunt oak. Ahead is a valley descending to join the Axe near Boshill Cross; the East Devon Way, however, climbs the valley side to the right, passing Crocker's Pit Coppice which can be seen on the hillside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/East_Devon_Way_below_Bulmoor_-_geograph.org.uk_-_441693.jpg",
      "title": "Derek Harper / East Devon Way below Bulmoor, via Wikimedia Commons",
      "caption": "The green lane from Bulmoor to Combpyne makes a right-angled bend to the left here, dropping to cross a tributary of the Axe, but the East Devon Way, which has followed it below Woodland Farm, continues as a field path, leaving the square after a few metres."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/East_Devon_Way_below_Woodbury_Common_-_geograph.org.uk_-_163108.jpg",
      "title": "Derek Harper / East Devon Way below Woodbury Common, via Wikimedia Commons",
      "caption": "East Devon Way below Woodbury Common. The path (here a bridleway) skirts the foot of the slope of the common on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/East_Devon_Way_near_Hartgrove_Farm_-_geograph.org.uk_-_450131.jpg",
      "title": "Derek Harper / East Devon Way near Hartgrove Farm, via Wikimedia Commons",
      "caption": "Near Hartgrove Farm. The Way leaves lane junction below at this point and climbs a field, heading up Shapwick Hill into the next square."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Lane_junction_near_Hartgrove_Farm_-_geograph.org.uk_-_450105.jpg",
      "title": "Derek Harper / Lane junction near Hartgrove Farm, via Wikimedia Commons",
      "caption": "Lane junction near Hartgrove Farm. As the sign says, the lane to the left leads to Combpyne. Over the wall and down a cutting, but unfortunately completely inaccessible, is the line of the dismantled Axminster & Lyme Regis Railway."
    }
  ],
  "distance_km": 64.0,
  "description": "This walk follows the East Devon Way along the Exe Estuary and then through the East Devon Area of Outstanding Natural Beauty to finish at Uplyme near the Dorset/Devon border. The walk takes you across a variety of landscapes including heathland, woodland and valleys and also includes some lovely riverside stretches. You start in Exmouth and follow the Exe Estuary to Lympstone where you turn east towards Harpford, crossing the East Devon Commons and the RSPB Aylesbeare Nature Reserve as you go. You'll pass the lovely Woodbury Common where you'll find heathland, gorse, heather and pebblebeds from rivers which once flowed across the basin. There's also the ancient hill fort of Woodbury Castle where there are great views of the Exe estuary, Haldon Hills, Otter Valley, and Portland Bill on the coast. The route continues through Harpford Woods and Harpford Common before a stretch through the Beacon Hill Nature Reserve takes you to the village of Sidbury and then onto Northleigh. Shortly after you join a pleasant riverside stretch along the River Coly taking you into Colyton. Another waterside section along the River Axe takes you to Musberry Hill where there are splendid views of the Axe Valley. The final leg then takes you from Musbury Hill to Uplyme where you finish by the River Lym.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The pretty village of Lympstone is a nice place to stop for refreshments on the route. The Swan Inn has a good menu and a beer garden to sit out in during the summer months. You can find it on The Strand at postcode EX8 5ET. Susannah's Tea Room is another great option and also located on The Strand in Lympstone. You can enjoy a lovely Devon cream tea in the outdoor seating area. Near Woodbury common you could take a short detour to visit the pretty village of Woodbury. There's a few nice pubs here including The Maltsters Arms which is first recorded in 1923 as a Woodbury Pub. The Maltster was the man who prepared the barley for the Brewer by steeping it in water until it had absorbed the correct amount of moister (learned by experience). The pub has a large car park does excellent food and has a lovely large garden to sit out in on warmer days. You can find it in the centre of the village at postcode EX5 1LN for your sat navs. The White Hart is another good option in the village. It also has a nice beer garden and a good menu. It can be found on Church Stile Lane at postcode EX5 1HN."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Woodbury Common you will pass the delightful Bystock Pools Nature Reserve. It's worth taking a small detour from the trail to explore the reserve which includes boardwalks, wildflower meadows and a lilly-pad filled lake with lots of wildlife."
    }
  ],
  "postcode": "EX8 1DG",
  "district": "East Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Imperial Road short stay car park, The Royal Avenue, Withycombe, Exmouth, East Devon, Devon, England, EX8 1DG, United Kingdom",
  "state": "England"
}