{
  "created_at": "2025-01-05T23:46:25.593216+00:00",
  "objectID": "8330d225a05e9c70b165709efc271ad4",
  "ref": "tollesbury-walking-route",
  "title": "Tollesbury Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Tollesbury_Wick_Sluice_-_geograph.org.uk_-_218944.jpg",
  "nearby": [
    {
      "description": "Mersea Island",
      "objectID": "88167f9a3e8161804fca630349812fb5",
      "ref": "mersea-island-walking-route"
    },
    {
      "description": "Colchester",
      "objectID": "c812da215b78f6f85cce7cc49749536a",
      "ref": "colchester-walking-route"
    },
    {
      "description": "Maldon",
      "objectID": "5f66a58fcffef66a7b9ff67bab0409e1",
      "ref": "maldon-walking-route"
    },
    {
      "description": "Brightlingsea",
      "objectID": "42ddcf57ead18c96455ca71d95af4c5b",
      "ref": "brightlingsea-walking-route"
    },
    {
      "description": "Blackwater Estuary",
      "objectID": "babc6834b61398b0b0c77b9148a0bf9d",
      "ref": "blackwater-estuary-walking-route"
    },
    {
      "description": "High Woods Country Park",
      "objectID": "e0854fec4015f77f88cca692bbcfd463",
      "ref": "high-woods-country-park-walking-and-cycle-route"
    },
    {
      "description": "Ardleigh Reservoir",
      "objectID": "50c46a24df905637d94869b899e95552",
      "ref": "ardleigh-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8330d225a05e9c70b165709efc271ad4.gpx",
  "_geoloc": {
    "lat": 51.7596931701,
    "lng": 0.8433412995
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Tollesbury_Wick_Sluice_-_geograph.org.uk_-_218944.jpg",
      "title": "Glyn Baker / Tollesbury Wick Sluice",
      "caption": "Tollesbury Wick Sluice. This sluice controls the water level for the whole of Tollesbury Wick grazing marsh. The marsh is part of a 600 acre nature reserve managed by Essex Wildlife Trust. It is also part of the Blackwater Estuary SSSI and National Nature Reserve"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Avocet_Over_Tollesbury_Wick_-_geograph.org.uk_-_790970.jpg",
      "title": "Glyn Baker / Avocet Over Tollesbury Wick",
      "caption": "Avocet in flight over the reserve. These marshes have played their part in saving threatened species such as the Avocet. By 1825 the Avocet was extinct in the U.K. A few pairs returned after WW2. It is no accident that the RSPB made this bird their symbol The RSPB manage a national nature reserve a little further along the coast called Old Hall Marsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/The_site_of_Tollesbury_Pier_railway_station_-_geograph.org.uk_-_40324.jpg",
      "title": "Ron Strutt / The site of Tollesbury Pier railway station",
      "caption": "The site of Tollesbury Pier railway station. In 1907 the Kelvedon & Tollesbury Light Railway was extended to a new station at the landward end of a pier on Tollesbury Wick Marshes. The station consisted of an old railway carriage body and a small brick building. It lasted no more than 14 years before being abandoned. The development which it was hoped would follow the railway never happened and the marsh, still completely remote, is now a nature reserve. The tower seen in the far distance in the photo is a World War II lookout tower."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/View_to_Great_Cob_Island_-_geograph.org.uk_-_218950.jpg",
      "title": "Glyn Baker / View to Great Cob Island",
      "caption": "View to Great Cob Island. This is the view across the Saltmarsh on Tollesbury Wick Nature Reserve towards Great Cob Island and West Mersea beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Towards_Shinglehead_Point_-_geograph.org.uk_-_558228.jpg",
      "title": "Glyn Baker / Towards Shinglehead Point",
      "caption": "Towards Shinglehead Point. This is the seawall footpath around Tollesbury Wick Marshes looking towards the point with Mersea Island behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Woodrolfe_Creek%2C_Tollesbury_-_geograph.org.uk_-_1043698.jpg",
      "title": "Bob Jones / Woodrolfe Creek, Tollesbury",
      "caption": "Woodrolfe Creek. Looking upstream from the northern end of the hard. The crane indicates the location of the boatyard of Tollesbury Saltings Ltd."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Tollesbury_Saltings_-_geograph.org.uk_-_1044534.jpg",
      "title": "Bob Jones / Tollesbury Saltings",
      "caption": "Tollesbury Saltings This is one of the longer bridges that cross the many creeks and inlets that meander through the saltings. The square-shaped building in the distance is the Bradwell nuclear power station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Old_seawall%2C_Tollesbury_-_geograph.org.uk_-_1186471.jpg",
      "title": "Simon Huguet / Old seawall, Tollesbury",
      "caption": "Out on the old seawall near the breach, looking back towards the head of Old Hall Creek, with Old Hall Farm in the distance."
    }
  ],
  "distance_km": 8.0,
  "description": "This circular walk takes you around the lovely Tollesbury Wick Marshes. On the way there's fine views over to Mersea Island and a waterside stretch along the River Blackwater. The marshes are excellent for bird watching with Golden Plover, Lapwing, Wigeon, Avocet and Marsh Harrier notable species. There's also sheep, cattle and Exmoor ponies to see on the attractive grazing marshes. Start the walk from the public car park just to the east of the village. From here you can pick up footpaths heading east past the marina and then around the marshes. It's a flat path so will suit most abilities. The route runs for about 5 miles with the option of continuing west along Goldhanger Creek towards Maldon on the Blackwater Estuary Walk. This section of the path gives good views out to Osea Island and Northey Island where there are more excellent bird watching opportunities.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Harbour View Restaurant is located in a great position at Tollesbury Marina. They do very good seafood which you can enjoy outside with views over the coastline. You can find the restaurant at 37 Woodrolfe Park with a postcode of CM9 8SE for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west and you could visit the neighbouring village of Goldhanger. There's more nice trails along the sea wall with a 14th century pub and noteworthy Norman church to see in the village. On the opposite side of the estuary there's the village of Bradwell on Sea to visit. Here you can pick up the epic St Peters Way footpath which starts from the 7th century chapel of St Peter on the Wall, just to the east of the village. For more walking ideas in the area see the Essex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dK87y6ZUJbs",
  "district": "Tollesbury",
  "county": "Essex",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}