{
  "created_at": "2025-01-06T03:22:21.825049+00:00",
  "objectID": "83c8a1c0d3ee12a36247b8ba10f6556f",
  "ref": "cricket-st-thomas-walking-route",
  "title": "Cricket St Thomas Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/67/Clump_of_trees_above_Cricket_St_Thomas_-_geograph.org.uk_-_508555.jpg",
  "nearby": [
    {
      "description": "Liberty Trail",
      "objectID": "c3975730f5d984ea6aa97c0f43011ab1",
      "ref": "liberty-trail-walking-route"
    },
    {
      "description": "Wayford Woods",
      "objectID": "e6129bf7502cfb0f4d045b83d44d86ce",
      "ref": "wayford-woods-walking-route"
    },
    {
      "description": "Forde Abbey",
      "objectID": "1ebbb7de73ab5f80b3e5657d37eef4ca",
      "ref": "forde-abbey-walking-route"
    },
    {
      "description": "Chard Reservoir",
      "objectID": "08eb1cdc3a77f0f1846201a5610feedd",
      "ref": "chard-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/83c8a1c0d3ee12a36247b8ba10f6556f.gpx",
  "_geoloc": {
    "lat": 50.8735125131,
    "lng": -2.8904167778
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Clump_of_trees_above_Cricket_St_Thomas_-_geograph.org.uk_-_508555.jpg",
      "title": "Derek Harper / Clump of trees above Cricket St Thomas",
      "caption": "Clump of trees above Cricket St Thomas. The clump forms part of the landscaped park in the valley above the village. Taken from the edge of a field beside Weston Ground Plantation and the lane from Purtington to Winsham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Somerset_landscape_with_camel_-_geograph.org.uk_-_1274857.jpg",
      "title": "Ken Grainger / Somerset landscape with camel",
      "caption": "Somerset landscape with camel Cricket St Thomas wildlife park. The former deer park of the house, known as \"Cricket Park\", were designed by D.D (David) Davis, a noted horticulturist at the start of the 19th Century, and were later turned into a wildlife park shown here. At its peak the park was home to 600 rare and endangered species including lemurs, primates, camels, reptiles and wildfowl. The wildlife park closed in 2009 and most of the larger animals were moved to other zoos around the country. Some of the smaller animals, such as the lemurs, were kept and the park was returned to gardens and lakes, re-opening in mid-2010. The park has since closed again and very little remains of the enclosures or buildings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/19/Winsham%2C_north_from_Limekiln_Lane_-_geograph.org.uk_-_153522.jpg",
      "title": "Martin Bodman / Winsham: north from Limekiln Lane",
      "caption": "Winsham: north from Limekiln Lane Looking towards Chalkway and Puthill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Old_Wood_from_New_Lane_-_geograph.org.uk_-_507970.jpg",
      "title": "Derek Harper / Old Wood from New Lane",
      "caption": "Old Wood from New Lane. The field is on the steep northern slopes of the Windwhistle Ridge, and the lane curves around the edge of an embayment in the ridge where the Wall Brook rises. Old Wood, on the right at the foot of the field, follows this curve. The wood beyond, in the centre, is Middle Wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Cricket_House%2C_Cricket_St_Thomas_-_geograph.org.uk_-_1274852.jpg",
      "title": "Ken Grainger / Cricket House, Cricket St Thomas",
      "caption": "Cricket House, Cricket St Thomas. The surviving grade II listed Georgian manor house, known as \"Cricket House\", was built in 1786 by Admiral Alexander Hood, 1st Viscount Bridport (1726-1814), to the designs of the architect Sir John Soane. In the grounds is a pretty little garden house known as \"The Admirals Seat\". In 1999 the house was developed into a Warner Leisure Hotels resort."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Windwhistle_Inn%2C_Cricket_St_Thomas_-_geograph.org.uk_-_1114950.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Windwhistle Inn. This historic inn is a fine choice for some post walk refreshments."
    }
  ],
  "distance_km": 1.5,
  "description": "Explore 160 acres of lovely parkland and gardens on this walk around Cricket St Thomas in Somerset. In the park you will find peaceful lakes, secluded woodland and beautiful gardens. Highlights include the delightful Water Garden and the Grotto Garden with sculptural rocks. There is also the beautiful 19th century mansion of Cricket House which was designed by famous architect Sir John Soane. You can enjoy afternoon tea in the tea rooms and sit outside and enjoy the splendid views of the gardens and surrounding Somerset countryside. Cricket St Thomas is located just a few miles east of Chard. The Liberty Trail runs just south of the park so you could pick this up if you wanted to continue your walk. The trail will soon lead you to the nearby Wayford Woods. The delightful woods include streams, a lake, Rhododendrons and bluebells in the spring months. They are well worth a visit after exploring the park if you have time. The park is also located near to the historic Forde Abbey. Here you will find a historic Cistercian monastery with 30 acres of award winning gardens to explore.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Windwhistle Inn is conveniently located in Cricket St Thomas. The main attraction here is a lovely 5 acre garden with panoramic views. On a clear day and you can see all the way to Glastonbury Tor and the Bristol Channel from here. It's a great place to relax and enjoy a meal on a summer day. Children and dogs are welcome in this expansive area too. The inn also has an interesting history dating right back to the 17th Century when it was a notorious haunt of smugglers and highwaymen. More recently in 1902 Thomas Hardy mentioned the inn by name in his poem \"A Trampwoman's Tragedy\". It has a very good menu and a large car park too. You can find it on the A30 near Cricket St Thomas at a postcode of TA20 4DQ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a couple of miles west of Cricket St Thomas you'll find the delightful Chard Reservoir. There's a lovely walking trail around the water with an abundance of wildlife to look out for on the way. To the east there's the market town of Crewkerne. There's some interesting Georgian buildings, a fine hill top nature reserve and a 15th century church to visit here. For more walking ideas in the area see the Somerset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YzrPGAa4sPs",
  "postcode": "TA20 4DG",
  "district": null,
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swan Down, Cricket St Thomas, Cricket St. Thomas, Somerset, England, TA20 4DG, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "garden",
    "lake"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "views"
  ],
  "facilities": [
    "tea rooms",
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}