{
  "created_at": "2025-01-06T19:02:34.797548+00:00",
  "objectID": "842d30b5d22569191b0de5e5188a6e1a",
  "ref": "peak-district-boundary-walk-stage-1",
  "title": "Peak District Boundary Walk Stage 1  - Buxton to Peak Forest Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Buxton_-_the_market_place_-_geograph.org.uk_-_4538950.jpg/512px-Buxton_-_the_market_place_-_geograph.org.uk_-_4538950.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/842d30b5d22569191b0de5e5188a6e1a.gpx",
  "_geoloc": {
    "lat": 53.2568087,
    "lng": -1.9145834
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Buxton_-_the_market_place_-_geograph.org.uk_-_4538950.jpg/512px-Buxton_-_the_market_place_-_geograph.org.uk_-_4538950.jpg",
      "title": "Buxton - the market place by Peter Whatley, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Buxton. The route was developed by the Friends of the Peak District, a branch of the Campaign to Protect Rural England, and was officially launched on 17 June 2017. The trail begins and ends at the King's Head pub in Buxton, where a commemorative plaque has been installed by the Peak & Northern Footpaths Society (PNFS)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Approaching_Staden_Low_-_geograph.org.uk_-_3883515.jpg/512px-Approaching_Staden_Low_-_geograph.org.uk_-_3883515.jpg",
      "title": "Approaching Staden Low by Neil Theasby, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Approaching Staden Low. The route takes in a diverse range of landscapes, including the rugged moorlands of the South Pennines, the limestone scenery of the Derbyshire Dales, serene woodlands, reservoirs, and picturesque rural farmland. While most of the trail is within Derbyshire, it also crosses into Staffordshire, Cheshire, and Yorkshire. The walk’s highest point is at Shutlingsloe, which stands at 506 metres (1,660 ft) above sea level, contributing to the total ascent of 7,590 metres (24,900 ft) throughout the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2c/The_River_Wye_in_Wye_Dale_-_geograph.org.uk_-_3074191.jpg",
      "title": "The River Wye in Wye Dale by Graham Hogg, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The River Wye in Wye Dale. The walk is well-marked with green waymarkers and follows existing footpaths, tracks, quiet lanes, disused railway lines, and a canal towpath. For those interested in tackling this long-distance route, an official guide by Andrew McCloy is available, providing detailed insights and guidance for the journey. In August 2022, ultra runner Catharine Crossley set a remarkable record by completing the entire route in just 3 days, 11 hours, and 21 minutes, showcasing the walk's appeal not only to hikers but also to endurance athletes. This walk is a fantastic way to explore the boundary of the Peak District, with its rich history and stunning natural beauty."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Chee_Dale_-_geograph.org.uk_-_1247317.jpg",
      "title": "Dave Dunford / Chee Dale",
      "caption": "Chee Dale. These \"weirs\" are marked on the OS map; taken just upstream of the footbridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Farm_and_field%2C_Wormhill_-_geograph.org.uk_-_3125944.jpg/512px-Farm_and_field%2C_Wormhill_-_geograph.org.uk_-_3125944.jpg",
      "title": "Farm and field, Wormhill by Ruth Sharville, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Farm and field, Wormhill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Hay_Dale_National_Nature_Reserve_-_geograph.org.uk_-_2356714.jpg/512px-Hay_Dale_National_Nature_Reserve_-_geograph.org.uk_-_2356714.jpg",
      "title": "Hay Dale National Nature Reserve by Greg Fitchett, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Hay Dale National Nature Reserve. Hay Dale is part of the Derbyshire Dales National Nature Reserve. The Carboniferous limestone rocks of the reserve were formed 350 million years ago from the shells and sediments of a tropical sea. The reserve contains ash woodland, limestone grassland and many wildflowers"
    }
  ],
  "distance_km": 17.0,
  "description": "This is the opening stage of the long distance Peak District Boundary Walk running from Buxton to Peak Forest. The stage runs for just over 10 miles passing Staden Low, Cowdale, Deep Dale, the River Wye in Wye Dale, Chee Dale, Wormhill and the Hay Dale nature reserve. It is a waymarked trail so you can continue along the waymarkers to extend this walk. The complete circular walk is a challenging 190-mile (310 km) walking trail that encircles the Peak District, Britain’s first national park.",
  "details": [],
  "district": "Buxton",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}