{
  "created_at": "2025-01-05T23:42:49.359016+00:00",
  "objectID": "845b2d21023c0e96b027ae1a9f03ede7",
  "ref": "tonbridge-walking-route",
  "title": "Tonbridge Walks - River and Country",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a3/River_Medway_in_Tonbridge_-_geograph.org.uk_-_175049.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/845b2d21023c0e96b027ae1a9f03ede7.gpx",
  "_geoloc": {
    "lat": 51.1958448392,
    "lng": 0.2748970172
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/River_Medway_in_Tonbridge_-_geograph.org.uk_-_175049.jpg",
      "title": "Nigel Cox / River Medway in Tonbridge",
      "caption": "River Medway in Tonbridge. Viewed looking downstream from The Big Bridge towards Town Lock with The Wharf public house on the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Tonbridge_Castle_-_geograph.org.uk_-_1095054.jpg",
      "title": "Richard Croft / Tonbridge Castle",
      "caption": "Tonbridge Castle. View of the lower Castle Terrace and River Walk beside the Medway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Barden_Lake_-_geograph.org.uk_-_1527655.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Barden Lake. Scenic view over the lake with the handy information board showing wildlife you can see here. This includes kingfisher, great crested grebe and various dragonflies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/River_Medway_near_Tonbridge_-_geograph.org.uk_-_176508.jpg",
      "title": "Nigel Cox / River Medway near Tonbridge",
      "caption": "River Medway near Tonbridge. This weir is at the start of the channel that bypasses Eldridges Lock and is designed to take excess water in the River Medway from upstream of the lock to downstream of it. However the photograph was taken during a day of heavy rain, as evidenced by the threatening sky, and water levels were generally high. The footbridge takes the Medway Valley Walk over the bypass channel."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/The_Shallows%2C_Haysden_Country_Park_-_geograph.org.uk_-_1529396.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Shallows, Haysden Country Park. A cut off meander of the River Medway that runs through the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Southborough_Common_-_geograph.org.uk_-_121901.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cricket ground on Southborough Common. St Peter's parish church and the Common woodlands beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/Clocktower%2C_Summerhill_-_geograph.org.uk_-_191796.jpg",
      "title": "Nigel Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clocktower, Summerhill. Part of the large Summerhill manor house dating back to the 17th century. Now 3 schools."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Penshurst_Place_-_geograph.org.uk_-_449870.jpg",
      "title": "John Myers / Penshurst Place",
      "caption": "Penshurst Place"
    }
  ],
  "distance_km": 19.0,
  "description": "This long circular walk explores the parks, woods, commons, rivers and countryside surrounding the market town of Tonbridge in Kent. It makes use of three long distance waymarked trails to visit some of the highlights of the area. The walk starts on the River Medway, next to Tonbridge Castle. The castle is one of England's finest examples of a Motte and Bailey Castle and includes a 13th Century Gatehouse. You can tour the castle and learn all about the fascinating history for a fee. The castle grounds are free to enter though. From the castle you pick up the Eden Valley Walk and head west along the river to Barden Park where you will pass the pretty Barden Lake. There's a nice circular trail around the water here and an information board showing all the water loving wildlife you can see here. The path then continues past the lake into Haysden Country Park where there's another large lake and lots of wildfowl to look out for on the water. Here you have the option of continuing west and visiting the lovely Penshurst Place where there's lovely gardens, parkland and woodland to explore. After visiting Haysden Lake the route then heads south along the Wealdway through Lower Haysden to Bidborough and Southborough Common. Here you'll pass through the common with its woodland trails and pretty streams. The route then picks up a section of the Tunbridge Wells Circular Walk to take you east and then north through woodland and farmland. The path passes the Grade I listed Jacobean mansion of Somerhill House with its attractive grounds and lake. Other public footpaths then take you around the eastern side of the town before returning you to Tonbridge. There's lots of good options for continuing your walking in the beautiful High Weald. One favourite is the Medway Valley Walk which starts at Tonbridge Castle and follows the river to Rochester.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Verdigris Tonbridge is in a fine location right next to the river. You can sit outside in the garden area and enjoy a meal with a view overlooking the water. It's a very sophicticated place with fine food and lovely artwork to enjoy. You can find them at postcode TN9 1DR for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If were to continue west along the Eden Valley Walk you would soon come to the delightful village of Chiddingstone. This National Trust owned village includes a number of quaint timber framed Tudor buildings, a picturesque village pond, an ancient pub and the 15th century Chiddingstone Castle with its beautiful grounds and gardens. Hever Castle, another major local highlight is also located near here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jvWQwPKTG44",
  "postcode": "TN9 1DL",
  "district": "Tonbridge and Malling",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "High Street, Brook Street, Tonbridge, Tonbridge and Malling, Kent, England, TN9 1DL, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "pasture"
  ],
  "points_of_interest": [
    "historical site",
    "mansion",
    "lake",
    "park"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}