{
  "created_at": "2025-01-06T02:29:40.664533+00:00",
  "objectID": "8463cd586b92ae63a57a051352630d24",
  "ref": "pickering-walking-route",
  "title": "Pickering Country, River and Woods Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/83/Pickering_Beck_-_geograph.org.uk_-_1434202.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8463cd586b92ae63a57a051352630d24.gpx",
  "_geoloc": {
    "lat": 54.2470647835,
    "lng": -0.7803350005
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Pickering_Beck_-_geograph.org.uk_-_1434202.jpg",
      "title": "JThomas / Pickering Beck",
      "caption": "Pickering Beck. The river flows for over 18 miles (29 km) from its source in the North York Moors National Park, passing through the town of Pickering before joining Costa Beck at Kirby Misperton. It meanders through diverse landscapes, with its tributaries and streams traversing sandstone and limestone beds, as well as alluvial deposits of sand, clay, silt, and gravel. Historically the beck was used to power several watermills in the town. Three of these are still standing - High Mill, Vivers Mill and Low Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Pickering_Castle_1.jpg",
      "title": "Stephen McKay [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Pickering Castle. The castle has origins dating back to the 11th century. It was initially built by William the Conqueror as a wooden fortification to strengthen Norman control over northern England after the 1066 invasion. It was later rebuilt in stone during the 12th and 13th centuries, under the reign of Henry II and Edward II, becoming a formidable defensive structure in the region. The castle's design follows a typical motte-and-bailey layout, with a large central mound (motte) supporting a keep and a lower enclosed area (bailey) used for domestic and military buildings. Over the centuries, Pickering Castle served not only as a defensive fortress but also as a royal hunting lodge due to its proximity to the Royal Forest of Pickering. It also played a role in various medieval conflicts through the ages. Visitors can explore the castle’s remains, including its curtain walls, towers, and chapel, which offer insight into medieval castle life. The site also provides scenic views of the surrounding countryside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Field_above_Newbridge%2C_Pickering_-_geograph.org.uk_-_217833.jpg",
      "title": "Oliver Dixon / Field above Newbridge, Pickering",
      "caption": "Field above Newbridge, Pickering"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/West_Farm%2C_above_Pickering_-_geograph.org.uk_-_217836.jpg",
      "title": "Oliver Dixon / West Farm, above Pickering",
      "caption": "West Farm, above Pickering"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Cornfield%2C_Blansby_Park%2C_near_Pickering_-_geograph.org.uk_-_217837.jpg",
      "title": "Oliver Dixon / Cornfield, Blansby Park, near Pickering",
      "caption": "Cornfield, Blansby Park, near Pickering"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Farmhouse_at_High_Blansby_-_geograph.org.uk_-_538099.jpg",
      "title": "Phil Catterall / Farmhouse at High Blansby",
      "caption": "Farmhouse at High Blansby"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Path_Towards_Levisham_Station_-_geograph.org.uk_-_412252.jpg/256px-Path_Towards_Levisham_Station_-_geograph.org.uk_-_412252.jpg",
      "title": "Stephen Horncastle / Path Towards Levisham Station",
      "caption": "Path Towards Levisham Station"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Woodland_Trust_sign_at_East_Brow_Wood_-_geograph.org.uk_-_642453.jpg",
      "title": "Phil Catterall / Woodland Trust sign at East Brow Wood",
      "caption": "Woodland Trust sign at East Brow Wood"
    }
  ],
  "distance_km": 9.7,
  "description": "This ancient market town is in a good position for walkers wishing to explore the North York Moors National Park. This walk takes you from Pickering to the nearby village of Levisham, passing Newbridge and Blansby Park on the way. At the end of the walk you can catch the North Yorkshire Moors Railway back from Levisham railway station. The award winning heritage railway is a great way to see the area surrounding the town. The walk starts in the town centre close to the train station. Head north through the town along the western side of the Pickering Beck River. On your right you will pass the ruins of the motte-and-bailey Pickering Castle. The castle dates from the 13th century and is particularly well-preserved. The site is now managed by English Heritage so you can tour the castle and learn all about the history for a reasonable fee. The route continues towards Newbridge where you follow Blansby Park Lane into Blansby Park. There's some nice country paths and woodland trails to follow across the park and through East Brow Wood. The trail finishes at Levisham Station where you can catch the train back to Pickering. You can extend the walk by picking up a footpath at the station and heading east to the village of Levisham. Just to the east of the town you will find one of the prettiest villages in the national park at Thornton le Dale. There's delightful thatched cottages and lovely walks along the Thornton Beck to enjoy here. Another good option is to pick up the Tabular Hills Walk which runs through East Brow Wood and Levisham. You could pick up the trail and follow it up to the Hole of Horcum. The beautiful natural amphitheatre is a stunning sight and one of the highlights of the North York Moors. Dalby Forest is also located just to the north east of the town. There's miles of waymarked cycling and walking trails to try here. You could also catch the railway up to the pretty village of Goathland where you can visit Mallyan Spout waterfall.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the north west is the expansive Cropton Forest and the historic villages of Hutton-le-Hole and Lastingham, where you'll find the excellent Ryedale Folk Museum and the noteworthy 11th century St Mary's church respectively. Also nearby is the worthy village of Appleton Le Moors. It's another quaint place with a notable Grade I listed church and an excellent pub dating to the 17th century. There's also some lovely walks along the scenic River Seven to Sinnington to enjoy here. For more walking ideas in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/jIL6mmBhhY0",
  "district": "Pickering",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wells Walk, Pickering, North Yorkshire, York and North Yorkshire, England, YO18 8DU, United Kingdom",
  "postcode": "YO18 8DU",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "natural amphitheatre",
    "waterfall"
  ],
  "facilities": [
    "car park",
    "railway station",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}