{
  "created_at": "2025-01-06T02:06:28.423531+00:00",
  "objectID": "847364dd813477fa4b08a205a4334e41",
  "ref": "waltham-abbey-walking-route",
  "title": "Waltham Abbey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Waltham_Abbey_ruins_-_geograph.org.uk_-_2430794.jpg/512px-Waltham_Abbey_ruins_-_geograph.org.uk_-_2430794.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/847364dd813477fa4b08a205a4334e41.gpx",
  "_geoloc": {
    "lat": 51.688303043,
    "lng": -0.0041822936
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Waltham_Abbey_ruins_-_geograph.org.uk_-_2430794.jpg/512px-Waltham_Abbey_ruins_-_geograph.org.uk_-_2430794.jpg",
      "title": "Waltham Abbey ruins by Stephen Craven, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Waltham Abbey ruins"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Waltham_Abbey%2C_Essex_-_geograph.org.uk_-_311778.jpg",
      "title": "Christine Matthews / Waltham Abbey, Essex",
      "caption": "Highbridge Street looking east towards the Abbey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Waltham_Abbey_rose_garden_-_geograph.org.uk_-_2430800.jpg/512px-Waltham_Abbey_rose_garden_-_geograph.org.uk_-_2430800.jpg",
      "title": "Waltham Abbey rose garden by Stephen Craven, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Rose garden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/be/Royal_Gunpowder_Mills%2C_Waltham_Abbey_-_geograph.org.uk_-_1366239.jpg",
      "title": "Chris Allen / Royal Gunpowder Mills, Waltham Abbey",
      "caption": "Royal Gunpowder Mills. This is a waterwheel powered gunpowder press. The press is hidden behind the large traverse (blast wall) on the left. The round topped building houses the remains of the waterwheel powered hydraulic pressure pump. This part of the site is an SSSI and is viewed from a 'landtrain' tour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/78/Incorporating_mill%2C_Royal_Gunpowder_Mills_-_geograph.org.uk_-_1364748.jpg",
      "title": "Chris Allen / Incorporating mill, Royal Gunpowder Mills",
      "caption": "Incorporating mill, Royal Gunpowder Mills. This is the Group C Mills from 1861, a Grade 1 listed building with a central beam engine house flanked by three sets of incorporating mills each side. Each mill is separated by a blast wall and the front and back walls are lightweight."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Waltham_Abbey_Gateway_-_geograph.org.uk_-_1030425.jpg",
      "title": "Richard Croft / Waltham Abbey Gateway",
      "caption": "Gateway built in 1360 with some of the earliest brickwork in England"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Harold%27s_Bridge_in_Waltham_Abbey_-_geograph.org.uk_-_346714.jpg",
      "title": "Tony Osler / Harold's Bridge in Waltham Abbey",
      "caption": "Harold's Bridge. This bridge in the Abbey's grounds is reputed to be 1000 years old. King Harold was said to have been buried at Waltham Abbey after the battle of Hastings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/River_Lee_Navigation_near_Waltham_Cross_-_geograph.org.uk_-_542497.jpg",
      "title": "Nigel Cox / River Lee Navigation near Waltham Cross",
      "caption": "River Lee Navigation Canal near Waltham Cross. Narrowboat \"Bob\" approaches Waltham Town Lock."
    }
  ],
  "distance_km": 9.0,
  "description": "Enjoy a circular walk around Waltham Abbey and Lee Valley Park on this lovely route. The walk passes the interesting historical sites of Waltham Abbey Church and the Royal Gunpowder Mills before a visit to the delightful River Lee Country Park with its canal side trails. The walk starts at Waltham Abbey Church where you can explore the remains of the abbey. The present church dates mainly from the early 12th century and is an example of Norman architecture. The walk heads north from the church along the pretty Cornmill Stream. The slow-moving stream and Old River Lea form a freshwater habitat with one of the most diverse invertebrate fauna in Essex. Eighteen species of dragonflies and damselflies have been recorded including the uncommon and nationally declining white-legged damselfly. Look out for a variety of birdlife in this area too. Just to the west of the stream you will find the Royal Gunpowder Mills. Set in 175 acres (0.71 km2) of parkland the site consists of 21 buildings of major historical importance with interesting exhibitions and interactive displays. The walk continues north towards Holyfield, passing attractive woodland areas before entering the River Lee Country Park. The lovely 1000 acre park has a series of footpaths and cycle trails running between the numerous lakes and watercourses. It's great for wildlife watching with lots of different water loving birds to look out for. Keep your eyes peeled for Bittern, Smew, Water Rail and Shoveler on the lakes or in the reedbeds. The walk picks up a section of the Lea Valley Walk, heading south through the centre of the park along the River Lea. Around Holdbrook you turn east to return to Waltham Abbey. If you would like to extend your walk you could continue south along the Lea Valley Walk and visit the Walthamstow Reservoirs and the wildlife rich Tottenham Marshes nature reserve. The London Loop passes just to the south of Waltham Abbey. You could pick this up and head west to visit Whitewebbs Park which has some nice woodland trails to try. The Pilgrimage Way long distance cycling and walking trail also starts in the town.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The circular Theydon Bois Oak Trail can be picked up on the eastern side of the nearby Epping Forest at Theydon Bois underground station. The challenging trail visits Ambresbury Banks Iron Age Fort and a Deer Sanctuary near the village. For more walking ideas in the area see the Essex Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tUDSActOS8w",
  "postcode": "EN9 1DT",
  "district": "Epping Forest",
  "county": "Essex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Waltham Abbey gateway bridge, Waltham Abbey, Epping Forest, Essex, England, EN9 1DT, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "canal"
  ],
  "points_of_interest": [
    "historical sites",
    "wildlife watching",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "footpaths",
    "cycle trails"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}