{
  "created_at": "2025-01-06T00:39:09.620728+00:00",
  "objectID": "85131ac629d9652f2fd18a0f2c427901",
  "ref": "portpatrick-to-dunskey-castle-walk",
  "title": "Portpatrick To Dunskey Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Yacht%2C_Portpatrick_-_geograph.org.uk_-_6227229.jpg/512px-Yacht%2C_Portpatrick_-_geograph.org.uk_-_6227229.jpg?20240131003045",
  "nearby": [
    {
      "description": "Southern Upland Way",
      "objectID": "d6cd1ceadfa9a4d01878922009d6b35c",
      "ref": "southern-upland-way-walking-route"
    },
    {
      "description": "Dunskey Glen",
      "objectID": "a3c170c91fd97b336c21502383c49443",
      "ref": "dunskey-glen-walk"
    },
    {
      "description": "Portpatrick Railway Walk",
      "objectID": "c004e1b7851bf017fe1abe8388e09b1b",
      "ref": "portpatrick-railway-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/85131ac629d9652f2fd18a0f2c427901.gpx",
  "_geoloc": {
    "lat": 54.8403462034,
    "lng": -5.1173078701
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Yacht%2C_Portpatrick_-_geograph.org.uk_-_6227229.jpg/512px-Yacht%2C_Portpatrick_-_geograph.org.uk_-_6227229.jpg?20240131003045",
      "title": "Yacht, Portpatrick by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Yacht, Portpatrick. The village has a number of pretty pastel-coloured houses set around a picturesque bay. Portpatrick was originally founded around its fishing industry. The village's harbour, a charming crescent-shaped sandy inlet, has always been the focal point of activity, originally supporting a thriving fishing community. From the 17th century, Portpatrick also served as the principal port for goods and mail traffic to Ireland. However, the location's exposure to strong winds and unpredictable weather across the North Channel often made the port impractical for reliable maritime operations. Despite its logistical challenges, the village retained its importance for fishing and has since evolved into a popular tourist destination, known for its picturesque harbour, quaint architecture, and scenic views of the Irish Sea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Dunskey_Castle_-_geograph.org.uk_-_5546869.jpg/512px-Dunskey_Castle_-_geograph.org.uk_-_5546869.jpg?20231016003613",
      "title": "Dunskey Castle by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dunskey Castle is dramatically perched on a rocky promontory overlooking the Irish Sea. Built in the mid-16th century by the Adairs of Kinhilt, the same family associated with the Castle of St John in Stranraer, Dunskey served as a coastal fortress, offering strategic views and defence against seaborne threats. The original structure was a tower house, with a long wing added to its northern side in the 1620s. The castle fell into ruin by around 1700, and its imposing presence today is a result of centuries of exposure to the elements. The site's defensive capabilities were enhanced by a landward ditch, which marks the remains of an earlier Adair castle from the 14th century, destroyed around 1500 by the McCullochs of Myrton and Cardoness."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Cliff_Top_Footpath_to_Dunskey_Castle_-_geograph.org.uk_-_3995025.jpg/512px-Cliff_Top_Footpath_to_Dunskey_Castle_-_geograph.org.uk_-_3995025.jpg?20221114132738",
      "title": "Cliff Top Footpath to Dunskey Castle by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cliff Top Footpath to Dunskey Castle. While now in ruins, Dunskey Castle offers a picturesque and dramatic setting, often attracting photographers and hikers who visit the Rhins of Galloway. The castle’s remote and windswept location adds to its appeal, offering both a glimpse into Scotland's feudal past and a beautiful example of the rugged coastline. Its history, linked to conflicts between regional families and its abandonment, reflects the changing tides of power in medieval Scotland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Cliff_Top_Path_to_Portpatrick_-_geograph.org.uk_-_3994957.jpg/512px-Cliff_Top_Path_to_Portpatrick_-_geograph.org.uk_-_3994957.jpg?20221114131014",
      "title": "Cliff Top Path to Portpatrick by Billy McCrorie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path to Dunskey Castle from Portpatrick"
    }
  ],
  "distance_km": 2.0,
  "description": "This walk takes you along the coastal path from the village of Portpatrick to the ruins of Dunskey Castle in Dumfries and Galloway. The ancient castle is located just to the south east of the village on the Rhins of Galloway. From the cliff top path there are fine views of the Northern Irish coast just 21 miles to the west. You can start the walk from the public parking area at the pretty harbour in Portpatrick. From here it's just over a half mile walk to the castle so it should take around 15-20 minutes. The village is the start point for the Southern Upland Way long distance footpath. You could follow it north to visit the delightful Dunskey Glen to extend your walking in the region.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In nearby Glenluce you can pick up the Portpatrick Railway Walk along a section of the old Portpatrick and Wigtownshire Railway. The railway has an interesting history and there's also a visit to the impressive Luce Viaduct on the walk."
    }
  ],
  "video_url": "https://www.youtube.com/embed/N1gH2h9TPz0?si=etbiNGnWPGlPjT7b",
  "district": "Portpatrick",
  "county": "Dumfries and Galloway",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "South Crescent, Portpatrick, Dumfries and Galloway, Alba / Scotland, DG9 8LE, United Kingdom",
  "postcode": "DG9 8LE",
  "state": "Alba / Scotland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}