{
  "created_at": "2025-01-06T01:10:21.860062+00:00",
  "objectID": "8558bfd3d7d039f4c198709eba2f4ca8",
  "ref": "leigh-walking-route",
  "title": "Walks in Leigh Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Flickr_-_ronsaunders47_-_Canal_to_oneself..jpg/512px-Flickr_-_ronsaunders47_-_Canal_to_oneself..jpg",
  "nearby": [
    {
      "description": "Pennington Flash Country Park",
      "objectID": "c78c40f082ddebe5681bd60c43449f19",
      "ref": "pennington-flash-country-park-walking-and-cycle-route"
    },
    {
      "description": "Glazebrook Trail",
      "objectID": "104790e470bdce94410b4dcfbb288ff5",
      "ref": "glazebrook-trail-walking-route"
    },
    {
      "description": "Leeds and Liverpool Canal",
      "objectID": "fa6cd622bb8bb404353c325eb4d48350",
      "ref": "leeds-and-liverpool-canal-walking-and-cycle-route"
    },
    {
      "description": "Worsley Canal Walk",
      "objectID": "e1830713091adbdc1ad92eee26ae5791",
      "ref": "worsley-canal-walk-walking-route"
    },
    {
      "description": "Wigan Canal Walk",
      "objectID": "ace9000d7b9c9ae6c581307ebb536388",
      "ref": "wigan-canal-walk-walking-route"
    },
    {
      "description": "Wigan Flashes",
      "objectID": "2a81b589774aaf8bffc3a93b04e4f101",
      "ref": "wigan-flashes-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8558bfd3d7d039f4c198709eba2f4ca8.gpx",
  "_geoloc": {
    "lat": 53.4928076192,
    "lng": -2.5104728027
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Flickr_-_ronsaunders47_-_Canal_to_oneself..jpg/512px-Flickr_-_ronsaunders47_-_Canal_to_oneself..jpg",
      "title": "Ronald Saunders from Warrington, UK, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Canal at Leigh"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Pennington_Flash_-_geograph.org.uk_-_534372.jpg",
      "title": "Graham Horn / Pennington Flash",
      "caption": "A view of Pennington Flash lake in the country park. Sunken land due to colliery subsidence has led to many lakes known locally as flashes. This is the largest, Pennington Flash, now an important nature reserve with many different species of birds to be seen. The canal runs along an embankment above the surrounding land, the banks having been raised at various times to cope with the sinking land around."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/The_way_into_Leigh_by_canal_-_geograph.org.uk_-_1500533.jpg",
      "title": "Alan Murray-Rust / The way into Leigh by canal",
      "caption": "The way into Leigh by canal Brooklands Mill on the left, with the engine house identifiable from its tall windows; Mather Lane Mill straight ahead. Taken from the former Thomas Clayton (Oldbury) Ltd oil tanker 'Spey'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Leigh_Spinners%2C_Leigh_-_geograph.org.uk_-_732621.jpg",
      "title": "Chris Allen / Leigh Spinners, Leigh",
      "caption": "Leigh Spinners, Leigh Tufted carpet manufacturers. Two mills with a common boiler house and chimney. No. 2 closest to the camers houses a disused cross compound mill engine - the biggest of its type to survive. Is listed and attempts to remove it were foiled with the support of the International Stationary Steam Engine Society."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Mills_in_Leigh%2C_1974_-_geograph.org.uk_-_1766215.jpg/512px-Mills_in_Leigh%2C_1974_-_geograph.org.uk_-_1766215.jpg",
      "title": "Chris Denny / Mills in Leigh, 1974",
      "caption": "Mills in Leigh, 1974. Taken from slightly raised land (old mine waste) at the end of Wash Lane and looking across relatively new housing between Wash Lane and Holden Road towards two of the giant mills which used to characterise Leigh. From left to right they were Bedford Mill and Mill Lane Mill. In between were Mather Lane Mills, one of which is still standing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Butts_Mill%2C_Leigh_-_geograph.org.uk_-_748415.jpg",
      "title": "Chris Allen / Butts Mill, Leigh",
      "caption": "Butts Mill, Leigh Over the fence view of the ornate engine house and very plain boiler house. The low section of mill in the foreground would have been the cotton preparation section. Built 1907 with a nominal capital of £100k. Mule spinning with 150,000 spindles on mules by Dobson & Barlow. Engine was a Carels of Ghent and of adequate size for a double mill. the floors are reinforced concrete rather than earlier brick jack arches. Reference is Roger Holden (1998) - Stott and Sons, Architects of the Lancashire Cotton Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Leigh%2C_Obelisk_and_Boar%27s_Head_-_geograph.org.uk_-_806241.jpg/256px-Leigh%2C_Obelisk_and_Boar%27s_Head_-_geograph.org.uk_-_806241.jpg",
      "title": "SMJ / Leigh, Obelisk and Boar's Head",
      "caption": "Leigh town centre, Obelisk and Boar's Head. The obelisk is a listed structure. The Boar's Head is one of many fine red brick buildings in Leigh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Looking_towards_Market_St_-_geograph.org.uk_-_842323.jpg/256px-Looking_towards_Market_St_-_geograph.org.uk_-_842323.jpg",
      "title": "SMJ / Looking towards Market St",
      "caption": "Looking towards Market St in Leigh town centre. The black and white building is one of Leigh's oldest, it is the George & Dragon on King St."
    }
  ],
  "distance_km": 9.6,
  "description": "This town in Greater Manchester has some nice canalside walks and a fine local country park and nature reserve to explore on foot. In the historic town centre there's also some interesting Edwardian and Victorian terraced housing and several listed mills to see. This route from the town uses part of the Glazebrook Trail and the Leeds and Liverpool Canal to create a circular walk around the town. On the way you'll visit the lovely Pennington Flash Country Park where there are good wildlife spotting opportunities. You'll also pass a number of historic mills which made the town a major player in the cotton and silk industries. The walk starts on the canal in the town centre and follows the towpath west towards the country park. Here you can pick up the Glazebrook Trail and follow the waymarked trail east along the course of the River Glaze, passing Lately Common on the way. The route then turns north through Hooten Gardens to return to the canal where it meets the Bedford Brook. You then head west along the canal to return to the start point.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head east you can pick up the Worsley Canal Walk and enjoy a stroll along the Bridgewater Canal. You could then enjoy some peaceful woodland trails in Worsley Woods. If you follow the Leeds and Liverpool Canal north west you could head towards Wigan and pick up the Wigan Canal Walk. Here you can visit the Wigan Flashes Nature Reserve where there's an abundance of water loving wildlife to see. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/yek6jPfLf20",
  "postcode": "WN7 2PW",
  "district": "Leigh",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}