{
  "created_at": "2025-01-06T04:23:56.900661+00:00",
  "objectID": "85d8c0f6f69467335581fd56ffc956aa",
  "ref": "minions-cheesewring-walking-route",
  "title": "Minions Cheesewring Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Standing_stones_in_the_central_Hurlers_stone_circle_-_geograph.org.uk_-_525755.jpg/256px-Standing_stones_in_the_central_Hurlers_stone_circle_-_geograph.org.uk_-_525755.jpg",
  "nearby": [
    {
      "description": "Copper Trail",
      "objectID": "392710c05a6a23e71cefc13e668a8ef2",
      "ref": "copper-trail-walking-route"
    },
    {
      "description": "Siblyback Lake",
      "objectID": "9af33f2cdf6456fdae15c3d386e6e7ee",
      "ref": "siblyback-lake-walking-and-cycle-route"
    },
    {
      "description": "Golitha Falls",
      "objectID": "8fafffa6c22d7225549e4510c1dcc105",
      "ref": "golitha-falls-walking-route"
    },
    {
      "description": "Colliford Lake",
      "objectID": "3a8792071d140959a2a2cd83a2c8bd62",
      "ref": "colliford-lake-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/85d8c0f6f69467335581fd56ffc956aa.gpx",
  "_geoloc": {
    "lat": 50.51375677,
    "lng": -4.4556802153
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Standing_stones_in_the_central_Hurlers_stone_circle_-_geograph.org.uk_-_525755.jpg/256px-Standing_stones_in_the_central_Hurlers_stone_circle_-_geograph.org.uk_-_525755.jpg",
      "title": "Jim Champion / Standing stones in the central Hurlers stone circle",
      "caption": "Standing stones in the central Hurlers stone circle. There are the partially restored remains of three stone circles - collectively called \"The Hurlers\" - near Minions. These standing stones are on the south side of the central circle. Little remains of the south circle. The stone on the right has been set in a concrete base. The engine house in the distance is now the Minions \"heritage centre\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/The_Cheesewring_-_geograph.org.uk_-_1363008.jpg",
      "title": "Trevor Rickard / The Cheesewring",
      "caption": "The Cheesewring. Looking north to the Cheesewring, which got its name because of the resemblance to a pile of round cheeses. Cheesewring Quarry face is just below. This is a classic granite tor, with the rock piles being naturally created by repeated freezing and thawing of the water-filled weaker joints in the rock layers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/View_from_Daniel_Gumb%27s_Cave%2C_Craddock_Moor_-_geograph.org.uk_-_526241.jpg/256px-View_from_Daniel_Gumb%27s_Cave%2C_Craddock_Moor_-_geograph.org.uk_-_526241.jpg",
      "title": "Jim Champion / View from Daniel Gumb's Cave, Craddock Moor",
      "caption": "View from Daniel Gumb's Cave, Craddock Moor. Looking out from Daniel Gumb's cave, next to the Cheesewring quarry. The loose granite in the foreground, referred to as 'moorstone', was once sufficient for local building purposes but as demand grew (for quality and quantity) the rock was extracted from places like Cheesewring quarry. In the distance is the hill between Stowe's Hill and the village of Minions - the Rillaton Barrow is just out of sight over the crest of the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/The_Pipers_-_standing_stones_near_the_Hurlers_-_geograph.org.uk_-_525811.jpg/256px-The_Pipers_-_standing_stones_near_the_Hurlers_-_geograph.org.uk_-_525811.jpg",
      "title": "Jim Champion / The Pipers - standing stones near the Hurlers",
      "caption": "The Pipers - standing stones near the Hurlers. This is a pair of standing stones, not far to the west of the Hurlers stone circles on Craddock Moor. The name of this pair of stones is associated with the usual petrification folklore relating to stone circles - these are a pair of pipers turned to stone for playing on the Sabbath, presumably accompanying the Hurlers in their game of hurling. Looking to the north, directly between the stones, you see Stowe's Hill - site of a neolithic enclosure and the natural rock formation of the Cheesewring. The right hand side of the hill is scarred by the Cheesewring granite quarry. The dung in the foreground was left by one of the ponies that graze the open moorland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Cheesewring_Quarry_-_geograph.org.uk_-_523020.jpg",
      "title": "Tony Atkin / Cheesewring Quarry",
      "caption": "Cheesewring Quarry. For centuries local people have been picking granite blocks from the surface of the moor and shaping them for use locally as building stone for walls, gateposts or just about anything, but better building stone is to be found deeper in the granite. Here on Stowe's Hill was an ideal place to find good quality granite and the building of the mineral railway provided a means to get the stone out. This quarry provided the stone for many building projects including the Albert Memorial and Tower Bridge in London. The quarry closed before it could threaten the Cheesewring itself, seen here just above the quarry face."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/The_Cheesewring_overlooking_Craddock_Moor_-_geograph.org.uk_-_525789.jpg/256px-The_Cheesewring_overlooking_Craddock_Moor_-_geograph.org.uk_-_525789.jpg",
      "title": "Jim Champion / The Cheesewring overlooking Craddock Moor",
      "caption": "The Cheesewring overlooking Craddock Moor. The famous pile of granite known as the Cheesewring sits on the south-western slope of Stowe's Hill, next to the quarry. Beyond is Craddock Moor, a lofty expanse of moor long exploited by people for grazing, minerals and stone. The name derives from the resemblance of the piled slabs to a \"cheesewring\", a press-like device that was once used to make cheese"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Cream_Teas_at_Minions_-_geograph.org.uk_-_522314.jpg",
      "title": "Tony Atkin / Cream Teas at Minions",
      "caption": "Cream Teas at Minions. At the heart of the hamlet of Minions are three establishments all willing and eager to sell you food. Here is one of them. Walking on Bodmin Moor is hungry work."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/Miners_Cottages_in_Minions_-_geograph.org.uk_-_522402.jpg",
      "title": "Tony Atkin / Miners Cottages in Minions",
      "caption": "Miners Cottages in Minions. With the discovery of major copper lodes on the flanks of Caradon Hill and the establishment of mining along with granite quarrying and a railway in mid 19th century this remote moorland suddenly became an industrial boom area with shanty settlements springing up as workers moved into the area, mostly from west Cornwall. The village of Minions, originally known as \"Cheesewring Railway\" was one of the villages built as a more permanent replacement for temporary shacks. Photographed here is a row of workers cottages in the village."
    }
  ],
  "distance_km": 3.0,
  "description": "This circular walk visits the Cheesewring granite tor and the Hurlers stone circle from the Cornish village of Minions. Along the way there's fine views over the surrounding moorland scenery of Bodmin Moor. The dramatic scenery may also look familiar as it was featured in the TV programme Poldark. The walk starts from the The Hurlers Car Park car park at Minions, the highest village in the county. From here you can pick up footpaths heading up to the Pipers Stone Circle. They are thought to represent a pair of pipers turned to stone for playing on the Sabbath. Footpaths then head north to visit the Cheesewring Quarry where you'll find the Cheesewring stack. It's a striking geological formation, sitting atop Stowe's Hill and formed over many centuries by weathering. The route then heads south from the quarry to visit the Hurlers Stone Circle. Here you'll find three photogoenic late Neolithic or early Bronze Age stone circles arranged in a line, a grouping unique in England. Similar to the Pipers they were thought to be the remains of men petrified for playing the game of hurling on a Sunday. This area also includes the Minions Heritage Centre, housed in a disused engine house. Here you can learn all about the mining history of the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk you could enjoy refreshment at the aptly named Cheesewring Hotel. This 19th century freehouse is the highest pub in Cornwall at 303m above sea level. They do a fine Sunday roast and have a garden area to sit outside in. You can find them in the village at postcode PL14 5LE for your sat navs. If you fancy a cream tea then you could head across the street to the Minions Shop & Tearoom."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The moorland is a fine place for a dog walk and the village pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The long distance Copper Trail starts at the village. The epic circular walk takes you on a tour of several of the historic Cornish Copper mines. Head west of the village and you can enjoy some pleasant waterside walking along Siblyback Lake. There's a nice cycling and walking trail running around the lake where you can look out for a variety of wildlife. The popular Golitha Falls are just south of Siblyback. There's a lovely wooded trail and rushing falls in this splendid nature reserve. To the south you can explore the historic town of Liskeard, one of the oldest towns in Cornwall. Head east to nearby Callington and you could enjoy climbs to the ancient hill fort at Cadson Bury and the country park at Kit Hill. For more walking ideas in the area see the Bodmin Moor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/D9WW6jQ9tjE",
  "postcode": "PL14 5LP",
  "district": null,
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Hurlers Car Park, Grasmere Lane, Minions, Linkinhorne, Cornwall, England, PL14 5LP, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "moorland"
  ],
  "points_of_interest": [
    "stone circle",
    "geological formation",
    "heritage center"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}