{
  "created_at": "2025-01-06T11:18:09.015017+00:00",
  "objectID": "85dbee16fd8480e49b0eae9a2b532d2c",
  "ref": "lough-conn-walking-route",
  "title": "Lough Conn Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Lough_Conn_-_geograph.org.uk_-_806967.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/85dbee16fd8480e49b0eae9a2b532d2c.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Lough_Conn_-_geograph.org.uk_-_806967.jpg",
      "title": "Kay Atherton / Lough Conn",
      "caption": "Lough Conn, from the Pontoon Bridge which is the R318. It is not a pontoon, but maybe was so originally. With an area of about 48 square kilometres (19 sq mi), it is Ireland's seventh largest lake. With its immediate neighbour to the south, Lough Cullin, it is connected to the Atlantic Ocean by the River Moy. Lough Conn is noted for its trout and salmon fishing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Errew_Abbey_-_geograph.org.uk_-_2848358.jpg/512px-Errew_Abbey_-_geograph.org.uk_-_2848358.jpg",
      "title": "Errew Abbey by Robin Mais, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Errew Abbey 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Errew_Abbey_0012.jpg/512px-Errew_Abbey_0012.jpg",
      "title": "Elisa.rolle, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Errew Abbey 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Lough_conn.jpg",
      "title": "Liz McCabe, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lough Conn with Nephin in background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Lough_Conn_and_Rinakillen_-_geograph.org.uk_-_486851.jpg",
      "title": "Liz McCabe / Lough Conn and Rinakillen",
      "caption": "Lough Conn and Rinakillen from viewpoint near Knockmore (Nephin in background)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/The_Foxford_Way_above_Attiappleton%2C_looking_north_to_Lough_Conn_-_geograph.org.uk_-_486717.jpg",
      "title": "Liz McCabe / The Foxford Way above Attiappleton, looking north to Lough Conn",
      "caption": "The Foxford Way above Attiappleton, looking north to Lough Conn. The long-distance path drops down from the hills to the lakeside lowlands"
    }
  ],
  "distance_km": 1.0,
  "description": "This walk visits the historic Errew Abbey on Lough Conn in County Mayo. The ancient abbey is located in a fine spot on a peninsula stretching into Lough Conn. There is a footpath at the end of a country lane on the western side of the lake that will take you to the remote spot. It's a photogenic area with the lough and its islands making a fine backdrop to the abbey ruins. There are also views across the water to Nephin, the highest standalone mountain in Ireland and the second-highest peak in Connacht. To continue your walking in the area head east to try the circular walk around the pretty Lough Talt .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Historical Detail of the Abbey:Tigernan of Errew is reputed to have established a monastery here in the early 6th century, initially known as \"Mainistir Taobh Thiar do Shruth,\" meaning \"the abbey on the west side of the stream.\" It's believed that up to 1,400 students from across Europe studied at this monastery. In the 12th or 13th century, the Barretts refounded the monastery. Thomas Barrett, the Bishop of Elphin, was interred here in 1404. Then, in 1413, the Barretts established an abbey for the Augustinian Canons, dedicating it to the Virgin Mary, likely utilising the existing buildings from the earlier foundation. This establishment was probably more of a priory cell under the dependency of Crossmolina Abbey rather than a standalone abbey. A significant incident in 1413 involved McWattin Barrett breaching the sanctuary of Errew to apprehend Henry Barrett, who had sought asylum there. Legend has it that Saint Tigernan manifested to McWattin nightly until he vowed to rectify his actions, eventually granting the abbey an éraic (reparation) of about 120 acres of land at Ballinbraher, also known as Friarstown. The O'Flynn family, as erenachs (lay stewards) of the lands at Errew, came into possession of Mias Tighernain, a paten believed to have belonged to Tigernan. Errew Abbey was eventually dissolved in 1585. Today, remains include a long rectangular church, measuring approximately 27 by 7 meters, which still features some trefoil-headed windows, two sedilia (seats for clergy), and a piscina (basin). The east side of the cloister, distinct for not having the typical open arcade, is relatively well-preserved. To the east you can continue your waterside walking around the lovely Lough Easkey in the Ox Mountains. There's a fine 6km waymarked loop to follow around the lake here."
    }
  ],
  "gazetteer_found": false
}