{
  "created_at": "2025-01-06T00:17:21.187802+00:00",
  "objectID": "85e84886864100854d07aeaac4e16f73",
  "ref": "hagworthingham-walking-route",
  "title": "Hagworthingham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Stockwith_Mill%2C_Hagworthingham_-_geograph.org.uk_-_578458.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/85e84886864100854d07aeaac4e16f73.gpx",
  "_geoloc": {
    "lat": 53.2048374477,
    "lng": 0.0116308517
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Stockwith_Mill%2C_Hagworthingham_-_geograph.org.uk_-_578458.jpg",
      "title": "Dave Hitchborne / Stockwith Mill, Hagworthingham",
      "caption": "Stockwith Mill, Hagworthingham. Left to right - Mill, Tearoom and Crafts Shop, all in the heart of Tennyson Country."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Hagworthingham_-_Holy_Trinity_-_geograph.org.uk_-_104808.jpg",
      "title": "Dave Hitchborne / Hagworthingham - Holy Trinity",
      "caption": "Hagworthingham - Holy Trinity. The tower of the church collapsed in 1972 and the bells were sold on to Welbourn Church. Extensively restored by James Fowler in 1850, the church is much smaller than the original and is lacking the clerestory which fell into ruins around 1349. In 1972 the tower collapsed and was not replaced."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Entering_Snipe_Dales_Nature_Reserve_from_Country_Park_-_geograph.org.uk_-_1938376.jpg",
      "title": "Entering Snipe Dales Nature Reserve from Country Park by Alan Heardman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Entering Snipe Dales Nature Reserve from Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Water_Lane_Ford_-_geograph.org.uk_-_817391.jpg",
      "title": "Richard Croft / Water Lane Ford",
      "caption": "Water Lane Ford. Ford and footbridge on Water Lane near Hagworthingham, the stream goes on to become the River Lymn"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Winceby_battlefield_-_geograph.org.uk_-_1224739.jpg",
      "title": "Richard Croft / Winceby battlefield",
      "caption": "Winceby battlefield. Around noon on 11th October 1643, Royalist cavalry led by Sir John Henderson and Sir William Saville, supported by infantry, on their way from Lincoln to relieve the besieged garrison at Bolingbroke Castle, were engaged by a Parliamentarian force led by Oliver Cromwell and Sir Thomas Fairfax. The Roundheads of 1,850 dragoons were already drawn up on the higher ground to the right and were greatly outnumbered by the Royalist force of 3,700 horse and 5,000 foot soldiers. Cromwell led the charge and was almost captured by Sir Ingram Hopton when his horse was shot from under him, though he mounted a trooper's horse and re-joined the fray. Within half an hour Savilles Royalist cavalry gave way and fell back on their own infantry in chaos and confusion, pursued by the Roundhead cavalry. In the ensuing rout, men were cut to pieces in what was to become known as Slash Lane and Slash Hollow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Slash_Lane_-_geograph.org.uk_-_1224227.jpg",
      "title": "Richard Croft / Slash Lane",
      "caption": "Slash Lane. A scene of carnage on 11th October 1643 when Parliamentarian troops led by Oliver Cromwell and Sir Thomas Fairfax routed the Royalist force who fled towards Slash Hollow in the defeat of The Battle of Winceby. About 1,000 Royalist troops died as they were slashed as they fled ..... remembered in the names of 'Slash Hollow' and 'Slash Lane'. Roundhead losses were one officer and 19 men killed, the Royalist losses were over 1,000 killed and as many captured, Bolingbroke Castle surrendered and all of Lincolnshire fell to Parliament. Short, sharp, decisive was the fray On Winceby field that fateful day"
    }
  ],
  "distance_km": 8.0,
  "description": "This small Lincolnshire village is located in the East Lindsey district near Horncastle. There's some lovey Lincolnshire Wolds countryside, a fine local country park and a significant battlefield site to visit nearby. This walk from the village visits Snipe Dales Country Park and the neighbouring village of Winceby. You can follow footpaths south west to Snipe Dales where you'll find a series of footpaths taking you around the peaceful woodland and picturesque streams. It's also classed as a nature reserve so keep your eyes peeled for a variety of wildlife in this area. Continue south west and you will soon come to Winceby village. Here you can pay a visit to the site of Winceby battle which took place during the civil war in 1643. See the photos belowed for more details on the history of this conflict. The walk can be extended by continuing south west to Hameringham.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The George and Dragon is a nice village pub serving good home cooked food. They also have a large garden area to relax in on warmer days. You can find them on the High Street at postcode PE23 4NA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country and woodland trails make for a fine dog walk. Please keep them on leads around Snipe Dales though. Dogs are not permitted on the red walk through the nature reserve area here. The George mentioned above is very dog friendly with water available."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Lincolnshire Walks page."
    }
  ],
  "district": "East Lindsey",
  "county": "Lincolnshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Lane, Mill Farm, Hagworthingham, East Lindsey, Lincolnshire, England, PE23 4LP, United Kingdom",
  "postcode": "PE23 4LP",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "streams"
  ],
  "points_of_interest": [
    "country park",
    "battlefield site",
    "nature reserve"
  ],
  "facilities": [
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}