{
  "created_at": "2025-01-06T02:45:36.431223+00:00",
  "objectID": "8658cc62581a7e49e82b6a0ab4e05b81",
  "ref": "largs-walking-route",
  "title": "Largs Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/61/Largs_Promenade_-_geograph.org.uk_-_3088201.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8658cc62581a7e49e82b6a0ab4e05b81.gpx",
  "_geoloc": {
    "lat": 55.7947684948,
    "lng": -4.8708038559
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Largs_Promenade_-_geograph.org.uk_-_3088201.jpg",
      "title": "Largs Promenade by Thomas Nugent, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Largs Promenade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/St_Columba%27s_Church_-_geograph.org.uk_-_944046.jpg",
      "title": "Thomas Nugent / St Columba's Church",
      "caption": "St Columba's Church. Viewed across Largs Bay from the spit at Noddsdale Water. The ever popular Largs bouncy castle is visibleon the promenade."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Castle_Hill_-_geograph.org.uk_-_2276031.jpg",
      "title": "Castle Hill by Lairich Rig, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Castle Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/SE_of_Largs_-_geograph.org.uk_-_18.jpg",
      "title": "Andy Stephenson / SE of Largs",
      "caption": "SE of Largs"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/The_Largs_Pencil%2C_Largs_-_geograph.org.uk_-_499100.jpg",
      "title": "Dave Hitchborne / The Largs Pencil, Largs",
      "caption": "The Largs Pencil. A monument to the Battle of Largs. The Pencil was built in 1912, as a marker for the site of the Battle of Largs in 1263, when the Scots defeated King Haco of Norway's troops on the shore at Largs, whose 160 long ships got caught in a storm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Marina%2C_Largs_-_geograph.org.uk_-_499146.jpg",
      "title": "Dave Hitchborne / Marina, Largs",
      "caption": "Marina, Largs"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/The_Paddle_Steamer_Waverley_at_Largs_-_geograph.org.uk_-_500082.jpg",
      "title": "Dave Hitchborne / The Paddle Steamer Waverley at Largs",
      "caption": "The Paddle Steamer Waverley at Largs. The Waverley, the last sea-going paddle steamer in the world, was built on the Clyde in 1947 to replace the original Waverley that sunk off Dunkirk in 1940. She was originally built to sail only between Craigendorran & Arrochar in West Scotland, but now sails around Britain offering regular trips on the Clyde, the Thames, the South Coast of England and the Bristol Channel, with other calls at various ports & piers throughout the UK."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Viking_Ship_Sculpture%2C_Largs_-_geograph.org.uk_-_499187.jpg",
      "title": "Dave Hitchborne / Viking Ship Sculpture, Largs",
      "caption": "Viking Ship Sculpture. This sculpture was inspired by the lines of a clinker built Viking longboat. The head and detailing pays homage to Nordic mythology and symbolism. It marks the site of the last Viking invasion of Scotland which took place in 1263. The subsequent Battle of Largs was a bloody one, with few survivors. This sculpture was commissioned in 1996 by the local marina and it is fixed to the breakwater of large rocks. Made of stainless steel, it was positioned so that waves can wash against it in rough weather. The sculptor was Giusseppe Lund - Sculptor & Architectural Metalsmith. Largs has a great pride in its Viking connections. There are festivals every summer and the Vikingar Centre has a dramatic presentation of the Gods and people."
    }
  ],
  "distance_km": 5.8,
  "description": "This popular seaside resort sits in a lovely spot on the North Ayrshire coast. As well as some fine coastal walking trails there's also some excellent local hill climbs to try. This walk in the town takes you to Castle Hill and Douglas Park where there's a fine viewpoint. The route then uses part of the Ayrshire Coastal Path to take you to the marina and at nearby Kelburnfoot. The walk starts at the pier on the sea front close to the tourist information centre. Follow the coast path south to Castle Bay and Cairnies Quay. You then head inland to climb to the pretty Douglas Park where there's a Victorian Garden and some seating. From here continue the ascent to Castle Hill where there are excellent views over the Firth of Clyde and Great Cumbrae island. After taking in the views descend back to the coast and then head south to visit the Pencil Monument. The photogenic monument is dedicated to the 13th century Battle of Largs. You then continue to Kelburnfoot where there's a marina with hundreds of boats to see. To continue your walking around Largs head north to climb to the ancient Iron Age Hillfort at Knock Hill .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you can pick up the popular Fairlie Glen Circular Walk. It's a delightful route with babbling streams, woodland trails, open glens, photogenic waterfalls and fine coastal views."
    }
  ],
  "video_url": "https://www.youtube.com/embed/6CwnMchLWGs",
  "district": "Largs",
  "county": "North Ayrshire",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}