{
  "created_at": "2025-01-06T01:16:47.444783+00:00",
  "objectID": "868acee010162c5fa010ee3e05ff772f",
  "ref": "caldon-canal-walking-route",
  "title": "Caldon Canal Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ec/The_start_of_the_Caldon_Canal_-_geograph.org.uk_-_315837.jpg",
  "nearby": [
    {
      "description": "Churnet Valley",
      "objectID": "3d8a5cf782157f4eb010e5f3fa52acfd",
      "ref": "churnet-valley-walking-route"
    },
    {
      "description": "Consall Nature Park",
      "objectID": "ffa55a3cafe0a1f669e7694e64c722ec",
      "ref": "consall-nature-park-walking-route"
    },
    {
      "description": "Deep Hayes Country Park",
      "objectID": "bc6a8e60be0d2e46120b8291123a9a33",
      "ref": "deep-hayes-country-park-walking-route"
    },
    {
      "description": "Staffordshire Way",
      "objectID": "0f4ae85e999427bc5e24f5738eb8e2d1",
      "ref": "staffordshire-way-walking-route"
    },
    {
      "description": "Ladderedge Country Park",
      "objectID": "79b428a6560d9c1b00b10e9ac7b1fcdb",
      "ref": "ladderedge-country-park-walking-route"
    },
    {
      "description": "Staffordshire Moorlands Walks",
      "objectID": "85f9a331b2ac88779618fdf001507b87",
      "ref": "staffordshire-moorlands-walks-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/868acee010162c5fa010ee3e05ff772f.gpx",
  "_geoloc": {
    "lat": 53.026525274,
    "lng": -1.9620882826
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/The_start_of_the_Caldon_Canal_-_geograph.org.uk_-_315837.jpg",
      "title": "Andy Beecroft / The start of the Caldon Canal, via Wikimedia Commons",
      "caption": "The start of the Caldon Canal. Just around the corner in this photograph, the canal (seen here) meets up with the main Trent and Mersey Canal in the middle of Stoke."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Leek_Branch%2C_Caldon_Canal_-_geograph.org.uk_-_317564.jpg",
      "title": "David Mastin / Leek Branch, Caldon Canal, via Wikimedia Commons",
      "caption": "Leek Branch, Caldon Canal. This was taken above the south west portal of the Leek tunnel looking south west towards the wide pool at the tunnel entrance. The brickwork of the tunnel entrance can be seen in the foreground"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/One_of_the_Cheddleton_Locks_on_the_Caldon_Canal_-_geograph.org.uk_-_316242.jpg",
      "title": "Andy Beecroft / One of the Cheddleton Locks on the Caldon Canal, via Wikimedia Commons",
      "caption": "One of the Cheddleton Locks on the canal. Taken from the stern of a narrowboat on the Froghall section of the Caldon Canal. For canal enthusiasts, you'll see that this lock is fitted with hydraulically operated paddles which are much easier and safer to use than the older gear, rack and pinion type."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Caldon_Canal_-_geograph.org.uk_-_943769.jpg",
      "title": "Tony Bacon / Caldon Canal, via Wikimedia Commons",
      "caption": "Canal Barge on the canal, with Churnet Valley Railway behind the wall, and the Black Lion pub in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Cheddleton_Flint_Mill_%28geograph_2836060%29.jpg",
      "title": "Ashley Dace / Cheddleton Flint Mill",
      "caption": "Cheddleton Flint Mill. The old mill dates from the period of the Industrial Revolution and is Grade II listed. The interesting site features two water mills, a small museum, a period cottage and many other exhibits."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Below_Hazelhurst_Locks_-_geograph.org.uk_-_61740.jpg",
      "title": "Andy Beecroft / Below Hazelhurst Locks",
      "caption": "A dog strolls along the towpath below Hazelhurst Locks"
    }
  ],
  "distance_km": 10.0,
  "description": "Follow the Caldon Canal through the beautiful River Churnet Valley on this easy walk in Staffordshire. The walk starts at the lovely Froghall Wharf where you will find a good sized car park. You then pick up the canal towpath and head to Cheddleton before finishing at Deep Hayes Country Park. Along the way you will pass some attractive woodland which is worth exploring with a small detour. For example the Consall Nature Park is located just to the west of the canal near Consall Forge. It has miles of nice walking trails and is easy to access from the route. Also of interest is the Churnet Valley Steam Railway which runs alongside the canal. One option would be to catch the train back from Cheddleton to Kingsley & Froghall Station. The canal runs along some of the prettiest countryside in Staffordshire with views of the River Churnet, pretty locks and arched stone bridges to enjoy. You'll also pass villages and hamlets such as the delightful Consall Forge where you can stop for refreshments at the canalside Black Lion Inn. There's great outdoor seating with views of the canal and the passing steam trains. The route follows the Staffordshire Way long distance trail so there is scope for continuing your walk towards Leek and Ladderedge Country Park. Deep Hayes Country Park at the end of the walk is also well worth exploring.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The popular Blue Mugge in Leek is a nice place to go for some refreshments. It's a well priced traditional pub with good food and a decent selection of beers. There's also a small outdoor area partly undercover. You can find the pub on 17 Osborne St with a postcode of ST13 6LJ for your sat navs. Also of interest in Leek is the noteworthy Roebuck. Steeped in character and charm this historic pub dates from 1626. It's dog friendly and has a lovely outdoor seating area for warmer days. You can find it at 18 Derby Street with postcode ST13 5AB. In Cheddleton there's the The Black Lion. The friendly pub is located in a nice spot near St Edward's church and the old Flint Mill. They serve good food and have two outdoor seatings areas for warmer days. You can find them at Hollow Lane, ST13 7HP."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just east of Cheddleton there's the delightful Coombes Valley RSPB Nature Reserve. There's some lovely trails here through oak woodland and along the pretty Coombes Brook which runs through the reserve. There's also bird hides where you can look out for a variety of different species. You could follow the waymarked Staffordshire Moorlands Walk east from the canal to visit the site. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Mxc-KhDGaSA",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Foxt Road Bridge, Ipstones, Froghall, Staffordshire Moorlands, Staffordshire, England, ST10 2HJ, United Kingdom",
  "postcode": "ST10 2HJ",
  "district": "Staffordshire Moorlands",
  "state": "England"
}