{
  "created_at": "2025-01-06T04:19:10.324335+00:00",
  "objectID": "87326631fb0a52509740b3bfcf9ee1fe",
  "ref": "bacton-woods-walking-and-cycle-route",
  "title": "Bacton Woods Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/On_the_edge_of_Bacton_Wood_-_geograph.org.uk_-_1051620.jpg/256px-On_the_edge_of_Bacton_Wood_-_geograph.org.uk_-_1051620.jpg",
  "nearby": [
    {
      "description": "Paston Way",
      "objectID": "82ae62dc23f6c8a73bda9a588d8812da",
      "ref": "paston-way-walking-route"
    },
    {
      "description": "Weaver Way",
      "objectID": "2d5209eab07018cb6622531208c1300e",
      "ref": "weaver-way-walking-route"
    },
    {
      "description": "North Walsham and Dilham Canal",
      "objectID": "62985357e8c2c1ecd8e8b9591442e931",
      "ref": "north-walsham-and-dilham-canal-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/87326631fb0a52509740b3bfcf9ee1fe.gpx",
  "_geoloc": {
    "lat": 52.8287579886,
    "lng": 1.439312159
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/On_the_edge_of_Bacton_Wood_-_geograph.org.uk_-_1051620.jpg/256px-On_the_edge_of_Bacton_Wood_-_geograph.org.uk_-_1051620.jpg",
      "title": "Evelyn Simak / On the edge of Bacton Wood",
      "caption": "On the edge of Bacton Wood. Here the public footpath turning off Mill Road in the hamlet of Edingthorpe Heath, further to the northwest, meets one of the many paths traversing Bacton Wood and Witton Heath, further to the south. Witton Heath seamlessly merges with Bacton Wood located further towards the north. Beeches grow on the southern edge beside North Walsham Road. The area of Bacton Woods (also known as Witton Woods) covers 113 hectares; the woodland is owned by the Forestry Commission and partly managed by North Norfolk District Council, who together form the Bacton Woods Countryside Partnership Project."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Autumn_in_Bacton_Wood_-_geograph.org.uk_-_1051725.jpg/256px-Autumn_in_Bacton_Wood_-_geograph.org.uk_-_1051725.jpg",
      "title": "Evelyn Simak / Autumn in Bacton Wood",
      "caption": "Autumn in Bacton Wood. The trees are getting bare and their fallen leaves are covering the surface of the tracks with a soft carpet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Bacton_Wood%2C_entrance_to_car_park_and_picnic_area_-_geograph.org.uk_-_526420.jpg",
      "title": "Evelyn Simak / Bacton Wood, entrance to car park and picnic area",
      "caption": "Bacton Wood, entrance to car park and picnic area"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_former_Bacton_Wood_Watermill_-_geograph.org.uk_-_646568.jpg",
      "title": "Evelyn Simak / The former Bacton Wood Watermill",
      "caption": "The former Bacton Wood Watermill - located just to the west of the woods. The last working mill was rebuilt in 1747. Extensive modification was carried out around 1825 due to an expected increase in trade, following the opening of the North Walsham & Dilham Canal in 1826. The North Walsham & Dilham Canal basically is the canalised River Ant, which was widened to accommodate Norfolk wherries that transported offal to two bone mills and took corn to Bacton Wood mill, with return loads consisting of flour. The canal ran from Smallburgh to Antingham and contained 6 locks. Originally of white rendered brick with a slate roof, the mill house had a Norfolk pantile roof, which in later years was changed to slate. The brick bridge spans a dry mill race; this is how it looks on the other side of the road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Bacton_Woods_-_geograph.org.uk_-_650259.jpg/256px-Bacton_Woods_-_geograph.org.uk_-_650259.jpg",
      "title": "Evelyn Simak / Bacton Woods",
      "caption": "The woods viewed on a bright winter day. The site consists of conifer plantations and mixed woodland, interspersed by open areas. The woodland is traversed by three marked walkways and by many smaller paths and cycle trails. There are over 30 species of trees, some native and some introduced. The northern part was originally an ancient broadleaf woodland but was planted with conifers after WWII. During more recent times these conifers are being thinned out and felled in order to create more biodiversity, and plants that are indicative of ancient woodland, such as bluebells, wood sorrel and dog's mercury, can again be found growing in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Sessile_oak_at_footpath_crossing_-_geograph.org.uk_-_650279.jpg",
      "title": "Evelyn Simak / Sessile oak at footpath crossing",
      "caption": "Sessile oak at footpath crossing. This ancient oak stands at a crossing of footpaths, one leading in northwesterly direction and connecting with Mill Road, the other branching off towards the car park located at the northeastern corner of the woods."
    }
  ],
  "distance_km": 5.5,
  "description": "Bacton Woods, near North Walsham, has several delightful walking and cycle paths running through the forest. This short circular route starts at Bacton car park and follows various paths through the wood, which has 30 species of tree, including Scots and Corsian Pine, Western Hemlock, Douglas Fir and Larch. The woods are also popular with mtb (mountain bikes) as there is an excellent single track ride to be found here. The Paston Way and Weaver Way both run through the area, so you could pick up these long distance trails to extend your walk. The North Walsham and Dilham Canal also runs past the western edge of the woods. There's a nice footpath along the towpath and through the Pigney's Wood Nature Reserve to try.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the west of the woods there's The Bluebell in North Walsham for some post exercise refreshment. They have a good menu and a lovely large garden area for warmer weather. You can find them at postcode NR28 0RA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As you'd expect the woodland trails are ideal for dog walking so expect to see other owners on your visit. The Bluebell pub mentioned above is dog friendly in the garden area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Gunton Park is a good place to continue your walking in the area. The park is located just a few miles north west of the woods and includes a huge deer park and a 19th century working sawmill. The picturesque thatched mill is notable as the only surviving water powered sawmill in Norfolk. The walk includes a visit to the excellent Gunton Arms pub where there are fine views over the estate. If you head east to the coast you the worthy village of Happisburgh. There's a lovely secluded beach, a striking 18th century lighthouse and a historic 15th century church to see here.  For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bpT97jUOUx4",
  "postcode": "NR28 9UE",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Plantation Road, Witton and Ridlington, North Norfolk, Norfolk, England, NR28 9UE, United Kingdom",
  "district": "North Norfolk",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland"
  ],
  "points_of_interest": [
    "nature reserve",
    "long distance trails"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}