{
  "created_at": "2025-01-06T02:18:24.651439+00:00",
  "objectID": "873ccc30c41d7a93728a43b79dec1af9",
  "ref": "wilverley-plain-walking-route",
  "title": "Wilverley Plain and Inclosure Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Former_road_near_Wilverley_Post_-_geograph.org.uk_-_269651.jpg",
  "nearby": [
    {
      "description": "Burley New Forest",
      "objectID": "b3aae8b6e3a6f3539158891dd2e87810",
      "ref": "burley-new-forest-walking-route"
    },
    {
      "description": "Blackwater Arboretum Trail",
      "objectID": "e5486df8d508cf9f7a51b2f5a438b74d",
      "ref": "blackwater-arboretum-trail-walking-route"
    },
    {
      "description": "Ober Water",
      "objectID": "f33d92d77a3eddb8eae568927488c7a4",
      "ref": "ober-water-walking-route"
    },
    {
      "description": "Knightwood Oak",
      "objectID": "2e7f813af716643f3cd00f37b0871424",
      "ref": "knightwood-oak-walking-route"
    },
    {
      "description": "Holmsley",
      "objectID": "558ef54a5ddbe6f7846f25ec42a77fd1",
      "ref": "holmsley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/873ccc30c41d7a93728a43b79dec1af9.gpx",
  "_geoloc": {
    "lat": 50.8087834673,
    "lng": -1.6417969167
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Former_road_near_Wilverley_Post_-_geograph.org.uk_-_269651.jpg",
      "title": "Phil Champion / former road near Wilverley Post",
      "caption": "View of the former road near Wilverley Post. The road which formerly ran along the north east side of Wilverley Inclosure has been stopped up and replaced by a route along the trackbed of the disused railway on the opposite side of the inclosure. For those who are into food for free, there are a number of sweet chestnut trees along the edge of the inclosure which produce particularly large fruit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Ponies_shading_on_Wilverley_Plain%2C_New_Forest_-_geograph.org.uk_-_191277.jpg",
      "title": "Jim Champion / Ponies shading on Wilverley Plain, New Forest",
      "caption": "Ponies shading on the Wilverley Plain. There are usually large numbers of ponies on Wilverley Plain - the area was ploughed and used for agriculture during the Second World War and was then reseeded with grass to \"improve the grazing\" for the Commoners' stock. The two adults are \"shading\" out the heat of the day, which strangely does not involve standing in the shade. They just stay very still (for some reason with one leg lifted), flicking their tails at the flies. In the distance are the pines of the Markway Inclosure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Scots_pine_tree_between_Wilverley_Plain_and_Holm_Hill%2C_New_Forest_-_geograph.org.uk_-_563548.jpg",
      "title": "Jim Champion / Scots pine tree between Wilverley Plain and Holm Hill, New Forest",
      "caption": "Scots pine tree between Wilverley Plain and Holm Hill. One of only a few trees on this ridge of dry heath between Wilverley Plain and Holm Hill. The path to the right leads to Holm Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Edge_of_Wilverley_Inclosure%2C_New_Forest_-_geograph.org.uk_-_24959.jpg",
      "title": "Jim Champion / Edge of Wilverley Inclosure, New Forest",
      "caption": "Edge of Wilverley Inclosure. Looking southeast along the edge of the enclosure where it meets the Plain. The road to Burley used to run along the edge of the inclosure, but now it is diverted along the old railway line and it remains here as a pony cart track (for tourists) and footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Small_pond_on_Wilverley_Plain%2C_New_Forest_-_geograph.org.uk_-_191281.jpg",
      "title": "Jim Champion / Small pond on Wilverley Plain, New Forest",
      "caption": "Small pond on Wilverley Plain. In the foreground is a small pond on the Plain, presumably dug as somewhere for the commoners' stock to drink, although during these dry times it looks a bit shallow and muddy. This pond in on the eastern edge of the re-seeded area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/View_towards_Holmhill_Bog_from_the_edge_of_Wilverley_Plain%2C_New_Forest_-_geograph.org.uk_-_375071.jpg",
      "title": "Jim Champion / View towards Holmhill Bog from the edge of Wilverley Plain, New Forest",
      "caption": "View towards Holmhill Bog from the edge of the Plain. The puddles in the foreground are on a well-worn path from the northeast corner of Wilverley Plain towards Holm Hill (on the far left). The valley in the distance contains Holmhill Bog."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Victorian_cast_iron_history_of_Wilverley_Inclosure_-_geograph.org.uk_-_182238.jpg/512px-Victorian_cast_iron_history_of_Wilverley_Inclosure_-_geograph.org.uk_-_182238.jpg",
      "title": "Peter Facey / Victorian cast iron history of Wilverley Inclosure",
      "caption": "Victorian cast iron history of Wilverley Inclosure. Reads : \"Containing 500 Acres, enclosed 1775 and 1809."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Woodland_path_in_Wilverley_Inclosure_-_geograph.org.uk_-_182234.jpg",
      "title": "Peter Facey / Woodland path in Wilverley Inclosure",
      "caption": "A Woodland path in the Wilverley Inclosure. Conifer can be seen on the right and Chestnut on the left."
    }
  ],
  "distance_km": 5.0,
  "description": "This circular walk visits Wilverley Plain and the Wilverley Inclosure in the New Forest. The walk starts from the large Wilverley Plain car park, a couple of miles from Sway. There's also a smaller parking area at Wilverley Inclosure. The plain is an expansive grassy area which is great for picnics or playing games. You'll also see ponies grazing there most of the time. The walk then heads west to explore the adjacent Wilverley Inclosure which is great for a peaceful stroll. Here you will find miles of good footpaths taking you through the conifer and broadleaved woodland. Look out for deer and other wildlife in this pretty area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Burley and you could visit the splendid Burley Manor. The main draw here is an outdoor area where you can enjoy views over the adjacent deer park. It's a great place to relax with afternoon tea after your exercise. They also do excellent Mediterranean food if you fancy something more substantial. The Manor building itself is noteworthy too, being Grade II listed and dating back to 1852. You can find them at 1 Ringwood Rd with a postcode of BH24 4BS for your sat navs. On the western side of the plain there's the delightful Old Station Tea Rooms. The cafe is set in the old railway Station House which was closed during the Beeching cuts in the 1960's. You can learn all about the history of the station which was originally opened in 1847. These days it's a delightful tea room where you can purchase a good range of meals and snacks. There's seating indoors or out if the weather is good. You can find them at Station Road with a postcode of BH24 4HY."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and plain are ideal for a dog walk and Burley Manor mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a couple of miles north and you can explore the Burley Inclosures on the Burley Walk. The village of the same name is located just to the west and has good facilities with pubs, shops and cycle hire. The popular Blackwater Arboretum Trail can also be picked up nearby. The trail is lined with majestic Douglas fir trees which are among the tallest and oldest trees in Britain. Just a mile or so north east you will find Ober Water where there are nice trails along the pretty stream and through the adjacent Rhinefield Walk. The famous Knightwood Oak is another highlight of the area. Here you will find the largest oak tree in the forest and a picnic area. Just to the west you'll find Holmsley Bog and Inclosure. There's more nice scenery here with a disused railway line that you can walk or cycle along. Just north west of the plain you could pick up the Bransgore Walk. This takes you across the Dur Hill Inclosure, the Kingston Great Common National Nature Reserve before climbing to the viewpoints at Vereley Hill and Picket Plain. To the south is the market town of New Milton where there's a train station and some pleasant waterside trails around the Ballard Water Meadows.  For more walking ideas in the area see the New Forest Walks and Hampshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/qEZjSz0xXHw",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Wilverley Plain, Burley Road, Brockenhurst, New Forest, Hampshire, England, BH25 5WA, United Kingdom",
  "postcode": "BH25 5WA",
  "district": "New Forest",
  "state": "England"
}