{
  "created_at": "2025-01-06T00:04:12.927829+00:00",
  "objectID": "87465cf07237d2185f9c72b1b861ebd3",
  "ref": "stover-country-park-walking-and-cycle-route",
  "title": "Stover Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3c/The_Lake%2C_Stover_Country_Park_-_geograph.org.uk_-_409249.jpg",
  "nearby": [
    {
      "description": "Stover Canal",
      "objectID": "60bd1f2dce91c4d9a07a4129b091ee06",
      "ref": "stover-canal-walking-route"
    },
    {
      "description": "Templer Way",
      "objectID": "640b68dab463d39f883605971fdb2ede",
      "ref": "templer-way-walking-route"
    },
    {
      "description": "Decoy Country Park",
      "objectID": "b42aed027d2a931cfe1b64f189f8ec0c",
      "ref": "decoy-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/87465cf07237d2185f9c72b1b861ebd3.gpx",
  "_geoloc": {
    "lat": 50.562390085,
    "lng": -3.6501137224
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/The_Lake%2C_Stover_Country_Park_-_geograph.org.uk_-_409249.jpg",
      "title": "Robin Lucas / The Lake, Stover Country Park",
      "caption": "Early morning view of the Lake in Winter"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Lake%2C_Stover_Country_Park_-_geograph.org.uk_-_940718.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Lake, Stover Country Park. Stover Lake, is artificial, founded by James Templer as a landscape feature when he took over the estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Carved_seat%2C_Stover_Country_Park_-_geograph.org.uk_-_1371793.jpg",
      "title": "David Smith / Carved seat, Stover Country Park",
      "caption": "Carved seat. Many of the wooden features in the park are incised with appropriate decoration."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Carving_of_cormorant%2C_Stover_Country_Park_-_geograph.org.uk_-_1371790.jpg/256px-Carving_of_cormorant%2C_Stover_Country_Park_-_geograph.org.uk_-_1371790.jpg",
      "title": "David Smith / Carving of cormorant, Stover Country Park",
      "caption": "Carving of cormorant. Close to this carving is Ted Hughes' poem about a cormorant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Seat_in_outdoor_classroom_at_Stover_Country_Park_-_geograph.org.uk_-_1371799.jpg",
      "title": "David Smith / Seat in outdoor classroom at Stover Country Park",
      "caption": "Seat in outdoor classroom at the park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Templer_Way%2C_Stover_Country_Park_-_geograph.org.uk_-_947775.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Sign for the Templer Way in the park. The Templer Way is a walk of 18 miles tracing the historic line of granite being taken from the quarries at Haytor to the docks at Teignmouth. The route gets its name from the Templer family. James Templer purchased the Stover Estate, near Newton Abbot, in 1765 after making his fortune at sea."
    }
  ],
  "distance_km": 3.0,
  "description": "Explore over 114 acres of woodland, heathland, grassland and lakes on this circular walk through the peaceful Stover Country Park, near Newton Abbot in Devon. The walk takes you around the delightful Stover Lake before following the canal outlet through the woodland. The park also includes the Ted Hughes Poetry Trail which takes in specially designed Poetry Posts each displaying a poem by Ted Hughes on a theme relating to wildlife of the natural world. The route below is designed for walkers but there is also a designated cycle route through the northern part of the Park. The Templer Way runs through the park so you could pick this up to continue your walk. Heading north would take you to Bovey Tracey while heading south would take you along the Stover Canal to Newton Abbot. Our Newton Abbot Walk starts from the town and takes you to the park on this route.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bell Inn in Bovey Tracey is a great option for some refreshments. The friendly, cosy pub has a good menu and a very fine garden area to relax in on warmer days. You can find it at Town Hall Place with postcode TQ13 9AA for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The excellent woodland and parkland trails make the park popular with dog walkers. You are asked to please keep them out of the lake and under close control. The Bell Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Stover Cycle Path also runs through the park. It runs from Newton Abbot to Bovey Tracey along a traffic free path which forms part of the National Cycle Network. Just to the north east you can pick up the circular Chudleigh Walk from the nearby town. This visits some of the highlights of the area including Chudleigh Rocks, Ugbrooke Park and the Castle Dyke Iron Age Hillfort. In Newton Abbot you could pay a visit to Decoy Country Park. There's a Wildlife Discovery Centre, Nature Reserve and a watersports centre next to the lake here. Near the park you can pick up the River Lemon Walk to Bickington. The pleasant riverside trail will take you pass the National Trust's Bradley Manor which you can find on the western side of Newton Abbot. The medieval limestone manor house has an interesting history and some pleasant trails through the adjacent Bradley Woods. For more walking ideas in the area see the Dartmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/PG5m4ZMpImc",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stover Park, Newton Road, Teigngrace, Heathfield, Teignbridge, Devon, England, TQ12 6PW, United Kingdom",
  "postcode": "TQ12 6PW",
  "district": "Teignbridge",
  "state": "England"
}