{
  "created_at": "2025-01-06T00:49:18.558510+00:00",
  "objectID": "8752182f29690fd1df755e404b4985ba",
  "ref": "christchurch-harbour-walking-route",
  "title": "Christchurch Harbour Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Reed_beds_in_Wick_Hams%2C_part_of_Christchurch_Harbour_%28geograph_5667842%29.jpg/512px-Reed_beds_in_Wick_Hams%2C_part_of_Christchurch_Harbour_%28geograph_5667842%29.jpg",
  "nearby": [
    {
      "description": "Hengistbury Head",
      "objectID": "2c6884b809e93651240c9e055ca1135c",
      "ref": "hengistbury-head-walking-route"
    },
    {
      "description": "Stanpit Marsh",
      "objectID": "25e329625a3096c098ae6ac2e0fd8249",
      "ref": "stanpit-marsh-walking-route"
    },
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "Avon Valley Path",
      "objectID": "61555704a9a0b0749fd1fc084e491f41",
      "ref": "avon-valley-path-walking-route"
    },
    {
      "description": "St Catherine's Hill Christchurch",
      "objectID": "189750d0939f57eefcc3293e14f07244",
      "ref": "st-catherines-hill-christchurch-walking-route"
    },
    {
      "description": "Mudeford",
      "objectID": "977766c6e8c51ea96346746fa6078074",
      "ref": "mudeford-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8752182f29690fd1df755e404b4985ba.gpx",
  "_geoloc": {
    "lat": 50.73208207,
    "lng": -1.77542924
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Reed_beds_in_Wick_Hams%2C_part_of_Christchurch_Harbour_%28geograph_5667842%29.jpg/512px-Reed_beds_in_Wick_Hams%2C_part_of_Christchurch_Harbour_%28geograph_5667842%29.jpg",
      "title": "David Smith / Reed beds in Wick Hams, part of Christchurch Harbour",
      "caption": "Reed beds in Wick Hams, part of Christchurch Harbour. The priory can be seen in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Christchurch_Harbour_-_geograph.org.uk_-_1048293.jpg",
      "title": "Nigel Mykura / Christchurch Harbour",
      "caption": "Most of this square is the harbour itself, but a small piece of land on the southern edge of the harbour is just inside the square. This bench is dedicated to the memory of Colin Steers."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Christchurch_Harbour_-_geograph.org.uk_-_493686.jpg",
      "title": "Mike Smith / Christchurch Harbour",
      "caption": "Looking east from the tip of Stanpit Marshes. The crescent-shaped sand bar in the middle distance is exposed at every low tide, and is named Blackberry Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Yacht_leaving_Christchurch_Harbour_-_geograph.org.uk_-_493691.jpg",
      "title": "Mike Smith / Yacht leaving Christchurch Harbour",
      "caption": "Yacht leaving Christchurch Harbour. The yacht on its way to sea from its mooring in the River Stour or River Avon. Hengistbury Head is in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Stanpit_Marsh_-_geograph.org.uk_-_492099.jpg",
      "title": "Mike Smith / Stanpit Marsh",
      "caption": "Stanpit Marsh. This area is an important Nature Reserve in the Borough of Christchurch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Coastal_erosion%2C_Hengistbury_Head_-_geograph.org.uk_-_98915.jpg/512px-Coastal_erosion%2C_Hengistbury_Head_-_geograph.org.uk_-_98915.jpg",
      "title": "Phil Champion / Coastal erosion, Hengistbury Head",
      "caption": "Coastal erosion, Hengistbury Head. The cliffs along Hengistbury Head are suffering from serious erosion. This is in part due to the loss of protective ironstone doggers along the base of the cliffs. This view is looking west along the coast, with Southbourne and the Bournemouth conurbation in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Surveying_in_progress%2C_Hengistbury_Head_-_geograph.org.uk_-_1243166.jpg",
      "title": "Jim Champion / Surveying in progress, Hengistbury Head",
      "caption": "Surveying in progress, Hengistbury Head. The field to the north-west of Warren Hill is being surveyed, although I do not know for what purpose. Perhaps it is archaeological: the field is the site of an Iron Age settlement. The trig point up on Warren Hill is being used as a reference. I think the gorse-covered mound on the left is a round barrow - there are a large number of Bronze Age barrows in this area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Trig_point_in_use_on_Warren_Hill_-_geograph.org.uk_-_1243137.jpg/256px-Trig_point_in_use_on_Warren_Hill_-_geograph.org.uk_-_1243137.jpg",
      "title": "Jim Champion / Trig point in use on Warren Hill",
      "caption": "Trig point in use on Warren Hill. The white concrete triangulation pillar on Warren Hill is being used as a reference for some surveying going on in the nature reserve down below. Christchurch in the distance on the far side of the harbour - the priory is an obvious landmark. Beyond that, St Catherine's Hill."
    }
  ],
  "distance_km": 9.0,
  "description": "This fine circular walk takes you around the beautiful Christchurch Harbour in Dorset. You'll visit the historic priory, climb to Hengistbury Head, stroll along the beautiful beaches at Mudeford and visit the pretty Stanpit Marsh Nature Reserve. The walk also includes two ferry crossings so you can really enjoy the harbour from all angles! The walk starts from the car park next to Christchurch Priory in the centre of the town. You can enjoy a stroll around the priory grounds where there is a lovely stream leading to the old mill and the harbour. You then follow the path along the River Stour to the Wick Ferry. Here you can catch a little boat across the river for a fee of £1. The ferry runs on most days but if it's closed then you can always continue along the riverside path to Tuckton and cross the river there. On the other side of the Avon you pick up the Stour Valley Way to take you through fields to Hengistbury Head. Look out for horses in the fields and herons and egrets on the water meadows on this section. The paths then climb to Hengistbury Head where there are splendid views of the Isle of Wight, Mudeford Spit, Christchurch Harbour and Priory, the Purbeck Hills and Bournemouth Pier and beach. Look out for a variety of wildlife and heather in the late summer. The path then descends to the lovely Mudeford Spit with its gorgeous beaches, sand dunes and pretty beach huts. Walk along the beach for about 10 minutes and you will reach the ferry on the left hand side. The ferry runs every 15 minutes during British Summer Time, from Easter to late October. It also operates at Weekends and School Hoildays in the Winter months, weather permitting. Click here for more information. The ferry takes you to Mudeford Quay where there is a nice cafe for refreshments. Walk along the beach for a short while before turning west and following roads back to Stanpit Marsh Nature Reserve. Here you will find lagoons, marshland and reed beds with Curlew, Little Egret, Black-tailed Godwits and Herons to look out for. The final section takes you past the Two Riversmeet golf course to the town and priory. To extend your walking in the area you could follow the Avon Valley Path north along the River Avon.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At Hengistbury Head there's a cafe next to the car park and visitor centre where you can enjoy refreshments on the walk. There's also the Beach House cafe at Mudeford where there are nice sea views from the terrace."
    }
  ],
  "video_url": "https://www.youtube.com/embed/6kr73esGprE",
  "postcode": "BH23 1BW",
  "district": "Christchurch",
  "county": "Bournemouth, Christchurch and Poole",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Street, Purewell, Christchurch, Bournemouth, Christchurch and Poole, England, BH23 1BW, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "river",
    "beach",
    "field",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "cafe",
    "ferry"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}