{
  "created_at": "2025-01-06T03:05:27.291951+00:00",
  "objectID": "8776912eb7c109d18497105c317ef10d",
  "ref": "dragons-back-walking-route",
  "title": "Dragons Back Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f3/The_Castle_Inn%2C_Pengenffordd_-_geograph.org.uk_-_552933.jpg",
  "nearby": [
    {
      "description": "Waun Fach",
      "objectID": "e514703d28d9403561825fbe78fde490",
      "ref": "waun-fach-walking-route"
    },
    {
      "description": "Sugarloaf Mountain",
      "objectID": "8c84a2c5b79e42a171d638e2fa88ab46",
      "ref": "sugarloaf-mountain-walking-route"
    },
    {
      "description": "Mynydd Troed",
      "objectID": "4164436d6679a69084fad10411b26e5d",
      "ref": "mynydd-troed-walking-route"
    },
    {
      "description": "Talgarth",
      "objectID": "351a36f40ea2024c164374f1ed375f15",
      "ref": "talgarth-walking-route"
    },
    {
      "description": "Talgarth",
      "objectID": "351a36f40ea2024c164374f1ed375f15",
      "ref": "talgarth-walking-route"
    },
    {
      "description": "Bronllys",
      "objectID": "a3c52ed7348d05ee8ee10ca1821deb81",
      "ref": "bronllys-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8776912eb7c109d18497105c317ef10d.gpx",
  "_geoloc": {
    "lat": 51.9587632203,
    "lng": -3.2030884237
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/The_Castle_Inn%2C_Pengenffordd_-_geograph.org.uk_-_552933.jpg",
      "title": "Trish Steel [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)]",
      "caption": "The Castle Inn, Pengenffordd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Castell_Dinas_-_geograph.org.uk_-_962599.jpg",
      "title": "Alan Bowring / Castell Dinas",
      "caption": "Castell Dinas. The remains of the northern gate tower of this castle which dates from Norman to early Middle Ages period. There are extensive earthworks ariound the flanks of the hill. Public access to this impressive site is by way of a permissive footpath provided through the Tir Gofal agri-environment scheme."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Stone_cairn_on_Y_Grib_-_geograph.org.uk_-_1741902.jpg",
      "title": "Jeremy Bolwell / Stone cairn on Y Grib",
      "caption": "Stone cairn on Y Grib. Looking west, back down this lovely stepped ridge towards Mynydd Troed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Walkers_on_the_northern_escarpment_of_the_Black_Mountains_-_geograph.org.uk_-_1741984.jpg",
      "title": "Jeremy Bolwell / Walkers on the northern escarpment of the Black Mountains",
      "caption": "Walkers on the northern escarpment of the Black Mountains. As part of the 2010 Crickhowell Walking Festival, walkers head for Twmpa along the escarpment footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Path_passes_the_head_of_Twyn_Mawr_-_geograph.org.uk_-_540081.jpg",
      "title": "Shaun Ferguson / Path passes the head of Twyn Mawr",
      "caption": "Path passes the head of Twyn Mawr"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Waun_Fach_Summit_-_geograph.org.uk_-_1691685.jpg/512px-Waun_Fach_Summit_-_geograph.org.uk_-_1691685.jpg",
      "title": "Shaun Ferguson / Waun Fach Summit",
      "caption": "Waun Fach Summit. In the far distance the conical shape of Sugarloaf Mountain"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Looking_back_down_the_Rhiw_Trumau_bridleway_-_geograph.org.uk_-_743297.jpg",
      "title": "Graham Horn / Looking back down the Rhiw Trumau bridleway",
      "caption": "Looking back down the Rhiw Trumau bridleway. On the ascent of the bridleway towards Pen Trumau, turn round from time to time to see the view back down into the Rhiangoll valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Bridleway_to_Rhiw_Trumau_-_geograph.org.uk_-_743264.jpg",
      "title": "Graham Horn / Bridleway to Rhiw Trumau",
      "caption": "Bridleway to Rhiw Trumau. This is the start of the bridleway up Rhiw Trumau, to the col between Pen Trumau and Mynydd Llysiau. Above the farmland, the open access land on the western side of Mynydd Llysiau can be seen."
    }
  ],
  "distance_km": 11.5,
  "description": "Climb the Dragons Back on this challenging circular walk in the Black Mountains, Wales. The route runs for just over 7 miles and includes a visit to the highest point of the Black Mountains at Waun Fach. The views along the ridge are breathtaking in all directions. The walk starts from the parking area near Pengenffordd. Head north from here toward the village where you can pick up a trail heading east to Castell Dinas. This Iron Age hillfort has the highest castle in England and Wales. A Norman castle was built here in the 11th century. What remains now are crumbling walls mainly covered with earth and the outlines of ditches and ramparts from the original Iron Age fortifications, commanding extensive views up into the Black Mountains and over Talgarth towards Brecon. After exploring the fort the route continues east to Y Grib and Pen Y Manllwyn. Here you turn south to Waun Fach which stands at a height of 811 m (2,661 ft). From here there are views over the Brecon Beacons including Rhos Fawr and the Radnor Forest. You may also see some wild ponies wandering around the area. The walk then descends to the south west toward Pen Trumau. Soon after you turn west along Rhiw Trumau and Cwmmfforest. The route then returns to the car park. You can enjoy well earned refreshments at the Castle Inn in Pengenffordd after your exercise. For a shorter walk you could try the climb to Waun Fach from the Castell Dinas car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the appropriately named Dragons Back pub for some well earned refreshments after your walk. The pub is notable as being the highest pub in the Brecon Beacons National Park. The relaxed pub does very good food and also provides accommodation if you need to stay over. It's also dog friendly if you have your canine friend with in tow. You can find the pub at Pengenffordd with a postcode of LD3 0EP for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To extend your walking in the area you could head to the nearby Grwyne Fawr Reservoir for some nice waterside trails. Also nearby is the Mynydd Du Forest where there are miles of walking trails and mountain bike trails to try. To the west is the climb to Mynydd Troed and Cockit Hill from Pengenffordd. In nearby Talgarth there's ancient woodland and waterfalls to see in the Pwll-y-Wrach Nature Reserve. There's also some interesting local history with an 18th century watermill and the 11th century Bronllys Castle to visit. For more walking ideas in the area see the Brecon Beacons Walks and the Black Mountains Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bq9Q1nwGTmY",
  "postcode": "LD3 0ER",
  "county": "Powys",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dragons Back Bunkhouse, A479, Pen-y-wern, Talgarth, Powys, Cymru / Wales, LD3 0ER, United Kingdom",
  "district": null,
  "state": "Cymru / Wales"
}