{
  "created_at": "2025-01-06T02:03:44.470870+00:00",
  "objectID": "877f31f2fb0e7126f1419866653789ab",
  "ref": "devils-punch-bowl-walking-and-cycle-route",
  "title": "Devil's Punch Bowl Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Devil%27s_Punch_Bowl%2C_old_A3_closed_to_traffic_4.jpg/128px-Devil%27s_Punch_Bowl%2C_old_A3_closed_to_traffic_4.jpg",
  "nearby": [
    {
      "description": "Thursley National Nature Reserve",
      "objectID": "0f7544fe60a0eaa219447abaa62f9af3",
      "ref": "thursley-national-nature-reserve-walking-route"
    },
    {
      "description": "Frensham Country Park",
      "objectID": "3e04bb50f7b60d432262c737fc121416",
      "ref": "frensham-country-park-walking-and-cycle-route"
    },
    {
      "description": "Leith Hill",
      "objectID": "48f6a9b17b84ff1044fbaa992ad230d9",
      "ref": "leith-hill-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Alice Holt Forest",
      "objectID": "d43f1f10879ed9932fb09f211ae68403",
      "ref": "alice-holt-forest-walking-and-cycle-route"
    },
    {
      "description": "Hindhead",
      "objectID": "f7d1988c82eb27184c444a63060fd9d6",
      "ref": "hindhead-walking-route"
    },
    {
      "description": "Black Down",
      "objectID": "d13d828818d1e801d378aaf4cb507128",
      "ref": "black-down-walking-and-cycle-route"
    },
    {
      "description": "Elstead",
      "objectID": "5f5681c33576c4c5d5ba1aabfd7065bc",
      "ref": "elstead-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/877f31f2fb0e7126f1419866653789ab.gpx",
  "_geoloc": {
    "lat": 51.1142839645,
    "lng": -0.7294099119
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Devil%27s_Punch_Bowl%2C_old_A3_closed_to_traffic_4.jpg/128px-Devil%27s_Punch_Bowl%2C_old_A3_closed_to_traffic_4.jpg",
      "title": "By Simon Burchell (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Devil's Punch Bowl, old A3 closed to traffic 4. The vast natural amphitheatre, steeped in local folklore and tales. Previously, the London to Portsmouth road (the A3) ran along the edge of the site until the construction of the Hindhead Tunnel in 2011. Presently, the area is under the ownership and care of the National Trust as part of the \"Hindhead Commons and the Devil's Punch Bowl\" estate. Gibbet Hill, standing at 272 metres (892 ft) above sea level, marks the highest point of the bowl's rim. From this vantage point, visitors can enjoy a sweeping vista that, on a clear day, includes the distant London skyline, stretching some 38 miles (61 km) away. Recognised for its natural beauty and significance, the Devil's Punch Bowl was showcased on the 2005 TV programme Seven Natural Wonders as one of the wonders of the South."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Devil%27s_Punch_Bowl%2C_Hindhead_Common_-_Christopher-Hilton.jpg",
      "title": "Christopher Hilton [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Devil's Punch Bowl, Hindhead Common. View from the memorial stone on Gibbet Hill. Legend has it that the Devil used to leap between hills at the trio of 'Devil's Jumps' close to Churt village. This greatly troubled Thor, the God of Thunder, who resided at the nearby Thor's Lie (Thursley). In an attempt to strike the Devil with thunder and lightning, Thor was met with retaliation as the Devil grabbed a handful of earth and threw it back at him. The resulting hollow is known as the Devil's Punch Bowl."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Gibbet_Hill_-_geograph.org.uk_-_684148.jpg",
      "title": "Colin Smith / Gibbet Hill, via Wikimedia Commons",
      "caption": "Gibbet Hill High point (272 metres) on Hindhead Common with heather, Celtic Cross, information board and trig point at this viewpoint. The region was infamous for its association with highwaymen and thieves, with the bodies of three offenders once publicly displayed there on a gibbet as a deterrent for their crimes. The Celtic cross, listed as Grade II, is believed to have been erected either by the judge Sir William Erle or as an unmarked memorial established after his passing. The surrounding terrain comprises heathland and gorse, originally cultivated by broomsquires who harvested heather, broom, and birch branches to fashion brooms. Gibbet Hill and its vicinity were referenced by Dickens in his 1839 novel Nicholas Nickleby, depicting a scene where Nickleby journeyed from London to Portsmouth."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Spotheight_on_Hindhead_Common_-_geograph.org.uk_-_1173716.jpg/256px-Spotheight_on_Hindhead_Common_-_geograph.org.uk_-_1173716.jpg",
      "title": "Shazz / Spotheight on Hindhead Common, via Wikimedia Commons",
      "caption": "Spotheight on Hindhead Common. This is at 272 metres above sea level on Gibbet Hill which is the second highest hill in Surrey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Highland_cattle_grazing_on_Hindhead_common._-_geograph.org.uk_-_17162.jpg",
      "title": "Martyn Pattison / Highland cattle grazing on Hindhead common., via Wikimedia Commons",
      "caption": "Highland cattle grazing on Hindhead common. Sir Arthur Conan Doyle, the author renowned for creating Sherlock Holmes, resided at Undershaw in Hindhead from 1897 to 1907. During his time there, Sir Arthur often strolled on the Commons, and he was actively involved in the initial Hindhead Commons committee alongside Sir Robert Hunter and others. Legend has it that Conan Doyle drew inspiration from Hindhead for his famous novel 'The Hound of the Baskervilles'."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Information_board_on_Hindhead_Common_-_geograph.org.uk_-_1173664.jpg",
      "title": "Shazz / Information board on Hindhead Common, via Wikimedia Commons",
      "caption": "Information board on Hindhead Common. The board gives details of the Sailor's Stone which sits nearby on the hill top. In 1786, a sailor travelling from London to Portsmouth docks was brutally murdered by three individuals he had befriended in a local pub in Thursley. Following this tragic event, the Sailor’s Stone was erected to mark the spot where the sailor lost his life. The three highwaymen responsible for the crime were subsequently tried and hanged on Gibbet Hill, close to the scene of the murder, as a deterrent to other potential criminals. Following the executions, various fears and superstitions emerged surrounding Gibbet Hill. In 1851, Sir William Erle, an English lawyer, judge, and Whig politician, funded the installation of a Celtic cross on Gibbet Hill to dispel these fears and uplift the local community. The Celtic cross has since been designated as a Grade II listed monument by English Heritage. To delve into the area's grim history, one can take a walk along the Old Portsmouth Road around the Devil’s Punch Bowl, where both the Celtic cross and the Sailor’s Stone with its inscription can be found."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Devil%27s_Punch_Bowl%2C_Hindhead_Common_-_geograph.org.uk_-_1562464.jpg",
      "title": "don cload / Devil's Punch Bowl, Hindhead Common, via Wikimedia Commons",
      "caption": "Devil's Punch Bowl, Hindhead Common A well known valley maintained as open heath. The soil in this part of Surrey has two layers — an upper layer of sandstone, with clay beneath. This deep depression is believed to be the result of erosion caused by spring water beneath the sandstone, causing the upper level to collapse. With its steep sides, the Devil's Punch Bowl has become a natural nature reserve, filled with heathland, streams and woodland. The site has abundant wildlife. Most woodland species can be seen easily - including lesser spotted woodpecker and common redstart. It has been known for the wood warbler, a rare summer visitor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Bronze_raised-relief_map_at_the_Devil%27s_Punch_Bowl_-_geograph.org.uk_-_1562404.jpg/256px-Bronze_raised-relief_map_at_the_Devil%27s_Punch_Bowl_-_geograph.org.uk_-_1562404.jpg",
      "title": "don cload / Bronze raised-relief map at the Devil's Punch Bowl, via Wikimedia Commons",
      "caption": "Bronze raised-relief map at the Devil's Punch Bowl. Located at a popular viewpoint near the National Trust car park."
    }
  ],
  "distance_km": 8.0,
  "description": "This circular walk in the Surrey Hills AONB takes you through Hindhead Common, up Gibbet Hill and to the Devil's Punch Bowl - a large natural amphitheatre and beauty spot. The area is National Trust owned so there is a car park, cafe, information boards and a series of well marked footpaths. You start at the car park and head through the Devil's Punch Bowl which has become a natural nature reserve, filled with heathland, streams and woodland. You then climb Gibbet Hill, the second highest hill in Surrey at 272 metres (892 ft). From here there are magnificent views over the punchbowl, Thursley, Hankley Common, Crooksbury Hill, the South Downs, Godalming and Guildford. The hills of Haslemere and Black Down can also be seen, while on a clear day the iconic buildings of London are also visible. After taking in the views you then follow more pleasant woodland tracks across the common before returning to the start point. The area is good for walkers but also popular with mountain bikers as there are many wide downhill tracks to enjoy. If you would like to continue your walking in the area you could head to Leith Hill -the highest point in the South East with fabulous views over London and the English Channel. The Greensand Way also runs through the area so you could pick this up to continue your walk.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The National Trust's on site cafe does a good range of snacks and meals and has a nice outdoor seating area for warmer days. The Devil's Punchbowl Hotel is another aptly named and conveniently located option for some post walk refreshments. The noteworthy hotel has an interesting history having been a country residence for the Hon. Rollo Russell, whose father- Lord John Russell was England’s first Liberal Prime Minister. Sometime during the early 1900’s, the house (known then as Thorshill) was leased to a part time minister of the local congregational church, he and his wife ran Thorshill as a private guesthouse up until 1949. Now the hotel has a nice bar area with a decent lunch menu to peruse. You can find it at 52 London Road with a postcode of GU26 6AG for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is a great for dog walking with lots of wide woodland paths and countryside to explore. The outdoor section at the National Trust's cafe is also dog friendly with drinking bowls and doggy biscuits available from the visitor den."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To the east of Gibbet Hill you will find the historical landmark known as the Temple of the Four Winds. The structure was built around 1910 by Viscount Pirrie, a leading Irish shipbuilder and businessman. Today there is sadly not much left of the temple, with just a stone floor marking where it stood. However, it is still a magnificent view point and well worth the climb. About 2 miles south east of the car park you could pay a visit to Waggoners Wells. This is another worthy National Trust site which includes three ponds surrounded by peaceful woodland. It's a nice easy place to extend your outing if you have time.  Pictured above are Waggoners Wells. This tranquil beauty spot near the punch bowl makes a nice addition to your outing. The delightful Frensham Ponds is a similar place and located just a few miles away near the picturesque village of Tilford.In Elstead there's the Thursley National Nature Reserve. The site is located a couple of miles to the north and has miles of footpaths through heathland and woodland with a huge variety of wildlife. For a shorter route across the common see the circular Hindhead Walk which starts from the same car park. It also features an interesting video with more information about the Sailor's Stone you will pass on your outing. For more walking ideas in the area see the Surrey Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/NUSq-r3rdDw",
  "postcode": "GU26 6AG",
  "district": "Hindhead",
  "county": "Surrey",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}