{
  "created_at": "2025-01-06T03:58:53.923317+00:00",
  "objectID": "8785cb66bba1e9fcda7df79ab4cad4a8",
  "ref": "wast-water-walking-and-cycle-route",
  "title": "Walk around Wast Water Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Wast_Water_-_geograph.org.uk_-_830172.jpg",
  "nearby": [
    {
      "description": "Scafell Pike",
      "objectID": "b17cfc6012e8c4c855b5f6d62ac368bc",
      "ref": "scafell-pike-walking-route"
    },
    {
      "description": "Nether Wasdale",
      "objectID": "a35618af4c557385eeeca7a482ca745d",
      "ref": "nether-wasdale-walking-route"
    },
    {
      "description": "Ravenglass",
      "objectID": "b8da90f13a2570cae8b129adfaf20f7c",
      "ref": "ravenglass-walking-route"
    },
    {
      "description": "Seascale",
      "objectID": "1e0c15eae5080388879ab7b3d77acce5",
      "ref": "seascale-walking-route"
    },
    {
      "description": "Gosforth",
      "objectID": "8f8eae5582f081aefbce2e1248cdb6de",
      "ref": "gosforth-walking-route"
    },
    {
      "description": "Illgill Head",
      "objectID": "f17e77684f5c5b06977cf4a870e56715",
      "ref": "illgill-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8785cb66bba1e9fcda7df79ab4cad4a8.gpx",
  "_geoloc": {
    "lat": 54.4553294322,
    "lng": -3.2612188978
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Wast_Water_-_geograph.org.uk_-_830172.jpg",
      "title": "Andrew Smith / Wast Water",
      "caption": "Wast Water Great Gable (left) and the Scafells catch some evening sunshine. It had been a breezy day but conditions on the lake were now a lot calmer than they had been earlier."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Wast_Water_-_geograph.org.uk_-_828902.jpg",
      "title": "Andrew Smith / Wast Water",
      "caption": "Choppy waters at Wast Water with a gale whistling down the valley from the high fells around Wasdale Head. From left to right are Yewbarrow, Kirk Fell (half-hidden), Great Gable and Lingmell. Scafell Pike rises out of picture to right of Lingmell. The slopes of Illgill Head are to the extreme right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Wast_Water_and_the_Scafells_-_geograph.org.uk_-_829033.jpg",
      "title": "Andrew Smith / Wast Water and the Scafells",
      "caption": "Wast Water and the Scafells. A view up the length of Lingmell Gill to Scafell Pike with Lingmell to the left and Sca Fell to the right. This is a view from the road heading into Wasdale Head which was in the shadow cast by Yewbarrow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Pastures_beside_Wast_Water_-_geograph.org.uk_-_828941.jpg",
      "title": "Andrew Smith / Pastures beside Wast Water",
      "caption": "Pastures beside the lake. A view across the small area of intake fields at Bowderdale. Across the lake the famous screes plummet to the shoreline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/View_of_Wast_Water_from_below_Yewbarrow_-_geograph.org.uk_-_828948.jpg",
      "title": "Andrew Smith / View of Wast Water from below Yewbarrow",
      "caption": "View of the lake from below Yewbarrow. The view from just below Dropping Crag of the hillside between Over Beck and Nether Beck. The farm is Bowderdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Path_descending_from_Yewbarrow_to_Wast_Water_-_geograph.org.uk_-_828951.jpg/256px-Path_descending_from_Yewbarrow_to_Wast_Water_-_geograph.org.uk_-_828951.jpg",
      "title": "Andrew Smith / Path descending from Yewbarrow to Wast Water",
      "caption": "Path descending from Yewbarrow to Wast Water. The view from Dropping Crag. The path can be seen traversing the hillside to rejoin the ridge. Over Beck is in the valley to the right. Bowderdale Farm is to the extreme right"
    }
  ],
  "distance_km": 11.0,
  "description": "Enjoy a circular walk around one of the most stunning lakes in the Lake District National Park. Wast Water is the deepest of all the lakes and is surrounded by some of the highest mountains - Red Pike, Kirk Fell, Great Gable and Scafell Pike (England's highest mountain). In 2007 the public voted Wast Water Britain’s favourite view in an ITV television program. Although the complete route below is suitable for walkers, a quiet country road runs along the western edge of the lake so you can enjoy an excellent waterside cycle ride too. The walk starts at the car park at Wasdale Head at the north eastern end of the lake. You can find it at postcode CA20 1ET. From here it is a short stroll down to the lake where you can pick up the circular footpath which runs for about 7 miles around the lake. It's fairly flat with a few small climbs on the way. Wast Water is located about 6 miles north east of Ravenglass .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the car park there's a static van selling a good range of hot meals and snacks. There's also an information point here which will tell you all about the walks in the area. Also nearby is the famous Wasdale Head Inn. Described as the the birthplace of climbing the inn has an interesting history stretching back over 200 years. They do very good food and have a decent selection of ales too. It's located close to the car park at postcode CA20 1EX for your sat navs. The inn is also dog friendly and will provide water bowls for your thirsty friend. At the other end of the lake you could take a small detour to visit Nether Wasdale. Here you'll find The Strands and The Screes pubs. They are set in buildings with two distinct characters with a different selection of craft ales and food in each. There's also a fine garden area where you can enjoy wonderful views of the fells with your lunch. You can find them in the village at postcode CA20 1ET for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is popular with dog walkers with its lakeside paths and woodland trails at the southern end of the lake. The pubs in Nether Wasdale mentioned above are also very dog friendly and will provide treats for your pet."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The car park at the start of the route is also a popular start point for the climb to Scafell Pike, the highest mountain in England. The circular climb to Pillar also starts from Wasdale Head. It's a splendid walk taking you to the eighth highest point in the Lake District. The picturesque village of Nether Wasdale offers an alternative start point to the route. It lies at the other end of the lake and includes a lovely village green, two fine old pubs and a 16th century church. There's also Wasdale Hall, which is now a Youth Hostel with well priced accommodation. It's set in an impressive half-timbered National Trust-owned house dating from 1829 and still retains many original features. It's a good option if you would like to stay in the area and explore further. The Nether Wasdale Walk explores the village and the western end of the lake with its views of the River Irt and peaceful woodland trails. On the eastern side of the water you can enjoy a climb to Whin Rigg and Illgill Head on a more challenging circular walk around Wast Water. There's some excellent views over the lake from these prominent peaks. The pretty Burnmoor Tarn can also be visited in this area. For more walking ideas in the National Park see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YXK_y8DUByc",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Old Corpse Road, Wasdale, Cumberland, England, CA20 1EX, United Kingdom",
  "postcode": "CA20 1EX",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "lake"
  ],
  "points_of_interest": [
    "viewpoints",
    "natural scenery"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}