{
  "created_at": "2025-01-06T19:05:23.361063+00:00",
  "objectID": "87bb49923d3e3f3708b5470b9acca916",
  "ref": "edins-hall-broch-walking-route",
  "title": "Edin's Hall Broch Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/56/Edin%E2%80%99s_Hall_Broch_-_geograph.org.uk_-_3814459.jpg?20220918100339",
  "nearby": [
    {
      "description": "Whiteadder Reservoir",
      "objectID": "d6588fadf229ce204fa49e8bb45ddacd",
      "ref": "whiteadder-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/87bb49923d3e3f3708b5470b9acca916.gpx",
  "_geoloc": {
    "lat": 55.84107,
    "lng": -2.33886
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Edin%E2%80%99s_Hall_Broch_-_geograph.org.uk_-_3814459.jpg?20220918100339",
      "title": "Edin’s Hall Broch by Walter Baxter, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Edin’s Hall Broch. Brochs are roundhouse buildings found throughout Atlantic Scotland. The first brochs are thought to originate from around 300 BCE. It is thought they were used primarily for defensive or offensive purposes. In the 19th century, antiquarians excavated Edin's Hall, recovering artefacts like a stone spindle whorl, jet ring fragment, amber bead, bones, an oyster shell, and a piece of a glass bracelet. These relics were donated to the National Museum of Scotland. In 1976, two copper ingots were found inside the broch with a metal detector; one is now at the museum and likely originated from local mines, hinting at the wealth they provided. A survey in 1996 also uncovered pottery and another spindle whorl."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Entrance_to_Edin%27s_Hall_Broch_-_geograph.org.uk_-_1173964.jpg?20110225170937",
      "title": "Calum McRoberts / Entrance to Edin's Hall Broch",
      "caption": "Entrance to Edin's Hall Broch. This complex site stands on the NE slope of Cockburn Law (about 210m OD) just above a fairly steep slope down to the Whiteadder Water. The fort consists of a double rampart, each line with an external ditch, enclosing an oval area some 135m E-W by 75m transversely. On the N side the defences continue as stony banks at the top of the slope. The entrance has been in the WSW. The walls of the broch still stand up to 1.5m high in places. The entrance is in the SSE and has door-checks as well as two guard cells opening off it further in. Three large mural cells open on to the central court which is 16.8m in diameter. The cell on the S has the remains of a stone stairway at its N end which presumably rose to the wallhead. The wall is 5.2m thick so that the overall diameter of the building is some 27m, very large for a broch. A rectangular chamber attached to the outside of the wall at the entrance is a secondary addition, but the sub-rectangular enclosure within which the broch stands is possibly contemporary"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Edin%27s_Hall_Broch_-_geograph.org.uk_-_212019.jpg?20100131211540",
      "title": "Lisa Jarvis / Edin's Hall Broch",
      "caption": "The hillfort at Edin's Hall is thought to originate from the pre-Roman Iron Age. While the exact age of the broch is unknown, it may have been built during the 2nd century AD, possibly between Scotland’s two main Roman occupations. Excavations at a similar site, Torwoodlee Broch, indicate that such brochs were constructed and later dismantled around this period. Inside the hillfort, stone foundations mark ancient dwellings, some overlapping the fort’s defences, suggesting these structures could postdate both the hillfort and the broch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Edin%27s_Hall_Broch_-_geograph.org.uk_-_4446973.jpg/512px-Edin%27s_Hall_Broch_-_geograph.org.uk_-_4446973.jpg?20230222014833",
      "title": "Edin's Hall Broch by Richard Strathie, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The broch from above."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Elba_Ford_-_geograph.org.uk_-_5829186.jpg/512px-Elba_Ford_-_geograph.org.uk_-_5829186.jpg?20231129014533",
      "title": "Elba Ford by John Walton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Elba Ford"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/The_triangulation_pillar_on_Cockburn_Law_-_geograph.org.uk_-_2029256.jpg?20210520145743",
      "title": "The triangulation pillar on Cockburn Law by Walter Baxter, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The triangulation pillar on Cockburn Law"
    }
  ],
  "distance_km": 6.8,
  "description": "This walk visits the historic remains of a 2nd-century broch near Duns in the Scottish Borders. The route also visits the picturesque Elba Falls and climbs to the viewpoint at Cockburn Law. You can start the walk from the car park which lies just to the east of the site. From here footpaths will take you west to Whiteadder Water where you can enjoy views of Elba Falls. Cross over the river here and the paths continues to Edin's Hall Broch. The broch dates from the 2nd century and includes surviving walls of a height of between 1.0 and 1.8 metres. There are also the remains of an Iron Age Hillfort nearby. To the west of the site there's also a climb to Cockburn Law where you can enjoy more lovely views over the surrounding hills and countryside. The hill stands at a height of 325 metres and is located a short walk from the broch site.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north west and there's some pleasant waterside trails along Whiteadder Reservoir in the Lammermuir Hills of East Lothian."
    }
  ],
  "video_url": "https://www.youtube.com/embed/n5bjrKV22iM?si=A3JhubtjQ9SZSOYf",
  "county": "Scottish Borders",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A6112, Hoardweel, Scottish Borders, Alba / Scotland, TD11 3RS, United Kingdom",
  "postcode": "TD11 3RS",
  "district": null,
  "state": "Alba / Scotland",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}