{
  "objectID": "87f51e0225e13a21c69dcd365304578d",
  "created_at": "2024-12-18T12:17:17.026341+00:00",
  "ref": "highdown-hill-and-highdown-gardens-walking-route",
  "title": "Highdown Hill and Highdown Gardens Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e6/View_east_from_Highdown_Hill_-_geograph.org.uk_-_448817.jpg",
  "nearby": [
    {
      "description": "Arundel to Littlehampton River Walk",
      "objectID": "3e56d70d6df624a704fcd66c4e34489c",
      "ref": "arundel-to-littlehampton-river-walk-walking-route"
    },
    {
      "description": "Seven Sisters Country Park",
      "objectID": "18d04e2f7f77fa56b81dd4290e00247c",
      "ref": "seven-sisters-country-park-walking-and-cycle-route"
    },
    {
      "description": "Seaford",
      "objectID": "89116560f817741153e1999bc1f153d7",
      "ref": "seaford-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/4804FF131FC25F4285257EE5005969D7/$FILE/Highdown Hill and Highdown Gardens.gpx",
  "_geoloc": {
    "lat": 50.825034594,
    "lng": -0.441917619
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/View_east_from_Highdown_Hill_-_geograph.org.uk_-_448817.jpg",
      "title": "Robin Webster / View east from Highdown Hill",
      "caption": "View east from Highdown Hill. In the foreground is the rampart of the ancient fort at the top of this isolated chalk hill. The distant view is across Worthing and Brighton to the chalk cliffs extending from the east of Brighton past Newhaven to Seaford Head and finally to the Belle Tout cliff near Beachy Head. Some claim Beachy Head itself is visible from here, it probably is, but from the land side, not the cliff itself."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Footpath%2C_Highdown_Hill_-_geograph.org.uk_-_890435.jpg",
      "title": "Simon Carey / Footpath, Highdown Hill",
      "caption": "Footpath, Highdown Hill in the summer of 2008. Viewed from the western ramparts of the former Iron Age fort and looking out onto the coastal plain below. If you strain your eyes and look between the bushes on the centre right you can just make out the outline of the Isle of Wight. Highdown Hill was originally settled in the Bronze Age and was used during the Iron Age and by the Romans who built a bath house on the western side of the slope. The Saxons also used the fort for both defence and as a cemetery. The footpath follows an ancient east-west route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Footpath_to_Highdown_Hill_-_geograph.org.uk_-_890514.jpg/256px-Footpath_to_Highdown_Hill_-_geograph.org.uk_-_890514.jpg",
      "title": "Simon Carey / Footpath to Highdown Hill",
      "caption": "Footpath to Highdown Hill. From the bridleway just south of Ecclesden Mill. The line of bushes at the end of the wheat field mark the boundary with the National Trust owned hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Disused_Chalk_Pit%2C_Highdown_Hill_-_geograph.org.uk_-_1250533.jpg",
      "title": "Simon Carey / Disused Chalk Pit, Highdown Hill",
      "caption": "Looking east to the disused chalk pit on Highdown Hill, in the civil parish of Ferring, West Sussex, England. The western slope shown is connected to Hangleton Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/View_south_from_Highdown_Hill_-_geograph.org.uk_-_448786.jpg",
      "title": "Robin Webster / View south from Highdown Hill",
      "caption": "View south from the hill. The sea is in the distance, across the Sussex coastal plain. The hill is an isolated chalk outcrop, quarried of old in the foreground. Most of the coastal plain here is residential, but in the mid-distance on the right glasshouses and orchards are to be seen, and on the left an equestrian establishment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Highdown_Gardens_Car_Park_and_Picnic_Area_-_geograph.org.uk_-_15655.jpg",
      "title": "Janine Forbes / Highdown Gardens Car Park and Picnic Area",
      "caption": "Highdown Gardens Car Park and Picnic Area"
    }
  ],
  "distance_km": 5.0,
  "description": "This walk visits Highdown Gardens before climbing Highdown Hill in the South Downs. The walk begins at the car park at Highdown Gardens. Both the gardens and parking are free, though you are free to make a donation if you wish. You can then follow a series of footpaths through the park with its beautiful collection of rare plants and trees. The chalk gardens are situated on Downland countryside with wonderful views towards the sea. Highlights include two pretty ponds with fish, toads and newts, a Himalayan Birch Bark Cherry Avenue, a Rose Garden and a Herb Garden. After touring the gardens you can then continue your walk to Highdown Hill. The hill stands at 81 metres (266 ft) and is a popular spot for walkers. From the summit there are wonderful views of the coast including the Seven Sisters and the Isle of Wight. Highdown Hill and Highdown Gardens are located in between Littlehampton and Worthing. To continue your walking in the area head to Littlehampton where you can pick up a nice riverside footpath along the River Arun. You can follow this all the way to Arundel on the Arundel to Littlehampton River Walk . Here there's the opportunity to explore the fascinating Arundel Castle and Arundel Park .",
  "video_url": "https://www.youtube.com/embed/0XpNOYiAuPc",
  "postcode": "BN12 6FB",
  "county": "West Sussex",
  "region": "South East",
  "country": "England"
}