{
  "created_at": "2025-01-06T00:30:49.406484+00:00",
  "objectID": "880618cfa186bd38d425a388fec77d96",
  "ref": "gateshead-walking-route",
  "title": "Walks in Gateshead Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Tyne_Bridge_%28geograph_3522843%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/880618cfa186bd38d425a388fec77d96.gpx",
  "_geoloc": {
    "lat": 54.965590214,
    "lng": -1.609258129
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Tyne_Bridge_%28geograph_3522843%29.jpg",
      "title": "Richard Webb / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Tyne Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Watergate_Forest_Park_-_geograph.org.uk_-_101771.jpg",
      "title": "Chris Tweedy / Watergate Forest Park",
      "caption": "Footbridge over the lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Pond_in_Derwent_Walk_Country_Park_-_geograph.org.uk_-_176113.jpg",
      "title": "Brian Abbott / Pond in Derwent Walk Country Park",
      "caption": "Pond in Derwent Walk Country Park"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/The_Derwent_Walk_-_geograph.org.uk_-_176064.jpg",
      "title": "Brian Abbott / The Derwent Walk",
      "caption": "The Derwent Walk. The Derwent Valley Railway between Swalwell and Consett was converted into a path / bridleway after it was closed in 1963. Today it forms part of Derwent Walk Country Park. The passenger platform of the old Swalwell Station can be seen on the right of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Shibdon_Pond_Nature_Reserve_-_geograph.org.uk_-_87430.jpg",
      "title": "Steve McShane / Shibdon Pond Nature Reserve",
      "caption": "Shibdon Pond Nature Reserve. Shibdon Pond is an ideal site for bird watching with plenty of open water, marshland, grassland and scrub habitats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/River_Tyne%2C_Gateshead_-_geograph.org.uk_-_1447974.jpg",
      "title": "wfmillar / River Tyne, Gateshead",
      "caption": "River Tyne, Gateshead View downstream from the Gateshead side of the Millennium Bridge. Baltic Mill on the right."
    }
  ],
  "distance_km": 20.0,
  "description": "This major north east town has a number of good options for walkers with two significant waymarked trails running through the area. There's also several nearby woods, country parks and riverside trails along the Derwent and Tyne Rivers. This walk takes you along the Tyne before visiting Watergate Forest Park and Derwent Walk Country Park. It uses two of the waymarked trails which run through the town in the shape of the Tyne and Wear Trail and the Derwent Valley Walk. The walk starts next to the impressive Tyne Bridge which links Newcastle upon Tyne and Gateshead. From here you can pick up the Tyne and Wear Trail and follow it west past a series of bridges, to Dunston. Here you leave the river and head south to Watergate Forest Park. The popular park is located on the site of the former Watergate colliery. It includes woodland trails, a roman fort, a pretty lake and wildflower meadows. After exploring the park the route heads west through Whickam to visit Derwent Walk Country Park. Here you'll find another lake, a mixture of woodland, meadows and wetland areas. You could also cross to the western side of the river and visit Thornley Woods where there's a sculpture trail and a visitor centre with lots of information about the area. At the park you can pick up the Derwent Valley Walk and follow it north along the river to Damhead Wood. You could take a small detour here and head into Blaydon where you can visit the Shibdon Pond Nature Reserve. This route heads east through Swalwell to rejoin with the Tyne and Wear trail near Dunston. You can then rejoin with the river and follow the path back to the start point.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route there are good cafes at Watergate Forest Park and Thornley Woods. You can stop off here and enjoy a meal outside if the weather is good."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parks on the walk are all dog friendly so you're bound to bump into other dog walkers on the trails."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the other side of the river you can link up with the Hadrian's Wall Path. If you follow the epic trail west it will take you to the Vindobala Roman Fort next to the wall. The Newcastle Walk shows the full details of this route. Near Derwent Walk Park you could take a detour from the route and head south to visit Gibside at Rowlands Gill. There's a fine 18th century landscaped park to explore here."
    }
  ],
  "postcode": "NE8 2BJ",
  "district": "Gateshead",
  "region": "North East",
  "country": "England",
  "gazetteer_found": true
}