{
  "objectID": "88167f9a3e8161804fca630349812fb5",
  "created_at": "2024-12-18T10:00:00.412158+00:00",
  "ref": "mersea-island-walking-route",
  "title": "Mersea Island Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/60/Sandstone_cliffs_on_Mersea_Island_-_geograph.org.uk_-_1004053.jpg",
  "nearby": [
    {
      "description": "Abberton Reservoir",
      "objectID": "ec44ad0d3e55d4264241bdb4fb8e5af1",
      "ref": "abberton-reservoir-walking-and-cycle-route"
    },
    {
      "description": "Cudmore Grove Country Park",
      "objectID": "bf9284f26b4e06fe9686b7030f38affd",
      "ref": "cudmore-grove-country-park-walking-route"
    },
    {
      "description": "Blackwater Estuary",
      "objectID": "babc6834b61398b0b0c77b9148a0bf9d",
      "ref": "blackwater-estuary-walking-route"
    },
    {
      "description": "High Woods Country Park",
      "objectID": "e0854fec4015f77f88cca692bbcfd463",
      "ref": "high-woods-country-park-walking-and-cycle-route"
    },
    {
      "description": "Ardleigh Reservoir",
      "objectID": "50c46a24df905637d94869b899e95552",
      "ref": "ardleigh-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/88167f9a3e8161804fca630349812fb5.gpx",
  "_geoloc": {
    "lat": 51.7793915352,
    "lng": 0.8988073361
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Sandstone_cliffs_on_Mersea_Island_-_geograph.org.uk_-_1004053.jpg",
      "title": "Bob Jones / Sandstone cliffs on Mersea Island, via Wikimedia Commons",
      "caption": "Sandstone cliffs on Mersea Island. The erosive effect of the sea can be clearly seen, with undercutting of the bottom of the cliffs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Eastern_Tip_of_Mersea_Island_-_geograph.org.uk_-_137919.jpg",
      "title": "Simon / Eastern Tip of Mersea Island, via Wikimedia Commons",
      "caption": "Eastern Tip of the island. Looking south across the Colne Estuary towards Brightlingsea. Tidal Lagoons in the foreground."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Mersea_Stone_-_geograph.org.uk_-_1004687.jpg",
      "title": "Bob Jones / Mersea Stone, via Wikimedia Commons",
      "caption": "Mersea Stone. The eastern tip of the island is known as Mersea Stone. This view across the sandy spit looks across Brightlingsea Reach to the town of that name."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/View_across_Mersea_Fleet_-_geograph.org.uk_-_665567.jpg",
      "title": "Evelyn Simak / View across Mersea Fleet, via Wikimedia Commons",
      "caption": "View across Mersea Fleet. In the background at right the Strood causeway can be seen. It was first constructed in Roman times and presently is part of the B1025 that connects Mersea with Colchester. The causeway can become flooded during high tides; during particularly high tides the bridge is impassable by vehicles including the emergency services, except for those with high clearance, for over an hour. Mersea Island, located off the coast to the SE of Colchester, is the most easterly inhabited island in Great Britain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/The_Strood_causeway_flooded_at_spring_tide_-_geograph.org.uk_-_83107.jpg",
      "title": "Simon Frost / The Strood causeway flooded at spring tide, via Wikimedia Commons",
      "caption": "The Strood causeway flooded at spring tide. The picture shows the causeway to Mersea Island, from the island. The Strood has been in use since the Roman occupation and regularly floods during spring tides. The vehicle shown was the last to go across. Subsequent vehicles turned back and had to wait for the tide to turn. Islanders rely on tide tables to plan their forays to the mainland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Towards_Cobmarsh_Island_-_geograph.org.uk_-_218837.jpg/256px-Towards_Cobmarsh_Island_-_geograph.org.uk_-_218837.jpg",
      "title": "Glyn Baker / Towards Cobmarsh Island, via Wikimedia Commons",
      "caption": "Towards Cobmarsh Island. This is the view from Old Hall Marsh across the saltmarsh, Mersea Quarters, Cobmarsh Island and Besom Fleet towards West Mersea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/View_to_Great_Cob_Island_-_geograph.org.uk_-_218950.jpg",
      "title": "Glyn Baker / View to Great Cob Island, via Wikimedia Commons",
      "caption": "View to Great Cob Island. This is the view across the Saltmarsh on Tollesbury Wick Nature Reserve towards Great Cob Island and West Mersea beyond. The reserve is managed by Essex Wildlife Trust"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/View_west_towards_the_mainland_-_geograph.org.uk_-_665570.jpg",
      "title": "Evelyn Simak / View west towards the mainland, via Wikimedia Commons",
      "caption": "View west towards the mainland. The view is across Mersea Fleet and Thorn Fleet beyond. Mersea Island, located off the coast to the SE of Colchester, is the most easterly inhabited island in Great Britain."
    }
  ],
  "distance_km": 21.0,
  "description": "Explore the coastline of the most easterly inhabited island in the United Kingdom island on this circular walk near Colchester. The route takes you along the coastline visiting beaches, Cudmore Grove Country Park and the settlements of West Mersea and East Mersea. Look out for wildlife including Marsh harriers, watervoles, red squirrels, and numerous wintering birds. The route starts from West Mersea and passes along the Strood Channel with  lovely views over the water to Ray Island Nature Reserve and Langenhoehall Marsh.  You continue to Reeveshall Marsh where there are good views over the Pyfleet Channel to Pewit Island. The route continues to the south side of the island to Cudmore Grove Country Park. Here you can stroll along the lovely sandy beach and enjoy views across Brightlingsea Reach towards Brightlingsea. There's also marshland and grassland which is perfect for picnics. The walk then passes along the south side of the island with great views over the Mersea Flats to the Blackwater Estuary. The final section takes you along the coast through West Mersea to the finish point. If you'd like to extend your walking in the area then you could head north to the lovely Abberton Reservoir. The reservoir is excellent for bird watching with thousands of wildlfowl to look out for on the water. Our Blackwater Estuary Walk starts from nearby Maldon and runs to the Tollesbury Wick Nature Reserve.",
  "video_url": "https://www.youtube.com/embed/vL4o0vUlkxI",
  "postcode": "CO5 8PB",
  "district": "West Mersea",
  "county": "Essex",
  "region": "Eastern",
  "country": "England"
}