{
  "created_at": "2025-01-05T23:35:06.318090+00:00",
  "objectID": "8840633459e698da96abdcb6478281dd",
  "ref": "tutbury-walking-route",
  "title": "Tutbury Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Weir_on_the_Dove_above_Tutbury_-_geograph.org.uk_-_934259.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8840633459e698da96abdcb6478281dd.gpx",
  "_geoloc": {
    "lat": 52.8617925008,
    "lng": -1.6855535922
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Weir_on_the_Dove_above_Tutbury_-_geograph.org.uk_-_934259.jpg",
      "title": "Jerry Evans / Weir on the Dove above Tutbury",
      "caption": "Weir on the Dove above the village. A mill fleam leads off above the weir towards Tutbury village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Tutbury_Castle_-_geograph.org.uk_-_76951.jpg",
      "title": "Simon Johnson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Tutbury Castle. The site dates from the Norman period. People who have stayed in the castle include Eleanor of Aquitaine and Mary, Queen of Scots, who was a prisoner there. By the late sixteenth century the fabric of the castle began to decay, although James I stayed there a number of times between 1619 and 1624. It was then damaged during the English Civil War. When the Parliament seized control of the castle, they ordered the fortification to be destroyed; demolition work being carried out from 1647 to 1648. The castle often holds spectacular themed events including Vikings, Knights in Armour 1940s and Fairytale weekends."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Sluices_by_the_River_Dove_-_geograph.org.uk_-_934278.jpg",
      "title": "Jerry Evans / Sluices by the River Dove",
      "caption": "Sluices by the River Dove. These sluices are at the start of the mill fleam just above the weir."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/High_Street%2C_Tutbury_-_geograph.org.uk_-_1339861.jpg",
      "title": "Colin Smith / High Street, Tutbury",
      "caption": "High Street, Tutbury"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Tutbury_Castle_moat_%28geograph_3472768%29.jpg",
      "title": "Richard Croft / Tutbury Castle moat",
      "caption": "Tutbury Castle moat"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Tutbury_-_Ye_Olde_Dog_%26_Partridge.jpg/512px-Tutbury_-_Ye_Olde_Dog_%26_Partridge.jpg",
      "title": "Dave Bevis / Tutbury - Ye Olde Dog & Partridge",
      "caption": "Ye Olde Dog & Partridge in the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Mill_and_Mill_House%2C_Tutbury.jpg/512px-Mill_and_Mill_House%2C_Tutbury.jpg",
      "title": "Alan Murray-Rust / Tutbury Corn Mill and house",
      "caption": "Mill and Mill House, Tutbury"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Fauld_Industrial_Estate_From_Stonepit_Hills_-_geograph.org.uk_-_1613976.jpg",
      "title": "Geoff Pick / Fauld Industrial Estate From Stonepit Hills",
      "caption": "Fauld Industrial Estate. From Stonepit Hills. Tutbury Castle can be seen in the distance."
    }
  ],
  "distance_km": 2.6,
  "description": "This pretty Staffordshire village sits in a lovely position next to the River Dove and the border with Derbyshire in the National Forest. This short circular walk around Tutbury visits the mill and castle in the village. The walk starts at the Tutbury Mill car park just to the north of the village near Tutbury Bridge on the River Dove. From here you can pick up a footpath heading west along the Mill Fleam to a weir. Here you head south and then east to visit the historic Tutbury Castle. Here you'll find the photogenic ruins of the medieval castle surrounded by a lovely Tudor garden. You can explore the ruins from where there are great views over the Derbyshire hills from its elevated position above the Dove. The route then heads through the village where there are some splendid old half timbered buildings.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The historic Dog and Partridge is a good choice for some post walk refreshment. The ancient pub has a typical Tudor first floor overhang and black and white half-timbered frame. They serve good quality food and also have a pretty Secret Garden to investigate. You can find them on the High Street at postcode DE13 9LS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trails make for a pleasant dog walk and the pub mentioned above is also dog friendly. You are requested to keep them on leads around Tutbury Castle. There is a tap at the front of the patio area at the castle if you need water for your dog, but they recommend that you bring your own water bowl."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The village is located near to Burton Upon Trent where you can visit the pretty lakes at Branston Water Park and the lovely Stapenhill Viaduct on the River Trent. The neighbouring village of Willington is just to the east. Here you can visit the Gravel Pits Nature Reserve and the Mercia Marina. The site is notable as the largest marina in the UK. The Rolleston on Dove Walk starts from the neighbouring village which lies just to the south. The historic settlement includes a noteworthy 12th century church and a 16th century pub. For more walking ideas in the area see the Staffordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nPZI1SmIkfU",
  "district": "East Staffordshire",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "A50, Tutbury, East Staffordshire, Staffordshire, England, DE13 9LW, United Kingdom",
  "postcode": "DE13 9LW",
  "state": "England"
}