{
  "objectID": "88a3381c7683ccc666b0fc10583f09f2",
  "created_at": "2024-12-18T09:59:14.533972+00:00",
  "ref": "melton-country-park-walking-and-cycle-route",
  "title": "Melton Mowbray Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/de/Melton_Country_Park_-_geograph.org.uk_-_32354.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/DCA17AA1ACD06AD980257CCE002E792A/$FILE/Melton Country Park.gpx",
  "_geoloc": {
    "lat": 52.7771600462,
    "lng": -0.8795640619
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Melton_Country_Park_-_geograph.org.uk_-_32354.jpg",
      "title": "Kate Jewell / Melton Country Park",
      "caption": "Melton Country Park. This view was taken from the top of the dam that creates the lake from the Scalford Brook. This, in turn, flows into the River Eye. The lake design is part of the flood management system for Melton Mowbray."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Overflow_pond_in_Melton_Country_Park_-_geograph.org.uk_-_32367.jpg",
      "title": "Kate Jewell / Overflow pond in Melton Country Park",
      "caption": "Overflow pond in Melton Country Park. Taken from the top of the dam looking south west. The main lake discharges into this pond which in turn overflows over a sluice centre left. Note the proximity of the housing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Picnic_field_-_Melton_Country_Park_-_geograph.org.uk_-_1278699.jpg",
      "title": "Kate Jewell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Picnic field. The park was recently short listed, along with 25 other locations nationwide, as one of the most romantic places in the country to have a picnic. There are several picnic tables dotted around the whole of the site. These are on the edge of a field between the Wymondham Way car park and the large main lake. Note the evidence of the Saxon/medieval ridge and furrow strip farming towards the right of the field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Stepping_stones%2C_Melton_Country_Park_-_geograph.org.uk_-_1278613.jpg",
      "title": "Kate Jewell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stepping stones, Melton Country Park. View of the stepping stones and wooden footbridge between the small top lake and the large middle lake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/The_main_lake_-_Melton_Country_Park_-_geograph.org.uk_-_1278790.jpg",
      "title": "Kate Jewell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "The main lake. Taken from the dam that forms the main part of the flood defence system that protects Melton Mowbray from the flood prone Scalford Brook. Major flooding of Scalford Brook in 1947, 1969 and 1975 seriously affected industrial and residential properties in the town. As a result a detailed feasibility study, commissioned to investigate the options available to alleviate the problem, it was decided to construct an embankment to impound any flood waters from the Brook. The dam was built in 1989 \u0096- 1990, and the Country Park was opened shortly after its completion to take advantage of the new wetland habitat and the surrounding woodland and open spaces."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/By_the_weir_-_Melton_Country_Park_-_geograph.org.uk_-_1278629.jpg",
      "title": "Kate Jewell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "By the weir. There are three lakes in total, a small upper lake controlled by a weir, this main lake whose water level is controlled by the dam and a sluice, and the lower lake whose level is also controlled by a sluice which allows a controlled volume of water flow down the Scalford Brook, into the River Eye and thence to the River Wreake."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Bridge_and_weir_-_Melton_Country_Park_-_geograph.org.uk_-_1278543.jpg",
      "title": "Kate Jewell [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bridge and weir. The weir, to the right of the bridge, separates the small top lake from the main large central lake in the park. This system of water holding lakes was constructed in 1989-1990 to alleviate the flooding in the town caused by the ingress of storm water to the Scalford Brook."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/Visitor_Centre%2C_Melton_Country_Park_-_geograph.org.uk_-_32347.jpg",
      "title": "Kate Jewell / Visitor Centre, Melton Country Park",
      "caption": "Visitor Centre, Melton Country Park. This country park is right next door to a large modern housing estate on the north side of Melton Mowbray"
    }
  ],
  "distance_km": 2.0,
  "description": "Explore 137 acres of open space in Melton Mowbray. The park has nice footpaths and lots of water features with ponds, lakes and weirs to enjoy. There's also a peaceful woodland walk and some stepping stones between the small top lake and the large middle lake. Dotted around the park are plenty of picnic tables where you can relax next to the water. There's other good facilites with a visitor centre, play areas and a cafe for refreshments after your exercise. The long distance Jubilee Way (Leics) runs through the park so it's easy to extend your walking in the area. You can follow the trail north along the Scalford Brook to Scalford where you can pick up the Mowbray Way . This will take you east to Buckminster, through some attractive farmland scenery. A few miles to the south of the town you can visit Burrough Hill Country Park . There's fabulous views over the Leicestershire countryside to enjoy here.",
  "video_url": "https://www.youtube.com/embed/U7lJztuNdkc",
  "postcode": "LE13 1PF",
  "district": "Melton Mowbray",
  "county": "Leicestershire",
  "region": "East Midlands",
  "country": "England"
}