{
  "created_at": "2025-01-06T02:56:39.694600+00:00",
  "objectID": "88c4ff9b091096382136f8b4a32877b3",
  "ref": "stockport-walking-route",
  "title": "Stockport Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8c/The_Plaza%2C_Stockport_%28geograph_3195983%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/88c4ff9b091096382136f8b4a32877b3.gpx",
  "_geoloc": {
    "lat": 53.4083951677,
    "lng": -2.1642643404
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8c/The_Plaza%2C_Stockport_%28geograph_3195983%29.jpg",
      "title": "Ian S / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "The Plaza, Stockport. A wonderful art deco cinema in the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/River_Mersey_-_geograph.org.uk_-_1135607.jpg",
      "title": "Gerald England / River Mersey",
      "caption": "Source of the River Mersey in Stockport. The River Mersey flowing past the Bus Station and a new office block towards the Stockport Viaduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Trans_Pennine_Trail_-_geograph.org.uk_-_1269508.jpg",
      "title": "Gerald England / Trans Pennine Trail",
      "caption": "Trans Pennine Trail. Footpath alongside the River Mersey and the Acorn Business Centre, part of the Trans Pennine Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/River_Mersey%2C_Stockport_-_geograph.org.uk_-_56727.jpg",
      "title": "Keith Williamson / River Mersey, Stockport",
      "caption": "River Mersey. Looking downstream from close to King's Valley, Stockport, not far from where the Rivers Tame and Goyt joined to form the Mersey near Stockport town centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Weir_on_the_River_Mersey_-_geograph.org.uk_-_56715.jpg",
      "title": "Keith Williamson / Weir on the River Mersey",
      "caption": "Weir on the River Mersey. Looking up stream by the site of a former Bleach Works, now a business park. Heaton Mersey"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/River_Mersey_near_Parrs_Wood_-_geograph.org.uk_-_730708.jpg",
      "title": "Peter Fuller / River Mersey near Parrs Wood",
      "caption": "River Mersey near Parrs Wood. This man made section of the River Mersey is constricted between levees to stop the annual flooding on this floodplain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/The_Old_Parsonage%2C_Didsbury_-_geograph.org.uk_-_253356.jpg",
      "title": "Keith Williamson / The Old Parsonage, Didsbury",
      "caption": "The Old Parsonage, Didsbury. The former home of Alderman Fletcher Moss who gave this building and surrounding land to the City of Manchester in 1914."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8b/Fletcher_Moss_Gardens_-_geograph.org.uk_-_253355.jpg",
      "title": "Keith Williamson / Fletcher Moss Gardens",
      "caption": "Fletcher Moss Gardens. A view of the gardens looking towards the tennis courts."
    }
  ],
  "distance_km": 7.0,
  "description": "The town of Stockport is located to the south of Manchester. There's some nice riverside trails along the rivers that run through the town. There's also some good local parks with surfaced footpaths to try. This walk takes you west from the town along the River Mersey to East Didsbury where you can visit the lovely botanic gardens at Fletcher Moss Park. The walk starts in the town centre next to the bus station where you can pick up the Trans Pennine Trail. Follow the waymarked trail west and it will soon bring you to the River Mersey where you can pick up a footpath running alongside the river. Continue west and the path will take you to Cheadle Bridge and East Didsbury passing a riverside farm and the Mersey Vale Nature Park on the way. There's some interesting flora and fauna here and a picturesque spot by the rushing weir. At the Didsbury golf club you leave the river. Head north and it will take you to Fletcher Moss Park where there is a botanic garden with a fine display of flowers and a little waterfall. Also near here is Parsonage gardens where you will find several large yew trees and pretty flower beds. After exploring the gardens you can return to Stockport on the same paths or catch the train/bus back from East Didsbury.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Arden Arms is a good choice for some post walk refreshments in Stockport. The 200 year old pub has a fine selection of ales and is one of CAMRA’s most listed pubs. They have a cosy interior with real fires and good home cooked food. Outside there's a good sized garden area if the weather is fine. It's located in a nice spot next to the marketplace at postcode SK1 2LX for your sat navs. At the end of the route Ye Olde Cock Inn and the Didsbury pub are located next to Fletcher Moss park. They both have a good menu and outdoor seating for finer weather."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head east from the town centre and you can visit the pretty Vernon and Woodbank Park. There's nice trails here taking you around the parkland and gardens with views towards the Peak District hills from the high points. You can also pick up the Midshires Way here and enjoy a riverside stroll along the River Goyt. If you continue west along the river then you could visit Wythenshawe Park where there's an old hall and a community farm. For more walking ideas in the area see the Greater Manchester Walks page."
    }
  ],
  "district": "Stockport",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}