{
  "created_at": "2025-01-06T02:19:49.334272+00:00",
  "objectID": "88f969d59095dd337bee48ace9785072",
  "ref": "porth-wen-brickworks-walking-route",
  "title": "Porth Wen Brickworks Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Kilns_and_chimneys_at_Porth_Wen_brickworks_-_geograph.org.uk_-_1121394.jpg",
  "nearby": [
    {
      "description": "Anglesey Coast Path",
      "objectID": "dfc85c31d62e609f13eea74ca40f670f",
      "ref": "anglesey-coast-path-walking-route"
    },
    {
      "description": "Cemaes Bay",
      "objectID": "fd572418a82996316505f8cf1e79aa93",
      "ref": "cemaes-bay-walking-route"
    },
    {
      "description": "Bull Bay",
      "objectID": "4d1fec28506734db2271e1612e517c17",
      "ref": "bull-bay-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/88f969d59095dd337bee48ace9785072.gpx",
  "_geoloc": {
    "lat": 53.4210693658,
    "lng": -4.4117045529
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Kilns_and_chimneys_at_Porth_Wen_brickworks_-_geograph.org.uk_-_1121394.jpg",
      "title": "Eric Jones / Kilns and chimneys at Porth Wen brickworks",
      "caption": "Kilns and chimneys at Porth Wen brickworks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Natural_Arch_at_Porth_Wen_Brickworks_-_geograph.org.uk_-_1072212.jpg",
      "title": "Richard Mawdsley / Natural Arch at Porth Wen Brickworks",
      "caption": "Natural Arch at the site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/The_quartzite_quarries_associated_with_the_Porth_Wen_brickworks_-_geograph.org.uk_-_1100885.jpg",
      "title": "Eric Jones / The quartzite quarries associated with the Porth Wen brickworks",
      "caption": "The quartzite quarries associated with the Porth Wen brickworks Quartzite, a metamorphic form of sandstone, was quarried to provide the raw materials for the making of hard bricks for use in steel furnaces. The first quarries were those immediately behind the works. Later the outcrops on Graig Wen hill were exploited with the quarried rock being transferred to the brick factory down an incline plane. Bunkers built against the cliff were used to store the quarried rock."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/The_eastern_shore_of_Porth_Wen_from_above_the_brickworks_-_geograph.org.uk_-_1101462.jpg",
      "title": "Eric Jones / The eastern shore of Porth Wen from above the brickworks",
      "caption": "The eastern shore of Porth Wen from above the brickworks"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/The_kilns_and_storage_bins_of_the_Porth_Wen_brickworks_-_geograph.org.uk_-_1121404.jpg",
      "title": "Eric Jones / The kilns and storage bins of the Porth Wen brickworks",
      "caption": "The kilns and storage bins of the Porth Wen brickworks The quartzite was brought down by incline from the Graig Wen Quarry seen in the background. It was then crushed and pulverised by crushers at various levels and stored in the bins before being used to manufacture bricks and tiles. These were then \"fired\" in the kilns."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Porth_Llanlleiana_from_Dinas_Gynfor_-_geograph.org.uk_-_1110000.jpg",
      "title": "Eric Jones / Porth Llanlleiana from Dinas Gynfor",
      "caption": "Porth Llanlleiana from Dinas Gynfor The cove was used for exporting high quality kaolin clay quarried in the so called \"porcelain quartz quarries\" of Dinas Gynfor and refined at the clay processing plant at the head of the bay. The coastal path to Llanbadrig can be seen beyond the cove."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Llanlleiana_porcelain_works_-_geograph.org.uk_-_1496315.jpg",
      "title": "Dave Croker / Llanlleiana porcelain works",
      "caption": "Llanlleiana porcelain works. Between Porth Wen and Cemaes Bay are the remains of Llanlleiana porcelain works which is situated at the most northerly point in Wales."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/The_beach_at_the_head_of_Porth_Llanlleiana_from_Dinas_Gynfor_-_geograph.org.uk_-_1111864.jpg",
      "title": "Eric Jones / The beach at the head of Porth Llanlleiana from Dinas Gynfor",
      "caption": "The beach at the head of Porth Llanlleiana from Dinas Gynfor The beach is accessed from Dinas Gynfor hill by means of a zig-zag path."
    }
  ],
  "distance_km": 4.0,
  "description": "This circular walk on Anglesey visits the Porth Wen Brickworks before heading to the nearby Dinas Gynfor coastal hillfort and Llanlleiana Porcelain Works. It's an interesting area with fascinating history and wonderful coastal views. The route runs for just under 3 miles with some small hill climbs on the way. It uses a mixture of public footpaths and quiet country lanes. There's also a section along the Anglesey Coast Path which runs through the area. You can start the walk from the road just to the west of the site where there is some roadside parking. From here you can pick up footpaths up to the brickworks. The scheduled ancient monument consists of a disused Victorian brickworks which produced fire bricks, made from quartzite (silica) used to line steel-making furnaces. The remains include a number of buildings and some of the machinery. It's a photgoenic spot with the coastal scenery making a wonderful backdrop to the old buildings. After exploring the site you can pick up the coast path and follow it west to Hell's Mouth or Porth Cynfor and the hill fort of Dinas Gynfor. From the elevated position of the fort there are fine views down to Porth Llanlleiana and across to Middle Mouse island. Just to the south of the fort you will find Llanlleiana Porcelain Works. Here you'll find more ruined buildings, which when operational, produced porcelain from deposits of china clay found on Dinas Gynfor. After exploring the site the route heads east along the country lane passing Bryn Llewelyn before returning to the start point.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head west in Cemaes and you can enjoy refreshments at The Stag Inn. The pub is located in the village centre and has a very good menu and selection of drinks. It's dog friendly and there's also a beer garden to sit out and relax in. You can find it on the High St at postcode LL67 0EW for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area follow the coast path west to visit the beautiful Cemaes Bay. The bay is designated as an Area of Outstanding Natural Beauty which is also partly owned by the National Trust. Head east along the coast and you will come to Amlwch. The coastal town is well worth exploring with a visit to the Copper Kingdom visitor centre in Port Almwch recommended. Here you can learn all about the history of Amlwch's 18th century “Copper Rush” in a series of interesting exhibitions. The splendid Amlwch Walk will take you along the coast to the historic lighthouse and viewpoint at Point Lynas. To the west there's also the beautiful neighbouring village of Bull Bay, the most northerly village in Wales."
    }
  ],
  "video_url": "https://www.youtube.com/embed/wHek2LuoXS8\n",
  "county": "Ynys Môn / Isle of Anglesey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Llanbadrig, Cemaes, Ynys Môn / Isle of Anglesey, Cymru / Wales, LL67 0NA, United Kingdom",
  "postcode": "LL67 0NA",
  "district": "Cemaes",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "historical site",
    "hillfort",
    "industrial site"
  ],
  "facilities": [
    "car park",
    "footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}