{
  "created_at": "2025-01-06T08:37:51.197965+00:00",
  "objectID": "89e427ed61da701ed6b318b943b7e5a9",
  "ref": "pendle-hill-walking-route",
  "title": "Pendle Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/This_Way_To_Pendle_Hill_%28geograph_2134686%29.jpg/512px-This_Way_To_Pendle_Hill_%28geograph_2134686%29.jpg",
  "nearby": [
    {
      "description": "Pendle Way",
      "objectID": "37024468a65cd0e0340851a1785bfe47",
      "ref": "pendle-way-walking-route"
    },
    {
      "description": "Black Moss Reservoir",
      "objectID": "3bc77cfb53dbcbdb2e59c2b36e875e78",
      "ref": "black-moss-reservoir-walking-route"
    },
    {
      "description": "Clitheroe",
      "objectID": "247b9cab39c3a1a2667138b7c15d05ef",
      "ref": "clitheroe-walking-route"
    },
    {
      "description": "Pendle Hill Witches Walk",
      "objectID": "9f64d0c7ac22466c6a6a4b99eab09626",
      "ref": "pendle-hill-witches-walk-walking-route"
    },
    {
      "description": "Pendle Hill Walk From Sabden",
      "objectID": "d381d840a95bb1dffa99966661feff05",
      "ref": "pendle-hill-walk-from-sabden-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/89e427ed61da701ed6b318b943b7e5a9.gpx",
  "_geoloc": {
    "lat": 53.8584449656,
    "lng": -2.2709668868
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/This_Way_To_Pendle_Hill_%28geograph_2134686%29.jpg/512px-This_Way_To_Pendle_Hill_%28geograph_2134686%29.jpg",
      "title": "Alan James / This Way To Pendle Hill, via Wikimedia Commons",
      "caption": "This Way To Pendle Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/View_of_Pendle_Hill_%28geograph_3176975%29.jpg/512px-View_of_Pendle_Hill_%28geograph_3176975%29.jpg",
      "title": "Chris Heaton / View of Pendle Hill, via Wikimedia Commons",
      "caption": "View of Pendle Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/The_gentle_amble_to_the_summit_of_Pendle_-_geograph.org.uk_-_1640315.jpg",
      "title": "Bill Boaden / The gentle amble to the summit of Pendle",
      "caption": "The gentle amble to the summit of Pendle. All the steep bits are behind you here, and you can enjoy the easy walk to your destination."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Pendle_House_and_Pendle_Side_-_geograph.org.uk_-_1581333.jpg",
      "title": "Peter Barr / Pendle House and Pendle Side",
      "caption": "Pendle House and Pendle Side"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/The_trig_point_on_Pendle_-_geograph.org.uk_-_1640321.jpg",
      "title": "Bill Boaden / The trig point on Pendle",
      "caption": "The trig point at the summit. This offers 360 degree views. In this shot you can see Ingleborough, Pen y Ghent and Fountains Fell."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Barley_Moor_-_geograph.org.uk_-_144085.jpg",
      "title": "John Illingworth / Barley Moor",
      "caption": "Barley Moor. Looking north across the top end of Ogden Clough."
    }
  ],
  "distance_km": 7.5,
  "description": "This walk climbs to the summit of Pendle Hill in Lancashire. It starts in the delightful village of Barley and makes use of the Pendle Way long distance footpath to take you on a circular tour of the area. It's a steep climb but the path is pretty well defined for most of the way. From the 557 metre (1,827 ft) summit there are fabulous views over the Pennines to the east, the Bowland Fells to the northwest, and the West Pennine Moors to the south. After leaving the summit you descend to Boar Clough before enjoying two waterside stretches along the Upper and Lower Ogden Reservoirs. The path then leads you back into Barley. The area is famous for the Pendle Witch Trials. These took place in 1612 when twelve people from the area were charged with the murders of ten people by the use of witchcraft. Ten were subsequently found guilty and executed by hanging. To extend your walking in the area you could try the Pendle Hill Witches Walk. The double looped trail visits several local landmarks connected to the accused, while also exposing you to some lovely Lancashire scenery. You could also head to the nearby Black Moss Reservoir. The reservoirs are easily reached from Barley village and are a great place to see a wide variety of wildlife. There are also great views up to Pendle Hill from here. The hill is located close to the town of Clitheroe. The attractive town has a train station and makes for an alternative start point for the climb.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the Pendle Inn in Barley at postcode BB12 9JX. The friendly pub is conveniently located at the foot of the hill and also offers overnight accommodation. They do very good food and also serve a fine local beer known as the \"Pride of Pendle\"."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The hill and surrounding moorland are a great place for dog walking. Your dog will need to be in good shape though as it is quite a challenging climb. There's also some woodland trails through Fell Wood to try, just to the south of the two reservoirs. The Pendle Inn mentioned above is also dog friendly with dog treats by the fireplace."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For a challenging circular cycle ride see the Pendle Hill Cycle Route which starts and finishes at Barley and follows part of National Cycle route 91 through some pretty villages and lovely countryside surrounding the hill. The nearby village of Sabden and the Nick of Pendle are popular alternative start points for the climb. The village is located about 3 miles south west of the hill summit and has a good pub to visit afterwards. See the Pendle Hill Walk From Sabden page for more details. At the foot of the hill on the northern side you will find the noteworthy village of Downham. The village is very attractive and considered one of the prettiest in the county. There are some nice country trails to the local mills and becks to try in the area. Just a few miles north west is the pretty village of Sawley. Here you can visit the ruins of the 12th century Sawley Abbey which is run by English Heritage. The River Ribble is particularly scenic here and there's also a splendid riverside pub for post walk refreshments. Just to the west of Sawley is the neighbouring village of Waddington. The village is very pretty and a regular winner of the Lancashire Best Kept Village awards. A stroll along the Waddington Brook and through the delightful Coronation gardens is recommended here. Also in this area is the worthy village of Bolton by Bowland where there's two pretty village greens and views of the Skirden Beck. For more walking ideas in the area see the Forest of Bowland Walks page."
    }
  ],
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Avenue, Barley House Farm, Barley-with-Wheatley Booth, Barley, Pendle, Lancashire, England, BB12 9JU, United Kingdom",
  "postcode": "BB12 9JU",
  "district": "Pendle",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "3-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "water"
  ],
  "points_of_interest": [
    "historical landmarks",
    "scenery"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "train station"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}