{
  "created_at": "2025-01-06T04:41:22.145796+00:00",
  "objectID": "89f833186e54be8bf962b7ded87f2fd9",
  "ref": "the-needles-walking-route",
  "title": "The Needles Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b6/The_Needles_-_geograph.org.uk_-_697031.jpg",
  "nearby": [
    {
      "description": "Tennyson Trail",
      "objectID": "059a96d4d3f86f538f7fdb794d94589a",
      "ref": "tennyson-trail-walking-route"
    },
    {
      "description": "Isle of Wight Coast Path",
      "objectID": "4979849124ccb54d7e6cfffa6543ccb7",
      "ref": "isle-of-wight-coast-path-walking-route"
    },
    {
      "description": "Tennyson Down",
      "objectID": "c2671bc506051f86cb2f0283525b6725",
      "ref": "tennyson-down-walking-route"
    },
    {
      "description": "Alum Bay and Headon Warren",
      "objectID": "af57c712025a06390a7989dff884b0c4",
      "ref": "alum-bay-and-headon-warren-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/89f833186e54be8bf962b7ded87f2fd9.gpx",
  "_geoloc": {
    "lat": 50.667839383,
    "lng": -1.5671007781
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/The_Needles_-_geograph.org.uk_-_697031.jpg",
      "title": "Chris Gunns / The Needles",
      "caption": "The Needles. From viewpoint above Scratchell's Bay"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Old_Artillery_Pieces_at_the_Needles_Battery._-_panoramio.jpg/256px-Old_Artillery_Pieces_at_the_Needles_Battery._-_panoramio.jpg",
      "title": "grumpylumixuser / CC BY (https://creativecommons.org/licenses/by/3.0)",
      "caption": "Old Artillery Pieces at the Needles Battery. Here you'll find two military batteries built above the stacks to guard the West end of the Solent. They were constructed between 1861 and 1863 to defend against enemy ships."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Chairlift_at_The_Needles_-_geograph.org.uk_-_929165.jpg",
      "title": "John Carver / Chairlift at The Needles",
      "caption": "Chairlift at The Needles"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Coastguard_Cottages_near_the_Needles_-_geograph.org.uk_-_1414739.jpg",
      "title": "Derek Harper / Coastguard Cottages near the Needles",
      "caption": "Coastguard Cottages near the Needles. Three of these four cottages are let by the National Trust as holiday accommodation - a windswept, but dramatic spot. They are named after ships wrecked on the Needles - Varvassi, Irex and Pomone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/Scratchells_Bay_from_The_Needles_Old_Battery_-_geograph.org.uk_-_1023373.jpg",
      "title": "Graham Taylor / Scratchells Bay from The Needles Old Battery",
      "caption": "Scratchells Bay from the Old Battery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/70/Searchlight%2C_Needles_Old_Battery_-_geograph.org.uk_-_396632.jpg",
      "title": "Stephen McKay / Searchlight, Needles Old Battery",
      "caption": "Searchlight at the Old Battery. The old battery is now a National Trust property, and was originally built in 1863 to protect the Solent, and the approaches to Portsmouth, from enemy invasion; it remained in military use until the 1970s. The searchlight, approached through a tunnel built into the headland, was intended to help the gunners with nighttime illumination. The light looks directly across the Needles lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Across_Alum_Bay_-_geograph.org.uk_-_1436906.jpg",
      "title": "John Webber / Across Alum Bay",
      "caption": "Across Alum Bay. The Needles Lighthouse from the base of the Alum Chine Chairlift."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Alum_Bay%2C_Isle_of_Wight_-_geograph.org.uk_-_1727170.jpg/512px-Alum_Bay%2C_Isle_of_Wight_-_geograph.org.uk_-_1727170.jpg",
      "title": "Christine Matthews / Alum Bay, Isle of Wight",
      "caption": "Alum Bay, Isle of Wight. As seen from the cliff top walk to the Needles."
    }
  ],
  "distance_km": 3.5,
  "description": "This circular walk pays a visit to the famous chalk sea stacks on the Isle of Wight Coast. Start the walk from the Needles car park on Alum Bay New Rd, Totland Bay with a postcode of PO39 0JD for your sat navs. From the car park you can pick up footpaths heading west to the White Cliffs and The Needles. The row of three stacks of chalk rise about 30m out of the sea off the western extremity of the island. The Needles Lighthouse stands at the western end of the formation and was built in 1859. These unusual stacks were featured on the BBC Two TV programme Seven Natural Wonders (2005) as one of the wonders of Southern England. They take their name from a fourth needle-shaped pillar called Lot's Wife, which collapsed in a storm in 1764. Although the remaining three stacks do not resemble a needle the name has stuck. At the western end you'll also find the old batteries built above the stacks to guard the West end of the Solent. These are now owned by the National Trust with more information here. There's also lovely views to Alum Bay on the north side and Scratchell's Bay on the south side. You can then head east along a section of the coastal path, passing the coastguard cottages, before returning to the car park. The area is also run as a tourist attraction where you can enjoy wonderful views from the chairlift.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the batteries you will find a nice National Trust tea room where you can stop for refreshments. The tea room is in an attractive vintage style with transporting you back to the 1940s. There's excellent views over the area as the tea-room is located in the Port War Signal Station that was specifically built to give the clearest, closest views of shipping in the Solent and around the Needles."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The park is a fine place for a dog walk though you are asked to keep them on leads. They are not allowed in some of the buildings on the site though. The National Trust tea room mentioned above does have a dog friendly seating area downstairs though."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could head east and climb to Tennyson Down for fine views over the area. You'll also find the Tennyson monument here which is dedicated to the famous poet that lived in the area. He was the Poet Laureate during much of Queen Victoria's reign and wrote the famous poem \"The Charge of the Light Brigade\". You can reach the down by following the Tennyson Trail and the Isle of Wight Coast Path. These two waymarked trails are a great way of further exploring the area around The Needles. You could also head east along the coast path to visit the lovely Freshwater Bay. Here you can join with the waymarked Freshwater Way on the Yarmouth to Freshwater Bay Walk. The Alum Bay and Headon Warren Walk takes you up onto Headen Warren, just to the east of the car park. There's some lovely heather, a variety of sea birds and more wonderful views to enjoy from here. For more walking ideas in the area see the Isle of Wight Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Ez_eVBJ0cZk",
  "county": "Isle of Wight",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Alum Bay New Road, Alum Bay, Totland, Isle of Wight, England, PO39 0JD, United Kingdom",
  "postcode": "PO39 0JD",
  "district": "Totland",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal"
  ],
  "points_of_interest": [
    "viewpoint",
    "historical site"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "chairlift"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}