{
  "created_at": "2025-01-06T03:29:42.376052+00:00",
  "objectID": "8ab2569cbdea18c97d5ab3854caa7fba",
  "ref": "loch-arthur-walking-route",
  "title": "Loch Arthur Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Loch_Arthur_-_geograph.org.uk_-_209082.jpg",
  "nearby": [
    {
      "description": "Mabie Forest",
      "objectID": "788bf75ff8ea9a13d98d8688f7b98095",
      "ref": "mabie-forest-walking-and-cycle-route"
    },
    {
      "description": "Threave Gardens and Carlingwark Loch",
      "objectID": "ad3047c3938d61e95ef07a6b772f4b5b",
      "ref": "threave-gardens-and-carlingwark-loch-walking-route"
    },
    {
      "description": "Drumlanrig Castle",
      "objectID": "b51e7cabdb1ead11903de4ca26f9abdc",
      "ref": "drumlanrig-castle-walking-route"
    },
    {
      "description": "Romans and Reivers Route",
      "objectID": "5cbbbc073939c6536f0384286fa2ac8d",
      "ref": "romans-and-reivers-route-walking-route"
    },
    {
      "description": "Sandyhills To Kippford Coastal Walk",
      "objectID": "2857e34b4bba60ca15488c40a5916108",
      "ref": "sandyhills-to-kippford-coastal-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8ab2569cbdea18c97d5ab3854caa7fba.gpx",
  "_geoloc": {
    "lat": 55.0023904274,
    "lng": -3.7302598735
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Loch_Arthur_-_geograph.org.uk_-_209082.jpg",
      "title": "Lynne Kirton / Loch Arthur",
      "caption": "Set amidst beautiful scenery, Loch Arthur is part of the estate of the Loch Arthur Community, a Camphill Community."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Loch_Arthur_Creamery_-_geograph.org.uk_-_209075.jpg",
      "title": "Lynne Kirton / Loch Arthur Creamery",
      "caption": "Loch Arthur Creamery. Loch Arthur Community belongs to the Camphill Village Trust. It was established in 1984 and offers a shared way of life providing support and challenges for men and women with special needs. The Creamery provides work for some of the community members, who produce award-winning cheeses, butter and yoghurts which along with farm produce and crafts are sold in the shop. There are now Camphill Communities in more than 20 countries. The first community was founded in 1940 at Camphill, near Aberdeen, by Karl Konig, an Austrian doctor who had come to Scotland as a refugee."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Loch_Arthur_-_geograph.org.uk_-_2382673.jpg/512px-Loch_Arthur_-_geograph.org.uk_-_2382673.jpg",
      "title": "Loch Arthur by Pete Saunders, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Loch Arthur"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Loch_Arthur_-_geograph.org.uk_-_266265.jpg",
      "title": "Iain Thompson / Loch Arthur",
      "caption": "Loch Arthur"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Footpath_at_Loch_Arthur_-_geograph.org.uk_-_2174145.jpg/256px-Footpath_at_Loch_Arthur_-_geograph.org.uk_-_2174145.jpg",
      "title": "Footpath at Loch Arthur by Colin Kinnear, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath at Loch Arthur"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Loch_Arthur_Creamery_at_Beeswing_-_geograph.org.uk_-_1806880.jpg/512px-Loch_Arthur_Creamery_at_Beeswing_-_geograph.org.uk_-_1806880.jpg",
      "title": "Loch Arthur Creamery at Beeswing by Ian Greig, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Loch Arthur Creamery at Beeswing"
    }
  ],
  "distance_km": 1.8,
  "description": "This walk visits the Loch Arthur Community in Beeswing, Dumfries. The picturesque loch has been claimed as the setting for the Arthurian story of the Lady of the Lake. The community includes eleven houses in which more than 75 people live, including about twenty-eight people in supported tenancies. Here people with learning disabilities live alongside volunteers in a way that 'recognises the dignity and uniqueness of each human being and does not distinguish between those who are called disabled and those who are not'. There is a farm, a large garden, a creamery, a bakery, craft workshops and a thriving farm shop and cafe. You can explore the farm and creamery before following a path east to visit the loch.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east you can explore the expansive Mabie Forest where there are miles of cycling and walking trails to try. The RSPB site at Loch Ken is a few miles to the west. There's lots of wildlife to look out for around this pretty site. Also to the west is Threave Gardens and Carlingwark Loch near Castle Douglas. The Rockcliffe to Kippford Walk explores a beautiful area of National Trust owned land on the Rough Firth, a few miles south west of the forest. The area includes the 6th century Mote of Mark hillfort, lovely beaches and fine views across the Solway Firth. Near here there's also the Sandyhills To Kippford Coastal Walk and Dalbeattie Forest where there's an interesting mtb trail over a series of granite slabs. Head north and there's some fine trails around the Ae Forest where you can visit Loch Ettrick. The long distance Romans and Reivers Route starts in the forest. This 52 mile route follows the old Roman Roads to Hawick in the Scottish Borders. Following the trail north east will take you to Moffat where you can enjoy a riverside walk along the River Annan on the Annadale Way.Also near here is the Crichope Linn waterfall at Gatelawbridge. Here you'll find a wooded red sandstone gorge with interesting rock formations, carvings and a pretty waterfall. To the north west of the falls there's the 17th century Drumlanrig Castle. The castle is surrounded by extensive grounds with several waymarked walking paths and some challenging mountain bike trails to try. To the east there's Lochmaben where you can enjoy a lovely circular trail around Castle Loch. There's also the remains of the 12th century Lochmaben Castle to see here."
    }
  ],
  "video_url": "https://www.youtube.com/embed/OXnSsCMg9VM",
  "county": "Dumfries and Galloway",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}