{
  "created_at": "2025-01-06T01:01:41.583393+00:00",
  "objectID": "8af34abb4d9976c4dfecd1ff72288ae7",
  "ref": "three-shires-head-walking-route",
  "title": "Three Shires Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Three_Shires_Head_-_geograph.org.uk_-_491.jpg",
  "nearby": [
    {
      "description": "Poole's Cavern and Buxton Country Park",
      "objectID": "ebf0685cb2220d0779925bc2eb5b034a",
      "ref": "pooles-cavern-and-buxton-country-park-walking-route"
    },
    {
      "description": "The Roaches",
      "objectID": "194625dc6c0829f6ced66369d74d3b1a",
      "ref": "the-roaches-walking-route"
    },
    {
      "description": "Lud's Church",
      "objectID": "9bac060ba17e107bdca38060132daa54",
      "ref": "luds-church-walking-route"
    },
    {
      "description": "Dane Valley Way",
      "objectID": "582095bf203f299b18ab2b96d6f2fd79",
      "ref": "dane-valley-way-walking-route"
    },
    {
      "description": "Buxton",
      "objectID": "8f661296a4e61112f48f62fcbf2dd9b6",
      "ref": "buxton-walking-route"
    },
    {
      "description": "Chrome Hill",
      "objectID": "2f6a8369ae4bf0ad49f0a37bca2cb156",
      "ref": "chrome-hill-walking-route"
    },
    {
      "description": "Axe Edge Moor",
      "objectID": "ad58fd4c1791562d9e5f7ea9852fd889",
      "ref": "axe-edge-moor-walking-route"
    },
    {
      "description": "Solomon's Temple",
      "objectID": "664f096dd7ec1d31720295c476036da2",
      "ref": "solomons-temple-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8af34abb4d9976c4dfecd1ff72288ae7.gpx",
  "_geoloc": {
    "lat": 53.1929151834,
    "lng": -2.002242394
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Three_Shires_Head_-_geograph.org.uk_-_491.jpg",
      "title": "Deego / Three Shires Head",
      "caption": "The River Dane at Three Shire Heads, where the Derbyshire, Cheshire and Staffordshire boundaries meet. This is a frequently photographed scene and often appears on calendars and postcards."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Three_Shires_Head_Bridge_-_geograph.org.uk_-_750377.jpg",
      "title": "Raymond Knapman / Three Shires Head Bridge",
      "caption": "Three Shires Head Bridge. View North up the Valley. Taken in the spring of 2008. The surrounding moorland is a great place for spotting moths and butterflies in the warmer months. The bridge is evidence that this was a historic route used by silk traders from nearby Flash and Hollinsclough to the mills at Macclesfield."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Small_cascade_at_Three_Shires_Head_-_geograph.org.uk_-_310662.jpg",
      "title": "Joan Priestley / Small cascade at Three Shires Head",
      "caption": "Small cascade at the site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/12/Three_Shires_Head_-_geograph.org.uk_-_1094315.jpg",
      "title": "Mark Derbyshire / Three Shires Head",
      "caption": "Beautiful shot of the waterfalls on Christmas day 2008. Swimmers often enjoy the main pool though the water is nearly always cold."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Lovelane_Bridge%2C_Peak_District_National_Park_-_geograph.org.uk_-_168362.jpg",
      "title": "Kate Jewell / Lovelane Bridge, Peak District National Park",
      "caption": "Lovelane Bridge, near the car park at the start of the walk. Cows in the pasture half way between Flash and Allgreave. The River Dane is at the bottom of the hill and there is a Scouting camp site at Manor Farm, just through the trees in the centre of the picture. There is a small chapel and a larger cottage at the bridge just out of shot to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Open_gateway_above_the_Dane_Valley_-_geograph.org.uk_-_3211055.jpg/512px-Open_gateway_above_the_Dane_Valley_-_geograph.org.uk_-_3211055.jpg",
      "title": "Open gateway above the Dane Valley by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Open gateway above the Dane Valley. View as you head north from the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/The_Dane_Valley_near_Knar_-_geograph.org.uk_-_3210989.jpg/512px-The_Dane_Valley_near_Knar_-_geograph.org.uk_-_3210989.jpg",
      "title": "The Dane Valley near Knar by Bill Boaden, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Dane Valley near Knar as you approach Three Shires Head."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/View_north_from_the_Packhorse_Bridge_-_geograph.org.uk_-_3098131.jpg",
      "title": "View north from the Packhorse Bridge by John Topping, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View north from the Packhorse Bridge"
    }
  ],
  "distance_km": 6.0,
  "description": "Explore this beautiful section of the Dane Valley and enjoy rivers, old stone bridges and waterfalls on this lovely walk in the Peak District. Three Shires Head is a point on Axe Edge Moor where the counties of Cheshire, Derbyshire and Staffordshire meet. Here you will find a Grade II-listed packhorse bridge over the River Dane. The bridge is thought to have been constructed in the 18th century. It's a delightful area with a number of small waterfalls and the surrounding Peak District scenery to enjoy. The walk begins from a parking area in Gradbach a couple of miles south of Three Shires Head. You then follow the Dane Valley Way and other footpaths to the bridge and the river. Here you will also find Panniers Pool, a popular place for a paddle or swim in the summer months. An alternative route would be to come from Buxton and follow the Dane Valley Way across Axe Edge Moor to the bridge. This is a much longer walk but does pass through the pretty Buxton Country Park on the way. To extend your walking in the area you could visit the fascinating Lud's Church. The deep chasm is located just to the west of the start point of this walk. Just to the south you can climb to The Roaches. This elevated rocky ridge, includes fascinating rock formations and wonderful views of the surrounding countrsyide. It is one of the most popular walks in the Peak District.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In nearby Quarnford there's the noteworthy Knights' Table at the Travellers Rest. This rather unusual pub has a medieval Knights' theme running throughout (relating to the legend of Sir Gawain and the green knight). Inside you'll find open fires, exposed beams and stone paved floors complimented with new medieval style furniture and candles. Outside there's a patio with magnificent Peak District Views from the elevated position of the pub. You can find it just to the east of the site in Quarnford with a postcode of SK17 0SN for your sat navs. On the north western edge of Axe Edge Moor there's the noteworthy Cat and Fiddle Inn. It is the second-highest pub in Britain at a height of 1,689 feet (515 m). You can find it a postcode of SK11 0AR for your sat navs. To the west there's the small village of Wildboarclough where you will find The Crag Inn. The historic inn was originally a farm built in 1629 and then later converted to a beer house 1825. There's two cosy real fires indoors and a nice garden area for warmer days. They have a car park and are also dog friendly. You can find them at postcode SK11 0BD for your sat navs. The Wildboarclough valley is also very attractive with its streams, Georgian mill and beautiful countryside. You could start the walk from here and head east past Cut-thorn Hill to reach the site."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For a shorter walk you could park at the alternative parking area located in a lay-by just to the west of the site off the A54. You can then follow a footpath east for about a mile to reach the bridge. It's approximate postcode is SK11 0BQ for your sat navs. The Axe Edge Moor Walk starts from the car park at Buxton Country Park. It takes you across the expansive moorland before reaching the Head. On the way you will pass Cheeks Hill and the source of the River Dane at Dane Head. A few miles to the east you will find one of the area's most popular climbs at Chrome Hill. There's excellent views over the Dove Valley from this fine viewpoint. The Gradbach Walk starts from the car park in the little hamlet, located just south of the head. It visits Lud's Church before heading to The Roaches, Hen Cloud and Three Shires Head. It's a nice way of seeing several of the highlights of the area on one trail loop. On the way you'll also pass the picturesque Gradbach Mill on the River Dane. The 18th century mill was used to manufacture sewing silk and is an interesting reminder of the historic past of Gradbach. Today it's a Youth Hostel providing accommodation if you wish to stay over in this lovely area. The little village of Wincle is also near Gradbach. There's a fine old pub and the excellent Wincle Brewery to visit here. For more walking ideas in the area see the Peak District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/nYl_rv1lw7A",
  "postcode": "SK17 0SU",
  "county": "Staffordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Roaches Gradbach, Gradbach Mill Lane, Quarnford, Staffordshire Moorlands, Staffordshire, England, SK17 0SU, United Kingdom",
  "district": "Staffordshire Moorlands",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "3-4 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "moorland"
  ],
  "points_of_interest": [
    "historical bridge",
    "waterfalls",
    "rock formations"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "swimming"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "swimming"
  ]
}