{
  "created_at": "2025-01-06T02:15:08.361437+00:00",
  "objectID": "8b26fbc018ef6cae59b6312f539cffc5",
  "ref": "poole-walking-route",
  "title": "Poole Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Poole_Quay_-_geograph.org.uk_-_22476.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8b26fbc018ef6cae59b6312f539cffc5.gpx",
  "_geoloc": {
    "lat": 50.71246616,
    "lng": -1.99159383
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Poole_Quay_-_geograph.org.uk_-_22476.jpg",
      "title": "Malcolm Grant / Poole Quay, via Wikimedia Commons",
      "caption": "Poole Quay 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Poole_-_Poole_Quay_-_geograph.org.uk_-_573441.jpg",
      "title": "Chris Talbot / Poole - Poole Quay, via Wikimedia Commons",
      "caption": "Poole Quay 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Poole_Quay_-_geograph.org.uk_-_1447985.jpg",
      "title": "Robin Drayton / Poole Quay, via Wikimedia Commons",
      "caption": "Poole Quay. Taken from the upper deck of a ferry about to leave for Brownsea Island and showing the colourful ticket offices for the ferries"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Poole%2C_The_Baiter_-_geograph.org.uk_-_1161355.jpg",
      "title": "Mike Faherty / Poole, The Baiter, via Wikimedia Commons",
      "caption": "Poole, The Baiter"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/96/Poole_Park_-_geograph.org.uk_-_1162901.jpg",
      "title": "Nigel Mykura / Poole Park, via Wikimedia Commons",
      "caption": "This is the pavilion in Poole Park, a large recreational park with a boating lake just south of the Parkstone Rd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Poole_Park%2C_war_memorial_and_lake_-_geograph.org.uk_-_521822.jpg",
      "title": "Chris Downer / Poole Park: war memorial and lake, via Wikimedia Commons",
      "caption": "Poole Park, war memorial and lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/20/Poole%2C_Poole_Park_lake_-_geograph.org.uk_-_1430391.jpg",
      "title": "Chris Downer / Poole: Poole Park lake, via Wikimedia Commons",
      "caption": "Looking across the boating lake of Poole Park. The steeple of St. Mary's church, with the bulk of Poole Hospital alongside, are prominent in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Poole%2C_footway_across_Poole_Park_lake_-_geograph.org.uk_-_1430368.jpg/256px-Poole%2C_footway_across_Poole_Park_lake_-_geograph.org.uk_-_1430368.jpg",
      "title": "Chris Downer / Poole: footway across Poole Park lake, via Wikimedia Commons",
      "caption": "Poole, footway across Poole Park lake. This concrete footway extends for over ¼ mile into Poole Park lake, and separates the model yacht area (left) from the rest of the boating lake. It is very apparent from this view that the walkway has the effect of calming the water on the left-hand side, compared with the right. Walkers will be well advised to remain in contact with the handrail as they walk along here, and to avoid looking mainly downwards."
    }
  ],
  "distance_km": 7.0,
  "description": "This walk takes you along Poole Quay to Baiter Harbourside Park and Poole Park on the Dorset coast. There's lovely views of the famous Poole Harbour and some lovely gardens to see in Poole Park. The town is one of the gems of the Dorset coast with the second largest natural harbour in the world, beautiful beaches and fantastic scenery. It's also notable as the start point for the South West Coast Path National Trail. The walk starts at Poole Quay where you can watch the boats leave for Brownsea Island. Follow the paths east along the quay where you'll see several impressive looking yachts in the marina. The walk then enters Baiter Park where there's a large grassy area and waterside footpaths with nice views over to the island and the Purbeck Hills. The path eventually leads into the Whitecliff Harbourside Park where there are a number of football pitches. The route then doubles back to head towards Poole Park which you enter through the little tunnel on Whitecliff Road. In the park you'll pass the little model boating inclosure and follow footpaths around the large lake. The park includes a large cafe where you can enjoy refreshments in thre outdoor seating area, at what is roughly the half way point on the walk. Atfer rounding the lake a tunnel takes you under the train line to return you to Baiter where you can pick up the same coastal path to return you to the quay. To continue your walking in the Poole area, head north from the quay to Holes Bay and follow the waterside path to Upton Heath and Upton Country Park. The park has a fine old house surrounded by attractive parkland and gardens with easy footpaths to follow around the site. The epic South West Coast Path also starts in Poole. You could catch the ferry from Sandbanks and pick up the path to explore the lovely Studland Heath Nature Reserve .",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Away from the coast you could try a walk on the expansive Canford Heath. The 850 acre nature reserve has miles of heathland and woodland trails, popular with dog walkers. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3a_rM7KgKls",
  "postcode": "BH15 1HA",
  "district": "Poole",
  "county": "Bournemouth, Christchurch and Poole",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Quay, Old Town, Poole, Bournemouth, Christchurch and Poole, England, BH15 1HA, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "wheelchair accessible",
    "play area"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}