{
  "created_at": "2025-01-06T00:57:19.199847+00:00",
  "objectID": "8bcf0b16ad3ce833eadff696bd4898db",
  "ref": "pluckley-walking-route",
  "title": "Pluckley Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Gore_Court%2C_Pluckley_-_geograph.org.uk_-_1427697.jpg",
  "nearby": [
    {
      "description": "Hothfield Common",
      "objectID": "bbb6c868f40cd1183d56988b16fdead5",
      "ref": "hothfield-common-walking-route"
    },
    {
      "description": "Greensand Way",
      "objectID": "b670bcac73522667d624f8b630cdb672",
      "ref": "greensand-way-walking-route"
    },
    {
      "description": "Stour Valley Walk",
      "objectID": "ada7df515b04aaba1bd691eabe995139",
      "ref": "stour-valley-walk-walking-route"
    },
    {
      "description": "Dering Woods",
      "objectID": "18843dfa08f4ad18c002e5a340c36c12",
      "ref": "dering-woods-walking-route"
    },
    {
      "description": "Biddenden",
      "objectID": "338acbc29afa7c17f8c587d4f3b9b6ff",
      "ref": "biddenden-walking-route"
    },
    {
      "description": "Lenham",
      "objectID": "84c07a19b78159a985b0fec8145737be",
      "ref": "lenham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8bcf0b16ad3ce833eadff696bd4898db.gpx",
  "_geoloc": {
    "lat": 51.1751221589,
    "lng": 0.7527043036
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Gore_Court%2C_Pluckley_-_geograph.org.uk_-_1427697.jpg",
      "title": "David Anstiss / Gore Court, Pluckley, via Wikimedia Commons",
      "caption": "Gore Court, Pluckley Large half-timered house, as seen from footpath to Dowle Street Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Cottages_in_Pluckley_with_the_distinctive_round-headed_windows_-_geograph.org.uk_-_1290918.jpg",
      "title": "Kenneth Yarham / Cottages in Pluckley with the distinctive round-headed windows, via Wikimedia Commons",
      "caption": "Cottages in Pluckley with the distinctive round-headed windows. Sir Edward Dering who lived at the manor of Surrenden Dering in Pluckley is generally believed to have escaped from the Roundheads through a narrow, curved-topped window at the manor - a popular myth that led to the addition of 'Dering windows' to most, if not all, of the houses owned by the Dering family during the Victorian era. These cottages with the distinctive windows are located opposite the church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Countryside_south_of_Pluckley_-_geograph.org.uk_-_202824.jpg",
      "title": "David Kemp / Countryside south of Pluckley, via Wikimedia Commons",
      "caption": "Countryside south of Pluckley. Taken from the Greensand Way where it crosses a minor road at the hamlet of Lambden. The rising wooded ground is the southern escarpment of the Lower Greensand ridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Chart_Court_Oast%2C_Pluckley_Road%2C_Little_Chart%2C_Kent_-_geograph.org.uk_-_794488.jpg",
      "title": "Oast House Archive / Chart Court Oast, Pluckley Road, Little Chart, Kent, via Wikimedia Commons",
      "caption": "Chart Court Oast, Pluckley Road, Little Chart. It is said the red and green of the cowls where the racing colours of the Beatty family who owned the farm during WWII, when some oasts had their cowls painted black. The oast and neighbouring church were still hit by a doodlebug. The building is Grade II listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Hothfield_Common_-_geograph.org.uk_-_408938.jpg",
      "title": "Adam Hincks / Hothfield Common, via Wikimedia Commons",
      "caption": "Hothfield Common. Looking across the bracken and heather heathland at Hothfield Common. This Site of Special Scientific Interest (SSSI)) and Local Nature Reserve (LNR) is owned by Ashford CC while it is managed by Kent Wildlife Trust. Hothfield Common contains the last four valley bogs in Kent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Boardwalk_in_Hothfield_Common_Nature_Reserve%2C_Kent.jpg",
      "title": "David Anstiss / Boardwalk in Hothfield Bogs, via Wikimedia Commons",
      "caption": "Boardwalk in Hothfield Bogs. This wooden path leads southwards through the heathland bogs towards Foxenhill Toll."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Bridleway_past_Benacre_Wood_-_geograph.org.uk_-_1426423.jpg",
      "title": "David Anstiss / Bridleway past Benacre Wood, via Wikimedia Commons",
      "caption": "Bridleway past Benacre Wood. This bridleway leads from Dowle Street past Knight's Wood to Rooting Manor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Stile_opposite_Benacre_Wood_-_geograph.org.uk_-_1605462.jpg",
      "title": "David Anstiss / Stile opposite Benacre Wood, via Wikimedia Commons",
      "caption": "Stile opposite Benacre Wood Seen on the Stour Valley Walk (long distance walk) on a byway to West Street, from Jobs Lane."
    }
  ],
  "distance_km": 13.0,
  "description": "Explore the countryside associated with the 'Darling Buds of May' on this walk around the village of Pluckley. The village is also well known as 'The most haunted village in England' due to paranormal activity in nearby \"Screaming Wood\". This circular walk uses the Greensand Way and the Stour Valley Walk to create a circular walk from the village. It passes the train station on the way so you also start from there if you prefer. The route first heads east along the waymarked Greensand Way to Walnut Tree Farm and the village of Little Chart where there's pretty mill ponds and an old ruined church. The route continues east to Codham Wood and the Hothfield Common Nature Reserve. The common contains Kent's last four valley bogs and one of its few remaining fragments of open heath with patches of acid grassland. The site also includes interesting flora with pretty heather, common gorse and heath spotted-orchid. After passing through the common the route continues south west to Benacre Wood, before following country lanes to Pluckley Station. Here you pick up the Greensand Way and follow it north through Chambers Green to Pluckley. Just to the west of the village you can continue your walking in Dering Woods. The site is also known as \"Screaming\" wood due to reports of paranormal activity in the area. There's two waymarked trails here and lots of wildlife to look out for on the way.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you follow the Stour Valley Walk north west you could visit the nearby village of Lenham. The worthy settlement includes a pretty square and a historic high street with a number of listed buildings. There's also a Grade I listed Tithe Barn, an early 1600s pub and a notable 14th century church to investigate. For more walking ideas in the area see the Kent Downs Walks page."
    }
  ],
  "postcode": "TN27 0SJ",
  "district": "Ashford",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Smarden Road, Pluckley Thorne, Pluckley, Ashford, Kent, England, TN27 0SJ, United Kingdom",
  "state": "England"
}