{
  "objectID": "8c5c52615b5a1ff803bd6e584d2605c4",
  "created_at": "2024-12-18T10:02:33.148371+00:00",
  "ref": "loch-muick-walking-route",
  "title": "Loch Muick Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Loch_Muick_-_geograph.org.uk_-_927593.jpg",
  "nearby": [
    {
      "description": "Corrie Fee Nature Reserve",
      "objectID": "07176933b244d19bcfed6601d527033c",
      "ref": "corrie-fee-nature-reserve-walking-route"
    },
    {
      "description": "Lochnagar",
      "objectID": "7b3f7ab7e492f09103dc3c5140dbaf18",
      "ref": "lochnagar-walking-route"
    },
    {
      "description": "Balmoral Cairns Walk",
      "objectID": "e5753ace1ef30be7330a4c790a2bfccd",
      "ref": "balmoral-cairns-walking-route"
    },
    {
      "description": "Loch Callater",
      "objectID": "1bfc22498806c78a3aeff79f19d4f9ef",
      "ref": "loch-callater-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/872E42D48CABBB1480257F5700350BC3/$FILE/Loch Muick.gpx",
  "_geoloc": {
    "lat": 56.9512710815,
    "lng": -3.1396421125
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Loch_Muick_-_geograph.org.uk_-_927593.jpg",
      "title": "Tom Richardson / Loch Muick, via Wikimedia Commons",
      "caption": "Loch Muick. Taken from the estate road to Glas-allt-Shiel"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Loch_Muick_-_geograph.org.uk_-_566507.jpg",
      "title": "Ballogie / Loch Muick, via Wikimedia Commons",
      "caption": "Loch Muick. From a helicopter"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Boathouse%2C_N_end_of_Loch_Muick_-_geograph.org.uk_-_35854.jpg",
      "title": "Pete Chapman / Boathouse, N end of Loch Muick, via Wikimedia Commons",
      "caption": "Boathouse, N end of Loch Muick. A similar boathouse is sited on the E side of the loch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Loch_Muick_from_beside_Glas_Allt_Shiel_-_geograph.org.uk_-_200116.jpg",
      "title": "Iain Millar / Loch Muick from beside Glas Allt Shiel, via Wikimedia Commons",
      "caption": "From beside Glas Allt Shiel. Taken from the edge of the loch, looking generally eastwards. Loch Muick means \"Loch of the Pigs\" - an unfortunate name for such a lovely location."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Loch_Muick_-_geograph.org.uk_-_1145231.jpg",
      "title": "ronnie leask / Loch Muick, via Wikimedia Commons",
      "caption": "View looking toward the head of the loch and across to Glas-allt Shiel on Balmoral Estate. The lodge there was built by Queen Victoria in 1869 and is still used by the Royal family. Loch Muick, which is noted for its trout, is two and a half miles long by half a mile wide and has a maximum depth of 256 feet. An ancient right of way from Ballater to Glen Doll, the Capel Mounth, passes along the loch shore."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Loch_Muick_-_geograph.org.uk_-_197746.jpg",
      "title": "Scott Rimmer [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A view down the loch on a very wet day. The footpaths on the southern side of the loch were used by Depeche Mode in the first part of their video to the song \"Enjoy the Silence\"."
    }
  ],
  "distance_km": 13.0,
  "description": "Enjoy a watersidewalk around the beautiful Loch Muick on this super walk in the Cairngorms. There's a good circular track around the loch with the option of visiting the lovely Glas Allt Shiel waterfall at the western end. The route runs for about 7.5 miles with some small climbs along the way. The walk starts at the Balmoral Estate visitor centre (near the car park) and heads towards the loch on a good track. You'll cross the River Muick and pass through woodland and countryside before arriving at the loch. The lochside path then takes you to Glas-allt Shiel house, a former country retreat of Queen Victoria. Here you have the option of climbing up to see the Glas Allt Shiel waterfalls. You continue round the loch, crossing pretty burns and passing through old birch woodland as you go. It's a very picturesque area with hills surrounding the loch and a variety of wildlife too. Look out for red squirrel, red deer, oyster catchers, salmon and trout as you make your way round the loch. If you would like to extend your walking in this area then you could head a few miles south to the Corrie Fee Nature Reserve. Here you'll find more excellent walking trails, a large waterfall and rare plants and flowers. Also on the Balmoral estate is the interesting, Balmoral Cairns Walk which visits the historic castle and a series of cairns dedicated to members of the British royal family and events in their lives. The climb to Lochnagar Mountain starts from the same car park. It's a challenging hike, heading west to Meikle Pap and the 1155 metre summit of the mountain.",
  "video_url": "https://www.youtube.com/embed/aUk9RE-Ne5U",
  "county": "Aberdeenshire",
  "region": "Scotland",
  "country": "Scotland"
}