{
  "created_at": "2025-01-06T10:17:51.639055+00:00",
  "objectID": "8c84a2c5b79e42a171d638e2fa88ab46",
  "ref": "sugarloaf-mountain-walking-route",
  "title": "Sugarloaf Mountain Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/89/South_East_slope_of_Sugar_Loaf_-_geograph.org.uk_-_447525.jpg",
  "nearby": [
    {
      "description": "Brecon Beacons Way",
      "objectID": "4adcdd2b37eb2d33c13c059536b8417d",
      "ref": "brecon-beacons-way-walking-route"
    },
    {
      "description": "Skirrid Fawr",
      "objectID": "be77af88189b430cb27d68aa41deed7b",
      "ref": "skirrid-fawr-walking-route"
    },
    {
      "description": "Abergavenny Sugarloaf Walk",
      "objectID": "a5fdc9bdb08c374755affb174850db71",
      "ref": "abergavenny-sugarloaf-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8c84a2c5b79e42a171d638e2fa88ab46.gpx",
  "_geoloc": {
    "lat": 51.8434126549,
    "lng": -3.0616178796
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/South_East_slope_of_Sugar_Loaf_-_geograph.org.uk_-_447525.jpg",
      "title": "Stuart Wilding / South East slope of Sugar Loaf, via Wikimedia Commons",
      "caption": "South East slope of Sugar Loaf In the distance you can just make out Abergavenny, whilst the conical hill is Ysgyryd Fach. The pole in the foreground denotes a gas pipeline."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Sugar_Loaf_Mountain_-_geograph.org.uk_-_1538717.jpg",
      "title": "RAY JONES / Sugar Loaf Mountain, via Wikimedia Commons",
      "caption": "Sugar Loaf Mountain A very frosty Winter morning. The mountain in the back ground is the Sugar Loaf Mountain.It stands 2 miles North West of Abergavenny. It's a very prominent landmark from all directions, it is 1961 feet high, so based on that I estimate this Radiation fog is 1600 feet thick."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4c/Woodland_edge_and_Sugar_Loaf_Peak_-_geograph.org.uk_-_1125654.jpg",
      "title": "Graham Cole / Woodland edge and Sugar Loaf Peak, via Wikimedia Commons",
      "caption": "Woodland edge and Sugar Loaf Peak This is on the ridge called Deri (a Welsh name). Bracken grows thickly here in the open but enough people and animals come here to keep main paths open. The oak tree on the right is very different in form from those which grow in the woods."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/Below_Sugar_Loaf_-_geograph.org.uk_-_447535.jpg",
      "title": "Stuart Wilding / Below Sugar Loaf, via Wikimedia Commons",
      "caption": "Below Sugar Loaf. A view of the road that leads to the car park below Sugar Loaf."
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to the summit of this iconic mountain on this challenging circular walk in Monmouthshire, Wales. Sugarloaf is part of the Black Mountains range and stands at a height of 1,955 feet (596 metres). The walk starts at the car park to the south of the summit near the town of Abergavenny. You head towards the lovely oak woodland of St Mary's Vale where you will pass pretty streams and a variety of woodland wildlife. You continue on to the summit where there are fabulous views of the Severn Estuary, the Cotswolds to the east, as far as the Brecon Beacons including Pen y Fan and Corn Du to the west and the Bristol Channel to the south. There are also great views over the nearby Usk River Valley and Abergavenny. On a clear day you could also see the Shropshire Hills and Somerset. You descend towards Mynydd Llanwenarth, passing ancient medieval ditches before returning to the finish point, back at the car park. If you'd like to continue your climbing in the area then the Skirrid Fawr walk also starts in Abergavenny. You could also pick up the splendid Brecon Beacons Way which runs through the area. To start the hike from the town see our alternative Abergavenny Sugarloaf Walk which starts from the bus station in the town centre and uses an alternative path to climb to the summit.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/XYaqFOauK4c",
  "postcode": "NP7 7EU",
  "county": "Monmouthshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Pyscodlyn, Abergavenny, Monmouthshire, Cymru / Wales, NP7 7EU, United Kingdom",
  "district": "Abergavenny",
  "state": "Cymru / Wales"
}