{
  "objectID": "8c8e0416de95d6531813fb6dd0724615",
  "created_at": "2024-12-17T23:59:51.152079+00:00",
  "ref": "hardcastle-crags-walking-route",
  "title": "Hardcastle Crags Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/47/Pavilion%2C_Hardcastle_Crags_-_geograph.org.uk_-_142578.jpg",
  "nearby": [
    {
      "description": "Widdop Reservoir",
      "objectID": "cd1d1b31eda8ca3729e67a21e39b593d",
      "ref": "widdop-reservoir-walking-route"
    },
    {
      "description": "Calderdale Way",
      "objectID": "96f0b565a2bbeec9d6d8b9b6775d477b",
      "ref": "calderdale-way-walking-route"
    },
    {
      "description": "Haworth-Hebden Bridge Walk",
      "objectID": "787546feefd96e885676506f29d5e48c",
      "ref": "haworth-hebden-bridge-walk-walking-route"
    },
    {
      "description": "Hebden Bridge",
      "objectID": "032b62035ea618e8df9cc2f5e8bb5791",
      "ref": "hebden-bridge-walking-route"
    },
    {
      "description": "Rochdale Canal",
      "objectID": "9e315fd68b82273b696b35909c3a558e",
      "ref": "rochdale-canal-walking-and-cycle-route"
    },
    {
      "description": "Haworth-Hebden Bridge Walk",
      "objectID": "787546feefd96e885676506f29d5e48c",
      "ref": "haworth-hebden-bridge-walk-walking-route"
    },
    {
      "description": "Lumb Hole Falls",
      "objectID": "227e9d5bde5c0854bf935f07bcf17173",
      "ref": "lumb-hole-falls-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8c8e0416de95d6531813fb6dd0724615.gpx",
  "_geoloc": {
    "lat": 53.7594532083,
    "lng": -2.0185079533
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Pavilion%2C_Hardcastle_Crags_-_geograph.org.uk_-_142578.jpg",
      "title": "Nigel Homer / Pavilion, Hardcastle Crags",
      "caption": "Stepping Stones over the river with the Pavilion in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Weir_on_Hebden_Water%2C_Hardcastle_Crags_-_geograph.org.uk_-_437854.jpg",
      "title": "Phil Champion / Weir on Hebden Water, Hardcastle Crags",
      "caption": "Weir on Hebden Water. Upstream from Gibson Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Above_the_Woodland%2C_Hardcastle_Crags_-_geograph.org.uk_-_1492118.jpg",
      "title": "Ivan Hall / Above the Woodland,  Hardcastle Crags",
      "caption": "Above the Woodland at Hardcastle Crags. Taken from the top of the crag marked at 236m on the OS 1:25000 map. The woodland shrouded second crag can be seen to the left, with distant views towards Wadsworth Moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Hebden_Water_and_Millpond%2C_Hardcastle_Crags_-_geograph.org.uk_-_142558.jpg",
      "title": "Nigel Homer / Hebden Water and Millpond, Hardcastle Crags",
      "caption": "Hebden Water and the Millpond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Hardcastle_Crags_-_geograph.org.uk_-_835064.jpg",
      "title": "Phil Champion / Hardcastle Crags",
      "caption": "The name 'Hardcastle Crags' is used to refer to the whole of the National Trusts estate on both sides of Hebden Dale. Most visitors don't stray past Gibson Mill. The Crags themselves are to the north of that point between the main track and the Hebden Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Gibson_Mill_Visitor_Centre%2C_Hardcastle_Crags_-_geograph.org.uk_-_71519.jpg",
      "title": "Mark Anderson / Gibson Mill Visitor Centre, Hardcastle Crags",
      "caption": "Gibson Mill Visitor Centre. Looking north within the courtyard of Gibson Mill. The mill was constructed in 1805 and stood as one of the pioneering cotton mills during the Industrial Revolution. Before this era, weaving primarily occurred within individuals' homes, and the concept of a 'factory' was relatively novel. Erected by the Gibson family, proprietors of the nearby Greenwood Lee, a residence situated above Slack village, they were prominent local landowners and farmers who readily embraced emerging technologies. Initially, Gibson Mill was leased by Titus and James Gaukroger. Historical records indicate that both men and women, including children as young as ten, were employed at the mill. The weaving shed was later appended in 1840, followed by the addition of an engine shed in 1867. Gibson Mill remained engaged in cotton cloth production until 1890."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Gateway_and_Lodge%2C_Hardcastle_Crags%2C_Wadsworth_-_geograph.org.uk_-_1391281.jpg",
      "title": "Humphrey Bolton / Gateway and Lodge, Hardcastle Crags, Wadsworth",
      "caption": "Gateway and Lodge at the crags. This is the entrance to the National Trust land. The members' car park is on the left. Most of the land (87 ha) was given by the third Baron Savile in 1950.  In addition to housing Gibson Mill, the vicinity surrounding Hardcastle Crags emerged as a significant industrial site, marked by the construction of three new reservoirs to cater to the expanding town of Halifax. Situated on the moorland above Hardcastle Crags, these reservoirs were established in an especially isolated region. To transport materials and accommodate workers, a railway and a provisional settlement were erected in 1900, with workers residing there until 1908."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Storage_building_and_timber_stacks_near_Gibson_Mill%2C_Hardcastle_Crags_-_geograph.org.uk_-_835071.jpg",
      "title": "Phil Champion / Storage building and timber stacks near Gibson Mill, Hardcastle Crags",
      "caption": "Storage building and timber stacks near Gibson Mill. The 66 hectares of mixed woodland at Hardcastle Crags is managed sustainably to provide fuel for heating at Gibson Mill. This building seems to be part of that operation. By 1902, operations at Gibson Mill had come to a halt. The upper floor of the mill underwent conversion into a café, while numerous refreshment rooms were erected across the woodland. Several ex-mill workers secured employment within this burgeoning tourist centre. Starting from approximately 1894, the Pavillion eatery was managed by Lister Hollindrake, formerly a resident of the mill's attached cottages and a cotton warp dresser by trade. William Shackleton, who oversaw the restaurant on the upper floor, had also previously toiled in the mill, albeit in the capacity of an engine tender. In addition to enjoying cafés and dancing at Gibson Mill, visitors could also partake in swings and take boats out on the mill pond. By the 1920s, the annual visitor count at Hardcastle Crags exceeded 500,000. In 1929, a turbine was installed at Gibson Mill to produce electricity. Following the Second World War, a roller skating rink was set up in the weaving shed. Arnold Binns, a world champion skater, provided skating lessons there."
    }
  ],
  "distance_km": 6.0,
  "description": "Explore this beautiful wooded valley in the South Pennines on this walk around Hardcastle Crags. There are 15 miles of walking paths taking you to tumbling streams, beautiful waterfalls and the fantastic Gibson Mill. Here you will find an excellent visitor centre with interactive displays telling the history of the valley over the past 200 years. The circular walk below starts at the car park at Horse Bridge and takes you along Hebden Water on the Haworth-Hebden Bridge Walking Path. You return through the countryside on other footpaths. You can also easily reach Hardcastle Crags from the centre of the nearby town of Hebden Bridge by following the Haworth-Hebden Bridge Walk. It's a lovely riverside walk and is only about two miles from the start of the wooded valley. If you would like to continue your walk why not head up to the nearby Widdop Reservoir where you will find more waterside walking and stunning scenery. You could also try the Hebden Bridge Circular Walk which will take you on a tour of the rivers, canals and moorland hills surrounding the town.",
  "video_url": "https://www.youtube.com/embed/p4sj2I2a538",
  "postcode": "HX7 7AL",
  "region": "Yorkshire and the Humber",
  "country": "England"
}