{
  "created_at": "2025-01-06T18:42:21.014806+00:00",
  "objectID": "8c96e9e255751c046f0c5c58d39e1614",
  "ref": "killary-fjord-walking-route",
  "title": "Killary Harbour Fjord Coastal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/af/Towards_Killary_Harbour_-_geograph.org.uk_-_969025.jpg",
  "nearby": [
    {
      "description": "Kylemore Abbey",
      "objectID": "e03d92124113671d0b158b22022bce14",
      "ref": "kylemore-abbey-walking-route"
    },
    {
      "description": "Clifden Castle",
      "objectID": "e31794d84b09b03a9f04541203ceab06",
      "ref": "clifden-castle-walking-route"
    },
    {
      "description": "Croagh Patrick",
      "objectID": "b02666b8291ead44bc9cba04340a7cd4",
      "ref": "croagh-patrick-walking-route"
    },
    {
      "description": "Lough Lannagh",
      "objectID": "552152e3ff6083e7c88db9c2b8ae8d61",
      "ref": "lough-lannagh-walking-route"
    },
    {
      "description": "Galway",
      "objectID": "64cc89dbb01d337c6cf783af7cd0486c",
      "ref": "galway-walking-route"
    },
    {
      "description": "Oughterard Wind Farm Walk",
      "objectID": "4d3ab97fccf3bcdb088aceebfeb4f8ff",
      "ref": "oughterard-wind-farm-walk-walking-route"
    },
    {
      "description": "Mount Gable",
      "objectID": "cc1c4ea5665ca8e0b76cbb7aed15fadf",
      "ref": "mount-gable-walking-route"
    },
    {
      "description": "Carlingford Lough",
      "objectID": "8ac64d262ab1dec770826f32a7a29d3b",
      "ref": "carlingford-lough-and-slieve-foye-mountain-loop-walking-route"
    },
    {
      "description": "Lough Mask And Tourmakeady Waterfall",
      "objectID": "3b4703d7b56c856e322c457994cec7ce",
      "ref": "lough-mask-and-tourmakeady-waterfall-walking-route"
    },
    {
      "description": "Derrigimlagh Bog",
      "objectID": "378fc2761c962a87c04a6bee386bbdec",
      "ref": "derrigimlagh-bog-walking-route"
    },
    {
      "description": "Ballynahinch Castle",
      "objectID": "4681d14413099aee0ce02bbffe1433ee",
      "ref": "ballynahinch-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8c96e9e255751c046f0c5c58d39e1614.gpx",
  "_geoloc": {
    "lat": 53.59586,
    "lng": -9.69423
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Towards_Killary_Harbour_-_geograph.org.uk_-_969025.jpg",
      "title": "Graham Horn / Towards Killary Harbour",
      "caption": "Towards Killary Harbour. The track heads inland slightly so we lose the view down into the harbour for a short while. The bay is in the square including the building which is the operating base for the mussel fishing. The mountain in the cloud on the north side of the harbour is Mweelrea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Killary_Fjord_%281%29_-_geograph.org.uk_-_5525756.jpg/512px-Killary_Fjord_%281%29_-_geograph.org.uk_-_5525756.jpg",
      "title": "Killary Fjord [1] by Michael Dibb, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Killary Fjord. Visitors can marvel at the imposing Mweelrea, the tallest mountain in Connacht, standing at 814 metres, as well as the Maumturk Mountains and the stunning Twelve Bens. The region is renowned for some of Ireland's most spectacular landscapes."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Laghtyfahaghaun_River_-_geograph.org.uk_-_967487.jpg/256px-Laghtyfahaghaun_River_-_geograph.org.uk_-_967487.jpg",
      "title": "Graham Horn / Laghtyfahaghaun River",
      "caption": "Laghtyfahaghaun River. Looking south, this river flows down the northern slopes of the Maumturk mountains, and has gathered a fair amount of water in this wet summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Car_park_at_Leenaun_-_geograph.org.uk_-_1397667.jpg",
      "title": "Oliver Dixon / Car park at Leenaun",
      "caption": "Car park at Leenaun. A popular stopping point for tourists \"doing\" Connemara. The car park lies across the N57 road from the Wool Centre. Killary Harbour lies beyond with Ben Gorm L8665 largely covered in cloud."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Connemara%2C_Leenaun%2C_1993_-_geograph.org.uk_-_4473504.jpg/512px-Connemara%2C_Leenaun%2C_1993_-_geograph.org.uk_-_4473504.jpg",
      "title": "Connemara: Leenaun, 1993 by Ben Brooksbank, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Connemara, Leenaun. The area includes the historic Green Road that runs parallel to the fjord for about 9km. This rugged path was created as part of the famine relief efforts in the 19th century. Along the eastern side of the fjord, the sight of numerous mussel rafts jutting out from the water is a common and intriguing feature."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Leenaun_-_Bridge_over_River%2C_Dwellings%2C_Mountainside_Drainage_-_geograph.org.uk_-_3767329.jpg/512px-Leenaun_-_Bridge_over_River%2C_Dwellings%2C_Mountainside_Drainage_-_geograph.org.uk_-_3767329.jpg",
      "title": "Leenaun - Bridge over River, Dwellings, Mountainside Drainage by Joseph Mischyshyn, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Leenaun"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dd/On_the_Western_Way_-_geograph.org.uk_-_967478.jpg",
      "title": "Graham Horn / On the Western Way",
      "caption": "On the Western Way. The way continues on a gently descending track towards Leenaun, hugging the slope above Killary Harbour. The Western Way is a 250km route through County Galway and County Mayo, following minor roads, agreed private tracks and forest roads."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b8/View_from_the_Western_Way_-_geograph.org.uk_-_967468.jpg",
      "title": "Graham Horn / View from the Western Way",
      "caption": "View from the Western Way. The Western Way runs along the north slope of the Maumturk mountains, high above Killary Harbour, offering great views. The immediate foreground is mountain moorland. The wind pump belongs to an outward bound hostel (roof just visible) on the N61, just out of the square, whilst the lines of nets in the harbour are for catching mussels. The mountains to the right are the Mweelrea range."
    }
  ],
  "distance_km": 10.2,
  "description": "This walk visits Killary Fjord or Habrour in northern Connemara. There's some wonderful scenery here with the fjord flanked by the mountains of Mweelrea and Ben Gorm. The 16km long fjord is one of just three glacial fjords that exist in Ireland, the others being Lough Swilly and Carlingford Lough. The walk starts in Leenaun where there are some facilities and a car park near to the Fjord. From here you can pick up a section of the Western Way and follow it west along the water before climbing into the hills above the harbour. From here you can enjoy some wonderful views back down to the fjord and to the surrounding hills and mountains. To continue your walking in the area head south west to visit the 19th century Kylemore Abbey. The popular estate includes loughside trails, a Victorian walled garden, woodland paths and excellent views of the surrounding Twelve Bens Mountains.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The 16-kilometre-long Killary Harbour is nestled at the meeting point of counties in Ireland. Its central depth reaches between 42 to 45 metres, and it is unique in having a higher sea level outside its mouth, typical of a fjord. The fjord's course initially runs southeast from the Atlantic before turning directly east. It narrows after the Bundorragha River joins, then broadens near Leenaun, eventually narrowing again towards its end. The northern shore of Killary Harbour rises steeply, more so than the southern side. This northern side is dominated by Mweelrea, Connacht's highest mountain, towering at 814 metres, with its slopes plunging directly into the inlet. Uggool Beach is situated at its western edge. Opposite Mweelrea, to the south, are the Maumturk Mountains and the Twelve Bens. At the mouth of Killary Harbour lies Inishbarna island. The area is renowned for some of Ireland's most spectacular scenery. Killary has long been known as a fjord, sometimes touted as \"Ireland's only fjord\" or one of a few fjord-type inlets in the country. However, some scholarly discussions suggest it might be one of three glacial fjards in Ireland, alongside Lough Swilly and Carlingford Lough. This classification considers the underwater sides of the valley and the shape of its bed, as highlighted in a dedicated paper affirming Killary's status as a fjord. The landscape was sculpted by a massive glacier, carving its path from the land to the Atlantic Ocean. The Erriff River flows into Killary, along with numerous smaller rivers and streams. These include the Bunanakee River near the mouth, the Bundorragha River with its tributaries, and the Lahill River at Leenaun, among others. Notably, the Aasleagh Falls are situated on the Erriff River just above Killary. Killary Harbour supports diverse wildlife, including otters, seals, dolphins, and on rare occasions, bearded seals. It is a habitat for salmon and sea trout, which serve as food for the seals. The area is frequented by various bird species, including ducks, herons, geese, swans, and plovers. The sea-loch has also attracted naturalists for marine zoology studies, including the Irish naturalist Emily Lawless, who conducted research there in the late 19th century. Nearby, there are small settlements, including Rosroe and Leenaun. Rosroe is notable for an old building, once used by philosopher Ludwig Wittgenstein as a retreat, marked by a plaque unveiled by President Mary Robinson in 1993. The Green Road, a rough pathway created during the famine relief program, starts near Rosroe and runs for about nine kilometres towards Leenaun. It passes the remnants of the Foher hamlet and near the lost village of Uggool. Killary's economy is buoyed by tourism, with a local catamaran service being a significant employer. Aquaculture also plays a vital role, with salmon farming at Rosroe and mussel rafts commonly seen in the eastern parts of the fjord. To continue your walking in the area head to nearby Cleggan where you can catch the ferry to the beautiful Inishbofin island. There's a waymarked circular loop walk here passing rugged cliffs, a photogenic ruined fort, pretty lakes and stone beaches. Near here there's also Clare Island which you can reach from Roonagh Pier near the small town of Louisburgh. The island has strong associations with the notorious Grace O'Malley, the 'pirate queen' of the 16th century."
    }
  ],
  "video_url": "https://www.youtube.com/embed/AVck8mBi2fk?si=_s2Cp0ozgAjV1g8f",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "N59, Leenaun, Letterbrickaun ED, Conamara Municipal District, County Galway, Connacht, H91 W1W4, Éire / Ireland",
  "postcode": "H91 W1W4",
  "district": "Leenaun",
  "county": "County Galway",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "woodland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}