{
  "created_at": "2025-01-06T03:05:36.460660+00:00",
  "objectID": "8d035a6a8ff236550c9cfbea61debb20",
  "ref": "stewartby-lake-country-park-walking-and-cycle-route",
  "title": "Stewartby Lake Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Stewartby_Lake_near_Bedford_-_geograph.org.uk_-_569489.jpg/256px-Stewartby_Lake_near_Bedford_-_geograph.org.uk_-_569489.jpg",
  "nearby": [
    {
      "description": "Marston Vale Timberland Trail",
      "objectID": "bab09d02047bdd2bfb09f773a8cf6e1c",
      "ref": "marston-vale-timberland-trail-walking-route"
    },
    {
      "description": "Ampthill Park",
      "objectID": "2c0d31e85094e838683abe506b1208a8",
      "ref": "ampthill-park-walking-route"
    },
    {
      "description": "Greensand Ridge Walk",
      "objectID": "2ff60013a3fe963adfb865232091765c",
      "ref": "greensand-ridge-walk-walking-route"
    },
    {
      "description": "Flitwick",
      "objectID": "cb1cdeecae1cebfeda0946c32b595e29",
      "ref": "flitwick-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8d035a6a8ff236550c9cfbea61debb20.gpx",
  "_geoloc": {
    "lat": 52.0758878484,
    "lng": -0.5320794253
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Stewartby_Lake_near_Bedford_-_geograph.org.uk_-_569489.jpg/256px-Stewartby_Lake_near_Bedford_-_geograph.org.uk_-_569489.jpg",
      "title": "Pam Goodey / Stewartby Lake near Bedford",
      "caption": "Stewartby Lake near Bedford. Watching the Water Sports in the early evening Sunshine."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Stewartby_Village_Green_and_Pond_-_geograph.org.uk_-_352301.jpg",
      "title": "Robert Lacey / Stewartby Village Green and Pond",
      "caption": "Stewartby Village Green and Pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Sun_Setting_Over_The_Lake_At_Marston_Vale_CP_-_geograph.org.uk_-_404131.jpg",
      "title": "John Yaxley / Sun Setting Over The Lake At Marston Vale CP",
      "caption": "Sun Setting Over The Lake At Marston Vale CP"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Stewartby_Village_Hall_-_geograph.org.uk_-_767118.jpg",
      "title": "M J Richardson / Stewartby Village Hall",
      "caption": "Stewartby Village Hall. The Stewart family, from Fife, took control of the London Brick Company after the first world war and, at their largest Bedfordshire works, next to the railway line at Wootton Pillinge, they built a model village for their workers, which they called Stewartby, with schools, village halls and sports grounds."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Clay_pit_at_Stewartby_-_geograph.org.uk_-_551792.jpg",
      "title": "M J Richardson / Clay pit at Stewartby",
      "caption": "Clay pit at Stewartby. The Midland mainline railway runs through an area of clay which has been extracted for many decades to be made into bricks at the village. Clay is now being extracted by two large draglines to the east of the railway. The brick works are the other side and clay is transported to the works by a covered conveyor - crossing the mid-line of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Stewartby_brickworks_-_now_closed_-_geograph.org.uk_-_767104.jpg",
      "title": "M J Richardson / Stewartby brickworks - now closed",
      "caption": "Stewartby brickworks - now closed After centuries of brickmaking in Bedfordshire, the last bricks were made in February 2008. Modern brickmaking at Stewartby began in 1897; by 1936 the brickworks was part of the London Brick Company, and was the largest brickworks in the world, employing 2,000 and manufacturing over 500 million bricks per year. There were 135 chimneys in use in the Marston Vale, and an old photo in the Bedford Museum shows at least 30 at Stewartby. Recently there have been far fewer, and at the end only 2 kilns and 3 chimneys were in use, producing a total of 135 million bricks a year. The 4 remaining chimneys and 2 kilns are now protected by listed status. The site is closing because the sulphur dioxide emissions from the kilns breached EU and UK environmental regulations."
    }
  ],
  "distance_km": 6.5,
  "description": "Also known as Millennium Country Park, this lovely area covers over 500 acres and includes woodland, grassland, meadow, lakes and wetland habitats. There are well surfaced paths for cyclists and walkers taking you along Stewartby lake and Pillinge Lake before passing the village of Marston Moretaine. If you are on foot you can also follow the Wetlands Trail throught the nature reserve within the park. Here you will find a number of bird hides from which you can observe a variety of winged visitors. There is also an excellent visitor centre with a Lakeside Cafe bar, gift shop and bike hire. If you want to continue your walk you could follow the Marston Vale Timberland Trail which visits some of the most interesting and attractive parts of Marston Vale and runs right through the park. Stewartby Lake is located right next to Millbrook and Stewartby rail stations and about 5 miles south of Bedford.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The lakeside and parkland trails are nice ones to dog with your dog. You'll probably see other owners on a fine weekend day."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "After exploring the lake you could enjoy a stroll around the pleasant Stewartby village with its green, pond and pretty houses. It was originally built as a model village for the workers of the the London Brick Company. The brickworks were closed in 2008 due to environmental concerns. Just a couple of miles south east of the park you'll find the lovely Ampthill Park. There's some nice woodland trails here and fine views from the park's high points. There's also the historic Katherine’s Cross - a memorial to Katherine of Aragon who stayed at the former Ampthill Castle. The Greensand Ridge Walk can be picked up in the park and used to explore the surrounding countryside. Just to the south of Ampthill there's the neighbouring town of Flitwick where you'll find the Flitwick Moor Nature reserve. The Site of Special Scientific Interest is the largest area of wetland in Bedfordshire. The village is also worth exploring with a medieval church and the Georgian Flitwick Manor, which is Grade II listed. For more walking ideas in the area see the Bedfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ftzj3pbh9EQ",
  "postcode": "MK43 9LY",
  "county": "Bedford",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Green Lane, Wootton Pillinge, Stewartby, Bedford, England, MK43 9LY, United Kingdom",
  "district": "Stewartby",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "lake",
    "grassland"
  ],
  "points_of_interest": [
    "nature reserve",
    "bird watching"
  ],
  "facilities": [
    "visitor center",
    "cafe",
    "gift shop",
    "bike hire"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}