{
  "objectID": "8d1fa29eb12106f1a28f36927c763597",
  "created_at": "2024-12-19T14:34:59.559913+00:00",
  "ref": "baggy-point-walking-route",
  "title": "Baggy Point Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/71/Baggy_Point_-_geograph.org.uk_-_1354309.jpg",
  "nearby": [
    {
      "description": "Braunton Burrows",
      "objectID": "17e5abdc31a8d59aa9275dbfd2689bf4",
      "ref": "braunton-burrows-walking-route"
    },
    {
      "description": "Crow Point",
      "objectID": "20fe9c1e1fef97901d82f85d57a8e12e",
      "ref": "crow-point-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8d1fa29eb12106f1a28f36927c763597.gpx",
  "_geoloc": {
    "lat": 51.134589725,
    "lng": -4.2412552225
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Baggy_Point_-_geograph.org.uk_-_1354309.jpg",
      "title": "Philip Halling / Baggy Point, via Wikimedia Commons",
      "caption": "Slabs of lime stone rising from the sea at Baggy Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Baggy_Point_-_geograph.org.uk_-_1473056.jpg",
      "title": "Barrie Cann / Baggy Point, via Wikimedia Commons",
      "caption": "Baggy Point Cliff, on the point between Croyde Beach and Putsboro / Woolacombe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Georgeham%2C_Baggy_Point_-_geograph.org.uk_-_514161.jpg",
      "title": "Martin Bodman / Georgeham: Baggy Point, via Wikimedia Commons",
      "caption": "Georgeham: Baggy Point. Looking west with Lundy on the horizon. Seen from the South West Coast Path"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Footpath_at_Baggy_Point_-_geograph.org.uk_-_301836.jpg",
      "title": "Tony Atkin / Footpath at Baggy Point, via Wikimedia Commons",
      "caption": "This footpath seems to be quite accessible to pushchairs - although it pays to be a careful driver!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Footpath_from_Baggy_Point_-_geograph.org.uk_-_1758207.jpg",
      "title": "Jonathan Billinger / Footpath from Baggy Point, via Wikimedia Commons",
      "caption": "Footpath from Baggy Point.  Looking inland towards Middleborough Hill with Croyde Bay to the right. The official SW Coast Path follows the coast lower down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Slab_Cove%2C_Baggy_Point_-_geograph.org.uk_-_560085.jpg",
      "title": "David Medcalf / Slab Cove, Baggy Point, via Wikimedia Commons",
      "caption": "Slab Cove is in the foreground, with Promontory Slab mostly in sunlight beyond. Morte Point is visible in the distance."
    }
  ],
  "distance_km": 7.5,
  "description": "This popular walk in the North Devon AONB visits Baggy Point, a dramatic headland with wonderful coastal views over the beautiful Croyde Bay. The circular walk runs for just over 4 miles with some moderate climbs along the waymarked, cliff top path. The area around Baggy Point is covered in interesting plants including various wildflowers, yellow gorse, lichens and moss. It's also great for wildlife with birds including herring gull, fulmar, shag, cormorant and peregrine. You can head off the path to some rock pools where you may see seals in the summer. The area around Baggy Point is designated a Site of Special Scientific Interest (SSSI) for its interesting geological features. This circular walk starts from the National Trust car park at Croyde Bay. You then head along the coast path to Baggy Point with great views over Croyde Bay and Morte Bay with Lundy Island to the west on a clear day. You can then continue round the headland towards Puttsborough, before following footpaths through the countryside back to the car park. If you'd like to extend your walk then you could head south along the coast to the nearby Braunton Burrows Nature Reserve and Crow Point. The reserve covers nearly 900 hectares making it the second largest dune system in England. Alternatively you could head north along the beautiful Woolacombe Sands, voted Britain's Best Beach in 2015 by TripAdvisor. A walk through the sand dunes of Woolacombe Warren will take you to the village where there are plenty of nice places to eat. Just beyond Woolacombe there are the interesting rock formations at Morte Point and the photogenic Bull Point Lighthouse to visit.",
  "video_url": "https://www.youtube.com/embed/GluK5uoibO4",
  "district": "Croyde Bay",
  "county": "Devon",
  "region": "South West",
  "country": "England"
}