{
  "created_at": "2025-01-06T02:34:40.269731+00:00",
  "objectID": "8d6e933a9037c70a0970979bf60b9774",
  "ref": "long-eaton-walking-route",
  "title": "Long Eaton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Long_Eaton_Town_Hall_garden_-_geograph.org.uk_-_751796.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8d6e933a9037c70a0970979bf60b9774.gpx",
  "_geoloc": {
    "lat": 52.8999287635,
    "lng": -1.2749332652
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Long_Eaton_Town_Hall_garden_-_geograph.org.uk_-_751796.jpg",
      "title": "David Lally / Long Eaton Town Hall garden",
      "caption": "Long Eaton Town Hall garden"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Erewash_Canal%2C_Long_Eaton_-_geograph.org.uk_-_930695.jpg",
      "title": "Oxymoron / Erewash Canal, Long Eaton",
      "caption": "Erewash Canal, Long Eaton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/River_Trent%2C_Trent_Lock_-_geograph.org.uk_-_762297.jpg",
      "title": "Stephen McKay / River Trent, Trent Lock",
      "caption": "River Trent, Trent Lock. Looking upstream; the bridge marks the start of the Erewash Canal which will take boaters almost 12 miles up the Erewash Valley to Langley Mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f8/Bridge_Mills%2C_Long_Eaton_-_geograph.org.uk_-_1294020.jpg",
      "title": "David Lally / Bridge Mills, Long Eaton",
      "caption": "Bridge Mills, Long Eaton. In 2007 the conservation area which covers the major remaining lace mills of Long Eaton was extended. The appraisal document for this prepared in October 2005 by Sue Blakeley describes this mill thus: \"This collection of buildings is the most complete as a group as the various sheds survive on this site alongside the main factory building. Built in 1902 by Francis Perks to the designs of a local builder, John Sheldon Bridge Mills was the last multi storey, steam powered tenement lace factory to be built in Long Eaton and was in fact constructed after the town already had its first electrically powered lace factory building. Bridge Mills also had a north light shed to the west of the site which took its power by line shafting across the yard between the two buildings.\""
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Path_by_the_Trent_-_geograph.org.uk_-_1102962.jpg",
      "title": "Andy Jamieson / Path by the Trent",
      "caption": "Path by the Trent"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Sawley_Marina_-_geograph.org.uk_-_1103143.jpg",
      "title": "Andy Jamieson / Sawley Marina",
      "caption": "Sawley Marina"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/Canal_flood_gates_near_Shardlow%2C_Derbyshire_-_geograph.org.uk_-_1618547.jpg",
      "title": "Roger Kidd / Canal flood gates near Shardlow, Derbyshire",
      "caption": "Canal flood gates near Shardlow, Derbyshire"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Long_Eaton_Hall_-_geograph.org.uk_-_584899.jpg",
      "title": "J147 / Long Eaton Hall",
      "caption": "Long Eaton Hall. A fine Palladian mansion house, built for the Howitt family in 1778 to the designs of the noted Derby based architect Joseph Pickford. The ornate entrance is almost identical to that of Pickford's own house at 41 Friar Gate, Derby - excepting the masonic frieze that appears on his own home. The hall is now the town hall and offices for the local council. Despite the obvious gardening work taking place, it is fair to say that the council are not the most sympathetic guardians of such a fine historic building."
    }
  ],
  "distance_km": 18.0,
  "description": "This Derbyshire based town has some nice waterside walking along the canals and river that run through the area. This walk from the town uses sections of the Erewash Canal and the Trent and Mersey Canal to visit the popular Trent Lock and the village of Shardlow. The walk starts in the town centre where you can pick up the Erewash Canal and follow the towpath south to Trent Lock. It's a noteworthy spot as it marks the point where the River Trent and River Soar meet with the beginning of the Erewash canal. It also sits on the border of three counties: Leicestershire, Nottinghamshire and Derbyshire. At the lock you head west along the river and canal to visit the Sawley Marina and Shardlow. The village is considered Britain's most complete surviving example of a canal village, with over 50 Grade II listed buildings and a large number of surviving public houses.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Mill & Brook is located in a nice spot near the canal. The friendly pub serves good food and has a small garden area out the back. You can find them on Derby Road at postcode NG10 4QB."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The waterside trails make for a fine dog walk and the Mill & Brook mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you head north along the canal you could visit the neighbouring town of ref='/routes/home.nsf/RoutesLinksWalks/ilkeston-walking-route'>Ilkeston. Just east of Ilkeston there's some more nice waterside trails along the Nottingham Canal Nature Reserve at Cossall. The pretty village also includes a noteworthy 13th century church and the 17th century Willoughby Almshouses. To the south there's the market town of Castle Donington. Here you can visit Donington Park which is famously used as a motor racing track and is also the venue for the Download Music Festival. Just to the west there's some nice waterside trails around St Chad's Water and Church Wilne Reservoir. St Chad's includes a nice circular lakeside footpath with a wildflower meadow and the historic 13th century St Chad's Church. For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/iczesbqvLA4",
  "postcode": "NG10 1PD",
  "district": "Long Eaton",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}