{
  "created_at": "2025-01-06T03:20:52.706290+00:00",
  "objectID": "8d7545b7b5624e04c20e9913e45a56b1",
  "ref": "blandford-forum-walking-route",
  "title": "Blandford Forum Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/02/Stone_Bridge_at_Blandford_Forum_-_geograph.org.uk_-_79920.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8d7545b7b5624e04c20e9913e45a56b1.gpx",
  "_geoloc": {
    "lat": 50.8527575495,
    "lng": -2.1666183121
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Stone_Bridge_at_Blandford_Forum_-_geograph.org.uk_-_79920.jpg",
      "title": "Nigel Freeman / Stone Bridge at Blandford Forum, via Wikimedia Commons",
      "caption": "Stone Bridge at Blandford Forum"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0b/River_Stour%2C_Blandford_Forum_-_geograph.org.uk_-_864958.jpg",
      "title": "michael ely / River Stour, Blandford Forum, via Wikimedia Commons",
      "caption": "River Stour, Blandford Forum"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Blandford_Forum.jpg/512px-Blandford_Forum.jpg",
      "title": "Charlesdrakew at English Wikipedia [Public domain], via Wikimedia Commons",
      "caption": "Blandford Forum town centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_Mill_at_Durweston_-_geograph.org.uk_-_1425640.jpg",
      "title": "John Palmer / The Mill at Durweston, via Wikimedia Commons",
      "caption": "The Mill at Durweston. Durweston Mill has been modernised to offer accommodation on the River Stour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/Stourpaine_church_-_geograph.org.uk_-_238609.jpg",
      "title": "Kevin Young / Stourpaine church, via Wikimedia Commons",
      "caption": "View north to Stourpaine, Dorset, with Holy Trinity parish church in the distance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Stourpaine%2C_Post_Office_and_pub_-_geograph.org.uk_-_258946.jpg",
      "title": "michael ely / Stourpaine, Post Office and pub, via Wikimedia Commons",
      "caption": "Stourpaine, Post Office and pub. Situated on the A350 between Shaftesbury and Blandford Forum, Dorset. The pub is called The White Horse."
    }
  ],
  "distance_km": 11.0,
  "description": "This Dorset based market town has some nice walks along the River Stour and in the Dorset AONB to try. This route uses sections of the Stour Valley Way and the North Dorset Trailway to create a circular walk around the town. On the way there's nice views of the river and a visit to the local villages of Durweston and Stourpaine. The walk starts on Blandford Bridge which crosses the Stour to the south of the town centre. From here you can pick up the Stour Valley Way long distance footpath. Follow the waymarked trail north east passing the lovely Crown Meadows and Deer Park. The trail continues to Bryanston and Durweston where you cross the river. A short stroll from here is the village of Stourpaine where you can stop for refreshments at the popular White Horse Inn. There's also lots of pretty thatched cottages and an old church to see here. After exploring the village the route picks up the North Dorset Trailway, a shared cycling and walking trail running along a dismantled railway line from Stalbridge to Spetisbury. The trail will lead you all the way back into the town centre where the route finishes. Here you can enjoy refreshments at the fine Crown Hotel on West Street. To extend your walking around Blandford you pick up the Jubilee Trail near Durweston and follow it into Blandford Forest where there's miles of cycling and walking trails to try.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the route we recommend popping into the White Horse Inn in Stourpaine for some refreshments. It's a quaint pub of some note, dating back to the early 18th Century. Today, the inside provides an open-plan layout with a bar, restaurant, shop, post office, games room, wood burning stoves & an open fire. The external provides a covered outdoor decking area at the rear and a seating area out the front for warm summer days. There's also a village shop within the pub with a deli counter which sells a variety of delicious, fresh products. You can find the pub in the village at postcode DT11 8TA for your sat navs.In Blandford head to the Crown Hotel in the town centre. The Crown is reportedly the oldest inn in Dorset and has been a residence since the 10th Century. The pub/hotel is set in a redbrick Georgian property near to the interesting Blandford Town Museum. Highlights include a lounge with leather sofas and a fireplace, and a garden with a terrace seating to relax in on the warmer days. You can find it on West St at postcode DT11 7AJ."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head a few miles to the south west and you could visit the picture postcard village of Milton Abbas. There's rows of beautiful thatched cottages to see in this exquisite Capability Brown designed settlement. To the north is the pretty village of Compton Abbas where you can visit Fontmell and Melbury Downs, Compton Abbas Airfield and the highest point in the Cranborne Chase AONB at Win Green Hill. To the east you will find the Dorset Cursus an ancient Neolithic earthwork on Wyke Down. There's some excellent views over the countryside of the Cranborne Chase AONB to enjoy from here. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sNV0T66pDg0",
  "postcode": "DT11 9LH",
  "district": "Blandford St. Mary",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bournemouth Road, Blandford St. Mary, Dorset, England, DT11 9LH, United Kingdom",
  "state": "England"
}