{
  "created_at": "2025-01-06T03:46:33.674407+00:00",
  "objectID": "8d883d251886cb93951db47f4c100ddb",
  "ref": "saints-way-walking-route",
  "title": "Saints Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/bd/View_from_Saints_Way%2C_near_Lanivet_-_geograph.org.uk_-_212562.jpg",
  "nearby": [
    {
      "description": "Helman Tor",
      "objectID": "2956a00a7723ca895f02b04b938012ea",
      "ref": "helman-tor-walking-route"
    },
    {
      "description": "Prideaux Place",
      "objectID": "a2ef6a4283c9480f4c665b9db7c7e7c5",
      "ref": "prideaux-place-walking-route"
    },
    {
      "description": "Camel Trail",
      "objectID": "dcae27896312abf1091e5973a84ef27e",
      "ref": "camel-trail-walking-and-cycle-route"
    },
    {
      "description": "Fowey Hall Walk",
      "objectID": "9b1e728a28d1dd414c007ac53bb597db",
      "ref": "fowey-hall-walk-walking-route"
    },
    {
      "description": "Fowey to Golant Walk",
      "objectID": "14b0f31911299db461cb7aa9d360327d",
      "ref": "fowey-to-golant-walk-walking-route"
    },
    {
      "description": "Wadebridge",
      "objectID": "6269ee00a4f131495643b32e3ef8693d",
      "ref": "wadebridge-walking-route"
    },
    {
      "description": "Padstow to Trevone Bay",
      "objectID": "829f46b1ef1a00d4265a95a7eb5b2dc8",
      "ref": "padstow-to-trevone-bay-walking-route"
    },
    {
      "description": "Rock to Polzeath Walk",
      "objectID": "ac1fa77605b0b837811bd7c39a4c731b",
      "ref": "rock-to-polzeath-walk-walking-route"
    },
    {
      "description": "Lostwithiel",
      "objectID": "eeccb8a03a4896cadd4b486b56675623",
      "ref": "lostwithiel-walking-route"
    },
    {
      "description": "Luxulyan Valley",
      "objectID": "28a9e6a1b2b0d111b23365fdc7d14509",
      "ref": "luxulyan-valley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8d883d251886cb93951db47f4c100ddb.gpx",
  "_geoloc": {
    "lat": 50.5409643085,
    "lng": -4.9423318131
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/View_from_Saints_Way%2C_near_Lanivet_-_geograph.org.uk_-_212562.jpg",
      "title": "Terry McKenna / View from Saints Way, near Lanivet",
      "caption": "A view from Saints Way, high on West Downs, near Lanivet, Cornwall. The tall tower of St Nevet's Church, Lanivet is at the centre of the picture, almost hidden amongst the trees."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e2/The_Saints%27_Way_1_-_geograph.org.uk_-_1129104.jpg",
      "title": "Jonathan Billinger / The Saints' Way 1",
      "caption": "Looking west from the B3269; the Saints' Way Trail crosses mid-Cornwall from Padstow to Fowey covering 30 miles / 48 Km. Although there is no historical evidence of a 'Saints' Way', sections of the trail are known ancient routes connecting shrines, standing stones, holy wells, chapels and churches. Linked together, the trail forms a fairly direct cross-county path which may have been used by Christian missionaries and pilgrims in the Dark and Middle Ages. The Saints' Way was also known as the Mariners' Way and used by traders from Ireland and Wales who wanted to avoid the dangerous waters around Lands End. Granite steps are provided but not needed if the gate is kept open."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/On_the_Saints_Way_-_geograph.org.uk_-_557351.jpg",
      "title": "Tony Atkin / On the Saints Way",
      "caption": "This is the western branch of the Saints Way footpath. Here there are views out to St Austell and the hills behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Bridge_on_the_Saints_Way_-_geograph.org.uk_-_354116.jpg",
      "title": "Patrick Pavey / Bridge on the Saints Way",
      "caption": "Bridge on the trail. The bridge was the main carriageway to the Menabilly Estate. Here the Saints Way footpath passes underneath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Withiel_-_geograph.org.uk_-_1629321.jpg",
      "title": "Derek Harper / Withiel",
      "caption": "Withiel. The little village seen from the following footpath 565/6/2 and approaching from the southeast."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/Pelyntor_Cottage_-_geograph.org.uk_-_1761057.jpg",
      "title": "Derek Harper / Pelyntor Cottage",
      "caption": "Pelyntor Cottage. The early C19 listed house is seen across the valley east of Lanlivery village, from the trail, following the lane which passes the cottage. The Way then follows footpath 406/3/2 up the steep field to the right of the house, passing the standing stone."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Fowey_Hall_hotel_-_geograph.org.uk_-_799435.jpg/256px-Fowey_Hall_hotel_-_geograph.org.uk_-_799435.jpg",
      "title": "Rod Allday / Fowey Hall hotel, via Wikimedia Commons",
      "caption": "At the end of the route in Fowey you will find Fowey Hall. Built in 1899 by Sir Charles Hanson, a former Lord Mayor of London, Fowey Hall regularly hosted royal visitors and it was the inspiration for Toad Hall in The Wind in the Willows. It is now a luxury family hotel and every May hosts the Daphne Du Maurier literary festival."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Fowey_-_geograph.org.uk_-_2745.jpg",
      "title": "David Stowell / Fowey, via Wikimedia Commons",
      "caption": "A view over the harbour at the delightful village of Fowey. The village is in a wonderful location on the River Fowey as it enters the sea. The harbour waterfront looking towards the Town Quay. Behind is St Fimbarrus Church (named after St Finbarr who passed through the town many hundreds of years ago). The distinctive tower to the right of the church is on Place House where the Treffy family have lived since the 13th Century."
    }
  ],
  "distance_km": 47.0,
  "description": "This walk takes you across Cornwall from Padstow in the north to Fowey on the south coast. It follows the probable route of early Christian travellers making their way from Ireland to the Continent. The route begins by the delightful Padstow Harbour and heads south through Little Petherick, St Breck Downs and Lanivet before joining the Fowey River near Lostwithiel for a lovely waterside stretch that leads to Fowey. This final section passes the noteworthy Sawmills Studios, a recording studio used most notably by musicians such as The Stone Roses (Fools Gold) and The Verve (A Storm in Heaven), Muse, Oasis (Definitely Maybe), Catatonia, Ride, Swans and Supergrass. The main building is a 17th-century water mill and the site has a documented history stretching back to the 11th century. See the Fowey to Golant Walk for more details.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Padstow you could head to the tea rooms at the delightful Prideaux Place. Situated in what was once the Old Schoolroom, the tearoom is supplemented in the summer months by the addition of a marquee on the Terrace overlooking the Deer Park. It's a lovely setting to enjoy light lunches, cakes, coffee, tea, ice creams and the internationally renowned Cornish Cream Tea. You can find the house at a postcode of PL28 8RP for your sat navs. There's also the excellent Rick Stein cafe where you can pick up delicous fish and chips. You can find it near Padstow harbour and river on Middle Street at postcode PL28 8AP. In Lanlivery near Lostwithiel the splendid Crown Inn in is well worth some investigation. The inn is notable as one of the oldest in Cornwall, dating all the way back to the 12th century. It was later extended to house the stonemasons who built the charming local church of St Brevita. The pub is full of character with low beamed ceilings, open fireplaces, thick stone walls and a glass covered well in porch. Outside there's a particularly delightful garden area where you can relax on warmer days. You can find them just over a mile west of the town at a postcode of PL30 5BT for your sat navs. Near the pub you could also take a slight detour from the route to visit Restormel Castle. The English Heritage run castle is now a photogenic ruin set in beautiful Cornish countryside next to the River Fowey. It was built in the 13th century and used as a retreat for its medieval owners and was twice visited by Edward, the Black Prince. It's another interesting historical site near to the route and you can find it just north of Lostwithiel at a postcode of PL22 0EE."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In Padstow you can pick up the popular Camel Trail and follow it along the Camel Estuary towards Wadebridge. In the town you could also catch the ferry over the river to Rock and try the Rock to Polzeath Walk. The route passes close to the popular Luxulyan Valley, a designated World Heritage Site. The valley is one of the highlights of the area with nice trails along the River Par, a series of historical industrial remains and the impressive Treffry Viaduct to see. It's located just to the south east of Luxulyan village which is on the route. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "district": "Padstow",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Seapink Cottage, 28, Church Lane, Padstow, Cornwall, England, PL28 8AX, United Kingdom",
  "postcode": "PL28 8AX",
  "state": "England"
}