{
  "created_at": "2025-01-06T00:25:40.428505+00:00",
  "objectID": "8d88acbdc05b75e8b785356b1f03de8c",
  "ref": "chipping-walking-route",
  "title": "Chipping Lancashire Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1c/St_Bartholomew_Church%2C_Chipping_-_geograph.org.uk_-_542145.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8d88acbdc05b75e8b785356b1f03de8c.gpx",
  "_geoloc": {
    "lat": 53.8849762637,
    "lng": -2.5766603607
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/St_Bartholomew_Church%2C_Chipping_-_geograph.org.uk_-_542145.jpg",
      "title": "wfmillar / St Bartholomew Church, Chipping",
      "caption": "St Bartholomew Church, Chipping"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Doeford_Bridge_-_geograph.org.uk_-_993356.jpg/512px-Doeford_Bridge_-_geograph.org.uk_-_993356.jpg",
      "title": "Gerald England / Doeford Bridge",
      "caption": "Doeford Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Whitewell_-_geograph.org.uk_-_414207.jpg",
      "title": "Alexander P Kapp / Whitewell",
      "caption": "Whitewell"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/The_River_Dunsop_-_geograph.org.uk_-_414236.jpg",
      "title": "Alexander P Kapp / The River Dunsop",
      "caption": "The River Dunsop"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/Langden_Brook%2C_Trough_of_Bowland_-_geograph.org.uk_-_733046.jpg",
      "title": "Alexander P Kapp / Langden Brook, Trough of Bowland",
      "caption": "Langden Brook, Trough of Bowland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/The_fells_by_Trough_House_Farm_-_geograph.org.uk_-_658235.jpg",
      "title": "Mr T / The fells by Trough House Farm",
      "caption": "The fells by Trough House Farm"
    }
  ],
  "distance_km": 16.2,
  "description": "This attractive Lancashire village is located in a lovely position in the Forest of Bowland. This walk from the village picks up the long distance Hodder Way and follows it up to the delightful Dunsop Bridge which is the gateway to the popular Trough of Bowland. It's about a 10 mile hike up to the Trough from the village but you have the option of catching a bus part of the way back to save your legs! Starting in the village you head east to the River Hodder at Doeford Bridge. Cross the river and head north and it will take you past the splendid Inn at Whitewell before coming to Dunsop Bridge. The pretty village lies very close to the geographic centre of Great Britain at the confluence of the River Dunsop and the River Hodder. Head west and it will take you along the Langdon Brook to one of the most scenic areas of the AONB at the Trough of Bowland. Also near the village is the climb to Parlick and Fair Snape Fell which provides fabulous views over the area. There's also the Forest of Bowland Walk and nice waterside trails around Stocks Reservoir. Beacon Fell Country Park, Brock Bottom, Calder Vale and Longridge Fell are also reachable from the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Inn At Whitewell is a great place for refreshments on the walk. The beautiful inn sits in a wonderful location high on the banks of the River Hodder. It's a place of some note with a history stretching back hundreds of years. In the 1300’s the inn was just a small manor house, lived in by the keepers of the Royal forest. It was not until the 1700’s, that the building was transformed into a resting place where travellers en route to or from Lancaster could safely stay before continuing their perilous journey.  The inn has got a delightful interior and a nice outdoor seating area with views over the river. It's the ideal spot to rest your legs on a summer day. After your meal you can enjoy a stroll along the river where there are stepping stones and a waterfall nearby. You can find the inn a couple of miles south of Dunsop Bridge at postcode BB7 3AT.   Picture above: the Inn at Whitewell and the River Hodder stepping stones just below the inn. Back in Chipping there's also The Sun Inn to consider. The 17th century village pub includes a wood-fired pizza barn and a nice garden area. You can find them at 2 Windy Street with postcode PR3 2GD for your sat navs. There's also the friendly Tillotsons Arms on Talbot Street. The two roomed, beamed pub was built in 1836 and also has a garden area for warmer weather."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area around the village is great for dog walking and the Sun Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you have some time pay a visit to the nearby Bowland Wild Boar Park. The park is a highglight of the area with animal feeding, tractor rides, plays areas and a cafe. There's also some nice riverside walks along the River Hodder here too. There's lots of different animals in the park including Red Deer, Peacock, Ostriches, Emu and of course Wild Boar. You can explore the site on 7 different waymarked nature trails. It's a lovely place for a stroll with bluebell woods, sculptures and plenty of wildlife to look out for on the way.  The park is located in the heart of the Trough of Bowland situated about 2 miles from the picturesque village of Chipping, on the Chipping to Dunsop Bridge road. They are signposted clearly from Chipping and have a postcode of PR3 2QT for your sat navs.   Above: Views of the park with the River Hodder and a wooden sculpture on the right."
    }
  ],
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Raike, Chipping, Ribble Valley, Lancashire, England, PR3 2QL, United Kingdom",
  "postcode": "PR3 2QL",
  "district": "Ribble Valley",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "geographic center"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking"
  ]
}