{
  "created_at": "2025-01-06T02:44:37.089621+00:00",
  "objectID": "8db3b60e27236b2f8c1f1732aa1c3587",
  "ref": "ilam-dovedale-circular-walk-walking-route",
  "title": "Ilam Dovedale Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Ilam_Church_-_geograph.org.uk_-_1027060.jpg",
  "nearby": [
    {
      "description": "Dovedale Circular Walk",
      "objectID": "25f7d47f743822ba575c7d402a7b9d0b",
      "ref": "dovedale-circular-walk-walking-route"
    },
    {
      "description": "Dovedale",
      "objectID": "50e38112ac3721d9d1fe24f250d83231",
      "ref": "dovedale-walking-route"
    },
    {
      "description": "Ilam Park",
      "objectID": "153ed8cdcfac9320d88a915330c96e57",
      "ref": "ilam-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8db3b60e27236b2f8c1f1732aa1c3587.gpx",
  "_geoloc": {
    "lat": 53.0556529152,
    "lng": -1.8059253532
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Ilam_Church_-_geograph.org.uk_-_1027060.jpg",
      "title": "John Maris / Ilam Church",
      "caption": "Ilam Church. Thorpe Cloud provides a magnificent backdrop to this view of Ilam Church"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Ilam_Park_-_geograph.org.uk_-_1105800.jpg",
      "title": "DAVID M GOODWIN / Ilam Park",
      "caption": "Ilam Park. View towards St Bertram's Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ad/Barn_House_-_geograph.org.uk_-_198583.jpg",
      "title": "Oliver Dixon / Barn House",
      "caption": "Barn House. On the road from Hope to Ilam. The house enjoys a spectacular view of the Manifold valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Damgate_-_geograph.org.uk_-_198576.jpg",
      "title": "Oliver Dixon / Damgate",
      "caption": "Damgate. Just after hay making. On the road from Hope to Ilam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Track_near_Stanshope_-_geograph.org.uk_-_942741.jpg",
      "title": "James Allan / Track near Stanshope",
      "caption": "Track near Stanshope. Leading east into the hills from the hamlet of Stanshope."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/The_Dove_at_Dove_Holes_-_geograph.org.uk_-_886379.jpg",
      "title": "Row17 / The Dove at Dove Holes",
      "caption": "The Dove at Dove Holes"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Lover%27s_Leap%2C_Dovedale_-_geograph.org.uk_-_1565461.jpg",
      "title": "Gareth James / Lover's Leap, Dovedale",
      "caption": "Lover's Leap, Dovedale"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Lin_Dale_-_View_from_Stepping_Stones_over_River_Dove_-_geograph.org.uk_-_861195.jpg",
      "title": "Alan Heardman / Lin Dale - View from Stepping Stones over River Dove",
      "caption": "Lin Dale. View from Stepping Stones over River Dove"
    }
  ],
  "distance_km": 11.0,
  "description": "This circular walk takes you from Ilam Park into the beautiful Dovedale in the White Peak. It's about a 7 mile walk with a moderate climb on the way so a reasonable level of fitness is required. The route starts from the parking area in Ilam Park and heads east to pick up Ilam Moor Lane. You can follow this country lane up to Stanshope, passing Bunster Hill and Damgate on the way. At Stanshope you can pick up footpaths heading south east to take you into Dovedale where you'll come out near the picturesque spot of Dove Holes with its two caves. Follow the footpaths south along the river and through the woodland and they will take you to Lovers Leap and the famous Stepping Stones. The stones are one of the most photogenic sights in the area and fine place to rest for a while. They have an interesting history having been originally set down in the 19th century for Victorian tourists to cross the river. The rock at Lovers Leap is also popular place to climb for a view and a photo. It also has a legend attached to it concerning a young woman who believed her lover had been killed in the Napoleonic Wars and threw herself from the rock. She was saved when her skirt caught in the branches of a tree below. When she returned home, she heard her lover was still alive. You can use the steps on the rock climb the formation for splendid views of the dale. At the southern end of the dale you will reach St Mary's Bridge where you can follow a country lane west back to the car park at Ilam.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back at Ilam Park the Manifold Tea-room is a fine place for some well earned refreshments. You can sit outside and enjoy lunch or a cream tea with stunning views of Thorpe Cloud and the Italian Gardens."
    },
    {
      "subtitle": "Dog Walking",
      "content": "It's a splendid walk to do with your dog though you are requested to keep them on leads in Ilam Park and Dovedale. Water bowls can be found near the tea-room and toilets at Ilam Park."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For an alternative circular walk around this beautiful area see the Dovedale Circular Walk. This starts from the village of Tissington and uses sections of the Tissington Trail and Limestone Way to visit Dovedale and Milldale. The circular Fenny Bentley Walk visits Thorpe Cloud and Dovedale from the pretty village to the east. The village is worthy of exploration with the pretty Bentley Brook, a 14th century church and a fine inn with particularly lovely gardens to see. The route also visits the 17th-century Jacobean mansion house at Tissington Hall. The delightful village of Parwich lies just a few miles to the east of Dovedale. There's a pretty village green, old limestone cottages and a pub dating back to the 1600s. You can reach the village on the Limestone Way from Thorpe. For more walking ideas in the area see the White Peak Walks page."
    }
  ],
  "district": "Ilam",
  "county": "Staffordshire",
  "region": "West Midlands",
  "country": "England",
  "gazetteer_found": true
}