{
  "created_at": "2025-01-06T10:00:06.962472+00:00",
  "objectID": "8de86afcd105ea4be681a8fc8b308565",
  "ref": "chess-valley-circular-walk-walking-route",
  "title": "Chess Valley Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/04/Chorleywood_Common%2C_Artichoke_Dell_-_geograph.org.uk_-_95956.jpg",
  "nearby": [
    {
      "description": "Chess Valley Walk",
      "objectID": "ce8cc125db051e68ef2096d4c8ce5453",
      "ref": "chess-valley-walk-walking-route"
    },
    {
      "description": "Chorleywood",
      "objectID": "ee78e0ce2413049dbf5bfd9b9d675f41",
      "ref": "chorleywood-walking-route"
    },
    {
      "description": "Chiltern Heritage Trail",
      "objectID": "539ce9f068b2bb535cfd77c1680974bf",
      "ref": "chiltern-heritage-trail-walking-route"
    },
    {
      "description": "Chiltern Way",
      "objectID": "e4888a75d90cd63bc6fc871d701234a0",
      "ref": "chiltern-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8de86afcd105ea4be681a8fc8b308565.gpx",
  "_geoloc": {
    "lat": 51.6554349133,
    "lng": -0.5189230559
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Chorleywood_Common%2C_Artichoke_Dell_-_geograph.org.uk_-_95956.jpg",
      "title": "Nigel Cox / Chorleywood Common: Artichoke Dell",
      "caption": "Chorleywood Common: Artichoke Dell. Viewed looking westwards over Dog Kennel Lane towards Artichoke Dell. The white building is the Black Horse Public House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Chorleywood_House_and_part_of_Chorleywood_House_Estate_-_geograph.org.uk_-_1765085.jpg/512px-Chorleywood_House_and_part_of_Chorleywood_House_Estate_-_geograph.org.uk_-_1765085.jpg",
      "title": "Graham Hale / Chorleywood House and part of Chorleywood House Estate",
      "caption": "Chorleywood House Estate. Part of the 170-acre estate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/River_Chess%2C_near_Sarratt_Bottom_-_geograph.org.uk_-_67260.jpg",
      "title": "Nigel Cox / River Chess, near Sarratt Bottom",
      "caption": "River Chess, near Sarratt Bottom. Viewed looking upstream and northwards, the river here appears to be in an artificial cut, as it does not flow in the lowest part of the valley, which is to the left of the photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/A_Pastoral_Scene_-_geograph.org.uk_-_66975.jpg",
      "title": "Cathy Cox / A Pastoral Scene",
      "caption": "A Pastoral Scene. Looking south east towards North Hill, Chorleywood, this idyllic picture of rural tranquillity was marred by the constant roar of the traffic on the M25 motorway, about a kilometre away to the south east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/River_Chess%2C_near_Valley_Farm_-_geograph.org.uk_-_67267.jpg",
      "title": "Nigel Cox / River Chess, near Valley Farm",
      "caption": "River Chess, near Valley Farm. Viewed looking downstream and eastwards from the footbridge by the Holloway Lane ford, the commercial watercress beds are beyond the shed, with the trees on the slope of Mount Wood visible to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/48/Chenies_-_geograph.org.uk_-_139218.jpg",
      "title": "Nigel Cox / Chenies",
      "caption": "Chenies. Viewed looking westwards across the village green. The village pump is visible to the left of the old style road sign, and the house in the distance has a plaque indicating that it was built in 1857."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Latimer%2C_Great_Water_-_geograph.org.uk_-_139078.jpg",
      "title": "Nigel Cox / Latimer: Great Water",
      "caption": "Latimer: Great Water. The artificial lake in the grounds of Latimer Park viewed looking eastwards from the Latimer Park Farm bridge. The channel of the River Chess is beyond the grass to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Carpenter%27s_Wood%2C_Chorleywood_-_geograph.org.uk_-_123835.jpg/256px-Carpenter%27s_Wood%2C_Chorleywood_-_geograph.org.uk_-_123835.jpg",
      "title": "David Hawgood / Carpenter's Wood, Chorleywood",
      "caption": "Carpenter's Wood, Chorleywood. Looking north on the Chiltern Way"
    }
  ],
  "distance_km": 12.0,
  "description": "This route uses a section of the Chess Valley Walk and other public footpaths to create a circular walk through the area. On the way there's nice river trails, woodland paths and country views to enjoy. The walk starts from the tube station at Chorleywood on the Metropolitan line of the London Underground. From here you can pick up the Chess Valley Walk and follow it north east through Chorleywood Common to the Chorleywood House Estate. There's some lovely grounds here with ponds, gardens, sculptures and woodland to explore. After passing the house you soon arrive at the River Chess where you follow the river path north west to Sarratt Bottom and Latimer. Here you cross the river and head east through woodland to Chenies where there's a splendid manor house and grounds. After exploring the house you head south along the Chiltern Heritage Trail and the Chiltern Way to Halsey's Wood and Carpenter's Wood where you turn south east. Shortly after passing through the wood you arrive back at Chorleywood station.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Red Lion in Chenies is a good place to stop for some refreshments on the walk. The 16th century pub has a good menu and also includes an outdoor area for warmer days. You can find the pub in the village at a postcode of WD3 6ED for your sat navs. It's worth taking a small detour from the route to visit the picture postcard village of Sarratt near Chorleywood and Amersham. It's a delightful village which includes the popular The Cricketers next to the village green. They do a fine Sunday lunch and have a nice garden area to sit out in on warmer days. You can find them at postcode WD3 6AS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river paths and woodland trails are ideal for dog walking. The Red Lion mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You could also start the walk from Chalfont and Latimer Station at the western end of the route in Little Chalfont. There's a section of the trail here which will take you up to the river. In the village you could pay a visit to the Little Chalfont Nature Park. The lovely little park includes a rare wild flower meadow, old woodlands and relics of its past as a farm and a cherry orchard. There's information boards where you can learn about the variety of flora and fauna at the site. You can find them on Cokes Lane, near the train station at postcode HP7 9QB for sat navs. For more walking ideas in the area see the Buckinghamshire Walks and the Hertfordshire Walks pages."
    }
  ],
  "postcode": "WD3 5LL",
  "district": "Three Rivers",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Manzel, Colleyland, Chorleywood, Three Rivers, Hertfordshire, England, WD3 5LL, United Kingdom",
  "state": "England"
}