{
  "created_at": "2025-01-06T02:34:02.529220+00:00",
  "objectID": "8e2631b122f8119c7dca4d8f26a7c5b5",
  "ref": "mountsorrel-walking-route",
  "title": "Mountsorrel Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Mountsorrel_Lock_-_geograph.org.uk_-_2350948.jpg/512px-Mountsorrel_Lock_-_geograph.org.uk_-_2350948.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8e2631b122f8119c7dca4d8f26a7c5b5.gpx",
  "_geoloc": {
    "lat": 52.7313723639,
    "lng": -1.1400098724
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Mountsorrel_Lock_-_geograph.org.uk_-_2350948.jpg/512px-Mountsorrel_Lock_-_geograph.org.uk_-_2350948.jpg",
      "title": "Mountsorrel Lock by Stephen McKay, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mountsorrel Lock with Waterside Inn in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Butter_Market%2C_Mountsorrel_-_geograph.org.uk_-_238728.jpg",
      "title": "Eirian Evans / Butter Market, Mountsorrel",
      "caption": "Butter Market, Mountsorrel. This was erected in 1793 to protect stallholders from the weather and to replace the original medieval market cross which is now sited at Swithland."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Buddon_Quarry%2C_Mountsorrel_-_geograph.org.uk_-_226329.jpg",
      "title": "peter knudssen / Buddon Quarry, Mountsorrel",
      "caption": "Buddon Quarry, Mountsorrel. Looking into 'The Pit'. The largest hard-rock quarry in Britain comprising a granodiorite most probably of Ordovician age (c450Ma). Can you see the tiny lorry at the bottom?"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/67/Victorian_brick_bridge_over_the_Soar_-_geograph.org.uk_-_677122.jpg",
      "title": "Tim Heaton / Victorian brick bridge over the Soar",
      "caption": "Victorian brick bridge over the Soar. Has the date '1860' on it, and at the time was the largest brick span in Britain. The paler pink areas appear to be more recent cladding. The bridge used to carry rail trucks from the Mountsorrel granite quarries to the rail line at Barrow, but the granite chippings are now carried on a conveyor belt."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Swithland_Reservoir_-_geograph.org.uk_-_2151189.jpg",
      "title": "Swithland Reservoir by Ashley Dace, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Swithland Reservoir"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Disused_slate_quarry_in_Swithland_Wood_-_geograph.org.uk_-_143623.jpg",
      "title": "John Darch / Disused slate quarry in Swithland Wood",
      "caption": "Disused slate quarry in Swithland Wood"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Bradgate_Park_-_geograph.org.uk_-_885478.jpg",
      "title": "Stephen McKay / Bradgate Park",
      "caption": "Bradgate Park The Charnwood Forest landscape of rugged hills emerging from areas of thick woodland is unlike anywhere else in Leicestershire and can be quite a surprise for anyone unfamiliar with the county. Bradgate Park, an ancient deer park covering 830 acres, contains some of the best of this landscape and has benefited from being kept largely in its original condition - although much of the park has now been overtaken by bracken which replaced gorse and heather. This path leads up to the Leicestershire Yeomanry memorial."
    }
  ],
  "distance_km": 22.6,
  "description": "This Leicestershire based village is in a great location for walkers wishing to explore the National Forest area of the county. There's riverside trails along the Soar, some fine local country parks and a series of picturesque reservoirs to explore on foot. This walk from the village takes you to some of the local walking highlights including Swithland Reservoir, Swithland Woods, Cropston Reservoir and Bradgate Country Park . The varied route makes use of sections of the Leicestershire Round and National Forest Way long distance footpaths. The walk starts at Mountsorrel Lock on the River Soar just east of the village. Near here you can pick up the Leicestershire Round and follow it west past the old Mountsorrel Quarries. The trail will take you along the top of Swithland Reservoir before heading south to Swithland Wood. There's lots of peaceful woodland trails with a variety of wildlife to see here. You continue south to another waterside trail along Cropston Reservoir before looping back to explore the popular Bradgate Country Park. There's resident deer and a fine viewpoint with views across the surrounding countryside. The route then heads north back through the woods to the neighbouring village of Woodhouse Eaves. Here you could take a detour or extension to visit another great viewpoint at Beacon Hill Country Park which lies just to the north west. This route heads east along the Leicestershire Round to return you to Mountsorrel.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At the start/finish off the route you can enjoy some post exercise relaxation and refreshment at the Waterside Inn. The inn is located in a fine spot next to the lock on the River Soar. You can sit outside in the lovely garden and enjoy a meal with a view over the water. The pub can be found at Sileby Rd with postcode LE12 7BB for your sat navs. Just west of the village there's the noteworthy Mountsorrel and Rothley Community Heritage Centre. Here you'll find a garden railway, an interesting train museum and some pleasant nature trails. There's also Granite’s Coffee Shop where you can enjoy a bite to eat. It's a lovely place to visit if you have time after your walk. On selected weekends throughout the year you can also see the Great Central Railway heritage trains running along the line. You can find the centre at 240 Swithland Lane with postcode LE7 7UE for your sat navs."
    }
  ],
  "district": "Mountsorrel",
  "county": "Leicestershire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}