{
  "created_at": "2025-01-06T08:06:10.592969+00:00",
  "objectID": "8e3515b87c33f32298116719b4ca7ec0",
  "ref": "plym-valley-trail-walking-and-cycle-route",
  "title": "Plym Valley Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/75/Plym_Valley_Trail_-_geograph.org.uk_-_1526249.jpg",
  "nearby": [
    {
      "description": "Plymbridge Woods",
      "objectID": "3597b4983d48ed88e02df83387b7a65c",
      "ref": "plymbridge-woods-walking-and-cycle-route"
    },
    {
      "description": "Cann Woods",
      "objectID": "20f47915627e615fb52ecf6f7f59d9b3",
      "ref": "cann-woods-walking-and-cycle-route"
    },
    {
      "description": "Saltram Park",
      "objectID": "60a74bc19413d893e882678ff38f7c0b",
      "ref": "saltram-park-walking-and-cycle-route"
    },
    {
      "description": "Drakes Trail",
      "objectID": "5d270326a483b1efb2678273d6a6514f",
      "ref": "drakes-trail-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8e3515b87c33f32298116719b4ca7ec0.gpx",
  "_geoloc": {
    "lat": 50.47133379,
    "lng": -4.08360421
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Plym_Valley_Trail_-_geograph.org.uk_-_1526249.jpg",
      "title": "Derek Harper / Plym Valley Trail, via Wikimedia Commons",
      "caption": "Near the start/end at Marsh Mills. A yacht works is on one side (behind the razor wire) and the terminus of the Plym Valley Railway on the other."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Plymbridge_Woods_at_Plymbridge_%285921%29.jpg/512px-Plymbridge_Woods_at_Plymbridge_%285921%29.jpg",
      "title": "Nilfanion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Plymbridge Woods at Plymbridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Plym_valley_near_Shaugh_Bridge_%286396%29.jpg/512px-Plym_valley_near_Shaugh_Bridge_%286396%29.jpg",
      "title": "Nilfanion [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Plym valley near Shaugh Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Saltram_House_2008.jpg/512px-Saltram_House_2008.jpg",
      "title": "Chilli Head from Weston-super-Mare, UK [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Saltram House at the end of the route. The grade I listed George II era mansion house located in the parish of Plympton. It was deemed by the architectural critic Pevsner to be \"the most impressive country house in Devon\". Saltram is one of Britain's best preserved examples of an early Georgian house and retains much of its original decor, plasterwork and furnishings. The house was used as one of several local settings for the 1995 film Sense and Sensibility."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8d/Viewing_Platform_on_Cann_Viaduct_-_geograph.org.uk_-_881986.jpg",
      "title": "Tony Atkin / Viewing Platform on Cann Viaduct",
      "caption": "Viewing Platform on Cann Viaduct. The viaduct on the disused railway line, now part of the Plym Valley Cycleway, makes an ideal view point for Peregrine Falcons which in recent years have been nesting on ledges on the disused quarry face opposite. Instead of trying to keep the nesting site a secret, the location was advertised, a web-cam set up and viewing encouraged, a tactic which seems to have been successful in protecting the birds from egg collectors and poisoners."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Plym_Bridge_-_geograph.org.uk_-_121307.jpg",
      "title": "Tony Atkin / Plym Bridge",
      "caption": "Plym Bridge. This old bridge over the river Plym is an access point to the recreational area of the Plym valley woodlands. The bridge used to be the lowest crossing on the river. It is now closed to motor vehicles to avoid this route being used as a rat run. Car parks at either side of the bridge give access to visitors."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Cycle_Path_and_Disused_Canal_-_geograph.org.uk_-_881768.jpg",
      "title": "Tony Atkin / Cycle Path and Disused Canal",
      "caption": "Cycle Path and Disused Canal. The remains of the old Cann Quarry Canal by the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Shaugh_Bridge_Halt_platform_%28geograph_4355795%29.jpg",
      "title": "jeff collins / Shaugh Bridge Halt platform",
      "caption": "Shaugh Bridge Halt platform. Looking North, the platform continues on after the road bridge. This was an unstaffed halt on the GWR Plymouth to Yelverton Branch Line. The bridge carries a minor road dropping down to Bickleigh. NCN27 and the West Devon Way now use the old track bed."
    }
  ],
  "distance_km": 12.0,
  "description": "This shared cycling and walking trail follows the old Plym Valley railway from Clearbrook to Saltram Park. The trail runs for a distance of about 7 miles along a fairly flat, traffic free path. Along the way there's nice views of the River Plym and the countryside of Bickleigh Vale. This route starts at the northern end of the trail at Clearbrook where parking is available. You then head south towards Bickleigh and Plymbridge Woods. The attractive woods have a nice family cycle trail with a series of viaducts, a disused railway station and pretty bridges over the river. The area also includes Cann Woods where there's some good mountain bike trails and miles of woodland trails. In this area there's also the Cann Viaduct where you can look out for the Peregrine Falcons from the elevated spot. The route continues past Leigham and Marsh Mills station to the finish point at the National Trust's Saltram Park. In the park National Cycle Route 27 runs along a splendid traffic free trail through Saltram Wood and along the River Plym. There's also lots of walking trails to explore 500 acres of woodland, farmland, beaches, saltmarshes, meadows and river estuary. You can extend the route by continuing south and then west to visit the city of Plymouth.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At one end of the route at Clearbrook there's the Skylark Inn for some refreshment. They serve good quality food and have a lovely garden area to relax in. You can find them at postcode PL20 6JD for your sat navs. At the other end of the route there's a decent National Trust cafe at Saltram House."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The 22 mile Drakes Trail uses part of the trail. It starts in Tavistock and visits the Tavistock Canal and Grenofen Bridge before linking up with the trail. The route is named after the explorer Sir Francis Drake who was born in Tavistock and has a statue in Plymouth."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sl-OUEQhAUM",
  "postcode": "PL20 6JD",
  "district": "West Devon",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Plym Valley Trail, Buckland Monachorum, West Devon, Devon, England, PL20 6JD, United Kingdom",
  "state": "England"
}