{
  "objectID": "8e97e01e6b7916d70315dfbac459d1a6",
  "created_at": "2024-12-21T15:54:47.787026+00:00",
  "ref": "slieve-donard-walking-route",
  "title": "Slieve Donard Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/09/Slieve_Donard_-_geograph.org.uk_-_1138189.jpg",
  "nearby": [
    {
      "description": "Tollymore Forest Park",
      "objectID": "f0271d44fdfb8a5a6b67b0a3eda32f3c",
      "ref": "tollymore-forest-park-walking-route"
    },
    {
      "description": "Murlough Bay",
      "objectID": "2f99850f359f5ab3c25b3abdab6894a0",
      "ref": "murlough-bay-walking-route"
    },
    {
      "description": "Slieve Binnian",
      "objectID": "ff6e4f6ba1ffd2029a9bab5c036d8f3a",
      "ref": "slieve-binnian-walking-route"
    },
    {
      "description": "Trassey Track",
      "objectID": "fdcc393415e8b6c39921493910374cf6",
      "ref": "trassey-track-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/57222AE19151BE5080257F9B00347017/$FILE/Slieve Donard.gpx",
  "_geoloc": {
    "lat": 54.2052236389,
    "lng": -5.8953620577
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Slieve_Donard_-_geograph.org.uk_-_1138189.jpg",
      "title": "Ross [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A view of Sleive Donard from south-western edge of Annalong. The south face of Donard, the Mourne Wall is prominent as it rises towards the summit through the snow on the higher ground. The ridge in the foreground is known as the Bog of Donard."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Slieve_Donard_%28late_morning%29_-_geograph.org.uk_-_971294.jpg",
      "title": "Albert Bridge / Slieve Donard (late morning), via Wikimedia Commons",
      "caption": "Slieve Donard (late morning)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Slieve_Donard_-_geograph.org.uk_-_830112.jpg",
      "title": "Albert Bridge / Slieve Donard, via Wikimedia Commons",
      "caption": "Donard dominates the view from Newcastle but it's not often as clear as this - sometimes a sign that rain is due."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Newcastle_and_the_Mournes_-_geograph.org.uk_-_562181.jpg",
      "title": "Albert Bridge / Newcastle and the Mournes, via Wikimedia Commons",
      "caption": "The view of a thousand postcards \u0096 Newcastle promenade with the cloud-capped Mournes in the background. Donard forest is in the middle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Slieve_Donard_Summit_Cairn_-_geograph.org.uk_-_1521811.jpg",
      "title": "Dean Molyneaux / Slieve Donard Summit Cairn, via Wikimedia Commons",
      "caption": "Slieve Donard Summit Cairn. This cairn is the highest point in Northern Ireland - at 852 metres (2,795 feet) above Mean Sea Level. There is memorial on top to a mountaineer who was killed by a lightning strike in 2006."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/59/The_summit_of_Slieve_Donard_-_geograph.org.uk_-_103268.jpg",
      "title": "Colin Park / The summit of Slieve Donard, via Wikimedia Commons",
      "caption": "The summit of Slieve Donard. The summit of Slieve donard is crowned by a square shelter with a trig point on top. Picture taken from the Great Cairn nearby."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2d/The_path_up_to_Slieve_Donard_-_geograph.org.uk_-_1521933.jpg",
      "title": "Dean Molyneaux / The path up to Slieve Donard, via Wikimedia Commons",
      "caption": "This well established path is the main route to Northern Ireland's highest peak"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1a/Sun%2C_snow_and_Slieve_Donard_-_geograph.org.uk_-_1148118.jpg",
      "title": "Albert Bridge / Sun, snow and Slieve Donard, via Wikimedia Commons",
      "caption": "Sunny and snowy Slieve Donard lit by a celestial spotlight - seen from the Islands Park"
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to the highest peak in Northern Ireland on this challenging walk in the Mourne Mountains. It's a beautiful area with a waterside section along the Glen River a real highlight of the walk. The river has rocky pools, pretty waterfalls and surrounded by attractive woodland. The climb to the summit passes along the Mourne Wall which runs for 22 miles over 15 mountains. It was constructed in the early part of the 20th century. The walk starts from the attractive coastal town of Newcastle in County Down. After leaving the car park in Donard Park the route heads through the Scots Pine and Oak of Donard Forest. You'll follow the lovely Glen River Path to the Mourne Wall where you turn left to reach the 850m (2,789 ft) summit. From here the views are spectacular with Newcastle Beach, the Isle of Man, Scotland and Wales all visible on a clear day. Also at the summit you will find a small stone tower and two prehistoric burial cairns. If you would like to extend your walking in the area then you could visit the nearby Tollymore Forest Park with its riverside walks and waymarked, woodland walking trails. Also nearby is the splendid Murlough Bay National Nature Reserve where there is a beautiful sand dune system, woodland trails and a wonderful beach. For an easy stroll around Newcastle head to the pretty Islands Park in the town. It lies on the banks of the Shimna and Tullybrannigan Rivers, between the Bryansford Road, Bryansford Avenue and the Shimna Road.",
  "video_url": "https://www.youtube.com/embed/nzILDcL2YsA"
}