{
  "created_at": "2025-01-06T01:23:32.239617+00:00",
  "objectID": "8ec1513a01050ba2e28dd38672ce8744",
  "ref": "skipsea-walking-route",
  "title": "Skipsea Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/57/Skipsea_Castle.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8ec1513a01050ba2e28dd38672ce8744.gpx",
  "_geoloc": {
    "lat": 53.9780618794,
    "lng": -0.22095083
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Skipsea_Castle.jpg",
      "title": "Phil Williams, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The remains of Skipsea castle, a large motte, viewed across farmland from the south. Footings of a stone gatehouse lie upon the top of the 11thC motte. During a brief rebellion in 1221 against the King, William de Forz, Count of Aumale was ordered to relinquish his estates, this included Skipsea Castle, which was destroyed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Castle_bailey_cattle_-_geograph.org.uk_-_2472961.jpg",
      "title": "Castle bailey cattle by Richard Croft, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Castle bailey cattle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Skipsea_Cliff_looking_north_-_geograph.org.uk_-_2612969.jpg/512px-Skipsea_Cliff_looking_north_-_geograph.org.uk_-_2612969.jpg",
      "title": "Skipsea Cliff looking north by JThomas, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Skipsea Cliff looking north"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Clifftop_cabins_at_Skipsea_-_geograph.org.uk_-_1012552.jpg",
      "title": "Gordon Hatton / Clifftop cabins at Skipsea",
      "caption": "Clifftop cabins and erosion. A 2008 attempt to recreate a photo taken here in 1990, although it proved impossible to stand in the same spot or to recognise the buildings that still exist. [see other photo in this square]. Erosion has taken a lane, the front gardens and some of the cabins. Those that remain are part abandoned, whilst some have physically shrunk as bits have toppled over the edge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Skipsea_Cliff_-_geograph.org.uk_-_425615.jpg",
      "title": "Paul Glazzard / Skipsea Cliff",
      "caption": "One of many concrete relics of World War 2 on the East Riding of Yorkshire coast north of Hornsea. This pillbox (or what's left of it) would originally have been some way inland but decades of coastal erosion have left it stranded on the beach."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Soft_Cliffs_Above_Skirlington_Sands.jpg",
      "title": "JThomas / Soft Cliffs Above Skirlington Sands",
      "caption": "Soft Cliffs Above Skirlington Sands"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Atwick_Sands_-_geograph.org.uk_-_63671.jpg",
      "title": "Stephen Horncastle / Atwick Sands",
      "caption": "Atwick Sands"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Atwick_Cross.jpg",
      "title": "Steve Brown, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Atwick Cross"
    }
  ],
  "distance_km": 8.6,
  "description": "This coastal village is located in the East Riding of Yorkshire. It's a nice place for a stroll with a historic castle, beach walks and a Grade I listed 11th century church to see. This walk from the village takes you to Skipsea Castle before heading to Skipsea Sands for an easy walk along the beach to the neighbouring village of Atwick. The walk starts in the village centre and heads west to visit Skipsea Castle. The site is run by English Heritage and includes the remains of a Norman motte and bailey castle, dating from before 1086. You can climb to the top of the mound and enjoy some nice views over the area. The site also includes an Iron Age fort and an information board with more details. The castle can be found at Beeford Road, YO25 8TH. After exploring the castle the walk then heads east back to the village before following a pleasant country lane to the coast. Here you can enjoy a walk south along the beach to the neighbouring village of Atwick, passing the Far Grange Park golf course and holiday caravan sites. On the way you will see evidence of significant coastal erosion which has left some properties very close to the edge.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Board Inn can be found at Back Street with postcode YO25 8SW. They serve good quality dishes and have a nice garden area to sit out in. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "A few miles to the west of the village there's another local walking highlight at the delightful Tophill Low Nature Reserve. The reserve includes two pretty reservoirs and easy footpaths along the River Hull. It's a great place for birdwatching with several hides dotted around the site. Near here is also the worthy vlllage of Brandesburton with its medieval church and historic 16th century pub. To the south there's the popular Hornsea Mere. The expansive mere has more nice waterside trails and wildlife. There's also the opportunity to visit the seaside resort of Hornsea and enjoy a stroll along the prom. Just south of here there's also Burton Constable where you'll find an historic old hall surrounded by Capability Brown landscaped parkland and gardens."
    }
  ],
  "video_url": "https://www.youtube.com/embed/coE8_s518f8",
  "district": "Skipsea",
  "county": "East Riding of Yorkshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Back Street, Skipsea Brough, Skipsea, East Riding of Yorkshire, England, YO25 8SZ, United Kingdom",
  "postcode": "YO25 8SZ",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "coastal",
    "beach"
  ],
  "points_of_interest": [
    "historical sites",
    "views"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "beach walking"
  ]
}