{
  "created_at": "2025-01-06T03:00:30.440883+00:00",
  "objectID": "8f3261170881905f7bbcf823178d5a59",
  "ref": "rawtenstall-walking-route",
  "title": "Rawtenstall Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Bank_Street_Rawtenstall_-_geograph.org.uk_-_470955.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8f3261170881905f7bbcf823178d5a59.gpx",
  "_geoloc": {
    "lat": 53.7003718761,
    "lng": -2.2870705832
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Bank_Street_Rawtenstall_-_geograph.org.uk_-_470955.jpg",
      "title": "robert wade / Bank Street Rawtenstall",
      "caption": "Bank Street Rawtenstall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Rawtenstall_Cricket_Ground_-_geograph.org.uk_-_688677.jpg",
      "title": "Alexander P Kapp / Rawtenstall Cricket Ground",
      "caption": "Rawtenstall Cricket Ground"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/River_Irwell%2C_Rawtenstall.jpg",
      "title": "Robert Wade, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Irwell, Rawtenstall"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/Rawtenstall_-_geograph.org.uk_-_386395.jpg",
      "title": "Paul Anderson / Rawtenstall",
      "caption": "The junction of St Marys Way and Bank Street. The mill on the left is Ilex Mill which now houses people instead of looms."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Scout_Moor_High_Level_Reservoir_-_geograph.org.uk_-_557616.jpg",
      "title": "Paul Anderson / Scout Moor High Level Reservoir",
      "caption": "Scout Moor High Level Reservoir. Looking down the valley from the Rossendale Way footpath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Pennine_Bridleway_beneath_Cowpe_Lowe_-_geograph.org.uk_-_123868.jpg",
      "title": "michael ely / Pennine Bridleway beneath Cowpe Lowe",
      "caption": "Pennine Bridleway beneath Cowpe Lowe. Cowpe Lowe is the flat-topped hill (440m) on the skyline. The Pennine Bridleway goes right to Waterfoot and left to Top o'the Leach on Rooley moor."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Remains_of_old_coal_workings_on_Grain_Brook_-_geograph.org.uk_-_491006.jpg",
      "title": "Mike Lee / Remains of old coal workings on Grain Brook",
      "caption": "Remains of old coal workings on Grain Brook The stone structure in the foreground is all that remains of a stone arched bridge. Parts of the arch still spanned the brook until around 2000."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/River_Irwell_-_geograph.org.uk_-_516812.jpg",
      "title": "robert wade / River Irwell",
      "caption": "River Irwell. Towards Townsend Fold."
    }
  ],
  "distance_km": 17.0,
  "description": "This Lancashire based town is in a great place for exploring the River Irwell and the Rossendale Valley. There's also miles of footpaths and hill climbs over the surrounding Pennine Moors to enjoy. This route makes use of sections of the Irwell Sculpture Trail, the Pennine Bridleway and the Rossendale Way to create a circular walk around the town. The walk starts near the town centre near the train station on the heritage East Lancs Railway. You can pick up the Irwell Sculpture Trail and follow the waymarked footpath east along the river towards Hareholme and Waterfoot. Here you can pick up the Pennine Bridleway and follow the shared cycling and walking trail south towards Cowpe Lowe and Black Hill. You then pick up the Rossendale Way and follow it south to Tottington Higher End Moor, passing Scout Moor and Whittle Hill to your west. At the Grain Brook the route bends to the west passing Turf Moor and Fecit Hill before coming back to the River Irwell near Chatterton. Follow the riverside trail north and it will take you past Ewood Bridge before returning to Rawtenstall.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Buffer Stops pub is located at Rawtenstall train station on the East Lancs Railway. It's a nice place to enjoy a drink and watch the old steam trains go by. They have a great selection of ales with the pub a key stop on the Rail Ale Trail. On the experience you can hop on and hop off all along the East Lancashire Railway line, stopping at some of the oldest and most popular pubs in the Irwell Valley. You can find the bar on the platform at postcode BB4 6EH."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The moorland and hills make for a fine walk for fit dogs. The Buffer Stops mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "One of the highlights in the town is the excellent Whitaker Museum and Art Gallery. There's some fine exhibitions, documentary films, a fascinating art collection and picturesque gardens to stroll around in afterwards. Entry is free and the museum can be found on Haslingden Road at postcode BB4 6RE. You could extend the walk by continuing south west to the iconic Peel Tower where you can enjoy fine views over the area. To the west there's some nice waterside trails along Calf Hey Reservoir and Ogden Reservoir to try. In this area there's also the worthy village of Irwell Vale with its views of the River Ogden and historic terraced mill cottages and gothic church. For more walking ideas in the area see the Lancashire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/M1vqtYfvreM",
  "postcode": "BB4 7NJ",
  "district": "Rossendale",
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Denpoint, Bacup Road, Wood Top, Rawtenstall, Rossendale, Lancashire, England, BB4 7NJ, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "river"
  ],
  "points_of_interest": [
    "sculpture trail",
    "heritage railway",
    "moor"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}