{
  "created_at": "2025-01-06T03:18:52.800700+00:00",
  "objectID": "8fd58c61401667325a7a2edc05c97744",
  "ref": "badbury-rings-walking-route",
  "title": "Badbury Rings Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Badbury_Rings%2C_main_entrance%2C_innermost_ring.JPG/512px-Badbury_Rings%2C_main_entrance%2C_innermost_ring.JPG",
  "nearby": [
    {
      "description": "Kingston Lacy",
      "objectID": "cfe06bfc630a817ec4f816223f21c4f8",
      "ref": "kingston-lacy-walking-route"
    },
    {
      "description": "Wimborne",
      "objectID": "f745c78a06af6691aa3792f304c90c69",
      "ref": "wimborne-walking-route"
    },
    {
      "description": "Stour Valley Way",
      "objectID": "6815ecc39ffffa3cbc2225ad8d6071ca",
      "ref": "stour-valley-way-walking-route"
    },
    {
      "description": "Witchampton",
      "objectID": "563dc9be3eb589183e799838e231292c",
      "ref": "witchampton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8fd58c61401667325a7a2edc05c97744.gpx",
  "_geoloc": {
    "lat": 50.8202262218,
    "lng": -2.0493175685
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Badbury_Rings%2C_main_entrance%2C_innermost_ring.JPG/512px-Badbury_Rings%2C_main_entrance%2C_innermost_ring.JPG",
      "title": "By Gaius Cornelius (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons",
      "caption": "Badbury Rings, main entrance, innermost ring. Many believe that Badbury is Mount Badon where King Arthur defeated the Saxons."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Entrance_to_Badbury_Rings%2C_2010.jpg/512px-Entrance_to_Badbury_Rings%2C_2010.jpg",
      "title": "By Jim Champion from Southampton, UK (Badbury Rings) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Ditches and ramparts at Badbury Rings - looking to the right as you go in through the hillfort entrance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Badbury_Rings_-_geograph.org.uk_-_37236.jpg",
      "title": "Dennis Turner / Badbury Rings",
      "caption": ". Ancient earthworks on the northern edge of this grid square. Iron Age hill fort dating from 150 BC, now in the care of the National Trust. Along the road originally built by the Romans to link Salisbury with Dorchester."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Badbury_Rings_-_geograph.org.uk_-_348095.jpg",
      "title": "Peter Facey / Badbury Rings",
      "caption": "On the occasion of the Mitsubishi Motors Countryside Alliance Point-to-Point. The point-to-point course is roughly circular and runs in front of the parked cars and behind photographer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Badbury_Rings%2C_pond_-_geograph.org.uk_-_1205247.jpg",
      "title": "Mike Faherty / Badbury Rings, pond",
      "caption": "Pond (the warning sign says water is deep) in the central enclosure of the hill-fort. As the pond never seems to dry out, it is presumably fed by a spring, and so would have been a vital source of water when the fort was in use."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Point_to_point_course%2C_Badbury_Rings_-_geograph.org.uk_-_1714536.jpg",
      "title": "Trish Steel / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Point to point course, Badbury Rings. Point to point racing dates way back to the 1800s. Hunting men used to race each other across the countryside, from steeple to steeple as they passed different villages. These steeples would be called points and hence the derivation of the name point to point."
    }
  ],
  "distance_km": 4.0,
  "description": "Climb this Iron Age hill fort and enjoy wonderful views across the Dorset countryside on this circular walk near Wimborne. The route starts at the car park on Blandford Road and takes you around Badbury Rings on good footpaths. The countryside surrounding the fort is very attractive with woodland, fields and nice views towards Kingston Lacy. You'll also pass the ancient woodland of the Oaks which was planted in the 14th century. The site has evidence of Bronze Age, Iron Age and Roman occupation. It is named after the Iron Age hill fort with the three rings, which date from around 500 to 600 BC. If you would like to continue your walk then you could visit the nearby Kingston Lacy. Here you will find miles of walking trails through woodland and attractive parkland and gardens.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Nearby Kingston Lacy has a nice on site cafe with a courtyard. The Anchor Inn in nearby Shapwick is a good option. It's a lovely pub with a good menu and some outdoor seating for fine days. You can find the pub just south east of the site at a postcode of DT11 9LB for your sat navs. The little village of Shapwick is also a nice place for another stroll with the River Stour running through it. You could actually pick up the waymarked Stour Valley Way here and follow it towards Sturminster Marshall if you're still feeling energetic. The Red Lion in the pretty village has a particularly attractive garden with country views. Spetisbury is also near here and worthy of a visit. Here you can enjoy a climb to the Spetisbury Rings Iron Age Hill Fort. There are some lovely views over the area from the top of the ancient fort."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The fort and the surrounding woodland are a fine place for a dog walk. You are advised to keep them on leads as there is a lot of livestock and nesting birds in the area. The Anchor Inn mentioned above is also very dog friendly and will provide dog biscuits too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east there's the pretty village of Witchampton where you can visit the 19th century watermill on the River Allen. It's a picturesque spot with a 15th century church and the nearby Crichel Park to see as well. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/P1uZVeFJGjA",
  "county": "Dorset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}