{
  "created_at": "2025-01-06T00:57:45.920685+00:00",
  "objectID": "8fd96eb09fdf54537535dd3802ee361a",
  "ref": "velvet-bottom-circular-walk-walking-route",
  "title": "Velvet Bottom Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/85/Velvet_Bottom_-_geograph.org.uk_-_1007936.jpg",
  "nearby": [
    {
      "description": "Cheddar Gorge",
      "objectID": "670588568e5784bafdbeb40078ef6507",
      "ref": "cheddar-gorge-walking-route"
    },
    {
      "description": "Cheddar Reservoir",
      "objectID": "e10c903d2daf1b8614b1867cc5a3e388",
      "ref": "cheddar-reservoir-walking-route"
    },
    {
      "description": "Axbridge",
      "objectID": "d999f5fa4a6a78a18465e1063b442905",
      "ref": "axbridge-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/8/8fd96eb09fdf54537535dd3802ee361a.gpx",
  "_geoloc": {
    "lat": 51.2874206225,
    "lng": -2.7434966605
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/Velvet_Bottom_-_geograph.org.uk_-_1007936.jpg",
      "title": "Ken Grainger / Velvet Bottom, via Wikimedia Commons",
      "caption": "Velvet Bottom 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Velvet_Bottom_-_geograph.org.uk_-_1007941.jpg",
      "title": "Ken Grainger / Velvet Bottom, via Wikimedia Commons",
      "caption": "Velvet Bottom 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Dams_in_Velvet_Bottom_-_geograph.org.uk_-_1204650.jpg",
      "title": "Rick Crowley / Dams in Velvet Bottom, via Wikimedia Commons",
      "caption": "Dams in Velvet Bottom. These were solid stone walls that could have been used to make large ponds (buddle pits?) in which lead ore could have settled and be recovered. The area is high in lead content."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Lead_Mine_top_of_Velvet_Bottom_-_geograph.org.uk_-_1204673.jpg",
      "title": "Rick Crowley / Lead Mine top of Velvet Bottom, via Wikimedia Commons",
      "caption": "Lead Mine top of Velvet Bottom. Remains of a surface mine for lead. This is known as \"gruffy ground\" since the deep trenches were known as gruffs or grooves."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Nice_sunny_day_at_Black_Rock_-_geograph.org.uk_-_121176.jpg/512px-Nice_sunny_day_at_Black_Rock_-_geograph.org.uk_-_121176.jpg",
      "title": "Jon Bryant / Nice sunny day at Black Rock",
      "caption": "Nice sunny day at Black Rock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Lime_Kiln%2C_Black_Rock_-_geograph.org.uk_-_2767290.jpg/512px-Lime_Kiln%2C_Black_Rock_-_geograph.org.uk_-_2767290.jpg",
      "title": "Lime Kiln, Black Rock by Chris Andrews, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lime Kiln, Black Rock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Lead_Slag_-_geograph.org.uk_-_1204082.jpg",
      "title": "Rick Crowley / Lead Slag",
      "caption": "Lead slag produced when old waste heaps were re-smelted in the 19th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Mendip_Adventure_Base_-_geograph.org.uk_-_1204123.jpg",
      "title": "Rick Crowley / Mendip Adventure Base",
      "caption": "Mendip Adventure Base. Set in a sheltered place South of Manor Farm, East of the old mining area."
    }
  ],
  "distance_km": 5.0,
  "description": "This circular walk explores Velvet Bottom, a nature reserve in a dry limestone valley, located just to the north east of Cheddar Gorge. The route runs for just under 3 miles using the public footpaths heading east from the gorge. There's some moderate climbing on the way with the path reaching over 800ft at the high points. There's nice views over the Mendip Hills and some attractive countryside to see from here. The area is also includes the Ubley Warren nature reserve so look out for wildlife including Roe deer, Longtailed tit, Peregrine falcon, Silver washed fritillary butterflies. There's also interesting flora with Common rock-rose and bluebells in Longwood in the spring months. Velvelt Bottom is also the site of lead mines on what is known as 'gruffy ground' since the deep trenches were known as gruffs or grooves. You can also see the remains of the dams which were solid stone walls that could have been used to make large ponds in which lead ore could have settled and be recovered. Start the walk from the roadside parking at Black Rock on Cliff Road. The pick up the footpaths heading east around Warren Farm, before looping back to the car park. To continue your walking in the area you could try our circular walk around Cheddar Gorge. It's England's largest gorge at 400 feet deep and three miles long making it one of the most magnificent natural visitor attractions in the country. The historic town of Axbridge and the picturesque Cheddar Reservoir are also near here. The West Mendip Way long distance footpath also passes through the area and is a great way to explore the Mendip Hills on a good, waymarked trail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your exercise head to the White Hart in Cheddar for some well earned refreshments (Postcode:BS27 3QN). Here you can enjoy a ploughman's lunch and a decent pint of Cheddar Ale in the nice beer garden.There's also the popular Lion Rock Tea Rooms. Nestled in the heart of Cheddar Gorge in one of the oldest, most photographed and documented buildings beneath the World Famous Lion Rock. You can find it on the Cliffs Road at postcode BS27 3QE. Just to the east of the site is the pretty village of Compton Martin. Here you will find a noteworthy Norman church and the picturesque millpond which is the source of the Congresbury Yeo River. There's also the The Ring O' Bells, an historic pub dating back to the 16th century. There's a wonderful old interior with plenty of original features such as dark wooden beams, wooden flooring, stone walls and a large inglenook fireplace. Outside there's a fantastic, large beer garden with views of the surrounding countryside. It's a great place to relax in on warmer days. You can find them at postcode BS40 6JE for your sat navs. They are dog friendly."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BP3I3E3URCU",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cliff Road, Cheddar, Somerset, England, BS40 7XT, United Kingdom",
  "postcode": "BS40 7XT",
  "district": "Cheddar",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "valley",
    "hill"
  ],
  "points_of_interest": [
    "countryside",
    "wildlife"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}