{
  "created_at": "2025-01-06T03:59:23.337718+00:00",
  "objectID": "e016f27e7e61d59b93cae067b96b5347",
  "ref": "bewl-water-walking-and-cycle-route",
  "title": "Bewl Water Walks and Cycling",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Bewl_Water.jpg/512px-Bewl_Water.jpg",
  "nearby": [
    {
      "description": "Bedgebury Forest",
      "objectID": "a2d58bd9826e0215d56b2b4976926319",
      "ref": "bedgebury-forest-walking-and-cycle-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "Scotney Castle",
      "objectID": "6e932dac1985933614652a1a687702d3",
      "ref": "scotney-castle-walking-route"
    },
    {
      "description": "Wadhurst",
      "objectID": "609364f43ef19476e2195d63525cb5ae",
      "ref": "wadhurst-walking-route"
    },
    {
      "description": "Lamberhurst",
      "objectID": "a487ca18954784289c7322aae08ed7a0",
      "ref": "lamberhurst-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e016f27e7e61d59b93cae067b96b5347.gpx",
  "_geoloc": {
    "lat": 51.0790432829,
    "lng": 0.3876982022
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Bewl_Water.jpg/512px-Bewl_Water.jpg",
      "title": "By Stevevx220 (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Bewl Water"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Bewl_Water_%28formerly_Bewl_Bridge_Reservoir%29_-_geograph.org.uk_-_166220.jpg",
      "title": "Tim Knight [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bewl Water (formerly Bewl Bridge Reservoir). Picture taken whilst the water level was quite low during March 2006.Looking North from the south bank near Three-Leg Cross, Ticehurst, East Sussex"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/23/Tower_at_Bewl_Water_Reservoir_-_geograph.org.uk_-_1517276.jpg",
      "title": "Oast House Archive / Tower at Bewl Water Reservoir",
      "caption": "View of the tower at the reservoir. After a dry summer the water is lower than it should be, as indicated by the lines along the dam behind."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Sailing_Club_at_Bewl_Water_Reservoir_-_geograph.org.uk_-_1517296.jpg",
      "title": "Oast House Archive / Sailing Club at Bewl Water Reservoir",
      "caption": "Sailing Club. The reservoir was created between 1973 and 1975. Being the largest inland area of water in the South East it is ideal for sailing club and training. There are also fishing areas. There is a visitor centre and café, boat ride, with a 14 mile footpath around the reservoir which is open to horses and cyclist during the summer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Footpath_at_Bewl_Water_-_geograph.org.uk_-_939478.jpg",
      "title": "Oast House Archive / Footpath at Bewl Water",
      "caption": "Footpath at the eastern end of the site. Overy's Oast in background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Boats_on_Bewl_Water_Reservoir_-_geograph.org.uk_-_1517265.jpg",
      "title": "Oast House Archive / Boats on Bewl Water Reservoir",
      "caption": "Boats on the water. Rows of fishing boats and to the left 'The Swallow' tourist boat that sales from the main visitor centre. To park at the visitor centre incurs a charge, however you can also park on Bewlbridge Lane accessed from Cousley Wood, or at Rosemary Lane."
    }
  ],
  "distance_km": 20.0,
  "description": "This is a walking and cycling route around the beautiful Bewl Water reservoir near Lamberhurst. The route runs alongside the reservoir for most of the way though there is an inland section on quiet country lanes around Tolhurst. It runs for about 12.5 miles with great views of the High Weald AONB. Bike hire is available during the summer months from the Boat House Bistro. The area is also great for wildlife watching with Goldcrests, Long Tailed Tits, Wagtails, Skylarks and Lapwings in the woodland. Also look out for Kingfishers, Herons and the Great Crested Grebe on the water. Please note the route is not always open for cyclists during the winter months - please check the Bewl Water website before setting off. The Sussex Border Path long distance trail runs right past the reservoir so you could pick this up if you wanted to continue your walk. Just to the west of the reservoir is the town of Wadhurst which makes a nice alternative start point to the walk. It's a short walk through the countryside from the town to the lake and there's a nice choice of pubs for refreshments afterwards. Just to the east of the lake you will find Bedgebury Forest. The 2000 acre woods are an excellent place for extending your cycle or walk. There's miles of mountain bike trails with jumps and fun descents. For walkers there's the delightful Bedgebury Pinetum with 10,000 trees growing across 320 acres. The National Trust owned Scotney Castle is also nearby and well worth a visit.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Why not head to the Boat House Bistro after your exercise and enjoy some freshly caught trout from the reservoir. You can enjoy wonderful views over the lake from the restaurant or the outdoor Terrace too. You will find the Boat House near the car park at the northern end of the reservoir at postcode TN3 8JH.In the nearby village of Wadhurst you could try The Old Vine Inn on Cousley Wood Rd (Postcode:TN5 6ER). The 16th century pub now includes a fine South American restaurant. You could also head north and visit the little village of Lamberhurst. Here you'll find the excellent Vineyard. It's a great place on warmer days when you can join in the barbeque on their decking in the large pub garden. To the south there's Ticehurst where you can enjoy some local history at the Bell Inn. The original section of this old coaching inn, situated on the London to Hastings route, dates back to 1540."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The lake is a great place for dog walking but please keep your dog on a lead through the nature reserve area as they can disturb the wildlife."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Bewl Water is also widely used for watersports and leisure activities. These include sailing and windsurfing, rowing and sculling, Canoeing and Kayaking and trout fishing. There is also a passenger boat and a restaurant, conference facility and gift shop. The lake is located close to the notable town of Cranbrook. The small town is well worth exploring with a number of fine medieval buildings, a noteworthy church known as the 'Cathedral of the Weald' and a very photogenic working windmill to see. There's also an excellent, award winning micropub on the High Street to try. The Cranbrook Walk explores the town before heading to the nearby Sissinghurst Castle. The National Trust run castle is another major highlight of the area with its parkland, gardens and interesting history. To the south you can visit the worthy village of Burwash. Our circular walk from the village visits on of the area's highlights at the National Trust's Bateman's. The fine 17th century Jacobean house was the home of author Rudyard Kipling during the early part of the 20th century. You can explore the house and the surrounding gardens with some great views of the surrounding High Weald countryside. Head north and you can pick up the historic Lamberhurst Walk and visit the noteworthy Bayham Old Abbey. The site is run by English Heritage and includes substantial ruins dating back to the 13th century. There's also a fine 15th century pub in the village where you can relax after your exercise. For more walking ideas in the area see the High Weald Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/MWstb9BbAaM",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bewlbridge Lane, Wadhurst, Wealden, East Sussex, England, TN5 6HJ, United Kingdom",
  "postcode": "TN5 6HJ",
  "district": "Wealden",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical site",
    "wildlife watching",
    "natural landmark"
  ],
  "facilities": [
    "pub/cafe",
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}