{
  "created_at": "2025-01-06T03:00:27.418257+00:00",
  "objectID": "e01a71d3588bc90e2a4130a54fec60f7",
  "ref": "gurnards-head-walking-route",
  "title": "Gurnard's Head Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Gurnard%27s_Head%2C_Treen_-_geograph.org.uk_-_40807.jpg",
  "nearby": [
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "St Ives to Zennor",
      "objectID": "1a4be6eadce1af7e659cb7277cf0c986",
      "ref": "st-ives-to-zennor-walking-route"
    },
    {
      "description": "Penwith Moors and Men-An-Tol",
      "objectID": "3a2c6f423e3599ff802ae06a37474a46",
      "ref": "penwith-moors-and-men-an-tol-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e01a71d3588bc90e2a4130a54fec60f7.gpx",
  "_geoloc": {
    "lat": 50.1833909523,
    "lng": -5.5934169509
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Gurnard%27s_Head%2C_Treen_-_geograph.org.uk_-_40807.jpg",
      "title": "Jim Champion / Gurnard's Head, Treen",
      "caption": "Gurnard's Head, Treen. The promontory juts out northwards into the sea of the north Cornwall coast. The land is managed by the National Trust (as seen in the photo). The remains of an iron-age defensive wall are found at the narrowest point of the isthmus, which formed the entrance to Trereen Dinas promontory fort."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/View_towards_Gurnard%27s_Head_-_geograph.org.uk_-_1064539.jpg",
      "title": "Jim Champion / View towards Gurnard's Head",
      "caption": "View towards Gurnard's Head. This path zig-zags down to Lean Point. The headland in the distance is Gurnard's Head, home of the Trereen Dinas cliff castle. Part of a ruined engine house can be seen on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Gurnard%27s_Head_Hotel%2C_Treen_-_geograph.org.uk_-_40794.jpg",
      "title": "Jim Champion / Gurnard's Head Hotel, Treen",
      "caption": "Gurnard's Head Hotel, Treen. The hotel is located by a sharp bend in the north coast road at Treen (not the Treen on the south coast). The small lane to the right of the pub leads to the other houses in the tiny village, visitors can park on the verge of the main road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Gurnard%27s_Head_from_Lean_Point_-_geograph.org.uk_-_526050.jpg/256px-Gurnard%27s_Head_from_Lean_Point_-_geograph.org.uk_-_526050.jpg",
      "title": "Jim Champion / Gurnard's Head from Lean Point",
      "caption": "Gurnard's Head from Lean Point. The headland here is so-called because it supposedly resembles the head of a gurnard (fish). This view is across the sheltered sea, towards the headland from a less prominent prominence called Lean Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3c/Coastline_between_Gurnard%27s_Head_and_Boswednack_Cliff_-_geograph.org.uk_-_40825.jpg",
      "title": "Jim Champion / Coastline between Gurnard's Head and Boswednack Cliff",
      "caption": "Coastline between Gurnard's Head and Boswednack Cliff. This is the view southeast from the promontory towards Lean Point in the centre of the photo. As is often the case on the north Penwith coast there are the ruins of disused mine buildings on the cliffs. In the far distance is the ridge of Zennor Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Coastline_west_of_Zennor_Head_-_geograph.org.uk_-_1450803.jpg",
      "title": "Jim Champion / Coastline west of Zennor Head",
      "caption": "Coastline west of Zennor Head. View across to Carnelloe from the west side of Zennor Head. Sands of Veor Cove on the left and the prominent Gurnard's Head headland in the distance, Pendeen in the far distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Porthmeor_Point_-_geograph.org.uk_-_1110258.jpg",
      "title": "Bob Jones / Porthmeor Point",
      "caption": "Porthmeor Point Viewed from Carn Gloose. In the distance is Pendeen Point."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Gurnard%27s_Head_and_Ebal_Rocks_-_geograph.org.uk_-_1110274.jpg",
      "title": "Bob Jones / Gurnard's Head and Ebal Rocks",
      "caption": "Ebal Rocks below the headland. The tiny islet off the headland is one of two, known as the Ebal Rocks. In 1931 the steamer 'Lyminge' ran on to this rock while bound from Cardiff to Oporto carrying a cargo of coal. The crew and passengers rowed ashore to safety, only returning later to save the ship's cat."
    }
  ],
  "distance_km": 4.6,
  "description": "This circular walk visits a stunning headland on the Penwith coast in Cornwall. You can start the walk from the car park of the Gurnards Head Hotel in Treen. From here you can follow footpaths north past Treen Cove and Lean Point to the end of the promontory. It is so named because it is thought to resemble the head of the gurnard fish. Here there are fine views up the coast in both directions and down to Ebal Rocks below. You can then pick up a section of the South West Coast Path and follow it south west to Carn Gloos and Porthmeor Cove. The route then head south east to Lower Porthmeor before picking up a country lane to return to the hotel.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Gurnard's Head Hotel is the start and finish point for the walk. The pub boasts a large car park and a lovely garden area to relax in on warmer days. It's in a fine location with views to the coast and also has a good menu. You can find them at postcode TR26 3DE for your sat navs. A little to the south there's also The Rosemergy Farmhouse where you can enjoy a delicious cream tea. There's a delightful tea garden with stunning sea views onto the Atlantic Ocean and the North Cornish moors. The cafe is located close to the historic Carn Galver Engine House on the northern fringes of the Penwith Moors. Postcode is TR20 8YX. They are dog friendly."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The bracing walk is a fine one for fit dogs. The hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area you could pick up the longer St Ives to Zennor Walk. It's a popular route, passing along the dramatic cliff tops and visiting the Norman Church of Saint Senara on the way. Just to the south you can pick up the Penwith Moors and Men-An-Tol Walk. This fascinating walk visits several ancient sites including Men-An-Tol standing stones and the Lanyon Quoit dolmen. You'll also pass the remains of the old Ding Dong Mines and climb to the fine viewpoint at Carn Galver. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/56awtXLpIuM",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Treen, Zennor, Porthmeor, Cornwall, England, TR26 3DE, United Kingdom",
  "postcode": "TR26 3DE",
  "district": "Porthmeor",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "views"
  ],
  "facilities": [
    "car park",
    "pub/cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}