{
  "created_at": "2025-01-06T19:02:53.126097+00:00",
  "objectID": "e03d92124113671d0b158b22022bce14",
  "ref": "kylemore-abbey-walking-route",
  "title": "Kylemore Abbey Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Kylemore_Abbey_-_geograph.org.uk_-_4297418.jpg",
  "nearby": [
    {
      "description": "Clifden Castle",
      "objectID": "e31794d84b09b03a9f04541203ceab06",
      "ref": "clifden-castle-walking-route"
    },
    {
      "description": "Croagh Patrick",
      "objectID": "b02666b8291ead44bc9cba04340a7cd4",
      "ref": "croagh-patrick-walking-route"
    },
    {
      "description": "Lough Lannagh",
      "objectID": "552152e3ff6083e7c88db9c2b8ae8d61",
      "ref": "lough-lannagh-walking-route"
    },
    {
      "description": "Galway",
      "objectID": "64cc89dbb01d337c6cf783af7cd0486c",
      "ref": "galway-walking-route"
    },
    {
      "description": "Oughterard Wind Farm Walk",
      "objectID": "4d3ab97fccf3bcdb088aceebfeb4f8ff",
      "ref": "oughterard-wind-farm-walk-walking-route"
    },
    {
      "description": "Mount Gable",
      "objectID": "cc1c4ea5665ca8e0b76cbb7aed15fadf",
      "ref": "mount-gable-walking-route"
    },
    {
      "description": "Sky Road",
      "objectID": "e4ebebe9a87b4b691ede4386c708f58f",
      "ref": "sky-road-walking-route"
    },
    {
      "description": "Killary Fjord",
      "objectID": "8c96e9e255751c046f0c5c58d39e1614",
      "ref": "killary-fjord-walking-route"
    },
    {
      "description": "Derrigimlagh Bog",
      "objectID": "378fc2761c962a87c04a6bee386bbdec",
      "ref": "derrigimlagh-bog-walking-route"
    },
    {
      "description": "Inishbofin",
      "objectID": "160b75a175b0bf5ef71adc42b201c2ea",
      "ref": "inishbofin-walking-route"
    },
    {
      "description": "Clare Island",
      "objectID": "e857fa479c59956ac99d87eb84771710",
      "ref": "clare-island-walking-route"
    },
    {
      "description": "Ballynahinch Castle",
      "objectID": "4681d14413099aee0ce02bbffe1433ee",
      "ref": "ballynahinch-castle-walking-route"
    },
    {
      "description": "Lough Inagh",
      "objectID": "62adc1134cf10e0f5a41a9fc3769d6c3",
      "ref": "lough-inagh-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e03d92124113671d0b158b22022bce14.gpx",
  "_geoloc": {
    "lat": 53.55956,
    "lng": -9.89094
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Kylemore_Abbey_-_geograph.org.uk_-_4297418.jpg",
      "title": "Kylemore Abbey by Ian Capper, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Kylemore Castle was built in 1868 as a private home for the family of Mitchell Henry, a wealthy doctor from London whose family was involved in textile manufacturing in Manchester. The abbey was later founded for Benedictine Nuns who fled Belgium in World War I and since 2022 belongs to the English Benedictine Congregation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Kylemore_Abbey_gardens_-_geograph.org.uk_-_964960.jpg",
      "title": "Graham Horn / Kylemore Abbey gardens",
      "caption": "Kylemore Abbey gardens. At the top of the picture, the grey building is \"the bothy\" where the under-gardeners ate and slept. To the left is a white and pale blue building that was the house of the head gardener, with panorama windows over the whole garden so he could keep an eye on what was going on at all times."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/91/Pollacappul_Lough_from_Kylemore_Abbey_-_geograph.org.uk_-_964939.jpg",
      "title": "Graham Horn / Pollacappul Lough from Kylemore Abbey",
      "caption": "Pollacappul Lough from the Abbey. This is the view that Mitchell Henry and his family would have had from their drawing room which is just to the left. This is the front courtyard of the house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e9/Kylemore_Abbey_gardens_-_geograph.org.uk_-_964958.jpg",
      "title": "Graham Horn / Kylemore Abbey gardens",
      "caption": "Part of the Victorian walled garden. This is one of the walkways for the Mitchell family and their guests, with hedges to avoid them seeing the gardeners at work."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Kylemore_Abbey_-_geograph.org.uk_-_964931.jpg",
      "title": "Graham Horn / Kylemore Abbey",
      "caption": "The classic first view from the car park. But it is amazing how many people just snapped and left out the boat and jetty which I thought added to the scene."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Kylemore_Abbey_gardens_-_geograph.org.uk_-_964955.jpg",
      "title": "Graham Horn / Kylemore Abbey gardens",
      "caption": "This is just part of the Victorian garden that Mitchell Henry developed near the abbey. At one time it had 21 glass houses. Two remain and the others are part of a long-term (to 2016) restoration project."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Henry_mausoleum_-_geograph.org.uk_-_964950.jpg/256px-Henry_mausoleum_-_geograph.org.uk_-_964950.jpg",
      "title": "Graham Horn / Henry mausoleum",
      "caption": "Henry mausoleum. This is the small mausoleum that Mitchell Henry (owner of Kylemore Abbey) had built for his wife Margaret, when she died, aged just 45, in 1875. He died in 1910 and is also buried here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Connemara_-_Kylemore_Lough_-_Southern_shoreline_-_geograph.org.uk_-_1630220.jpg",
      "title": "Joseph Mischyshyn / Connemara - Kylemore Lough - Southern shoreline",
      "caption": "Kylemore Lough. Southern shoreline. View is from walkway along northern shore."
    }
  ],
  "distance_km": 3.1,
  "description": "This walk explores the beautiful Kylemore Abbey Estate in Connemara, County Galway. The estate includes lakeside trails, stunning Victorian Walled gardens, peaceful woodland paths and views of the surrounding Twelve Bens Mountains. It's a special place and one of the major highlights of the area. This walk follows a nice surfaced path running along Kylemore Lough towards the Gothic church on the northern side of the water. It's an easy trail with some attractive woodland and fine views over the lake. The impressive looking church was built in honour of the Mitchell's wife who passed away in Cairo. It can can seat about 50 people and has one stained glass. The centrepiece of the estate is the magnificent 19th century abbey. The photogenic building was built in the neo-gothic architectural style and has been likened to a farytale castle. To continue your walking in the area head north east to visit the stunning Killary Fjord. There's some wonderful scenery here with the fjord flanked by the mountains of Mweelrea and Ben Gorm.",
  "details": [
    {
      "subtitle": "Dog Walking",
      "content": "The estate grounds are a lovely place for a dog walk, though they are not allowed inside the abbey. Please keep them on leads. There are doggy bags at the Ticket Cabin and Visitor Centre."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "About a half hour drive to the south west there's some more interesting local history at Clifden Castle. There's a nice circular walk around the early 19th century ruined manor house, the surrounding farmland and Clifden Bay. You can also pick up the walk along the scenic Sky Road to the coast. Just to the south of the castle there's Derrigimlagh Bog where you can visit two interesting historic sites. The remote and secluded location served as the crash site for John Alcock and Arthur Whitten Brown in 1919, during their historic non-stop flight across the Atlantic. There is a memorial here to commemorate the event. The site is also the location of the Marconi wireless transmitting station. Nearby you can also explore the beautiful grounds of the 18th century Ballynahinch Castle. Here you can enjoy beautiful gardens, a picturesque lake, ancient woodland and glorious views of the surrounding Twelve Bens mountain range. About an hours drive north there's the climb to the holy mountain of Croagh Patrick. There's a Pilgrimage Trail to the summit where you can enjoy glorious views over Westport Bay, Clew Bay and the Mayo mountains. To the east there's the wonderful Ashford Castle. The medieval/Victorian castle includes beautiful grounds, riverside trails and a popular hawk walk. It is located on the Galway side of Lough Corrib, the largest lake in the Republic of Ireland. In this area you can also try the Oughterard Wind Farm Walk. The scenic circular walk explores the expansive Galway Wind Park, Ireland's largest on shore windfarm. To the north of Lough Corrib there's the climb to Mount Gable where you can enjoy some wonderful views back down to the lough and to the coast. To the north east is Castlebar where there's a lovely waterside circular trail around Lough Lannagh. Head south and there's the attractive city of Galway where there's pleasant trails along the River Corrib and the coast. To the west there's Cleggan where you can catch the ferry to Inishbofin island. There's a waymarked circular loop walk here passing rugged cliffs, a photogenic ruined fort, pretty lakes and stone beaches. Near here there's also Clare Island which you can reach from Roonagh Pier near the small town of Louisburgh. The island has strong associations with the notorious Grace O'Malley, the 'pirate queen' of the 16th century."
    }
  ],
  "video_url": "https://www.youtube.com/embed/H8Uidlx16hQ",
  "gazetteer_found": false
}