{
  "objectID": "e0432a04212686748dceea785dad338f",
  "created_at": "2024-12-21T16:58:06.756440+00:00",
  "ref": "knocknarea-walking-route",
  "title": "Queen Maeve Trail Knocknarea Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Queen_Maeve%27s_Rocks.jpg/512px-Queen_Maeve%27s_Rocks.jpg?20140829192708",
  "nearby": [
    {
      "description": "Benbulben Forest",
      "objectID": "fef8d4791e5930b9f554162f489fc349",
      "ref": "benbulben-forest-walking-route"
    },
    {
      "description": "Mullaghmore Head",
      "objectID": "24aadf2f9a81ab47dce1a00cb314f0af",
      "ref": "mullaghmore-head-walking-route"
    },
    {
      "description": "Rougey Cliff Walk",
      "objectID": "6c67dffaac3a558aaa8065c0162a688b",
      "ref": "rougey-cliff-walk-walking-route"
    },
    {
      "description": "Glencar Waterfall",
      "objectID": "f6ed83ccfdd0d7f6938abf144170e413",
      "ref": "glencar-waterfall-walking-route"
    },
    {
      "description": "Lough Eske",
      "objectID": "ff0ec6265e3d4357fd668fb56dcc1efd",
      "ref": "lough-eske-walking-route"
    },
    {
      "description": "Killaspugbrone Loop",
      "objectID": "faaea933354a053c2e190599249e8970",
      "ref": "killaspugbrone-loop-walking-route"
    },
    {
      "description": "Lough Gill",
      "objectID": "312f47d812a541329b8574cd2a947415",
      "ref": "lough-gill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e0432a04212686748dceea785dad338f.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Queen_Maeve%27s_Rocks.jpg/512px-Queen_Maeve%27s_Rocks.jpg?20140829192708",
      "title": "Bennybulb, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Queen Maeve's Rocks.  Perched atop Knocknarea is a sizable cairn measuring approximately 55 metres (180 ft) in width and 10 metres (33 ft) in height, making it the largest cairn in Ireland outside Brú na Bóinne in Meath. While archaeologists have not conducted excavations on the site, the cairn exhibits many characteristics of a traditional passage tomb. Its flat-topped structure features several kerbstones, notably on the northern side, and is estimated to date back to around 3000 BCE, belonging to the Neolithic era. Referred to as Miosgán Meadhbha in Irish, meaning \"Meadhbh's heap,\" the cairn is commonly known as Maeve's Cairn or Maeve's Tomb in English. Meadhbh, a prominent figure in Irish mythology, is depicted as a queen of Connacht who was believed to have divine origins. Recognized as a protected National Monument, the ancient cairn has garnered concern from archaeologists in recent times due to erosion caused by hikers climbing on it and tampering with its stones. The significant foot traffic on the cairn has led to visible scars and may potentially destabilize the tomb concealed within. According to Irish folklore, damaging or showing disrespect to such tombs is considered unlucky and could incur a curse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Path_up_Knocknarea_-_geograph.org.uk_-_985471.jpg?20110223010344",
      "title": "Oliver Dixon / Path up Knocknarea",
      "caption": "Path up Knocknarea"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Summit_plateau%2C_Knocknarea_-_geograph.org.uk_-_985469.jpg?20110223014838",
      "title": "Oliver Dixon / Summit plateau, Knocknarea",
      "caption": "Summit plateau, Knocknarea. The summit of Knocknarea is adorned with the remnants of several ancient monuments, primarily consisting of small passage tombs and burial mounds. Among these, the most prominent is a partially-ruined cruciform passage grave situated approximately 50 meters north of Maeve's Cairn. Typically aligned in a North–South orientation, these tombs may have been intentionally positioned to face the Carrowmore passage tombs located to the east of Knocknarea. Unfortunately, some of these monuments suffered severe damage during the excavations conducted by antiquarians in the 19th century. During the Neolithic era, Knocknarea served as a significant site for rituals and gatherings. The eastern side of the hilltop is encircled by a 1-kilometre-long embankment, measuring 2 meters in width and 0.8 meters in height. Within this enclosure, archaeologists have uncovered evidence of hut sites, indicating human habitation. Additionally, a substantial amount of stone tool debris has been discovered in the vicinity, suggesting extensive tool manufacturing activities. The broader area surrounding Sligo Bay boasts a wealth of prehistoric remains, characterized by similar monuments and natural formations. From the vantage point of Knocknarea, one can behold other notable sites such as Croaghaun Mountain, Carrowkeel Megalithic Cemetery, and Cairns Hill. Notably, the Carrowmore passage tomb cemetery lies at the eastern foothills of Knocknarea, further highlighting the region's rich archaeological heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/11/East_side_of_Knocknarea_-_geograph.org.uk_-_2556627.jpg?20210901163437",
      "title": "East side of Knocknarea by Jonathan Wilkins, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "East side of Knocknarea"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Erratic_boulder_-_geograph.org.uk_-_2556616.jpg?20210901163139",
      "title": "Erratic boulder by Jonathan Wilkins, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Erratic boulder"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Knocknarea_-_geograph.org.uk_-_2935589.jpg/512px-Knocknarea_-_geograph.org.uk_-_2935589.jpg?20211225044024",
      "title": "Knocknarea by Seamus Feeney, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Knocknarea"
    }
  ],
  "distance_km": 8.0,
  "description": "This waymarked circular hike follows the Queen Maeve Trail to the summit of Knocknarea Mountain near Sligo town in County Sligo. From the 397 metre summit there are wonderful views over the Cúil Irra peninsula and the Atlantic coast. Here you will also find one of Ireland's largest cairns, known as Queen Maeve's Cairn, which is said to contain a Neolithic passage tomb. You can start the walk from the Strandhill car park which lies just north of the hill, near Sligo Airport. From here you can pick up the 8km trail heading south towards the summit. The trail then loops around the limestone mountain before passing a series of ancient sites. To continue your walking in the area head north to pick up the Killaspugbrone Loop which runs around the airport and along the coast. The walk visits the beach at Strandhill and the atmospheric ruins of the ancient Killaspugbrone church.",
  "video_url": "https://www.youtube.com/embed/YdSmEsKfMj4?si=nhUDawzV5tdbm6yH"
}