{
  "objectID": "e0a721f99cf65976fe831f26b9c788cc",
  "created_at": "2024-12-18T20:54:21.343757+00:00",
  "ref": "woodlesford-lock-to-leeds-canal-walk-walking-route",
  "title": "Woodlesford Lock to Leeds Canal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Woodlesford_Lock_No_4%2C_Aire_and_Calder_Canal%2C_Yorkshire_-_geograph.org.uk_-_57621.jpg",
  "nearby": [
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "Temple Newsam",
      "objectID": "c20240f07c386603565ef3842e1a2054",
      "ref": "temple-newsam-walking-route"
    },
    {
      "description": "Leeds Canal Walk",
      "objectID": "00101010e3bcde4ddc7de1c1bbef8aa2",
      "ref": "leeds-canal-walk-walking-route"
    },
    {
      "description": "River Aire",
      "objectID": "f4378310bbed8615749b0e633394b3a6",
      "ref": "river-aire-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e0a721f99cf65976fe831f26b9c788cc.gpx",
  "_geoloc": {
    "lat": 53.7601658258,
    "lng": -1.4440122451
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Woodlesford_Lock_No_4%2C_Aire_and_Calder_Canal%2C_Yorkshire_-_geograph.org.uk_-_57621.jpg",
      "title": "Dr Neil Clifton / Woodlesford Lock No 4, Aire and Calder Canal, Yorkshire",
      "caption": "Woodlesford Lock No 4, Aire and Calder Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Woodlesford_Lock_-_geograph.org.uk_-_333098.jpg",
      "title": "Paul Glazzard / Woodlesford Lock",
      "caption": "Woodlesford Lock. Lock on the Aire and Calder Navigation, southeast of Leeds. This canal system was begun by an Act of Parliament in 1699 to connect Leeds with Wakefield and Weeland, mainly for the wool industry and subsequently for the transport of coal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Fishpond_Lock_No_3%2C_Aire_and_Calder_Canal%2C_Leeds_-_geograph.org.uk_-_57605.jpg",
      "title": "Dr Neil Clifton / Fishpond Lock No 3, Aire and Calder Canal, Leeds",
      "caption": "Fishpond Lock No 3, Aire and Calder Canal, Leeds. Large electrically operated lock on this commercial waterway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/The_River_Aire%2C_Stourton_-_geograph.org.uk_-_333054.jpg/256px-The_River_Aire%2C_Stourton_-_geograph.org.uk_-_333054.jpg",
      "title": "Paul Glazzard / The River Aire, Stourton",
      "caption": "Weir, River Aire, near Stourton. In this area, the towpath runs between the river and the canal, so that, walking away from Leeds, the river is on your left and the canal on your right"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Thwaite_Mills_-_geograph.org.uk_-_772648.jpg",
      "title": "Steve  F, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Thwaite Mills. Here you can find out the importance of water power to our industrial heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Knostrop_Weir%2C_River_Aire_-_geograph.org.uk_-_828663.jpg",
      "title": "Dr Neil Clifton / Knostrop Weir, River Aire",
      "caption": "Knostrop Weir, River Aire. There has been much change over the years to the waterways and railways in this area. Originally, the River Aire ran to the south of Knostrop Cut, not the north, so the Navigation had to lock into the river and then out again by Thwaite Locks, (which no longer exist). Then for a while the river had both old and new channels, but the old southerly channel parallel to Knostrop Cut was filled in and built over. The railway viaduct piers belong to the Great Northern Railway Hunslet branch, which was still in use, although not for passengers, until after WWII."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Hunslet_Mills_and_the_River_Aire._-_geograph.org.uk_-_57132.jpg",
      "title": "Steve Partridge / Hunslet Mills and the River Aire.",
      "caption": "Hunslet Mills and the River Aire. These mills are next to the river Aire near the centre of Leeds. Taken looking SE from South Accommodation Road as it passes over the river. Photograph was taken from Richmond bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Fearn%27s_Island_and_Lock_-_geograph.org.uk_-_126843.jpg",
      "title": "Mick Garratt / Fearn's Island and Lock",
      "caption": "Fearn's Island and Lock. A bit of a viewbag, north west from the 4th floor of the Royal Armouries."
    }
  ],
  "distance_km": 8.3,
  "description": "This walk takes you from the pretty Woodlesford Lock into Leeds city centre, along the Aire and Calder Navigation Canal. The route runs for just over 5 miles along the towpath, using a section of the epic Trans Pennine Trail. As such it should take just under 2 hours to complete. Woodlesford has a train station so you could catch the train back at the end of the route. It's about a 10 minute direct journey from Leeds train station. On the way there's a series of locks, weirs and old mills to see. The nice surfaced path is also suitable for cyclists. You can see someone cycling the route on the video below. The walk starts from Woodlesford Lock, located just north of the village centre and the train station. Here you can pick up the towpath and follow it west along the canal and the River Aire. You'll pass Stourton, Thwaite Mills, Hunslet Mills and Knowsthorpe before finishing at Fearn's Island. Highlights on the route include the Thwaite Mills which includes a museum of the Leeds milling industry set in a former mill on an island in the River Aire. At the end of the route you'll also find the Royal Armouries. There's another interesting museum here with one of the oldest and largest collections of arms and armour in the world. There's also a cafe here where you could enjoy some post walk refreshments.",
  "video_url": "https://www.youtube.com/embed/AZKp9FBu4_I",
  "postcode": "LS26 8PJ",
  "district": "Rothwell",
  "region": "Yorkshire and the Humber",
  "country": "England"
}