{
  "created_at": "2025-01-06T00:12:43.052933+00:00",
  "objectID": "e135c29aae951c527107669b95a0e0c4",
  "ref": "winchester-river-walk-walking-route",
  "title": "Winchester River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/River_Itchen_after_snow%2C_Winchester_-_geograph.org.uk_-_1146026.jpg/256px-River_Itchen_after_snow%2C_Winchester_-_geograph.org.uk_-_1146026.jpg",
  "nearby": [
    {
      "description": "Itchen Way",
      "objectID": "536b9be9a0f34d2eef06d360207878af",
      "ref": "itchen-way-walking-route"
    },
    {
      "description": "St Catherine's Hill Winchester",
      "objectID": "ada71fffaace86ab9f2951ef046a6dad",
      "ref": "st-catherines-hill-winchester-walking-route"
    },
    {
      "description": "Winchester Circular Walk",
      "objectID": "9195b696e0a83ee0c727e7afa0adb2e4",
      "ref": "winchester-circular-walk-walking-route"
    },
    {
      "description": "Clarendon Way",
      "objectID": "be9b3d39a746039072310331122caf4a",
      "ref": "clarendon-way-walking-route"
    },
    {
      "description": "St Gile's Hill",
      "objectID": "e137bda82aae212b8c3e1317a32bbd06",
      "ref": "st-giles-hill-winchester-walking-route"
    },
    {
      "description": "Hockley Viaduct",
      "objectID": "d140cb35c93c2db677b72c8fb9fb5738",
      "ref": "hockley-viaduct-walking-route"
    },
    {
      "description": "Itchen Abbas",
      "objectID": "22a00ec814536650a24427f3fd5d7088",
      "ref": "itchen-abbas-walking-route"
    },
    {
      "description": "Three Castles Path",
      "objectID": "5c133e175d5f3f3cadd0bb733e6437ed",
      "ref": "three-castles-path-walking-route"
    },
    {
      "description": "Cheriton",
      "objectID": "5955383e3e7f8f16268474328a9842fd",
      "ref": "cheriton-walking-route"
    },
    {
      "description": "Hinton Ampner",
      "objectID": "aa55f3abc97f716864bafdeb51bc79a2",
      "ref": "hinton-ampner-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e135c29aae951c527107669b95a0e0c4.gpx",
  "_geoloc": {
    "lat": 51.0600987949,
    "lng": -1.3107420311
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/River_Itchen_after_snow%2C_Winchester_-_geograph.org.uk_-_1146026.jpg/256px-River_Itchen_after_snow%2C_Winchester_-_geograph.org.uk_-_1146026.jpg",
      "title": "Peter Facey / River Itchen after snow, Winchester",
      "caption": "River Itchen after snow, Winchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Wharf_Mill%2C_Winchester_-_geograph.org.uk_-_998853.jpg",
      "title": "Pierre Terre / Wharf Mill, Winchester",
      "caption": "Wharf Mill, Winchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Itchen_Navigation_at_Winchester_-_geograph.org.uk_-_375772.jpg",
      "title": "Herry Lawford / Itchen Navigation at Winchester",
      "caption": "Itchen Navigation at Winchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Itchen_Navigation_south_of_Tun_Bridge%2C_Winchester_-_geograph.org.uk_-_879715.jpg",
      "title": "Peter Facey / Itchen Navigation south of Tun Bridge, Winchester",
      "caption": "Itchen Navigation south of Tun Bridge, Winchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/Swan_and_cygnets_close_to_the_Itchen_Navigation%2C_Winchester_-_geograph.org.uk_-_175582.jpg",
      "title": "Jim Champion / Swan and cygnets close to the Itchen Navigation, Winchester",
      "caption": "Swan and cygnets close to the Itchen Navigation, Winchester"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/The_Itchen_from_Five_Bridges_Road_-_geograph.org.uk_-_1609819.jpg",
      "title": "Bill Boaden / The Itchen from Five Bridges Road",
      "caption": "The Itchen from Five Bridges Road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/38/St_Cross_from_the_Itchen_-_geograph.org.uk_-_375795.jpg",
      "title": "Herry Lawford / St Cross from the Itchen",
      "caption": "St Cross from the Itchen"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/River_Itchen_passing_Gater_Field_-_geograph.org.uk_-_1225775.jpg",
      "title": "Peter Facey / River Itchen passing Gater Field",
      "caption": "River Itchen passing Gater Field"
    }
  ],
  "distance_km": 5.8,
  "description": "A lovely circular walk along the River Itchen and Itchen Navigation in Winchester. The route uses a section of the Itchen Way to take you along the Itchen Navigation before crossing St Cross Bridge and picking up the Clarendon Way to take you back into the city along the River Itchen. The walk starts at the cathedral in the city centre and heads east to pick up the riverside path. You then head south past Wharf Bridge and Tun Bridge before coming to St Catherine's Hill. You can take a short detour from the route by climbing the hill for great views over the South Downs, the city and the river below. Just after passing the hill you come to St Cross Bridge where you cross the water. Here there's views of the disused Hockley Viaduct which was built in the late 1880s. The newly restored viaduct was officially opened on 26 February 2013 by the World Champion cyclist Dani King. You can enjoy fine views over the city and the Itchen valley from on top of the viaduct. After crossing the bridge you head along the river towards the noteworthy Hospital of St Cross. The medieval almshouse was founded between 1132 and 1136. It's a Grade I listed building and the oldest surviving charitable institution in the United Kingdom. Most of the historic buildings and surrounding grounds are open to the public at certain times. These include an inner quadrangle with a wonderful Norman church, a classic medieval hall and kitchen, a Tudor cloister and an ancient hall which serves as a tea room. This is a lovely spot for refreshments before completing the final section of the walk which takes you back into the centre of Winchester. You'll pass Winchester College and Water Meadows before returning to the cathedral. To extend your riverside walking you can continue south along the Itchen Way to Southampton, via Eastleigh. There's also the option of climbing St Gile's Hill, just to the east of the river. There's another nice viewpoint here with a little park, an information board and fine views over the cathedral, college and castle.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to the Willow Tree for some refreshments after your walk. The bar is an island oasis located at the foot of St Giles hill, opposite the Durngate car park and the Winnall Moors nature reserve. The bar has an open fire and a rustic vibe, with children and dogs welcome. There's also a delightful riverside garden to relax in on fine days. You can find the pub very close to the reserve at 14 Durngate terrace with a postcode of SO238QX for your sat navs. At the foot of St Catherine's Hill there's the The Handlebar Cafe next to the East Winchester park and ride car park. The cafe is part of Bespoke Biking and includes a good range of meals and snacks. It is located on the old railway line, with the building's design reflecting this. The cafe is a popular place for both walkers and cyclists and provides a friendly service. You can find them on Garnier Road with a postcode of SO23 9PA for your sat navs. Just to the north of the cafe is the Winchester Bike Hub at Bespoke Biking. Here you can find lots of cycling information and bike hire. The address is 4a Middle Brook Street, SO23 8AQ"
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and then east along the Itchen Way and you will soon come to the neighbouring village of Itchen Abbas. It's a picturesque spot along the river with the option of visiting the nearby Avington Park on the southern side. There's a lovely lake, peaceful woodland and a herd of Highland Cattle to see here. The village is also notable for providing the inspiration for the setting of Charles Kinglsey's novel The Water Babies. The author was a regular visitor to the area. The Three Castles Path starts/finishes at the castle in the town. This historically themed long distance trail will take you to Windsor Castle, visiting the ruined Odiham Castle on the way. A few miles to the south there's the splendid Hinton Ampner near Cheriton. Here you can explore the beautiful gardens surrounding a fine stately home. In Cheriton there's a noteworthy 13th century church, some picturesque thatched cottages and the site of the Battle of Cheriton which took place as part of the English Civil War in 1544. You will also find the source of the River Itchen just south of the village. For more walking ideas in the area see the South Downs Walks and the Hampshire Walks pages."
    }
  ],
  "district": "Winchester",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Abbey Passage, The Close, Winchester, Hampshire, England, SO23 9LL, United Kingdom",
  "postcode": "SO23 9LL",
  "state": "England"
}