{
  "created_at": "2025-01-06T01:00:17.842597+00:00",
  "objectID": "e13b02cbeda30e31600a89d9170e0f47",
  "ref": "langdale-pikes-walking-route",
  "title": "Langdale Pikes Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e1/The_Langdale_Pikes_-_geograph.org.uk_-_630557.jpg",
  "nearby": [
    {
      "description": "Crinkle Crags",
      "objectID": "0e4d45e613fe2b78b50a51dcdeea21cb",
      "ref": "crinkle-crags-walking-route"
    },
    {
      "description": "Bowfell",
      "objectID": "ce86f6350e94d5d24343ac4bd7969819",
      "ref": "bowfell-walking-route"
    },
    {
      "description": "Dungeon Ghyll",
      "objectID": "e47d02a88263c3c258c3d54675572086",
      "ref": "dungeon-ghyll-walking-route"
    },
    {
      "description": "Chapel Stile",
      "objectID": "4e2d3c8b0469dff31e752755c0da3eca",
      "ref": "chapel-stile-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e13b02cbeda30e31600a89d9170e0f47.gpx",
  "_geoloc": {
    "lat": 54.4484123782,
    "lng": -3.0894694854
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/The_Langdale_Pikes_-_geograph.org.uk_-_630557.jpg",
      "title": "Anthony Harrison / The Langdale Pikes",
      "caption": "The Langdale Pikes. A panoramic view of Mickleden and the three Pikes taken from the road leading up to Blea Tarn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/Pike_o%27_Stickle_-_geograph.org.uk_-_241375.jpg",
      "title": "Ron Shirt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pike o' Stickle. From the slopes of Loft Crag. Mickleden in shot. From the summit Loft Crag and Gimmer Crag are viewed in the foreground while Bowfell impresses across Langdale. A wide swathe of the Southern Fells is in view, whilst even distant Skiddaw puts in an appearance"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/db/Pavey_Ark_-_geograph.org.uk_-_606317.jpg",
      "title": "Steve Partridge / Pavey Ark",
      "caption": "Pavey Ark. Looking across to Pavey Ark from the direction of Harrison Stickle. Despite the lowering clouds there was no rain that day. Stickle Tarn is wholly within the territory of the Ark, a corrie tarn which has been dammed to create additional capacity."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/View_from_Harrison_Stickle_-_geograph.org.uk_-_631475.jpg",
      "title": "William Bartlett / View from Harrison Stickle",
      "caption": "View from Harrison Stickle. Stickle Tarn and then the snow shows up the maze of routes through Belles Knott and Blea Rigg. Harrison Stickle is the high point of the Langdale Pikes. The south-western border of the pike is formed by the deep ravine of Dungeon Ghyll, which cuts through the parapet of the Langdale Pikes and into the lower hinterland of Harrison Combe. Across the Ghyll westwards are Thorn Crag, Loft Crag and finally Pike of Stickle. Below the steep eastern face of Harrison Stickle lie Stickle Tarn and its Ghyll, thus ensuring that all drainage from the fell is to Great Langdale."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/From_Pike_o_Stickle_-_geograph.org.uk_-_241391.jpg",
      "title": "Ron Shirt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "From Pike o Stickle. Looking towards Windermere over Loft Crag"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Summit_Cairn%2C_Loft_Crag_-_geograph.org.uk_-_445589.jpg",
      "title": "Michael Graham / Summit Cairn, Loft Crag",
      "caption": "Summit Cairn, Loft Crag. The crag is made of Rhyolite rock and was pioneered in the early 1880s by the father of British rock climbing Walter Parry Haskett Smith. It has an altitude of 2,238 feet (682 metres). It lies between Harrison Stickle and Pike o’ Stickle and is usually climbed in conjunction with these two peaks. The fell has a small sharp summit, below which rises Gimmer Crag, which is one of the top rock climbing venues in the Lake District."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Stickle_Tarn_from_Pavey_Ark_-_geograph.org.uk_-_866239.jpg",
      "title": "Gordon Hatton / Stickle Tarn from Pavey Ark",
      "caption": "Stickle Tarn from Pavey Ark. The water from the tarn is used for public consumption in the hotels and homes below. The tarn has a depth of around 50 ft."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Dungeon_Ghyll_-_geograph.org.uk_-_2517309.jpg/512px-Dungeon_Ghyll_-_geograph.org.uk_-_2517309.jpg",
      "title": "Dungeon Ghyll by Ian Greig, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Dungeon Ghyll"
    }
  ],
  "distance_km": 7.0,
  "description": "This popular circular walk takes you to the top of the Langdale Pikes. One of the best known features of Great Langdale they include the Pike of Stickle, Loft Crag, Harrison Stickle and Pavey Ark. Alfred Wainright said of the Langdale Pikes: 'No mountain profile arrests and excites the attention more than that of the Langdale Pikes and no mountain group better illustrates the dramatic appeal of a sudden rising of the vertical from the horizontal; the full height from valley to summit is revealed at a glance in one simple abrupt upsurge to all travellers on the distant shore of Windermere and, more intimately, on the beautiful approach along Great Langdale. Nor is the appeal visual only: that steep ladder to heaven stirs the imagination, and even the emotions, and this is especially so whenever the towering peaks come into view suddenly and unexpectedly..' The walk starts from the New Dungeon Ghyll National Trust car park and follows the spectactular Dungeon Ghyll Force waterfall on a footpath largely consisting of a series of stone steps. Most of the path is quite easy although there are a couple of rockier sections which require a bit of scrambling. When you reach the summit you are rewarded with magnificent views of the surrounding area, with Lake Windermere and Elterwater clearly visible. The walk then takes you around the peaceful Stickle Tarn before passing Pavey Ark and heading west to Harrision Stickle. You continue to Pike of Stickle before descending to Loft Crag and Mark Gate. If you'd like to try another nearby fell you could head to the nearby Bowfell. The route for this starts from very near to the start point for this one.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Sticklebarn is a great place for refreshments after your walk. The pub has a great menu and a nice outdoor seating area with lovely views for finer days. There's a roaring fire in the cosy interior for the winter months."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "For more walking ideas in the area see the Lake District Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dv4BaoayBLE",
  "postcode": "LA22 9JX",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B5343, Lakes, Westmorland and Furness, England, LA22 9JX, United Kingdom",
  "district": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "rock"
  ],
  "points_of_interest": [
    "viewpoints",
    "lakes"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "hiking"
  ]
}