{
  "created_at": "2025-01-06T03:41:45.530205+00:00",
  "objectID": "e1885fa5d920ae27461f10ac9ee52c6d",
  "ref": "dunkery-beacon-walking-route",
  "title": "Dunkery Beacon Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Toposcope_on_Dunkery_Beacon_%28geograph_2611079%29.jpg",
  "nearby": [
    {
      "description": "Coleridge Way",
      "objectID": "a3bef22716b4314c225d24d23a12bc9b",
      "ref": "coleridge-way-walking-route"
    },
    {
      "description": "Porlock and Porlock Weir",
      "objectID": "defc8c471a57e39f20156339f70c69a5",
      "ref": "porlock-and-porlock-weir-walking-route"
    },
    {
      "description": "Holnicote Estate",
      "objectID": "e3af5ca905fc2a71d93fbd1ee79cdd6b",
      "ref": "holnicote-estate-walking-route"
    },
    {
      "description": "Wheddon Cross",
      "objectID": "300b530a9ac7d229e6cbfd8833943903",
      "ref": "wheddon-cross-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e1885fa5d920ae27461f10ac9ee52c6d.gpx",
  "_geoloc": {
    "lat": 51.166651566,
    "lng": -3.5693132801
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Toposcope_on_Dunkery_Beacon_%28geograph_2611079%29.jpg",
      "title": "Oliver Dixon / Toposcope on Dunkery Beacon, via Wikimedia Commons",
      "caption": "Toposcope on Dunkery Beacon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Dunkery_Beacon_-_geograph.org.uk_-_237582.jpg",
      "title": "Janine Forbes / Dunkery Beacon, via Wikimedia Commons",
      "caption": "Cairn erected to commemorate the handing over of Dunkery Hill to the National Trust. The site has been frequented by humans since the Bronze Age and features several burial mounds, including cairns and bowl barrows. Sweetworthy, located on the lower slopes, is home to two Iron Age hill forts or enclosures and a deserted medieval settlement."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Cutcombe%2C_nearing_Dunkery_Beacon_-_geograph.org.uk_-_519961.jpg",
      "title": "Martin Bodman / Cutcombe: nearing Dunkery Beacon, via Wikimedia Commons",
      "caption": "Cutcombe: walkers nearing Dunkery Beacon on the bridleway from Dunkery Gate, a climb of 100m or so. Looking north-north-west"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Ponies%2C_Dunkery_Beacon_-_geograph.org.uk_-_1283136.jpg/256px-Ponies%2C_Dunkery_Beacon_-_geograph.org.uk_-_1283136.jpg",
      "title": "Derek Harper / Ponies, Dunkery Beacon, via Wikimedia Commons",
      "caption": "Ponies on the Beacon. A pair of ponies graze close to the summit. The hill formed part of Henry II's \"Royal Forest of Exmoor\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Path_junction_near_Dunkery_Beacon_-_geograph.org.uk_-_1283220.jpg",
      "title": "Derek Harper / Path junction near Dunkery Beacon, via Wikimedia Commons",
      "caption": "Path junction near the beacon. A path across Goosemoor Common diverges from a larger path which connects Dunkery Beacon to the Rowbarrows."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Ponies_near_Dunkery_Beacon_-_geograph.org.uk_-_1283116.jpg",
      "title": "Derek Harper / Ponies near Dunkery Beacon, via Wikimedia Commons",
      "caption": "Beautiful view of the path, the ponies and the Exmoor hills in the background"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/View_across_Bagley_Combe_towards_Dunkery_Hill_-_geograph.org.uk_-_2563370.jpg/512px-View_across_Bagley_Combe_towards_Dunkery_Hill_-_geograph.org.uk_-_2563370.jpg?20210903000955",
      "title": "View across Bagley Combe towards Dunkery Hill by Roger Cornfoot, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View across Bagley Combe towards Dunkery Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Wheddon_Cross_%2C_The_Rest_and_be_Thankful_Inn_-_geograph.org.uk_-_4435064.jpg/512px-Wheddon_Cross_%2C_The_Rest_and_be_Thankful_Inn_-_geograph.org.uk_-_4435064.jpg?20230219043244",
      "title": "Wheddon Cross : The Rest and be Thankful Inn by Lewis Clarke, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Wheddon Cross, The Rest and be Thankful Inn"
    }
  ],
  "distance_km": 7.5,
  "description": "This walk climbs to Dunkery Beacon on Dunkery Hill, the highest point in Exmoor and Somerset. From the 1,703 feet (519 metre) summit there are fabulous views over Exmoor, the Brecon Beacons, Bodmin Moor, Dartmoor, the Severn Bridges and the Bristol and English Channels. The walk starts at the Dunkery Hill car park taking you up the hill to the beacon before heading into the delightful Dunkery and Horner Wood National Nature Reserve. The reserve covers 4000 acres/1604 hectares and is owned and managed by the National Trust. It consists of upland heath and woodland with a variety of wildlife including pied flycatcher, wood warbler, lesser spotted woodpecker, redstart and dipper. It also supports 14 of the 16 UK bat species, including barbastelle and Bechstein bats. You should also see several Exmoor Ponies and Exmoor's Iconic Red Deer. At the hill summit there's a handy toposcope where you can see all of the landmarks that are visible. If you would like to continue your walk you could head to the nearby Selworthy Beacon in the Holnicote Estate. Here you can enjoy more fabulous views of the Exmoor coast. The long distance Coleridge Way also passes close to the hill. You could pick this up and head north to the coast and visit Porlock and Porlock Weir .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "About a mile or so south east of the car park you'll find the little village of Wheddon Cross. Here you can enjoy refreshments at the splendidly named Rest and Be Thankful Inn. The 19th century coaching inn has an interesting history having originally been a staging post for travellers on their way between Dunster and Dulverton about 200 years ago. The bar area has a traditional country pub atmosphere, with log fires in winter and a good menu. There is a skittle alley and a pool table here too. You can find the inn at a postcode of TA24 7DR for your sat navs. The pub is nicely positioned in the Snowdrop Valley with tours and walks to the valley accessible from the bus leaving right from the door. They also provide good quality accommodation if you need to stay over. Wheddon Cross is notable as the highest village in the Exmoor National Park. The beacon is also not far from the popular Tarr Steps where you will find the wonderful Tarr Steps Farm. The 16th-century riverside inn is located in Dulverton at postcode TA22 9PY. There's outdoor seating with lovely views and a great menu here."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Fit dogs will love the climb to the beacon. There's also some nice woodland trails south of the hill top which are perfect for exploring with your four legged friend. The Rest and Be Thankful Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south from the beacon to Dunkery Bridge and there's some nice footpaths along the River Avil to try. They head east through Mansley Combe, Blagdon Wood and Little Quarne Wood towards Cutcombe and Wheddon Cross. Just to the west you'll find Nutscale Reservoir. The small reservoir is actually part of the Holnicote Estate with the fishing rights owned by the National Trust. It's in a remote and scenic location with some nice trails to follow around the adjacent Wilmersham Common.  For more walking ideas in the area see the Exmoor Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/qsWuxWBJmVc",
  "county": "Somerset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Luccombe, Wootton Courtenay, Somerset, England, TA24 8TB, United Kingdom",
  "postcode": "TA24 8TB",
  "district": "Wootton Courtenay",
  "state": "England"
}