{
    "objectID": "e1fd5feb1fac4699a8ee47e3c52244a9",
    "created_at": "2024-12-18T12:59:01.781905+00:00",
    "ref": "castle-eden-dene-walking-route",
    "title": "Castle Eden Dene Walking Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/01/Information_board_at_entrance_to_Castle_Eden_Dene_-_geograph.org.uk_-_1473198.jpg",
    "nearby": [
        {
            "description": "Hawthorn Dene",
            "objectID": "59944828c1d79d66f33178112ef7af4e",
            "ref": "hawthorn-dene-walking-route"
        },
        {
            "description": "Durham Coastal Footpath",
            "objectID": "6677ebc651cdd63d53e88b51ce005e4c",
            "ref": "durham-coastal-footpath-walking-route"
        },
        {
            "description": "Castle Eden Walkway",
            "objectID": "93680437451e00bf425216658f5531f1",
            "ref": "castle-eden-walkway-walking-and-cycle-route"
        },
        {
            "description": "Wynyard Woodland Park",
            "objectID": "1201a146e7aafb8baeb0f4d53fe699cf",
            "ref": "wynyard-woodland-park-walking-route"
        },
        {
            "description": "Hurworth Burn Reservoir",
            "objectID": "879931093c520874977f78bcf69ba89e",
            "ref": "hurworth-burn-reservoir-walking-route"
        },
        {
            "description": "Haswell to Hart",
            "objectID": "f10d9bf78eb318930d2e097fac71fd3e",
            "ref": "haswell-to-hart-walking-and-cycle-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/389C10146AA7AAB180258057006BB84E/$FILE/Castle Eden Dene.gpx",
    "_geoloc": {
        "lat": 54.7469346699,
        "lng": -1.3363632019
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/01/Information_board_at_entrance_to_Castle_Eden_Dene_-_geograph.org.uk_-_1473198.jpg",
            "title": "Roger Smith / Information board at entrance to Castle Eden Dene, via Wikimedia Commons",
            "caption": "Information board at entrance to Castle Eden Dene The board reads: Castle Eden Dene is the largest of eight very deep valleys, or denes which cut spectacularly into the gently rolling countryside of Eastern County Durham and run to the North Sea coast. Because of the comparative inaccessibility of the steep wooded valley sides, the denes have escaped clearance for agriculture, leaving them as precious remnants of ancient woodland. The combination of landscape and unusual soils formed in the magnesian limestone has created a variety of habitats within the denes and these have become home to a remarkable range of wildlife, particularly flowers and insects. Today the site is managed for the benefit of the unique wildlife that thrives here as well as for the thousands of people who visit each year."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Garden_of_Eden_Bridge%2C_Castle_Eden_Dene_-_geograph.org.uk_-_1582907.jpg",
            "title": "Andrew Curtis / Garden of Eden Bridge, Castle Eden Dene, via Wikimedia Commons",
            "caption": "Garden of Eden Bridge, Castle Eden Dene"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Limestone_cliffs%2C_Castle_Eden_Dene_-_geograph.org.uk_-_282938.jpg",
            "title": "Les Hull / Limestone cliffs, Castle Eden Dene, via Wikimedia Commons",
            "caption": "Limestone cliffs, Castle Eden Dene"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Castle_Eden_Dene_National_Nature_Reserve_-_geograph.org.uk_-_1584474.jpg",
            "title": "Andrew Curtis / Castle Eden Dene National Nature Reserve, via Wikimedia Commons",
            "caption": "Castle Eden Dene is the largest area of semi-natural woodland in north-east England, renowned for its yew trees. The tangled landscape is a survivor of the wildwood that once covered most of Britain. The Dene, with its strange rocks and mysterious atmosphere, has fascinated people for thousands of years. The reserve covers 221 hectares of woodland and lowland grassland, where post-glacial melt waters have carved out some spectacular limestone cliffs and gorges"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Gunners_Pool_Bridge%2C_Castle_Eden_Dene.jpg",
            "title": "Les Hull [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
            "caption": "Gunners Pool Bridge in Castle Eden Dene, County Durham, England. The bridge is one of sixteen that cross the Castle Eden Burn. It was fabricated in Hartlepool in the late 19th century for the Rev. John Burdon, whose family owned Castle Eden Dene, and is thought to have been erected in June 1877."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Castle_Eden_Dene_Nature_Reserve_Office_-_geograph.org.uk_-_282898.jpg",
            "title": "Les Hull / Castle Eden Dene Nature Reserve Office, via Wikimedia Commons",
            "caption": "Castle Eden Dene Nature Reserve Office. English Nature took over the management of the Dene in 1985 and immediately designated it a National Nature Reserve."
        }
    ],
    "distance_km": 5.0,
    "description": "Enjoy miles of woodland trails, pretty streams, rushing waterfalls and an abundance of wildlife in this splendid nature reserve in Peterlee. The reserve is the largest area of semi-natural woodland in north-east England.  There are well surfaced trails running along the pretty Castle Eden Burn and through the atmospheric gorge. There are two waymarked nature trails to try. The Yew trail runs for 2 miles following the Yew markers. On this trail you'll pass the reserve's majectic Yews and climb Craggy Bank where you can look out for nuthatches and goldcrests. The Squirrel trail also runs for about 2 miles following the squirrel markers. The reserve contains over 450 species of plant including wild garlic (ransoms) with their distintive aroma, pretty yellow primroses, lily-of-the-valley and bird's-nest orchid. In the spring months there are also carpets of bluebells to admire. It's great for wildlife too. Look out for roe deer, foxes and numerous different types of bird as you make your way along the trails. You can start your walk from the car park on Stanhope Chase. National Cycle Network Route 1 passes through Peterlee and close to the reserve if you would like to visit by bike. Please note that cycling is not permitted within the reserve though. This walk starts at the Stanhope Chase car park and explores the western section of the reserve. You can head east and walk all the way to the coast where you can pick up the Durham Coastal Footpath . To extend your walking in the area you can pick up the Castle Eden Walkway and follow the disused railway line to the lovely Wynyard Woodland Park . If you follow the coast path north towards Seaham you could visit the lovely Hawthorn Dene Nature Reserve. The coastal reserve has more nice woodland trails and interesting flora and fauna.",
    "video_url": "https://www.youtube.com/embed/9a6FMImdPA0",
    "district": "Peterlee",
    "county": "County Durham",
    "region": "North East",
    "country": "England"
}
