{
  "objectID": "e22fd6e9a0238c8e93f0c2ede945b08b",
  "created_at": "2024-12-18T12:58:31.527184+00:00",
  "ref": "ormesby-broad-walking-route",
  "title": "Ormesby Broad Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/87/Rollesby_Broad_from_the_Sailing_Club_jetty_-_geograph.org.uk_-_43440.jpg",
  "nearby": [
    {
      "description": "Winterton on Sea",
      "objectID": "9251eccdacca90df6a1cf4c8ca2d363f",
      "ref": "winterton-on-sea-walking-route"
    },
    {
      "description": "Great Yarmouth",
      "objectID": "b9d2400c8776f1931ce6213bfe3095de",
      "ref": "great-yarmouth-walking-route"
    },
    {
      "description": "Horsey Windpump and Horsey Mere",
      "objectID": "371970f0651307ba8d05d511a542270d",
      "ref": "horsey-windpump-and-horsey-mere-walking-route"
    },
    {
      "description": "Fleggburgh and Filby Broad",
      "objectID": "e3a7d4e1d6c96366cdc6c422a4d1a142",
      "ref": "fleggburgh-and-filby-broad-walking-route"
    },
    {
      "description": "Rollesby Broad",
      "objectID": "db461b31890c687985c2c79cecd6ab2b",
      "ref": "rollesby-broad-walking-route"
    },
    {
      "description": "Ludham",
      "objectID": "dc1dd90ff4adc12203c228e2ce9dc1c4",
      "ref": "ludham-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/3B9A6541B4AF53AA8625865D003044E8/$FILE/Ormesby Broad.gpx",
  "_geoloc": {
    "lat": 52.6788695737,
    "lng": 1.64266069
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Rollesby_Broad_from_the_Sailing_Club_jetty_-_geograph.org.uk_-_43440.jpg",
      "title": "Caroline Flatt / Rollesby Broad from the Sailing Club jetty",
      "caption": "Rollesby Broad from the Sailing Club jetty. Rollesby Broad is one of the Trinity Broads of Norfolk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Jetty_into_Ormesby_Little_Broad_-_geograph.org.uk_-_541426.jpg",
      "title": "Carol Rose / Jetty into Ormesby Little Broad",
      "caption": "Jetty into Ormesby Little Broad"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Village_sign%2C_Ormesby_St_Michael_-_geograph.org.uk_-_772854.jpg/256px-Village_sign%2C_Ormesby_St_Michael_-_geograph.org.uk_-_772854.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Village sign, Ormesby St Michael"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/The_edge_of_the_broad_-_geograph.org.uk_-_541434.jpg",
      "title": "Carol Rose / The edge of the broad",
      "caption": "The edge of the Ormesby Little Broad in Ormesby St Michael."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Broad_View_-_geograph.org.uk_-_854794.jpg",
      "title": "Evelyn Simak / Broad View",
      "caption": "Broad View in Rollesby - the village is located just to the west of the start of this walk and well worth a visit after you stroll to Ormesby St Michael. The broad here is viewed across barleyfield, from Court Road. The village of Rollesby - mentioned in the Domesday Book as Rotholfuesby and believed to have been a Viking settlement - is situated eight miles northwest of the seaside town of Great Yarmouth. Being isolated from the other Norfolk Broads, Rollesby Broad (linked to Filby and Ormesby Broad) is an ideal place for fishing and sailing as the use of motorised pleasure crafts is not permitted. In 2001 the parish, which for purposes of local government belongs to the district of Great Yarmouth, had a population of 995 in 408 households. St George's church is one of 120-odd round tower churches in Great Britain, most of which can be found in Norfolk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ef/St_George%27s_Church_-_geograph.org.uk_-_855320.jpg",
      "title": "Evelyn Simak / St George's Church",
      "caption": "St George's Church, Rollesby. St George's church has a round tower with an octagonal upper section and dates mainly from the 14th century but there was an extensive restoration during the 19th century and there are not many older survivals. The font is C19, the east window is by Powell & Sons (d. 1922). A C17 monument - to Rose Claxton, who died in 1601 - is located beside the high altar but only the tomb chest and effigy remain. The C17 monument to Leonard Mapes of Beeston (next Norwich), depicting the deceased with his wife and children, was executed in alabaster. A curious cubicle is located in the southeastern corner of the sanctuary; it has two entries and might have served as a sacristy. The church is kept locked but a key is available."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/The_Old_Court_House_-_geograph.org.uk_-_854846.jpg",
      "title": "Evelyn Simak / The Old Court House",
      "caption": "The Old Court House in Rollesby. The Old Court House was built in 1775-6 as a workhouse. An inscription over the door informs about its purpose: \"For the Instruction of Youth, the Encouragement of Industry, The Relief of Want, the Support of Old Age, and the Comfort of Infirmity and Pain.\" The inhabitants used to work on near-by Union Farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Old_World_Cottages_-_geograph.org.uk_-_855218.jpg",
      "title": "Evelyn Simak / Old World Cottages",
      "caption": "Old World Cottages, Rollesby. Built of brick with a thatched roof; the east gable has a chequered diamond pattern, and a plaque with the name of the cottages and the figure \"1583\", the year they were built."
    }
  ],
  "distance_km": 2.0,
  "description": "This short walk takes you along Ormesby Broad to the village of Ormesby St Michael where you can visit Ormesby Little Broad. At the end of the walk there's also a splendid waterside pub for refreshment. From the start point there's also the option of heading into the nearby village of Rollesby. The walk starts on Rollesby Bridge where there's a public car park. There's also the Waterside Cafe on the western side of the bridge, which offers an alternative start/finish point. You can follow the pavement east along the bridge where there are views to Rollesby Broad to the south and Ormesby Broad to the north. The road will eventually lead you to Ormesby St Michael where you can turn south along a country lane to take you down to Ormesby Little Broad. Here you can enjoy views across the water from the lovely garden area of The Boathouse restaurant. The route returns to the car park on the same paths but you could extend the walk by heading into the village of Rollesby on the western side of the bridge. There's an interesting 14th century church to see here. The broad and village are next to Fleggburgh and Filby Broad where there are more nice trails to try.",
  "video_url": "https://www.youtube.com/embed/QuRudT6r_RI",
  "county": "Norfolk",
  "region": "Eastern",
  "country": "England"
}