{
  "created_at": "2025-01-06T05:00:46.350366+00:00",
  "objectID": "e233d7ef4858227a91623b100cc3abd4",
  "ref": "otmoor-walking-route",
  "title": "Otmoor Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Rifle_range_butts_on_Otmoor_-_geograph.org.uk_-_182138.jpg",
  "nearby": [
    {
      "description": "Oxfordshire Way",
      "objectID": "f2f8c5cb204c351de4c898446fda44cc",
      "ref": "oxfordshire-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e233d7ef4858227a91623b100cc3abd4.gpx",
  "_geoloc": {
    "lat": 51.8123532613,
    "lng": -1.1730544545
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Rifle_range_butts_on_Otmoor_-_geograph.org.uk_-_182138.jpg",
      "title": "David Hawgood / Rifle range butts on Otmoor, via Wikimedia Commons",
      "caption": "Rifle range butts on Otmoor. A butt is a pile of earth to stop stray bullets, behind the targets on a firing range. View from the part of the Roman Road within the danger area - but available to the public on days with no firing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Horses_in_field%2C_flooded_Otmoor_beyond_-_geograph.org.uk_-_351043.jpg",
      "title": "David Hawgood / Horses in field, flooded Otmoor beyond, via Wikimedia Commons",
      "caption": "Horses in field, flooded Otmoor beyond View from the Oxfordshire Way footpath near Upper Park Farm. Although the field is only at 110 metres it gives a view right over the flat Otmoor at 60m. Otmoor used to be drained, the RSPB is turning parts back into wetlands"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/RSPB_reedbed_on_Otmoor_-_geograph.org.uk_-_181465.jpg/256px-RSPB_reedbed_on_Otmoor_-_geograph.org.uk_-_181465.jpg",
      "title": "David Hawgood / RSPB reedbed on Otmoor, via Wikimedia Commons",
      "caption": "View from bird viewing hide near end of visitor trail. The RSPB have designed the reedbed to be big enough to support a pair of breeding bitterns - there are only fifty pairs in the UK. There is a clump of yellow flag irises in this photo."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Bridleway_across_Otmoor_-_geograph.org.uk_-_386644.jpg",
      "title": "David Hawgood / Bridleway across Otmoor, via Wikimedia Commons",
      "caption": "Bridleway across Otmoor. Behind the hedge on the right is a hard surfaced track which runs to the RSPB reserve. It has gates to allow walkers to use it, but horses are kept to this bridleway which is often wet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Willow_leaves_and_flowers_on_Otmoor_-_geograph.org.uk_-_180746.jpg",
      "title": "David Hawgood / Willow leaves and flowers on Otmoor, via Wikimedia Commons",
      "caption": "Willow leaves and flowers on Otmoor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Track_across_Otmoor_-_geograph.org.uk_-_180606.jpg",
      "title": "David Hawgood / Track across Otmoor, via Wikimedia Commons",
      "caption": "Track across Otmoor. This is the bridleway from Horton-cum-Studley to Oddington. This part is within a military firing range area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Rose_bush_and_RSPB_visitor_trail_on_Otmoor_-_geograph.org.uk_-_182148.jpg",
      "title": "David Hawgood / Rose bush and RSPB visitor trail on Otmoor, via Wikimedia Commons",
      "caption": "Rose bush and RSPB visitor trail on Otmoor. RSPB have put a hard surface path into their wetland reserve. This part is along a bridleway, and there is a ditch the other side of the fence."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/RSPB_reserve%2C_Otmoor_-_geograph.org.uk_-_386653.jpg",
      "title": "David Hawgood / RSPB reserve, Otmoor, via Wikimedia Commons",
      "caption": "This is the north west corner of RSPB's Otmoor reserve, see Oxford Ornithological Society for map of the reserve"
    }
  ],
  "distance_km": 7.5,
  "description": "This lovely RSPB nature reserve consists of wet meadows, grassland and reedbeds. The area attracts thousands of wildfowl and waders such as lapwings and redshanks. You can also look out for a variety of dragonflies and butterflies. This circular walk follows good footpaths around the reserve with views of the River Ray and the surrounding Oxfordshire countryside. You can also bring your bike to the reserve but please keep to the bridleways and public footpaths but avoid the visitor trail and permissive paths. The Oxfordshire Way runs past the reserve so you could pick this up to continue your walk. If you prefer you can visit the reserve by following the Oxfordshire Way from nearby Beckley. The route passes through Noke Wood and some nice countryside before reaching the reserve near Noke. You could also follow the trail west to the pretty village of Islip where you can enjoy lovely views of the River Cherwell and River Ray.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Abingdon Arms is located just south of the reserve in Beckley. It's a great option for some refreshments after your walk. The beer garden is probably the best in the country with fabulous views over the reserve from its elevated position. It's split into a terraced upper deck and lower deck making it an ideal place to relax on a warm day. You can find the pub in the little village of Beckley on the High St with a postcode of OX3 9UU for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome on public footpaths and bridleways, but please avoid the visitor trail and permissive paths to minimise disturbance."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FOvIsLgmU_I",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Otmoor Range, Otmoor Lane, Beckley and Stowood, Beckley, South Oxfordshire, Oxfordshire, England, OX3 9TD, United Kingdom",
  "postcode": "OX3 9TD",
  "district": "South Oxfordshire",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "grassland"
  ],
  "points_of_interest": [
    "countryside",
    "river views"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "bridleways",
    "public footpaths"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}