{
  "objectID": "e259e12d0abfa57ca9b45deaa30ec1f5",
  "created_at": "2024-12-21T14:11:25.749033+00:00",
  "ref": "green-london-way-walking-route",
  "title": "Green London Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/02/Wimbledon_Common_-_geograph.org.uk_-_1339745.jpg",
  "nearby": [
    {
      "description": "Richmond Park",
      "objectID": "47915094402f026d119940fe0df24241",
      "ref": "richmond-park-walking-and-cycle-route"
    },
    {
      "description": "Beverley Brook Walk",
      "objectID": "cb9d2caf633adf2bfe8a4d5041043d5c",
      "ref": "beverley-brook-walk-walking-route"
    },
    {
      "description": "Wimbledon Common",
      "objectID": "c9e8708094a0c9c7bc62a5df5a345470",
      "ref": "wimbledon-common-walking-and-cycle-route"
    },
    {
      "description": "Hampstead Heath",
      "objectID": "7454be7653cb8e4ef0870c2419e7356a",
      "ref": "hampstead-heath-walking-and-cycle-route"
    },
    {
      "description": "Brent River Park Walk",
      "objectID": "e1d5d51c68068611731e3935d146af32",
      "ref": "brent-river-park-walk-walking-route"
    },
    {
      "description": "Finsbury Park",
      "objectID": "a06c6a52bf5e4e33af0e6f0232bd3297",
      "ref": "finsbury-park-walking-route"
    }
  ],
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Wimbledon_Common_-_geograph.org.uk_-_1339745.jpg",
      "title": "Peter Trimming / Wimbledon Common",
      "caption": "Wimbledon Common. The expansive common is a popular place for walkers and cyclists with miles of wide trails. There's also the iconic windmill which includes an interesting museum detailing the history of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/10/Hampstead_Heath_-_geograph.org.uk_-_1003989.jpg",
      "title": "Martin Addison / Hampstead Heath",
      "caption": "Hampstead Heath. Ladies talk while walking their dogs on a bright autumn morning. This ancient heath sits astride a sandy ridge, one of the highest points in London, running from Hampstead to Highgate, which rests on a band of London Clay. The heath is rambling and hilly, embracing ponds, recent and ancient woodlands, a lido, playgrounds, and a training track, and it adjoins the former stately home of Kenwood House and its estate. The south-east part of the heath is Parliament Hill, from which the view over London is protected by law. Running along its eastern perimeter is a chain of ponds – including three open-air public swimming pools – which were originally reservoirs for drinking water from the River Fleet."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Richmond_Park_-_geograph.org.uk_-_2026163.jpg/512px-Richmond_Park_-_geograph.org.uk_-_2026163.jpg",
      "title": "Richmond Park by Peter Trimming, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Richmond Park. A wonderful deer park with cycle trails, gardens, views to central London and a golf course. The park is of national and international importance for wildlife conservation. It was created by Charles I in the 17th century as a deer park. It is now a national nature reserve, a Site of Special Scientific Interest and a Special Area of Conservation and is included, at Grade I, on Historic England's Register of Historic Parks and Gardens of special historic interest in England. Its landscapes have inspired many famous artists and it has been a location for several films and TV series.The park ncludes many buildings of architectural or historic interest. The Grade I-listed White Lodge was formerly a royal residence and is now home to the Royal Ballet School."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Kew_Bridge_-_geograph.org.uk_-_2138195.jpg",
      "title": "Kew Bridge by Eirian Evans, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Kew Bridge and the River Thames."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Richmond_Bridge_-_geograph.org.uk_-_2593165.jpg/512px-Richmond_Bridge_-_geograph.org.uk_-_2593165.jpg",
      "title": "Richmond Bridge by Philip Halling, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Richmond Bridge. An 18th-century stone arch bridge that crosses the River Thames at Richmond, connecting the two halves of the present-day London Borough of Richmond upon Thames. It is Grade I listed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Finsbury_Park_-_geograph.org.uk_-_2125980.jpg/512px-Finsbury_Park_-_geograph.org.uk_-_2125980.jpg",
      "title": "Finsbury Park by Colin Kinnear, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Finsbury Park. The park was one of the first of the great London parks laid out in the Victorian era. The park borders the neighbourhoods of Harringay, Finsbury Park, Stroud Green, and Manor House. It includes a mixture of open ground, formal gardens, avenues of mature trees and an arboretum. There is also a lake, a children's play area, a cafe and an art exhibition space."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Victoria_park1.jpg",
      "title": "Tarquin Binary at English Wikipedia, Public domain, via Wikimedia Commons",
      "caption": "The bathing pond at Victoria Park. Unused for bathing since the 1930s, it is now popular with anglers The park (known colloquially as Vicky Park or the People's Park) is located in the London Borough of Tower Hamlets. It is the largest park in Tower Hamlets and one of London's most visited green spaces with approximately 9 million visitors every year. The park spans 86.18 hectares (213.0 acres) of open space and opened to the public in 1845."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Crystal_Palace_Park_-_geograph.org.uk_-_2134150.jpg",
      "title": "Crystal Palace Park by Eirian Evans, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Crystal Palace Park. This Victorian pleasure ground is located in the South London suburb of Crystal Palace surrounding the site of the former Crystal Palace Exhibition building. The Palace had been relocated from Hyde Park, London after the 1851 Great Exhibition and rebuilt with some modifications and enlargements to form the centrepiece of the pleasure ground, before being destroyed by fire in 1936. The park features full-scale models of dinosaurs in a landscape, a maze, lakes, and a concert bowl. The park is situated halfway along the Norwood Ridge at one of its highest points. This ridge offers views northward to central London, eastward to the Queen Elizabeth II Bridge and Greenwich, and southward to Croydon and the North Downs."
    }
  ],
  "distance_km": 161.0,
  "description": "Explore the best and most beautiful of London's open spaces on this circular walk through the capital. The route has been split up into 18 sections as follows: 1. Stratford to North Woolwich 2. Abbey Wood and Shooters Hill 3. Woolwich to Greenwich 4. Greenwich to Forest Hill 5. Forest Hill to Crystal Palace 6. Crystal Palace to Balham 7. Balham to Wimbledon 8. Wimbledon to Richmond 9. Richmond to Kew Bridge 10. Kew Bridge to Hanwell 11. Hanwell to Greenford 12. Greenford to South Kenton 13. South Kenton to Brent Cross 14. Brent Cross to Hampstead 15. Hampstead to Finsbury Park 16. Finsbury Park to Clapton 17. Clapton to Victoria Park 18. Victoria Park to Stratford You'll pass a series of delightful parks including Wimbledon Common, Richmond Park, Hampstead Heath and Kew Gardens. There are also waterside sections along the River Thames and the Brent River to enjoy.",
  "video_url": "https://www.youtube.com/embed/y5XMv8xgocE"
}