{
  "created_at": "2025-01-06T03:54:50.362147+00:00",
  "objectID": "e25d8f4991394f95e50e3f1ee85d8558",
  "ref": "two-moors-way-walking-route",
  "title": "Two Moors Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Two_Moors_Way_-_geograph.org.uk_-_1260115.jpg",
  "nearby": [
    {
      "description": "Tarr Steps",
      "objectID": "f3125eee54f10e1f9cf2b8b9bee70726",
      "ref": "tarr-steps-walking-route"
    },
    {
      "description": "Avon Dam",
      "objectID": "0c7c6f2254cffe626028c8c65c9eb11f",
      "ref": "avon-dam-walking-route"
    },
    {
      "description": "Fernworthy Reservoir",
      "objectID": "795bfefc9262ec21e8b620118557ede6",
      "ref": "fernworthy-reservoir-walking-route"
    },
    {
      "description": "Landacre Bridge from Withypool",
      "objectID": "4e4ba326394d7d34b021b9331cc5c082",
      "ref": "landacre-bridge-from-withypool-walking-route"
    },
    {
      "description": "Withypool to Tarr Steps Circular Walk",
      "objectID": "5a46b4b821461965972364c697eeb206",
      "ref": "withypool-to-tarr-steps-circular-walk-walking-route"
    },
    {
      "description": "Venford Reservoir",
      "objectID": "97f252c582b409010f6daf70209d4b57",
      "ref": "venford-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e25d8f4991394f95e50e3f1ee85d8558.gpx",
  "_geoloc": {
    "lat": 50.3911262499,
    "lng": -3.919691261
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Two_Moors_Way_-_geograph.org.uk_-_1260115.jpg",
      "title": "Guy Wareham / Two Moors Way, via Wikimedia Commons",
      "caption": "The point at which the path leaves, or joins, the Redlake Tramway track. The stone on the left is the Two Moors marker. The earthenware pipe is part of the return pipeline that took waste water from the Greenhill Micas back to the clay pit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Two_Moors_Way_-_geograph.org.uk_-_990971.jpg",
      "title": "Guy Wareham / Two Moors Way, via Wikimedia Commons",
      "caption": "The line of the Two Moors Way that, on the ground, now takes a direct line from Crossways down to the clapper bridge on the Avon; the marked route offers a longer but gentler descent. Settlement circles can be seen on the distant hills."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Witheridge%2C_Two_Moors_Way_-_geograph.org.uk_-_244769.jpg",
      "title": "Martin Bodman / Witheridge: Two Moors Way, via Wikimedia Commons",
      "caption": "Witheridge, looking east-north-east towards Bradford Moor House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Rackenford%2C_Two_Moors_Way_-_geograph.org.uk_-_234547.jpg",
      "title": "Martin Bodman / Rackenford: Two Moors Way, via Wikimedia Commons",
      "caption": "Rackenford: Two Moors Way. An old green way. By North Backstone, looking north"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Clannaborough%2C_the_Two_Moors_Way_-_geograph.org.uk_-_348436.jpg",
      "title": "Martin Bodman / Clannaborough: the Two Moors Way, via Wikimedia Commons",
      "caption": "Clannaborough, looking south-south-east by the entrance to Appledore Farm"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Two_Moors_Way_split_-_geograph.org.uk_-_987412.jpg",
      "title": "Guy Wareham / Two Moors Way split, via Wikimedia Commons",
      "caption": "The point where the Two Moors Way to Holne splits; to the left via Chalk Ford and to the right via Lud Gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Colebrooke%2C_the_Two_Moors_Way_-_geograph.org.uk_-_330560.jpg",
      "title": "Martin Bodman / Colebrooke: the Two Moors Way, via Wikimedia Commons",
      "caption": "Colebrooke, near Whelmstone Cross, looking north"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Knowstone%2C_the_Two_Moors_Way_-_geograph.org.uk_-_393666.jpg",
      "title": "Martin Bodman / Knowstone: the Two Moors Way, via Wikimedia Commons",
      "caption": "Approaching Knowstone village, looking north-north-west"
    }
  ],
  "distance_km": 145.0,
  "description": "Travel from Ivybridge to Lynmouth through the Dartmoor and Exmoor National Parks on this splendid walk through Devon and Somerset. The walk is generally not strenous taking you through tranquil moorland and the deep and wooded valleys of the moorland edges. The epic route runs for a distance of about 90 miles exposing you to some of the finest scenery in the south west of England. Highlights on the route include the splendid Avon Dam Reservoir and the fascinating old clapper bridge at Tarr Steps near Dulverton. Near Withypool you'll also cross the picturesque five arched Landacre Bridge over the River Barle.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Tarr Steps Farm is a popular choice for walkers looking to refresh themselves on this walk. The 16th-century riverside inn is located near Liscombe at postcode TA22 9PY. There's outdoor seating with lovely views and a great menu. Near Birch Tor you will pass the noteworthy Warren House Inn, one of the highest pubs in England. The 19th century inn is one of the most famous on Dartmoor, sitting in an isolated position some 1425ft (434m) above sea level. Originally built to serve the busy local tin mining community, the Inn was always a favourite haunt with miners from the neighbouring Tin Mines, including Golden Dagger, Vitifer and Birch Tor Mines. From the elevated position of the inn there are breathtaking views over the area. Indoors there's a cosy interior with oak beams and open fires. They do great food and are also dog friendly. The Warren House Inn lies at the very centre of Dartmoor between Moretonhampstead and Princetown on the B3212 with a postcode of PL20 6TA. It's well worth investigating as the route passes right by it as you cross the road near Water Hill. The trail passes through the little village of Scorriton where you could pay a visit to the Tradesman's Arms. Here you can enjoy home cooked food in the lovely garden area, overlooking the Little Combe Valley. You can find them at postcode TQ11 0JB for your sat navs. There's also the option of taking a small detour from the route to visit Holne Woods and the pretty Venford Reservoir near here. In the centre of Exmoor you will pass through the notable village of Simonsbath. The village is a popular place for starting a walk with a good sized car park and the Exmoor Forest Inn. The inn dates back to 1789 and serves high quality dishes. There's also a garden area, decent rooms and a campsite if you'd like to stay in the area. Near here you can also visit Exe Head, the source of the River Exe."
    }
  ],
  "video_url": "https://www.youtube.com/embed/E8Az4CVdcjM",
  "postcode": "PL21 0AB",
  "district": "South Hams",
  "county": "Devon",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Harford Road, Ivybridge, South Hams, Devon, England, PL21 0AB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "wooded valleys"
  ],
  "points_of_interest": [
    "scenery"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}