{
    "objectID": "e26823853ea6fa52af28e7930456960a",
    "created_at": "2024-12-20T14:44:38.299761+00:00",
    "ref": "loch-kinord-walking-route",
    "title": "Loch Kinord and Muir of Dinnet Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/df/Loch_Kinord_at_Meikle_Kinord_-_geograph.org.uk_-_105591.jpg",
    "nearby": [
        {
            "description": "Glen Tanar",
            "objectID": "9291ef5d613fc167993971fe18137bbf",
            "ref": "glen-tanar-walking-route"
        },
        {
            "description": "7 Bridges",
            "objectID": "56830d7a2c94c001d229d7f712a1e9f0",
            "ref": "7-bridges-walking-route"
        },
        {
            "description": "Balmoral Cairns",
            "objectID": "e5753ace1ef30be7330a4c790a2bfccd",
            "ref": "balmoral-cairns-walking-route"
        },
        {
            "description": "Loch Muick",
            "objectID": "8c5c52615b5a1ff803bd6e584d2605c4",
            "ref": "loch-muick-walking-route"
        },
        {
            "description": "Lochnagar",
            "objectID": "7b3f7ab7e492f09103dc3c5140dbaf18",
            "ref": "lochnagar-walking-route"
        },
        {
            "description": "Loch of Aboyne",
            "objectID": "c005b2e4b75b136302294f75e9ef8be6",
            "ref": "loch-of-aboyne-walking-route"
        },
        {
            "description": "Dess Waterfall",
            "objectID": "e83892ac7f67a0dc137a94d4e3a58baf",
            "ref": "dess-waterfall-walking-route"
        },
        {
            "description": "Ballater",
            "objectID": "d9db06e189a2696931f9bbcecdcd07d2",
            "ref": "ballater-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/B648FFE17D56B28785257F080043CF9B/$FILE/Loch Kinord.gpx",
    "_geoloc": {
        "lat": 57.0851241665,
        "lng": -2.9431846376
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/df/Loch_Kinord_at_Meikle_Kinord_-_geograph.org.uk_-_105591.jpg",
            "title": "Colin Smith / Loch Kinord at Meikle Kinord",
            "caption": "Loch Kinord at Meikle Kinord. Looking over the loch from its south-west corner."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Meikle_Kinord_with_Loch_Kinord_beyond_-_geograph.org.uk_-_1021496.jpg",
            "title": "Nigel Corby / Meikle Kinord with Loch Kinord beyond",
            "caption": "Meikle Kinord with the Loch beyond. Meikle Kinord is the group of buildings to the left. Loch Kinord beyond is a textbook example of a kettle hole. It was formed when a large block of ice became separated from a melting glacier and was buried by sand and gravel. When that ice finally melted, the sand and gravel that once lay on top of the ice collapsed, leaving a hollow (kettle hole) on the ground surface which later filled with water. The loch is relatively shallow with an average depth of about 2 metres."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Loch_Kinord_and_the_crannog_-_geograph.org.uk_-_903460.jpg",
            "title": "Nigel Corby / Loch Kinord and the crannog",
            "caption": "Loch view and the Crannog. The vegetation at the edge of the loch has been flattened in places by recent visitors. Through the gap can been seen a crannog. This is an artificial island created around 2,000 years ago. The island was created by pushing large oak trunks into the loch bed and piling layers of stone, earth and timber on top to form the base. A large hut was then built on stilts above the water. Its purpose was defensive. Normally, a causeway would lead from the crannog to the mainland. However, in times of attack, the causeway would be destroyed, leaving the occupants on the island on the loch and the attackers on the mainland. It is thought that many of the lochs in Scotland would have had such dwellings on them, but very few have survived."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Loch_Kinord_-_geograph.org.uk_-_903441.jpg",
            "title": "Nigel Corby / Loch Kinord",
            "caption": "Loch Kinord and the nearby Loch Davan were both formed when the last glaciers melted here more than 10.000 years ago. They are textbook examples of kettle holes. These were formed when large blocks of ice became separated from the melting glacier and were buried by sand and gravel. When that ice finally melted, the sand and gravel that once lay on top of the ice collapsed, leaving a hollow (kettle hole) on the ground surface which later filled with water. The lochs are relatively shallow. Loch Kinord has an average depth of about 2 metres. The shallow depth means that light can penetrate to the loch floor. Consequently, the loch has a rich flora with many species of aquatic plants recorded."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Little_Tulloch_-_geograph.org.uk_-_1203473.jpg",
            "title": "Nigel Corby / Little Tulloch",
            "caption": "Little Tulloch. The house at Little Tulloch as seen from the track over to Glen Tanar. The loch lies beyond."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/a/ab/North_east_spur_of_Pannanich_Hill_-_geograph.org.uk_-_1192229.jpg",
            "title": "Nigel Corby / North east spur of Pannanich Hill",
            "caption": "North east spur of Pannanich Hill. Granite is the underlying rock and there are large areas of outcropping rock and boulders. In the middle distance are Loch Davan and Lock Kinord. In the far distance, on the skyline 20 miles away, is Bennachie."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Loch_Kinord_Hotel%2C_Dinnet_-_geograph.org.uk_-_791753.jpg",
            "title": "Stanley Howe / Loch Kinord Hotel, Dinnet",
            "caption": "Loch Kinord Hotel, Dinnet. The hotel lies to the east of the water."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Burn_O%27Vat%2C_The_vat_-_geograph.org.uk_-_1296064.jpg?20110227090245",
            "title": "Martyn Gorman / Burn O'Vat: The vat",
            "caption": "Burn O'Vat in the Muir of Dinnet National Nature Reserve: A spectacular rock cauldron carved by glacial meltwater, Burn O'Vat is a popular highlight of the reserve. Visitors can enter the \"Vat\" through a narrow passage and marvel at the towering rock walls and the small waterfall within."
        }
    ],
    "distance_km": 5.5,
    "description": "Enjoy an easy circular walk around this delightful loch and nature reserve in the Cairngorms. There is a waymarked trail taking you through the woodland and along the loch situated in the Muir of Dinnet National Nature Reserve. The reserve is a wonderful place for flora and fauna with otters, goldeneye ducks, migrating geese and other wildfowl to look out for. There are also lots of interesting plants around the water including water lobelia, quillwort and shoreweed. Just to the north you can extend the walk by visiting Loch Davan. To the south you can pick up the Deeside Way in Dinnet. The shared cycling and walking route runs along a disused railway between Aberdeen and Ballater .",
    "video_url": "https://www.youtube.com/embed/DeJzX7hRW-o"
}
