{
  "created_at": "2025-01-06T01:25:40.598172+00:00",
  "objectID": "e2dd72c89baa5d0473703a87e5bb4a94",
  "ref": "colne-valley-trail-walking-and-cycle-route",
  "title": "Colne Valley Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b1/River_Colne%2C_Batchworth_Lake_weir_-_geograph.org.uk_-_1244901.jpg",
  "nearby": [
    {
      "description": "Colne Valley Way",
      "objectID": "ef83d9fcf0c06fd142b76a312a49c598",
      "ref": "colne-valley-way-walking-route"
    },
    {
      "description": "Ebury Way",
      "objectID": "465bdd913fde7b50fee58ea1ed748388",
      "ref": "ebury-way-walking-and-cycle-route"
    },
    {
      "description": "Rickmansworth",
      "objectID": "356bcc05f03ab511653ebe8665af82c3",
      "ref": "rickmansworth-walking-route"
    },
    {
      "description": "Denham Country Park",
      "objectID": "40f47cba5f31251a38746d6f04a22323",
      "ref": "denham-country-park-walking-route"
    },
    {
      "description": "Uxbridge Canal Walk",
      "objectID": "e09d80db01d9a9b156acba0ce5e27e3a",
      "ref": "uxbridge-canal-walk-walking-route"
    },
    {
      "description": "Celandine Route",
      "objectID": "a626717cb08d5e64f335d6fb2685150a",
      "ref": "celandine-route-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e2dd72c89baa5d0473703a87e5bb4a94.gpx",
  "_geoloc": {
    "lat": 51.5478475318,
    "lng": -0.4836958573
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/River_Colne%2C_Batchworth_Lake_weir_-_geograph.org.uk_-_1244901.jpg",
      "title": "Nigel Cox / River Colne: Batchworth Lake weir, via Wikimedia Commons",
      "caption": "River Colne: Batchworth Lake weir. Old Ordnance Survey maps show this as a public footpath crossing of the Colne. Modern health and safety considerations have however forced the closure of that opportunity and the footbridge is now firmly sealed with security railings. Batchworth Lake is visible beyond the river to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Grand_Union_Canal_in_Rickmansworth_-_geograph.org.uk_-_603417.jpg",
      "title": "Nigel Cox / Grand Union Canal in Rickmansworth, via Wikimedia Commons",
      "caption": "Grand Union Canal in Rickmansworth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Heron_sculpture%2C_Denham_Country_Park_-_geograph.org.uk_-_663787.jpg/256px-Heron_sculpture%2C_Denham_Country_Park_-_geograph.org.uk_-_663787.jpg",
      "title": "David Hawgood / Heron sculpture, Denham Country Park",
      "caption": "Heron sculpture, Denham Country Park. In the grounds of the Colne Valley Visitor Centre in Denham Country Park. The heron is the symbol of the Colne Valley Regional Park. The sculpture, unveiled in 2005, is six metres high."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Denham_Country_Park_-_geograph.org.uk_-_215773.jpg",
      "title": "Ray Stanton / Denham Country Park",
      "caption": "Denham Country Park. One of the lakes beside the Grand Union Canal"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Rickmansworth%2C_Footbridge_over_the_River_Colne_-_geograph.org.uk_-_1030078.jpg",
      "title": "Nigel Cox / Rickmansworth: Footbridge over the River Colne",
      "caption": "Rickmansworth: Footbridge over the River Colne. The footbridge takes the Colne Valley Trail waymarked path out of Rickmansworth from Riverside Drive and over the River Colne."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Irrigation_channel_-_geograph.org.uk_-_83031.jpg",
      "title": "Ray Stanton / Irrigation channel",
      "caption": "Irrigation channel. Bridge over Trout Road in distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Colne_Valley_Trail_next_to_Old_Slade_Road_-_geograph.org.uk_-_5324837.jpg/512px-Colne_Valley_Trail_next_to_Old_Slade_Road_-_geograph.org.uk_-_5324837.jpg",
      "title": "Colne Valley Trail next to Old Slade Road by James Emmans, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Next to Old Slade Road"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Grand_Union_Canal_near_South_Harefield_-_geograph.org.uk_-_1252280.jpg",
      "title": "David Kemp / Grand Union Canal near South Harefield",
      "caption": "Grand Union Canal near South Harefield. Taken from the London Loop/Colne Valley Trail footpath."
    }
  ],
  "distance_km": 11.0,
  "description": "Follow the Colne Valley Trail from Uxbridge to Rickmansworth and enjoy riverside and canalside walking or cycling. The trails follows the Grand Union Canal and the River Colne while also passing a series of pretty Lakes including Lynsters, Stocker's and Batchworth Lake. The trail finishes at Batchworth Lake by the car park in Rickmansworth. You can continue your exercise on our Rickmansworth Walk This will take you around the lovely Rickmansworth Aquadrome where there's nature trails with lots of wildlife to look out for.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The route passes the West London town of Uxbridge which has an interesting history as the site of the attempted negotiations between King Charles I and the Parliamentary Army during the English Civil War. The public house at the centre of those events, since renamed the Crown & Treaty, still stands and is worthy of some investigation. The pub is Grade II* listed, and dates from 1576. There is even an album named after the pub by mercury prize nominated band Sweet Billy Pilgrim. The pub does very good food and also has a fine outdoor bar for the summer months. You can find the historic inn on Oxford Road at postcode UB8 1LU for your sat navs. At Batchworth Lock you can enjoy some refreshments at the Cafe at Lock 81. They have a variety of sandwiches, hot food, hot and cold drinks, chocolate, crisps and sweets. There's also the adjacent Canal Centre with a wealth of information and the excellent Little Union Canal. This miniature working model canal shows how a lock and canal works. You can find the cafe at 99 Church Street with a postcode of WD3 1JJ for your sat navs. The cafe is also dog friendly if you have your canine friend with you. In Harefield there's the splendid The Old Orchard to consider. They have a lovely large garden area where you can enjoy a meal outside on finer days. From there's a wonderful view towards the surrounding countryside, rivers and lakes of the Colne Valley. They also have a charming interior with interesting old photos on the wall. They serve a good range of high quality food and have a good drinks selection as well. You can find them to the north west of the woods at Park Lane with a postcode of UB9 6HJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near Uxbridge you'll pass the lovely Denham Country Park. The rivers Colne and Misbourne and the Grand Union Canal pass through the park and there is a variety of wildlife, including herons, kingfishers and dragonflies. The Colne Valley Park Visitor Centre is also located in the park and well worth a visit. There's a wealth of information about the area and a nice cafe which is a good place to stop for refreshments on the walk. At Rickmansworth you can pick up the Ebury Way, an easy shared cycle and walking trail running along a dismantled railway line to Watford. The Celandine Route runs just to the east of the trail. It will take you along the River Pinn from Pinner to Cowley. For more walking ideas in the area see the London Walks and Hertfordshire Walks pages."
    }
  ],
  "district": "London",
  "county": null,
  "region": "Greater London",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "London Borough of Hillingdon, London, Greater London, England, UB8 2TN, United Kingdom",
  "postcode": "UB8 2TN",
  "state": "England"
}