{
  "created_at": "2025-01-06T04:08:43.257839+00:00",
  "objectID": "e2fb63071179179295a6260ca4cba214",
  "ref": "bishop-bennet-way-walking-and-cycle-route",
  "title": "Bishop Bennet Way Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Bishop_Bennet_Way_-_geograph.org.uk_-_1244364.jpg",
  "nearby": [
    {
      "description": "Beeston Castle",
      "objectID": "827ea03a10bca37ada8a981f94f7a5bd",
      "ref": "beeston-castle-walking-route"
    },
    {
      "description": "Whitchurch Canal Walk",
      "objectID": "c2f44abb9cdfe60b3cf0004c5304ae9d",
      "ref": "whitchurch-canal-walk-walking-route"
    },
    {
      "description": "South Cheshire Way",
      "objectID": "22d317eab6b759964c1bbf210b20a772",
      "ref": "south-cheshire-way-walking-route"
    },
    {
      "description": "Shropshire Union Canal",
      "objectID": "d286ea892666d94e0e1ac40b769ac8f3",
      "ref": "shropshire-union-canal-walking-route"
    },
    {
      "description": "Farndon",
      "objectID": "4503cc2743cc716718018acbcf230bed",
      "ref": "farndon-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e2fb63071179179295a6260ca4cba214.gpx",
  "_geoloc": {
    "lat": 53.1318087317,
    "lng": -2.7098168901
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Bishop_Bennet_Way_-_geograph.org.uk_-_1244364.jpg",
      "title": "Dave Dunford / Bishop Bennet Way",
      "caption": "Well-maintained and attractive byway north of Cuddington Heath. The Bishop Bennet Way is a route for cyclists and horse-riders from Beeston Castle to Wirswall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Ford_Lane_ford_-_geograph.org.uk_-_177176.jpg",
      "title": "Dennis Turner / Ford Lane ford",
      "caption": "Ford Lane ford. Recently maintained ford crossing Crimes Brook and providing access to farmland to the north. To the right of the picture is a stile on the trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Bishop_Bennet_Way_near_Beeston_-_geograph.org.uk_-_1819351.jpg/512px-Bishop_Bennet_Way_near_Beeston_-_geograph.org.uk_-_1819351.jpg",
      "title": "Bishop Bennet Way near Beeston by Jeff Buck, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Near Beeston"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Tushingham_cum_Grindley_-_cottage_on_the_Bishop_Bennet_Way_-_geograph.org.uk_-_219023.jpg",
      "title": "Mike Harris / Tushingham cum Grindley - cottage on the Bishop Bennet Way",
      "caption": "Cottage on the Bishop Bennet Way (Tushingham bridleway 20) at its junction with footpath 12 and the ORPA from the Blue Bell pub at Bell o'th' Hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Hinton_Court%2C_near_Whitchurch_-_geograph.org.uk_-_1230178.jpg",
      "title": "Espresso Addict / Hinton Court, near Whitchurch",
      "caption": "Hinton Court, near Whitchurch. Timbered red-brick farmhouse with attached farm buildings adjacent to Hinton Old Hall (concealed by trees on right). The buildings straddle the square boundary; the front is in square, the farm buildings on the left side are partly in SJ5443. View from the South Cheshire Way and the trail, borth of which follow the farm track (right) and then go to the left (north) of the farm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/View_north_from_the_Bishop_Bennet_Way%2C_near_Wirswall_-_geograph.org.uk_-_1229642.jpg",
      "title": "Espresso Addict / View north from the Bishop Bennet Way, near Wirswall",
      "caption": "Near Wirswall. View north from the Bishop Bennet Way and South Cheshire Way immediately west of the high point (c. 145 metres) to the south of Wirswall. The flat Cheshire plain (right) is contrasted with the hillier Shropshire countryside (left)"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f4/Farmland_by_the_A49_-_geograph.org.uk_-_1230234.jpg",
      "title": "Espresso Addict / Farmland by the A49",
      "caption": "Farmland by the A49 Undulating farmland with occasional mature deciduous trees on either side of the A49. Cattle and sheep pasture, as in the foreground field, is the dominant agricultural land use in this area. The low-lying area near the road (centre left) shows clumps of marsh grass. Hinton Bank Farm is in the distance (centre left)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Beeston_Castle_-_geograph.org.uk_-_1566429.jpg",
      "title": "Eirian Evans / Beeston Castle, via Wikimedia Commons",
      "caption": "Beeston Castle. The medieval ruins of Beeston Castle stand on a rocky summit 500ft above the Cheshire plain, offering views from the Pennines in the east to the mountains of Wales in the west. It dates from 1225 when it was built by Ranulf, the sixth Earl of Chester, and contains one of the deepest castle wells in the country. It was seized by King Henry III in 1237 and used by him and later his son, King Edward I, as a base for their campaigns against the Welsh. The castle was finally destroyed at the end of the Civil War."
    }
  ],
  "distance_km": 52.0,
  "description": "The Bishop Bennet Way is a shared walking and cycling path running from Beeston in Cheshire to Wirswall on the Shropshire borders. The route starts at the 13th century Beeston Castle and proceeds through Milton Green, Churton and Shocklach where you will pass the Grade I listed Norman church. You continue to Grindley Brook where you cross the Shropshire Union Canal shortly before finishing at Wirswall near Whitchurch. For cyclists please note that a mountain bike is required for this route as there are some fairly rugged off road sections.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Letters Inn is a historic pub in the heart of the pretty village of Tattenhall in Cheshire. Inside there's a cosy roaring fire while outside there's a sun-trap terrace garden area. You can find them on the Hgh Street at postcode CH3 9PX. They are dog friendly if you are walking with your canine friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At Cheshire based Tattenhall you can visit the noteworthy Ice Cream Farm, the largest ice cream shop in the world. The popular tourist attraction includes expansive children's play areas, farm animals and quad bikes. You can find them at Drumlan Hall, Newton Ln, CH3 9NE. Just off the route in Cheshire you'll find the interesting village of Farndon. The village includes a noteworthy medieval bridge which spans the River Dee, connecting England to Holt in Wales. There's also The Hare for a pleasant pit stop. They serve good quality food and have a fine choice of real ales. Outside there's a pleasant terrace area where you can relax on warmer days. The pub is located on the High Street at postcode CH3 6PU for your sat navs."
    }
  ],
  "video_url": "https://www.youtube.com/embed/EKGfViOThcQ",
  "county": "Cheshire West and Chester",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Crimes Lane, Beeston, Cheshire West and Chester, England, CW6 9UB, United Kingdom",
  "postcode": "CW6 9UB",
  "district": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "rural",
    "canal",
    "off road"
  ],
  "points_of_interest": [
    "historic castle",
    "church",
    "canal"
  ],
  "facilities": [
    "car park",
    "canal access"
  ],
  "route_type": "out and back",
  "activity_type": [
    "walking",
    "cycling"
  ]
}