{
  "created_at": "2025-01-06T00:22:15.272772+00:00",
  "objectID": "e345d2a6fc45772b359c5c7e0edac2c8",
  "ref": "biggleswade-walking-and-cycle-route",
  "title": "Biggleswade Walks - The Green Wheel",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/aa/River_Ivel_in_Biggleswade_-_geograph.org.uk_-_612540.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e345d2a6fc45772b359c5c7e0edac2c8.gpx",
  "_geoloc": {
    "lat": 52.0926423,
    "lng": -0.2707046
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/River_Ivel_in_Biggleswade_-_geograph.org.uk_-_612540.jpg",
      "title": "Nigel Cox / River Ivel in Biggleswade",
      "caption": "River Ivel in Biggleswade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Biggleswade%2C_Ivel_Mill_-_geograph.org.uk_-_611781.jpg",
      "title": "Nigel Cox / Biggleswade: Ivel Mill",
      "caption": "Ivel Mill. There has been a watermill on this site on the River Ivel for over a thousand years, but after a fire in 1945 the building was used as warehouse, and then converted into flats in 1982."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Biggleswade%2C_George%27s_Hall_-_geograph.org.uk_-_612474.jpg",
      "title": "Nigel Cox / Biggleswade: George's Hall",
      "caption": "George's Hall. Opened in 1912 on the High Street, the Hall is named after the Liberal politician David Lloyd George, who was Chancellor of the Exchequer at the time. The Hall is still occupied by the Liberal Club. Although the brickwork of the façade appears to be fine, on close inspection the window frames appear to look very shabby now. The pub next door on the right is the Golden Pheasant."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Biggleswade%2C_The_Market_House_-_geograph.org.uk_-_609922.jpg",
      "title": "Nigel Cox / Biggleswade: The Market House",
      "caption": "The Market House. Originally built in 1565 as an administrative building for Biggleswade's market, The Market House was moved and substantially reconstructed in 1937 in order to accommodate the widening of the High Street, which was at that time on the old A1 road to the north from London. The original 16th century oak-framed roof was however preserved in the building in its new location. The building is now the home of the Peking Diner and Acorn Estate Agents."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Biggleswade.The_Crown_Hotel.jpg",
      "title": "Nigel Cox, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Crown Hotel. The Crown's history as a coaching inn on the old A1 road through Biggleswade is evidenced by the large and high gate at the far end where the old sign advertising livery and bait for sale has been retained. However the Crown's main claim to fame is that it was the place where the Great Fire of Biggleswade began on 16 June 1785. It was apparently started due to the carelessness of a servant who dumped ashes from the kitchen fire in the hotel yard near some dry straw. The ensuing inferno destroyed nearly a third of Biggleswade. The loss was estimated at £22,500, a fortune at the time. The Crown was however rebuilt and opened again in 1793."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/50/Furzenhall_Farm_-_geograph.org.uk_-_390265.jpg",
      "title": "d brewerton / Furzenhall Farm",
      "caption": "Furzenhall Farm on the common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Holme_Mills_sluice_and_River_Ivel_Navigation_disused_lock_-_geograph.org.uk_-_611657.jpg",
      "title": "Nigel Cox / Holme Mills sluice and River Ivel Navigation disused lock",
      "caption": "Holme Mills sluice and River Ivel Navigation disused lock. This sluice is part of the water level control equipment on the River Ivel at Holme Mills. Originally the river flowed through Holme Mills but when the River Ivel Navigation was extended from Biggleswade upstream to Shefford in 1823 a series of locks were built to bypass the various mills. The Navigation was abandoned in 1876 when the competition from the railways made transport by boat uneconomic."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Visitor_Centre_at_Jordans_Mill_%28geograph_3458691%29.jpg/512px-Visitor_Centre_at_Jordans_Mill_%28geograph_3458691%29.jpg",
      "title": "John M / Visitor Centre at Jordans Mill",
      "caption": "Visitor Centre at Jordans Mill"
    }
  ],
  "distance_km": 14.0,
  "description": "This market town in Bedfordshire has fine trails along the peaceful River Ivel and some attractive local countryside to explore. This circular walk or cycle around the town follows the waymarked Biggleswade Green Wheel and the Kingfisher Way through the surrounding area. On the way you'll pass local historic mills and enjoy some easy riverside footpaths. The walk starts just to the west of the train station and town centre on the River Ivel. Follow the waterside path north to Manor Farm and then head east to Biggleswade Common. You then follow footpaths south through the countryside to the east of the town before continuing to Holme. The route then rejoins the river path and heads north to return to the start point. On the last section you'll pass the noteworthy Jordan's Mill. There's some lovely wildlflower gardens surrounding this historic Victorian flour mill which is a popular local attraction and one of the local highlights. At the site you can learn all about Bedfordshire's interesting flour production history from the excellent your guides. You can find the mill on the route at postcode SG18 9JX for your sat navs.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Stratton House Hotel is an interesting place for some post walk refreshment. The fine timber-framed building dates all the way back to the 17th century and even joined the war effort, when it became the Civil Defence HQ in 1940. They have pub and restaurant dining with seating inside and out. You can find them on London Road with a postcode of SG18 8ED for your sat navs. Jordan's Mill mentioned above also has a delightful Riverside Café to try. You can sit outside and enjoy rest and refreshment with views over the river."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you continue north along the river it will take you to Sandy where you can pick up the Greensand Ridge Walk. There's also the lovely Lodge Nature Reserve to visit on the Sandy Walk. The reserve is notable as the headquarters of the RSPB and includes an excellent visitor centre with formal gardens. You can also pick up the Bedford to Sandy Country Way and visit Priory Country Park on a dismantled railway line. To the north east you can pick up the long distance Clopton Way in Potton Wood where there are pretty bluebells in the spring. There's the riverside Ouse Valley Way Walk to try in nearby St Neots too. To the west is the chocolate box village of Old Warden. The village is famous for the Shuttleworth Museum of historic airplanes and motor vehicles at Old Warden Aerodrome. The area also includes Old Warden Park where there are some lovely Swiss gardens, parkland walks and pretty lakes. For more walking ideas in the area see the Bedfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/gZsYOIK42NY",
  "postcode": "SG18 0AB",
  "district": "Northill",
  "county": "Central Bedfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Shortmead Street, Northill, Central Bedfordshire, England, SG18 0AB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "river",
    "countryside"
  ],
  "points_of_interest": [
    "historic mills",
    "wildflower gardens",
    "local attraction"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}