{
  "objectID": "e34735dcc0636df43484be04c2bf3f84",
  "created_at": "2024-12-19T04:16:56.388088+00:00",
  "ref": "goring-walking-route",
  "title": "Goring River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0e/The_River_Thames%2C_Goring_-_geograph.org.uk_-_695714.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/4B8F998E3D01522B8025843100760D96/$FILE/Goring.gpx",
  "_geoloc": {
    "lat": 51.5230140861,
    "lng": -1.1392488108
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/The_River_Thames%2C_Goring_-_geograph.org.uk_-_695714.jpg",
      "title": "Andrew Smith / The River Thames, Goring, via Wikimedia Commons",
      "caption": "The River Thames, Goring Looking upstream from the Oxfordshire side of the river. The wooded hill is part of the Holies, a National Trust property."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/Goring_On_Thames_%28river_cottage%29_-_geograph.org.uk_-_1440180.jpg",
      "title": "Kurt C / Goring On Thames (river cottage), via Wikimedia Commons",
      "caption": "Goring On Thames (river cottage) A pretty scene of a river cottage on the western bank of the River Thames."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Goring_Bridge.JPG/256px-Goring_Bridge.JPG",
      "title": "Sarepava [CC BY 3.0 (https://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons",
      "caption": "Goring and Streatley Bridge seen from the east bank of the river Thames, looking north. The lock is visible in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Goring_Weir_-_geograph.org.uk_-_946304.jpg",
      "title": "Stephen McKay / Goring Weir, via Wikimedia Commons",
      "caption": "Goring Weir on the River Thames, viewed from the Berkshire bank. Here the weir at Goring drops the level of the Thames by almost six feet. On the far bank is the lock-keeper's house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Ridgeway_approaching_South_Stoke_-_geograph.org.uk_-_592151.jpg",
      "title": "Chris Heaton / Ridgeway approaching South Stoke, via Wikimedia Commons",
      "caption": "Ridgeway approaching South Stoke Beside the Thames, and approaching the village from the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/86/Moulsford_Bridge%2C_River_Thames_-_geograph.org.uk_-_36216.jpg",
      "title": "Colin Bates / Moulsford Bridge, River Thames, via Wikimedia Commons",
      "caption": "Moulsford Railway Bridge over the River Thames, viewed from playing fields on the northern edge of Moulsford village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/River_Thames_at_Streatley_-_geograph.org.uk_-_337061.jpg",
      "title": "Graham Horn / River Thames at Streatley, via Wikimedia Commons",
      "caption": "River Thames at Streatley. On the Berkshire side of the river, the Swan at Streatley forms the waterfront in front of the weir (below the photographer. The lock is further to the east (right) on the Oxfordshire side of the river. The Oxford barge (blue vessel in the middle) is a permanently moored feature and is available for hire for conferences, receptions and civil weddings."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/GoringMill01.JPG/512px-GoringMill01.JPG",
      "title": "Motmit [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Goring, Oxfordshire, with the mill and parish church"
    }
  ],
  "distance_km": 18.0,
  "description": "This riverside village in South Oxfordshire is ideally located for walking with two National Trails passing through the area. Both The Ridgeway and the Thames Path head through the village and are a great way to explore the river and the surrounding countryside. The noteworthy village was named Oxfordshire's Village of the Year in 2009 and also has an interesting church with parts dating from the 13th century. This circular walk uses both waymarked trails to take you along both sides of the River Thames. You'll pass through two counties as in this area the river bisects Oxfordshire and Berkshire. Starting on the eastern side of the river at Goring Bridge, the route first heads north along the Ridgeway to South Stoke and North Stoke. At Mongewell you cross to the other side, although you could continue to nearby Wallingford if you prefer. On the western side of the river you pick up the Thames Path and follow it south. You'll pass the Berkshire settlements of Moulsford and Streatley, before crossing Goring Bridge to return to Goring. At Streatley you will pass the lovely riverside Swan Inn, which is a great place to sit outside and enjoy refreshments in the summer months. To continue your walking in the village you can pick up the The Swan's Way long distance trail. The shared cycling and walking trail starts in Goring and runs all the way to Salcey Forest . You can also continue along the Ridgeway and explore the surrounding Chilterns countryside. Our Streatley Circular Walk will take you up into the hills to the west of the village. Heading south along the thames will take you to Pangbourne and the lovely Mapledurham House .",
  "video_url": "https://www.youtube.com/embed/Squ3cp522nc",
  "postcode": "RG8 9AN",
  "district": "Goring",
  "county": "Oxfordshire",
  "region": "South East",
  "country": "England"
}