{
  "objectID": "e37d024d38cea425a85a8a62e8b1fac0",
  "created_at": "2024-12-21T19:41:42.212379+00:00",
  "ref": "lismore-lady-louisas-walk-walking-route",
  "title": "Lismore Lady Louisa's Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/41/Information_board_for_Lady_Louisa%27s_Walk%2C_Lismore-Lios_Mor_-_geograph.org.uk_-_1917275.jpg?20210424040501",
  "nearby": [
    {
      "description": "Ballysaggartmore Towers",
      "objectID": "a928a9492d367fa0812ddcde3609ea01",
      "ref": "ballysaggartmore-towers-walking-route"
    },
    {
      "description": "The Vee",
      "objectID": "ff39dfa1837205c0ed86b2981e1d95d8",
      "ref": "the-vee-walking-route"
    },
    {
      "description": "Dungarvan",
      "objectID": "dc702fe1ea4d3a10a64e4481ff51b19a",
      "ref": "dungarvan-walking-route"
    },
    {
      "description": "Knockadoon Cliff Walk",
      "objectID": "8b8ba01936deea2dc664dd72de12c7c9",
      "ref": "knockadoon-cliff-walk"
    },
    {
      "description": "Youghal Beach Boardwalk",
      "objectID": "858b8e23bf7660408c48bb455c0d0849",
      "ref": "youghal-beach-walk"
    },
    {
      "description": "Midleton To Youghal Greenway",
      "objectID": "338154e93b560249cf42b9fe5dfaa354",
      "ref": "midleton-to-youghal-greenway-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/1A402F3CBDB663F386258B8F003A32B1/$FILE/Lismore Lady Louisas Walk.gpx",
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Information_board_for_Lady_Louisa%27s_Walk%2C_Lismore-Lios_Mor_-_geograph.org.uk_-_1917275.jpg?20210424040501",
      "title": "Information board for Lady Louisa's Walk, Lismore/Lios Mor by Mac McCarron, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Information board for Lady Louisa's Walk, Lismore/Lios Mor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/River_Blackwater_-_geograph.org.uk_-_5926412.jpg/512px-River_Blackwater_-_geograph.org.uk_-_5926412.jpg?20231214054110",
      "title": "River Blackwater by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Blackwater. The is well known for its salmon fishing, with numerous fishing stands and stiles along its banks. A notable landmark along the river is the Round Hill, a large earthwork covered by a stand of mature pine trees. This site holds historical significance as the location of the first monastic settlement in Lismore, founded by St. Carthage in the 7th century. St. Carthage, guided by a local woman's prophecy, established the settlement on Round Hill, which he named \"Lios Mor\" (meaning \"great fort\" in Irish). The monks who followed Carthage built small beehive huts along the riverbank, and the settlement grew into a prominent religious and educational center, often referred to as a great university city in medieval times. The site remains an important historical and spiritual landmark, reflecting the deep religious and cultural heritage of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Grassland_to_the_west_of_Lady_Louisa%27s_Walk%2C_Lismore-Lios_Mor_-_geograph.org.uk_-_1903589.jpg?20210421060233",
      "title": "Grassland to the west of Lady Louisa's Walk, Lismore/Lios Mor by Mac McCarron, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Grassland to the west of Lady Louisa's Walk, Lismore/Lios Mor"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Lismore_Castle_2.jpg/512px-Lismore_Castle_2.jpg?20080208193306",
      "title": "Dermot, CC BY-SA 2.5 <https://creativecommons.org/licenses/by-sa/2.5>, via Wikimedia Commons",
      "caption": "Lismore Castle. The castle dates back to 1185 and was once the home of the famous Broadway performer Adele Astaire and also Kathleen Kennedy, sister of John F. Kennedy.   You can explore the beautiful gardens of the castle during the warmer months. The castle belonged to the Earls of Desmond, and subsequently to the Cavendish family from 1753. It is currently the Irish home of the Duke of Devonshire. It was largely re-built in the Gothic style during the mid-nineteenth century for the 6th Duke of Devonshire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/18/Saint_Carthage%27s_Cathedral_-_Church_of_Ireland%2C_Lismore-Lios_Mor_-_geograph.org.uk_-_1908232.jpg?20210422044203",
      "title": "Saint Carthage's Cathedral - Church of Ireland, Lismore/Lios Mor by Mac McCarron, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "In the town you can also visit St. Carthage’s Cathedral, which dates from 1633. The site's ecclesiastical significance, however, stretches much further back to the 7th century, when St. Carthage founded a monastery there. This religious community established Lismore as a renowned center of learning throughout Europe during the medieval period. The present cathedral, perched on a scenic hill and surrounded by greenery, offers visitors the chance to explore a wealth of historical and artistic features. Inside, you can find medieval tombs, intricate stone carvings, and exquisite stained glass windows. The cathedral's blend of history and beauty makes it a significant attraction for those interested in Ireland's rich cultural and religious heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Waterfall%2C_Millennium_Park%2C_Lismore-Lios_Mor_-_geograph.org.uk_-_1916582.jpg?20210423211145",
      "title": "Waterfall, Millennium Park, Lismore/Lios Mor by Mac McCarron, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Waterfall, Millennium Park, Lismore/Lios Mor. The park, located in the heart of the town, is a charming space that makes the most of its modest size by incorporating a variety of interesting features. It is home to a selection of beautiful plants and trees, which enhance the park's appeal and complement the area's rich heritage. This blend of natural beauty and historical significance makes the park a peaceful retreat in the midst of the town's hustle and bustle."
    }
  ],
  "distance_km": 2.0,
  "description": "This waymarked loop walk takes around the town of Lismore in County Waterford. The circular trail passes the historic Lismore Castle and the medieval cathedral before a pleasant riverside section along the River Blackwater. The easy walk runs for about 2km and includes an information board with more details about the area. On the way you can enjoy views of the Knockmealdown mountains and look out for the interesting flora and fauna in the woodland by the riverbank. Keep your eyes peeled for birds such as heron, water hens, snipe, tern and kingfisher. A stroll around the pretty Millennium Park is also recommended. See the photos below for more details on the town's historic buildings. To continue your walking around Lismore head west to visit Head the Ballysaggartmore Towers. The photogenic gothic towers are surrounded by an historic demesne with peaceful woodland trails to explore.",
  "video_url": "https://www.youtube.com/embed/YwvqHepgvPs?si=1f_BIjTcfP_3BihU"
}