{
  "created_at": "2025-01-06T18:48:46.169360+00:00",
  "objectID": "e39af5aeda6049f6f37195a68dcfb541",
  "ref": "limerick-greenway-walking-route",
  "title": "Limerick Greenway Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Art_deco_cinema%2C_Rathkeale%2C_Co._Limerick_-_geograph.org.uk_-_581939.jpg",
  "nearby": [
    {
      "description": "Limerick 3 Bridges",
      "objectID": "0e57cc1d89fa8e727f840f22d849a6ce",
      "ref": "limerick-3-bridges-walking-route"
    },
    {
      "description": "Lough Derg Way",
      "objectID": "d82f4cda8f9a8a95a5dd591a32a9d260",
      "ref": "lough-derg-way-walking-route"
    },
    {
      "description": "Lough Gur",
      "objectID": "2962a20734ecefb121e268f0ade57898",
      "ref": "lough-gur-walking-route"
    },
    {
      "description": "Adare",
      "objectID": "8e348d955193556ee256931d689b4080",
      "ref": "adare-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e39af5aeda6049f6f37195a68dcfb541.gpx",
  "_geoloc": {
    "lat": 52.525618,
    "lng": -8.9442779
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Art_deco_cinema%2C_Rathkeale%2C_Co._Limerick_-_geograph.org.uk_-_581939.jpg",
      "title": "Jonathan Billinger / Art deco cinema, Rathkeale, Co. Limerick",
      "caption": "Art deco cinema, Rathkeale, Co. Limerick. Rathkeale, a bustling market town, holds a significant place in history as a vital stop on the former Limerick to Tralee railway line. The old railway station, inaugurated in 1867, remains a testament to this bygone era. Remarkably, to accommodate the evolving road infrastructure in the late 20th century, the station was meticulously relocated, stone by stone, to its present location. This careful preservation effort safeguards a piece of Limerick's rich heritage, allowing residents and visitors alike to connect with the region's historical significance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Ardagh_-_Ardagh_Heritage_Village-Stewards_House_-_20170930222056.jpg/512px-Ardagh_-_Ardagh_Heritage_Village-Stewards_House_-_20170930222056.jpg",
      "title": "Jamesco101, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Ardagh Heritage Village-Stewards House. Ardagh Station, inaugurated in 1867, saw its inaugural train service just a year before the momentous discovery of the Ardagh Chalice. This iconic artifact, part of an early Christian art hoard, is now showcased at the National Museum in Dublin. Visitors to Limerick can also view a replica of the Ardagh Chalice at the Hunt Museum, providing an opportunity to appreciate the cultural and historical significance of this remarkable find."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/Steam_train_on_Barnagh_bank_-_geograph.org.uk_-_2432095.jpg",
      "title": "The Carlisle Kid / Steam train on Barnagh bank",
      "caption": "Steam train on Barnagh bank in 1972. Barnagh Viewing Point, situated at an elevation of 164 meters above sea level, offers panoramic vistas of the Limerick countryside. From this vantage point, visitors can behold the picturesque towns of Newcastle West, Abbeyfeale, Adare, and Askeaton, extending the gaze to neighboring counties Clare and Cork. The site is not just a scenic viewpoint but also features a designated picnic area, providing a tranquil space for visitors to relax and enjoy the stunning landscapes after a leisurely ascent to the top."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Railway_arch_over_the_old_road_-_geograph.org.uk_-_566672.jpg",
      "title": "Jonathan Billinger / Railway arch over the old road",
      "caption": "Railway arch over the old road. A dismantled railway, but the bridge is preserved. The old road between Newcastle West and Abbeyfeale, Co. Limerick, is now bypassed by the N21 to the north of this scene; partly because of the steepness of this hill and possibly because of the local significance of this bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Old_railway_-_geograph.org.uk_-_3691025.jpg/512px-Old_railway_-_geograph.org.uk_-_3691025.jpg",
      "title": "Old railway by Neville Goodman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Old railway near Ardagh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Newcastle_West%2C_The_Square.jpg",
      "title": "Harold Strong / The Square, Newcastle West, Co. Limerick",
      "caption": "Newcastle West, The Square. Newcastle West, Limerick's largest town, beckons visitors with a rich tapestry of cultural and historical attractions, along with charming boutique shops. History enthusiasts can delve into the past at Desmond Castle, while the expansive Castle Demesne park offers excellent facilities for leisure and recreation. The town's welcoming atmosphere extends to cosy pubs and quality restaurants, providing a perfect setting for relaxation. Newcastle West also serves as a hub for the Greenway, offering convenient parking facilities for those exploring the scenic trails."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/39/Western_County_Limerick_-_geograph.org.uk_-_581651.jpg",
      "title": "Jonathan Billinger / Western County Limerick",
      "caption": "Western County Limerick. A pastoral view towards the hills around Dromada, north of the N21 between Abbeyfeale and Newcastle West."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/The_former_Abbeyfeale_station_%28geograph_5020039%29.jpg/512px-The_former_Abbeyfeale_station_%28geograph_5020039%29.jpg",
      "title": "Jonathan Thacker / The former Abbeyfeale station",
      "caption": "The former Abbeyfeale station. Abbeyfeale stands as a significant market town in Limerick, playing a crucial role as one of the key stops along the Limerick Greenway. In its historical context, the railway station was a bustling hub on the Limerick to Tralee railway, witnessing a period of heightened activity during the expansion of the railway system in 1880. Situated on the border between Kerry and Limerick, Abbeyfeale's railway station reflects the region's historical transportation significance."
    }
  ],
  "distance_km": 39.0,
  "description": "This 39km linear route runs from Rathkeale to Abbeyfeale in County Limerick. The shared cycling and walking trail runs along a disused railway line, passing Newcastle West on the way. The route passes several historic villages with lovely views of the West Limerick countryside to enjoy too. Other highlights include the Barnagh Viewing Point where you can enjoy some splendid scenery from the elevated spot. The historic Desmond Castle in the interesting town of Newcastle West is also well worth exploring.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "In nearby Limerick there's the popular Limerick 3 Bridges Walk which takes you along the river to several of the city's historic highlights. Just south of Limerick there's Lough Gur to explore. The photogenic horseshoe-shaped lake includes walking trails, picnic areas and ancient sites of historical and archeological interest."
    }
  ],
  "video_url": "https://www.youtube.com/embed/G3EdQQTwya8?si=bhio0gNWKl-YQ70q&start=80",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Limerick Greenway, Rathkeale Urban, The Municipal District of Adare — Rathkeale, County Limerick, Munster, Éire / Ireland",
  "postcode": null,
  "district": "The Municipal District of Adare — Rathkeale",
  "county": "County Limerick",
  "region": null,
  "state": null,
  "country": "Éire / Ireland"
}