{
  "created_at": "2025-01-06T02:51:32.895344+00:00",
  "objectID": "e3dfa01fd178f1c058f4bedcc2f053ac",
  "ref": "speke-hall-walking-route",
  "title": "Speke Hall Coastal Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Runway_from_Speke_Hall_-_geograph.org.uk_-_48000.jpg",
  "nearby": [
    {
      "description": "Mersey Way",
      "objectID": "479b428bfe6e07a11348304217ee7a32",
      "ref": "mersey-way-walking-route"
    },
    {
      "description": "Hale Lighthouse",
      "objectID": "a6cd65f420ceeb43ed78b2bab0083498",
      "ref": "hale-lighthouse-walking-route"
    },
    {
      "description": "Warrington",
      "objectID": "ccf37fb2245bb902887a8a00746a2abb",
      "ref": "warrington-walking-route"
    },
    {
      "description": "Stadt Moers Park",
      "objectID": "e073fd9d8a7b896ad83cd6be06b65196",
      "ref": "stadt-moers-park-walking-and-cycle-route"
    },
    {
      "description": "Sutton Manor",
      "objectID": "5e249ba842e7d1896b2007adc2c5ea55",
      "ref": "sutton-manor-walking-route"
    },
    {
      "description": "Clock Face Country Park",
      "objectID": "445bb94100735160cfe3df828c8d7a91",
      "ref": "clock-face-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e3dfa01fd178f1c058f4bedcc2f053ac.gpx",
  "_geoloc": {
    "lat": 53.3360967449,
    "lng": -2.8691470666
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Runway_from_Speke_Hall_-_geograph.org.uk_-_48000.jpg",
      "title": "Sue Adair / Runway from Speke Hall, via Wikimedia Commons",
      "caption": "Runway from Speke Hall. Taken from the \"bund\" of Speke Hall, an earthen mound that surrounds the Tudor mansion house, allowing impressive views of both the river Mersey and John Lennon airport runways, plane spotters heaven!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/View_of_the_Mersey_from_Speke_Hall_-_geograph.org.uk_-_48002.jpg",
      "title": "Sue Adair / View of the Mersey from Speke Hall, via Wikimedia Commons",
      "caption": "View of the Mersey from Speke Hall. The earthern mound of the bund surrounding Speke Hall offers extensive views of the Mersey basin and North Wales across the airport runway. The known history of the manor of Speke, or 'Spec' (brushwood in Old English), goes back to the Domesday survey of 1086 which records that it was one of several properties held by Uctred in 1066. When Adelaide Watt came into her inheritance of Speke Hall, she set about developing a huge new farm complex, and was determined that such an historic property should be preserved for all time, irrespective of the massive amount of industrial development that was fast spreading out from the city. Having made a limited provision in her will to save the house, the estate was sold after she died in 1921, and the farm complex transformed into an aerodrome. It is amazingly surreal to be wandering along the uneven corridors of the hall, quietly absorbed in the atmosphere of a romantic Elizabethan courtyard house, when suddenly the throaty sounds of a 21st century jet rudely interrupts the visions of a more genteel way of life."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/81/Speke_Hall_-_geograph.org.uk_-_47998.jpg",
      "title": "Sue Adair / Speke Hall",
      "caption": "In a most unlikely setting, at the edge of a modern industrial estate and bordering on the runway of Liverpool Airport, stands this enchanting black and white, half-timbered Tudor mansion. Having suffered long periods of desertion and neglect, it is little short of a miracle that the building has survived at all, but even more surprising is that is has remained virtually unaltered since it was first built for the Norris family some 500 years ago. It is considered to be one of the most outstanding examples of its kind. Its present form dates from the period 1490-1612, but there was an earlier house on or near the site of the present building."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Mersey_Way_beside_old_Liverpool_Airport_-_geograph.org.uk_-_493534.jpg",
      "title": "Mike Harris / Mersey Way beside old Liverpool Airport, via Wikimedia Commons",
      "caption": "Mersey Way beside old Liverpool Airport The Mersey Way beside old Liverpool Airport - new boat house under construction in distance and a distant glimpse of the Mersey."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/River_Mersey_at_end_of_Brunswick_Street%2C_Garston_-_geograph.org.uk_-_493529.jpg",
      "title": "Mike Harris / River Mersey at end of Brunswick Street, Garston, via Wikimedia Commons",
      "caption": "River Mersey at end of Brunswick Street, Garston. Salt marsh and the view across the river to the Stanlow oil refineries and the chemical works on Helsby Marsh."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Saltmarsh_and_clay_cliffs_near_old_Liverpool_airport_-_geograph.org.uk_-_41927.jpg",
      "title": "Sue Adair / Saltmarsh and clay cliffs near old Liverpool airport, via Wikimedia Commons",
      "caption": "Saltmarsh and clay cliffs near old Liverpool airport. Perfect for the wading birds but not much to recommend it to ramblers"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Dungeon_Banks_on_the_Mersey_-_geograph.org.uk_-_683753.jpg",
      "title": "Sue Adair / Dungeon Banks on the Mersey, via Wikimedia Commons",
      "caption": "Dungeon Banks on the, a favourite spot for wading birds, from the clifftop looking towards Hale Lighthouse."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/River_Mersey%2CDungeon_Bank_-_geograph.org.uk_-_28120.jpg",
      "title": "Sharon Crowther / River Mersey,Dungeon Bank, via Wikimedia Commons",
      "caption": "River Mersey,Dungeon Bank. Looking towards Hale Village on the Mersey Way."
    }
  ],
  "distance_km": 4.0,
  "description": "This circular coastal walk visits the National Trust owned Speke Hall in Liverpool. The area also includes the lovely Speke and Garston Coastal Reserve which stretches from Garston Docks to Liverpool John Lennon Airport on the banks of the Mersey Estuary. As such this is a nice walk to do if you are waiting for a delayed plane from the airport! Plane spotters will also enjoy watching the planes taking off and landing from the reserve. It's a nice varied walk with coast, parkland, gardens and bluebell woodland some of the features of the route. The walk starts from the car park at Speke Hall where you can pick up the trails taking you past the Grade I listed house and into the grounds of the hall. More trails then lead you up to the coast where you can explore the nature reserve using a section of the Mersey Way long distance trail. As well as the fine views across the Mersey Estuary there is also lots of interesting wildlife to look out for. Keep your eyes peeled for many wading birds including redshanks, dunlins and curlews as you make your way along the trail. It's easy to extend the walk if you have time. You could follow the Mersey Way south east, past the airport to Dungeon Banks which is another beauty spot with many wading birds. This would take you to the Hale Lighthouse, a popular walking destination in the area. The trail then continues along the river into Widnes and Warrington .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The hall has a lovely National Trust cafe where you can refresh yourself after the walk. You can enjoy a cream tea here in the outdoor seating area in the attractive courtyard if the weather is fine."
    },
    {
      "subtitle": "Dog Walking",
      "content": "Dogs are welcome at Speke Hall and the estate is a lovely place to walk your dog. It's advised to keep them on a short lead and check at the site to see which area's they are not allowed in. You can find a water bowl outside the main restaurant as well."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Widnes Walk visits the hall from the nearby town. It starts in the lovely Spike Island park and follows the Mersey to Hale Lighthouse before reaching the hall. Head few miles north and you could visit the popular Stadt Moers Park where there's lakes, meadows, woodland and cycle trails to enjoy. For more walking ideas in the area see the Merseyside Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UwjurTiRA4w",
  "postcode": "L24 1XD",
  "district": "Liverpool",
  "region": "Liverpool City Region",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Walk, Speke, Liverpool, Liverpool City Region, England, L24 1XD, United Kingdom",
  "county": null,
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "easy",
  "terrain": [
    "coastal",
    "woodland",
    "parkland",
    "garden"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "nature reserve"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}