{
  "created_at": "2025-01-05T23:44:17.346363+00:00",
  "objectID": "e43fcc3efcf274b6df8da87ad4aab373",
  "ref": "coalville-walking-route",
  "title": "Coalville Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/c6/The_Old_Manor_House_-_geograph.org.uk_-_773969_%28cropped%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e43fcc3efcf274b6df8da87ad4aab373.gpx",
  "_geoloc": {
    "lat": 52.7107301929,
    "lng": -1.3751738819
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c6/The_Old_Manor_House_-_geograph.org.uk_-_773969_%28cropped%29.jpg",
      "title": "Robert Haywood, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Old Manor House. The ancient manor house at Donington-le-Heath was derelict for many years in the 1950's and 60's, and was almost lost to posterity. Now owned by the County Council, it is a worthy museum to our ancient heritage and stages many events annually."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Path_down_to_the_lakes_at_Sence_Valley_Forest_Park_-_geograph.org.uk_-_1494729.jpg",
      "title": "Trevor Rickard / Path down to the lakes at Sence Valley Forest Park",
      "caption": "Path down to the lakes at Sence Valley Forest Park. Heading north to the hairpin which leads left to the lakes at the bottom of the valley. Now part of the National Forest, it is hard to believe that this area was part of the open cast mine, which between 1982 and 1996 produced eight million tons of coal for nearby power stations."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Kelham_Bridge_Nature_Reserve_-_geograph.org.uk_-_1571161.jpg",
      "title": "John Talbut / Kelham Bridge Nature Reserve",
      "caption": "Kelham Bridge Nature Reserve, just south east of the manor house."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/View_from_Billa_Barra_Hill_-_geograph.org.uk_-_513998.jpg",
      "title": "Mat Fascione / View from Billa Barra Hill",
      "caption": "View from Billa Barra Hill. Looking towards Bardon Hill Quarry, Bardon Hill is the high ground to the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Battram_Wood_-_geograph.org.uk_-_158847.jpg",
      "title": "Andrew Tatlow / Battram Wood",
      "caption": "Battram Wood. Battram Wood is part of the Charnwood Forest area and was planted from 1999 onwards. Come back in 100 years!"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Thornton_viewed_from_Bagworth_Heath_-_geograph.org.uk_-_542243.jpg",
      "title": "Mat Fascione / Thornton viewed from Bagworth Heath",
      "caption": "Thornton viewed from Bagworth Heath. Part of 75 hectares of woodland, heathland, grassland and lakes within the National Forest in Leicestershire."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Looking_towards_the_northwest_arm_of_Thornton_Reservoir_-_geograph.org.uk_-_331928.jpg",
      "title": "Kate Jewell / Looking towards the northwest arm of Thornton Reservoir",
      "caption": "Looking towards the northwest arm of Thornton Reservoir. This 75 acre Severn Trent reservoir is set in rolling farmland and woodland with public access. There are trails for walkers, cyclists and for the disabled. Leicester relied on wells and springs for drinking water, like most large cities and towns, until the 19th century when the cholera epidemics in 1831,1832 and 1847 forced Parliament into action. In 1847, an Act of Parliament allowed a private company to be formed to supply the city. By 1854, it had already built Thornton reservoir, together with a treatment plant and distribution mains. Cropston Reservoir was added in 1866, and Swithland Reservoir in 1896."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Bardon_Hill_-_geograph.org.uk_-_681852.jpg",
      "title": "Richard Webb / Bardon Hill",
      "caption": "Bardon Hill trig point."
    }
  ],
  "distance_km": 26.0,
  "description": "This Leicestershire based town is close to a number of peaceful woodland areas and an excellent viewpoint at the high point in the county. This circular walk around Coalville visits some of the highlights of the area including Donington le Heath Manor House, Sence Valley Forest Park, Grange Woods, Bagworth Heath Woods, Thornton Reservoir and the highest point in Leicestershire at Bardon Hill. The walk starts at Donington le Heath Manor House on the south western side of the town. The historic 17th century house is one of the highlights of the area and includes a beautiful garden. The fully furnished house was owned by a family who lived in the shadow of the Gunpowder Plot. From the house the route then follows public footpaths south west to visit the Sence Valley Forest Park where there's a series of lakes and some pleasant woodland trails. You could take a slight detour from the route here to visit the adjacent Queen Elizabeth Diamond Jubilee Wood which was planted in 2012 to celebrate the Queen's Diamond Jubilee. It's another pleasant area with woodland trails and a lake in the centre. The route continues south east through Ibstock where you'll pass through Grange Wood and Battram Wood where there's a signed cycle route. You continue south east towards Bagworth where you'll pass Royal Tigers and Centenary Wood before coming to Bagworth Heath Woods where there are good wildlife spotting opportunites. In the Bagworth area you pick up sections of the Ivanhoe Way and the Leicestershire Round and follow the waymarked paths east to the pretty Thornton Reservoir. Here you turn north through Browns Wood and Stanton Under Barton before climbing to the viewpoints at Billa Barra Hill and Bardon Hill, the highest point in the county. There's a radio mast, an old quarry and fine views to the Malvern Hills, the Shropshire Hills and the Peak District from the hill top. After descending the hill you head south west through Greenhill and Hugglescote to return to Coalville town centre.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "On the outskirts of the town The Birch Tree is a good choice for refreshment. The main draw here is a really lovely garden area where you can relax on warmer days. You can find them on Bardon Road at postcode LE67 1TD for your sat navs. On the route you could stop off at The Bulls Head in Abbot's Oak, near Bardon Hill. They serve good food with particularly fine Italian stone-baked pizzas. There's also a lovely garden area to relax in on warmer days. You can find them at postcode LE67 4QQ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The countryside, woodland and heathland on the route make for a fine dog walk. The Birch Tree and Bulls Heads pubs mentioned above are also very dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just north of the route near Whitwick there's the fascinating Mount St Bernard Abbey to visit. Here you can explore the grounds with its beautiful gardens, visit the church and walk up to the cross at 'Calvary'. From the elevated position of the cross there's lovely views over the area. Near the abbey there's another local historic landmark at the 13th century Grace Dieu Priory. The anicent ruins of the priory are surrounded by some pleasant woodland with trails along the Grace Dieu brook. The National Forest Way passes through the area. The long distance trail takes you to several of the highlights of the National Forest area. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/Jrq_2B70lf0",
  "district": "North West Leicestershire",
  "county": "Leicestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ashburton Road, Hugglescote and Donington le Heath, Hugglescote, North West Leicestershire, Leicestershire, England, LE67 2GP, United Kingdom",
  "postcode": "LE67 2GP",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "lake"
  ],
  "facilities": [
    "car park",
    "signed cycle route",
    "radio mast"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}