{
  "created_at": "2025-01-06T02:25:43.799743+00:00",
  "objectID": "e45db90aeb108cc124e22ce46415f3c1",
  "ref": "bingley-st-ives-walking-route",
  "title": "Bingley St Ives Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/0/03/Lady_Blantyre%27s_Rock_St._Ives_Bingley_-_geograph.org.uk_-_40326.jpg",
  "nearby": [
    {
      "description": "Saltaire",
      "objectID": "8bf4e7a98d229c95d272714d9ad8eeeb",
      "ref": "saltaire-walking-route"
    },
    {
      "description": "Leeds and Liverpool Canal",
      "objectID": "fa6cd622bb8bb404353c325eb4d48350",
      "ref": "leeds-and-liverpool-canal-walking-and-cycle-route"
    },
    {
      "description": "River Aire",
      "objectID": "f4378310bbed8615749b0e633394b3a6",
      "ref": "river-aire-walking-route"
    },
    {
      "description": "Shipley Glen",
      "objectID": "fd5590a126ab1af86659bfab27a70b5c",
      "ref": "shipley-glen-walking-route"
    },
    {
      "description": "Goit Stock Waterfall",
      "objectID": "549134a5377407cf340d1d1710266eba",
      "ref": "goit-stock-waterfall-walking-route"
    },
    {
      "description": "Great Northern Railway Trail",
      "objectID": "014b68fe31be9475694554e35248c9aa",
      "ref": "great-northern-railway-trail-walking-and-cycle-route"
    },
    {
      "description": "Baildon Moor",
      "objectID": "97bbafde0bce261b061b1da60a4845b8",
      "ref": "baildon-moor-walking-and-cycle-route"
    },
    {
      "description": "Silsden",
      "objectID": "32572dc65f518d88678873ba6b76c1f7",
      "ref": "silsden-walking-route"
    },
    {
      "description": "Horton Bank Country Park",
      "objectID": "511799851602ddfa11fdd46e2e34a1f5",
      "ref": "horton-bank-country-park-walking-route"
    },
    {
      "description": "Chellow Dene Reservoir",
      "objectID": "20af485e7025d61a30602fedff94ea49",
      "ref": "chellow-dene-reservoir-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e45db90aeb108cc124e22ce46415f3c1.gpx",
  "_geoloc": {
    "lat": 53.8468144132,
    "lng": -1.849261894
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/03/Lady_Blantyre%27s_Rock_St._Ives_Bingley_-_geograph.org.uk_-_40326.jpg",
      "title": "Mick Melvin / Lady Blantyre's Rock St. Ives Bingley",
      "caption": "'Lady Blantyres Rock' a favourite spot on the edge of the moor of lady Blantyre, who was the Mother-in-Law of William Busfeild Ferrand, who acquired the St.Ives estate near Bingley in 1639"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Coach_House_St.Ives_estate_Bingley_-_geograph.org.uk_-_40330.jpg",
      "title": "Mick Melvin / Coach House St.Ives estate Bingley",
      "caption": "Coach House St.Ives estate Bingley. The former coach house on the St. Ives was built on land acquired by the Ferrands family in 1639, it is now a part of the Sports Turf Research Institute."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Altar_Lane%2C_St._Ives_Estate_-_geograph.org.uk_-_375231.jpg",
      "title": "Paul Glazzard / Altar Lane, St. Ives Estate",
      "caption": "Altar Lane, St. Ives Estate. Gateway to Cross Gates Lane and the St. Ives Estate between Race Course Plantation and Hollin Plantation on Altar Lane. Altar Lane takes its name from a nearby rock formation know as Druid's Altar."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/Betty%27s_Lodge%2C_St._Ives_Estate_-_geograph.org.uk_-_375200.jpg",
      "title": "Paul Glazzard / Betty's Lodge, St. Ives Estate",
      "caption": "Betty's Lodge, St. Ives Estate. Early to mid 19th century lodge to St. Ives Mansion House, on the corner of Blind Lane and St. Ives Road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Wooden_snake_in_St_Ives_Woods_-_geograph.org.uk_-_729787.jpg",
      "title": "Allan Friswell / Wooden snake in St Ives Woods",
      "caption": "Wooden snake carvings in St Ives Woods. There are around 8 such carvings to look out for on the site"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/The_western_entrance_to_St_Ives_Estate%2C_Keighley_Road%2C_Harden_-_geograph.org.uk_-_952764.jpg",
      "title": "Humphrey Bolton / The western entrance to St Ives Estate, Keighley Road, Harden",
      "caption": "The western entrance to St Ives Estate, Keighley Road, Harden. The estate was owned by Rievaulx Abbey from the 12C to the Dissolution, and was later acquired by The Ferrand Family, when it was called Harden Grange. In the 20C it was purchased by Bingley Urban District Council and became a country park and golf course, with an equestrian centre in the stable block and various businesses and a centre for the young disabled. The lodge was built in the Gothic style in 1851"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Baxter%27s_Pond_-_geograph.org.uk_-_376177.jpg/256px-Baxter%27s_Pond_-_geograph.org.uk_-_376177.jpg",
      "title": "Paul Glazzard / Baxter's Pond",
      "caption": "Baxter's Pond. Small pond above Cuckoo Nest Cottages, on a stream running down from the much larger Coppice Pond on the St. Ives Estate. The pond was dedicated to John Baxter in 2004 in recognition of his work re-establishing the pond and to celebrate forty years of service to the St. Ives Estate and Bradford Council."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Druids%27_Altar_-_geograph.org.uk_-_1530433.jpg",
      "title": "John Darch / Druids' Altar",
      "caption": "Druids' Altar stone. There's a lovely view across the countryside from the elevated position of this ancient stone"
    }
  ],
  "distance_km": 3.5,
  "description": "Explore 500 acres of woodland, parkland and gardens in this splendid country park near Bradford. You can start your walk from the car park off Harden Road just west of Bingley town centre and train station. Then pick up the trails heading west through Cuckoo Nest Wood before climbing to Lady Blantyre's Rock and descending to Coppice Pond. The pond has a bird hide where you can look out for the variety of birdlife. Other wildlife in the park includes kestrels and lots of butterflies in the summer months. Also be sure to visit the lovely Herb Garden with a range of flowers including Pinks, Sweet Williams, Honeysuckles, Foxgloves, Lavenders, Fuschias and a beautiful Wisteria which will climb beautifully over the 350 year old garden walls. The park also has good facilities with a visitor centre, play area and cafe. Bingley is a great place for walkers with a number of good options for extending your walk. You can pick up the Leeds and Liverpool Canal towpath and visit the splendid Bingley 5 rise locks. Head east along the water and you will soon come to the fascinating Victorian village of Saltaire. The River Aire also runs through the town so you can enjoy riverside walks too. If you cross the waterways then you could visit the delightful Shipley Glen with its woodland trails along a pretty beck.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "At Harden you will pass close to the noteworthy Malt. The main draw here is a tremendous large garden area which seats 130 people. It's a great spot to relax in on a fine summer afternoon. The building also has an interesting history, dating back to 1550. It has taken on many faces, including a court room and a prison, of which the famous cell room still exists. A new Orangery has also been added, seating 33 people. Inside there's a cosy interior with three open fires for cold winter days. They do great food, have a large car park and are also dog friendly with water bowls dotted around the pub. You can find it on the Wilsden Road with a postcode of BD16 1BG for your sat navs. Near the pub you can also take a slight detour from the route to visit the delightful Goit Stock Waterfall. It's reachable on a footpath along Harden Beck from Harden Village."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The estate is great for a dog walk with nice woodland trails to try. The Malt pub mentioned above also welcomes pets."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you can visit the lovely Goit Stock Waterfall in Cullingworth. There's some peaceful woodland trails surrounding the rushing falls here. Also in Cullingworth you can pick up the Great Northern Railway Trail which runs from Queensbury to Cullingworth along a disused railway line. On the way it visits Thornton Viaduct and Hewenden Reservoir and Viaduct where there are fine views from the top of the historic structures. Just a few miles east of the estate you'll find Baildon Moor. It's another popular local place for walkers with moorland footpaths and fine views of Leeds and Bradford from Baildon Hill. For more walking ideas in the area see the Yorkshire Dales Walks and the Nidderdale Walks pages."
    }
  ],
  "region": "West Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "St. Ives, Bingley, Harden, Bradford, West Yorkshire, England, BD16 1AS, United Kingdom",
  "postcode": "BD16 1AS",
  "district": "Bradford",
  "county": null,
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "garden"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "bird watching"
  ],
  "facilities": [
    "visitor center",
    "play area",
    "cafe"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}