{
  "created_at": "2025-01-06T04:11:15.197312+00:00",
  "objectID": "e4888a75d90cd63bc6fc871d701234a0",
  "ref": "chiltern-way-walking-route",
  "title": "Chiltern Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/89/Chiltern_Way_-_geograph.org.uk_-_1129209.jpg",
  "nearby": [
    {
      "description": "Chorleywood",
      "objectID": "ee78e0ce2413049dbf5bfd9b9d675f41",
      "ref": "chorleywood-walking-route"
    },
    {
      "description": "Dunstable Downs Country Park",
      "objectID": "3f99f6926fb96ba7211fd4588aaaf877",
      "ref": "dunstable-downs-country-park-walking-route"
    },
    {
      "description": "Marlow",
      "objectID": "c7ee763ae44c4d8a2c7ae45b247451bf",
      "ref": "marlow-walking-route"
    },
    {
      "description": "Sonning Common",
      "objectID": "46765fc9c842bcd364d8b9fba2f3d10d",
      "ref": "sonning-common-walking-route"
    },
    {
      "description": "Turville",
      "objectID": "253fdfe3b7750094eec6aca59b6682a2",
      "ref": "turville-walking-route"
    },
    {
      "description": "Sharpenhoe Clappers",
      "objectID": "2418109b2b738e3dde40db414a9c980c",
      "ref": "sharpenhoe-clappers-walking-route"
    },
    {
      "description": "Harpenden",
      "objectID": "c550eb5ca4c4095572fce0e82d009e79",
      "ref": "harpenden-walking-route"
    },
    {
      "description": "Fingest",
      "objectID": "e79dcaf67f3b60e992167f245e82f004",
      "ref": "fingest-walking-route"
    },
    {
      "description": "Binfield Heath and Crowsley Park",
      "objectID": "fdc180b3468b66ddd136cb69199b0b59",
      "ref": "binfield-heath-and-crowsley-park-walking-route"
    },
    {
      "description": "Hurley Loop Walk",
      "objectID": "3eaa6c9322a73bc518adc239ed9aeeb0",
      "ref": "hurley-walking-route"
    },
    {
      "description": "Stokenchurch",
      "objectID": "50754f5ef59f92788cfa0b44a17cf481",
      "ref": "stokenchurch-walking-route"
    },
    {
      "description": "Chilterns Cycleway",
      "objectID": "83bebb5387a7ac781fea275fce595752",
      "ref": "chilterns-cycleway-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e4888a75d90cd63bc6fc871d701234a0.gpx",
  "_geoloc": {
    "lat": 51.7413515168,
    "lng": -0.4917444598
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Chiltern_Way_-_geograph.org.uk_-_1129209.jpg",
      "title": "David Hawgood / Chiltern Way",
      "caption": "View from road near Homefield Wood near Hurley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Chiltern_Way_-_geograph.org.uk_-_1566973.jpg",
      "title": "Shaun Ferguson / Chiltern Way",
      "caption": "Heading to houses by Hudnall Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Chiltern_Way_-_geograph.org.uk_-_1270029.jpg",
      "title": "Shaun Ferguson / Chiltern Way",
      "caption": "Heading up the valley towards Park Corner"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Chiltern_Way_-_geograph.org.uk_-_1271073.jpg",
      "title": "Shaun Ferguson / Chiltern Way",
      "caption": "The trail heads down through the parkland of Swyncombe House with The Rectory behind the trees"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg/512px-Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg",
      "title": "Michael Trolove / Fingest Village",
      "caption": "View of Fingest Village. Turville Hill and Windmill is above and beyond the village. This view can be seen at the beginning of the Agatha Christie's Marple (TV series) episode \"Endless Night\" (2013). The church in view is the noteowrthy St Bartholomew's. The nave and tower are 12th century with the saddleback roof added to the tower in the 18th or early 19th century. The roof is notable as being one of only two such designs in England. The chancel was added in the 13th century."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Turville_-_geograph.org.uk_-_9553.jpg",
      "title": "Brendan and Ruth McCartney / Turville",
      "caption": "A view of the village of Turville. The windmill on the hill overlooking Turville in the east of the square. The name 'Turville' is Anglo-Saxon in origin and means 'dry field'. The pretty village has been used as a filming location for many tv dramas including Midsomer Murders, Lewis, Marple, Foyle's War and the 2008 Christmas special of Jonathan Creek. It was also used in the Dawn French sitcom The Vicar of Dibley. In the series, the church of St Mary the Virgin was renamed \"St Barnabus\". The village church is well worth some investigation as it dates back to the 12th century with the nave being the oldest surviving part."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Crowsley_Park_-_geograph.org.uk_-_1059495.jpg",
      "title": "Andrew Smith / Crowsley Park",
      "caption": "Crowsley Park near Henley. The park consists of slightly rough pasture and plenty of gnarled trees. It is currently grazed by a relatively small herd of cattle. This shows one of the footpaths through the park. The country estate is owned by the BBC and though it is not open to the public the trail skirts the eastern edge with views towards the privately owned 18th century mansion. Among Crowsley Park's former owners were the Baskerville family who provided the inspiration for Conan Doyle's The Hound of the Baskervilles. Since the Second World War, Crowsley Park has been the site of a signals-receiving station used by BBC Monitoring. In 2018, the BBC began a further modernisation of the facility, including the installation of 18 new satellite dishes."
    }
  ],
  "distance_km": 200.0,
  "description": "This is the original 125 mile circuit of the Chilterns AONB taking you through Hemel Hempstead, Chalfont St Giles, Marlow, Hambleden, Turville, Fingest, Bix Bottom, Ewelme, the Ridgeway, Stokenchurch, Great Hampden, Aldbury, the Dunstable Downs Country Park, Sharpenhoe Clappers and Harpenden. The main attractions on the route are the series of delightful villages with their ancient churches, pretty village greens and fascinating museums. The Chilterns countryside is also beautiful with rivers, canals and the rolling hills to enjoy. The walk is waymarked with yellow and white disc.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Riverside Restaurant in Marlow is a lovely location for some refreshments. There's a fine outdoor terrace which is ideal for warmer days. You can find it right next to Marlow Bridge at a postcode of SL7 1RG for your sat navs. The Two Brewers is also located near the river in Marlow. The 18th century pub does great food and also has a nice beer garden. You can find it on St. Peter Street at postcode SL7 1NQ. Near Henley the village of Fingest is well worth exploring. Opposite the 12th century church you'll find the The Chequers. It's set in an attractive 18th century brick and flint building with a splendid 2 acre garden outside. The pub is also notable for featuring in the 2014 George Clooney film 'Monuments Men' set during World War II. At the time the village was transformed into a Normandy-like appearance. You may also recognise the pub and village from episodes of the popualar Midsomer Murders series on ITV. You can easily find them in the heart of the village at a postcode of RG96QD for your sat navs. In neighbouring Turville there's also the Bull and Butcher. They are known for their excellent homemade pies and a splendid large garden area for the summer months. You can find them in Turville at a postcode of RG9 6QU for your sat navs. Here you can also enjoy views of the Chitty Chitty Bang Bang Windmill which was used in the 1967 film."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Higginson Park in Marlow is a nice place to visit in the town. The popular park attracts 1,000,000 visitors a year and includes riverside views and access to open countryside. There are also many fine trees and large expanses of lawn with formal flowerbeds and a brick in grass maze. It's another good option for refreshments with a nice cafe. You can find the park on the western fringes of the town, next to the river. The Chilterns Cycleway runs close to the route. The signed circular trail runs for about 170 miles through the AONB on country lanes."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZpeT7tFhHN8",
  "postcode": "HP3 0AX",
  "district": "Hemel Hempstead",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}