{
  "created_at": "2025-01-06T18:50:25.685001+00:00",
  "objectID": "e4b2a1349caf478f1c37653c7cc10744",
  "ref": "mallow-castle-walking-route",
  "title": "Mallow Castle Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/53/Mallow_Castle_-_geograph.org.uk_-_264499.jpg",
  "nearby": [
    {
      "description": "Blarney Castle",
      "objectID": "f54bf95ceeebc6f3ccf1215760eb9760",
      "ref": "blarney-castle-walking-route"
    },
    {
      "description": "Cork Marina Walk",
      "objectID": "ebdb8495297be1f45c661e15a5b0412d",
      "ref": "cork-marina-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e4b2a1349caf478f1c37653c7cc10744.gpx",
  "_geoloc": {
    "lat": 52.13572,
    "lng": -8.63859
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/53/Mallow_Castle_-_geograph.org.uk_-_264499.jpg",
      "title": "Nigel Cox / Mallow Castle",
      "caption": "This is the \"old\" castle built in 1585, but ruined during the Cromwellian invasion in the 1650s. The \"new\" castle is to the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Mallow_Castle_with_Fountain%2C_Mallow%2C_North_Cork..JPG/512px-Mallow_Castle_with_Fountain%2C_Mallow%2C_North_Cork..JPG",
      "title": "The Speckled Bird, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Mallow Castle with Fountain. Mallow Castle, now in the possession of Cork County Council, dates back to 1185 when John, King of England, ordered the construction of the first castle in Mallow."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/White_Deer%2C_Mallow_Castle%2C_North_Cork..JPG/512px-White_Deer%2C_Mallow_Castle%2C_North_Cork..JPG",
      "title": "The Speckled Bird, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "White Deer, Mallow Castle, North Cork."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Interior_Mallow_Castle%2C_Co._Cork.jpg/512px-Interior_Mallow_Castle%2C_Co._Cork.jpg",
      "title": "The Speckled Bird, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Interior Mallow Castle, Co. Cork"
    }
  ],
  "distance_km": 1.8,
  "description": "Mallow Castle is a National monument of Ireland located in Mallow, County Cork. The expansive site includes several historic buildings including a 16th-century fortified house, a 19th-century mansion, and the ruins of a 13th-century castle. The buildings are additionally surrounded by attractive gardens and parkland ideal for an afternoon stroll. There are also nice riverside walks along the River Blackwater which runs along the southern side of the site. On the eastern side there's a deer park with Mallow's famous White Deer. The original herd dates back to the late 16th century, when Elizabeth I gifted these distinctive deer to the Norreys family of Mallow castle.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Spanning 33 acres, the site comprises gardens and parkland hosting three structures: the remnants of a 16th-century fortified house, a 19th-century mansion to the north, and the ruins of a 13th-century castle to the east. The fortified house is an elongated three-storey structure with two polygonal towers at the north-west and south-west corners. Its early Jacobean design includes high gables, stepped battlements, and mullioned windows. The house's wings extend from the middle of its southern and northern walls, with the entrance located in the northern wing. The entire layout was intended to allow a complete field of fire around the house. The 19th-century baronial mansion, situated close to the older Mallow Castle ruins, includes parts dating back to the 1690s. Following refurbishment, the mansion boasts 8 reception rooms, encompassing a music room, billiard room, and library, along with 12 bedrooms. The first castle in Mallow was established under King John's orders in 1185. By 1282, it was owned by the Earls of Desmond. After the Geraldine Wars, Queen Elizabeth I confiscated the estate and granted it to Sir Thomas Norrey, along with the Lordship of Mallow and 6,000 acres of the surrounding area. The original Desmond Castle had deteriorated so severely by 1585 that a new castle was erected on the same site. Dating back to the 16th century, the fortified house is thought to have been constructed by Sir Thomas Norreys, the Lord President of Munster, who passed away in 1599. His daughter Elizabeth and her husband Sir John Jephson then inherited the property, and their family resided in Mallow for nearly four centuries. The house withstood a siege by Richard Butler, 3rd Viscount Mountgarret, in 1642 during the Irish Confederate Wars. However, it was overtaken in 1645 by James Tuchet, 3rd Earl of Castlehaven. The property was severely damaged by fire in the Williamite War and was subsequently vacated by the Jephsons, who constructed a new mansion on the site of the old castle's stables. Declared a National Monument in 1928, the house was sold by Commander Maurice Jephson to Michael and Judith McGinn of Washington, D.C., in 1984. Since 2011, both the castle and the grounds have been under the ownership of Cork County Council. To the south there's more local historical interest at the 13th century Blarney Castle. The ancient castle is surrounded by some beautiful grounds and gardens with miles of footpaths to enjoy. Near here there's the circular Cork Marina Walk where you can enjoy fine views over the River Lee and a visit to the 16th century Blackrock Castle."
    }
  ],
  "video_url": "https://www.youtube.com/embed/_iVqUOKPYNE?si=Aqru2P1QlPJuZNWV",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Mallow Castle House, Castlepark Avenue, Mallow, The Municipal District of Kanturk-Mallow, County Cork, Munster, P51 TN53, Éire / Ireland",
  "postcode": "P51 TN53",
  "district": "Mallow",
  "county": "County Cork",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "garden",
    "parkland",
    "river"
  ],
  "points_of_interest": [
    "historic buildings",
    "deer park"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "loop",
  "activities": [
    "walking",
    "sightseeing"
  ]
}