{
  "created_at": "2025-01-06T03:34:59.694013+00:00",
  "objectID": "e50734412939b649c53022ea2bd9ba12",
  "ref": "cheshunt-walking-route",
  "title": "Cheshunt Walks - Near and Around",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Lee_Valley_Country_Park_-_geograph.org.uk_-_1324663.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e50734412939b649c53022ea2bd9ba12.gpx",
  "_geoloc": {
    "lat": 51.7029317848,
    "lng": -0.023799602
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Lee_Valley_Country_Park_-_geograph.org.uk_-_1324663.jpg",
      "title": "Claire Stretch / Lee Valley Country Park",
      "caption": "Lee Valley Country Park. Raised walk way over marsh land in Lee Valley Country Park, by Cheshunt Lock on the River Lea."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/31/Old_bridge_over_Small_River_Lea_-_geograph.org.uk_-_768740.jpg",
      "title": "Talisman / Old bridge over Small River Lea",
      "caption": "Old bridge over Small River. Lea About 1km from Cheshunt Station the path alongside the railway tracks crosses over the Small River Lea via an old brick bridge opposite Turnford School playing field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Bridge_over_Small_River_Lea_-_geograph.org.uk_-_760597.jpg",
      "title": "Talisman / Bridge over Small River Lea",
      "caption": "Bridge over Small River Lea. The bridge crosses the Small River Lea, which at this point isn't much bigger than a brook. Turnford Brook joins the Small River Lea just downstream to the right of the picture. Just over the bridge the path goes right towards Cheshunt Station and left to the Lea Navigation at Aqueduct Lock or Fishers Green."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Depth_board_on_the_Small_River_Lea%2C_Cheshunt_-_geograph.org.uk_-_1328483.jpg",
      "title": "Stephen Craven / Depth board on the Small River Lea, Cheshunt",
      "caption": "Depth board on the Small River Lea. The depth board, adjacent to Windmill Lane, is marked in Metres AOD (21.0m at the top of the board) rather than showing the depth of flow directly. But as it covers a range of nearly 3 metres, it suggests that significant floods are expected to occur."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Waltham_Town_Lock_-_geograph.org.uk_-_526419.jpg",
      "title": "Mike Baldwin / Waltham Town Lock",
      "caption": "Waltham Town Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Olympic_aquatics_centre%2C_Lee_Valley_-_geograph.org.uk_-_2430541.jpg/512px-Olympic_aquatics_centre%2C_Lee_Valley_-_geograph.org.uk_-_2430541.jpg",
      "title": "Stephen Craven / Olympic aquatics centre, Lee Valley",
      "caption": "Olympic aquatics centre, Lee Valley. This building is the \"main stand\" referred to in the construction-strange photo TL3700 : Olympic White Water Canoe Centre. The aquatics centre (including white-water facilities) was built on Cheshunt Marsh, intended mainly for the London 2012 Olympics but by this time (May 2011) was already open to the public."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Lock_and_Lock_Keeper%27s_Cottage_-_geograph.org.uk_-_766085.jpg",
      "title": "Lindsey Coates / Lock and Lock Keeper's Cottage",
      "caption": "Lock and Lock Keeper's Cottage"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/The_New_River_near_Cheshunt_-_geograph.org.uk_-_542180.jpg",
      "title": "Nigel Cox / The New River near Cheshunt",
      "caption": "The New River near Cheshunt. The New River is something of a misnomer since it is neither a river nor new. It is an aqueduct built under the direction of Sir Hugh Myddleton between 1607 and 1612 to bring fresh drinking water from Chadwell and Amwell Springs near Ware about 40 miles down the Lee Valley to London. In the middle distance is a footbridge carrying a public footpath over the aqueduct, while Bury Green is visible on the horizon."
    }
  ],
  "distance_km": 10.0,
  "description": "This Hertfordshire based town is a great place to start a walk with miles of varied trails to try. There's riverside and canalside trails, several local lakes, and miles of woodland to explore in the nearby Epping Forest. This circular walk explores the Lee Navigation canal and the River Lee Country Park on the eastern side of the town. The walk starts from the train station where you can directly pick up a shared cycling and walking trail to take you north along the River Lee and a series of pretty lakes. You'll pass the Turnbrook Brook and Turnbrook Marsh before coming to Nazeing Marsh. Here you pick up the Lea Valley Walk and follow the canal path south towards Holyfield. The route then heads through the River Lee Country Park, passing along the Horsemill Stream and Waltham Marsh towards Holdbrook. You then turn north following the waymarked footpath past Cheshunt Marsh, Bowyer's Water and Cheshunt Lake before returning to the train station.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Red Cow is a good choice for some post walk refreshment. The historic pub dates back 200 years and has a nice interior with an Olde worlde feel. Here you'll find wood beams & original features, plus a large bright conservatory area. Outside there's a lovely decked garden area for warmer weather. Quality of the food is also high with an excellent Sunday roast particularly popular. You can find them near the train station and river at 198 Windmill Lane with a postcode of EN8 9AF for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The waterside trails make for a fine dog walk and the Red Cow mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the south western side of the town you can visit the lovely gardens at the historic Forty Hall and the adjacent Whitewebbs Park. For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/XXGJwjA8kmE",
  "postcode": "EN8 9AQ",
  "district": "Cheshunt",
  "county": "Hertfordshire",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}