{
  "created_at": "2025-01-06T00:40:04.118384+00:00",
  "objectID": "e50fab578e5425ee992debe450ead99a",
  "ref": "saxon-shore-way-walking-route",
  "title": "Saxon Shore Way Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Orchard_on_Saxon_Shore_Way_-_geograph.org.uk_-_682727.jpg",
  "nearby": [
    {
      "description": "Gravesend",
      "objectID": "bc70c1dda6240ee99f8db14aa45d0286",
      "ref": "gravesend-walking-route"
    },
    {
      "description": "Faversham",
      "objectID": "0087366f4d8601c91e8d7e29ae39658a",
      "ref": "faversham-walking-route"
    },
    {
      "description": "Dover Cliffs Walk",
      "objectID": "a0460cecc8bf600edc52a881f0da5169",
      "ref": "dover-white-cliffs-walk-walking-route"
    },
    {
      "description": "Rye Circular Walk",
      "objectID": "f5cb15fe1cfbf6938c8ab1664608c023",
      "ref": "rye-circular-walk-walking-route"
    },
    {
      "description": "Hastings Circular Walk",
      "objectID": "5d3cab92a0ba18e8c3d6cc8c44c39708",
      "ref": "hastings-circular-walk-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e50fab578e5425ee992debe450ead99a.gpx",
  "_geoloc": {
    "lat": 51.4455645712,
    "lng": 0.36972508
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Orchard_on_Saxon_Shore_Way_-_geograph.org.uk_-_682727.jpg",
      "title": "Richard Dorrell / Orchard on Saxon Shore Way, via Wikimedia Commons",
      "caption": "Orchard on Saxon Shore Way. The public footpath actually goes diagonally through this orchard, but I opted for an easier route round the edge. The pair of cottages are in Horsham Lane. I believe the trees to be pear."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Saxon_Shore_Way_-_geograph.org.uk_-_48174.jpg",
      "title": "Glyn Baker / Saxon Shore Way, via Wikimedia Commons",
      "caption": "This is the junction of the Saxon Shore Way and a footpath to Beckley Hill then on to Church Street. The Higham Saltings are on the south bank and the Coryton Oil Refinery storage tanks can be seen on the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Warning_sign_on_the_Saxon_Shore_Way_-_geograph.org.uk_-_454775.jpg",
      "title": "Nick Smith / Warning sign on the Saxon Shore Way, via Wikimedia Commons",
      "caption": "Warning sign on the path. Sign to warn of underwater pipes on the River Stour which is just to the right in the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Bridge_on_the_Saxon_Shore_Way_-_geograph.org.uk_-_1457220.jpg",
      "title": "Nigel Chadwick [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Bridge on the path at Swalecliffe"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Ponds_beside_the_Saxon_Shore_Way_-_geograph.org.uk_-_675106.jpg",
      "title": "Richard Dorrell / Ponds beside the Saxon Shore Way, via Wikimedia Commons",
      "caption": "Ponds beside the path near Iwade"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Route_of_Saxon_Shore_Way_ahead_-_geograph.org.uk_-_457178.jpg",
      "title": "Nick Smith / Route of Saxon Shore Way ahead, via Wikimedia Commons",
      "caption": "Along the River Stour near Minster"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/Above_the_White_Cliffs_-_geograph.org.uk_-_1409453.jpg",
      "title": "Philip Halling / Above the White Cliffs",
      "caption": "Above the White Cliffs. The trail follows at coastal path above the White Cliffs, here it is approaching St Margaret's at Cliffe."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Oare_Creek_-_geograph.org.uk_-_421108.jpg",
      "title": "Colin Smith / Oare Creek",
      "caption": "Oare Creek Yachts are left high and dry in the boatyards on the eastern bank of the creek at low tide. On the west bank, the sea wall path is part of the Saxon Shore Way."
    }
  ],
  "distance_km": 257.0,
  "description": "Explore Kent's ancient coastline as you visit Iron Age hill forts, cathedrals, Martello towers, historic ports and castles on this incredible 160 mile walk. The route passes through two Areas of Outstanding Natural Beauty, numerous Sites of Special Scientific Interest and several Nature Reserves. The walk begins on the Thames at Gravesend and heads through Faversham, Deal, Dover and Rye to the finish point at Hastings .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's some good choices for refreshments in the lovely Rye Harbour area. The William the Conqueror pub is located right on the harbour and worthy of investigation. Recently refurbished, it’s a smart, friendly, traditional pub, boasting real ales, hearty pub food and a friendly welcome. There’s a large outdoor area here, with plenty of alfresco seating on the banks of the River Rother. It's a great spot to enjoy lunch while looking out for some of the local wildlife that make this a Site of Special Scientific Interest. You can find the pub near the car park on the eastern side of the reserve at postcode TN31 7TU. The delightful Avocet Tea Room is located in the same area as well. The tea room also includes a lovely art gallery showcasing the talent of local artists. The gallery is run by award-winning photographer Peter Greenhalf and former journalist Morgan (who makes all the cakes). The gallery reflects the artists’ love of the natural world and is well worth seeing if you have time after your walk. The Three Daws in Gravesend is one of the must see pubs on the route. The historic riverside inn dates back to the 1400s, making it one of the oldest in the country. As such it's steeped with tales of smugglers, Press Gangs, hauntings and the like. It would have been a popular haunt for seamen as at one time large sailing merchant ships used to anchor off the Three Daws. Today you can enjoy lovely British food in the garden area overlooking the River Thames. It's a splendid spot to relax in on warmer days. You can find them at the start of the walk at the Town Pier with a postcode of DA11 0BJ for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the northern edge of Rye harbour there's the Rye Castle Museum or Ypres Tower. The museum has lots of interesting artifacts and exhibits to see including locally-made medieval pottery, an embroidery depicting many aspects of Rye life and history, medieval artifacts, activities and town maps. You can also climb to the top of the tower and enjoy fantastic views over the harbour and the river. It's a nice place to visit after your walk if you have time.  Above: Ypres Tower or Rye Castle. A worthy addition to your outing. Just east of Rochester there's Upnor where you can explore English Heritage's Upnor Castle which dates from the 16th century."
    }
  ],
  "video_url": "https://www.youtube.com/embed/3ONN9iCccoQ",
  "county": "Kent",
  "region": "South East",
  "country": "England",
  "gazetteer_found": true
}