{
  "created_at": "2025-01-06T04:23:50.992357+00:00",
  "objectID": "e52753381b6aae47ee83a5918b69e50b",
  "ref": "caistor-st-edmund-walking-route",
  "title": "Caistor St Edmund Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Venta_Icenorum_-_Market_Place_of_the_Iceni_-_geograph.org.uk_-_1352876.jpg",
  "nearby": [
    {
      "description": "Boudicca Way",
      "objectID": "d911f9c64e271ca6d115ed9bcbc34f68",
      "ref": "boudicca-way-walking-route"
    },
    {
      "description": "Hethersett",
      "objectID": "cfeba38b0b9d7c8e4fb65d9ef2ab2bb2",
      "ref": "hethersett-and-swardeston-country-walk-walking-route"
    },
    {
      "description": "Tas Valley Way",
      "objectID": "37399b478ba102d4212750e3dd379c03",
      "ref": "tas-valley-way-walking-route"
    },
    {
      "description": "Loddon",
      "objectID": "72a7c7484c779a8fa355702c3ff85dbf",
      "ref": "loddon-walking-route"
    },
    {
      "description": "Brundall",
      "objectID": "c6bad2a03005020a7933ec14f12dafec",
      "ref": "brundall-walking-route"
    },
    {
      "description": "Reedham",
      "objectID": "5a36129b8eab18365f972d5d5f3ba8ff",
      "ref": "reedham-walking-route"
    },
    {
      "description": "Shotesham",
      "objectID": "eb236b5b6bd450ef8dc43fdda97dc724",
      "ref": "shotesham-walking-route"
    },
    {
      "description": "Strumpshaw Fen",
      "objectID": "35421d1e018fded6911eae2b62d5d8bc",
      "ref": "strumpshaw-fen-walking-route"
    },
    {
      "description": "Burlingham Woods",
      "objectID": "684beff1a2e69fe8758c8f9f7cfdcf8f",
      "ref": "burlingham-woods-walking-route"
    },
    {
      "description": "Mulbarton",
      "objectID": "5278ebc4e6d00a2e45602f167a54687e",
      "ref": "mulbarton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e52753381b6aae47ee83a5918b69e50b.gpx",
  "_geoloc": {
    "lat": 52.5820659953,
    "lng": 1.2944863961
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Venta_Icenorum_-_Market_Place_of_the_Iceni_-_geograph.org.uk_-_1352876.jpg",
      "title": "Evelyn Simak / Venta Icenorum - Market Place of the Iceni",
      "caption": "Market Place of the Iceni. View across the site of the Roman town which is now a sheep pasture, sloping gently downwards towards the Tas Valley in the west. The outline of the streets, which are arranged in a rectangular pattern, can be seen in dry weather as brown lines in the grass, where sheep now graze a large pasture which once used to be the town centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Venta_Icenorum_-_ditch_along_east_wall_-_geograph.org.uk_-_1352692.jpg",
      "title": "Evelyn Simak / Venta Icenorum - ditch along east wall",
      "caption": "Venta Icenorum - view of the ditch along east wall. Before the arrival of the Romans in the area, Norfolk and Suffolk were the home of the Iceni, who in AD 61 rebelled against Roman rule, led by their Queen Boudica. The revolt was suppressed and the town of Venta Icenorum was subsequently established in order to bring stability to the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Venta_Icenorum_-_wild_flowers_growing_on_south_wall_-_geograph.org.uk_-_1352926.jpg",
      "title": "Evelyn Simak / Venta Icenorum - wild flowers growing on south wall",
      "caption": "Wild flowers growing on south wall. A variety of wild flowers are growing on the sunny south wall which is covered by soil. The London to Norwich railway line can be seen in the distance. There are two signposted walks, one leading around the Roman defences, the other following the course of the River Tas. Just to the east of the site there is a Early Saxon cemetery, and on raised ground to the north both an Iron Age burial site and Saxon cemetery have been excavated. The Arminghall Henge is located to the north-east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Venta_Icenorum_-_from_Roman_town_to_sheep_pasture_-_geograph.org.uk_-_1352898.jpg",
      "title": "Evelyn Simak / Venta Icenorum - from Roman town to sheep pasture",
      "caption": "Sheep resting in the shade of a tree on this warm day in mid-June. A massive flint and stone wall of up to 7 metres high and 4 metres thick, and an outer ditch were constructed in the late AD 200s to defend the town which by then had decreased in size to about 14 hectares. The ditch was 24 metres wide and about 5 metres deep. The site is owned and managed by the Norfolk Archaeological Trust and can best be seen from elevated positions of the A140 (Ispwich Road) or from the main London to Norwich railway line"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Archaeologists_at_Venta_Icenorum_-_geograph.org.uk_-_2028565.jpg",
      "title": "Evelyn Simak / Archaeologists at Venta Icenorum",
      "caption": "Archaeologists at the site 2010. The archaeologists' tents can be seen in the background (at right). For the first time in 75 years archaeological excavations will be carried out within the walls of the Roman settlement of Venta Icenorum (Caistor St Edmund), one of only three Roman towns in the country that have not been built over by modern settlements. Venta Icenorum is thought to have been established in the aftermath of Boudicca's failed rebellion of AD60-61. The site has been subject to digs before but these took place outside its walls."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Venta_Icenorum_-_one_of_the_digs_-_geograph.org.uk_-_2028548.jpg",
      "title": "Evelyn Simak / Venta Icenorum - one of the digs",
      "caption": "View of one of the digs at the site in 2010. One of the cemeteries (including a skeleton) was found last year outside of the town, and by digging within its walls archaeologists are now hoping to find out whether an Iron Age settlement may perhaps be lying underneath it. Caistor is a protected site and any research has to be planned in depth before permission to excavate is being granted. Visitors are welcome and archaeologists have marked out the streets of the Roman town to give people the chance to get a feel of the original layout. The progress of the archaeological dig will be featured on television in a Time Team documentary."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2a/View_across_the_Arminghall_Henge_-_geograph.org.uk_-_1391552.jpg",
      "title": "Evelyn Simak / View across the Arminghall Henge",
      "caption": "Arminghall Henge 1. Its outline is still visible in low light. In 1929 a prehistoric timber circle and henge monument site was discovered 1½ miles (2½ km) northwest of Arminghall village by Gilbert Insall VC who had been taking aerial photographs of the area in search of new archaeological sites. Whilst flying at around 2,000 feet (600 m) he noticed cropmarks of a circular enclosure made of two concentric rings with a horseshoe of eight pit-like markings within it."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Arminghall_Henge_-_geograph.org.uk_-_163763.jpg",
      "title": "Graham Hardy / Arminghall Henge",
      "caption": "Arminghall Henge 2. When discovered the entire site was around 75 m in diameter. The site was visited a week later by O.G.S. Crawford, who pronounced it to be the Norwich Woodhenge but it was not until 1935 that it was first excavated, by Grahame Clark. His work established that two circular rings were ditches, the outer one 1.5 m deep and the inner one 2.3 m deep, with indications of a bank that once stood between them. The pits in the middle were postholes for timbers that would have been almost 1 m in diameter. The site dates to the Neolithic, with a radiocarbon date of 3650-2650 Cal BC (4440±150) from charcoal from a post-pit. The henge is orientated on the mid-winter sunset, which, when viewed from the lication, sets down the slope of nearby high ground, Chapel Hill."
    }
  ],
  "distance_km": 14.0,
  "description": "This historical circular walk explores the Roman town of Caistor St Edmund in Norfolk. It then follows a waymarked trail up to Arminghall Henge located just to the north. The walk starts from the parking area at the Roman Town. From here you can pick up footpaths heading west around the interesting site which includes earthworks, ruined walls and ditches. These fascinating ruins are in the care of the Norfolk Archaeological Trust and managed by South Norfolk Council. It's also a very scenic area with lots of wildflowers growing in the summer and views of the River Tas which runs along the western side of the town. The site is well laid out with two waymarked walking trails to follow through the area. There's also a number of information boards dotted around giving further details of the history of the site. After exploring the town you can pick up the Boudicca Way and follow the waymarked trail to nearby Arminghall village. From here you head north west past Arminghall Wood to Arminghall Henge. The site dates to the Neolithic period and is one of the most important prehistoric discoveries in Norfolk. After exploring the henge you retrace your steps to Arminghall before following other public footpaths and country lanes back to Caistor St Edmund.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The very fine Caistor Hall is located just to the north of the site. There's the Palm Court Bar and Restaurant located within the main house of the building here. They have a good range of refreshments which you can enjoy in the lovely outdoor area if the weather is fine. The hall also has an interesting history having been built between 1795 and 1797 in the time of King George III by the Dashwood family. You can find the hall at postcode NR14 8QN for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into nearby Norwich and you can enjoy nice waterside trails along the River Wensum on the Norwich Riverside Walk. Near here you'll also find Whitlingham Country Park where there's good paths along the park's lakes and the River Yare. Continue east along the river for a few miles and there's the delightful village of Surlingham and the RSPB Church Marsh Nature Reserve. Follow the Boudicca Way south and it will take you to the neighbouring village of Shotesham with its pretty mill and ford. For more walking ideas in the area see the Norfolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/U0dYKVu8bv4",
  "postcode": "NR14 8QN",
  "county": "Norfolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Stoke Road, Caistor St Edmund and Bixley, Caistor St Edmund, South Norfolk, Norfolk, England, NR14 8QN, United Kingdom",
  "district": "South Norfolk",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "earthworks",
    "woodland"
  ],
  "points_of_interest": [
    "historical site",
    "archaeological remains",
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "information boards",
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}