{
    "objectID": "e56c776d51b4c62318eb5a4367e48ab3",
    "created_at": "2024-12-21T13:16:43.679290+00:00",
    "ref": "sussex-ouse-valley-way-walking-route",
    "title": "Sussex Ouse Valley Way Walking Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/93/The_%22Anchor%22_on_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1072089.jpg",
    "nearby": [
        {
            "description": "Newick and Fletching Common",
            "objectID": "7cdb548348da0b22252e8c8a41cea333",
            "ref": "newick-and-fletching-common-walking-route"
        }
    ],
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/9/93/The_%22Anchor%22_on_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1072089.jpg",
            "title": "Shazz / The \"Anchor\" on the Sussex Ouse Valley Way, via Wikimedia Commons",
            "caption": "The Anchor Pub, a riverside pub located on the trail just north of Barcombe Mills."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Motte_and_Bailey_near_Isfield_Church.jpg/512px-Motte_and_Bailey_near_Isfield_Church.jpg",
            "title": "Dave Spicer / Motte and Bailey near Isfield Church, via Wikimedia Commons",
            "caption": "Motte and Bailey near Isfield Church"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Piddinghoe_on_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1072555.jpg",
            "title": "Shazz / Piddinghoe on the Sussex Ouse Valley Way",
            "caption": "Piddinghoe. The monument is the millennium memorial and has the name of the village in gold. On top is a golden fish."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Seabirds_seen_on_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1072328.jpg",
            "title": "Shazz / Seabirds seen on the Sussex Ouse Valley Way",
            "caption": "Seabirds seen on the trail. Taken near Rodmell looking towards the high ground behind Ranscombe Farm on the other side of the A27 and the River Ouse."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Bluebells_by_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1956030.jpg",
            "title": "Bluebells by the Sussex Ouse Valley Way by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Bluebells in Rotherfield Wood."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Slaugham_Furnace_Pond_on_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1072009.jpg",
            "title": "Shazz / Slaugham Furnace Pond on the Sussex Ouse Valley Way",
            "caption": "Slaugham Furnace Pond"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/3/30/Start_of_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_841572.jpg",
            "title": "Manchester Warrior / Start of the Sussex Ouse Valley Way",
            "caption": "Start of the trail. Alongside the B2110 at Lower Beeding (West Sussex). It's 42 miles from here to the end of the walk at Seaford (East Sussex). Although the Sussex Ouse Valley Way lies inside the valley of the River Ouse it is not confined to the riverbank. This is because, for the most-part, there is no public right of way of any form that runs alongside the river."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Southease_Bridge_from_the_Sussex_Ouse_Valley_Way_-_geograph.org.uk_-_1072511.jpg",
            "title": "Shazz / Southease Bridge from the Sussex Ouse Valley Way",
            "caption": "Southease Bridge"
        }
    ],
    "distance_km": 68.0,
    "description": "This splendid waterside walk follows the River Ouse from its source near Lower Beeding to the coast at Seaford Bay. The walk starts near Horsham at the village of Lower Beeding and passes through Slaugham, Handcross and Staplefield.  Near here you will pass the impressive Ouse Valley Viaduct , one of the most photographed sites on the path. The route continues through Lindfield, Freshfield, Sheffield Park , Newick , Barcombe Mills , Hamsey, Lewes , Rodmell, Southease , Piddinghoe and Newhaven before finishing at Seaford Bay. Walk highlights include the beautiful Nymans Gardens at Handcross. Owned by the National Trust it includes the ruins of a Gothic Mansion surrounded by delightful gardens, a lake and woodland. The walk also passes Sheffield Park Station which now plays host to a shop, model railway, museum and the Bessemer Arms pub. Located at Fletching on the banks of the Ouse it is a must see for railway enthusiasts. For wildlife lovers the delightful Offham Marshes Site of Special Scientific Interest will be a major attraction. Its biological interest comes from its habitat of alluvial marshland, which supports large numbers of amphibians. The walk also passes near the interesting county town of Lewes, while the final section along the seafront at Seaford is also particularly lovely."
}
