{
  "objectID": "e5753ace1ef30be7330a4c790a2bfccd",
  "created_at": "2024-12-18T19:25:39.408528+00:00",
  "ref": "balmoral-cairns-walking-route",
  "title": "Balmoral - Prince Albert Cairn Pyramid Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg/512px-Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg",
  "nearby": [
    {
      "description": "Lochnagar",
      "objectID": "7b3f7ab7e492f09103dc3c5140dbaf18",
      "ref": "lochnagar-walking-route"
    },
    {
      "description": "Loch Muick",
      "objectID": "8c5c52615b5a1ff803bd6e584d2605c4",
      "ref": "loch-muick-walking-route"
    },
    {
      "description": "Corrie Fee Nature Reserve",
      "objectID": "07176933b244d19bcfed6601d527033c",
      "ref": "corrie-fee-nature-reserve-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e5753ace1ef30be7330a4c790a2bfccd.gpx",
  "_geoloc": {
    "lat": 57.04044966,
    "lng": -3.22890758
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg/512px-Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg",
      "title": "Pete Chapman / Purchase Cairn, Balmoral Estate, via Wikimedia Commons",
      "caption": "Purchase Cairn, Balmoral Estate. Queen Victoria and Prince Albert had this cairn erected on their new estate to commemorate its purchase in 1848. The grounds to the S of the castle have several such cairns set on high points for various occasions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Leopolds_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36258.jpg",
      "title": "Pete Chapman / Leopolds Cairn, Balmoral Estate, via Wikimedia Commons",
      "caption": "Leopolds Cairn, Balmoral Estate.  Erected in 1882 to celebrate the marriage of Prince Leopold. The site overlooks Balmoral Castle, which can be seen just to the left of the cairn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Cairn_for_Prince_Albert_Balmoral.JPG/512px-Cairn_for_Prince_Albert_Balmoral.JPG",
      "title": "Drow69 [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Cairn or pyramid commissioned by Queen Victoria for Prince Consort Albert, Balmoral Estate, Ballanter, Scotland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Duchess_of_Kent%27s_Cairn_on_Sgor_an_h-Iolaire_-_geograph.org.uk_-_1099870.jpg",
      "title": "Nigel Corby / Duchess of Kent's Cairn on Sgor an h-Iolaire, via Wikimedia Commons",
      "caption": "Duchess of Kent's Cairn on Sgor an h-Iolaire. Not on the route but located just to the east of the estate. There are a number of substantial cairns on the hills around Balmoral, mainly from the 19th century, which are dedicated to members of the royal family. This one is named on the Ordnance Survey 1:25,000 map as the \"Duchess of Kent's Cairn\". Presumably the Duchess was Queen Victoria's mother. She spent several autumns at nearby Abergeldie Castle from 1850 until her death in 1861."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Balmoral_Castle%2C_Scotland.jpg/512px-Balmoral_Castle%2C_Scotland.jpg",
      "title": "BK59 [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Balmoral Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Close-up_of_the_inscription_%28OpenBenches_2617%29.jpg/512px-Close-up_of_the_inscription_%28OpenBenches_2617%29.jpg",
      "title": "twitrnick [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Close-up of the inscription: 1910 - 1936. To the memory of his majesty King George V. Erected in humble loyalty and affection by employees and tenants on Balmoral Estate"
    }
  ],
  "distance_km": 8.0,
  "description": "This walk visits a series of stone cairns on the estate of Balmoral Castle in Deeside. The cairns commemorate members of the British royal family and events in their lives. The circular walk runs for about 5 miles with nice woodland trails and fine views over the Deeside hills from the high points. You can start from the castle itself or from nearby Crathie. The majority of the cairns were erected by Queen Victoria in the 19th century. They commemorate the marriages of Victoria's children, of the Princess Royal (to Frederick, Crown Prince of Prussia in 1858), Prince Albert Edward, Princess Alice, Princess Helena, Princess Louise, Prince Arthur, Prince Leopold and Princess Beatrice. The most striking cairn is the large pyramid erected by Victoria in memory of her husband Prince Albert after his death in 1861. In 2012 an additional cairn was erected and unveiled by the Queen to mark her Diamond Jubilee. To continue you walking in the area head south and try the climb to Lochnagar. From the summit of the hill there's fabulous views back down to the Balmoral Estate and over the Cairngorms mountains. The walk starts from the Balmoral Estate Visitor centre where you can also pick up trails around the lovely Loch Muick. Near here there's also mile of fine walking trails in the Corrie Fee Nature Reserve. The reserve is rich with wildlife and also includes beautiful alpine flowers with rare mountain willows clinging to the steep crags of the bowl shaped valley. Before you go please check the Balmoral Estate website for the best times to visit as it's not advised to do the walk when the the royal family is in residence.",
  "video_url": "https://www.youtube.com/embed/5UODSmmSYFc",
  "county": "Aberdeenshire",
  "region": "Scotland",
  "country": "Scotland"
}