{
  "created_at": "2025-01-06T00:54:29.267871+00:00",
  "objectID": "e5753ace1ef30be7330a4c790a2bfccd",
  "ref": "balmoral-cairns-walking-route",
  "title": "Balmoral - Prince Albert Cairn Pyramid Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg/512px-Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg",
  "nearby": [
    {
      "description": "Lochnagar",
      "objectID": "7b3f7ab7e492f09103dc3c5140dbaf18",
      "ref": "lochnagar-walking-route"
    },
    {
      "description": "Loch Muick",
      "objectID": "8c5c52615b5a1ff803bd6e584d2605c4",
      "ref": "loch-muick-walking-route"
    },
    {
      "description": "Corrie Fee Nature Reserve",
      "objectID": "07176933b244d19bcfed6601d527033c",
      "ref": "corrie-fee-nature-reserve-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e5753ace1ef30be7330a4c790a2bfccd.gpx",
  "_geoloc": {
    "lat": 57.04044966,
    "lng": -3.22890758
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg/512px-Purchase_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36256.jpg",
      "title": "Pete Chapman / Purchase Cairn, Balmoral Estate, via Wikimedia Commons",
      "caption": "Purchase Cairn, Balmoral Estate. Queen Victoria and Prince Albert had this cairn erected on their new estate to commemorate its purchase in 1848. The grounds to the S of the castle have several such cairns set on high points for various occasions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Leopolds_Cairn%2C_Balmoral_Estate_-_geograph.org.uk_-_36258.jpg",
      "title": "Pete Chapman / Leopolds Cairn, Balmoral Estate, via Wikimedia Commons",
      "caption": "Leopolds Cairn, Balmoral Estate. Erected in 1882 to celebrate the marriage of Prince Leopold. The site overlooks Balmoral Castle, which can be seen just to the left of the cairn."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Cairn_for_Prince_Albert_Balmoral.JPG/512px-Cairn_for_Prince_Albert_Balmoral.JPG",
      "title": "Drow69 [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Cairn or pyramid commissioned by Queen Victoria for Prince Consort Albert, Balmoral Estate, Ballanter, Scotland"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/37/Duchess_of_Kent%27s_Cairn_on_Sgor_an_h-Iolaire_-_geograph.org.uk_-_1099870.jpg",
      "title": "Nigel Corby / Duchess of Kent's Cairn on Sgor an h-Iolaire, via Wikimedia Commons",
      "caption": "Duchess of Kent's Cairn on Sgor an h-Iolaire. Not on the route but located just to the east of the estate. There are a number of substantial cairns on the hills around Balmoral, mainly from the 19th century, which are dedicated to members of the royal family. This one is named on the Ordnance Survey 1:25,000 map as the \"Duchess of Kent's Cairn\". Presumably the Duchess was Queen Victoria's mother. She spent several autumns at nearby Abergeldie Castle from 1850 until her death in 1861."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Balmoral_Castle%2C_Scotland.jpg/512px-Balmoral_Castle%2C_Scotland.jpg",
      "title": "BK59 [CC BY 2.0 (https://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons",
      "caption": "Balmoral Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Close-up_of_the_inscription_%28OpenBenches_2617%29.jpg/512px-Close-up_of_the_inscription_%28OpenBenches_2617%29.jpg",
      "title": "twitrnick [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Close-up of the inscription: 1910 - 1936. To the memory of his majesty King George V. Erected in humble loyalty and affection by employees and tenants on Balmoral Estate"
    }
  ],
  "distance_km": 8.0,
  "description": "This walk visits a series of stone cairns on the estate of Balmoral Castle in Deeside. The cairns commemorate members of the British royal family and events in their lives. The circular walk runs for about 5 miles with nice woodland trails and fine views over the Deeside hills from the high points. You can start from the castle itself or from nearby Crathie. The majority of the cairns were erected by Queen Victoria in the 19th century. They commemorate the marriages of Victoria's children, of the Princess Royal (to Frederick, Crown Prince of Prussia in 1858), Prince Albert Edward, Princess Alice, Princess Helena, Princess Louise, Prince Arthur, Prince Leopold and Princess Beatrice. The most striking cairn is the large pyramid erected by Victoria in memory of her husband Prince Albert after his death in 1861. In 2012 an additional cairn was erected and unveiled by the Queen to mark her Diamond Jubilee. To continue you walking in the area head south and try the climb to Lochnagar. From the summit of the hill there's fabulous views back down to the Balmoral Estate and over the Cairngorms mountains. The walk starts from the Balmoral Estate Visitor centre where you can also pick up trails around the lovely Loch Muick. Near here there's also mile of fine walking trails in the Corrie Fee Nature Reserve. The reserve is rich with wildlife and also includes beautiful alpine flowers with rare mountain willows clinging to the steep crags of the bowl shaped valley. Before you go please check the Balmoral Estate website for the best times to visit as it's not advised to do the walk when the the royal family is in residence.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head into nearby Ballater and you could pick up the popular 7 Bridges Walk. The circular walk explores the area around the town visiting a series of old bridges. For more walking ideas in the area see the Cairngorms Walks page."
    },
    {
      "subtitle": "Visitor Reviews",
      "content": "\"A unique piece of history in a scenic setting!\" Visited July 2023 5 stars By Alice M. \"The Balmoral Cairns walk is unlike anything I’ve seen before. Each cairn is dedicated to different members of the royal family, and the Prince Albert’s Pyramid is absolutely massive! The trails are well-kept and offer beautiful views of the surrounding Deeside hills. It’s a lovely mix of history, nature, and peaceful scenery – definitely worth the hike!\" \"A tranquil walk with royal connections\" Visited September 2023 4.5 stars By Tom L. \"This walk offers a fascinating glimpse into royal history while being completely immersed in nature. The cairns themselves are impressive, but the real highlight is the view from the Prince Albert’s Pyramid at the top. The whole walk took us around two hours with stops for photos and some lovely forest paths. It’s a hidden gem in Royal Deeside!\" \"A peaceful and picturesque hike\" Visited May 2023 5 stars By Sarah J. \"I didn’t know what to expect from the Balmoral Cairns, but it was such a peaceful and unique hike! Each cairn has its own character, and the paths through the forest are enchanting. The pyramid for Prince Albert is especially striking and has amazing views from the top. It’s quiet, scenic, and great for anyone interested in history or the outdoors.\" \"Beautiful landscapes with a touch of history\" Visited October 2022 4 stars By Michael W. \"We decided to explore the Balmoral Cairns during a trip to Deeside, and it was a wonderful experience. The cairns are interesting monuments, and the walk through woodlands and open fields is beautiful, particularly in autumn when the leaves are changing. Prince Albert’s Pyramid is the highlight – make sure you save energy for the final climb up to it!\" \"A great walk with views over Royal Deeside\" Visited June 2023 5 stars By Lucy P. \"This is a lovely, quiet walk that leads you up to various royal cairns before reaching the impressive Prince Albert’s Pyramid. The views over Deeside are stunning, especially on a clear day. There’s a peaceful feeling to the whole area, and it’s a nice change from busier tourist spots. Highly recommend bringing a picnic to enjoy along the way!\" \"Hidden history and stunning scenery\" Visited April 2023 4.5 stars By Andrew S. \"I didn’t realise how many cairns there were on this walk! Each one represents a piece of royal history, and the pyramid cairn is truly impressive. The trails are manageable, though some parts are steep. The view from the top of Prince Albert’s Pyramid made the climb worth it – you can see right across the valley. A fantastic hike with an interesting backstory!\""
    }
  ],
  "video_url": "https://www.youtube.com/embed/5UODSmmSYFc",
  "county": "Aberdeenshire",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}