{
  "created_at": "2025-01-06T01:45:33.032509+00:00",
  "objectID": "e57c13b8ab41dbd03c5d1724d61dedac",
  "ref": "woburn-sands-walking-route",
  "title": "Woburn Sands Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Woburn_Sands_Station_-_geograph.org.uk_-_1323768.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e57c13b8ab41dbd03c5d1724d61dedac.gpx",
  "_geoloc": {
    "lat": 52.0184039159,
    "lng": -0.653826715
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Woburn_Sands_Station_-_geograph.org.uk_-_1323768.jpg",
      "title": "Martin Addison / Woburn Sands Station",
      "caption": "Woburn Sands Station. Looking towards Bedford. The station house on the left and the other station buildings are now available to let as business offices and meeting venues. Passengers are provided with bus shelters and steel seats. One of the local MK buses can be seen crossing the railway on the A4012, heading towards Woburn. The route is currently supported by contractors Wimpey as part of their involvement in a local affordable housing scheme."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Milton_Keynes_Boundary_Walk%2C_Aspley_Woods_-_geograph.org.uk_-_373548.jpg",
      "title": "Rob Farrow / Milton Keynes Boundary Walk, Aspley Woods",
      "caption": "Milton Keynes Boundary Walk, Aspley Woods. The woods south of Aspley Heath have numerous footpaths, bridleways and byways. This photo was taken from the track through New Wavendon Heath where the MKBW LDP (Long Distance Path) forks off to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Track_through_New_Wavendon_Heath_-_geograph.org.uk_-_367427.jpg",
      "title": "Rob Farrow / Track through New Wavendon Heath",
      "caption": "Track through New Wavendon Heath. This track is a \"BOAT\", that is a \"Byway Open to All Traffic\" marked on 1:25000 scale OS maps with a line of green crosses. It leads into the New Wavendon Heath section of Aspley Woods as a continuation of the lane from Little Brickhill and continues through the woods to Aspley Heath."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Sandy_Lane_-_geograph.org.uk_-_218841.jpg",
      "title": "Mr Biz / Sandy Lane",
      "caption": "Sandy Lane. The view at the top of Aspley Heath looking down Sandy Lane"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Woburn%2C_Bedfordshire_village_centre_-_geograph.org.uk_-_6514.jpg",
      "title": "Peter Roberts / Woburn, Bedfordshire village centre",
      "caption": "Woburn, Bedfordshire village centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/Part_of_the_Woburn_Abbey_park_-_geograph.org.uk_-_6505.jpg",
      "title": "Peter Roberts / Part of the Woburn Abbey park",
      "caption": "Part of the Woburn Abbey park"
    }
  ],
  "distance_km": 21.0,
  "description": "This Bedfordshire based town is located just to the east of Milton Keynes. The accessible train station in the town is a good place to start a walk with waymarked footpaths to follow into the countryside, woodland and heathland which surround the town. This walk from the town uses sections of the Milton Keynes Boundary Walk and the Greensand Ridge Walk to visit Bow Brickhill Woods, Aspley Woods and the splendid Woburn Park. The walk starts from the train station where you can pick up the Milton Keynes Boundary Walk and follow the waymarked footpath south and then west to Aspley Heath and Woods. The expansive woods have miles of good walking paths and some fine mountain bike trails to explore. Continue south to Lowe's wood where you can pick up the Greensand Ridge Walk and then head east to Woburn village and Woburn Park. The wonderful deer park has miles of trails to follow around several pretty lakes and ponds.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Fir Tree Inn is a good choice for some post walk refreshment. The 19th century pub serves good home cooked food and also provides B&B rooms.You can find them on the town square at postcode MK17 8SY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woods and heath on the walk make for a fine dog walk and the The Fir Tree Inn mentioned above is also dog friendly. When exploring Woburn Park please not they are not allowe within the Abbey Grounds or Gardens (except assistance dogs). Also they must be kept on a lead at all times as they can endanger the park's resident deer."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a few miles west of the town you could enjoy some waterside walking along the lovely Caldecotte Lake. On the western side of the lake you can also pick up the towpath of the Grand Union Canal. For more walking ideas in the area see the Bedfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FeKVMd1MyKw",
  "postcode": "MK17 8UW",
  "district": "Milton Keynes",
  "county": "City of Milton Keynes",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cranfield Road, Milton Keynes, City of Milton Keynes, England, MK17 8UW, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "mountain"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint"
  ],
  "facilities": [
    "visitor center",
    "car park"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}