{
  "created_at": "2025-01-06T04:51:14.786494+00:00",
  "objectID": "e58c886c11fe5b1130f8248bac0511cd",
  "ref": "brock-bottom-walking-route",
  "title": "Brock Bottom Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/73/Brock_Valley_Car_Park_-_geograph.org.uk_-_1178654.jpg",
  "nearby": [
    {
      "description": "Garstang Canal Walk",
      "objectID": "67fb6bbe2179b88ee9660f046d27e884",
      "ref": "garstang-canal-walk-walking-route"
    },
    {
      "description": "Beacon Fell Country Park",
      "objectID": "59eac5e7d245ffa44a8c3a34737a93e3",
      "ref": "beacon-fell-country-park-walking-route"
    },
    {
      "description": "Lancaster Canal",
      "objectID": "08cea8b165fd73b4fce338356f70285a",
      "ref": "lancaster-canal-walking-and-cycle-route"
    },
    {
      "description": "Bilsborrow",
      "objectID": "5de8dcf543cb2a99fa18fc3065a62e08",
      "ref": "bilsborrow-walking-route"
    },
    {
      "description": "Calder Vale",
      "objectID": "18e90661494cce56b0096fbbb9322271",
      "ref": "calder-vale-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e58c886c11fe5b1130f8248bac0511cd.gpx",
  "_geoloc": {
    "lat": 53.8821220057,
    "lng": -2.6874838111
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Brock_Valley_Car_Park_-_geograph.org.uk_-_1178654.jpg",
      "title": "Bob Jenkins / Brock Valley Car Park",
      "caption": "The good sized Brock Valley Car Park. Adjacent to a picnic area and the River Brock, this is very popular and busy in Summer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Path_to_Brock_Bottom_-_geograph.org.uk_-_1975434.jpg",
      "title": "Path to Brock Bottom by Michael Graham, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Path to Brock Bottom. The area is characterised by its rich vegetation, particularly along the banks of the River Brock. Here, you can find an abundance of mosses, ferns, and wildflowers such as bluebells, wood anemones, and primroses in spring, painting the forest floor with vibrant colours. The surrounding trees include native species like oak, ash, and hazel, which provide habitats for many creatures."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/71/River_Brock_at_Brock_Bottom_-_geograph.org.uk_-_1050074.jpg",
      "title": "Bryan Pready / River Brock at Brock Bottom",
      "caption": "River Brock at Brock Bottom. Birdlife is plentiful, with species such as robins, blackbirds, and great tits frequently spotted flitting among the trees. Near the river, you might encounter grey wagtails and dippers, which are often seen foraging along the water’s edge. Mammals such as squirrels, foxes, and deer are known to inhabit the woodlands, while the river itself is home to aquatic life, including trout and a variety of invertebrates. During summer, dragonflies and damselflies can be seen darting over the water."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Footbridge_over_the_River_Brock_-_geograph.org.uk_-_1127708.jpg",
      "title": "John Darch / Footbridge over the River Brock",
      "caption": "Footbridge over the River Brock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Mill_ruin_at_Brock_Bottom_-_geograph.org.uk_-_2720000.jpg",
      "title": "Mill ruin at Brock Bottom by Karl and Ali, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Mill ruin. The area holds historical interest, with remnants of an old cotton mill that operated during the 18th and 19th centuries. The mill played a significant role in the industrial history of the region before it was destroyed by fire. The surrounding area was once a hub of activity, with workers’ cottages and related infrastructure."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Weir_and_Thirlmere_Aqueduct_on_River_Brock_-_geograph.org.uk_-_2277435.jpg",
      "title": "Weir and Thirlmere Aqueduct on River Brock by Tom Richardson, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Weir and Thirlmere Aqueduct on River Brock. North of the car park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Brock_valley_-_geograph.org.uk_-_1050097.jpg",
      "title": "Bryan Pready / Brock valley",
      "caption": "Brock valley countryside"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c5/Bluebells%2C_Brock_woods_-_geograph.org.uk_-_836345.jpg",
      "title": "Peter Bond / Bluebells, Brock woods",
      "caption": "Bluebells, Brock woods. The area also supports a variety of fungi, especially in autumn, when toadstools and bracket fungi emerge in damp, shaded areas. These add to the area's natural diversity and are vital for the ecosystem, breaking down organic matter and recycling nutrients."
    }
  ],
  "distance_km": 1.7,
  "description": "This walk visits Brock Bottom near Garstang in the Forest of Bowland AONB. The area is something of a local hidden gem with peaceful waterside and woodland trails to enjoy. You can start the walk from the car park at the picnic site on Brock Mill Lane. From here you can pick up a waterside footpath heading south along the River Brock to Brock Bottom. It's a photogenic spot with nice woodland, babbling brooks and the ruins of the old mill building to admire. In the spring months there are also lots of pretty bluebells to see. You could extend the walk by heading north from the car park to see the rushing weir and the Thirlmere Aqueduct.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Just to the south east there's the Cross Keys Inn in Whitechapel. The pub is a bit of a hidden gem and a great place for Sunday Lunch. You can find them at Church Lane, Whitechapel with postcode PR3 2EP for sat navs. Just to the east in Beacon Fell Park there's a nice cafe at the visitor centre. You can sit outside here and enjoy great views with your lunch."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland trails are ideal for a dog walk so you'll probably see other owners on your visit. The Cross Keys mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just a mile to the east you'll find the popular Beacon Fell Country Park. The park includes, a visitor centre, woodland trails, ponds and viewpoints with fabulous views to the coast. To the west there's the Garstang Canal Walk which runs along a section of the Lancaster Canal. You could continue along the towpath to Bilsborrow and visit the impressive Owd Nell's/Guy's Thatched Hamlet complex. The canalside 'village' includes a pub, restaurant, hotel and ice cream parlour. To the north is the delightful village of Calder Vale. It's a lovely place for a stroll with more views of the River Calder, a village pond, bluebells woods, and the historic Lappet Mill, an old cotton weaving mill which is still in use. For more walking ideas in the area see the Forest of Bowland Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/V4aYKrys4fs?si=pkcpZWAa4QG2KWiw",
  "postcode": "PR3 0PP",
  "county": "Lancashire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "White Lee Lane, Claughton, Wyre, Lancashire, England, PR3 0PP, United Kingdom",
  "district": "Wyre",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "historical site",
    "viewpoint"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}