{
    "objectID": "e5dc970a2ac1e94c503b382eb983ee8c",
    "created_at": "2024-12-19T10:49:11.914768+00:00",
    "ref": "cwm-idwal-walking-route",
    "title": "Cwm Idwal Circular Walk Map Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/72/Gate_into_Cwm_Idwal_NNR_-_geograph.org.uk_-_2442840.jpg",
    "nearby": [
        {
            "description": "Glyder Fawr and Glyder Fach",
            "objectID": "7ec5a1e232f55bb24ce5240e9f7fdf19",
            "ref": "glyder-fawr-and-glyder-fach-walking-route"
        },
        {
            "description": "Tryfan",
            "objectID": "cb88364a374201c8ef8d9ead3390b6b5",
            "ref": "tryfan-walking-route"
        },
        {
            "description": "Llyn Ogwen",
            "objectID": "e89e9e48cad5ab2e3b69116be42b265e",
            "ref": "llyn-ogwen-walking-route"
        },
        {
            "description": "Lon Las Ogwen",
            "objectID": "1328bbabbc13b98fdc25702f06299f1b",
            "ref": "lon-las-ogwen-cycle-route"
        },
        {
            "description": "Nant Ffrancon",
            "objectID": "9369f3f9ae7028e2012f239b2d4aeb8d",
            "ref": "nant-ffrancon-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/F2119B58F55FFCFB80257E960031DDBC/$FILE/Cwm Idwal.gpx",
    "_geoloc": {
        "lat": 53.1232746127,
        "lng": -4.0189095261
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Gate_into_Cwm_Idwal_NNR_-_geograph.org.uk_-_2442840.jpg",
            "title": "Gate into Cwm Idwal NNR by Jeremy Bolwell, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "Gate into Cwm Idwal NNR"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/07/Idwal_Cottage_car_park_and_path_into_Cwm_Idwal_-_geograph.org.uk_-_1764905.jpg",
            "title": "Jeremy Bolwell / Idwal Cottage car park and path into Cwm Idwal",
            "caption": "Idwal Cottage car park. The car park is already busy as walkers head up the nature trail path into stunning Cwm Idwal."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Cwm_Idwal_-_geograph.org.uk_-_623861.jpg",
            "title": "Peter Smyly, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
            "caption": "The popular path leading to the Idwal slabs and beyond to the Devil's kitchen. The area is geologically fascinating, an incredible result of thousands of years of glaciation. The site is surrounded by high crags, screes, moraines and rounded rocks. Due to its high elevation and north-facing orientation, Cwm Idwal represents the most southerly location in Britain where Arctic vegetation, including moss campion and certain alpine saxifrages like tufted saxifrage (Saxifraga cespitosa) and Micranthes nivalis, can thrive. Additionally, it serves as a habitat for the Snowdon lily, a plant exclusive to Snowdon and its surrounding regions within the UK. Evan Roberts, a notable botanist and explorer hailing from Capel Curig, played a significant role, perhaps more than any other self-taught botanist, in documenting the area. Furthermore, the Snowdonia hawkweed, known scientifically as Hieracium snowdoniense, is found exclusively within Cwm Idwal."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Llyn_Idwal_-_geograph.org.uk_-_1295799.jpg",
            "title": "Tony Edwards / Llyn  Idwal",
            "caption": "Llyn Idwal is a memorable place at any time. The Twll Du climb is right of centre. Some of the boulders that have spilled out in the distant past are the size of small houses. It takes its name from Prince Idwal Foel, a descendant of Rhodri Mawr, an ancient King of Wales. According to legend, the unfortunate prince met his demise by drowning in the lake, although historical records suggest he actually perished in battle against the Saxons in 942. An alternative version suggests he was cremated beside the lake, following the burial customs of Celtic nobility. Several small streams feed into Llyn Idwal from various points around Cwm Idwal. One of these streams flows out and merges with the Afon Ogwen river at Pont Pen-y-Benglog near Ogwen Cottage, just above the Rhaeadr Ogwen waterfall."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Boulders_in_the_Devil%27s_Kitchen_area_of_Cwm_Idwal_-_geograph.org.uk_-_1764947.jpg",
            "title": "Jeremy Bolwell / Boulders in the Devil's Kitchen area of Cwm Idwal",
            "caption": "Boulders in the Devil's Kitchen area. An old rockfall has deposited massive rocks here, which the path climbs past. Llyn Idwal laid out below. The lake is easily reachable by foot via a 900-metre long stone-paved pathway from Ogwen Cottage on the main A5 road. Another path encircles the lake, while two paths from opposite sides of the lake lead to the ridge near Twll Du (Devil's Kitchen), although these paths become steep in places as they ascend towards Glyder Fach and Glyder Fawr. At the northwest edge of Llyn Idwal, there is a small pebble beach occasionally used by visitors for recreational activities, including bathing during the summer months. As a mountain lake, the waters can be cold, and swimmers should exercise caution not to venture beyond their depths. While the lake lies entirely within Gwynedd County, its eastern edge forms the boundary between the counties of Gwynedd and Conwy."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Sunset_over_Devil%27s_Kitchen_and_Cwm_Idwal_-_geograph.org.uk_-_1416793.jpg",
            "title": "Karen Chantrey Wood / Sunset over Devil's Kitchen & Cwm Idwal",
            "caption": "Sunset over Devil's Kitchen. Taken from the roadside (A5) looking back up to Cwm Idwal and Devil's Kitchen with the stream flowing past down to Nant Francon Pass."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Descent_to_Idwal_Cottage_car_park_-_geograph.org.uk_-_1765023.jpg",
            "title": "Jeremy Bolwell / Descent to Idwal Cottage car park",
            "caption": "Descent to Idwal Cottage car park. The path here runs through a deep rock chasm to the roadside. Rhiwiau Caws (Idwal Slabs) and the cliffs surrounding the head of Cwm Idwal are well-known spots for rock climbing, with Rhiwiau Caws on the eastern side of the Cwm being particularly favoured by novice climbers honing their skills. These cliffs were initially ascended in 1897 by Rose and Moss. During the winter months, Twll Du offers excellent opportunities for ice climbing. The Cwm is also a popular destination for hill walking and scrambling, thanks to its proximity to Tryfan, Glyder Fach, and Glyder Fawr, along with their abundance of rocky ridges. In the mid-to-late 1950s and into the 1960s, this area served as the gathering site for the first ascenders of Mount Everest and Kangchenjunga, who held reunion excursions at Pen-y-Gwryd. Many of these individuals were enthusiastic geologists and botanists."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Nant_Ffrancon_from_the_head_of_Cwm_Bual_-_geograph.org.uk_-_1311149.jpg",
            "title": "Kenneth Yarham / Nant Ffrancon from the head of Cwm Bual",
            "caption": "Nant Ffrancon from the head of Cwm Bual. Cwm Bual leads down from the slopes of Foel-goch and provides a steady if tedious descent to the side road which leads from Idwal Cottage down the west side of Nant Ffrancon. It is actually a lot further than it looks here."
        }
    ],
    "distance_km": 4.0,
    "description": "Explore this wonderful hanging valley and enjoy some of the most spectacular mountainous scenery in the country on this fine circuit in Snowdonia. In a Radio Times poll in 2005, Cwm Idwal was ranked the 7th greatest natural wonder in Britain. This circular walk begins at the car park next to the western end of Lllyn Ogwen. You then pick up a footpath which ascends to the beautiful Llyn Idwal. It's a simply wonderful spot with the crystal clear lake and surrounding mountains forming a spectacular natural amphitheatre. The footpath runs along the edge of the lake to the Darwin Idwal Boulders and then to the Idwal Slabs. The slabs were used as a training ground for Mount Everest conqueror Edmund Hillary. As you pass the lake you close in on the impressive headwall of Cwm Idwal know as 'The Devil's Kitchen'. From here the route descends on the western side of Llyn Idwal to Llyn Ogwen and the finish point. If you would like to continue your walking in the area then you could climb the challenging Tryfan mountain. The route starts from the eastern end of Llyn Ogwen which is a great place to extend your walk.",
    "video_url": "https://www.youtube.com/embed/A-U9_y5R8GY",
    "postcode": "LL57 3LZ",
    "county": "Gwynedd - Gwynedd",
    "region": "Wales",
    "country": "Wales"
}
