{
  "created_at": "2025-01-06T02:21:16.460362+00:00",
  "objectID": "e5df8561fc93e8d51c3449d46770f0bf",
  "ref": "llandovery-walking-route",
  "title": "Llandovery Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/84/Rail_bridge_over_Towy_river_at_Llandovery_-_geograph.org.uk_-_529664.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e5df8561fc93e8d51c3449d46770f0bf.gpx",
  "_geoloc": {
    "lat": 51.9951713599,
    "lng": -3.803806117
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Rail_bridge_over_Towy_river_at_Llandovery_-_geograph.org.uk_-_529664.jpg",
      "title": "Nigel Davies / Rail bridge over Towy river at Llandovery, via Wikimedia Commons",
      "caption": "Rail bridge over Towy river at Llandovery. The Heart of Wales line crosses the Towy here on its way north into Llandovery. Taken from the pebble shore upstream of the bridge on the town side of the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Llandovery_Castle_-_geograph.org.uk_-_987511.jpg",
      "title": "Philip Halling / Llandovery Castle, via Wikimedia Commons",
      "caption": "Part of the ruined walls of Llandovery Castle with some of the rooftops of the town in the background."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Llandovery_golf_course_-_geograph.org.uk_-_529668.jpg",
      "title": "Nigel Davies / Llandovery golf course, via Wikimedia Commons",
      "caption": "Llandovery golf course. A public footpath runs right along the edge of the golf course where it borders with the river. This shot is taken from the north boundary with the sports ground. The structure in the tree line is the stand at the Drovers RFC across the railway line."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Afon_Bran_at_Llandovery_-_geograph.org.uk_-_1217636.jpg",
      "title": "ceridwen / Afon Bran at Llandovery, via Wikimedia Commons",
      "caption": "Afon Bran at Llandovery. The eastern edge of the town, behind the castle, with the Afon Bran, below its confluence with the Afon Gwydderig, flowing south shortly to join the Afon Tywi. There is a fourth river, Y Bawddwr, running through the town: not surprising then that Llandovery means 'The Church Amidst The Waters' (A 'llan' is a church enclosure and 'ymlith-y-dyfroedd' means amidst the waters.) Image taken from the castle mound."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Llandovery_College_boating_lake_-_geograph.org.uk_-_521603.jpg",
      "title": "Nigel Davies / Llandovery College boating lake",
      "caption": "Llandovery College boating lake. Despite not featuring on the OS maps this lake is large enough to warrant two or three orange life belt poles and old enough for them to be partially overgrown. The lake is between a public footpath and a field boundary. The far shore is the least overgrown edge and borders on the golf course."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Llandovery_Heritage_Centre_-_geograph.org.uk_-_1217426.jpg",
      "title": "ceridwen / Llandovery Heritage Centre",
      "caption": "Llandovery Heritage Centre. Located between the town and the castle. The building was once a bakery. The sundial and the stained glass window were both presents from Llandovery's twin town, Pluguffan, in Britanny."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/View_north_from_the_castle_-_geograph.org.uk_-_1217608.jpg",
      "title": "ceridwen / View north from the castle",
      "caption": "View north from the castle. Llandovery grew up as a Norman stronghold, its castle being one of a chain of fortifications along the Tywi valley designed to subjugate the Welsh. It was laid waste by Owain Glyndwr, with the support of Welsh loyalists, in his attempt to unite the disparate regions of Wales. As a result, the local population was subjected to the merciless reparations of Henry IV. Here the view is up the valley of the Tywi toward the northern hills of Esgair Ferchan and Mynydd Mallaen."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Afon_Br%C3%A2n_valley%2C_Llandovery_-_geograph.org.uk_-_3159143.jpg",
      "title": "Afon Brân valley, Llandovery by Jaggery, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Afon Brân valley, south of the town."
    }
  ],
  "distance_km": 6.0,
  "description": "This market town in the Cambrian Mountains has some nice riverside walks along the River Towy and River Bran to try. This circular walk takes you along the river before exploring the woodland and countryside to the south of the town. The walk starts at the train station in the town centre. The station is on the Heart of Wales Line Line 42 miles (68 km) north east of Swansea and is located at Tywi Avenue. From here you can follow footpaths north west to the river and then turn south along the riverside path which also runs along the golf course. The path then leaves the river and heads east, crossing the River Bran, around Cwm-Rhuddan. You then follow some woodland trails north before returning to the town around Afon Bran at Llandovery Castle. The 13th century castle ruins occupy a knoll overlooking the River Towy with nice views of the surrounding countryside. After exploring the castle you head through the town centre before returning to the train station where the route finishes. The town is also located in the west of the Brecon Beacons where you can find lots of good walking trails. If you head a few miles to the south east you can visit the lovely Usk Reservoir. There's a nice cycling and walking trail running round the reservoir where you can also look out for Red Kites. Another nice idea is to catch the train north and visit the Cynghordy Viaduct. The impressive grade II listed 18-arch viaduct carries the route across the Afon Bran valley on a gentle curve. Also not to far away are the lakes of Llyn y Fan Fach and Llyn Brianne where you can access the glorious Tywi Valley .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bluebell Inn is located on the High Street does good food and has a nice garden to sit out in on warmer days. You can find it at postcode SA20 0PU for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "About 10 miles south west of the town you will find the interesting town of Llandeilo where there's some lovely trails through Dinefwr Park and two ancient hill forts on Garn Goch. Near here there's also Gelli Aur Country Park. The park surrounds the Golden Grove mansion and includes a deer park, peacocks, views of the Tywi Valley and an aboretum with some fine specimen trees. To the north there's the peaceful little village of Rhandirmwyn where you can explore the interesting old lead mines, the River Towy Valley and the local woods. Near the Usk Reservoir to the east, you can pick up the Epynt Way. This shared cycling and walking trail takes you around Mynydd Epynt in the MOD's Sennybridge Army Training Area. The Heart of Wales Line Trail passes through the area. The 143 mile trail explores the Heart of Wales Railway Line, a wonderful rural railway running between Swansea and Shrewsbury. The trail visit several train stations, old railway lines and photogenic railway viaducts. Heading north will take you to the impressive Cynghordy Viaduct and LLanwrtyd Wells. Just to the south is the village of Myddfai. The village is a popular place to visit with a 14th century Grade I listed church and an excellent, energy efficient visitor centre. You can climb east to Mynydd Myddfai from here. For more walking ideas in the area see the Cambrian Mountains Walks and the Brecon Beacons Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/g_3gQGpts4A",
  "postcode": "SA20 0HS",
  "district": "Llandovery",
  "county": "Sir Gaerfyrddin / Carmarthenshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Maes-y-Coleg, Llandovery, Sir Gaerfyrddin / Carmarthenshire, Cymru / Wales, SA20 0HS, United Kingdom",
  "state": "Cymru / Wales",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "reservoir",
    "viaduct",
    "lakes"
  ],
  "facilities": [
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling"
  ]
}