{
  "objectID": "e5e398a58bcf54dce4342ad1064fb6a8",
  "created_at": "2024-12-20T21:28:36.554251+00:00",
  "ref": "erewash-canal-walking-and-cycle-route",
  "title": "Erewash Canal Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/98/Erewash_Canal_looking_north_from_Sandiacre_bridge_-_geograph.org.uk_-_953123.jpg",
  "nearby": [
    {
      "description": "Shipley Country Park",
      "objectID": "8a96136240f8ad9e25727e82a7c3b59e",
      "ref": "shipley-country-park-walking-and-cycle-route"
    },
    {
      "description": "Nutbrook Trail",
      "objectID": "a0d01587cc8e5c905449faa690fbaf09",
      "ref": "nutbrook-trail-walking-and-cycle-route"
    },
    {
      "description": "Erewash Valley Trail",
      "objectID": "0a9afadb35d1090581c1ae9fe3e5d241",
      "ref": "erewash-valley-trail-walking-and-cycle-route"
    },
    {
      "description": "Trent Valley Way",
      "objectID": "deaeed2d2c582aa7fdfd01f9dcce589a",
      "ref": "trent-valley-way-walking-route"
    },
    {
      "description": "Attenborough Nature Reserve",
      "objectID": "b7e367bf4456cdd77ed859556dcdd097",
      "ref": "attenborough-nature-reserve-walking-route"
    },
    {
      "description": "Bennerley Viaduct",
      "objectID": "12590fb4d0a40e2ea3f8aec1b73d75a4",
      "ref": "bennerley-viaduct-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e5e398a58bcf54dce4342ad1064fb6a8.gpx",
  "_geoloc": {
    "lat": 52.8765903879,
    "lng": -1.2732416299
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/98/Erewash_Canal_looking_north_from_Sandiacre_bridge_-_geograph.org.uk_-_953123.jpg",
      "title": "David Pinney / Erewash Canal looking north from Sandiacre bridge, via Wikimedia Commons",
      "caption": "Canal looking north from Sandiacre bridge. The canal was built in 1777-1779 to carry coal from mines on either side of the Erewash valley to Leicestershire. Padmore Moorings are on the left adjacent to Town Street. Springfield Mill with its noticeable chimney was built in 1888 as a lace factory. The towpath is part of an off-road cycle route named the Nutbrook Trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Erewash_Canal%2C_Trentlock_-_geograph.org.uk_-_763828.jpg",
      "title": "Stephen McKay / Erewash Canal, Trentlock, via Wikimedia Commons",
      "caption": "Trentlock. The river yacht and houseboats moored on the opposite bank are hardly typical of the canal network, but Trentlock is a place where river and canal craft mix. This is the attractive start of the almost 12-mile long Erewash Canal; much of the route runs through an urban and industrial landscape but it is nevertheless a fascinating waterway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Green%27s_Lock%2C_Erewash_Canal_-_geograph.org.uk_-_1106572.jpg",
      "title": "Stephen McKay / Green's Lock, Erewash Canal, via Wikimedia Commons",
      "caption": "Green's Lock"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Erewash_Canal%2C_Stanton_Gate_-_geograph.org.uk_-_1479305.jpg",
      "title": "Stephen McKay / Erewash Canal, Stanton Gate, via Wikimedia Commons",
      "caption": "Canal, Stanton Gate. The Erewash Canal, which runs from the River Trent at Trentlock to Langley Mill, is predominantly urban or industrial in nature but this doesn't mean that some stretches are not quite bucolic - as here approaching Moorbridge Lane bridge."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Erewash_Canal%2C_Shipley_Gate_-_geograph.org.uk_-_551742.jpg",
      "title": "Stephen McKay / Erewash Canal, Shipley Gate, via Wikimedia Commons",
      "caption": "Information noticeboard at Shipley Gate. The Canal curves sharply to the right just north of Shipley Lock before crossing over the River Erewash. Severn Trent Water has provided this rather oversized information notice describing its efforts to improve the quality of the river - this is perhaps somewhat confusing as it stands adjacent to the canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Pasture_Lock%2C_Erewash_Canal_-_geograph.org.uk_-_1479669.jpg",
      "title": "Stephen McKay / Pasture Lock, Erewash Canal, via Wikimedia Commons",
      "caption": "Pasture Lock. One of the bottom gates has been left open; in the distance is the spire of Sandiacre Church."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Gallows_Inn_Lock%2C_Erewash_Canal_-_geograph.org.uk_-_1106537.jpg",
      "title": "Stephen McKay / Gallows Inn Lock, Erewash Canal, via Wikimedia Commons",
      "caption": "Gallows Inn Lock. The lock is adjacent to the pub of the same name, a grim reminder that this was once a place where criminals were publicly executed. Compare this view with; new houses have appeared in the four years since that picture was taken."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1f/Erewash_Canal%2C_Larklands_-_geograph.org.uk_-_1108150.jpg",
      "title": "Stephen McKay / Erewash Canal, Larklands, via Wikimedia Commons",
      "caption": "Larklands. Canal and railway come close together here on the eastern outskirts of Ilkeston. The railway is used by passenger services between Nottingham and Sheffield as well as many freight trains. The canal runs from the River Trent at Trentlock northwards to the basin at Langley Mill; originally built primarily as an outlet for coal mined in the Nottinghamshire/Derbyshire border area, it is now used exclusively for leisure boating. Not that there was any sign of any boats moving on this cold New Year's Day, however."
    }
  ],
  "distance_km": 19.0,
  "description": "Follow the Erewash canal through south Derbyshire on this waterside cycling and walking route. The canal runs from Trent Lock near Long Eaton to the Langley Mill (Great Northern) basin. You can follow the towpath all the way on your bike or on foot. It's a nice easy route that runs for about 12 miles so it's a good family cycle ride or long walk. On the way you'll pass old mills, pretty locks and a number of stone bridges. The areas around Nutbrook Junction and Trowell Marsh are nature reserves where you can look out for a wide variety of wildlife. There's also nice views of the River Erewash and the surrounding countryside. The canal forms part of the larger Erewash Valley Trail so it's easy to extend your exercise on this circular route. You start off at Trent Lock on the border of Derbyshire, Leicestershire and Nottinghamshire. It's a major canal junction where several significant waterways meet including the River Soar, the Trent and Mersey Canal, the River Trent and the Erewash Canal. The canal then weaves its way through the town of Long Eaton to Sandiacre. You continue north to Ilkeston, passing Gallows Inn and the impressive Bennerley Viaduct, before finishing at Langley Mill at the basin of the Erewash Canal. You can virtually follow part of the route along the canal from Trent Lock by clicking on the google street view link below. To continue your walking in the area you can visit the lovely Attenborough Nature Reserve which is located near the start of the canal at Long Eaton. You can follow the Trent Valley Way along the River Trent to reach the reserve. The Beeston Canal can also be picked up at the eastern end of the reserve, next to the pretty Beeston Lock. The canal also forms part of the Nutbrook Trail Cycle Route which runs up to Shipley Country Park on a dismantled railway line.",
  "video_url": "https://www.youtube.com/embed/Sjnk4faFtPk",
  "postcode": "NG10 2FY",
  "district": "Trentlock",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "England"
}