{
  "created_at": "2025-01-05T23:23:05.041144+00:00",
  "objectID": "e5ead3a1d512ad5500de1318457a7d42",
  "ref": "cotehele-house-walking-route",
  "title": "Cotehele to Calstock Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/63/Calstock%2C_Cothele_House_-_geograph.org.uk_-_415331.jpg",
  "nearby": [
    {
      "description": "Kit Hill",
      "objectID": "22ad636b94fa1f1ba97b9317a8eee3e8",
      "ref": "kit-hill-walking-route"
    },
    {
      "description": "Tamar Valley Discovery Trail",
      "objectID": "ee55b9ee756d935ffaa037bca736c52b",
      "ref": "tamar-valley-discovery-trail-walking-route"
    },
    {
      "description": "Gunnislake",
      "objectID": "3420cefbb0245d60dc532178bbd48bc7",
      "ref": "gunnislake-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e5ead3a1d512ad5500de1318457a7d42.gpx",
  "_geoloc": {
    "lat": 50.4914996124,
    "lng": -4.2239993056
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Calstock%2C_Cothele_House_-_geograph.org.uk_-_415331.jpg",
      "title": "Martin Bodman / Calstock: Cothele House, via Wikimedia Commons",
      "caption": "Calstock: Cothele House. The house dates from the 15th and 16th centuries and is constructed of slatestone and granite. It is now a National Trust property, open to the public for a small entry fee. Looking north-north-west"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/St_Dominick%2C_dock_at_Cothele_Quay_-_geograph.org.uk_-_673409.jpg",
      "title": "Martin Bodman / St Dominick: dock at Cothele Quay, via Wikimedia Commons",
      "caption": "St Dominick: dock at Cothele Quay. By the Tamar and now part of the National Trust\u0092s Cothele estate"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/Cothele_Mill_Weir_-_geograph.org.uk_-_926128.jpg",
      "title": "John Lindsay / Cothele Mill Weir, via Wikimedia Commons",
      "caption": "Cothele Mill Weir. This weir provides the head of water for the operation of the mill a few hundred metres downstream. The take off into the mill leat can just be seen through the leaves on the left of the photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Cothele_Consols_Engine_House_-_geograph.org.uk_-_926058.jpg",
      "title": "John Lindsay / Cothele Consols Engine House, via Wikimedia Commons",
      "caption": "Cothele Consols Engine House. General concensus is that this engine house was built in the latter half of the 19th Century when mining was restarted in the Danescombe Valley. It housed a 30 or 40 inch Cornish beam engine for pumping and crushing equipment. It is now holiday accommodation after repair and conversion by the Landmark Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Calstock%2C_the_viaduct_from_the_west_-_geograph.org.uk_-_673397.jpg",
      "title": "Martin Bodman / Calstock: the viaduct from the west, via Wikimedia Commons",
      "caption": "Calstock: the viaduct from the west. Seen from a point near the chapel on the National Trust\u0092s Cothele estate"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Calstock%2C_Danesbrook_Valley_House_-_geograph.org.uk_-_673399.jpg",
      "title": "Martin Bodman / Calstock: Danesbrook Valley House, via Wikimedia Commons",
      "caption": "Calstock: Danesbrook Valley House seen from near the chapel on the National Trust\u0092s Cothele estate. Danesbrook Valley House is marked as an hotel on the Ordnance Survey, but may well now be a private residence. By one of the sharp turns on the Tamar at its confluence with the Danesbrook"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Bere_Ferrers%2C_River_Tamar_-_geograph.org.uk_-_66512.jpg",
      "title": "Martin Bodman / Bere Ferrers: River Tamar, via Wikimedia Commons",
      "caption": "Bere Ferrers: River Tamar. Slipway and yacht berth seen from the Cornish bank at Cothele Quay. Thought to be the site of an old ferry crossing"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/The_Viaduct%2C_Calstock_-_geograph.org.uk_-_531588.jpg",
      "title": "Rob Farrow / The Viaduct, Calstock, via Wikimedia Commons",
      "caption": "The Viaduct, Calstock. Taken from a river launch as we approached the dramatic railway viaduct over the Tamar at Calstock. Dusk was falling so the colours are somewhat muted. This is a remarkably attractive structure considering it is made out of concrete blocks! The blocks are huge, typically 5ft x 3ft x 2ft, but varying to allow for the tapered columns. There are 12 arches in total, each one spanning 60ft. Of these 12, four arches actually span the river (not 6 as you will find reported elsewhere). The engineers were R. Church & William Robert Galbraith and the bridge was constructed between 1904 and 1908."
    }
  ],
  "distance_km": 4.0,
  "description": "This walk explores the beautiful grounds of a Tudor house near Saltash, before heading to the nearby village of Calstock. Outside the house you will find formally planted terraces, the Valley Garden with medieval stewpond and dovecote, the Upper Garden and two orchards. The River Tamar also runs through the grounds where you can stroll along the pretty Cothele Quay. Here you will find the Discovery Centre where you can find out about the interesting history of the quay. In the 19th century paddle steamers would pass and vessels would stop to load and unload their cargo at Cothele. You can also explore the Tudor house with tapestries, arms and armour, pewter, brass and old oak furniture. The wide estate covers 1300 acres so there is plenty of scope for extending your walk. There are miles of walking paths taking you to woodland, fields, industrial ruins and working farm buildings. Highlights include the Prospect Tower which you can climb for splendid views of the Calstock Viaduct, Kit Hill and Plymouth Sound. The tiny Chapel-in-the-Wood was used by Richard Edgcumbe to hide from King Richard III's men in 1483. After exploring the estate you can pick up a country lane heading east into Calstock where there's a lovely quay. There's also a train station served by trains on the Tamar Valley Line from Gunnislake to Plymouth. Connections with main line services can be made at Plymouth, although a small number of Tamar Valley services continue to or from Exeter St Davids. The Tamar Valley Discovery Trail also runs past Cothele so you could continue you walk along the river too. Also nearby is the lovely Kit Hill Country Park where you can climb to the hill summit and enjoy fabulous views over the Tamar Valley and Dartmoor.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Calstock you could head to the Tamar Inn for refreshments after your walk. The historic 17th century free house sits on the banks of the River Tamar. It was allegedly once a meeting place for smugglers and highwaymen. Built on a split level, it sits close by the waterfront in the village centre at a postcode of PL18 9QA. The Tamar Valley Line runs through Calstock and is a great way of seeing the area. The scenic railway takes you through rolling green, sleepy villages and beautiful river crossings. The highlight of the journey is when the train slowly creeps down over the impressive Calstock viaduct and you are 120 feet high looking down on the river below."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The estate and riverside paths are a lovely place for a dog walk. The Tamar Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head west towards the town of Callington and you can enjoy a climb to the Cadson Bury Iron Age Hill fort. From the ancient site there are fine views over the River Lynher Valley. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/GAN2LZO46bA",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Cotehele House and Mill, Comfort Wood, Clampits, Calstock, Metherell, Cornwall, England, PL17 8BZ, United Kingdom",
  "postcode": "PL17 8BZ",
  "district": "Metherell",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "field",
    "industrial"
  ],
  "points_of_interest": [
    "viewpoint",
    "historical site",
    "tower"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "train station",
    "country lane"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}