{
  "created_at": "2025-01-06T05:03:06.201911+00:00",
  "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
  "ref": "the-south-downs-way-walking-route",
  "title": "The South Downs Way National Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/South_Downs_Way_start_Eastbourne.jpg/512px-South_Downs_Way_start_Eastbourne.jpg",
  "nearby": [
    {
      "description": "Harting Down",
      "objectID": "476c3c9f733365fc938f0d2343327c87",
      "ref": "harting-down-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e61ceb24a28678cb8e0ca7bbd9f413cb.gpx",
  "_geoloc": {
    "lat": 51.0614422876,
    "lng": -1.3098669006
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/South_Downs_Way_start_Eastbourne.jpg/512px-South_Downs_Way_start_Eastbourne.jpg",
      "title": "AndyScott [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "South Downs Way start Eastbourne"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Chantry_Hill_South_Downs_Way.jpg/512px-Chantry_Hill_South_Downs_Way.jpg",
      "title": "Malcolm Oakley [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Chantry Hill South Downs Way"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Gate_on_the_South_Downs_Way%2C_Gander_Down_-_geograph.org.uk_-_322502.jpg/256px-Gate_on_the_South_Downs_Way%2C_Gander_Down_-_geograph.org.uk_-_322502.jpg",
      "title": "Jim Champion / Gate on the South Downs Way, Gander Down",
      "caption": "Gate on the South Downs Way, Gander Down. The sign on the gate explains that there is a permissive footpath across the field (seen as a worn route headed for the trees over the brow of the hill), although the post standing in the field says 'No public access'. The public right of way hugs the edge of the field, requiring you to do a U-turn in the pointed eastern corner of the field. One of the medieval hollow ways can be seen going from middle right to top left of the picture."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Temporary_route_to_Beacon_Hill_for_cyclists_and_horse_riders_on_the_South_Downs_Way_-_geograph.org.uk_-_1430833.jpg/256px-Temporary_route_to_Beacon_Hill_for_cyclists_and_horse_riders_on_the_South_Downs_Way_-_geograph.org.uk_-_1430833.jpg",
      "title": "Jim Champion / Temporary route to Beacon Hill for cyclists and horse riders on the South Downs Way",
      "caption": "Temporary route to Beacon Hill for cyclists and horse riders. In March 2009 a new temporary route for horse riders and cyclists was opened between Old Winchester Hill and Beacon Hill. This new route replaces the old temporary route that ran though Warnford. The South Downs Way website says \"The route has been changed to improve the safety of users until agreement can be reached on a permanent route across the valley ... The old route is still usable but is not recommended and is not signed as the South Downs Way.\" The temporary route is likely to be in place until March 2011. This view is the upper part of a permissive stretch approaching the trig point on Beacon Hill, just beyond the wooden gate."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Waymarkers_on_a_post%2C_South_Downs_Way_-_geograph.org.uk_-_1430776.jpg/512px-Waymarkers_on_a_post%2C_South_Downs_Way_-_geograph.org.uk_-_1430776.jpg",
      "title": "Jim Champion / Waymarkers on a post, South Downs Way",
      "caption": "Waymarkers on a post. This post is on the steepest part of the descent from Beacon Hill to Exton Village. The acorn symbols on the waymarkers indicate a national trail, the South Downs Way which runs from Winchester to Eastbourne. There was a gap in the trail across the Meon valley, and following various complications (involving public enquiries) there are split routes for footpath users and bridleway users at this point. The additional footpath waymarker indicates that this is the footpath route."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Old_Winchester_Hill_-_geograph.org.uk_-_1430653.jpg",
      "title": "Jim Champion / Old Winchester Hill",
      "caption": "View of the Old Winchester Hill spur (and hillfort) across the Meon valley from Way (descending from Beacon Hill to Exton village). The South Downs Way national trail crosses the Meon valley and ascends Old Winchester Hill to the right of the wooded area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Four-way_finger_post_near_Cheesefoot_Head_-_geograph.org.uk_-_147846.jpg/256px-Four-way_finger_post_near_Cheesefoot_Head_-_geograph.org.uk_-_147846.jpg",
      "title": "Jim Champion / Four-way finger post near Cheesefoot Head",
      "caption": "Four-way finger post near Cheesefoot Head. Four bridleways meet at this point: the Way makes a right-angled turn (the left-facing fingers), Fawley Lane retreats down the ridge of Fawley Down (the right-facing finger in shadow) and the fourth direction takes you to the start of Warren Lane. Behind the signpost are a clump of beech trees behind the small car park at Cheesefoot Head and the A272 road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Shady_gateway%2C_Lomer_-_geograph.org.uk_-_391318.jpg",
      "title": "Jim Champion / Shady gateway, Lomer",
      "caption": "Shady gateway, Lomer"
    }
  ],
  "distance_km": 160.0,
  "description": "This beautiful 100 mile long trail runs from Winchester to the coastal town of Eastbourne. It takes you through some of the most beautiful areas of the South Downs National Park - England's newest National Park. The views are stunning as you follow the undulating route through the East Hampshire and Sussex Downs. The trail is open to walkers, cyclists and horse riders.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Near the Devil's Dyke there's a couple of pretty villages with nice pubs to stop off at. Head a short distance west from the hill and you can visit The Shepherd & Dog in the little village of Fulking. The charming pub traces it’s history back to the 14th Century and has a very good menu. There's an outdoor area where you can enjoy fabulous views of the South Downs. It's a great place to relax and enjoy refreshments on a warm summer day. You can find the pub about half a mile north west of the viewpoint at a postcode of BN5 9LU for your sat navs. In Poynings, just to the north, there's another fine option in the shape of the Royal Oak. There's a beautiful garden area here too, with a newly refurbished Barbecue Area to enjoy in the summer. You can find it in the village at a postcode of BN45 7AQ. Bob's Cafe is also in Poynings and a real treat. There's a splendid outdoor area right next to a large field so there are open and expansive views to enjoy here. The friendly cafe has an interesting history and includes a table tennis table, and a long rail to hitch your bicycle (or dog) to. Dogs are allowed in the adjacent room too. You can find it at a postcode of BN45 7AL. The Saltmarsh Cafe & Rooms is located at Exceat in the Seven Sisters Country Park. The delightful cafe is set in a 16th Century farmhouse and includes a pretty courtyard where you can relax on warmer days. The rustic café, kitchen and bar serves a delicious menu with a focus on fresh Sussex produce. Dishes make good use of foraged and seasonal ingredients for a rich and distinctive flavour. Saltmarsh also does high quality accommodation if you'd like to stay in the area. You can find the cafe near the start of the walk in Exceat, on the East Dean Road at postcode BN25 4AD. The village of Plumpton is located near to Lewes and Ditchling Beacon. Here you'll find the worthy Half Moon Inn. The former 19th century coaching house serves high quality food including an excellent Sunday roast. There's ample parking and a lovely garden for summer days. You can find them on Ditchling Road with a postcode of BN7 3AF for your sat navs. They're also dog friendly. In the village you could also visit the 16th century Plumpton Place, Plumpton race course and the noteworthy Plumpton College. This institution farms over 2500 acres of land and has become one of the leading centres for land-based education in the UK. Near Harting Down you can take a small detour to visit the White Hart in the worthy village of South Harting. The village pub has bags of character and a very good menu. Outside there's a delightful garden area where you can relax on a summer day. You can find them at a postcode of GU31 5QB for your sat navs. While in the area it's also worth visiting the National Trust's Uppark. Here you'll find a fine 17th century Georgian House surrounded by lovely gardens with views of the English Channel. The author H.G Wells stayed in the house during the late 19th century. The class divisions he observed here inspired his socialist views which later manifested themselves in work such as 'The Time Machine'."
    }
  ],
  "video_url": "https://www.youtube.com/embed/5pgKuzd0DaQ",
  "district": "Winchester",
  "county": "Hampshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Broadway, The Close, Winchester, Hampshire, England, SO23 9JX, United Kingdom",
  "postcode": "SO23 9JX",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "downland"
  ],
  "points_of_interest": [
    "views"
  ],
  "facilities": [],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling",
    "horse riding"
  ]
}