{
  "created_at": "2025-01-05T22:30:16.512900+00:00",
  "objectID": "e6bef8c8331bcd7578c20d8fd11b0636",
  "ref": "high-cup-nick-walking-route",
  "title": "High Cup Nick Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/High_Cup_Nick_-_geograph.org.uk_-_453812.jpg",
  "nearby": [
    {
      "description": "Cow Green Reservoir and Cauldron Snout",
      "objectID": "fde863f6ed3a3635dbb832514339b716",
      "ref": "cow-green-reservoir-and-cauldron-snout-walking-route"
    },
    {
      "description": "Cross Fell",
      "objectID": "2884d1220bce88b919b7e43d93d769c1",
      "ref": "cross-fell-walk-walking-route"
    },
    {
      "description": "Pennine Way",
      "objectID": "7e1568e78435cb4e0d45bf98831e2524",
      "ref": "pennine-way-walking-route"
    },
    {
      "description": "High Force Waterfall",
      "objectID": "644768ed8d1b4271071b163fa9a9d416",
      "ref": "high-force-waterfall-walking-route"
    },
    {
      "description": "Dufton Pike",
      "objectID": "c00e009dce13aba09dad1764106bde8b",
      "ref": "dufton-pike-walking-route"
    },
    {
      "description": "Murton Pike",
      "objectID": "b60dd4c1c294738a120d652a9ba5ab2d",
      "ref": "murton-pike-walking-route"
    },
    {
      "description": "Mickle Fell",
      "objectID": "1416454f18583601d517239f0c1cce0d",
      "ref": "mickle-fell-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e6bef8c8331bcd7578c20d8fd11b0636.gpx",
  "_geoloc": {
    "lat": 54.6195125417,
    "lng": -2.4800747537
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/High_Cup_Nick_-_geograph.org.uk_-_453812.jpg",
      "title": "John Illingworth / High Cup Nick, via Wikimedia Commons",
      "caption": "This is the actual \"Nick\" but the name is commonly used to refer to the whole of the U-shaped steep valley called High Cup Gill. It is the point where the headwaters of Highcup Gill Beck pass from the relatively flat terrain of High Cup Plain over the lip of High Cup Scar into the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/High_Cup_Nick_-_geograph.org.uk_-_1623863.jpg",
      "title": "Paul Buckingham / High Cup Nick, via Wikimedia Commons",
      "caption": "View of the \"nick\" at the top of the valley where High Cup gill enters the valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/26/Eden_Valley_from_High_Cup_Nick_-_geograph.org.uk_-_103396.jpg",
      "title": "Tim Leete / Eden Valley from High Cup Nick, via Wikimedia Commons",
      "caption": "Eden Valley from High Cup Nick. The Ordnance Survey officially designates the valley as High Cup Gill. However, it is commonly known as High Cup Nick, which more precisely refers to the northeastern extremity where the headwaters of Highcup Gill Beck transition from the relatively flat expanse of High Cup Plain over the edge of High Cup Scar into the valley. The term 'gill' is of Norse origin and denotes a narrow valley or ravine, while 'beck' signifies a stream. Both terms are frequently encountered in the topography of northern England. The breathtaking vista to the southwest over the valley into the Vale of Eden, particularly from its origin at High Cup Nick, is widely regarded as one of the most splendid natural features in the northern regions of England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Nichol%27s_Chair_-_geograph.org.uk_-_453804.jpg",
      "title": "John Illingworth / Nichol's Chair",
      "caption": "Nichol's Chair. High Cup Scar showcases a distinctive geological feature created by a nearly horizontal outcrop of the Whin Sill, a dolerite intrusion from the late Carboniferous era. The Whin Sill underlies extensive areas of the North Pennines and northeastern England. The geological structure is prominently visible along the High Cup Nick, where tumbled blocks of this rock are strewn across the scree slopes below the scar. A noteworthy pinnacle of this rock formation, situated on the northern side of the valley, is referred to as Nichol or Nichol's Chair. The name is derived from a local cobbler who, as part of a bet, practiced his craft while perched on the summit of this pinnacle. This geological wonder not only provides a glimpse into the region's ancient geological history but also holds cultural anecdotes that add to its charm."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Narrow_Gate_%28Path%29_on_the_edge_of_High_Cup_Nick_-_geograph.org.uk_-_3260224.jpg/512px-Narrow_Gate_%28Path%29_on_the_edge_of_High_Cup_Nick_-_geograph.org.uk_-_3260224.jpg",
      "title": "Narrow Gate (Path) on the edge of High Cup Nick by John Sparshatt, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Narrow Gate (Path) on the edge of High Cup Nick. The Pennine Way skirts the valley on its northern side by a traditional route known as 'Narrow Gate' as it runs from Dufton east via Maize Beck and Cauldron Snout to Forest in Teesdale. This national trail briefly splits into two separate routes running on either bank of Maize Beck; it is the southerly of the two which leads via High Cup Nick."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fc/High_Cup_Scar_%2C_Dolerite_Crag_-_geograph.org.uk_-_212282.jpg",
      "title": "Hugh Mortimer / High Cup Scar : Dolerite Crag",
      "caption": "High Cup Scar, Dolerite Crag. Geological Information: High Cup Scar is formed by a near-horizontal outcrop of the Whin Sill, a dolerite intrusion of late Carboniferous age which underlies much of the North Pennines and northeast England. Tumbled blocks of this rock are scattered down the scree slopes beneath the scar. A notable pinnacle of this rock on the northern side of the valley is known as Nichol or Nichol's Chair after a local cobbler who, for a bet, practised his craft perched on its summit."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/Limestone_on_Peeping_Hill_-_geograph.org.uk_-_3614787.jpg",
      "title": "Limestone on Peeping Hill by Karl and Ali, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Limestone on Peeping Hill. The Pennine Way follows the northern fringe of the valley, traversing a traditional route known as Narrow Gate. This section of the national trail commences from Forest in Teesdale, heading west through Cauldron Snout and Maize Beck, eventually reaching Dufton. At Maize Beck, the Pennine Way briefly diverges into two separate routes on opposite banks. The southerly path guides hikers through High Cup Nick, an iconic location listed among the 100 best Pathfinder walks in Britain. High Cup Nick offers a challenging but rewarding trek of approximately 8 miles (13 km), with an elevation gain of 1,445 feet (440 m). This notable trail has gained recognition from renowned fellwalker Alfred Wainwright, who describes High Cup as a \"great moment on the journey\" in his acclaimed work, the Pennine Way Companion. The route combines the physical demands of the terrain with the awe-inspiring natural beauty of the Pennines. The entire expanse of the valley falls within an area designated as open country under the Countryside and Rights of Way Act 2000. Consequently, this grants walkers a general right to roam freely in this region. Specifically, the segment of the Pennine Way that traverses the valley operates as a bridleway, extending its accessibility to cyclists and horse riders in accordance with legal provisions. This multi-use designation enhances the versatility of the trail, accommodating different forms of outdoor recreation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Cairned_path_on_Peeping_hill._-_geograph.org.uk_-_4029333.jpg",
      "title": "Cairned path on Peeping hill. by steven ruffles, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Cairned path on Peeping hill."
    }
  ],
  "distance_km": 14.0,
  "description": "This circular walk explores High Cup Nick, a spectacular glacial valley and one of the major highlights in the North Pennines AONB. The whole of the valley is within an area mapped as open country under the Countryside and Rights of Way Act 2000 hence there is a general right for walkers to roam at will. The section of the Pennine Way running through the area is also a bridleway therefore legally available to cyclists and horseriders too. This 8 mile route begins at the village of Dufton in the Eden Valley and starts by following the Pennine Way to Dod Hill and Peeping Hill. You continue your ascent to High Cup Nick where there is a waterfall and great views of the u-shaped glacial valley, the Eden Valley, Dufton Pike and Murton Pike. You'll also pass Nichol's Chair, a notable pinnacle of this rock on the northern side of the valley. It is named after a local cobbler who, for a bet, practised his craft perched on its summit. The walk then descends through High Cup Gill where you will pass boulder fields on your way to High Cup Gill Beck. You continue along the beck through Middletongue Crag to Harbour Flatt where you join a country lane, taking you back to Dufton. This is a special place with some spectacular geological wonders to enjoy. It is quite a steep and challenging climb but the footpaths are generally good for most of the walk. An alternative route starts from Cow Green Reservoir, approaching High Cup from the east and following the Pennine Way to the summit. If you would like to continue your walk you could head to the nearby Cow Green Reservoir and visit the wonderful Cauldron Snout waterfall. The circular High Force Waterfall Walk is another major highlight of the area. You could also head to Cross Fell for more wonderful views of the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the Stag Inn in Dufton for some well earned refreshments (Postcode:CA16 6DB). The rustic country inn was built in 1703 and includes solid oak beams. It's in a lovely spot overlooking the village green and is very walker friendly. There's a good menu and accommodation is also available if you need to stay over.  Pictured above, the pretty village green in Dufton and the Stag Inn which sits on the edge of the green."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The area is great for dog walking and the Stag Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Dufton village is an interesting place for a stroll too. Houses in the village were built from the 17th century onwards and it has changed little over the last 100 years. Dufton Pike rises above the village and is another popular walk in the area. You can climb to the pike on a circular walk by using trails heading north from the village and using part of the Pennine Way National Trail.  Pictured above is Dufton Pike which is another worthy walk from the village. Rising to a height of 481 m (1,578 ft) it offers more fabulous views over the area. To the south is Murton Pike. The fell can be climbed from the Murton Fell car park in the little village of Murton. It is often climbed in conjunction with High Cup Nick. Just to the east you can try the climb to Mickle Fell. The fell is significant as being the highest point within the historic county of Yorkshire and the highest point within County Durham. Cycling Information:The Pennine Way passes through the area. The bridleway is suitable for cyclists. The Pennine Cycleway also passes through nearby Dufton. For more walking ideas in the area see the County Durham Walks and North Pennines Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sl0nizrg2t8?start=46",
  "postcode": "CA16 6DD",
  "district": "Dufton",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Dufton with Knock Methodist Church, The Ride, Dufton, Westmorland and Furness, England, CA16 6DD, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "mountain",
    "valley"
  ],
  "points_of_interest": [
    "viewpoints",
    "geological wonders"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking",
    "cycling",
    "horse riding"
  ]
}