{
    "created_at": "2025-01-06T01:12:20.468733+00:00",
    "objectID": "e6e90f451024a3aa5e6fa3745e7e9767",
    "ref": "broughton-in-furness-walking-route",
    "title": "Broughton in Furness Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Broughton-in-Furness_-_geograph.org.uk_-_1867282.jpg",
    "nearby": [
        {
            "description": "Cumbria Coastal Way",
            "objectID": "2fcd19e1d9c4bc3c8a117c9c237af3f5",
            "ref": "cumbria-coastal-way-walking-route"
        },
        {
            "description": "Sandscale Haws National Nature Reserve",
            "objectID": "3873af260fef50f26462e6845e5b9190",
            "ref": "sandscale-haws-national-nature-reserve-walking-route"
        },
        {
            "description": "Coniston Water",
            "objectID": "8ff1601a87dc5e5765d676448785d23a",
            "ref": "coniston-water-walking-and-cycle-route"
        },
        {
            "description": "Ulverston Canal",
            "objectID": "5fa6be28cae962cb5d46d96eef1bb31f",
            "ref": "ulverston-canal-walking-route"
        },
        {
            "description": "Ulverston Lighthouse",
            "objectID": "fef29769633a7e49e2e536fe3ccde5ea",
            "ref": "ulverston-lighthouse-walking-route"
        },
        {
            "description": "Barrow in Furness",
            "objectID": "910a27bf9b68227c0ad701ff409c32a2",
            "ref": "barrow-in-furness-walking-route"
        },
        {
            "description": "Swinside Stone Circle",
            "objectID": "0c5904841f1a121389ce56cfdd5a03b6",
            "ref": "swinside-stone-circle-walking-route"
        },
        {
            "description": "Dalton-in-Furness",
            "objectID": "6cce67a87cca8a6bbaef15c99399ab75",
            "ref": "dalton-in-furness-walking-route"
        }
    ],
    "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e6e90f451024a3aa5e6fa3745e7e9767.gpx",
    "_geoloc": {
        "lat": 54.2773898756,
        "lng": -3.21128091
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Broughton-in-Furness_-_geograph.org.uk_-_1867282.jpg",
            "title": "Rob Noble / Broughton-in-Furness, via Wikimedia Commons",
            "caption": "Broughton-in-Furness. From the Cumbria Coastal Way on the track to Eccle Riggs"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/0/0e/The_Square%2C_Broughton-in-Furness_-_geograph.org.uk_-_51180.jpg",
            "title": "Humphrey Bolton / The Square, Broughton-in-Furness, via Wikimedia Commons",
            "caption": "The Square, Broughton-in-Furness. Before the mid-18C, Broughton-in-Furness was a loose group of buildings strung out along the ancient coastal route, but after seeing in 1760 the new squares then being constructed in London, Gilpin Sawrey, the Lord of the Manor, made his own version. The square is lined by trees and surrounded by 18C buildings in terraces. The Obelisk of 1810 was erected for the Jubilee of George III. There are stone slabs for the display of fish etc in the market (no longer used)."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/e0/The_Town_Hall%2C_Broughton-in-Furness_-_geograph.org.uk_-_51182.jpg",
            "title": "Humphrey Bolton / The Town Hall, Broughton-in-Furness, via Wikimedia Commons",
            "caption": "The Town Hall, Broughton-in-Furness. On the south side of the Square the Town Hall built in 1766, of seven bays originally with open arcading. The building houses the Information Centre and has a clock and a belfry. It is joined to its neighbours andcement rendered like them."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Skellow_Crag_End_near_Foxfield_-_geograph.org.uk_-_1002914.jpg",
            "title": "Raymond Knapman / Skellow Crag End near Foxfield, via Wikimedia Commons",
            "caption": "Skellow Crag End near Foxfield"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Pebbles_on_Duddon_Sands_-_geograph.org.uk_-_849774.jpg",
            "title": "Espresso Addict / Pebbles on Duddon Sands, via Wikimedia Commons",
            "caption": "Pebbles on Duddon Sands Small pebble bank amid the extensive sands of Duddon Sands. The windfarm (centre right) is on Hare Slack Hill (SD2377). The hill (centre left) is the ridge of Bank House Moor, with the television mast at SD239791 just visible"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Duddon_Sands_near_Sandscale_Haws_-_geograph.org.uk_-_849734.jpg",
            "title": "Espresso Addict / Duddon Sands near Sandscale Haws, via Wikimedia Commons",
            "caption": "Duddon Sands near Sandscale Haws. At the high water mark on Duddon Sands."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Pool_near_Sandscale_Haws_-_geograph.org.uk_-_850342.jpg",
            "title": "Espresso Addict / Pool near Sandscale Haws, via Wikimedia Commons",
            "caption": "Pool near Sandscale Haws Small pool fringed with waterlilies in the wet meadow to the south west of the National Trust carpark. It is not marked on the OS 1:25,000 map"
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Sand_dunes_at_Sandscale_Haws_-_geograph.org.uk_-_849938.jpg",
            "title": "Espresso Addict / Sand dunes at Sandscale Haws, via Wikimedia Commons",
            "caption": "Sand dunes at Sandscale Haws Sandscale Haws is a 264 hectare National Nature Reserve managed by the National Trust. Sand dunes, such as these adjacent to Duddon Sands, form a major part of reserve. The northern tip of Walney Island is visible in the distance (right)."
        }
    ],
    "distance_km": 24.0,
    "description": "This small market town lies on the boundary of the Lake District National Park. There's some nice coastal and riverside trails to follow through the surrounding area. This walk takes you along a section of the Cumbria Coastal Way from Broughton in Furness to the Sandscale Haws National Nature Reserve near Dalton-in-Furness. There's lovely views of Duddon Sands and lots of wildlife to look out for on the way. The walk starts in the town where you can pick up the waymarked Cumbria Coastal Way and follow it south to Foxfield on Duddon Sands. The route then follows quiet country lanes to Kirkby-in-Furness, passing Waltham Common on the way. The trail continues south right along Duddon Sands, passing Askham in Furness before coming to Sandscale Haws National Nature Reserve. Here you can explore the sandy estuary of the River Duddon with the backdrop of Lake District mountains. There's an expansive sand dunes and wildlife including Natterjack Toad, Great Crested Newts, wintering wildfowl, Pintail, Red Knot, Curlews and Common Redshank to look out for. After exploring the reserve the route heads back to Askham in Furness where you can catch the train back to Foxfield and then return to Broughton on the same paths. To continue your walking in the area head west from the town to visit the Duddon Mosses Nature Reserve. There's wildlife such as deer, lizards, adders and barn owls to look out for here. You could then head north and explore Dunnerdale and the River Duddon. The village is also located on the edge of the Lake District with the southern end of Coniston Water located just a few miles to the north east. There's some nice waterside trails to try here.",
    "details": [
        {
            "subtitle": "Pubs/Cafes",
            "content": "In the town you could head to the noteworthy Old Kings Head. This historic pub dates back to the 16th century. The fine restaurant is decorated to commemorate Henry’s six wives and boasts original features from when the building was a coach house. There's also a lovely large garden area for warmer days. You can find them on Church Street at postcode LA20 6HJ."
        },
        {
            "subtitle": "Dog Walking",
            "content": "The trails are nice to do with your dog and the Old Kings Head mentioned above is also dog friendly."
        },
        {
            "subtitle": "Further Information and Other Local Ideas",
            "content": "If you head south east you could visit the nearby town of Ulverston and enjoy a waterside walk along the pretty Ulverston Canal. From the canal basin it's a short climb up to the impressive Ulverston Lighthouse or Hoad Monument. There's great views from the top of the hill and the 19th century monument. The distinctive structure commemorates the life and work of Sir John Barrow who was born in Ulverston in 1764. The circular Barrow in Furness Walk also visits the reserve and the historic Furness Abbey. The ruined 12th century abbey is one of the highlights of the area and well worth a visit. On the western side of Barrow there's also Walney Island to explore. The scenic island includes two more nature reserves and the only grey seal colony in Cumbria. You can pick up the long distance Cistercian Way here too. A few miles to the north west you'll find the mysterious Swinside Stone Circle. It's a beautiful, remote spot with the Lake District mountains making a fine backdrop to the ancient stones. For more walking ideas in the area see the Lake District Walks and the Cumbria Walks pages."
        }
    ],
    "video_url": "https://www.youtube.com/embed/lCr8FzpHfvg",
    "postcode": "LA20 6HZ",
    "district": "Broughton in Furness",
    "county": "Westmorland and Furness",
    "region": null,
    "country": "United Kingdom",
    "gazetteer_found": true,
    "nominatim_found": true,
    "display_address": "4, The Square, Boothwaite Nook, Broughton West, Broughton in Furness, Westmorland and Furness, England, LA20 6HZ, United Kingdom",
    "state": "England",
    "llama_cpp": true,
    "estimated_duration": "2-3 hours",
    "difficulty": "moderate",
    "terrain": ["coastal", "riverside", "sand dunes"],
    "points_of_interest": ["nature reserve", "country lane", "wildlife"],
    "facilities": ["visitor center", "car park", "train station"],
    "route_type": "circular",
    "activities": ["walking"]
}
