{
  "created_at": "2025-01-06T01:31:59.209627+00:00",
  "objectID": "e6fb00eb3504bc7a2d3ad46d1d85058a",
  "ref": "caerphilly-mountain-walking-route",
  "title": "Caerphilly Mountain Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Caerphilly_Common_-_geograph.org.uk_-_359761.jpg",
  "nearby": [
    {
      "description": "Glamorgan Ridgeway Walk",
      "objectID": "70fa1ea4568f1b35381d45d56fdd87ab",
      "ref": "glamorgan-ridgeway-walk-walking-route"
    },
    {
      "description": "Taff Ely Ridgeway Walk",
      "objectID": "e00998538767837a6f9e4d7b86a3fd6c",
      "ref": "taff-ely-ridgeway-walk-walking-route"
    },
    {
      "description": "Garth Hill",
      "objectID": "fedd4eecaab443f42ffa0f62b2513220",
      "ref": "garth-hill-walking-route"
    },
    {
      "description": "Taff Trail",
      "objectID": "5b52ff8f712c0b47f969a7f1a8f2906a",
      "ref": "taff-trail-walking-and-cycle-route"
    },
    {
      "description": "Pontypridd",
      "objectID": "bef173622c09cca2e623cdfc34b3a8a3",
      "ref": "pontypridd-walking-route"
    },
    {
      "description": "Rhymney Valley Ridgeway Walk",
      "objectID": "2b2ba05fe6353b9c589064142eedd58d",
      "ref": "rhymney-valley-ridgeway-walk-walking-route"
    },
    {
      "description": "Llantrisant",
      "objectID": "3f225f6bb846986f3875c97315194965",
      "ref": "llantrisant-walking-route"
    },
    {
      "description": "Rudry",
      "objectID": "f287cc3049974fb59a287e54172d8bb3",
      "ref": "rudry-walking-route"
    },
    {
      "description": "Brombil Reservoir",
      "objectID": "2919d3e4d9cfa57185a2703869c774fc",
      "ref": "brombil-reservoir-walking-route"
    },
    {
      "description": "Barry Sidings",
      "objectID": "3296acbfaef6c452dba7af85b20b8496",
      "ref": "barry-sidings-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e6fb00eb3504bc7a2d3ad46d1d85058a.gpx",
  "_geoloc": {
    "lat": 51.5599979103,
    "lng": -3.2195031796
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Caerphilly_Common_-_geograph.org.uk_-_359761.jpg",
      "title": "Peter Wasp / Caerphilly Common",
      "caption": "Caerphilly Common. This path leads up to the common from the B4600, opposite The Mountain View Snack Lodge car park. The walk offers a diverse range of flora and fauna typical of upland heathland and woodland environments. The area is characterised by heather and gorse, which bloom with purple and yellow flowers during late summer, providing essential habitats for various insects. In the woodlands, native tree species such as oak and birch support a variety of birdlife, including species like the great tit and nuthatch. The understorey is often rich with ferns and wildflowers, contributing to the area's biodiversity. The presence of these plant communities supports a range of wildlife, including small mammals and invertebrates, indicative of a healthy ecosystem."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Caerphilly_Mountain_Snack_Bar.jpg",
      "title": "Jaggery / Old and new, Caerphilly Mountain Snack Bar",
      "caption": "Caerphilly Mountain Snack Bar. Situated next to a small car park on the edge of Caerphilly Common. Next to the shack a sign says \"Probably the longest established snack bar in the UK, (Est 1957)\"."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Caerphilly_Mountain_-_geograph.org.uk_-_434346.jpg",
      "title": "Kev Griffin / Caerphilly Mountain",
      "caption": "Caerphilly Mountain. Garth Hill can be seen in the distance. Birdwatchers may observe raptors such as red kites and buzzards soaring above the open areas, taking advantage of the thermals created by the varied terrain. The mosaic of heathland and woodland provides suitable hunting grounds for these birds of prey. Additionally, the area supports populations of butterflies and other pollinators, especially during the warmer months when wildflowers are in bloom. The diversity of habitats within the walk contributes to the richness of species observed."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Plaque_on_Caerphilly_Common_-_geograph.org.uk_-_1767439.jpg",
      "title": "Robin Drayton / Plaque on Caerphilly Common",
      "caption": "Plaque on Caerphilly Common. Looking north-west from the top of Caerphilly Common towards Mynydd Meio. The small stone pillar in the foreground, which is not far from the trig point , carries just a slate tablet that has a verse from the Bible in Welsh and English. The English being \"O Lord, how manifold are thy works! in wisdom hast thou made them all: the earth is full of thy riches. Psalm 104,24\". A similar plaque is located some miles away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Caerphilly_Common_Trig_Point_-_geograph.org.uk_-_1762671.jpg",
      "title": "Robin Drayton / Caerphilly Common Trig Point",
      "caption": "Caerphilly Common Trig Point. Overlooking the town with the castle just visible over the brow of the foreground to the left of the pillar. At the top left of the view the Rhymney Valley goes away into the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Disused_quarry%2C_Caerphilly_Common_-_geograph.org.uk_-_1936375.jpg/512px-Disused_quarry%2C_Caerphilly_Common_-_geograph.org.uk_-_1936375.jpg",
      "title": "Disused quarry, Caerphilly Common by John Lord, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Disused quarry, Caerphilly Common"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/74/Caerphilly_Castle_-_geograph.org.uk_-_372543.jpg",
      "title": "Roger Cornfoot / Caerphilly Castle",
      "caption": "Caerphilly Castle. Viewed over the dammed-up waters of the Nant-y-Glydr river. The medieval castle occupies around 30 acres (12 ha) and is the largest castle in Wales and the second-largest castle in the United Kingdom after Windsor Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Gorsedd_Stones%2C_Caerphilly_-_geograph.org.uk_-_1964716.jpg",
      "title": "Gorsedd Stones, Caerphilly by Robin Drayton, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Gorsedd Stones, in the town. These groups of standing stones are constructed for the National Eisteddfod of Wales. They form an integral part of the druidic Gorsedd ceremonies of the Eisteddfod."
    }
  ],
  "distance_km": 1.0,
  "description": "Enjoy a climb to the summit of Caerphilly Mountain and a walk across Caerphilly Common on this circular route in South Wales. You can park at the Caerphilly Mountain Snack Bar car park on Mountain Road to start your walk. From here you can pick up the tracks to take you to the 271 metres (889 ft) summit where there are fabulous views over the town and Caerphilly Castle. There are a few different paths to choose from. Most of them are good wide trails though they can get muddy in winter. After your walk you can enjoy refreshments at the snack bar. The Taff Ely Ridgeway Walk passes the common so you can pick up this long distance trail to continue your walk. The waymarked trail starts on the common and will take you to Garth Hill, the Ely Valley and the Taff Vale. The Glamorgan Ridgeway Walk also passes the mountain. It's a long distance ridge top walk which takes you to Llantrisant forest and Margam Country Park. The splendid 13th century Caerphilly Castle also has some nice footpaths around the its network of moats and dams. There's also the unusual turquoise coloured Brombil Reservoir on the fringe of the park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Caerphilly Mountain Snack Bar is located right next to the car park at the start/finish of the walk. The snack bar is a bit of landmark of the area, having been established in 1957. It is notable as the oldest independent snack bar still operating in Wales and the UK. The friendly bar has a great menu with delicious burgers and hot dogs at good prices. There's also several tables outside if the weather is good."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The mountain is a popular place for dog walkers so you will probably see other owners on your visit. The snack bar mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Caerphilly head to the nearby Garth Hill. It's located just three miles wesy of the mountain and provides more fine views of the area. The hill is thought to be the inspiration for the fictional one featured in the film 'The Englishman Who Went Up a Hill But Came Down a Mountain' starring Hugh Grant. Also to the west you can pick up the popular Taff Trail. The shared cycling and walking trail runs through the lovely Taff Valley along a disused railway line. The Pontypridd Walk uses part of the Taff Trail and a section of the Rhymney Valley Ridgeway Walk to create a circular walk through the area. It also climbs to Mynydd Meio which is another good climb you can do near Caerphilly. The hill is visible on this walk from the mountain top if you like to the north west. Just to the west of Pontypridd there's Barry Sidings Country Park at Trehafod. There's some popular woodland mountain bike trails and lovely walks along the park's streams and waterfalls. There's also good views of the River Rhonnda at the northern end of the park. If you follow the Ridgeway Walk east you could visit the worthy little village of Rudry. Here you can visit the 13th century church, a fine 400 year old stone pub and enjoy a climb to the viewpoint on Rudry Mountain."
    }
  ],
  "video_url": "https://www.youtube.com/embed/FbRZq3upYMc",
  "postcode": "CF83 1JA",
  "county": "Caerphilly",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Mountain Road, St Martins, Caerphilly, Cymru / Wales, CF83 1JA, United Kingdom",
  "district": "Caerphilly",
  "state": "Cymru / Wales"
}