{
  "created_at": "2025-01-06T10:17:54.652593+00:00",
  "objectID": "e701e5d89353e8dab541f75d358709bb",
  "ref": "swanage-to-corfe-castle-via-ballard-down-and-nine-barrow-down-walking-route",
  "title": "Swanage to Corfe Castle via Ballard Down and Nine Barrow Down Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e8/The_north_groyne_from_Shep%27s_Hollow%2C_Swanage_beach_-_geograph.org.uk_-_1026914.jpg",
  "nearby": [
    {
      "description": "The Hardy Way - Wareham-Corfe Castle-Kimmeridge",
      "objectID": "9d9eaedb227c3b03971547f8e0d2aff1",
      "ref": "the-hardy-way---wareham-corfe-castle-kimmeridge-walking-route"
    },
    {
      "description": "South West Coast Path",
      "objectID": "a9ba86c11db330fedcf3d619315e5c09",
      "ref": "south-west-coast-path-walking-route"
    },
    {
      "description": "Corfe Castle",
      "objectID": "a41a4f07c0e3e0ab6661161546ce00bf",
      "ref": "corfe-castle-walking-route"
    },
    {
      "description": "Purbeck Way",
      "objectID": "4312a61b00a458a6bbd069015ef3baff",
      "ref": "purbeck-way-walking-route"
    },
    {
      "description": "Old Harry Rocks",
      "objectID": "81ed0a247662caab56f014fd2ac0cb92",
      "ref": "old-harry-rocks-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e701e5d89353e8dab541f75d358709bb.gpx",
  "_geoloc": {
    "lat": 50.6101847437,
    "lng": -1.957407078
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/The_north_groyne_from_Shep%27s_Hollow%2C_Swanage_beach_-_geograph.org.uk_-_1026914.jpg",
      "title": "Jim Champion / The north groyne from Shep's Hollow, Swanage beach",
      "caption": "The north groyne from Shep's Hollow, Swanage beach. View down a small gully (called Shep's Hollow) in the cliffs, from the coast path towards the northernmost groyne in Swanage bay. There are steps down to the beach from here. The Isle of Wight is in the far distance, over 17 miles away."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6f/Barrow%2C_obelisk_and_bridleway%2C_Ballard_Down%2C_Purbeck_-_geograph.org.uk_-_262320.jpg",
      "title": "Phil Champion / Barrow, obelisk and bridleway, Ballard Down, Purbeck",
      "caption": "Barrow, obelisk and bridleway, Ballard Down, Purbeck. The obelisk commemorates the provision of a new supply of water for Swanage in 1883. It was taken down in 1941 as it was a landmark of aid to enemy aircraft. When re-erected after the war the bottom section was found to be cracked and was placed at the side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Ballard_Cliff_and_Punfield_Cove_-_geograph.org.uk_-_1025791.jpg",
      "title": "Jim Champion / Ballard Cliff and Punfield Cove",
      "caption": "Ballard Cliff and Punfield Cove. Looking along Ballard Cliff from the coast path up to Ballard Down from Swanage. The cliff is the southern side of the great chalk ridge that runs down the spine of the Isle of Purbeck, ending in the east at Ballard Point. The chalk continues at the Needles at the western tip of the Isle of Wight, just visible on the horizon. In the foreground the vegetated slumped cliff is part of the Wealden formation (sands and clays). The beach below is at the northern end of Swanage Bay, sometimes referred to as Punfield Cove."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/02/Ulwell_Gap_-_geograph.org.uk_-_1026533.jpg",
      "title": "Jim Champion / Ulwell Gap",
      "caption": "Ulwell Gap. The Ulwell gap in the Purbeck Hills chalk ridge follows a north-west to south-east line. On the left is Giant's Grave Bottom and Forked Down End. On the other side of the gap is the west end of Ballard Down. This view is from the Purbeck Way bridleway near Round Down."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Bridleway_ascending_Godlingston_Hill_-_geograph.org.uk_-_1026497.jpg",
      "title": "Jim Champion / Bridleway ascending Godlingston Hill",
      "caption": "Bridleway ascending Godlingston Hill. The bridleway ascends Godlingston Hill around its south side, up to the route along the top of the Purbeck chalk ridge. The dark sky indicates that rain is on the way from the west."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3e/Round_barrows_on_Nine_Barrow_Down_-_geograph.org.uk_-_1026382.jpg",
      "title": "Jim Champion / Round barrows on Nine Barrow Down",
      "caption": "Round barrows on Nine Barrow Down. Two of the larger prehistoric bowl barrows in the Nine Barrow Down barrow cemetery on Ailwood Down. The many barrows (probably twice as many as the name suggests) are clustered along the spine of the Purbeck chalk ridge. There is an earlier neolithic long barrow alongside the bronze-age barrows, beneath the feet of the photographer."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Fenced_bridleway_on_Nine_Barrow_Down_-_geograph.org.uk_-_1026425.jpg",
      "title": "Jim Champion / Fenced bridleway on Nine Barrow Down",
      "caption": "Fenced bridleway on Nine Barrow Down. The track between the fences is a public bridleway, and also the route of the Purbeck Way trail. The (more than) Nine Barrows are on the next rise in the ridgeway. The ruined keep of Corfe Castle can just be made out in the distance, with the chalk ridge continuing on to the western end of the Isle of Purbeck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Corfe_Castle_from_East_Hill_-_geograph.org.uk_-_1025756.jpg",
      "title": "Jim Champion / Corfe Castle from East Hill",
      "caption": "Corfe Castle from East Hill. View towards the castle from the top of the steps up East Hill. The castle is built on Castle Hill which dominates a gap in the chalk ridge of the Purbeck Hills."
    }
  ],
  "distance_km": 13.0,
  "description": "Walk from the coastal seaside resort of Swanage to the village of Corfe Castle on this splendid hill top route in Dorset. This is a popular walk of about 8.5 miles which can be done in a day. It crosses the two well known local hills of Ballard Down and Nine Barrow Down with fabulous panoramic views to enjoy. Busses run regularly between Swanage and Corfe Castle so you can do the walk and then get the bus back. You could also return via the Swanage steam railway. The walk starts on the front in Swanage close to the town centre. You then follow a section of the South West Coast Path up to Ballard Point. You then follow the Purbeck Way west to Studland Hill and Ballard Down. From the elevated position on the down there are splendid views of Old Harry Rocks, Studland, Poole Harbour, the Isle of Wight and Swanage. In the summer there are lots of wildflowers with the Adonis Blue butterfly to look out for. The area is also popular with mountain bikers as the grassy hills are great to ride down. After climbing across the down you descend towards Ulwell before climbing towards Godslington Hill and Nine Barrow Down. The down reaches a height of 199 m (653 ft) with fabulous views towards Corfe Castle. The final section is a lovely descent into Corfe Castle, passing Brenscombe Hill, Rollington Hill and Challow Hill. Here you can enjoy refreshments and explore the fascinating ruins of the 11th century castle.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/ci0G4im9aSY",
  "postcode": "BH19 1LB",
  "district": "Swanage",
  "county": "Dorset",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Swanage, Dorset, England, BH19 1LB, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "hill",
    "coastal"
  ],
  "points_of_interest": [
    "viewpoints",
    "historical sites"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "pub/cafe",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "cycling"
  ]
}