{
  "created_at": "2025-01-06T04:37:52.898399+00:00",
  "objectID": "e78bdc3cef06ccfa855e6be844911f41",
  "ref": "ware-walking-route",
  "title": "Ware Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5f/View_of_the_River_Lea_-_geograph.org.uk_-_1760799.jpg",
  "nearby": [
    {
      "description": "Lea Valley Walk",
      "objectID": "af6db7140df05d5e84b785fb63202b0d",
      "ref": "lea-valley-walk-walking-route"
    },
    {
      "description": "Stort Valley Way",
      "objectID": "7c463aaabbb555a51b71ce119468360f",
      "ref": "stort-valley-way-walking-route"
    },
    {
      "description": "Harcamlow Way",
      "objectID": "bb6518acb599bd810287707809e3ef55",
      "ref": "harcamlow-way-walking-route"
    },
    {
      "description": "New River Path",
      "objectID": "6588b9959201d98e256c3f9b7ba0c66a",
      "ref": "new-river-path-walking-route"
    },
    {
      "description": "Forty Hall",
      "objectID": "075884050441f8e64c6d9acc64de1d64",
      "ref": "forty-hall-walking-route"
    },
    {
      "description": "Enfield",
      "objectID": "13baca9cfcce8f494dc698c77578e4f4",
      "ref": "enfield-walking-route"
    },
    {
      "description": "Amwell Nature Reserve",
      "objectID": "275d467145b196b8613ea566ebb8aab9",
      "ref": "amwell-nature-reserve-walking-route"
    },
    {
      "description": "Stanstead Abbotts",
      "objectID": "e69648c00840a7be2813f2278400e584",
      "ref": "stanstead-abbotts-walking-route"
    },
    {
      "description": "Hertford Heath",
      "objectID": "eb1a63163d4b71a9acc400408f0c3e0c",
      "ref": "hertford-heath-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e78bdc3cef06ccfa855e6be844911f41.gpx",
  "_geoloc": {
    "lat": 51.9071791039,
    "lng": -0.4584443446
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/View_of_the_River_Lea_-_geograph.org.uk_-_1760799.jpg",
      "title": "roger geach / View of the River Lea",
      "caption": "View of the River Lea. Taken from the road bridge at Amwell End Ware looking towards Hertford."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/97/The_New_River%2C_Ware_-_geograph.org.uk_-_189974.jpg",
      "title": "Nigel Cox / The New River, Ware",
      "caption": "The New River, Ware. The New River is something of a misnomer since it is neither a river nor new. It is an aqueduct built under the direction of Sir Hugh Myddleton between 1607 and 1612 to bring fresh drinking water from Chadwell and Amwell Springs near Ware about 40 miles down the Lee Valley to London. It is seen here with London Road beyond the railings to the left."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Ware_High_Street_-_geograph.org.uk_-_1760826.jpg/512px-Ware_High_Street_-_geograph.org.uk_-_1760826.jpg",
      "title": "roger geach / Ware High Street",
      "caption": "Ware High Street. A view of the High Street and Town Hall in the centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/28/Stanstead_Mill_Stream_at_Amwell_Magna_-_geograph.org.uk_-_277288.jpg",
      "title": "David Leeming / Stanstead Mill Stream at Amwell Magna",
      "caption": "Stanstead Mill Stream at Amwell Magna near the Amwell Nature Reserve. Away from the Lee Navigation the River Lea is more natural. This shows the Stanstead Mill Stream soon after it splits from the River Lea at a weir within the Amwell Magna Fishery near the Amwell Quarry. It rejoins the Lea Navigation in the navigable waters below Stanstead Abbots. The reserve is a great place near Ware for an easy peaceful stroll coupled with some birdwatching."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/River_Lea_Amwell.JPG",
      "title": "David Leeming, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Lee at Amwell. View from footbridge over River Lee that leads to Amwell Quarry. Hollcross lake (water-filled gravel workings) can be seen to the left of the river, beyond the wide margins of wetland vegetation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/56/River_Lea_Navigation_above_Stanstead_Lock_-_geograph.org.uk_-_1330528.jpg",
      "title": "Stephen Craven / River Lea Navigation above Stanstead Lock",
      "caption": "River Lea Navigation above Stanstead Lock. There's an unusual swing bridge over the lock which merits its own mention on the OS 1:25,000 scale mapping."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bd/The_Rye_House_public_house%2C_Rye_House%2C_Rye_Road_-_geograph.org.uk_-_106446.jpg",
      "title": "Christine Matthews / The Rye House public house, Rye House, Rye Road",
      "caption": "The Rye House public house, Hoddesdon. The riverside pub is a nice place to stop for refreshment on the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Lockkeeper%27s_cottage_at_Brick_Lock_-_geograph.org.uk_-_1377068.jpg",
      "title": "Mike W Hallett / Lockkeeper's cottage at Brick Lock",
      "caption": "Lockkeeper's cottage at Brick Lock at Roydon Mill Marina. An attractive cottage by Brick Lock on the Stort Navigation"
    }
  ],
  "distance_km": 17.5,
  "description": "This Hertfordshire based town has two rivers to explore and a fine local nature reserve to visit. This route from the town uses sections of the Lea Valley Walk, the Stort Valley Way and the Harcamlow Way to create a circular walk around the town. On the way there's long riverside sections, a nature reserve, woodland trails and country paths to enjoy. The walk starts on the bridge in Ware, just a short distance north of the train station. From here you can pick up the Lea Valley Walk and follow the waymarked footpath south east towards Stanstead Abbotts where there is a noteworthy 16th century pub. Here you'll pass the Amwell Nature Reserve. The reserve is a great place for wildlife with lots of wintering wildfowl to look out for on the two pretty lakes. The Rye Meads RSPB reserve is also located near here. The route continues south towards Hoddesdon where you pick up the Stort Valley Way. You follow the river path north east towards Roydon where you pick up the Harcamlow Way. This trail will take you north through the countryside towards Hunsdonbury. The route then turns north east, passing pockets of woodland before returning to Ware.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Ware the Waterside Inn is in a lovely spot. They have a garden area overlooking the river. You can find them near the start of the walk at postcode SG12 9DW. On the route you could stop off at the Rye House in Hoddesdon. The pub is in a great place right next to the river. You can sit outside in the lovely garden and enjoy views across the water with your meal. The pub can be foudn on Rye Rd with a postcode of EN11 0EH for your sat navs. Built in 1538 the historic Red Lion pub is one of the oldest buildings in the area and the second oldest in neighbouring Stanstead Abbotts. It started life as a monastery, then a coaching inn and was renovated in 2005 to help reinstate the character of the pub. They serve good quality food and gave a garden area. You can find them on the High Street at postcode SG12 8AA. The pub is dog friendly."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and country trails make for a good dog walk and the two pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Running Parallel to the River Lea is the New River Path. You could follow the man made river south to visit Cheshunt and the historic Forty Hall in Enfield. For more walking ideas in the area see the Hertfordshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/dc4eZm8WMHc",
  "postcode": "LU3 2AN",
  "district": "Luton",
  "county": "Luton",
  "region": "Eastern",
  "country": "England",
  "gazetteer_found": true
}