{
  "created_at": "2025-01-06T00:10:17.813070+00:00",
  "objectID": "e795de8aa071f85c51e0055059327504",
  "ref": "circular-walk-from-rosthwaite-walking-route",
  "title": "Circular Walk from Rosthwaite Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/46/The_Royal_Oak%2C_Rosthwaite_-_geograph.org.uk_-_555735.jpg",
  "nearby": [
    {
      "description": "Borrowdale",
      "objectID": "30459903103ffc9158473880383cb5e0",
      "ref": "borrowdale-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Allerdale Ramble",
      "objectID": "641f71c34743ce206179b03c5da3b722",
      "ref": "allerdale-ramble-walking-route"
    },
    {
      "description": "Cumbria Way",
      "objectID": "6612801969693acf2f01237cbb628a00",
      "ref": "cumbria-way-walking-route"
    },
    {
      "description": "Allerdale Ramble",
      "objectID": "641f71c34743ce206179b03c5da3b722",
      "ref": "allerdale-ramble-walking-route"
    },
    {
      "description": "Langstrath Valley",
      "objectID": "930ffa1eadeb1504486f96fd3f8957dd",
      "ref": "langstrath-valley-walking-route"
    },
    {
      "description": "Bowder Stone",
      "objectID": "45a2169e64564b789686419fe12f5895",
      "ref": "bowder-stone-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e795de8aa071f85c51e0055059327504.gpx",
  "_geoloc": {
    "lat": 54.5234351363,
    "lng": -3.1513498834
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/The_Royal_Oak%2C_Rosthwaite_-_geograph.org.uk_-_555735.jpg",
      "title": "Alexander P Kapp / The Royal Oak, Rosthwaite, via Wikimedia Commons",
      "caption": "The Royal Oak, Rosthwaite"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Borrowdale_-_Rosthwaite.jpg",
      "title": "Steve Mason / Rosthwaite and Borrowdale Valley, via Wikimedia Commons",
      "caption": "Rosthwaite and Borrowdale Valley"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Watendlath_-_geograph.org.uk_-_1734918.jpg/512px-Watendlath_-_geograph.org.uk_-_1734918.jpg",
      "title": "Bill Boaden / Watendlath, via Wikimedia Commons",
      "caption": "Watendlath. This view of the hamlet and tarn opens up on the path from Thirlmere where the hillside becomes steeper."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/27/Dock_Tarn_-_geograph.org.uk_-_1539826.jpg",
      "title": "K A / Dock Tarn, via Wikimedia Commons",
      "caption": "Dock Tarn. A photograph taken in high summer with water lilies in bloom"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Croft_cottage.jpg/512px-Croft_cottage.jpg",
      "title": "Victuallers [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "Croft cottage to left and Croft Farmhouse to right in Stonethwaite Borrowdale Cumbria"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Stonethwaite_Beck_-_geograph.org.uk_-_475026.jpg",
      "title": "Michael Graham / Stonethwaite Beck, via Wikimedia Commons",
      "caption": "Stonethwaite Beck. A large loop in the beck. An old tree sits in mid stream noting the former position of the bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/B5289_through_Rosthwaite_Borrowdale_Cumbria.jpg/512px-B5289_through_Rosthwaite_Borrowdale_Cumbria.jpg",
      "title": "Henry Mayson (1845-1921) biog [Public domain], via Wikimedia Commons",
      "caption": "B5289 through Rosthwaite Borrowdale Cumbria. This road through the village was to become the B5289. To the extreme right is the edge of the now Royal Oak Hotel. The glass plate photographer was Henry Mayson, who was born in Keswick and who set up a photographic studio there in the 1880s, producing postcards under the 'Mayson Series'. His work concerned the landscape and people of the Lake District."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Grange_MMB_01_Stonethwaite_Beck.jpg/512px-Grange_MMB_01_Stonethwaite_Beck.jpg",
      "title": "mattbuck (category) [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Stonethwaite Beck"
    }
  ],
  "distance_km": 7.0,
  "description": "This varied circular walk from Rosthwaite includes hill climbs, woodland paths, two beautiful tarns and nice riverside trails. The village is located in the popular Borrowdale area of the Lake District which is well known for its beautiful scenery. You can start the walk from the National Trsut run car park, located a few miles south of Derwent Water. From here you can pick up trails climbing north east to Watendlath Tarn. It's a lovely, peaceful spot with the adjacent hamlet of Watendlath worth exploring too. It includes an old packhorse bridge, and a National Trust tea-room, where you can sit outside and enjoy the wonderful views. From the tarn you can pick up a footpath heading south to Dock Tarn and Stonethwaite Fell. The route then picks up another waterside path heading north along the pretty Stonethwaite Beck. This will lead you back into Rosthwaite where the route finishes. After your exercise you can enjoy refreshments at the 18th century Royal Oak Hotel which is very walker friendly. The section along the Stonethwaite Beck passes along the Cumbria Way long distance footpath. You could extend your walking in the area by picking up the waymarked trail and following it south along the Langstrath Beck toward Langdale Fell. Our Langstrath Valley Walk follows the beck where you can see lots of pretty waterfalls dotted along the route. The Allerdale Ramble also passes through the area and is another good option.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Glaramara House hotel in nearby Seatoller is in a stunning location. There's wonderful views of the Borrowdale Fells from the lovely outdoor seating area in the spacious grounds. It's the perfect place to relax after a long walk on a warm day. Indoors there's a cosy resident’s lounge with a log fire and a spacious bar. They do very good food and also provide top quality accommodation if you need to stay over. You can find the hotel just to the east of the National trust car park on the Honister Pass at postcode CA12 5XQ. From here you can also enjoy a climb to Thornythwaite Fell and Glaramara mountain. The Borrowdale Gates Hotel is located in Grange, just over a mile north from the village. You can reach it on foot by following the Allerdale Ramble along the river. The hotel is in a lovely spot and includes a terrace and some pretty gardens with fine views of the surrounding fells. During the colder months, open log fires are lit in the lounges all day, providing warmth and cosiness for reading and drinks. The restaurant is open to non residents and includes panoramic windows offering captivating fell views to complement the imaginative menu. It's a fine place to enjoy a meal and then stroll around the pretty gardens surrounding the hotel. You can find the Borrowdale Gates in Grange at postcode CA12 5UQ. The hotel is located very close to two other walking highlights of the area. A short stroll south will take you to the Bowder Stone. The giant stone stands at a height of about 30 feet (9.1 m) high and weighs around 2000 tons. There is a 19th century staircase which you can climb to the top. Also nearby is Castle Crag, a popular local climb which offers more fine views over Borrowdale from the summit."
    }
  ],
  "video_url": "https://www.youtube.com/embed/UC0XiWw4FhU",
  "county": "Cumberland",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Nook Farm, Howe Lane, Longthwaite, Rosthwaite, Borrowdale, Cumberland, England, CA12 5XB, United Kingdom",
  "postcode": "CA12 5XB",
  "district": "Rosthwaite",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "mountain",
    "water"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "hamlets"
  ],
  "facilities": [
    "car park",
    "tea-room",
    "pub/cafe",
    "dog friendly",
    "long distance footpath"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}