{
  "created_at": "2025-01-06T02:06:31.362424+00:00",
  "objectID": "e79dcaf67f3b60e992167f245e82f004",
  "ref": "fingest-walking-route",
  "title": "Fingest Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg/512px-Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg",
  "nearby": [
    {
      "description": "Greys Court",
      "objectID": "6fb0052a2cc6fded72e93b6edb73af8d",
      "ref": "greys-court-walking-route"
    },
    {
      "description": "Henley via Stonor Circular Walk",
      "objectID": "421241c3a1cd673032f7fafe6e53c59d",
      "ref": "henley-via-stonor-circular-walk-walking-route"
    },
    {
      "description": "Henley-on-Thames",
      "objectID": "1eac7070841f7d942a8b4926e27a159a",
      "ref": "henley-on-thames-walking-route"
    },
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Turville",
      "objectID": "253fdfe3b7750094eec6aca59b6682a2",
      "ref": "turville-walking-route"
    },
    {
      "description": "Ibstone",
      "objectID": "3c9dfc3d33d1b82413c840b20714af34",
      "ref": "ibstone-walking-route"
    },
    {
      "description": "Frieth",
      "objectID": "3e902389bf74e8cbc004f9c801b3193c",
      "ref": "frieth-walking-route"
    },
    {
      "description": "Hambleden",
      "objectID": "4b5c3bb33bebfd08731a3aec713541b3",
      "ref": "hambleden-walking-route"
    },
    {
      "description": "Skirmett",
      "objectID": "cb46579f3d5d6e613196b908136e30b8",
      "ref": "skirmett-walking-route"
    },
    {
      "description": "Lane End",
      "objectID": "67ad1a511819137e68100b8d32774807",
      "ref": "lane-end-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e79dcaf67f3b60e992167f245e82f004.gpx",
  "_geoloc": {
    "lat": 51.6130943024,
    "lng": -0.8789544127
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg/512px-Fingest%2C_Buckinghamshire-geograph-3452617-by-Michael-Trolove.jpg",
      "title": "Michael Trolove / Fingest Village",
      "caption": "View of Fingest Village. Turville Hill and Windmill is above and beyond the village. This view can be seen at the beginning of the Agatha Christie's Marple (TV series) episode \"Endless Night\" (2013)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Pastures%2C_Fingest_-_geograph.org.uk_-_992952.jpg",
      "title": "Andrew Smith / Pastures, Fingest",
      "caption": "Fingest Fog had lifted to reveal a hazy view over the rolling landscape between Cadmore End and the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/St_Bartholomew%27s%2C_Fingest_-_geograph.org.uk_-_988481.jpg",
      "title": "Andrew Smith / St Bartholomew's, Fingest",
      "caption": "St Bartholomew's, Fingest. The nave and tower are 12th century with the saddleback roof added to the tower in the 18th or early 19th century. The roof is notable as being one of only two such designs in England. The chancel was added in the 13th century. There is also a wedding custom in Fingest that the groom must lift the bride over the church gate when leaving the church after the wedding ceremony."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/Cottages_in_Fingest_-_geograph.org.uk_-_242371.jpg",
      "title": "Peter Jemmett / Cottages in Fingest",
      "caption": "Cottages in Fingest"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Turville_-_geograph.org.uk_-_9553.jpg",
      "title": "Brendan and Ruth McCartney / Turville",
      "caption": "Turville. The windmill on the hill overlooking Turville in the east of the square. The name 'Turville' is Anglo-Saxon in origin and means 'dry field'. The pretty village has been used as a filming location for many tv dramas including Midsomer Murders, Lewis, Marple, Foyle's War and the 2008 Christmas special of Jonathan Creek. It was also used in the Dawn French sitcom The Vicar of Dibley. In the series, the church of St Mary the Virgin was renamed \"St Barnabus\". The village church is well worth some investigation as it dates back to the 12th century with the nave being the oldest surviving part."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Southend_-_geograph.org.uk_-_39058.jpg",
      "title": "David Hawgood / Southend",
      "caption": "Southend. The green here with post box and notice board is the centre of a small scattered village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Hambleden_Valley_-_geograph.org.uk_-_722046.jpg",
      "title": "Andrew Smith / Hambleden Valley",
      "caption": "Hambleden Valley. A view over arable land and pasture towards the village from the hillside below North Cot Wood. The village name is Anglo Saxon in origin, and means 'crooked or irregularly-shaped hill'. The village includes a lovely mill, lock and weir. These feature in Jerome K. Jerome's novel Three Men In A Boat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Village_House%2C_Pheasant%27s_Hill%2C_Buckinghamshire-geograph-4431165-by-Oswald-Bertram.jpg/512px-Village_House%2C_Pheasant%27s_Hill%2C_Buckinghamshire-geograph-4431165-by-Oswald-Bertram.jpg",
      "title": "Oswald Bertram / Village House, Pheasant's Hill, Buckinghamshire",
      "caption": "Village House, Pheasant's Hill"
    }
  ],
  "distance_km": 14.5,
  "description": "This pretty little Buckinghamshire village is located in the Chilterns near Henley on Thames. It's a picture postcard place with a number of medieval and Georgian cottages scattered around a very fine old church. The village's name comes from the Anglo Saxon 'Tinghurst', meaning 'wooded hill where assemblies are made'. This circular walk uses sections of the Chiltern Way to take you on a tour of the area surrounding the village. There's visits to a number of nearby villages and some small hill climbs with fine views over the Hambleden Valley. The walk may seem familiar as the scenic nature of the area has lead to it being used as a film location on several occasions. The walk starts in Fingest and first heads west to Turville Hill and the neighbouring village of Turville. It's another pretty little place with a 12th century church and the noteworthy Cobstone Windmill. Often referred to as the Chitty Chitty Bang Bang Windmill as it was used in a scene in the 1967 film, having been cosmetically restored for filming. The route then heads south west to Dolesden and Southend before turning south east to Gussetts Wood and Upper Woodead Farm. Near here a woodland section begins taking you to Hambleden. There are a number of picturesque brick and flint cottages and a 14th century church here. The Elizabethan manor house opposite the church dates from 1603 and was the former home of Lord Cardigan who led the ill-fated Charge of the Light Brigade. At Hambleden the route turns north to Pheasant's Hill and Skirmett before passing through Adam's Wood and Fingest Wood and returning to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Chequers is a fine village inn where you can enjoy some well earned refreshments after your walk. The pub is in a lovely location just opposite the picturesque church. It's set in an attractive 18th century brick and flint building with a splendid 2 acre garden outside. The pub is also notable for featuring in the 2014 George Clooney film 'Monuments Men' set during World War II. At the time the village was transformed into a Normandy-like appearance. You may also recognise the pub and village from episodes of the popualar Midsomer Murders series on ITV. You can easily find them in the heart of the village at a postcode of RG96QD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails and woodland paths around the village are ideal for a dog walk. The Chequers pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west of the village you can pick up the Henley via Stonor Circular Walk. This takes you from the popular riverside town of Henley-on-Thames to the scenic deer park in Stonor. On the way you also visit the historic Greys Court owned by the National Trust. Also in Henley you can pick up the epic Thames Path National Trail and enjoy a walk along the lovely riverside path. Just to the north is the village of Ibstone where you can enjoy a walk along the boundary of the Wormsley Estate. The 16th century estate is well known for its cricket ground and is also a good place to look out for red kites. For more walking ideas in the area see the Chilterns Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/T6Eb3haScXg",
  "postcode": "RG9 6QD",
  "district": "Fingest",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Chequers, Fingest Lane, Fingest, Hambleden, Buckinghamshire, England, RG9 6QD, United Kingdom",
  "state": "England"
}