{
  "created_at": "2025-01-06T01:59:17.654816+00:00",
  "objectID": "e7cd467bce60066811409e6dc0accda3",
  "ref": "woodchester-park-walking-route",
  "title": "Woodchester Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Path_through_Woodchester_Park_-_geograph.org.uk_-_931897.jpg",
  "nearby": [
    {
      "description": "Coaley Peak",
      "objectID": "3f01bdd8224ef0b4186ee31fc8572fc0",
      "ref": "coaley-peak-walking-route"
    },
    {
      "description": "Rodborough Common",
      "objectID": "dade778dcb7e6a2d03a842a75abc5023",
      "ref": "rodborough-common-walking-route"
    },
    {
      "description": "Cotswold Way",
      "objectID": "506730377bbdf50f447d2f9343dd3402",
      "ref": "cotswold-way-walking-route"
    },
    {
      "description": "Haresfield Beacon",
      "objectID": "bde0157eebb832e6a4d56affd83e2853",
      "ref": "haresfield-beacon-walking-and-cycle-route"
    },
    {
      "description": "Stroud",
      "objectID": "c31e845a6332436c2fb0c0ed71482064",
      "ref": "stroud-walking-route"
    },
    {
      "description": "Nailsworth",
      "objectID": "5eaead664f9998a2e83cbf442278b4ae",
      "ref": "nailsworth-walking-route"
    },
    {
      "description": "Dursley",
      "objectID": "b4a5a0d0f6ab6925028c188b823b9332",
      "ref": "dursley-walking-route"
    },
    {
      "description": "Uley Bury",
      "objectID": "a688898a1823fa48ae271bd0b7ab1605",
      "ref": "uley-bury-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e7cd467bce60066811409e6dc0accda3.gpx",
  "_geoloc": {
    "lat": 51.7109322421,
    "lng": -2.2910807734
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/ba/Path_through_Woodchester_Park_-_geograph.org.uk_-_931897.jpg",
      "title": "Brian Robert Marshall / Path through Woodchester Park",
      "caption": "View of one of the peaceful woodland trails in the park. This is facing south-east through the fairly dense woodland north of the ponds. There are several routes through the park. Very pleasant now that the sun has appeared."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Kennel_Pond%2C_Woodchester_Park_-_geograph.org.uk_-_931955.jpg",
      "title": "Brian Robert Marshall / Kennel Pond, Woodchester Park",
      "caption": "Kennel Pond, Woodchester Park. The pond, one of five in the valley, is viewed facing west north west over the parapet of a small causeway. Just visible in the lower left corner is a bridge over the outflow from Kennel Pond into the last pond in the chain, Parkmill Pond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Parkmill_Pond%2C_Woodchester_Park_-_geograph.org.uk_-_1038461.jpg",
      "title": "Philip Halling / Parkmill Pond, Woodchester Park",
      "caption": "Larch trees in autumn colours beside Parkmill Pond in November 2008"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Woodchester_Mansion%2C_Woodchester_Park_-_geograph.org.uk_-_931759.jpg",
      "title": "Brian Robert Marshall / Woodchester Mansion, Woodchester Park",
      "caption": "Woodchester Mansion. In the early 1850s a wealthy and devout client commissioned an unknown architect to produce a unique design where house, monastery and cathedral would become as one. Since 1870 The Mansion has remained frozen in time, one of the most intriguing and beautiful buildings in Britain."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Woodchester_Mansion_gargoyle_detail%2C_Woodchester_Park_-_geograph.org.uk_-_931778.jpg",
      "title": "Brian Robert Marshall / Woodchester Mansion gargoyle detail, Woodchester Park",
      "caption": "This shows the head of a bird of prey gargoyle on the eastern elevation of the never-completed mansion. The lead spout has cleverly been fashioned as the bird's tongue."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d8/Jacob_sheep%2C_The_Mansion%2C_Woodchester_Park_-_geograph.org.uk_-_931869.jpg",
      "title": "Brian Robert Marshall / Jacob sheep, The Mansion, Woodchester Park",
      "caption": "Jacob sheep, The Mansion. Two-horned Jacob sheep taking it easy in the watery afternoon sunshine in a paddock behind the Gothic pile."
    }
  ],
  "distance_km": 6.0,
  "description": "This National Trust owned park in the Cotswolds is the perfect place for a peaceful afternoon stroll. There are miles of easy footpaths taking you through the tranquil wooded valley to the five pretty lakes within the park. The walk also visits the Boat House, built in the early 19th century and the fine Victorian mansion. There's plenty of wildlife in the park too - look out for kingfishers and herons on the ponds and voles and bats in the woodland. The Cotswold Way runs past the park so you could pick up this excellent trail to continue your walk. Also nearby is the town of Nailsworth and the lovely Rodborough Common. The common has miles of good walking trails. It is in an elevated position above Stroud so on a clear day there are far reaching views towards the Forest of Dean and the Welsh hills. Just to the west of the park is the splendid Coaley Peak viewpoint and the adjacent Coaley Woods. Just north of Stroud is Haresfield Beacon with miles of cycling and walking trails.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Fleece on the western side of Rodborough Common is a good choice for some post walk refreshment. The pub is set in a 250 year-old former coaching inn and is walker friendly. There's also a nice outdoor terrace where you can relax during the warmer months. You can find it on Rooksmoor Hill at postcode GL5 5NB. Also consider the Bell Inn in nearby Selsley Common. It's a pub of some note dating from the 16th Century and also grade two listed. The pub can now boast listings in The Good Food Guide, and The Good Pub Guide as well as 2AA rosettes for their food. In the summer months you can sit outside and enjoy fine views of the surrounding countryside. In the winter there's roaring log burners to warm you up after your chilly walk!"
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland make for an excellent walk with your dog. You are advised to please keep them on leads because of the livestock and wildlife in the park. The Old Fleece pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "You can continue your walking in the area by trying the circular Dursley Walk. This climbs to the nature reserve at Cam Peak before visiting the Iron Age Hillfort at Uley Bury. For more walking ideas in the area see the Cotswolds Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ZKfqSciR4Uc",
  "county": "Gloucestershire",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}