{
  "created_at": "2025-01-06T00:04:29.536092+00:00",
  "objectID": "e7d5d940b5ebafa9b63be4b3a8b3092d",
  "ref": "ditchling-beacon-walking-route",
  "title": "Ditchling Beacon Circular Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/57/Ditchling_beacon_-_geograph.org.uk_-_76708.jpg",
  "nearby": [
    {
      "description": "Devils Dyke",
      "objectID": "559c4472c28b81a7e291de92d4226085",
      "ref": "devils-dyke-walking-route"
    },
    {
      "description": "Sussex Border Path",
      "objectID": "4f7a4ec8abc2fadf21d3ae98a91fb943",
      "ref": "sussex-border-path-walking-route"
    },
    {
      "description": "The South Downs Way",
      "objectID": "e61ceb24a28678cb8e0ca7bbd9f413cb",
      "ref": "the-south-downs-way-walking-route"
    },
    {
      "description": "Ditchling Common Country Park",
      "objectID": "f8eb4cd99a3e589b7ded710fd456c07f",
      "ref": "ditchling-common-country-park-walking-and-cycle-route"
    },
    {
      "description": "Plumpton",
      "objectID": "f6e547417bbc0bf8343f73e632f2a95b",
      "ref": "plumpton-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e7d5d940b5ebafa9b63be4b3a8b3092d.gpx",
  "_geoloc": {
    "lat": 50.9230367122,
    "lng": -0.1141984726
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/57/Ditchling_beacon_-_geograph.org.uk_-_76708.jpg",
      "title": "Chris Plunkett [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "A view facing east along the south downs taken from Ditchling beacon. The Beacon served as an Iron Age hill fort, with identifiable ramparts still discernible on its north and east sides. These ramparts, although challenging to traverse due to overgrown vegetation and fences, offer insights into the historical structure. The eastern ramparts enclose a fragment of abandoned chalk heath, gradually succumbing to scrub and overgrown grassland. Positioned strategically for defense, the Beacon commands a vantage point over adjacent sections of the South Downs ridge, particularly the lower terrain to the north, now occupied by the villages and towns of Mid Sussex in the Lower Weald. The fort's defensive features include a single bank and ditch, encompassing an area of around 5.5 hectares (13.6 acres), making it one of the larger camps in Sussex. Limited excavation has taken place at the fort, and the presence of dew ponds, paths, tracks, and historical ploughing activities diminish the likelihood of significant discoveries in the future."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Downland_near_Ditchling_Beacon_-_geograph.org.uk_-_1455918.jpg",
      "title": "Simon Carey / Downland near Ditchling Beacon, via Wikimedia Commons",
      "caption": "Downland near Ditchling Beacon. Looking down an unnamed ridge that stands between Hogtrough and Home Bottoms with the western side of Dencher Bottom visible in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Kite_flying%2C_Ditchling_Beacon_-_geograph.org.uk_-_201488.jpg",
      "title": "Sheila Russell / Kite flying: Ditchling Beacon, via Wikimedia Commons",
      "caption": "Kite flying at the beacon. The Beacon hosts a diverse array of plants, particularly during the summer months. The terrain supports flowers and herbs well-adapted to chalk grassland, including marjoram, thyme, and various orchids, with the common spotted orchid being notably prevalent. The area is a habitat for butterflies, with the Chalkhill Blue being a noteworthy species well-suited to uncultivated chalk downland. Additionally, the slopes attract butterflies such as the Green Hairstreak and Orange Tip. The rich biodiversity of flora and fauna enhances the natural beauty of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/View_NE_from_Ditchling_Beacon_-_geograph.org.uk_-_1771971.jpg/512px-View_NE_from_Ditchling_Beacon_-_geograph.org.uk_-_1771971.jpg",
      "title": "Dave Spicer / View NE from Ditchling Beacon, via Wikimedia Commons",
      "caption": "View NE from Ditchling Beacon. Westmeston village lies in the centre"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/Ditchling_Beacon_Nature_Reserve_-_geograph.org.uk_-_1455948.jpg",
      "title": "Simon Carey / Ditchling Beacon Nature Reserve",
      "caption": "This section is known as Limekiln Scarp which is filled with the remains of former quarries. The footpath that links the South Downs Way with the car park at the crossroads below runs down in the foreground. The scar in the distance has been formed by the removal of vegetation. Wolstonbury Hill can be seen in the distance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Ditchling_from_Ditchling_Beacon_-_geograph.org.uk_-_48438.jpg",
      "title": "Simon Carey / Ditchling from Ditchling Beacon",
      "caption": "A view over Ditchling village from the Beacon. Taken from above the nature reserve looking north towards the village. The junction at the bottom of the hill is where Beacon Road crosses with Underhill Lane. A road traverses from Ditchling, ascending across the northern slope and descending into the northern suburbs of Brighton, offering car parks at both the summit and the northern base. This challenging route is frequently included in various charity, sporting, and other events linking London and Brighton. Notably, it was designated as a climb on the first day of racing in Britain during the 1994 Tour de France, receiving a climb category of 4 from the Tour organizers. Two decades later, in 2014, it formed part of the route for the seventh stage of the Tour of Britain from Camberley to Brighton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/In_the_centre_of_Ditchling_-_geograph.org.uk_-_4595812.jpg/512px-In_the_centre_of_Ditchling_-_geograph.org.uk_-_4595812.jpg",
      "title": "In the centre of Ditchling by Marathon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "In the centre of Ditchling village. Ditchling boasts a rich history that traces its origins to the Anglo-Saxon era, with the village first documented in 765 AD. By the 9th century, it was documented as part of the holdings of King Alfred the Great. When the Domesday Book was compiled in 1086, Ditchling was recognized as a former Royal Manor, under the ownership of William de Warenne. The Domesday Book recorded a substantial presence in Ditchling, with 196 households, marking it as one of the most significant manors in the county at the time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Wings_Place%2C_West_Street%2C_Ditchling_%28NHLE_Code_1043969%29_%28August_2019%29_%281%29.JPG/512px-Wings_Place%2C_West_Street%2C_Ditchling_%28NHLE_Code_1043969%29_%28August_2019%29_%281%29.JPG",
      "title": "Hassocks5489, CC0, via Wikimedia Commons",
      "caption": "Wings Place, West Street. In the subsequent century, ownership of lands in the village changed hands, with a particularly noteworthy event being the bequest of Ditchling Garden Manor to Anne of Cleves as part of her divorce settlement from King Henry VIII in 1541. The residence, presently named 'Wings Place,' stands as an iconic landmark in the village, acclaimed as one of the finest examples of a fully preserved Tudor house in the country."
    }
  ],
  "distance_km": 8.0,
  "description": "Climb to the highest point in East Sussex and enjoy wonderful views of the Weald and the Downs on this circular walk. The lovely chalk grassland of the area is covered with a variety of flowers and plants during the summer months. Look out for marjoram, thyme and different types of orchid with butterflies such as the Chalkhill Blue flying around them. The walk begins in the village of Ditchling just to the north of Ditchling Beacon and follows the Sussex Border Path to Burnhouse Bostall. You then pick up the South Downs Way and head to the beacon passing the Ditchling Beacon Nature Reserve on the way. You then descend to Ditchling following bridleways past Wick Farm and Stoneywish Country Park. If you'd like to continue your walking in the area then you could head west along the The South Downs Way to the beautiful Devils Dyke. The video below shows the area well from about 7:00 minutes on.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in Ditchling village there's a number of good options for refreshments. The Bull is a good choice with a particularly noteworthy outdoor area. Here you'll find a lovely place to relax in with fruit trees, a kitchen garden and an outdoor kitchen where you can watch your food being cooked. If it's a nice sunny day it's the perfect place to enjoy a meal in pleasant surroundings. There's plenty of space with 25 tables with views over the South Downs to enjoy too. You can easily locate the pub on the High Street with a postcode of BN6 8TA for your sat navs.  Pictured above left, the Bull pub. Built around 1563 the inn saw its heyday in the late 18th century when the main London-Brighton coach route ran through the village. Coaches would regularly change their horses before ascending nearby Ditchling Beacon. Located at the crossroads in the centre of the village which still boasts three pubs within staggering distance of each other. On the right is St Margaret's church which is also worth a visit. Located near the pub the church dates from the 12th century."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The beacon is a popular spot for dog walking and the Bull Inn mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route passes the pretty Stoneywish Nature Reserve which is a nice place for a stroll if you have time. The lovely reserve covers 50 acres and includes meadows, wetlands and woodland full of native flowers and home to a wealth of wildlife, in addition to their own resident farm animals. Look out for herons, woodpeckers, little owls, foxes, and deer as you make your way through the reserve. You can find the reserve on the eastern side of the village on Spatham Lane at a postcode of BN6 8XH. You can visit the reserve and the Beacon from the nearby town of Burgess Hill on the Burgess Hill Walk. The walk follows the Sussex Border Path to Ditchling Common Country Park before heading to the beacon.  Head west from the reserve and you can visit Wolstonbury Hill. This area of chalk grassland is covered in lovely wildflowers during the summer months. There also fine views over the Grade II listed Clayton Windmills from here. Pictured above geese and the car park at the Stoneywish Park and Nature Reserve on the route. The Plumpton Walk visits the beacon from the nearby village. The long circular route also visits the 16th century Plumpton Place and Ditchling village. It runs close to Plumpton rail station providing and opportunity to visit the site by public transport. The circular Brighton and Hove Five Peaks Walk starts from Hove Park in Brighton and visits the beacon and 4 of the other prominent peaks in the area. The Hassocks Walk visits the beacon starting from the train station in the nearby village. It's a nice option if you'd like to visit the site by public transport. For more walking ideas in the area see the South Downs Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/y6NJ4SIngWA",
  "postcode": "BN6 8ST",
  "district": "Lewes",
  "county": "East Sussex",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "18, East Gardens, Ditchling, Lewes, East Sussex, England, BN6 8ST, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "chalk grassland",
    "pasture"
  ],
  "points_of_interest": [
    "nature reserve",
    "country park"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}