{
  "objectID": "e814243ec441a4db7bb25fc8c50c4bf4",
  "created_at": "2024-12-18T19:11:52.817689+00:00",
  "ref": "swettenham-walking-route",
  "title": "Swettenham Arms Walks ",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8f/The_Swettenham_Arms_-_geograph.org.uk_-_793150.jpg",
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/2CD05E035DEB91FB8625876B0046CD4A/$FILE/Swettenham.gpx",
  "_geoloc": {
    "lat": 53.2013896347,
    "lng": -2.3002262917
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8f/The_Swettenham_Arms_-_geograph.org.uk_-_793150.jpg",
      "title": "Elliott Simpson / The Swettenham Arms",
      "caption": "The Swettenham Arms. View of the good sized car park at the inn. The Arms is believed to be as old as the church, which is 13th century. It was built as a Nunnery and it was customary for those attending funerals to stay the night here (and this may be why it later became a hotel). The following morning the coffin would be taken to the church through an underground passage which is said to have gone under the car park and to have been blocked up many years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1c/St_Peters_Church%2C_Swettenham_-_geograph.org.uk_-_107246.jpg",
      "title": "Colin Park / St Peters Church, Swettenham",
      "caption": "St Peters Church, Swettenham. It is said that an underground passage links the church with the nearby Swettenham Arms. The latter was once a nunnery."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0c/River_Dane_-_geograph.org.uk_-_1289663.jpg",
      "title": "Dave Dunford / River Dane",
      "caption": "River Dane. Taken looking upstream from the bridge below Swettenham village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/58/Cascade_of_ponds_at_Davenport_Hall_Farm_-_geograph.org.uk_-_1567318.jpg",
      "title": "Stephen Craven / Cascade of ponds at Davenport Hall Farm",
      "caption": "Cascade of ponds at Davenport Hall Farm. The lowest three of a cascade of six ponds on the southern slope of the Dane Valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Brereton_Heath_Lake_-_geograph.org.uk_-_1588994.jpg",
      "title": "Jonathan Kington / Brereton Heath Lake",
      "caption": "Brereton Heath Lake. In 1959 silica sand, which is used extensively in the glass-making industry and for making metal casting moulds, was discovered on this site and a quarry was dug here. This quarry was producing up to 500 tonnes per day until the pure silica ran out in 1972, and the site was abandoned leaving behind a massive hole that eventually filled with water and this lake was formed. The car park and visitor centre can be seen on the far side of the lake. Warning signs exist around the lake and a head-first diver was rendered tetraplegic and without any remedy in the law in the leading legal case of Tomlinson v Congleton Borough Council."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Visitor_Centre_-_geograph.org.uk_-_1361327.jpg",
      "title": "Jonathan Kington / Visitor Centre",
      "caption": "Visitor Centre Brereton Heath"
    }
  ],
  "distance_km": 11.1,
  "description": "This walk starts from the popular Swettenham Arms pub in Cheshire. The 16th century inn is an ideal location, surrounded by some lovely Cheshire countryside. They serve good food and also have a delightful lavender meadow to sit out in. From the inn you can directly pick up the Dane Valley Way and follow the waymarked trail south to visit the nearby Brereton Heath Country Park, crossing the River Dane on the way. There's some nice trails here taking you through peaceful woodland and around a pretty lake. The walk can be extended by continuing along the Dane Valley Way to visit Astbury Mere Country Park in Congleton. The mere is another fine place for waterside walking and only a few miles south east of Swettenham. If you follow the trail west it will take to nearby Holmes Chapel. Just north of the village there's the Swettenham Meadows Nature Reserve on the Swettenham Brook. There's lots of interesting flora and fauna to see in this area. A little further north there's Jodrell Bank where there's a lovely arboretum to explore.",
  "postcode": "CW12 2LF",
  "district": "Swettenham",
  "county": "Cheshire East",
  "region": "North West",
  "country": "England"
}