{
  "created_at": "2025-01-06T18:42:09.009174+00:00",
  "objectID": "e857fa479c59956ac99d87eb84771710",
  "ref": "clare-island-walking-route",
  "title": "Clare Island Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/af/Clare_Abbey_and_church_-_geograph.org.uk_-_965128.jpg?20110222162457",
  "nearby": [
    {
      "description": "Inishbofin",
      "objectID": "160b75a175b0bf5ef71adc42b201c2ea",
      "ref": "inishbofin-walking-route"
    },
    {
      "description": "Clifden Castle",
      "objectID": "e31794d84b09b03a9f04541203ceab06",
      "ref": "clifden-castle-walking-route"
    },
    {
      "description": "Kylemore Abbey",
      "objectID": "e03d92124113671d0b158b22022bce14",
      "ref": "kylemore-abbey-walking-route"
    },
    {
      "description": "Croagh Patrick",
      "objectID": "b02666b8291ead44bc9cba04340a7cd4",
      "ref": "croagh-patrick-walking-route"
    },
    {
      "description": "Lough Lannagh",
      "objectID": "552152e3ff6083e7c88db9c2b8ae8d61",
      "ref": "lough-lannagh-walking-route"
    },
    {
      "description": "Galway",
      "objectID": "64cc89dbb01d337c6cf783af7cd0486c",
      "ref": "galway-walking-route"
    },
    {
      "description": "Oughterard Wind Farm Walk",
      "objectID": "4d3ab97fccf3bcdb088aceebfeb4f8ff",
      "ref": "oughterard-wind-farm-walk-walking-route"
    },
    {
      "description": "Mount Gable",
      "objectID": "cc1c4ea5665ca8e0b76cbb7aed15fadf",
      "ref": "mount-gable-walking-route"
    },
    {
      "description": "Killary Fjord",
      "objectID": "8c96e9e255751c046f0c5c58d39e1614",
      "ref": "killary-fjord-walking-route"
    },
    {
      "description": "Derrigimlagh Bog",
      "objectID": "378fc2761c962a87c04a6bee386bbdec",
      "ref": "derrigimlagh-bog-walking-route"
    },
    {
      "description": "Ballynahinch Castle",
      "objectID": "4681d14413099aee0ce02bbffe1433ee",
      "ref": "ballynahinch-castle-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e857fa479c59956ac99d87eb84771710.gpx",
  "_geoloc": {
    "lat": 53.79975,
    "lng": -9.95055
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/af/Clare_Abbey_and_church_-_geograph.org.uk_-_965128.jpg?20110222162457",
      "title": "Graham Horn / Clare Abbey and church",
      "caption": "Clare Abbey and church. The abbey where Granuaile (Grace O'Malley) is reputed to be buried. There is a tomb inside but no one knows for sure if it is hers. There are also some of the best wall paintings in Ireland in the abbey (no inside photos allowed). The new church is behind. Grace O’Malley, also known as Gráinne Mhaol, was an iconic figure in Irish history, often celebrated as \"The Pirate Queen of Ireland.\" Born around 1530 into the powerful O’Malley clan, which dominated the western coast of Ireland, she was involved in seafaring from a young age. Her family’s wealth and influence were deeply tied to the sea, with their fleet of ships controlling trade routes along the coast. From the age of eleven, Grace O'Malley began her maritime career, engaging in piracy, trade, and political maneuvering. She earned a reputation as a formidable leader, both at sea and on land. Her activities ranged from piracy against English and Spanish ships to defending her family's land and interests against encroaching English forces."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Clare_Island_-_St_Bridget%27s_Abbey_-_geograph.org.uk_-_5221119.jpg/512px-Clare_Island_-_St_Bridget%27s_Abbey_-_geograph.org.uk_-_5221119.jpg?20230806192902",
      "title": "Clare Island - St Bridget's Abbey by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Grace was not just a pirate but also a skilled negotiator and leader. She managed to maintain her territories' independence at a time when much of Ireland was falling under English control. Her influence was so significant that she eventually met with Queen Elizabeth I in 1593, negotiating terms for her and her family's future. Despite their very different backgrounds, both women shared mutual respect, and Grace's legacy continued long after her death in 1603. Grace O'Malley remains a symbol of resilience, leadership, and defiance, celebrated in Irish folklore and history as \"The Pirate Queen of Ireland.\" Her life and legacy are emblematic of the struggle for Irish autonomy during a tumultuous period in the country's history ."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Clare_Island_-_O%27Malley%27s_Castle_-_geograph.org.uk_-_5221108.jpg/512px-Clare_Island_-_O%27Malley%27s_Castle_-_geograph.org.uk_-_5221108.jpg?20230806192630",
      "title": "Clare Island - O'Malley's Castle by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "O'Malley's Castle. Grace O'Malley was born and raised at Belcare Castle near Westport, County Mayo. This stronghold served as her childhood home and the base from which she began her legendary maritime career. Throughout her life, Grace acquired and fortified several other castles, each strategically located to control key maritime routes and defend her territory against invaders. Notable Castles in Grace O'Malley's Domain: 1.\tDoona Castle (Blacksod Bay): Acquired through conquest, this castle on the Mullet Peninsula provided a strategic point to oversee and control access to the western coastline, vital for trade and defense. 2.\tKildavnet Castle (Achill Island): Another of Grace's strongholds, this tower house guarded the waters of Achill Sound and served as a key defensive structure on the island. 3.\tO’Malley Castle (Clare Island): Clare Island was central to the O'Malley clan's operations, and the castle here was the heart of Grace's maritime activities. It was from this base that she launched many of her seafaring expeditions. 4.\tRockfleet Castle (Clew Bay): Rockfleet, also known as Carraigahowley Castle, became Grace's primary residence later in life. Strategically positioned at the edge of Clew Bay, it was well-suited for overseeing the surrounding waters and coastline. Grace O'Malley died here in 1603, and the castle remains closely associated with her legacy. Each of these strongholds was crucial in maintaining the independence and power of the O'Malley clan, allowing Grace to control the western seas and resist English encroachment throughout her life"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Clare_Island_-_The_road_west_from_the_harbour_-_geograph.org.uk_-_5221114.jpg/512px-Clare_Island_-_The_road_west_from_the_harbour_-_geograph.org.uk_-_5221114.jpg?20230806192755",
      "title": "Clare Island - The road west from the harbour by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The road west from the harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Clare_Island%2C_cove_behind_-_south_of_Granuaile%27s_Castle_-_geograph.org.uk_-_1843282.jpg/512px-Clare_Island%2C_cove_behind_-_south_of_Granuaile%27s_Castle_-_geograph.org.uk_-_1843282.jpg?20210330015528",
      "title": "Clare Island: cove behind / south of Granuaile's Castle by Keith Salvesen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Clare Island: cove behind / south of Granuaile's Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Clare_Island_-_Harbour_-_geograph.org.uk_-_5221109.jpg/512px-Clare_Island_-_Harbour_-_geograph.org.uk_-_5221109.jpg?20230806192647",
      "title": "Clare Island - Harbour by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Habrour view. The island's attractions are primarily concentrated near the harbor, which is home to a Blue Flag beach, recognised for its clean waters and environmental standards. Clare Island is also a haven for wildlife, with rare seabirds nesting on the island's dramatic sea cliffs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Clare_Island_-_The_Lighthouse_entrance_%28geograph_5221188%29.jpg/512px-Clare_Island_-_The_Lighthouse_entrance_%28geograph_5221188%29.jpg?20181017091113",
      "title": "Colin Park / Clare Island - The Lighthouse entrance",
      "caption": "The photogenic Clare Island Lighthouse perched on the Northern Cliffs, offers stunning views of the Atlantic Ocean. The lighthouse has been a notable landmark since its original construction in 1806 by the Marquis of Sligo. The lighthouse's early years were marked by a dramatic event when a fire, caused by the careless disposal of candle wicks by the lighthouse keeper, destroyed the original structure after only seven years of operation. The lighthouse was subsequently rebuilt, with a new tower completed by the end of 1818. After an impressive 159 years of service, Clare Island Lighthouse was decommissioned in 1965. However, the lighthouse and its associated buildings have since undergone restoration and have been transformed into a luxury guesthouse. This conversion has preserved the lighthouse's historical significance while offering visitors a unique experience on the island. The restored lighthouse offers breathtaking views and an opportunity to stay in a place rich in maritime history, combining luxury with the rugged beauty of Clare Island."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Clare_Island_-_The_Napoleonic_Signal_Tower_-_geograph.org.uk_-_5221136.jpg/512px-Clare_Island_-_The_Napoleonic_Signal_Tower_-_geograph.org.uk_-_5221136.jpg?20230806193258",
      "title": "Clare Island - The Napoleonic Signal Tower by Colin Park, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Napoleonic Signal Tower. On the most westerly point of the island, you'll find the 19th-century Napoleonic Signal Tower, a historic site offering insight into the island's past. Additionally, Clare Island is home to a megalithic tomb, dating back 4,000 to 3,000 years, a testament to the island's ancient history."
    }
  ],
  "distance_km": 6.0,
  "description": "Clare Island is located 3.5 miles off the west coast of County Mayo in Ireland. It's a highly picturesque and tranquil destination accessible by ferry from Roonagh Pier near the small town of Louisburgh. The island, measuring 8 km in length and 5 km in width, is relatively easy to explore, with its limited number of cars making it an ideal place for visitors to take in the breathtaking natural scenery. Cycling is popular here, as the island's quiet country roads provide ample opportunity for exploration. This walk on the island takes you west from the harbour to visit the historic Clare Abbey. You can start off from the harbour where you can visit the historically significant O'Malley's Castle. It was from this location that Grace O'Malley, the famous 'pirate queen', launched many of her daring seafaring expeditions. From here you can follow quiet roads west with fine views over bay as you go. You will soon come to the ancient abbey which dates back to the 1200s. Tradition claims it is the site of the baptism, marriages and burial of the aforementioned Grace O'Malley (c. 1530 – c. 1603). See below for abbey photos and more details of the exploits of one of Ireland's most notorious historical figures. To continue your island walking in the area head to nearby Cleggan where you can catch the ferry to Inishbofin island. There's a waymarked circular loop walk here passing rugged cliffs, a photogenic ruined fort, pretty lakes and stone beaches.",
  "details": [],
  "video_url": "https://www.youtube.com/embed/Z-j5FI2Wp10?si=BDqgB08JPu4GLoCl",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Granuaile's Castle, Clare Island ED, Westport-Belmullet Municipal District, County Mayo, Connacht, Éire / Ireland",
  "postcode": null,
  "district": null,
  "county": "County Mayo",
  "region": null,
  "state": null,
  "country": "Éire / Ireland",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "coastal",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "archaeological sites",
    "lakes",
    "beaches"
  ],
  "facilities": [
    "car park",
    "ferry"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking",
    "cycling"
  ]
}