{
  "created_at": "2025-01-06T09:19:52.858636+00:00",
  "objectID": "e86f0c92eb400470fc995e8c7ebd394c",
  "ref": "falmouth-walking-route",
  "title": "Around Falmouth Walk - Quay, Castle and Coast Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Boats_in_Falmouth_Harbour_-_geograph.org.uk_-_2155973.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e86f0c92eb400470fc995e8c7ebd394c.gpx",
  "_geoloc": {
    "lat": 50.1564005177,
    "lng": -5.0711219092
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/Boats_in_Falmouth_Harbour_-_geograph.org.uk_-_2155973.jpg",
      "title": "Boats in Falmouth Harbour by Andrew King, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Boats in Falmouth Harbour"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Quays_at_Falmouth_-_geograph.org.uk_-_27265.jpg",
      "title": "Chris J Dixon / Quays at Falmouth",
      "caption": "Quays at Falmouth. Seen from the Maritime Museum."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/14/Castle_Beach_Falmouth_-_geograph.org.uk_-_806610.jpg",
      "title": "Rod Allday / Castle Beach Falmouth",
      "caption": "Castle Beach. A much nicer and less crowded beach than Gyllygnvase."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/The_Henrician_Castle%2C_Pendennis_Castle_-_geograph.org.uk_-_224129.jpg",
      "title": "RichTea, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Henrician Castle, Pendennis Castle. Seen from the south-west bastion. The Henrician Castle is the oldest major part of Pendennis Castle, built between 1540 and 1545. It was probably last armed during the Civil War, after which it was the residence of the Castle's governor for some time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Pendennis_Point_from_the_Henrician_Castle_-_geograph.org.uk_-_224119.jpg",
      "title": "RichTea, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pendennis Point from the Henrician Castle. Looking down from the ramparts of the Henrician Castle. The building in mid-foreground is part of the Half-Moon Battery. Beyond it the roof of the Coastguard Centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/West_Bastion%2C_Pendennis._Firing_the_noon_gun._-_geograph.org.uk_-_224103.jpg",
      "title": "RichTea, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "West Bastion, Pendennis. Firing the noon gun. One of the guns in the west bastion is fired at noon each day. The one fired on this occasion was an anti-aircraft gun from the first world war, which had been adapted from a field gun to protect London against bombing attacks by Zeppelins."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Pendennis_Castle_from_within_the_Governor%27s_Lodging_-_geograph.org.uk_-_220540.jpg/256px-Pendennis_Castle_from_within_the_Governor%27s_Lodging_-_geograph.org.uk_-_220540.jpg",
      "title": "RichTea, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pendennis Castle from within the Governor's Lodging. Looking out at the east side of the castle, and across Carrick Roads towards St Mawes. The Governor's Lodging consists of rooms in the oldest part of Pendennis, The Henrician Castle, which was constructed during the reign of Henry VIII. St Mawes Castle is just visible through the right-hand middle pane, and was built at the same time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Swanpool_-_geograph.org.uk_-_1977842.jpg/512px-Swanpool_-_geograph.org.uk_-_1977842.jpg",
      "title": "Swanpool by David Dixon, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Swanpool Nature Reserve"
    }
  ],
  "distance_km": 8.0,
  "description": "A coastal walk around the Cornish town of Falmouth visiting Pendennis Point, Pendennis Castle and the pretty Swanpool lake nature reserve. Starting at the pier the walk follows the South West Coast Path past the quays and docks to Pendennis Castle. The artillery fort was constructed by Henry VIII between 1540 and 1542. It is run by English Heritage so you can explore the battlements, war rooms, barracks and cells with exhibitions detailing the history of the castle. It's in a fantastic position, commanding fine views across Falmouth Bay to the Roseland Peninsula. After leaving the castle the footpath rounds Pendennis Point and heads west to Swanpool, passing two nice beaches on the way. The small saline lagoon is great for wildlife watching with Little grebe, Tufted Duck and Moorhen to look out for. It's a really lovely spot with the lake separated from the sea by the pretty Swanpool beach. The site also includes and outdoor cafe, crazy golf course, water-sports and kayak hire. To extend your walking in the area you could explore the beautiful Roseland Peninsula. You can catch a ferry from Falmouth to St Mawes where you can try the St Mawes to St Just Walk. This visits the fascinating St Mawes Castle and the St Just in Roseland 13th-century church with beautiful riverside gardens. Also near to Falmouth is the delightful Glendurgan Garden, the beautiful estuary of the Helford River and Kennall Vale Nature Reserve.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just west of the town there's a good circular trail to follow around Argal Reservoir. There's also the ancient Mabe church and a boardwalk on the adjacent College Reservoir to see here. Head north and you can pick up the Penryn Walk which will take you along the Penryn River to Flushing where you can catch a ferry to Falmouth. The town itself is also worth exploring with a historic conservation area where you'll find a number of Tudor, Jacobean and Georgian properties. The pretty harbour and wharf also includes a fine riverside cafe. Just to the north there's the worthy village of Mylor Bridge where you can enjoy some lovely waterside walks along the Mylor Creek and Restronguet Creek, on the beautiful Fal Estuary. For more walking ideas in the area see the Cornwall Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ubq6tm1qkxk",
  "postcode": "TR11 3DB",
  "district": "Falmouth",
  "county": "Cornwall",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Falmouth Post Office, 13, Market Strand, Falmouth, Cornwall, England, TR11 3DB, United Kingdom",
  "state": "England"
}