{
  "objectID": "e8a283ca7535d6ba759add7152252016",
  "created_at": "2024-12-19T08:40:54.374007+00:00",
  "ref": "ribblehead-viaduct-walking-route",
  "title": "Ribblehead Viaduct Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/6/65/Ribblehead_Station_-_geograph.org.uk_-_1577051.jpg",
  "nearby": [
    {
      "description": "Ribble Way",
      "objectID": "e8a3af45a7fceebb722f20bce85618c1",
      "ref": "ribble-way-walking-route"
    },
    {
      "description": "Twistleton Scar",
      "objectID": "cb5d32a1e5de9d25de8fa4b6d44ce4ec",
      "ref": "twistleton-scar-walking-route"
    },
    {
      "description": "Whernside",
      "objectID": "2eeca025ba0e941aa4aed887cff721e3",
      "ref": "whernside-walking-route"
    },
    {
      "description": "Dent Head Viaduct",
      "objectID": "aeb71895395c2bd669d49c4561049e00",
      "ref": "dent-head-viaduct-walking-route"
    },
    {
      "description": "Arten Gill Viaduct",
      "objectID": "16cb2e2890d0e2d3d5fb6b3d2a26b043",
      "ref": "arten-gill-viaduct-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/ECC878BDD2F9DAEF8025810600591C37/$FILE/Ribblehead Viaduct.gpx",
  "_geoloc": {
    "lat": 54.2073925995,
    "lng": -2.3627055298
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/Ribblehead_Station_-_geograph.org.uk_-_1577051.jpg",
      "title": "Alan Murray-Rust / Ribblehead Station",
      "caption": "Ribblehead Station. Looking down on the Station from the summit of the road from Ingleton. The Station doubles as a visitor centre for the Settle and Carlisle Railway."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Ribblehead_Viaduct_-_geograph.org.uk_-_1577055.jpg",
      "title": "Alan Murray-Rust / Ribblehead Viaduct",
      "caption": "Ribblehead Viaduct. More correctly named Batty Moss Viaduct. A view taken on a November day with outstandingly clear air, with the ridge of Whernside in the background seemingly on top of the viaduct."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/Ribblehead_station_-_geograph.org.uk_-_379972.jpg",
      "title": "ALAN SOUTHWORTH / Ribblehead station",
      "caption": "Ribblehead station. The refurbished gas lamp plus clock and commemorative plaque."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Crossing_Ribblehead_Viaduct_%28geograph_2095055%29.jpg/512px-Crossing_Ribblehead_Viaduct_%28geograph_2095055%29.jpg",
      "title": "John Lucas / Crossing Ribblehead Viaduct",
      "caption": "Crossing the viaduct. Empty coal wagons being hauled across Ribblehead Viaduct by a class 66 locomotive (No 66051). Both locomotive and stock are in the now defunct EWS livery. EWS (English, Welsh and Scottish Railway) was an American and then Canadian consortium which purchased most of the British Rail freight operations when privatised in 1996. In 2007, EWS was purchased by DB Schenker Rail (UK), a wholy owned subsidiary of German State Railways. It is intended that the EWS livery will be replaced by that of DB Schenker Rail in due course.\nThis view was taken from the Ribblehead Station Inn. The lower slopes of Whernside are visible beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Station_Inn_Ribblehead_-_geograph.org.uk_-_1382550.jpg",
      "title": "Andy Jamieson / Station Inn Ribblehead",
      "caption": "The Station Inn. Head here to rest and refresh yourself after the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Ribblehead_Viaduct_-_geograph.org.uk_-_367849.jpg",
      "title": "Frank Glover / Ribblehead Viaduct",
      "caption": "Taken from the path approaching the summit of Whernside."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Ribblehead_Viaduct_from_Ivescar_-_geograph.org.uk_-_1382141.jpg",
      "title": "Andy Jamieson / Ribblehead Viaduct from Ivescar",
      "caption": "From Ivescar. The structure carries the Settle–Carlisle railway across Batty Moss. Construction began in late 1869 by the Midland Railway. It required a large workforce, of up to 2,300 men, most of whom lived in shanty towns set up near its base. It was a dangerous job as 100 men lost their lives during its construction. The line is notable as the last main railway in Britain to be constructed primarily with manual labour. It opened to passengers in 1876."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9e/Ribblehead_Viaduct_from_Broadrake_-_geograph.org.uk_-_1382168.jpg",
      "title": "Andy Jamieson / Ribblehead Viaduct from Broadrake",
      "caption": "View across the summer fields from Broadrake."
    }
  ],
  "distance_km": 6.5,
  "description": "Enjoy a circular walk around this famous landmark in the Yorkshire Dales. The impressive viaduct carries the Settle-Carlisle Railway across Batty Moss in the valley of the River Ribble at Ribblehead, in North Yorkshire. The Grade II* listed structure is one of England's greatest monuments to Victorian engineering. It is a hugely pictureque spot with the structure surrounded by imposing Yorkshire Hills. You can start the walk from the car park just to the south of the viaduct, off the B6255. You can also visit the viaduct by public transport by catching the train to Ribblehead railway station. It's an interesting little station with a small shop selling memorabilia and a Visitor Centre which includes exhibits about the history of the line and the fight to keep it open. From the car park footpaths head north on the eastern side of the railway line, taking you to Winterscales Farm. Here you turn south west towards Broadrake, before crossing Winterscale Beck and heading back towards the viaduct. After your walk you can enjoy refreshments at the excellent Station Inn. The classic stone pub overlooks the viaduct and has free parking. You can follow the path to the viaduct by using the google street view link below. It shows the surfaced path with views of the viaduct and hills behind. To extend your walking in the area you could continue west and visit Twistleton Scar where there is some splendid limestone scenery. The challenging climb to Whernside can also be started from the same car park. One of the Yorkshire Three Peaks, the mountain stands at a height of  736 m (2,415 ft) with tremendous views towards the Lake District and the coast. Our Whernside, Ingleborough Circular Walk starts and finishes from the viaduct and will take you up to Park Fell and Simon Fell before visiting two of the famous peaks. The long distance Dales Way and Ribble Way both pass near to the viaduct so you could pick up these splendid trails to further explore this area of the Yorkshire Dales National Park.",
  "video_url": "https://www.youtube.com/embed/7SuiLrdlHP8",
  "district": "Ribblehead",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England"
}