{
  "created_at": "2025-01-06T04:45:35.315552+00:00",
  "objectID": "e8c509187fc471e5f9e9dea116080a78",
  "ref": "knaresborough-round-walking-route",
  "title": "Knaresborough Round Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/c/cd/River_Nidd%2C_Weir_and_Castle_Mill%2C_Knaresborough_-_geograph.org.uk_-_1404253.jpg",
  "nearby": [
    {
      "description": "Harrogate Ringway",
      "objectID": "3275bc6154901552601730d06dfaafeb",
      "ref": "harrogate-ringway-walking-route"
    },
    {
      "description": "Nidd Gorge",
      "objectID": "f79c5f16cea4a71ce5c530d2774545bf",
      "ref": "nidd-gorge-walking-route"
    },
    {
      "description": "Knaresborough River Walk",
      "objectID": "24b7650403fe79d82675fe579373b62f",
      "ref": "knaresborough-river-walk-walking-route"
    },
    {
      "description": "Goldsborough",
      "objectID": "aa79a6d3c64691f4767e729e725a5944",
      "ref": "goldsborough-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e8c509187fc471e5f9e9dea116080a78.gpx",
  "_geoloc": {
    "lat": 54.0024047028,
    "lng": -1.4668384723
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/River_Nidd%2C_Weir_and_Castle_Mill%2C_Knaresborough_-_geograph.org.uk_-_1404253.jpg",
      "title": "Dr Neil Clifton / River Nidd: Weir and Castle Mill, Knaresborough, via Wikimedia Commons",
      "caption": "River Nidd: Weir and Castle Mill, Knaresborough The mill, originally water powered and later steam, started as a cotton mill but for many years was a flax mill. It is now converted into apartments."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Knaresborough_Castle_-_geograph.org.uk_-_98041.jpg",
      "title": "RichTea [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Knaresborough Castle seen through an arch of the railway bridge, from a rowing boat on the River Nidd"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Goldsborough_Hall_-_geograph.org.uk_-_1976194.jpg",
      "title": "DAVID M GOODWIN / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Goldsborough Hall. It was originally built for Sir Richard Hutton after he acquired the Goldsborough Estate in 1598. Now the hall and gardens are open as a luxury retreat as exclusive hire for weddings and functions."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Village_street%2C_Goldsborough_-_geograph.org.uk_-_640526.jpg",
      "title": "Gordon Hatton / Village street, Goldsborough",
      "caption": "Goldsborough is very much an 'estate' village with many buildings of the 18th century. This block appears to be late 18th or early 19th century, and forms an effective screen in front of the hall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/The_green%2C_Coneythorpe_-_geograph.org.uk_-_1027093.jpg",
      "title": "Gordon Hatton / The green, Coneythorpe",
      "caption": "The green, Coneythorpe. The little village has a pretty green surrounded by picturesque cottages. There's also the Tiger Inn here to stop off for a drink."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Weir_in_Nidd_Gorge_-_geograph.org.uk_-_1422723.jpg",
      "title": "Tony Wells / Weir in Nidd Gorge",
      "caption": "Weir in Nidd Gorge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Ferrensby_Village_Pond.jpg",
      "title": "Gordon Hatton / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Ferrensby Village Pond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Scotton_village_-_geograph.org.uk_-_1484438.jpg",
      "title": "Steve F / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Scotton village. The white building is The Guy Fawkes Inn. The village was the home of Guy Fawkes during his teenage years."
    }
  ],
  "distance_km": 32.0,
  "description": "This 20 mile circular walk takes you on a tour of the countryside, lakes, rivers, woodland and villages surrounding the historic Yorkshire town of Knaresborough. It's a great way to explore this beautiful part of North Yorkshire. The walk starts by the River Nidd near Knaresborough Castle in the town centre. You then follow the river east towards the village of Goldsborough, home to the Grade II* listed Jacobean mansion of Goldsborough Hall. Woodland sections through Great Wood and Parsonage Wood take you to Flaxby and Coneythorpe. The route continues through several small villages around Farnham including Ferrensby, Occaney, Brearton and Scotton where you will enter the wonderful Nidd Gorge. The beautiful river gorge is a real highlight on the walk with lots of interesting flora and fauna to look out for. The final section takes you towards Starbeck and Gallow Hill before returning to the town. This walk joins with the Harrogate Ringway so you can pick up this trail to further explore the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In the little village of Goldsborough there's the historic Bay Horse Inn which dates back to the 16th century. They serve good quality food and have a nice garden area for warmer days. The inn has recently been refurbished and is very walker and dog friendly. You can find them on Main Street at postcode HG5 8NW.The Tiger Inn is located in a lovely spot next to the green in the little village of Coneythorpe. It's a quality pub with a very good menu and a lovely outdoor area where you can relax on warmer days. You can find the pub at postcode HG5 0RY. In Scotton you could stop off at the noteworthy Guy Fawkes Arms. Originally constructed in the 17th century, the pub takes its name from Guy Fawkes who used to live in the village. They do excellent food and can be found on the Main Street at postcode HG5 9HU. The pub is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you have time we recommend exploring the splendid Knaresborough Castle. The 12th century castle sits in a fine location, next to the river, just south of the train station. For a fee you can explore the interior of the castle and visit the interesting museum which details the history of the castle. The grounds include pretty gardens, attractive lawns, a bowling green and a putting green are free to access. From the castle's elevated position there are also fine views over the surrounding area. The historic Beningbrough Hall lies a few miles east of the town. The grounds of this Georgian mansion are a fine place for a stroll with views of the River Ouse and beautiful gardens to enjoy. On the opposite side of the river you can also see the village of Nun Monkton which sits at the confluence of the River Nidd and Ouse. The village has some interesting features including a village green, duck pond, pretty cottages, riverside trails and the impressive 17th century Nun Monkton Priory. For more walking ideas in the area see the Nidderdale Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/J90b2NwBUgQ",
  "postcode": "HG5 8JD",
  "district": "Knaresborough",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}