{
  "created_at": "2025-01-06T02:27:13.337603+00:00",
  "objectID": "e8f54b5483bb4ac21409772de9817b12",
  "ref": "calderstones-park-walking-route",
  "title": "Calderstones Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Calderstones_Park%2C_Liverpool_%2836%29.JPG/512px-Calderstones_Park%2C_Liverpool_%2836%29.JPG?20130524121018",
  "nearby": [
    {
      "description": "Childwall Woods",
      "objectID": "ee6c61570fe9f75cc472e813c3e62273",
      "ref": "childwall-woods-walking-route"
    },
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "Sefton Park Liverpool",
      "objectID": "e9c3b42450a49bb04646d2902f9087b7",
      "ref": "sefton-park-liverpool-walking-route"
    },
    {
      "description": "Liverpool City Walk",
      "objectID": "529576ea092df8d6c0c53a002ffadc38",
      "ref": "liverpool-city-walk-walking-and-cycle-route"
    },
    {
      "description": "Liverpool Loop Line",
      "objectID": "1de6c13dcb7af55f257e8cac21ca60c0",
      "ref": "liverpool-loop-line-walking-and-cycle-route"
    },
    {
      "description": "Knowsley Hall Park",
      "objectID": "797e7c5cf472c0bd4da75e53657e4761",
      "ref": "knowsley-hall-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e8f54b5483bb4ac21409772de9817b12.gpx",
  "_geoloc": {
    "lat": 53.3834295397,
    "lng": -2.898298493
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Calderstones_Park%2C_Liverpool_%2836%29.JPG/512px-Calderstones_Park%2C_Liverpool_%2836%29.JPG?20130524121018",
      "title": "Rept0n1x, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Calderstones Park 1"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Calderstones_Park%2C_Liverpool_%2844%29.JPG/512px-Calderstones_Park%2C_Liverpool_%2844%29.JPG?20130524121035",
      "title": "Rept0n1x, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "Calderstones Park 2"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Calderstones_Park_Lake_-_geograph.org.uk_-_96997.jpg?20100130212632",
      "title": "Sue Adair / Calderstone Park Lake",
      "caption": "Calderstones Park Lake"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/The_Calderstones%2C_Calderstone_Park_-_geograph.org.uk_-_401915.jpg?20110203225811",
      "title": "Sue Adair / The Calderstones, Calderstone Park",
      "caption": "The Calderstones are six neolithic sandstone boulders remaining from a dolmen. Little was known about the Calderstones until the 18th century when they are thought to have been disturbed. In 1825 it was reported that, \"in digging about them, urns made of the coarsest clay, containing human dust and bones were found\". During the mid and later 19th century certain academics had declared the Calderstones to have been part of a druidical circle. In the closing years of the century Professor W.A. Herdman returned to the earlier evidence and concluded that the stones were once part of a ruined dolmen which had been mistakenly taken for a circle due to the false impression held that all druidical remains should be so arranged. The stones were relocated by Joseph Need Walker during his ownership, becoming a gateway feature to the eponymous estate. The stones are now housed in the Harthill Greenhouses in Calderstones Park, having been moved from their previous location in an enclosure just outside the park gates in 1954 to protect them from further weathering. Nearby Robin Hood's Stone was originally one of the Calderstones, and has been relocated."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/The_mansion_house_in_Calderstones_Park_-_geograph.org.uk_-_2915587.jpg/512px-The_mansion_house_in_Calderstones_Park_-_geograph.org.uk_-_2915587.jpg?20211221140015",
      "title": "The mansion house in Calderstones Park by Raymond Knapman, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The mansion house in Calderstones Park. The house was built in 1828 by Joseph Need Walker to replace the original farmhouse known as the Old House. The house is of Georgian style, though it has been subject to some alterations over the years and now houses council offices and a small café. The extensive stables and coachhouse remain at the rear of the house. The mansion house is currently being refurbished to accommodate the International Headquarters for Shared Reading. This refurbishment is being run by the Reader Organisation."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/2020_The_Allerton_Oak_UKE.jpg/512px-2020_The_Allerton_Oak_UKE.jpg?20220130214000",
      "title": "Jill Jennings, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "The Allerton Oak. One of the park's two most ancient features, estimated at 1,000 years old, is an oak tree. According to legend the ancient local Hundred Court sat beneath its branches. Its dilapidated state is said to be due to the explosion of the gunpowder ship Lottie Sleigh over three miles away on the River Mersey in 1864. It is dependent upon a number of props that hold it up.[10] Acorns and leaves from the oak were sent to soldiers by their families during World War II, such was the reputation of this tree. The tree was named England's 'tree of the year' in 2019 by Woodland Trust."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/Japanese_Garden%2C_Calderstones_Park_-_geograph.org.uk_-_6257419.jpg/512px-Japanese_Garden%2C_Calderstones_Park_-_geograph.org.uk_-_6257419.jpg?20240204183921",
      "title": "Japanese Garden, Calderstones Park by Sue Adair, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Japanese Garden. After World War II, Percy Conn, the new Superintendent of Liverpool Parks, envisioned recreating the Liverpool Botanic Garden, originally established by William Roscoe and John Shepherd at Mount Pleasant, within the Harthill Estate grounds at Calderstones Park. This project commenced in 1951 and was completed in 1964, culminating in the opening of 16 connected glasshouses. The Calderstones botanical garden boasted nearly 4,000 plant species from around the globe, collected by merchants and travellers. Due to post-war financial constraints, low-grade spruce was used instead of teak to construct the glasshouses. By 1979, these structures had deteriorated significantly. The early 1980s were marked by severe economic challenges for Liverpool City, preventing the reconstruction of the glasshouses. Despite this, the park's botanical significance spurred further horticultural enhancements, including a Japanese garden created by park apprentices in 1969 and a 'bog garden' linked to the artificial lake. The glasshouses were closed in 1984, and the plants were moved to the Liverpool City nursery at Garston, remaining there for 23 years. Some of these plants were occasionally displayed at the Southport Flower Shows. In 2007/2008, a third of the plants were relocated to four glasshouses within Croxteth Hall's walled gardens following the closure of Garston Nursery due to the outsourcing of Liverpool's Park & Garden maintenance."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/The_Old_English_Garden%2C_Calderstones_Park_-_geograph.org.uk_-_4080401.jpg/512px-The_Old_English_Garden%2C_Calderstones_Park_-_geograph.org.uk_-_4080401.jpg?20221203062749",
      "title": "The Old English Garden, Calderstones Park by Norman Caesar, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Old English Garden"
    }
  ],
  "distance_km": 2.0,
  "description": "This lovely park in Liverpool covers nearly 100 acres. There's nice footpaths taking you to woodland, lakes and a beautiful botanical gardens. Here you will find 4000 species of plants with vibrant colours in the summer months. The park is named after a number of ancient megaliths that are said to be older than Stonehenge. Other highlights include a pretty stream with a little bridge, a 1000 year old tree, a peaceful Japanese garden and a nice cafe. The Trans Pennine Trail runs past the northern edge of the park. You can pick this up to continue your walking in the area. Heading west will soon bring you to the expansive Sefton Park. Here you can also pick up the circular Liverpool City Walk which takes you to some of the highlights of the city. Following the trail north east will bring you to the pretty Childwall Woods and then on to the Liverpool Loop Line cycling and walking trail.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you could visit the splendid Croxteth Country Park. There's a fine old hall surrounded by 500 acres of woodland and parkland here. Knowsley Hall Park with its 15th century hall and safari park attraction can also be found in this area. For more walking ideas in the area see the Merseyside Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/xrPVegy-tbM",
  "postcode": "L18 3HY",
  "district": "Liverpool",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}