{
  "created_at": "2025-01-06T01:39:16.580490+00:00",
  "objectID": "e9499673dddf9f563fef28787bc2bad3",
  "ref": "duddingston-loch-walking-route",
  "title": "Duddingston Loch Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Curling_House_at_Duddingston_Loch_-_geograph.org.uk_-_192959.jpg",
  "nearby": [
    {
      "description": "Arthur's Seat",
      "objectID": "281baad9985593d3d43672657877c383",
      "ref": "arthurs-seat-walking-route"
    },
    {
      "description": "Calton Hill",
      "objectID": "0ff6916e3a8c3d806db6e0bccce044fe",
      "ref": "calton-hill-walking-route"
    },
    {
      "description": "Bonaly Country Park",
      "objectID": "3826779b1cab818851c0d053d74a37d5",
      "ref": "bonaly-country-park-walking-and-cycle-route"
    },
    {
      "description": "Dalkeith Country Park",
      "objectID": "f32c8e54d30f6810827a18ba2ad4fac8",
      "ref": "dalkeith-country-park-walking-and-cycle-route"
    },
    {
      "description": "Vogrie Country Park",
      "objectID": "83400e9f92210b677343b5c863471d3c",
      "ref": "vogrie-country-park-walking-and-cycle-route"
    },
    {
      "description": "Blackford Hill",
      "objectID": "4cc21a610d35a963da6d5ce129c858e5",
      "ref": "blackford-hill-walking-route"
    },
    {
      "description": "Hermitage Of Braid",
      "objectID": "a9d59f7f21ebf3e7868b4ad9e4026126",
      "ref": "hermitage-of-braid-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e9499673dddf9f563fef28787bc2bad3.gpx",
  "_geoloc": {
    "lat": 55.9419860921,
    "lng": -3.1506827552
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Curling_House_at_Duddingston_Loch_-_geograph.org.uk_-_192959.jpg",
      "title": "Lisa Jarvis / Curling House at Duddingston Loch",
      "caption": "Curling House at Duddingston Loch. Octagonal curling house designed by the architect, William Henry Playfair, in 1823 for the Duddingston Curling Society. The upper floor was used as a studio by the Reverend John Thomson, landscape artist and minister of the church from 1805-40.He named his studio 'Edinburgh', allowing his housekeeper to say that he had 'gone to Edinburgh' if a parishioner called when he was painting. It lies on the shores of Duddingston Loch, a nature reserve near to Holyrood Park and below Arthur's Seat."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Duddingston_Loch_-_geograph.org.uk_-_637314.jpg",
      "title": "Lisa Jarvis / Duddingston Loch",
      "caption": "Frosty morning at Duddingston Loch. A late bronze age hoard of weapons including swords and spears was dredged from the Loch, situated south of Holyrood Park, in 1778. Today it is a bird sanctuary."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Duddingston_Loch_from_Arthur%27s_Seat_-_geograph.org.uk_-_571375.jpg",
      "title": "Lisa Jarvis / Duddingston Loch from Arthur's Seat",
      "caption": "Duddingston Loch from Arthur's Seat. Taken from Crow Hill, in Holyrood Park. The uppermost road circumnavigates Arthur's Seat and the lower road goes through Duddingston. An algae is clearly visible around the edge of the Loch."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Bawsinch_Nature_Reserve_-_geograph.org.uk_-_908523.jpg",
      "title": "M J Richardson / Bawsinch Nature Reserve",
      "caption": "Bawsinch Nature Reserve. A small pond in the reserve, with reedmace and willowherbs, with Arthur's Seat beyond. In total the reserve covers 26 ha, and was formerly an industrial waste-land, associated with the 'Innocent Railway' and a local brewery. Other ponds link with the loch and the reserve is an SSSI."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/21/Old_Church_Loan%2C_Duddingston_-_geograph.org.uk_-_790007.jpg",
      "title": "Anne Burgess / Old Church Loan, Duddingston",
      "caption": "Old Church Loan, Duddingston village. Although it is the continuation of the main road through Holyrood Park, the street retains its traditional granite setts. The street to the left of the 18th century house is The Causeway, leading into the village itself. The brilliant white walls behind are the back of the Sheep Heid Inn, which dates from the 14th century and claims to be Scotland's oldest pub. The front faces north and is very difficult to photograph."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Duddingston_Loch_-_geograph.org.uk_-_790026.jpg",
      "title": "Anne Burgess / Duddingston Loch",
      "caption": "Looking across the loch to Crow Hill, part of Arthur's Seat. The road round the park is almost invisible apart from one stretch among the trees above the loch shore. The water is full of bright green algae, giving it the look of pea soup."
    }
  ],
  "distance_km": 1.0,
  "description": "This walk takes you around the pretty Duddingston Loch near Holyrood Park in Edinburgh. You can start the walk at the car park on the northern side of the loch. Then follow footpaths along the lake and through Dr Neil's Garden. These pretty botanical gardens sit next to the loch. The secret garden includes conifers, rhododendrons, azaleas, ponds and many other flowering plants. There's also the adjacent Duddingston village to explore. Here you'll find a 14th century pub and Duddingston Kirk church, which dates from the 12th century. On the southern side of the water there's the Bawsinch Nature Reserve where you can look out for a variety of birdlife. To extend the walk head north and enjoy a climb to Arthur's Seat for views over the loch.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into Duddingstone village and you could visit the historic Sheep Heid Inn. There has reputedly been an inn on this site since 1360, although the core of the current building appears to date from the 18th century with later additions and alterations. It is thought that inn could be oldest one in Scotland. Today they serve high quality dishes which you can enjoy in the lovely garden area. You can find them at postcode EH15 3QA for your sat navs. The pub is also dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "If you'd like to continue your walking in the city then head up to Calton Hill for some great views. There's alsoBonaly Country Park and Dalkeith Country Park nearby. Just to the east there's Portobello where you can try the Edinburgh Coastal Beach Walk. There's a popular 2 mile stretch of sandy beach with some fine Georgian architecture, Ice cream parlours, arcades, beach-side cafes and bars here. For a fine hill climb you could head south west to Blackford Hill where you can also visit the delightful woodland at Hermitage of Braid. For more walking ideas in the area see the Edinburgh Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/YQEafNhNULM",
  "postcode": "EH15 3PY",
  "district": "City of Edinburgh",
  "county": null,
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Duddingston Low Road, Duddingston Village, Duddingston, City of Edinburgh, Alba / Scotland, EH15 3PY, United Kingdom",
  "state": "Alba / Scotland"
}