{
  "created_at": "2025-01-06T01:21:05.397935+00:00",
  "objectID": "e959d8d8516cf3f298f8e363a3c2bf85",
  "ref": "rodwell-trail-walking-and-cycle-route",
  "title": "Rodwell Trail Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Rodwell_Station_-_geograph.org.uk_-_1430032.jpg",
  "nearby": [
    {
      "description": "Chesil Beach",
      "objectID": "10ea707afab28ce67f098301c9ba89b9",
      "ref": "chesil-beach-walking-route"
    },
    {
      "description": "Isle of Portland",
      "objectID": "13b7dffbffa85409b9dca90d0c28ffad",
      "ref": "isle-of-portland-walking-route"
    },
    {
      "description": "Weymouth",
      "objectID": "3418f5ad1bbd31e3fcc2897926ffd74b",
      "ref": "weymouth-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e959d8d8516cf3f298f8e363a3c2bf85.gpx",
  "_geoloc": {
    "lat": 50.6119564909,
    "lng": -2.4600465561
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Rodwell_Station_-_geograph.org.uk_-_1430032.jpg",
      "title": "Ivan Hall / Rodwell Station",
      "caption": "Rodwell Station. The path runs along the former route of the Portland Branch Railway. The station closed with the branch on 3rd March 1952. The Weymouth and Portland Railway, was constructed in 1865 to carry passengers and Portland Stone between Weymouth and Ferrybridge in Wyke Regis."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Bridge_Over_The_Rodwell_Trail_-_Weymouth_To_Portland._%283561770791%29.jpg/512px-Bridge_Over_The_Rodwell_Trail_-_Weymouth_To_Portland._%283561770791%29.jpg",
      "title": "Jim Linwood from London, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
      "caption": "Bridge Over The Rodwell Trail"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/aa/Trackbed_of_the_Weymouth%2C_Portland_and_Church_Hope_Railway_-_geograph.org.uk_-_931896.jpg",
      "title": "Simon Palmer / Trackbed of the Weymouth, Portland and Church Hope Railway",
      "caption": "Trackbed of the Weymouth, Portland and Church Hope Railway. The trackbed of the Weymouth, Portland and Church Hope Railway; disused since the 1950s, as it climbs up under Grove Cliffs before curving inland towards Easton Station."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1b/Penn%27s_Weare_from_the_Cliff_Top_-_geograph.org.uk_-_1802240.jpg",
      "title": "Ivan Hall / Penn's Weare from the Cliff Top",
      "caption": "Penn's Weare from the Cliff Top"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/The_old_track_bed_of_the_Weymouth_and_Portland_Railway_-_geograph.org.uk_-_715657.jpg",
      "title": "Simon Palmer / The old track bed of the Weymouth & Portland Railway",
      "caption": "The old track bed of the Weymouth & Portland Railway. The railway was opened in 1857 and served 3 stations on Portland. The last passenger service was in 1952 and the final train ran in 1965. From then until 1974 the track and Ferrybridge viaduct were removed. The very busy road is on the right."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/80/Dismantled_Railway%2C_South_of_Easton_-_geograph.org.uk_-_1474939.jpg",
      "title": "Ivan Hall / Dismantled Railway, South of Easton",
      "caption": "South of Easton. The trail is great for flora and fauna with birds such as Kingfishers, Redwings and Great Crested Grebes to look out for. Pretty flora includes Foxgloves, Bluebells and Meadow Buttercups. You can see a variety of butterflies fluttering around the flowers in the warmer months."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Dismantled_Railway_Track_by_Derelict_Engine_Shed_-_geograph.org.uk_-_1801717.jpg",
      "title": "Ivan Hall / Dismantled Railway Track by Derelict Engine Shed",
      "caption": "Track by Derelict Engine Shed The Grade II Listed Old Engine Shed is visible next to the top of the Admiralty incline, down which stone used in the construction of the harbour breakwater was transported. Sadly it is not possible to follow this line beyond the bottom of the hill (or the corresponding part of the old railway line) as the land at the foot of the incline is owned by Portland Port and is not"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Sandsfoot_Castle_-_geograph.org.uk_-_29088.jpg",
      "title": "Bob Ford / Sandsfoot Castle",
      "caption": "Sandsfoot Castle. One of Henry VIII's coastal forts. It formed part of the King's Device programme to protect against invasion from France and the Holy Roman Empire, and defended the Weymouth Bay anchorage. It was completed by 1542 but by the early 18th century, Sandsfoot was in ruins. The clay cliffs on which the castle had been built had always been unstable and subject to erosion."
    }
  ],
  "distance_km": 3.0,
  "description": "The Rodwell Trail is a nice easy off road trail through Weymouth using a disused railway path. After passing through the Rodwell district of Weymouth you join a lovely coastal stretch at the ruins of 16th century Sandsfoot Castle and the beautiful Sandsfoot Cove. From here the path runs along the coast to the Ferry Bridge that you can cross to the Isle of Portland. There is a variety of wildlife to be found on the trail, including Kingfishers, Redwings and Great Crested Grebes. Plantlife includes Foxgloves, Bluebells and Meadow Buttercups. The 2 mile long trail is suitable for both walkers and cyclists looking for a safe, easy off road route.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a lovely cafe at Sandsfoot Castle right next to the trail. They serve a fine range of meals and snacks and have a beautiful garden area with views to the coast. It's the ideal place for a pit stop on the route. After your meal you can enjoy a stroll around the castle grounds and gardens as well. You can find them on the coastal side of the trail at postcode DT4 8QE for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The trail makes for a fine dog walk so you will probably see other owners on your outing. The Sandsfoot Cafe mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Near the start of the route there's the Radipole Lake to explore. The Wild Weymouth Discovery Centre is located here and features nature exhibits and programs, trails and viewing blinds. At the other end of the route you'll finish near to Chesil Beach where there's some nice trails and a good visitor centre with exhibitions of local wildlife and a cafe for refreshment. For more walking ideas in the area see the Dorset Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/bmPMdgjql0g",
  "district": "Weymouth",
  "county": "Dorset",
  "region": "South West",
  "country": "England",
  "gazetteer_found": true
}