{
  "created_at": "2025-01-06T02:10:21.272863+00:00",
  "objectID": "e96b8caef019982483e720c1ec5927d6",
  "ref": "icknield-way-path-walking-route",
  "title": "Icknield Way Path Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/2/24/The_Icknield_Way_in_Spring_-_geograph.org.uk_-_72414.jpg",
  "nearby": [
    {
      "description": "Ivinghoe Beacon",
      "objectID": "33d3802ec0caac4aed08b1fd610248db",
      "ref": "ivinghoe-beacon-walking-route"
    },
    {
      "description": "Sundon Hills Country Park",
      "objectID": "740a45e207507639bceefe0d866c88e1",
      "ref": "sundon-hills-country-park-walking-route"
    },
    {
      "description": "Wendover Woods",
      "objectID": "b7e790c9a2cb011c456ed7f93c4a835a",
      "ref": "wendover-woods-walking-and-cycle-route"
    },
    {
      "description": "Dunstable Downs Country Park",
      "objectID": "3f99f6926fb96ba7211fd4588aaaf877",
      "ref": "dunstable-downs-country-park-walking-route"
    },
    {
      "description": "Whipsnade Tree Cathedral",
      "objectID": "1bfc3a3317620318857fa656aec6a7b8",
      "ref": "whipsnade-tree-cathedral-walking-route"
    },
    {
      "description": "Cavenham Heath",
      "objectID": "1a75e1c3fbb2f594ef7f15328d9bea02",
      "ref": "cavenham-heath-walking-route"
    },
    {
      "description": "Newmarket",
      "objectID": "d2c6b68acfdd851ba402c618b1842482",
      "ref": "newmarket-walking-route"
    },
    {
      "description": "Pegsdon Hills",
      "objectID": "4aa8bf2a4b782e60f3ff19ca34863d9e",
      "ref": "pegsdon-hills-walking-route"
    },
    {
      "description": "Thetford Forest",
      "objectID": "c754503315c7047bb884243a9b4b3ec5",
      "ref": "thetford-forest-walking-and-cycle-route"
    },
    {
      "description": "Ashwell",
      "objectID": "254f7f510e0c941e12731383b7a282c8",
      "ref": "ashwell-walking-route"
    },
    {
      "description": "Tuddenham",
      "objectID": "290b90ecebda4bea88df6964b5693a75",
      "ref": "tuddenham-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/e96b8caef019982483e720c1ec5927d6.gpx",
  "_geoloc": {
    "lat": 51.8416399117,
    "lng": -0.6080894688
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/The_Icknield_Way_in_Spring_-_geograph.org.uk_-_72414.jpg",
      "title": "Cathy Cox / The Icknield Way in Spring, via Wikimedia Commons",
      "caption": "The Icknield Way in Spring. The Icknield Way as it passes along the edge of Dunstable Downs. Photo taken looking north east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/55/Upper_Icknield_Way_-_geograph.org.uk_-_581346.jpg",
      "title": "Chris Heaton / Upper Icknield Way, via Wikimedia Commons",
      "caption": "Upper Icknield Way Adopted by the Ridgeway National Trail as it passes next to the town of Princes Risborough."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7a/Icknield_Way%2C_Lewknor.jpg",
      "title": "David Hawgood [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Icknield Way by Hill Farm, Lewknor. Icknield way runs below the Chilterns' Scarp, and forms part of The Ridgeway Long Distance Path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/69/Two_walkers_on_the_Icknield_Way_-_geograph.org.uk_-_757921.jpg",
      "title": "Jonathan Billinger / Two walkers on the Icknield Way, via Wikimedia Commons",
      "caption": "Two walkers on the Icknield Way In the background is the Chilterns Gateway visitor centre - for those who like their country views with a roof and a cappuccino."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Footpath_on_Oughtonhead_Common_-_geograph.org.uk_-_245102.jpg",
      "title": "OLU, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Footpath on Oughtonhead Common Nature Reserve, near to Ickleford and Hitchin in Hertfordshire. View beside the river Oughton which flows through this area of the walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/The_Icknield_Way_in_Spring_-_geograph.org.uk_-_72414.jpg",
      "title": "Cathy Cox / The Icknield Way in Spring",
      "caption": "The Icknield Way in Spring. The trail as it passes along the edge of Dunstable Downs. Photo taken looking north east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Icknield_Way_Path_-_geograph.org.uk_-_204527.jpg",
      "title": "Richard Thomas / Icknield Way Path",
      "caption": "Looking toward's Telegraph Hill, near Hexton."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/The_Icknield_Way_-_geograph.org.uk_-_1634864.jpg",
      "title": "Keith Evans / The Icknield Way",
      "caption": "Near to Rushford, Norfolk."
    }
  ],
  "distance_km": 177.0,
  "description": "The Icknield Way Path starts at Ivinghoe Beacon in Buckinghamshire and heads to Knettishall Heath in Suffolk along prehistoric pathways. There's fantastic views as you climb through the hills of the Chilterns AONB. There's also a series of lovely nature reserves and country parks to enjoy on the way. Highlights on the walk include the Cam Valley views from Royston Heath, the lovely Dunstable Downs Country Park and the splendid Whipsnade Tree Cathedral. The trail is mostly a walking trail but there are cycling opportunities as well. For example through Thetford Forest there are plenty of good off road trails to try. This is located near the Suffolk end of the path and is another route highlight.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Wendover Woods you could stop off at the new on site Wendover Woods Cafe, located right next to the main car park, about half a mile north of the path. There's lots of tables outside where you can enjoy a meal with great views of the trees. It's a lovely spot to take the weight of your feet. They serve a wide range of tasty hot and cold locally sourced food (including daily specials), delicious cakes and freshly baked pastries, as well as a range of hot and cold Fairtrade drinks. Just to the north of the cafe there's a bookable BBQ area if you fancy bringing along your own food to cook. Just email wendoverbbq@forestryengland.uk for more info. Stop off at Ickleford and you can visit the historic Old George. The pub dates back to the 15th century and includes a fine interior with an ancient inglenook fireplace. Outside there's a lovely courtyard garden and a terrace with fine views of the old village church. You can find them on the Arlesey Road at postcode SG5 3UX for your sat navs. In the Hertfordshire village of Pirton The Motte and Bailey is a good choice. The pub is located in a nice spot overlooking the village green and includes a lovely large garden area with a pergola. You can find them at 1 Great Green with a postcode of SG5 3QD for your sat navs. In Bedfordshire's Toddington there's the noteworthy Oddfellows Inn. The friendly old pub dates back over 700 years and is located in a nice spot on the Market Square at postcode LU5 6BP for your sat navs. There's a cosy interior and nice garden area for warmer weather. In Therfield there's the noteworthy Fox and Duck. This award winning gastropub is located in a lovely spot on the green. The pub dates back to 1700 and includes a charming interior with a rustic and traditional feel. There's also a number of interesting historical artifacts donated by the Royston and District Museum. These include summarised accounts from 1900 to 1926 showing the impact of WW1 on the village pub. The pub serves high quality food which you can enjoy in the garden area with views of the village. You can find them at postcode SG8 9PN for your sat navs. At Tuddenham you can visit the historic Tuddenham Mill - an ancient watermill surrounded by 12 acres of gardens and Suffolk countryside. There is a high quality restaurant at the mill where you can sit outside by the river in a very picturesque location. Just south of Tuddenham is Moulton where you can enjoy views of the River Kennet, visit the fine 14th century church and photograph the splendid medieval Packhorse Bridge. On the village green there's also the Packhorse Inn. They serve high quality food and also provide rooms if you'd like to stay in the area. The inn is located near the old bridge on Bridge Street at postcode CB8 8SP."
    }
  ],
  "video_url": "https://www.youtube.com/embed/AlAfVZBe19I",
  "county": "Buckinghamshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Ivinghoe Beacon, B489, Ivinghoe, Ivinghoe Aston, Buckinghamshire, England, LU7 9DJ, United Kingdom",
  "postcode": "LU7 9DJ",
  "district": "Ivinghoe Aston",
  "state": "England"
}