{
  "created_at": "2025-01-05T23:33:22.157170+00:00",
  "objectID": "ea4cef247c3a2bec8cb09b21846498f3",
  "ref": "inkberrow-walking-route",
  "title": "Inkberrow Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Inkberrow_-_geograph.org.uk_-_3233.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ea4cef247c3a2bec8cb09b21846498f3.gpx",
  "_geoloc": {
    "lat": 52.2138140164,
    "lng": -1.9799035938
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Inkberrow_-_geograph.org.uk_-_3233.jpg",
      "title": "David Stowell / Inkberrow",
      "caption": "The village green in the foreground, with the Old Bull, and the tower of St Peter's church behind. The Bull, the fictional Ambridge pub, is supposed to be based on The Old Bull in Inkberrow. In 2006, Inkberrow was awarded the title of Worcestershire Village of the Year."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Inkberrow_Church_-_geograph.org.uk_-_7652.jpg",
      "title": "Richard Dunn / Inkberrow Church",
      "caption": "Inkberrow Church as seen from Gooms Hill Farm. The current building at the site is believed to date from the 13th Century. During the Civil War, in 1645, Charles I left his maps in the church, after staying the night at the vicarage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Millennium_trail_-_geograph.org.uk_-_1752890.jpg/512px-Millennium_trail_-_geograph.org.uk_-_1752890.jpg",
      "title": "Colin Craig / Millennium trail",
      "caption": "A pond forming part of Inkberrow's Millennium trail."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b7/View_from_Millennium_Seat_at_Inkberrow%27s_Millennium_Green_-_geograph.org.uk_-_553278.jpg",
      "title": "Claire Seyler / View from Millennium Seat at Inkberrow's Millennium Green",
      "caption": "View from Millennium Seat at the Millennium Green. The Green is 9 acres of meadows maintained by volunteers. Here you can sit at the top of the hill and enjoy the views."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Holberrow_Green_Mill-geograph.org-2868077.jpg",
      "title": "Chris Allen / Former windmill - Holberrow Green",
      "caption": "Holberrow Green Mill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/40/Coughton_Court_-_geograph.org.uk_-_1362419.jpg",
      "title": "Richard Croft / Coughton Court",
      "caption": "Coughton Court. Garden front of the historic home of the Throckmorton family since 1412"
    }
  ],
  "distance_km": 11.5,
  "description": "This pretty Worcestershire village includes a picturesque village green, a historic church and a fine local pub. The settlement is notable as the model for Ambridge, the setting of BBC Radio 4's long-running series The Archers. This walk from the village explores the Millennium Green before following a section of the Warwickshire Millennium Way through the countryside to Coughton Court. The walk starts in the village where you can first enjoy a stroll around the Millennium Green. Here you'll find a pleasant boardwalk circuit taking you around a medieval moat. After exploring the green head west through the village to pick up the Warwickshire Millennium Way. You can follow this waymarked footpath north towards Morton Underhill and Holberrow Green. The route continues east towards Cladswell where you pick up the Monarch's Way and follow it east past Coughton Park to Coughton Hall. The fine Tudor mansion includes a walled garden, lake, knot garden, vegetable garden, orchard and bog garden.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Old Bull is a good choice for some post walk refreshment. The 16th century inn includes a charming interior with old beams and inglenook fireplaces. The pub has some interesting history having thought to have been the stop-off point for William Shakespeare, as he was travelling to Worcester to collect his marriage licence to Anne Hathaway. They serve fine home cooked food and also have an outdoor area overlooking the village. You can find them in a nice spot on the village green at postcode WR7 4DZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Old Bull mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Around Coughton Court you can pick up a section of the Arden Way and enjoy a pleasant waterside stroll along the River Arden. The trail will also take you towards the noteworthy Studley Castle. The 19th century country house is now an hotel where you can enjoy afternoon tea and a stroll around the attractive grounds. Just to the west is Flyford Flavell where you can visit the wildlife rich Grafton Wood Nature Reserve. For more walking ideas in the area see the Worcestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/qJ6dT9E5tzE",
  "postcode": "WR7 4DZ",
  "district": "Wychavon",
  "county": "Worcestershire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The White House, Priory Farm Road, Inkberrow, Wychavon, Worcestershire, England, WR7 4DZ, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "rural"
  ],
  "points_of_interest": [
    "historical sites",
    "gardens",
    "park"
  ],
  "facilities": [
    "pub",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}