{
  "created_at": "2025-01-06T07:59:20.734623+00:00",
  "objectID": "ea5b676d099ced5552ae507cc00361a5",
  "ref": "chilton-walking-route",
  "title": "Chilton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/51/Horse_and_Jocky_Hotel%2C_Chilton_-_geograph.org.uk_-_10271.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ea5b676d099ced5552ae507cc00361a5.gpx",
  "_geoloc": {
    "lat": 51.5674192554,
    "lng": -1.295523433
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/51/Horse_and_Jocky_Hotel%2C_Chilton_-_geograph.org.uk_-_10271.jpg",
      "title": "Pam Brophy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Horse and Jocky Hotel: Chilton. This hotel was situated near the roundabout in the middle of the lower half of the grid square, near the southern edge but has now been demolished. The square is largely farmland and also contains school grounds and roads into the International Business Centre."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Chilton_Village_-_geograph.org.uk_-_10265.jpg",
      "title": "Pam Brophy / Chilton Village",
      "caption": "Chilton Village. The first view as one enters the village is the Rose and Crown pub nestled in the foot of the hill with the residences behind it. It is situated in the eastern half of the square near the eastern edge. The view is from the north."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Farmland_near_Chilton_-_geograph.org.uk_-_10267.jpg",
      "title": "Pam Brophy / Farmland near Chilton",
      "caption": "Farmland near Chilton. This view of farmland is somewhat east into the grid square at the treed area marked on the OS Map. The picture was taken from the south side of the road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/04/The_Diamond_Light_Source_Project%2C_Chilton_-_geograph.org.uk_-_10269.jpg",
      "title": "Pam Brophy / The Diamond Light Source Project: Chilton",
      "caption": "The Diamond Light Source Project: Chilton. This intriguing circular building is situated in the eastern half of the grid square near the Rutherford Appleton Laboratory. The project is a joint government and Wellcome Trust research project into materials and medicines and the Environment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/The_Ridgeway%2C_Berkshire_Circular_Route_-_geograph.org.uk_-_10258.jpg",
      "title": "Pam Brophy / The Ridgeway: Berkshire Circular Route",
      "caption": "The Ridgeway: Berkshire Circular Route. This view of the ridgeway is taken looking along the path south east into the grid square. The gallops can be seen in the far distance to the east of the path."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_Ridgeway%2C_East_Hendred_Down_-_geograph.org.uk_-_631530.jpg",
      "title": "Andrew Smith / The Ridgeway, East Hendred Down",
      "caption": "The Ridgeway, East Hendred Down. Looking east as the path makes its way towards Bury Down. It's joined by gallops on its southern side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/90/Gallops_by_the_Ridgeway_-_geograph.org.uk_-_1316091.jpg",
      "title": "Steve Daniels / Gallops by the Ridgeway",
      "caption": "Gallops by the Ridgeway"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d0/West_Ilsley_versus_Grayshot_at_West_Ilsley_-_geograph.org.uk_-_5644.jpg",
      "title": "Pam Brophy / West Ilsley versus Grayshot at West Ilsley",
      "caption": "West Ilsley versus Grayshot at West Ilsley. The cricket pitch is situated at the junction of two roads, opposite the pub on the southern side of the road running from east to northwest across the square and next to Harcourt Farm. The picture was taken from the pub looking south west. The pitch is in the centre of the eastern half of the square, near the edge. This was the first round of the Village knockout series of the season."
    }
  ],
  "distance_km": 9.0,
  "description": "This Oxfordshire based village is in a good location for exploring the countryside of the Vale of White Horse on the nearby Ridgeway. This circular walk from the village visits Chilton Downs and Illsley Downs on the The Ridgeway National Trail to the south. There's fine views over the surrounding area from the high points to enjoy. The walk starts in the village and then follows a bridlepath south west to East Hendred Down. Here you can pick up the Ridgeway and follow the waymarked path south east across Chilton and Illsley Downs. From here you can take a detour from the route to head south and visit the neighbouring village of West Illsley where there's a popular local cricket club. This route passes the A road before turning north west to return to Chilton.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Rose & Crown is a good choice for some post walk refreshment. They serve good quality pub food and have a carvery on Sunday lunchtimes. You can find them on the Main Street with a postcode of OX11 0RZ for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The country trails make for a fine dog walk and the Rose and Crown mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The village is located just south of neighbouring Didcot where you can visit the fascinating Didcot Railway Centre. If you continue west along the Ridgeway you could visit Segsbury Camp hill fort. The periodic occupation of the hill fort between the 6th and 2nd centuries BC suggests that it was a communal centre for various activities, including sheep management and exchange. The circular Letcombe Regis Walk visits the camp from the neighbouring village. There's also an 18th century pub and pretty local nature reserve to visit here.  To the east of the village you can try our Blewbury and Blewburton Hill Walk which visits another interesting Iron Age Hillfort. For more walking ideas in the area see the Oxfordshire Walks page."
    }
  ],
  "postcode": "OX11 0RZ",
  "district": "Vale of White Horse",
  "county": "Oxfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Main Street, Chilton, Vale of White Horse, Oxfordshire, England, OX11 0RZ, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "hill"
  ],
  "points_of_interest": [
    "views",
    "countryside"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}