{
  "created_at": "2025-01-06T08:40:21.266413+00:00",
  "objectID": "eadf2968036feb80cb898d87b4f8a3ce",
  "ref": "armathwaite-walking-route",
  "title": "Armathwaite Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7e/River_Eden_viewed_from_Armathwaite_bridge_-_geograph.org.uk_-_945486.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/eadf2968036feb80cb898d87b4f8a3ce.gpx",
  "_geoloc": {
    "lat": 54.8095937878,
    "lng": -2.7728120385
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7e/River_Eden_viewed_from_Armathwaite_bridge_-_geograph.org.uk_-_945486.jpg",
      "title": "Rob Purvis / River Eden viewed from Armathwaite bridge",
      "caption": "River Eden viewed from Armathwaite bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/34/Front_Street%2C_Armathwaite_-_geograph.org.uk_-_946797.jpg",
      "title": "Richard Webb / Front Street, Armathwaite",
      "caption": "Front Street, Armathwaite"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/The_Citadel_Express_at_Armathwaite_railway_station_in_1978.jpg",
      "title": "Clive Warneford / The Citadel Express",
      "caption": "The Citadel Express at Armathwaite railway station in 1978. This train, which was steam hauled from York to Carlisle and back, is shown stopped at Armathwaite for photographs. The photograph was taken at 17.04 on Saturday 23rd September 1978. The Locomotive is Bulleid Merchant Navy Class No. 35028 'Clan Line'. The train ran with the reporting No.1Z42 and the passengers had originally joined the train at 07.15 at Euston, here the train would return at 22.17."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/The_River_Eden_at_Combe_Wood_-_geograph.org.uk_-_95741.jpg",
      "title": "Keith Wright / The River Eden at Combe Wood",
      "caption": "The River Eden at Combe Wood. The river Eden is a prolific Salmon & Trout river set in one of England's most idyllic valleys, The Eden."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/The_Fox_and_Pheasant%2C_Ainstable_-_geograph.org.uk_-_1158482.jpg",
      "title": "Humphrey Bolton / The Fox and Pheasant, Ainstable",
      "caption": "The Fox and Pheasant, Ainstable. Here three roads converge on their way to a bridge over the River Eden; a good place for an inn, and this one has spread itself through two quite different buildings. Although this group of buildings is in Ainstable Civil Parish, it is near Armathwaite, and this is its postal address."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Armathwaite_Castle_-_geograph.org.uk_-_2708747.jpg/512px-Armathwaite_Castle_-_geograph.org.uk_-_2708747.jpg",
      "title": "Peter McDermott / Armathwaite Castle",
      "caption": "Armathwaite Castle. View from Armathwaite Bridge looking up the River Eden to the Castle."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Vista_-_geograph.org.uk_-_1129562.jpg",
      "title": "John Illingworth / Vista",
      "caption": "Vista. A sculpture by Graeme Mitcheson, the ninth of ten Eden Benchmarks. It represents the rucksack, boots and clothes left on the rock by someone who has gone for a paddle in the river. It's located in Coombes Wood, just to the south of the village."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Armathwaite_Bridge_-_geograph.org.uk_-_1158659.jpg",
      "title": "Humphrey Bolton / Armathwaite Bridge",
      "caption": "Armathwaite Bridge. This has evidently been rebuilt since 1868, as the six-inch map of that date shows it to be very narrow, with cutwaters that probably had passing-places over them."
    }
  ],
  "distance_km": 6.0,
  "description": "This Cumbrian village is located on the splendid Settle Carlisle Railway making it a popular place for starting a walk. The village also includes a couple of excellent old pubs adding to its appeal. There's some lovely walking trails along the river Eden and through the surrounding woodland and countryside too. This circular walk starts from Armathwaite railway station. The station is notable as the final stop on the Settle-Carlisle Line before the terminus at Carlisle. It was opened in May 1876, closed in May 1970 when local passenger trains ceased on the route and reopened by British Rail in July 1986. From the station it is a short stroll south east to the village. Here you can cross the river on Armathwaite Bridge where there are fine views down to the water. The route then picks up a riverside footpath heading south into Coombs Wood. Trails will then take you through the wood to Coombshead and Longdales. Here you can pick up a country lane heading north west back to the village. The lane is in an elevated position giving excellent views across the surrounding countryside of the Eden Valley.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village the Duke's Head is a good choice for some post walk refreshments. The country inn does very good food and has a lovely large garden area for warmer days. You can find them on Front Street with a postcode of CA4 9PB for your sat navs. There's also the Fox and Pheasant. The 17th century coaching inn is in a lovely spot overlooking the river. There's a splendid olde worlde interior here with original wooden beams, exposed stonework and stable stalls. There's also another nice garden here next to the woodland walk. They are also located on Front Street on the opposite side of the river."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and woodland trails are ideal for a dog walk. Both the village pubs mentioned above are also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head south and you can visit another highlight on the railway at Lacys Caves and Long Meg. On this walk you will visit an ancient stone circle and a series of 5 chambers in a red sandstone cliff overlooking the river. Near here is the neighbouring village of Kirkoswald where you can visit the 12th century St Oswald's church and the College, a former Pele tower built in 1450. To continue your walking along the Settle-Carlisle line you could visit the splendid Ribblehead Viaduct. The impressive viaduct carries the Settle-Carlisle Railway across Batty Moss in the valley of the River Ribble at Ribblehead, in North Yorkshire.  For more walking ideas in the area see the Cumbria Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ATQLEZatEc8",
  "district": "Armathwaite",
  "county": "Westmorland and Furness",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Station Road, Hesket, Armathwaite, Westmorland and Furness, England, CA4 9PN, United Kingdom",
  "postcode": "CA4 9PN",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "river",
    "countryside"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "pub/cafe",
    "car park",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}