{
  "created_at": "2025-01-06T02:44:54.753514+00:00",
  "objectID": "eb803feb2a7d6f01d2ae82e5b8254a49",
  "ref": "allendale-walking-route",
  "title": "Allendale Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Allendale_Town_-_geograph.org.uk_-_648145.jpg",
  "nearby": [
    {
      "description": "Isaac's Tea Trail",
      "objectID": "908046917efdc700cc21b8f6af5d2844",
      "ref": "isaacs-tea-trail-walking-route"
    },
    {
      "description": "Allen Banks and Staward Gorge",
      "objectID": "53098583b01b281164a4be625247c55c",
      "ref": "allen-banks-and-staward-gorge-walking-route"
    },
    {
      "description": "Housesteads",
      "objectID": "fc4970e2ccbdc33de9c32fbc7ee26ec1",
      "ref": "housesteads-walking-route"
    },
    {
      "description": "Hadrian's Wall Path",
      "objectID": "25270502c1c6b89b9bc84cfcdd28ab2c",
      "ref": "hadrians-wall-path-walking-route"
    },
    {
      "description": "Hexham",
      "objectID": "791fdfe6ae4a208ef4d9ead8d8c0b38d",
      "ref": "hexham-walking-route"
    },
    {
      "description": "Alston",
      "objectID": "46d26f93cec316cefa1767305d53e310",
      "ref": "alston-walking-route"
    },
    {
      "description": "Rookhope",
      "objectID": "9565b43b640e239cf507fc0173f42397",
      "ref": "rookhope-walking-route"
    },
    {
      "description": "Bardon Mill",
      "objectID": "59fcfa546749f24740915660d44de522",
      "ref": "bardon-mill-walking-route"
    },
    {
      "description": "Allenheads",
      "objectID": "a0f7105253ce541885b196ed11906bb7",
      "ref": "allenheads-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/eb803feb2a7d6f01d2ae82e5b8254a49.gpx",
  "_geoloc": {
    "lat": 54.8977163354,
    "lng": -2.2571649593
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Allendale_Town_-_geograph.org.uk_-_648145.jpg",
      "title": "Mike Quinn / Allendale Town",
      "caption": "Allendale Town"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Hotels_and_pubs_in_Allendale_-_geograph.org.uk_-_541916.jpg",
      "title": "Carol Rose / Hotels and pubs in Allendale",
      "caption": "Hotels and pubs in Allendale. The ivy has completely reclaimed the windows to the former Dale Hotel. The king's Head and Golden Lion Public houses are further along the street. All the buildings front the market place."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/River_East_Allen_3219.JPG/256px-River_East_Allen_3219.JPG",
      "title": "Clem Rutter, Rochester, Kent. / CC BY-SA (https://creativecommons.org/licenses/by-sa/3.0)",
      "caption": "The River East Allen (River Allen, Northumberland) is a tributary of the River South Tyne. It flows to the west of Allendale Town and is crossed by two bridges.Tail race of derelict water mill, on a small burn that flows into the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/River_East_Allen_3237.JPG/512px-River_East_Allen_3237.JPG",
      "title": "Clem Rutter, Rochester, Kent. / CC BY-SA (https://creativecommons.org/licenses/by-sa/3.0)",
      "caption": "The River East Allen. The downstream bridge, Allenmill Bridge, has benefitted from extensive assistance – here we see the fish ladder."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/92/Pastures_near_Thornley_Gate_-_geograph.org.uk_-_680677.jpg",
      "title": "Mike Quinn / Pastures near Thornley Gate",
      "caption": "Pastures near Thornley Gate. Looking across the valley of the River East Allen to The Haining and the houses on Station Road. The farm on the hillside above is Housty"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/52/Housty_bastle_-_geograph.org.uk_-_647091.jpg",
      "title": "Mike Quinn / Housty bastle",
      "caption": "Housty bastle 'Housty is a farm on the east side of the East Allen valley. The farmhouse is dated 1736, but to the north of it is an open area, or green, between ranges of earlier houses. On the north side of the green is an 18th or 19th century byre that is built onto the east end of a bastle, which in turn is built on the east gable of an earlier bastle. All that remains of the earliest bastle is the lower part of the east end, the wall being 1.21m thick. An impressive byre doorway stands in the centre of the wall and has a monolithic lintel. The second bastle is also a ruin and has walls 0.85m thick built of massive stones. Other building foundations to the south may also contain remains of bastles.'"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/33/Houses_at_Thornley_Gate_-_geograph.org.uk_-_639080.jpg",
      "title": "Mike Quinn / Houses at Thornley Gate",
      "caption": "Houses at Thornley Gate"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/61/Smallholding%2C_Catton_Village_-_geograph.org.uk_-_102076.jpg",
      "title": "Richard Young / Smallholding, Catton Village",
      "caption": "Smallholding, Catton Village. The smallholding comprises a cottage with a cattle byre and stable attached with a barn above, all under one roof."
    }
  ],
  "distance_km": 9.0,
  "description": "The village of Allendale is located in a lovely spot by the River East Allen in the North Pennines Area of Outstanding Natural Beauty. It's also located near to Allen Banks and Hadrian's Wall where there are some fine walking opportunities. The stone built village is very pretty and was twice crowned Village of the Year for All England. This circular riverside walk from the town takes you along the Allen and then through the countryside to the neighbouring village of Catton. The walk starts in the town where you can pick up the Isaac's Tea Trail long distance footpath. The trail follows the river north west to Thornley Gate, Bishopfield Haugh and Kittygreen. Near here you cross the river to follow Colliery Lane north east before heading east on countryside paths to Catton. After exploring the village you head south to rejoin the river which you follow back into Allendale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Kings Head is a good choice for some post walk refreshments. They have a good menu and an outdoor area with nice views of the town. It's in a good location on the Market Place with a postcode of NE47 9BD for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river and woodland paths on the trail make for a nice dog walk. The Kings Head pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking around Allenhead head south along the Isaac's Tea Trail to West Allendale and Nenthead. Here you'll find the interesting will find the Nenthead Mining Centre where you can learn all about the industrial history of the North Pennines area. The trail eventually enters Cumbria and the town of Alston with its walks along the South Tyne River and the heritage South Tynedale Railway. A few miles north of the village there's one of the walking highlights of the area at Allen Banks and Staward Gorge near Bardon Mill. This National Trust owned area includes lovely peaceful river and woodland trails with lots of wildlife to see. Just to the north of Allen Banks you'll find Housesteads Roman Fort. Here you can explore the fascinating old fort and pick up the epic Hadrian's Wall Path. The village is also located near Hexham where there are some nice trails along the River Tyne. Just to the north east you could pick up the Haydon Bridge Walk at Langley. The walk will take you to the historic Langley Castle which dates from the 14th century. In the village itself there's a fine 17th century inn and a noteworthy 14th century bridge over the river to see. For more walking ideas in the area see the Northumberland Walks and North Pennines Walks pages."
    }
  ],
  "district": "Allendale",
  "county": "Northumberland",
  "region": "North East",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Peth, Thornley Gate, Allendale, Northumberland, North East, England, NE47 9ND, United Kingdom",
  "postcode": "NE47 9ND",
  "state": "England"
}