{
  "created_at": "2025-01-06T00:48:49.139144+00:00",
  "objectID": "ebae1f1c8cd0f5aba59e40629be8842f",
  "ref": "breedon-hill-walking-route",
  "title": "Breedon Hill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Green_and_memorial_at_Breedon_on_the_hill_-_geograph.org.uk_-_1042743.jpg",
  "nearby": [
    {
      "description": "Staunton Harold Reservoir",
      "objectID": "346d68b440468414343cafa95b753d5d",
      "ref": "staunton-harold-reservoir-walking-route"
    },
    {
      "description": "Calke Park",
      "objectID": "17139caeb345abbd83f1ab4d17669a13",
      "ref": "calke-park-walking-route"
    },
    {
      "description": "Ashby Canal",
      "objectID": "31dbc014e341c34576674a452f27b82c",
      "ref": "ashby-canal-walking-route"
    },
    {
      "description": "Melbourne Hall and Pool",
      "objectID": "d5ca7eeb2a59bbe11c6cfc5b23c3e6e3",
      "ref": "melbourne-hall-and-pool-walking-route"
    },
    {
      "description": "Mountsorrel",
      "objectID": "8e2631b122f8119c7dca4d8f26a7c5b5",
      "ref": "mountsorrel-walking-route"
    },
    {
      "description": "Rothley",
      "objectID": "d4675f16b09aa6fe66dfa725b9afbbd8",
      "ref": "rothley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ebae1f1c8cd0f5aba59e40629be8842f.gpx",
  "_geoloc": {
    "lat": 52.8019823232,
    "lng": -1.3985637868
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Green_and_memorial_at_Breedon_on_the_hill_-_geograph.org.uk_-_1042743.jpg",
      "title": "Andy Jamieson / Green and memorial at Breedon on the hill",
      "caption": "The village green. The circular building is a war memorial. Adjacent to Breedon Hill lies the village of Breedon on the Hill, a parish in northwest Leicestershire. The village is distinguished by its historic church, perched atop the hill, which contains significant examples of Anglo-Saxon sculpture. The village's history is closely intertwined with the hill's monastic past, and it retains a number of historical structures, including a 19th-century lock-up known as the Round House."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f7/Breedon_Priory_Church_on_a_sunny_winter_morning_-_geograph.org.uk_-_288014.jpg",
      "title": "Oxymoron, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Priory Church of St Mary and St Hardulph, Breedon on the Hill. It's a noteworthy building having been originially founded as a monastery in the 7th century. It contains the largest collection, and some of the finest examples, of Anglo-Saxon sculptures in the country. The church has also been known as Breedon Priory and as the Holy Hill Monastery. It is Grade I listing for its exceptional architectural interest. This is the church viewed from the southeast on a sunny December morning. The churchyard is full of 18th and 19th century gravestones which, being made from Swithland Slate, are still completely legible."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cc/Public_Footpath_from_the_Church_to_the_Village%2C_Breedon_on_the_Hill_-_geograph.org.uk_-_930437.jpg",
      "title": "Bill Henderson / Public Footpath from the Church to the Village, Breedon on the Hill",
      "caption": "Public Footpath from the Church to the Village. The hill's limestone grassland supports a variety of flora, including species such as bee orchids, broad-leaved helleborines, and greater butterfly orchids. The area is also home to diverse fauna, with numerous invertebrate species thriving in the ancient woodland habitats."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Breedon_on_The_Hill_-_geograph.org.uk_-_1062826.jpg",
      "title": "Andy Jamieson / Breedon on The Hill",
      "caption": "The view from the Churchyard and Beacon. Historically, Breedon Hill is notable for its Iron Age hill fort, which dates back to around 800–450 BC. The site was later occupied by a monastery, established in the 7th century AD, remnants of which can still be observed today. The hill's geological composition, primarily carboniferous limestone, has been quarried over the centuries, contributing to the area's industrial heritage."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/ca/Breedon_Lockup_-_geograph.org.uk_-_584992.jpg",
      "title": "Ian Calderwood / Breedon Lockup",
      "caption": "Breedon Lockup. The lockup was built in the 18th century to hold local offenders for short periods. Drunks were held there to sober up, which was handy, since the Three Horseshoes Inn is just across the road."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Mercian_Carvings%2C_Breedon-on-the-Hill._-_geograph.org.uk_-_128097.jpg",
      "title": "Colin Smith / Mercian Carvings, Breedon-on-the-Hill.",
      "caption": "Mercian Carvings. Wonderful carvings from the Dark Ages at Breedon. The hilltop church is on the site of an Iron Age camp. It is above the village, on \"The Bulwarks\", a striking hill which has been steadily eroded by quarrying."
    }
  ],
  "distance_km": 1.5,
  "description": "This walk explores the attractive Leicestershire village of Breedon on the Hill. The circular walk starts in the village and heads north to explore Breedon Hill. The hill is composed of Carboniferous limestone and rises to a height of 122 metres (400 ft). You can follow footpaths around the hill and past Breedon Quarry before returning to the village. From the top of the hill there are excellent views of the surrounding countryside. At the summit you'll also find The Bulwarks Iron Age hill fort and Breedon's historic Church of England parish church. The hill top building is something of a local landmark and contains some fascinating ancient sculptures.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head to The Holly Bush for some post walk refreshments. It's a historic pub of some note, dating all the way back to the 16th century. They serve high quality locally sourced food with some particularly delicious pies. The pub can be found at 1 Melbourne Lane with a postcode of DE73 8AT for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The village and hill are a nice place to take your dog for a bracing walk. The Holly Bush Inn mentioned above is also dog friendly and can provide water bowls for your thirsty friend."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "To continue your walking in the area just head a couple of miles east to visit Staunton Harold Reservoir. The expansive lake has some nice waterside trails to try. Just to the south west of the lake you'll also find Calke Park where there's a historic abbey surrounded by some lovely parkland and gardens. The village is not far from Ashby-de-la-Zouch where you can enjoy more waterside walking along the Ashby Canal. Just to the north west there's the neighbouring Derbyshire town of Melbourne, where there are some nice walks around Melbourne Hall and Pool. For more walking ideas in the area see the Leicestershire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/ERfnnc7zO2I",
  "postcode": "DE73 8AN",
  "district": "Breedon on the Hill",
  "county": "Leicestershire",
  "region": "East Midlands",
  "country": "England",
  "gazetteer_found": true
}