{
  "created_at": "2025-01-06T01:03:28.149050+00:00",
  "objectID": "ebf0685cb2220d0779925bc2eb5b034a",
  "ref": "pooles-cavern-and-buxton-country-park-walking-route",
  "title": "Poole's Cavern and Buxton Country Park Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/72/Bridleway_in_Buxton_Country_Park_-_geograph.org.uk_-_1502958.jpg",
  "nearby": [
    {
      "description": "Buxton",
      "objectID": "8f661296a4e61112f48f62fcbf2dd9b6",
      "ref": "buxton-walking-route"
    },
    {
      "description": "Pavilion Gardens Buxton",
      "objectID": "29d97e40ee6218f7ccdfc083079f93aa",
      "ref": "pavilion-gardens-buxton-walking-route"
    },
    {
      "description": "Dane Valley Way",
      "objectID": "582095bf203f299b18ab2b96d6f2fd79",
      "ref": "dane-valley-way-walking-route"
    },
    {
      "description": "Three Shires Head",
      "objectID": "8af34abb4d9976c4dfecd1ff72288ae7",
      "ref": "three-shires-head-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ebf0685cb2220d0779925bc2eb5b034a.gpx",
  "_geoloc": {
    "lat": 53.2498149576,
    "lng": -1.9263344422
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Bridleway_in_Buxton_Country_Park_-_geograph.org.uk_-_1502958.jpg",
      "title": "Bob Jenkins / Bridleway in Buxton Country Park",
      "caption": "Bridleway in Buxton Country Park. Heading downhill towards Poole's Cavern."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Grinlow_Tower_aka_Solomon%27s_Temple_in_Buxton_Country_Park.jpg/256px-Grinlow_Tower_aka_Solomon%27s_Temple_in_Buxton_Country_Park.jpg",
      "title": "Stevekraken / CC BY-SA (https://creativecommons.org/licenses/by-sa/4.0)",
      "caption": "Grinlow Tower. Also known as Solomon's Temple this Grade II listed Victorian folly sits on the summit of Grin Low hill within the park. The structure is a 20-foot-high (6.1 m), two-storey tower built on top of a Bronze Age barrow, sitting on top of a ridge at a height of 440 metres (1,440 ft) above sea level. From the open top of the tower there are good 360-degree views over the town and the surrounding countryside and parts of the Peak District."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/49/Footpath_in_Grin_Plantation_-_geograph.org.uk_-_1745286.jpg",
      "title": "Chris Wimbush / Footpath in Grin Plantation",
      "caption": "Footpath in Grin Low Woods in the park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Grin_Low_Quarry_-_geograph.org.uk_-_1518769.jpg",
      "title": "Alan Murray-Rust / Grin Low Quarry",
      "caption": "Grin Low Quarry. Originally created for the purpose of crating lime, in succession to the smaller scale workings still to be seen on the surrounding hillsides. Operations ceased in the 1950s, but were restarted in 1967 for the extraction of roadstone. This however was short lived due to local protests, ceasing in 1972. The quarry floor now houses a large caravan park and the car park for Buxton Country Park and Grin Low."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Poole%27s_Cavern_-_geograph.org.uk_-_1565540.jpg",
      "title": "Gareth James / Poole's Cavern",
      "caption": "Poole's Cavern. The entrance to the cavern ... the smaller apeture on the left is currently in use, the large entrance to the right was blocked up some years ago."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Poole%27s_cavern_stalagmites.jpg/256px-Poole%27s_cavern_stalagmites.jpg",
      "title": "Stephen Elwyn RODDICK / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Poached Egg Stalagmites, Poole's Cavern. This bizarre set of formations is Poole\u0092s Cavern\u0092s one truly unique feature. The alarming looking \u0091poached egg\u0092 stalagmites are the result of human activity on the ground above the cave, combined with natural processes. Several decades of quarrying resulted in huge mounds of lime waste being dumped on the hillside. Rainwater passing through this fine material picks up an unusually large amount of lime. This results in massively accelerated calcite build-up, the largest features here having taken just 400 years to reach their present size."
    }
  ],
  "distance_km": 4.0,
  "description": "A walk around Buxton Country Park and a visit to Poole's Cavern - a natural limestone cave used as a lair by an outlaw in the fifteenth century. The walk starts underground in limestone caverns with crystal stalactites illuminated with paved walkways and handrails. You then come outside to explore the beautiful country park and woodlands. The route also climbs to the Solomon's Temple viewpoint with superb views of the Peak District. The eye catching Victorian folly is located on the south eastern edge of the park. The park is located a short walk from Buxton town centre. If you would like to continue your walk then the Dane Valley Way also runs through the park. You could also head to the nearby Pavilion Gardens. You can also pick up other long distance trails near the park. The Midshires Way runs through the town and will take you to the lovely Wye Dale on the River Wye. The Pennine Bridleway also runs past Buxton.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There is a decent on site cafe for refreshments after your walk."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The woodland and parkland trails are ideal for dog walking and the on site cafe is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Axe Edge Moor Walk starts from the car park at Buxton Country Park. It takes you across the expansive moorland before reaching Cheeks Hill and the significant site of Three Shires Head. It's a very picturesque spot where the counties of Cheshire, Derbyshire and Staffordshire meet. There's a fine Grade II-listed packhorse bridge over the River Dane and lots of pretty waterfalls to see here. For more walking ideas in the area see the Derbyshire Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/QmxVUmRw91Q",
  "postcode": "SK17 9DH",
  "district": "High Peak",
  "county": "Derbyshire",
  "region": "East Midlands",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Poole's Cavern Visitor Centre, Green Lane, Buxton, High Peak, Derbyshire, East Midlands, England, SK17 9DH, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "limestone",
    "woodland"
  ],
  "points_of_interest": [
    "viewpoints",
    "gardens",
    "historical sites"
  ],
  "facilities": [
    "car park",
    "visitor center",
    "wheelchair accessible"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}