{
  "created_at": "2025-01-06T18:51:08.351558+00:00",
  "objectID": "ebfbdf98206edb82691cb81b7ab1ff0b",
  "ref": "lough-erne-walking-route",
  "title": "Lough Erne Collop Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/43/Lough_Erne_at_Castle_Hume_-_geograph.org.uk_-_2576762.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ebfbdf98206edb82691cb81b7ab1ff0b.gpx",
  "_geoloc": {
    "lat": 54.39971,
    "lng": -7.69298
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/43/Lough_Erne_at_Castle_Hume_-_geograph.org.uk_-_2576762.jpg",
      "title": "Lough Erne at Castle Hume by Kenneth Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Lough Erne is the second-biggest lake system in Northern Ireland and Ulster, and the fourth biggest in Ireland. The lakes are widened sections of the River Erne, which flows north and then curves west into the Atlantic."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/29/View_of_Lough_Erne_from_Devenish_Island_-_geograph.org.uk_-_3056418.jpg",
      "title": "View of Lough Erne from Devenish Island by Kenneth Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "View of Lough Erne from Devenish Island. The lake has more than 150 islands, along with many coves and inlets"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/13/Castle_Hume_Golf_Resort_-_geograph.org.uk_-_5766368.jpg",
      "title": "Castle Hume Golf Resort by Kenneth Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Castle Hume Golf Resort"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Ross_Inner_-_geograph.org.uk_-_2575796.jpg",
      "title": "Ross Inner by Kenneth Allen, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Ross Inner"
    }
  ],
  "distance_km": 3.7,
  "description": "This circular walk takes you around the Collop area Lough Erne Golf Resort in County Fermanagh, Northern Ireland. There's great views over the lough to all the little islands and miles of peaceful woodland trails as well. There is a car parking area just east of Castle Hume Lough, where you can start your walk.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The lakes of Lough Erne are dotted with numerous small islands and peninsulas, often referred to as \"islands\" due to the highly irregular shoreline and because many were distinct islands before two major drainage schemes in the 1880s and 1950s lowered the water level by about 1.5 metres. The Parliamentary Gazetteer of 1846 whimsically suggested there were as many islands as days in the year, but a more realistic count estimated 90 in the Upper Lake and 109 in the Lower. The largest of these islands are Inishmore, located at the northern end of Upper Lough Erne (not to be confused with \"Inish More or Davy's Island\" in Lower Lough Erne), and Galloon Island at the southern end of Upper Lough Erne. Whether these islands are entirely surrounded by the lake or partly bordered by the River Erne is subject to interpretation. Boa Island is another significant island within Lower Lough Erne, and all three of these islands encompass multiple townlands. Many of the other larger islands consist of just one townland each. Notable islands in the lower lake include Boa Island, Cleenishmeen Island, Crevinishaughy Island, and several others like Devenish Island, Ely Island, and White Island. In the upper lake, islands such as Bleanish Island, Crehan Island, Dernish Island, and others including Inishfendra, Inishleague, and Trannish are prominent. Some of these islands are privately owned, occasionally appearing on the property market, such as Inishturk in 2007, listed at £695,000, and Inisliroo in 2012, offered at £600,000. These lake islands serve as a key habitat for the garden warbler, a rare bird in Ireland.  The lough is thought to derive its name either from an ancient group known as the Érainn or from a goddess whom the Érainn were named after. T. F. O'Rahilly proposed that the Érainn named themselves after a goddess called Érann, suggesting that Loch Éirne means \"lake of (the goddess) Érann\". He and other scholars link these names to Ériu (modern Éire), the eponymous goddess of Ireland. O'Rahilly posited that the original forms of these goddess names, Everna/Iverna and Everiu/Iveriu, stemmed from the Indo-European root 'ei-', denoting motion, suggesting a meaning akin to \"she who travels regularly\", a reference to the sun goddess. John T. Koch, however, theorised that Ériu was a mother goddess, with her name deriving from an Indo-European word meaning \"fat, rich, fertile\". Irish mythology and folklore offer several stories about the lake's formation. One legend claims it was named after Erne, a lady-in-waiting to Queen Méabh at Cruachan. Fleeing from a giant emerging from Oweynagat cave, Erne and her maidens drowned, their bodies forming Lough Erne. Patricia Monaghan noted that such myths often symbolise a goddess's divine power infusing the water with life. Another story tells of the lake forming from an overflowing magical well, similar to Lough Neagh's origin myth. A third account describes a battle between the Érainn and High King Fíachu Labrainne's army, during which the lake emerged and engulfed the Érainn. In \"Cath Maige Tuired\" (the Battle of Moytura), Lough Erne is listed as one of Ireland's twelve chief loughs. Historically, it was also known as Loch Saimer, named in folklore after a hound killed by Partholón in a jealous rage. Lough Erne features in a folk tale titled \"The Story of Conn-eda\" or \"The Golden Apples of Lough Erne\", from the 1888 collection \"Fairy and Folk Tales of the Irish Peasantry\". The story follows Conn-eda's quest to retrieve three golden apples, a black steed, and a supernatural hound from a city beneath Lough Erne, ruled by a Fir Bolg king."
    }
  ],
  "video_url": "https://www.youtube.com/embed/sX4wEcQ3_kQ?si=5Mdr8_7_lGvmd9BX",
  "gazetteer_found": false,
  "nominatim_found": true,
  "display_address": "Lough Erne Golf Resort, Drumcose Road, Carrigan, Fermanagh and Omagh District, Northern Ireland / Tuaisceart Éireann, BT74 8EQ, United Kingdom",
  "postcode": "BT74 8EQ",
  "district": null,
  "county": null,
  "region": null,
  "state": "Northern Ireland / Tuaisceart Éireann",
  "country": "United Kingdom",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "coastal"
  ],
  "points_of_interest": [
    "viewpoints"
  ],
  "facilities": [
    "car park"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}