{
  "created_at": "2025-01-06T01:46:53.232128+00:00",
  "objectID": "ec2dd412bf73a76208eeb393c1b23372",
  "ref": "capital-ring-walking-route",
  "title": "Capital Ring Walk and Cycle Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Wimbledon_Common_Windmill_-_geograph.org.uk_-_879461.jpg",
  "nearby": [
    {
      "description": "Brentford Canal Walk",
      "objectID": "126ba9b8aa867581780c86ce020c01d4",
      "ref": "brentford-canal-walk-walking-route"
    },
    {
      "description": "Horsenden Hill",
      "objectID": "d1d99ec5fa0748eaf0a5db580280101d",
      "ref": "horsenden-hill-walking-route"
    },
    {
      "description": "Tooting Bec Common",
      "objectID": "fc00333273de038d7fe4032fa7a598af",
      "ref": "tooting-bec-common-walking-and-cycle-route"
    },
    {
      "description": "Hampstead Heath",
      "objectID": "7454be7653cb8e4ef0870c2419e7356a",
      "ref": "hampstead-heath-walking-and-cycle-route"
    },
    {
      "description": "Beverley Brook Walk",
      "objectID": "cb9d2caf633adf2bfe8a4d5041043d5c",
      "ref": "beverley-brook-walk-walking-route"
    },
    {
      "description": "Richmond Park",
      "objectID": "47915094402f026d119940fe0df24241",
      "ref": "richmond-park-walking-and-cycle-route"
    },
    {
      "description": "Ham House Richmond",
      "objectID": "267b3c34ca0951989aa9511c3185eec1",
      "ref": "ham-house-richmond-walking-route"
    },
    {
      "description": "Wimbledon Common",
      "objectID": "c9e8708094a0c9c7bc62a5df5a345470",
      "ref": "wimbledon-common-walking-and-cycle-route"
    },
    {
      "description": "Olympic Park",
      "objectID": "0488cfea1ac5b26d3a4a829c6ad5adc9",
      "ref": "olympic-park-walking-and-cycle-route"
    },
    {
      "description": "Beckenham Place Park",
      "objectID": "4fbe9ca16ee8c9430b911828385aa596",
      "ref": "beckenham-place-park-walking-route"
    },
    {
      "description": "Brent Reservoir",
      "objectID": "77350c947cc529cb1da5217f69804bfd",
      "ref": "brent-reservoir-walking-and-cycle-route"
    },
    {
      "description": "Green Link Walk",
      "objectID": "0307081f862569a84e2737a278adc771",
      "ref": "green-link-walk"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ec2dd412bf73a76208eeb393c1b23372.gpx",
  "_geoloc": {
    "lat": 51.4986717807,
    "lng": 0.061695378
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Wimbledon_Common_Windmill_-_geograph.org.uk_-_879461.jpg",
      "title": "Shaun Ferguson / Wimbledon Common Windmill",
      "caption": "Wimbledon Common Windmill. The 1,140 acre common includes a network of walking and cycling trails. There's also secluded ponds, a golf course and woodland trails. In the woodlands along the route, such as those found in Wimbeldon Common, Richmond Park and Highgate Wood, you'll encounter tree species like oak, ash, birch, and sycamore. These areas are home to wildflowers including bluebells in spring, and fungi during the autumn months. The undergrowth provides habitat for small mammals like hedgehogs and a variety of invertebrates. Urban parks and heaths, including Hampstead Heath and Wimbledon Common, feature grasslands and heathland flora like heather and gorse. These open spaces are important habitats for butterflies, bees, and ground-nesting birds. Notably, Hampstead Heath is home to about 180 bird species and 23 species of butterflies."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/60/Capital_Ring_Signpost_-_geograph.org.uk_-_1318318.jpg",
      "title": "Martin Addison / Capital Ring Signpost",
      "caption": "Capital Ring Signpost. Giving distances to various points along the way. The furthest listed being Woolwich Foot Tunnel to the left at sixteen and a half miles and Richmond Bridge to the right at twenty-six and a half miles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Brent_Reservoir_-_geograph.org.uk_-_501767.jpg",
      "title": "Nigel Cox / Brent Reservoir",
      "caption": "Brent Reservoir. The reservoir was created by the construction of a dam across the River Brent which was built between 1833 and 1835, and extended in 1854, in order to provide water for the Paddington Arm of the Grand Union Canal. The Grand Union Canal, and their successors, British Waterways, owned or own the reservoir, which has also been known as the Kingsbury Reservoir and the Welsh Harp Reservoir in the past. This is the northern section, viewed from Cool Oak Bridge, and is fed by the Silk Stream."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/24/Beckenham_Place_-_geograph.org.uk_-_486550.jpg",
      "title": "I M Chengappa / Beckenham Place",
      "caption": "Beckenham Place. The original house, focal point of Beckenham Place Park, now used as a golf centre. The surrounding park covers 237 acres with ancient woodland, a sensory garden and a Grade II listed mansion."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Fishing_lake%2C_Tooting_Bec_Common_-_geograph.org.uk_-_26182.jpg",
      "title": "Noel Foster / Fishing lake, Tooting Bec Common",
      "caption": "Fishing lake, Tooting Bec Common. The 221 acre park includes avenues of trees, acid grassland and a small pond with wildlife."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Pen_Ponds_-_geograph.org.uk_-_810218.jpg",
      "title": "Trevor Rickard / Pen Ponds",
      "caption": "Pen Ponds, Richmond Park. The path passes between these pretty ponds in Richmond Park. The lake is divided in two by a causeway, which was dug in 1746 and is now a good place to see water birds. In this area you'll also pass Sidmouth Wood and the ornamental Isabella Plantation, a fenced area within the park. It covers 40 acres and includes evergreen azaleas, ponds, Rhododendrons and Camellias. The park is a major route highlight with resident deer and miles of trails to try. At 955 hectares (or 2,360 acres) it is the largest of London's Royal Parks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/99/Mixed_Bathing_Pond%2C_Hampstead_Heath_-_geograph.org.uk_-_1029150.jpg",
      "title": "Stephen McKay / Mixed Bathing Pond, Hampstead Heath",
      "caption": "Mixed Bathing Pond, Hampstead Heath. This pond is the uppermost of the three Hampstead Ponds at the southern end of Hampstead Heath, created in the 18th century by damming Hampstead Brook, a tributary of the River Fleet,to supply London with water. Mixed bathing is allowed here during the summer months. The 790 acre park includes the (322 ft) high Parliament Hill where you can enjoy fine views to some of London's major landmarks."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Finsbury_Park_-_geograph.org.uk_-_681145.jpg",
      "title": "Stephen McKay / Finsbury Park",
      "caption": "Finsbury Park. Seen here near to the Oxford Road gate. Finsbury Park was opened by the Metropolitan Board of Works in August 1869, replacing Finsbury Fields as a facility for the people of Finsbury (hence the name). It is now run by Haringey Council. The historic park was one of the first city parks to be created during the Victorian era. In the park you'll find a boating lake, a waterside cafe and lovely gardens."
    }
  ],
  "distance_km": 126.0,
  "description": "This 78 mile circular walk takes you on a tour through London passing many of its most famous landmarks and through some of its most attractive parks and green areas. The route officially starts at Woolwich foot tunnel by the Thames Barrier and first heads south passing through Eltham, Beckenham Place Park and Tooting Bec Common before reaching Wimbledon with its famous common and windmill. You continue through Richmond Park to Richmond where a pleasant stretch along the Thames takes you past the popular gardens at Kew. Soon after you join the Grand Union Canal for more pleasant waterside walking, passing Brentford and Hanwell on your way to Harrow. The route then turns east passing Brent Reservoir, Wembley Stadium, Hampstead Heath and Finsbury Park. The final section takes you through the delightful Lee Valley Park, past Stratford and the Olympic Park before returning to the Woolwich foot tunnel. Several sections are suitable for cyclists. There are also a number of National Cycle Network Routes you can pick up. These can be seen on the OS map below.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's an abundance of fine cafes and pubs around Hampstead Heath. One noteworthy place worth consideration is The Spaniards Inn. The pub dates from 1585 and has some interesting literary connections. John Keats apparently penned Ode to a Nightingale in the garden and the pub is also mentioned in Charles Dickens’ Pickwick Papers. There's an attractive interior with oak-panelled walls, chandeliers, beams and log fires. Outside there's a nice garden with a BBQ on warmer days. You can find the inn on Spaniards Road at the north western end of the heath. Postcode for your sat nav is NW3 7JJ. In Eltham there's some interesting pubs to investigate. One place of note in this area is the 16th century Tudor Barn which is slightly off the route. The unique venue is notable as the only existing Tudor Barn in London. There's a wonderful, large outdoor area here where you can enjoy a meal with views over the surrounding gardens. It's a special place and ideal location to rest your legs on summer days. Indoors there's an attractive, modern interior with real fires in a cosy atmosphere. After your meal you can enjoy a stroll around the 13 acres of gardens where there's a medieval moat. You can find the barn at Well Hall Pleasaunce, Well Hall Rd with a postcode of SE9 6SZ. You could also head to the Park Tavern where there's a nice rear garden which is a nice place to relax outside on warmer days. There's also a good menu and a terrace at the front. You can find the pub just off the route at 45 Passey Place with a postcode of SE9 5DA for your sat navs.In this are we'd also recommend a visit to Eltham Palace, one of the highlights on the route. A medieval palace and then a Tudor royal residence, the palace was transformed into a striking Art Deco mansion by millionaires Stephen and Virginia Courtauld. The site also includes 19 acres of lovely gardens with a pretty moat crossed by a 15th-century bridge. At Wimbledon Common the Windmill Tearooms are a fine place to stop. There's lots of outdoor seating where you can enjoy a meal with a view of the old mill and the common. There's also a small museum to visit where you can learn about milling history in the area."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Green Link Walk links with the route at the Walthamstow Reservoirs. This waymarked trail takes you from the edge of Epping Forest to Peckham, passing a number of London's pleasant Green spaces on the way."
    }
  ],
  "video_url": "https://www.youtube.com/embed/tf3OImgkgFw",
  "district": "Woolwich",
  "county": "Greater London",
  "region": "London",
  "country": "England",
  "gazetteer_found": true
}