{
  "created_at": "2025-01-06T08:17:27.671342+00:00",
  "objectID": "ec5dbc46817bb0d9a49bf362208bac1c",
  "ref": "detling-hill-walking-route",
  "title": "Detling Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Detling_Hill.jpg/512px-Detling_Hill.jpg",
  "nearby": [
    {
      "description": "Boxley",
      "objectID": "e37722f0b165c2cec70c1dcb0347f416",
      "ref": "boxley-walking-route"
    },
    {
      "description": "Bearsted",
      "objectID": "089ca0d6a3c84a936c06b0c8acc2bbad",
      "ref": "bearsted-walking-route"
    },
    {
      "description": "White Horse Wood Country Park",
      "objectID": "247d5a2225061acac4e9f002c943112a",
      "ref": "white-horse-wood-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ec5dbc46817bb0d9a49bf362208bac1c.gpx",
  "_geoloc": {
    "lat": 51.2963206549,
    "lng": 0.5696199346
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Detling_Hill.jpg/512px-Detling_Hill.jpg",
      "title": "The original uploader was StephenDawson at English Wikipedia. [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "View south from Detling Hill, part of the North Downs in Kent, looking out across the Low Weald."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3a/On_Detling_Hill_-_geograph.org.uk_-_6793.jpg",
      "title": "Richard Webb / On Detling Hill, via Wikimedia Commons",
      "caption": "On Detling Hill. Ranks of Tully tubes show the transition between arable land, there was still stubble underfoot, and woodland. A flat topped hill on the North Downs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Pill_Box%2C_Detling_Hill.jpg/512px-Pill_Box%2C_Detling_Hill.jpg",
      "title": "Tony Grist [Public domain], via Wikimedia Commons",
      "caption": "Pill Box, Detling Hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/46/Thurnham_Castle_02.jpg",
      "title": "Jacqui Sadler [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Thurnham Castle"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/The_Street%2C_Detling_-_geograph.org.uk_-_4918604.jpg/512px-The_Street%2C_Detling_-_geograph.org.uk_-_4918604.jpg",
      "title": "The Street, Detling by Chris Whippet, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "A view of the main street in Detling village which lies just to the west of the hill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b4/The_Cock_Horse%2C_Detling_-_geograph.org.uk_-_1469903.jpg",
      "title": "Chris Whippet / The Cock Horse, Detling",
      "caption": "The Cock Horse. A nice place to relax in the village after your exercise."
    }
  ],
  "distance_km": 5.0,
  "description": "This walk climbs to Detling Hill, just to the east of the village of Detling in Kent. The hill is located in the Kent Downs area of the North Downs and provides fine views over the surrounding countryside from the summit. You can start the walk from Detling village and follow the North Downs Way east to Gorse Farm before picking up other paths to take you to the hill top which stands at a height of 200 m (660 ft). It's only about a one mile walk from the village and a fairly easy climb so suitable for most abilites. After taking in the fine views over the Low Weald, the route then descends to Thurnham Castle in White Horse Wood Country Park. Here you'll find the remains of a 12th-century flint-built castle constructed by Robert of Thurnham in the reign of Henry II. The route then proceeds to the village of Thurnham where you can enjoy refreshments at the cafe before retracing your steps back to Detling.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Cock Horse is located in the village and includes a restaurant serving traditional pub food cooked fresh to order from local seasonal produce. It's an historic place too, dating back to the 14th century. The pub's name is derived from the need to supply a “cock” or trace horse to provide the necessary horsepower to get stage coaches and heavy carts up the hill. They have a charming old interior and a nice garden area for warmer weather. You can find them on the Main Street at postcode ME14 3JT for your sat navs. They also have a parking area and are dog friendly too."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the west there's the lovely village of Boxley to visit. Here you'll find the noteworthy Boxley Warren Nature Reserve and the remains of the 12th century Boxley Abbey. Just to the east there's the circular Bearsted Walk which you can pick up around Thurnham Castle. The neighbouring village is worth a visit with a nice village green, a 13th century church, a conservation area with many historic listed buildings and a 17th century pub to see. To the south east there's the village of Hollingbourne. The historic village includes over a hundred listed buildings including some fine timber framed structures on Eyhorne Street and the noteworthy All Saints Church which dates from the 14th century. There's also a splendid 11th century pub to investigate after your exercise. Just to the north of here there's also the lovely Hucking Estate which includes a Norman church, a waymarked sculpture trail and another fine country pub at the north western end. For more walking ideas in the area see the Kent Downs Walks and North Downs Walks pages."
    }
  ],
  "postcode": "ME14 3EY",
  "district": "Maidstone",
  "county": "Kent",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Street, Detling, Maidstone, Kent, England, ME14 3EY, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1 hour",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "hill"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "cafe",
    "visitor center"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}