{
  "created_at": "2025-01-06T01:34:45.780679+00:00",
  "objectID": "ecf8c25ca1dcd66c28fa19e4478afbe8",
  "ref": "box-hill-circular-walk-walking-route",
  "title": "Box Hill Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/42/Fort_Cottages%2C_Box_Hill_-_geograph.org.uk_-_64731.jpg",
  "nearby": [
    {
      "description": "Box Hill Country Park",
      "objectID": "63b190df978b0c08e3925dd462c45224",
      "ref": "box-hill-country-park-walking-route"
    },
    {
      "description": "Norbury Park",
      "objectID": "49459a09712824ac72aad3c871ff28d5",
      "ref": "norbury-park-walking-route"
    },
    {
      "description": "Headley Heath",
      "objectID": "6b5785fae1b7a99e297a9309616168d5",
      "ref": "headley-heath-walking-and-cycle-route"
    },
    {
      "description": "Mole Gap Trail",
      "objectID": "988a93aefb55a0cc161669ee47f431b2",
      "ref": "mole-gap-trail-walking-route"
    },
    {
      "description": "Pilgrims Way",
      "objectID": "c9060cc7e9b3607fe230e1cdf4b33022",
      "ref": "pilgrims-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ecf8c25ca1dcd66c28fa19e4478afbe8.gpx",
  "_geoloc": {
    "lat": 51.247347781,
    "lng": -0.3113429648
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/42/Fort_Cottages%2C_Box_Hill_-_geograph.org.uk_-_64731.jpg",
      "title": "Hywel Williams / Fort Cottages, Box Hill",
      "caption": "Fort Cottages, Box Hill. These cottages used to house the caretaker of the nearby fort. Today they are the visitor centre for the National Trust. You can start the walk from the car park here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Box_Hill_Fort_-_geograph.org.uk_-_64729.jpg",
      "title": "Hywel Williams / Box Hill Fort",
      "caption": "Box Hill Fort. Part of a line of 13 forts along the south to protect London, built in 1899. Never permanently manned, the adjacent building which housed the fort's caretaker now houses the National Trust visitor centre. The fort itself is now a listed building and today is the home to a colony of bats. Special large grilles have been fitted to the door to allow them to come and go as they like."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Pixham_from_Box_Hill_%28geograph_3074546%29.jpg/512px-Pixham_from_Box_Hill_%28geograph_3074546%29.jpg",
      "title": "Colin Smith / Pixham from Box Hill",
      "caption": "Pixham from Box Hill. Box Hill is a remarkable site of biodiversity, renowned for its chalk downland ecosystems. The flora here is diverse and includes species uniquely adapted to the nutrient-poor, alkaline soils. Orchids such as bee orchids, pyramidal orchids, and fragrant orchids thrive in this habitat, adding colour and interest during their flowering season. The area is also named after the box tree, which forms part of the distinctive woodland found on the hill. Wildflowers, including clustered bellflowers, enhance the landscape, especially in the blooming season, creating a vibrant and ecologically significant environment."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/25/Norbury_Park_Farm_-_geograph.org.uk_-_686174.jpg",
      "title": "Colin Smith / Norbury Park Farm",
      "caption": "Norbury Park Farm. Interesting mix of farm buildings beside the River Mole (behind the farm). The ground is mainly clay."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/08/Downland_in_Norbury_Park_-_geograph.org.uk_-_686022.jpg",
      "title": "Colin Smith / Downland in Norbury Park",
      "caption": "Downland in Norbury Park. Looking north towards Leatherhead across the grassy hillside on the west side of the Mole Gap. Here is a clay capping on top of the chalk and flint North Downs."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/The_Gallops%2C_Mickleham_Downs_-_geograph.org.uk_-_1395052.jpg",
      "title": "Colin Smith / The Gallops, Mickleham Downs",
      "caption": "The Gallops, Mickleham Downs. Downland scenery - grass and woodland on a chalk and flint base. The gallops here head in the direction of Cherkley Wood. Geologically and physically part of Box Hill of the same composition but with an indent (cleft) across all but the eastern part separating the two. The fauna at Box Hill is also fascinating. It is a hotspot for butterflies, with species such as the Adonis blue, chalkhill blue, and silver-spotted skipper frequently seen fluttering through the grasslands. These butterflies rely on the diverse array of wildflowers for nectar and as breeding grounds. Bats are also a notable presence, with populations of brown long-eared bats, noctule bats, and Natterer's bats thriving in the area. These creatures benefit from the availability of roosting sites in both natural features and old structures. The birdlife is rich too, supported by the mosaic of habitats that range from chalk grassland to scrub and woodland. The blackcap, known for its melodious song, and the chaffinch, recognised for its colourful plumage and vibrant calls, are commonly seen here. Birds of prey such as buzzards and sparrowhawks are frequently observed soaring above the landscape in search of food."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/Headley_Heath_-_geograph.org.uk_-_1396324.jpg",
      "title": "Colin Smith / Headley Heath",
      "caption": "Headley Heath. Deeply incised dry valleys on Headley Heath. Grass and deciduopus woodland clothe the sandy hills and valleys."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c2/The_Hand_in_Hand_public_house_-_geograph.org.uk_-_28969.jpg",
      "title": "Hywel Williams / The Hand in Hand public house",
      "caption": "The Hand in Hand public house. This public house is in Box Hill and is situated on the road that leads to the National Trust Box Hill area."
    }
  ],
  "distance_km": 12.7,
  "description": "The Box Hill area is a magnet for walkers with miles of heathland, woodland and country trails to try. With views of the Surrey Hills and the North Downs it's a place where you can walk for hours with wonderful scenery. This circular walk visits several highlights of the area including Box Hill Country Park, Norbury Park and Headley Heath. The route runs for about 8 miles with some moderate hill climbs on the way. The walk starts from the National Trust visitor centre and car park at the country park. From here you can pick up the Mole Gap Trail and follow it north east along the River Mole towards Swanworth Farm and Norbury Park. In the park you'll find a Georgian manor house, peaceful woodland trails and chalk grassland with lots of wildflowers and butterflies to see. Look out for wildlife which includes roe deer, badgers, foxes and woodpeckers. The route then turns east following footpaths towards Mickleham Downs where there is a small climb and more woodland trails. You then turn south, passing along the edge of the expansive Headley Heath and the High Ashurst Education Centre. The heathland here is very attractive with yellow gorse, bluebell woods and purple heathers in the warmer months. The trail then leads you through Box Hill village before picking up the Pilgrims Way long distance trail. This will lead you west back to the car park where the route finishes.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The King William IV pub is a great place to stop on the route. The main draw here is a wonderful garden terrace where you can enjoy your meal with panoramic views of the Mole Valley. On colder days you can sit inside next to the crackling log fire. You can find the pub at Byttom Hill, Mickleham with a postcode of RH5 6EL for your sat navs. Near the village of Westhumble there's The Stepping Stones. They serve good quality food which you can enjoy in another lovely garden area. They are located just east of the train station at Westhumble Street with postcode RH5 6BS for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The heathland, woodland and hills of the area are ideal for dog walking so you will probably see plenty of other owners with their pets on a fine day. Most of the area is fine for off lead although it's best to keep them on leads around car parks, visitor areas and livestock. The King William IV pub mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Box Hill and Westhumble train station is located just west of the park. The station is a good access point for the walk if you were coming by public transport. It's reachable from London Victoria via Sutton, London Waterloo via Wimbledon and Dorking. Westhumble also includes the noteworthy ruins of a 12th century chapel and the Stepping Stones public house."
    }
  ],
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Zig Zag Road, Brockham, Pixham, Mole Valley, Surrey, England, RH4 1NT, United Kingdom",
  "postcode": "RH4 1NT",
  "district": "Mole Valley",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "woodland",
    "heathland",
    "grassland"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "wildlife"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "education center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}