{
  "created_at": "2025-01-06T01:06:40.536953+00:00",
  "objectID": "ed042bab5882f177a285eb0d06289e81",
  "ref": "didsbury-walking-route",
  "title": "Didsbury Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Didsbury_Clock_Tower_-_geograph.org.uk_-_2671174.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ed042bab5882f177a285eb0d06289e81.gpx",
  "_geoloc": {
    "lat": 53.4104840212,
    "lng": -2.2320432029
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/3f/Didsbury_Clock_Tower_-_geograph.org.uk_-_2671174.jpg",
      "title": "Didsbury Clock Tower by Gerald England, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Didsbury Clock Tower"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Didsbury_Park_-_geograph.org.uk_-_3855324.jpg/512px-Didsbury_Park_-_geograph.org.uk_-_3855324.jpg",
      "title": "Didsbury Park by Richard Cooke, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Didsbury Park. A pleasant park to relax in with a nice cafe and gardens."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Fletcher_Moss_Gardens%2C_rockery_-_geograph.org.uk_-_4612747.jpg/512px-Fletcher_Moss_Gardens%2C_rockery_-_geograph.org.uk_-_4612747.jpg",
      "title": "Fletcher Moss Gardens, rockery by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Fletcher Moss Gardens, rockery"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/The_Old_Parsonage_Gardens_-_geograph.org.uk_-_3547855.jpg/512px-The_Old_Parsonage_Gardens_-_geograph.org.uk_-_3547855.jpg",
      "title": "The Old Parsonage Gardens by Anthony Parkes, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "The Old Parsonage Gardens"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/River_Mersey%2C_East_Didsbury_-_geograph.org.uk_-_3350958.jpg/512px-River_Mersey%2C_East_Didsbury_-_geograph.org.uk_-_3350958.jpg",
      "title": "River Mersey, East Didsbury by Peter Barr, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "River Mersey, East Didsbury"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Didsbury%2C_Stenner_Woods_-_geograph.org.uk_-_4612719.jpg/512px-Didsbury%2C_Stenner_Woods_-_geograph.org.uk_-_4612719.jpg",
      "title": "Didsbury, Stenner Woods by Mike Faherty, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Didsbury, Stenner Woods"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/The_Didsbury_pub%2C_Manchester_%282%29.JPG/512px-The_Didsbury_pub%2C_Manchester_%282%29.JPG",
      "title": "Rept0n1x, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
      "caption": "The Didsbury pub - a view of the pub's garden area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Marie_Louise_Gardens_.jpeg/512px-Marie_Louise_Gardens_.jpeg",
      "title": "Cnbrb, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
      "caption": "Marie Louise Gardens. A hidden gem located west of the village."
    }
  ],
  "distance_km": 3.6,
  "description": "This pleasant village in Manchester is a fine place for a stroll. Didsbury has several fine parks, an attractive high street, a nature reserve and riverside walks along the Mersey which runs south of the village. There's also a fine historic pub to relax in after your exercise. This circular walk first takes you around the lovely gardens at Fletcher Moss Park and the adjacent Parsonage Gardens. You'll then enjoy a riverside walk along the River Mersey and some pleasant woodland trails through Stenner Wood. Along the way you can look out for wildlife including herons by the river and various woodland birds in Stenner Wood nature reserve. The Trans Pennine Trail runs through the area so this is a good option for continuing your walking. You could follow the trail west to visit the lovely Chorlton Water Park where there is a fine waterside path around the large lake.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Didsbury pub is located in a good spot next to Parsonage Gardens and Fletcher Moss on the former Didsbury Village Green. The historic pub dates from the 18th century and retains several original features, including exposed wooden beams and open fireplaces. They have a good menu of traditional pub food which you can enjoy in the large garden area. Historical notes: The pub restaurant is a former coaching house from the 18th century, situated on the grounds where an even older inn, the Ring O'Bells, once stood. This inn's origins date back to the year 1644 during the turbulent period of the English Civil War. Notably, in 1785, Bonnie Prince Charlie, also known as the Young Pretender, is believed to have set up camp near The Didsbury with his army. Following his defeat in Derby, he returned to the vicinity in a disheveled state. The expansive beer garden now occupying the front of the pub restaurant was once the location of Didsbury Village Green. This positioning placed The Didsbury, formerly the Ring O'Bells, at the heart of village life during that time. You can find them at 852 WILMSLOW ROAD, DIDSBURY, LANCASHIRE, M20 2SG. You could also head into the lovely Didsbury park where you will find a decent cafe. The park emerged as an early example of a municipally planned park within the city. Its redesign during the 1920s aimed to incorporate recreational amenities for local residents, and several of these original features endure. The park primarily comprises areas of landscaped grass, woodland, and diverse flora. There is speculation that an aged air-raid shelter might be situated beneath the football field. You can find them at postcode M20 5LS."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Marie Louise Gardens, are located just west of Didsbury's centre. It is a comparatively small park established in 1903 as a tribute to Marie Louise Silkenstadt. The garden is adorned with a variety of uncommon and distinctive tree species. It's something of a hidden gem and a lovely oasis of calm and beauty in the area. You can find the gardens at 31 Holme Rd, Manchester M20 2UP."
    }
  ],
  "video_url": "https://www.youtube.com/embed/efIKWr4VBHs",
  "district": "Manchester",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}