{
  "created_at": "2025-01-06T03:28:04.326078+00:00",
  "objectID": "ed1bad02d6f3198babed582018f841e8",
  "ref": "beecraigs-country-park-walking-and-cycle-route",
  "title": "Beecraigs Country Park Walking and Cycle Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Boardwalk%2C_Beecraigs._-_geograph.org.uk_-_65254.jpg",
  "nearby": [
    {
      "description": "Muiravonside Country Park",
      "objectID": "47954f93733cb2d38a2f4c52100a2ddd",
      "ref": "muiravonside-country-park-walking-route"
    },
    {
      "description": "Union Canal",
      "objectID": "77b1ab0368473322069a55d3775070fc",
      "ref": "union-canal-walking-and-cycle-route"
    },
    {
      "description": "Linlithgow Loch",
      "objectID": "ac1ec36965a7fdca387f31b16c06c313",
      "ref": "linlithgow-loch-walking-route"
    },
    {
      "description": "Linlithgow Canal Walk",
      "objectID": "ec12c58779813e7645468428d9cec039",
      "ref": "linlithgow-canal-walk"
    },
    {
      "description": "Lochcote Reservoir",
      "objectID": "d185536aed3940b89d243f9484c5c269",
      "ref": "lochcote-reservoir-walking-route"
    },
    {
      "description": "Cairnpapple Hill",
      "objectID": "4f690e29d53bd8f70dd1b09bcc19dd2a",
      "ref": "cairnpapple-hill-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ed1bad02d6f3198babed582018f841e8.gpx",
  "_geoloc": {
    "lat": 55.9535228135,
    "lng": -3.5939920046
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Boardwalk%2C_Beecraigs._-_geograph.org.uk_-_65254.jpg",
      "title": "Richard Webb / Boardwalk, Beecraigs.",
      "caption": "Boardwalk, Beecraigs. Path crossing a burn and marsh in near Beecraigs Reservoir. This square is mostly forest that is managed as a country park."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9d/Fishermen_on_Beecraigs_Loch_-_geograph.org.uk_-_545216.jpg",
      "title": "Tom Sargent / Fishermen on Beecraigs Loch",
      "caption": "Fishermen on Beecraigs Loch. There is a fish farm in the grounds of Beecraigs. Some of the produce is released into the loch and others go to stock nearby fishing centres."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Deer_feeding_at_Beecraigs_-_geograph.org.uk_-_1749463.jpg/512px-Deer_feeding_at_Beecraigs_-_geograph.org.uk_-_1749463.jpg",
      "title": "M J Richardson / Deer feeding at Beecraigs",
      "caption": "Deer feeding at Beecraigs Part of the Beecraigs Country Park, with the Riccarton Hills beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/cd/Beecraigs_Woods._-_geograph.org.uk_-_65258.jpg",
      "title": "Richard Webb / Beecraigs Woods.",
      "caption": "Beecraigs Woods. This square is mostly forest that is managed as a country park. This is a relatively mature stand, having been planted in 1958. Most forests get cut down long before the trees get this big, but the recreation remit of the management here probably means the trees get a longer life. (There is a lot of windthrow in the forest. When trees get big, the wind sees to the ones that escape the chainsaw.)"
    }
  ],
  "distance_km": 8.0,
  "description": "Enjoy a peaceful cycle or walk around this beautiful country park in Linlithgow, West Lothian. There are 913 acres to explore with a multitude of woodland trails suitable for leisure cyclists, mountain bikers and walkers. For cyclists there are several graded trails ranging from Green (easy) to Red (difficult) and Black (Severe). There are also miles of well surfaced paths through the forest for walkers to enjoy. You can climb Cockleroy Hill for fabulous views of the surrounding countryside and follow the waterside path around Beecraigs loch. The park has an excellent visitor centre with maps and leaflets. Wildlife in the park includes a red deer herd and Highland Cattle. Beecraigs is located less than 2 miles south of Linlithgow. If you would like to continue your outing you could head to the nearby Muiravonside Country Park where you will find 170 acres of woodland and parkland with views of the River Avon. A stroll around Linlithgow Loch or along the Union Canal are other good options.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a lovely on site cafe selling a good range of meals and snacks. They have plenty of outdoor seating with views of the park."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The parkland and woodland trails are ideal for dog walking so you'll probably see plenty of other owners on your visit."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "On the western side of the park you can pay a visit to Lochcote Reservoir and Cockleroy Hill. From the hill top there are excellent views over the park and the surrounding Bathgate Hills. The picturesque reservoir has some nice waterside trails leading toward the village of Torphichen. Just to the south there's some interesting local history at Cairnpapple Hill. Here you'll find an ancient henge and a visitor centre where you can learn all about the bronze age history of the hill."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aVfHRqJym6c",
  "postcode": "EH49 6PL",
  "county": "West Lothian",
  "region": "Scotland",
  "country": "Scotland",
  "gazetteer_found": true
}