{
  "created_at": "2025-01-06T02:43:46.913860+00:00",
  "objectID": "ed8ac84ccbfb244890ec46065d532911",
  "ref": "reading-to-henley-walking-route",
  "title": "Reading to Sonning and Henley River Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/9/95/Caversham_Bridge_on_the_Thames_-_geograph.org.uk_-_951896.jpg",
  "nearby": [
    {
      "description": "Thames Path",
      "objectID": "0e4392c91f56f17784efaee8a564e416",
      "ref": "thames-path-walking-route"
    },
    {
      "description": "Henley-on-Thames",
      "objectID": "1eac7070841f7d942a8b4926e27a159a",
      "ref": "henley-on-thames-walking-route"
    },
    {
      "description": "Reading Circular River Walk",
      "objectID": "63d99085a362ce6b20a281c55d43f90c",
      "ref": "reading-circular-river-walk-walking-route"
    },
    {
      "description": "Marlow to Henley",
      "objectID": "64204fcee4b36194880d415e920046c9",
      "ref": "marlow-to-henley-walking-route"
    },
    {
      "description": "Shiplake",
      "objectID": "86cd9180f370896357f0c5f31d852783",
      "ref": "shiplake-walking-route"
    },
    {
      "description": "Twyford",
      "objectID": "d1c66f6f43a39507d445658215340198",
      "ref": "twyford-walking-route"
    },
    {
      "description": "Charvil Country Park",
      "objectID": "14701ba00a50d642f2aee27703edf87b",
      "ref": "charvil-country-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ed8ac84ccbfb244890ec46065d532911.gpx",
  "_geoloc": {
    "lat": 51.4652010813,
    "lng": -0.9771593376
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Caversham_Bridge_on_the_Thames_-_geograph.org.uk_-_951896.jpg",
      "title": "Rod Allday / Caversham Bridge on the Thames",
      "caption": "Caversham Bridge in Reading, Route Start"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Caversham_lock_looking_downstream.jpg/512px-Caversham_lock_looking_downstream.jpg",
      "title": "Chris Wood (chris j wood at en.wikipedia, chris j wood at commons) [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0), CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], from Wikimedia Commons",
      "caption": "Caversham Lock, Reading"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/Thames_at_Kennet_mouth_-_geograph.org.uk_-_947606.jpg",
      "title": "Graham Horn / Thames at Kennet mouth",
      "caption": "Thames at Kennet mouth"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/66/Sonning_Bridge_-_geograph.org.uk_-_536881.jpg",
      "title": "Colin Smith / Sonning Bridge",
      "caption": "Sonning Bridge"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_River_Thames%2C_Charvil_-_geograph.org.uk_-_578506.jpg",
      "title": "Andrew Smith / The River Thames, Charvil",
      "caption": "The River Thames, Charvil"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/77/Moorings_on_the_Thames_by_The_Lynch_-_geograph.org.uk_-_952616.jpg",
      "title": "Rod Allday / Moorings on the Thames by The Lynch",
      "caption": "Moorings on the Thames by The Lynch"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6d/House_in_Wargrave_-_geograph.org.uk_-_947825.jpg",
      "title": "Graham Horn / House in Wargrave",
      "caption": "House in Wargrave"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/72/Henley_Moorings_-_geograph.org.uk_-_525421.jpg",
      "title": "Colin Smith / Henley Moorings",
      "caption": "Henley Moorings"
    }
  ],
  "distance_km": 16.0,
  "description": "Enjoy an easy riverside walk along the Thames Path on this walk from Reading to Henley-on-Thames via Sonning. The route runs for just over 9 miles so the walk should take about 3-4 hours. At the end of the walk you can catch a train or bus back to Reading. It's a lovely section of the river with pretty locks, little islands and great views of the surrounding countryside. The walk starts on Caversham Bridge in the centre of Reading. From here you head east along the riverside path to Sonning, passing the Caversham Lakes. These include the Redgrave-Pinsent Rowing Lake named after the Olympic rowers Sir Steve Redgrave and Sir Matthew Pinsent. The GB rowing squad and the Oxford University boat race team train on the lake. The route continues to the village of Sonning which is a particularly pretty area. Here you'll pass Sonning Lock and Sonning Bridge. The photogenic arch bridge was completed in 1775, to replace an earlier wooden bridge. The next stage takes you towards Shiplake where there's another lock, a series of little islands in the river and views over to the historic settlement of Wargrave on the opposite side of the water. Here the path leaves the river to head through the village, passing Bolney Court on the way. The final section runs in to Henley, passing Marsh Lock Weir and the pretty Mill Meadows area of natural beauty. Shortly after you arrive at the finish point of the walk at Henley Bridge. The Grade I listed bridge was built in 1786 and spans the River Thames between Oxfordshire and Berkshire. To extend the walk try our Henley-on-Thames Circular Walk which uses waymarked trails to explore the countryside surrounding the town. At the other end of the route you could try the Reading Circular River Walk or continue along the Thames Path from Henley to visit nearby Marlow on the Marlow to Henley Walk .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "When you reach Henley head to the legendary Angel on the Bridge to reward yourself with some refreshments. It's located in a great spot next to the river and has a nice outdoor terrace with fine views to enjoy with your meal. Inside there's a charming interior with original beams and a cosy fireplace. The pub also has an interesting history dating back to 1728. With its fine architecture and riverside location it's one of the most photographed and painted pubs in England. You can find the pub at postcode RG9 1BH for your sat navs. At the other end of the route a visit to the beautiful Caversham Court Gardens is highly recommended. Here you'll find the delightful Tea Kiosk within the grounds. They have some delicious home made cakes and an outdoor seating area with views over the gardens and the river. The friendly little cafe also provides support for local charities so it's an ideal place to stop off for a rest and a bite to eat. You can find them at postcode RG4 7AG. In Sonning The Mill at Sonning is an establishment of some note. This lovely Dinner Theatre and bar is set in a converted 18th century flour mill on the banks of the river. The acclaimed site is notable as as the only dinner theatre in the United Kingdom. It includes a restaurant and bar area with a spinning waterwheel. Here you can enjoy Artisan Coffee, Homemade Cakes, a range of Sandwiches and delicious Hot Bar Food. You can find them at postcode RG4 6TY for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The river paths make for a nice dog walk and the Angel on the Bridge mentioned above also welcomes dogs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "At the Henley end of the route you could try the Henley via Stonor Circular Walk. This long walk explores the woods and countryside to the north west of the town. The walk also visits the splendid Stonor Park. The park has been the Stonor family's residence for 850 years making it one of the oldest family homes still lived in today. There's wonderful gardens and parkland with resident deer to see here. Just off the route there's the village of Twyford where you'll find lake and river trails around Charvil Country Park and the Loddon Nature Reserve. For more walking ideas in the area see the Oxfordshire Walks, Berkshire Walks and Chilterns Walks pages."
    }
  ],
  "district": "Reading",
  "county": null,
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Bridge Street, Caversham, Reading, England, RG4 8AH, United Kingdom",
  "postcode": "RG4 8AH",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "3-4 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "rural"
  ],
  "points_of_interest": [
    "historic bridges",
    "natural beauty",
    "river scenery"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}