{
  "created_at": "2025-01-06T07:51:14.551042+00:00",
  "objectID": "eddff1b347c80f43c31cead701ce70ae",
  "ref": "shobdon-walking-route",
  "title": "Shobdon Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/f/f5/The_Avenue_-_Shobdon_-_geograph.org.uk_-_15903.jpg",
  "nearby": [
    {
      "description": "Mortimer Trail",
      "objectID": "a8d33ee7bcc070e783c5bb74104305b5",
      "ref": "mortimer-trail-walking-route"
    },
    {
      "description": "Croft Ambrey",
      "objectID": "10a4143c55eb216d2abfe79474c9c728",
      "ref": "croft-ambrey-walking-route"
    },
    {
      "description": "Leominster",
      "objectID": "98a575107d24ff077bcdde09eba6e774",
      "ref": "leominster-walking-route"
    },
    {
      "description": "Pembridge",
      "objectID": "4eefd78d4e254f6654040d258a9045c0",
      "ref": "pembridge-walking-route"
    },
    {
      "description": "Leintwardine",
      "objectID": "2208a4be663d9848200764e3bfbd3d5b",
      "ref": "leintwardine-walking-route"
    },
    {
      "description": "Croft Castle",
      "objectID": "9efb50d665fb329d8cda2eaa78a09d74",
      "ref": "croft-castle-walking-route"
    },
    {
      "description": "Downton Gorge",
      "objectID": "5538b20a9d8b8e4e1287e824d0efd3bb",
      "ref": "downton-gorge-walking-route"
    },
    {
      "description": "Presteigne",
      "objectID": "aa13f0c7b3ef10a59cf7a16f00921b1e",
      "ref": "presteigne-walking-route"
    },
    {
      "description": "Weobley",
      "objectID": "ace5eb26c4ca7b54a7b5ec2e31f684fe",
      "ref": "weobley-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/eddff1b347c80f43c31cead701ce70ae.gpx",
  "_geoloc": {
    "lat": 52.2528074673,
    "lng": -2.8832897172
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f5/The_Avenue_-_Shobdon_-_geograph.org.uk_-_15903.jpg",
      "title": "John Phillips / The Avenue - Shobdon",
      "caption": "The Avenue - Shobdon. This avenue leads from shobdon Court and Church - East towards Easthampton"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e3/The_Shobdon_Arches_-_geograph.org.uk_-_2024468.jpg",
      "title": "Mark Hurn / The Shobdon Arches",
      "caption": "The Shobdon Arches, near to Shobdon, Herefordshire, Great Britain. The Arches were removed from Shobdon Church and set up as a folly in the 18th cent. They display the Romanesque style of the Herefordshire School and are Norman in date."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/From_Shobdon_Hill_-_geograph.org.uk_-_872901.jpg",
      "title": "David M Jones / From Shobdon Hill",
      "caption": "From Shobdon Hill. View over the Wye and Arrow valleys"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Canal_Pool_at_Shobdon_Park_-_geograph.org.uk_-_449743.jpg",
      "title": "Gill Stott / Canal Pool at Shobdon Park",
      "caption": "Canal Pool at Shobdon Park. This small lake is probably a natural feature but it was landscaped in the 18th Century within the deer park of Shobdon Court."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Shobdon_Court_%28geograph_3939708%29.jpg/512px-Shobdon_Court_%28geograph_3939708%29.jpg",
      "title": "Philip Pankhurst / Shobdon Court",
      "caption": "Shobdon Court"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Motte_at_Shobdon_Court_-_geograph.org.uk_-_449734.jpg",
      "title": "Gill Stott / Motte at Shobdon Court",
      "caption": "Motte at Shobdon Court. This Scheduled Monument is presumed to be an early Norman castle site. The flat topped mound was landscaped with trees in the 18th century. Photograph shows the south-facing bank."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/73/Shobdon_village_green_-_geograph.org.uk_-_822534.jpg",
      "title": "Whatlep / CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0)",
      "caption": "Shobdon village green"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6e/Orchard_in_Shobdon_-_geograph.org.uk_-_154255.jpg",
      "title": "David Smith / Orchard in Shobdon",
      "caption": "Orchard in Shobdon"
    }
  ],
  "distance_km": 3.5,
  "description": "This short circular walk takes you around the pretty Herefordshire village of Shobdon. Starting in the village follow a public footpath north west to Downwood where you'll pass the Park Pool and Pearl Lake, the largest natural body of water in Herefordshire. Head east and you will come to Shobdon Park and Shobdon Court. The main house of the estate has since been demolished but the service wing and the stable block have since been converted to residential use. The estate includes a noteworthy Grade I listed church. Arches from the interior of the church were removed in the 18th century to form an eye-catcher in the grounds of the Court. Here you'll also pass a Motte, designated as a Scheduled Monument and presumed to be an early Norman castle site. The route then turns south to pass more pretty pools before returning to the village.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Bateman Arms is a fine place to enjoy some refreshments after your exercise. The pub has an interesting history dating back to 1750 when it was built by Sir James Bateman (Lord Mayor Of London) as a building where his Estate workers would collect on pay day. Over the years it became a staging post for weary Drovers to refresh themselves as they walked livestock from West Wales to markets in Birmingham and London.The pub does very good food and also includes a lovely beer garden to relax in on warmer days.You can find the pub in the village at a postcode of HR6 9LX for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The village and park are a nice place to take your dog for a walk. There's also miles of woodland trails to the north in Shobdon Hill Wood which are great for dog walking. The Bateman Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Mortimer Trail can be picked up just to the north of the village near Byton. You can follow it east through Shobdon Hill Wood and Sned Wood to take you to Aymestrey. From here it is a short climb up to the interesting old hillfort at Croft Ambrey. From the elevated position of the trail you can enjoy fine views over the Wye Valley. You can also explore the beautiful gardens surrounding the historic Croft Castle here. The village is located near to the town of Leominster where you can enjoy riverside trails along the River Lugg on the Leominster Walk. Head south of the village and you can try the Pembridge and Eardisland Walk. Both of these neighbouring villages are very pretty with views of the River Arrow and a number of picturesque cottages to see. The Black and White Village Trail passes close to the village. The long distance footpath explores several of the towns and villages of the county. It's named after the wonderful old timber framed buildings which are typical of the area. On the route there's some fascinating history and excellent views of the surrounding rolling countryside. Shobdon is also known for Shobdon Aerodrome, formerly a Second World War RAF glider training facility, now used for commercial and recreational helicopter flying, fixed wing power flying and glider flying. It's located just to the south of the village. A few miles to the north there's the worthy village of Leintwardine to visit. There's some nice river trails along the Teme and the Clun which converge at the former Roman settlement. There's also a historic ancient bridge and two fine old pubs to investigate afterwards. Near here there's also the noteworthy Downton Gorge. The limestone gorge is located on the River Teme and contains some nice woodland trails with interesting rock formations and a variety of flora and fauna. For more walking ideas in the area see the Herefordshire Walks page."
    }
  ],
  "postcode": "HR6 9NQ",
  "district": "Shobdon",
  "county": "Herefordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "B4362, Shobdon, Herefordshire, England, HR6 9NQ, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "1.5 hours",
  "difficulty": "easy",
  "terrain": [
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "historical sites",
    "monument"
  ],
  "facilities": [
    "car park",
    "church"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}