{
  "created_at": "2025-01-06T00:15:48.044063+00:00",
  "objectID": "edf543b88d148348bcb96bd796891c4b",
  "ref": "lastingham-walking-route",
  "title": "Lastingham Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Low_Street%2C_Lastingham_-_geograph.org.uk_-_1038280.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/edf543b88d148348bcb96bd796891c4b.gpx",
  "_geoloc": {
    "lat": 54.3045199709,
    "lng": -0.8806483737
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/8e/Low_Street%2C_Lastingham_-_geograph.org.uk_-_1038280.jpg",
      "title": "Christine Church / Low Street, Lastingham",
      "caption": "Low Street, Lastingham. This view looks south along the street, the low autumn sunshine picking out the trees. The footpath through Hagg Wood can be seen leaving the road beyond the houses. The bridge crosses Ings Beck."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/St_Mary%27s_Church_Lastingham_-_geograph.org.uk_-_2365142.jpg/512px-St_Mary%27s_Church_Lastingham_-_geograph.org.uk_-_2365142.jpg",
      "title": "St Mary's Church Lastingham by Pauline E, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "St Mary's Church Lastingham"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/62/Terrace_Houses_Lastingham_-_geograph.org.uk_-_640829.jpg",
      "title": "Tony Murgatroyd / Terrace Houses Lastingham",
      "caption": "Terrace Houses and the Ings Beck"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5f/Track%2C_Lastingham_Ridge_-_geograph.org.uk_-_495870.jpg",
      "title": "Mick Garratt / Track, Lastingham Ridge",
      "caption": "Track and pretty heather on the Lastingham Ridge. Bridleway from Rosedale Abbey dropping down into Lastingham."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Rainbow_over_Spring_Heads_-_geograph.org.uk_-_1031846.jpg",
      "title": "Peter Church / Rainbow over Spring Heads",
      "caption": "Rainbow over Spring Heads. The track runs north via Ana Cross to Rosedale Abbey (village). The heathery moor is called Spring Heads."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/0d/Ana_Cross_-_geograph.org.uk_-_1031852.jpg",
      "title": "Peter Church / Ana Cross",
      "caption": "Ana Cross. This is on the approach to the cross from the south. The skyline is Northdale Rigg (above Rosedale)."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Large_rock_on_Spaunton_Moor_-_geograph.org.uk_-_640258.jpg",
      "title": "colin grice, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Large rock on Spaunton Moor. This tabular rock is some 15 feet long by 5 feet wide. There are a large number of rocks of various shapes and sizes scattered here and they are indicated on the OS map at 1/25,000."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Towards_Barker_Slack_-_geograph.org.uk_-_1031863.jpg",
      "title": "Peter Church / Towards Barker Slack",
      "caption": "Towards Barker Slack. This is the track from the village to Ana Cross. It is a little soft in places and is being strengthened by laying crushed sandstone."
    }
  ],
  "distance_km": 8.6,
  "description": "This pretty North York Moors village is a fine place to start a walk. In the village there's lots of picturesque cottages, views of the Ings Beck and the noteworthy St Mary's Church. The ancient church is well worth investigating with its exquisite interior and an eleventh-century crypt. This circular walk from the village takes you north along the Lastingham Ridge up to the Ana Cross. The wayside cross marks a medieval route way across the moor between Lastingham and the site of Rosedale Priory. The current cross dates from 1949 with the original moved to St Mary's church mentioned earlier. From the elevated position of the cross there are wonderful views across the moor. The route then heads south across Spaunton Moor before descending back to the village. You could extend the walk at the northern end by continuing north into Rosedale where you could explore the historic abbey. Near here there's also Rosedale Chimney Bank where you can explore the wonderful old kilns at Bank Top and explore the old mineral railway on the Rosedale Railway Walk. A small detour to the west would take you to neighbouring Hutton-le-Hole where you could visit the excellent Ryedale Folk Museum .",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Back in the village you can enjoy some post walk refreshments at the 18th century Blacksmiths Arms. It's an attractive stone pub with a fine menu, a lovely garden area and a pizza oven. You can find them opposite the old church on Anserdale Lane at postcode YO62 6TN for your sat navs."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The moorland trails make for a fine dog walk and the Blacksmiths Arms mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the north east of the settlement you'll find the expansive Cropton Forest. The forest is a fine place for walking and cycling with miles of wide trails and deer to look out for as well. To the south there's neighbouring Appleton Le Moors. It's another quaint place with a notable Grade I listed church and an excellent pub dating to the 17th century. There's also some lovely walks along the scenic River Seven to Sinnington to enjoy here. For more walks in the area see the North York Moors Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/aKyKSRnGLJ0",
  "district": "Lastingham",
  "county": "North Yorkshire",
  "region": "York and North Yorkshire",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Front Street, Brook Farm, Lastingham, North Yorkshire, York and North Yorkshire, England, YO62 6TQ, United Kingdom",
  "postcode": "YO62 6TQ",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "half day",
  "difficulty": "moderate",
  "terrain": [
    "moorland",
    "rural"
  ],
  "points_of_interest": [
    "church",
    "cross",
    "museum"
  ],
  "facilities": [
    "car park",
    "visitor center"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}