{
  "created_at": "2025-01-06T03:31:51.328093+00:00",
  "objectID": "ee14df3fbe45481784f4c520b389f4ef",
  "ref": "aysgarth-falls-walking-route",
  "title": "Aysgarth Falls Circular Walk Map Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Aysgarth_upper_falls_-_geograph.org.uk_-_30955.jpg",
  "nearby": [
    {
      "description": "West Burton Falls",
      "objectID": "11e495eae5dc5a0b0a19169ea963635b",
      "ref": "west-burton-falls-walking-route"
    },
    {
      "description": "Herriot Way",
      "objectID": "dce3bdc01a32dac13c530394bb91eeec",
      "ref": "herriot-way-walking-route"
    },
    {
      "description": "Castle Bolton",
      "objectID": "699564f281e5b70ef16472247dc7543e",
      "ref": "castle-bolton-walking-route"
    },
    {
      "description": "Wensleydale",
      "objectID": "fea78fb8c656206ab4626802d57a16e7",
      "ref": "wensleydale-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ee14df3fbe45481784f4c520b389f4ef.gpx",
  "_geoloc": {
    "lat": 54.2945964162,
    "lng": -1.9830303434
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4b/Aysgarth_upper_falls_-_geograph.org.uk_-_30955.jpg",
      "title": "Robin Hall / Aysgarth upper falls",
      "caption": "Aysgarth Upper falls. Upper force. Just above the bridge. Really peaty water, it has been raining in the last couple of days. It takes a while for the water to seep through the soil up on the moors and get this colour."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b5/Aysgarth_Middle_Falls_-_geograph.org.uk_-_787209.jpg",
      "title": "Dr Neil Clifton / Aysgarth Middle Falls",
      "caption": "Aysgarth Middle Falls"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/44/Aysgarth_Lower_Falls_-_geograph.org.uk_-_324123.jpg",
      "title": "Gordon Hatton / Aysgarth Lower Falls",
      "caption": "Aysgarth Lower Falls. Taken from limestone rocks below the lower falls, this view gives a good impression of the series of steps down which the Ure tumbles."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/4a/National_Park_Information_Centre_at_Aysgarth_Falls_-_geograph.org.uk_-_355796.jpg",
      "title": "Gordon Hatton / National Park Information Centre at Aysgarth Falls",
      "caption": "National Park Information Centre at Aysgarth Falls. Originally built as railway cottages, this building now houses an information centre, offices and an excellent cafe. To the right are the dry composting toilets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/06/Summer_below_Aysgarth_Falls_-_geograph.org.uk_-_1358884.jpg",
      "title": "Chris Heaton / Summer below Aysgarth Falls",
      "caption": "Summer below the Falls. Scene along the River Ure on a warm summer's day downstream of the Lower Aysgarth Falls."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Yore_Mill%2C_Aysgarth_Falls_-_geograph.org.uk_-_355727.jpg",
      "title": "Gordon Hatton / Yore Mill, Aysgarth Falls",
      "caption": "Yore Mill at the falls. The mill has had an interesting history, starting life in the 18th Century as a cotton mill, then later as a woollen mill, corn mill and sawmill. The red flannel cloth for the shirts of Garibaldi's army is said to have been made here."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Aysgarth_Rock_Garden_-_geograph.org.uk_-_771439.jpg",
      "title": "Jeff Tomlinson / Aysgarth Rock Garden",
      "caption": "Aysgarth Rock Garden. Located near the falls this pretty garden is a worthy addition to your outing."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/65/St._Andrews_Church%2C_Aysgarth_-_geograph.org.uk_-_103274.jpg",
      "title": "Steve Tuff / St. Andrews Church, Aysgarth",
      "caption": "St Andrews Church viewed above Aysgarth Middle Falls. It has the largest churchyard in England and is worth stopping at to see the wonderful rood screen."
    }
  ],
  "distance_km": 4.0,
  "description": "Enjoy a woodland walk to the spectacular Aysgarth Falls in the Yorkshire Dales National Park. There are three tiers to the falls which make for a wonderful spectacle, particularly in wet weather. The upper and middle falls were featured in the film 'Robin Hood, Prince of Thieves'. This circular walk starts on the northern side of the River Ure by the Aysgarth Falls National Park Centre where there is a good sized car park. The centre is a great place to find information about the walks in Aysgarth and Carperby. There is also a cafe for refreshments. You can see it by clicking on the street view link below. After leaving the car park you can pick up a woodland trail through St Joseph's Wood and out into the countryside, where there are great views of the surrounding area. The walk then descends to the river where there are nice viewpoints near the falls. The area is a nature reserve so look out for some lovely flora and fauna on your walk. In the spring and summer you can see wildlflowers and bluebells in the woods. Also look out for wild birds, squirrels and deer. You can return to the car park or extend your walk by crossing the Yore Bridge and following another footpath on the southern side of the river. You'll pass the old Yore Mill and Craft Shop which has some nice gifts. To continue your walking in the area you can head 1.5 miles south and visit the delightful West Burton Falls. The Cauldron Falls (as they are otherwise known) are located very near to the picturesque village and are well worth a visit. The Herriot Way long distance footpath also starts in the village. The circular route takes you through areas of the Yorkshire Dales associated with the vet and author James Herriot. Also nearby is the village of Castle Bolton where you can visit the 14th century Bolton Castle. Head east along the river on our Wensleydale Walk and you can visit Redmire Force and the vilage of Wensley, which gives its name to the dale of Wensleydale.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "After your walk head to the Aysgarth Falls Hotel (Postcode: DL8 3SR). The pub is ideally located in Aysgarth, just to the south of the river and the falls. Here you'll find a nice pub with a good menu and selection of ales. You can also book accommodation here if you need to stay over.Just over a mile to the north of the falls you will find The Wheatsheaf Inn in Carperby (Postcode: DL8 4DF). This traditional, 19th-century, stone-and-brick country pub also has rooms. You could also head to the Visitor Centre where you'll find the Coppice Cafe. The conveniently located cafe serves a great selection of drinks and meals largely made with locally-sourced ingredients."
    },
    {
      "subtitle": "Dog Walking",
      "content": "This is a dog friendly walk and you'll probably see quite a few other dog owners as you make your way along the path."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Also in the area is the delightful Aysgarth Edwardian Rock Garden. Though small these lovely gardens are well worth visiting if you have time after your visit to the falls. The Grade II listed Rock Garden is free to enter and contains a mountain stream and a south facing lawned area with mixed borders that provides views of adjacent fields and trees. The gardens are located at a postcode of DL8 3AH with lay-by parking available at the site. Also in the village is the Grade II listed St Andrew's Church. The medieval church is noted for its fine rood screen dating from around 1506 which was originally installed in Jervaulx Abbey and moved here after the Dissolution of the monasteries. There's also high quality Victorian stained glass windows to see here too. The church is located near the falls on the south side of the River Ure at a postcode of DL8 3SR. It's a popular place to stop at for people doing this walk. A little further to the west there's a lovely circular walk to try around Semer Water. The beautiful lake is notable as the second largest natural lake in North Yorkshire, England after Malham Tarn. Near here there's also the worthy village of Bainbridge. The village includes views of the River Bain and a 15th century hotel which is one of the oldest in Yorkshire. For more walking ideas in the area see the Yorkshire Dales Walks page."
    },
    {
      "subtitle": "Visitor Reviews",
      "content": "\"Absolutely stunning spot!\" Visited September 2023 5 stars By Emily R. \"I’d heard about Aysgarth Falls for years, and they didn’t disappoint! The sound of the cascading water, especially after a few days of rain, was both powerful and soothing. The trails around the falls are well-marked, with fantastic viewpoints along the way. We even spotted a few kingfishers darting by! A perfect day out if you love scenic walks and photography. Highly recommended!\" \"Ideal family day out!\" Visited August 2023 4 stars By James T. \"We brought the kids along, and they loved it! The paths are easy to navigate, and there are picnic spots close to the falls where you can stop and enjoy the view. A great spot to introduce the little ones to nature – they were fascinated by the rock formations and enjoyed dipping their feet in the shallow pools at the lower falls. Just be sure to bring sturdy shoes; the rocks can be slippery.\" \"Beautiful in all seasons\" Visited November 2022 5 stars By Rachel P. \"We’ve visited Aysgarth Falls in spring and autumn, and each time the place feels completely different! In spring, the whole area comes alive with wildflowers, while autumn brings the most vibrant colours to the surrounding trees. The Upper Falls are particularly stunning, with the mist rising up on colder days. It’s a gem in the Yorkshire Dales that never loses its charm, no matter the time of year.\" \"Lovely walks and a charming tea room\" Visited June 2023 4.5 stars By Martin H. \"Aysgarth Falls isn’t just about the waterfalls; the surrounding woodland walks are equally lovely. We spent a good few hours exploring the area, then ended our day at the little tea room nearby. They serve delicious scones and have a lovely view of the countryside from the garden. A wonderful day trip that offers a bit of everything – beautiful scenery, history, and a slice of traditional Yorkshire hospitality.\" \"A photographer’s paradise\" Visited March 2023 5 stars By Chloe D. \"If you’re into landscape photography, Aysgarth Falls is a must-visit. The falls have three main sections – upper, middle, and lower – each with unique views and photo opportunities. Morning light really enhances the beauty of the cascades. It’s great in any weather, though the waterfalls are even more impressive after a good rainfall. Can’t wait to return with more camera gear!\" \"Impressive yet peaceful\" Visited October 2022 4 stars By Sam L. \"The falls are impressive, yet the atmosphere is quite peaceful compared to some other popular spots in the Dales. Even though it’s popular, we found it easy to enjoy a quiet moment by the water. We took the longer walking loop around the area and loved the mix of waterfalls, ancient woodland, and panoramic views. A bit muddy after rain, but worth it for the stunning landscapes.\""
    }
  ],
  "video_url": "https://www.youtube.com/embed/-8qyJf4GvGo",
  "county": "North Yorkshire",
  "region": "Yorkshire and the Humber",
  "country": "England",
  "gazetteer_found": true
}