{
  "created_at": "2025-01-06T04:29:22.674682+00:00",
  "objectID": "ee55b9ee756d935ffaa037bca736c52b",
  "ref": "tamar-valley-discovery-trail-walking-route",
  "title": "Tamar Valley Discovery Trail Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d1/River_Tamar_from_Calstock_Viaduct_-_geograph.org.uk_-_73430.jpg",
  "nearby": [
    {
      "description": "Lopwell Dam",
      "objectID": "42b131dc6c3ceb2e411d3896080042c0",
      "ref": "lopwell-dam-walking-route"
    },
    {
      "description": "Cotehele House",
      "objectID": "e5ead3a1d512ad5500de1318457a7d42",
      "ref": "cotehele-house-walking-route"
    },
    {
      "description": "Launceston",
      "objectID": "448aef174c1db685f7119f79095b1da6",
      "ref": "launceston-walking-route"
    },
    {
      "description": "Tamara Coast To Coast Way",
      "objectID": "bad93d506bb2500045f2ab18a6f19279",
      "ref": "tamara-coast-to-coast-way-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ee55b9ee756d935ffaa037bca736c52b.gpx",
  "_geoloc": {
    "lat": 50.4283786116,
    "lng": -4.1561294733
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/River_Tamar_from_Calstock_Viaduct_-_geograph.org.uk_-_73430.jpg",
      "title": "Crispin Purdye / River Tamar from Calstock Viaduct, via Wikimedia Commons",
      "caption": "River Tamar from Calstock Viaduct. Former boat building and mineral railway quays line the north bank of the river. Modern greenhouses capitalise on the southerly aspect."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Tamar_Valley_Discovery_Trail_in_Greenscombe_Wood.jpg/512px-Tamar_Valley_Discovery_Trail_in_Greenscombe_Wood.jpg",
      "title": "Nilfanion [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The Tamar Valley Discovery Trail, following a forestry track, in Greenscombe Wood near Calstock in Cornwall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Tamar_Valley_Discovery_Trail_near_Bere_Alston.jpg/512px-Tamar_Valley_Discovery_Trail_near_Bere_Alston.jpg",
      "title": "Nilfanion [CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons",
      "caption": "The Tamar Valley Discovery Trail, passing over a field near Bere Alston station in Devon."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Lopwell_Dam_-_geograph.org.uk_-_84226.jpg",
      "title": "Tony Atkin / Lopwell Dam, via Wikimedia Commons",
      "caption": "Lopwell Dam. The purpose of this dam is less to hold a great deal of water behind it and more to stop salty tidal water coming up stream. This makes the river water available to be extracted for the public water supply."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/76/The_Viaduct%2C_Calstock_-_geograph.org.uk_-_531588.jpg",
      "title": "Rob Farrow / The Viaduct, Calstock",
      "caption": "The Viaduct, Calstock. Taken from a river launch as we approached the dramatic railway viaduct over the Tamar at Calstock. Dusk was falling so the colours are somewhat muted. This is a remarkably attractive structure considering it is made out of concrete blocks ! The blocks are huge, typically 5ft x 3ft x 2ft, but varying to allow for the tapered columns. According to (not necessarily terribly reliable) research on the internet, it is 108ft to the underside top of the arches from ground level. There are 12 arches in total, each one spanning 60ft. Of these 12, four arches actually span the river (not 6 as you will find reported elsewhere). The engineers were R. Church & William Robert Galbraith and the bridge was constructed between 1904 and 1908."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/b9/New_Bridge%2C_Gunnislake_-_geograph.org.uk_-_1211279.jpg",
      "title": "Brian / New Bridge, Gunnislake",
      "caption": "New Bridge, Gunnislake. This single lane road bridge crosses the River Tamar, on the border between Devon and Cornwall."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/ff/Gunnislake%2C_Weir_-_geograph.org.uk_-_1211325.jpg",
      "title": "Brian / Gunnislake, Weir",
      "caption": "Gunnislake, Weir. The weir is just down the River Tamar from Gunnislake. There is a very steep sided wood on the Devon side."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/63/Calstock%2C_Cothele_House_-_geograph.org.uk_-_415331.jpg",
      "title": "Martin Bodman / Calstock: Cothele House",
      "caption": "Calstock: Cothele House. The house is slightly off the route just west of Calstock. It dates from the 15th and 16th centuries and is constructed of slatestone and granite. It is now a National Trust property, open to the public for a small entry fee. Looking north-north-west."
    }
  ],
  "distance_km": 48.0,
  "description": "This beautiful trail takes you through the Tamar Valley AONB from Tamerton Foliot in Devon to Launceston in Cornwall. You start by heading north towards the Lopwell area of natural beauty where you will cross the River Tavy. You'll pass through the lovely Lopwell Dam Nature Reserve with habitats including mudflats, freshwater marsh, wildflower meadow, scrub-grassland, saltmarsh and semi-natural woodland. The route then continues north towards Calstock joining the River Tamar for a splendid waterside stretch through Gunnislake and Luckett. You then leave the river heading through Milton Abbot before crossing the river again at Dunterton and proceeding to the finish at Launceston.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "In Calstock you could head to the Tamar Inn for refreshments on the walk. The historic 17th century free house sits on the banks of the River Tamar. It was allegedly once a meeting place for smugglers and highwaymen. Built on a split level, it sits close by the waterfront in the village centre at a postcode of PL18 9QA. Near Gunnislake there's the excellent Rising Sun Inn. The charming, oak beamed country pub dates back to the 17th century. They have some lovely terraced gardens where you can enjoy a meal with a view over the Valley. You can find them at postcode PL18 9BX for your sat navs. The inn is dog friendly if you have your canine friend with you."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The route is coincident with the Tamara Coast To Coast Way an 89 mile route running from south to north Cornwall. The trail starts at Cremyll and runs all the way to the coast at Morwenstow. In Calstock consider taking a small detour from the route to visit the National Trust's Cotehele House. It's located just to the west of the quay and includes a fine Tudor House, formally planted terraces, the Valley Garden with medieval stewpond and dovecote, the Upper Garden and two orchards. The Tamar Valley Line is a great way of seeing the area from a different perspective. The scenic railway takes you through rolling green, sleepy villages and beautiful river crossings. The highlight of the journey is when the train slowly creeps down over the impressive Calstock viaduct and you are 120 feet high looking down on the river below."
    }
  ],
  "video_url": "https://www.youtube.com/embed/4hYb7Lch51Q",
  "district": "Plymouth",
  "county": null,
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Seven Stars Lane, Tamerton Foliot, Plymouth, England, PL5 4NN, United Kingdom",
  "postcode": "PL5 4NN",
  "state": "England"
}