{
  "created_at": "2025-01-05T23:51:05.125425+00:00",
  "objectID": "ee6c61570fe9f75cc472e813c3e62273",
  "ref": "childwall-woods-walking-route",
  "title": "Childwall Woods Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Childwall_Fields_-_geograph.org.uk_-_338855.jpg",
  "nearby": [
    {
      "description": "Calderstones Park",
      "objectID": "e8f54b5483bb4ac21409772de9817b12",
      "ref": "calderstones-park-walking-route"
    },
    {
      "description": "Trans Pennine Trail",
      "objectID": "92a97add7ee3d3d55980d4993637b5c5",
      "ref": "trans-pennine-trail-walking-and-cycle-route"
    },
    {
      "description": "Sefton Park Liverpool",
      "objectID": "e9c3b42450a49bb04646d2902f9087b7",
      "ref": "sefton-park-liverpool-walking-route"
    },
    {
      "description": "Liverpool City Walk",
      "objectID": "529576ea092df8d6c0c53a002ffadc38",
      "ref": "liverpool-city-walk-walking-and-cycle-route"
    },
    {
      "description": "Liverpool Loop Line",
      "objectID": "1de6c13dcb7af55f257e8cac21ca60c0",
      "ref": "liverpool-loop-line-walking-and-cycle-route"
    },
    {
      "description": "Knowsley Hall Park",
      "objectID": "797e7c5cf472c0bd4da75e53657e4761",
      "ref": "knowsley-hall-park-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ee6c61570fe9f75cc472e813c3e62273.gpx",
  "_geoloc": {
    "lat": 53.3941701503,
    "lng": -2.8866382095
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/Childwall_Fields_-_geograph.org.uk_-_338855.jpg",
      "title": "Sue Adair / Childwall Fields",
      "caption": "This area of open grassland now known as Childwall Fields was once Childwall Park, on which stood the 18th Century Childwall Hall. Although the original boundary has changed little, from the woods to Childwall Lane, the actual terrain has been \"terraced\" due to the land being used as a landfill site in the 1960's. Nature has reclaimed and it is a good place to walk as it has abundant wildlife and set high on a sandstone ridge, the fields have fine views to Huyton, Prescot and beyond."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/41/Autumn_sunshine_in_Childwall_Woods_-_geograph.org.uk_-_70984.jpg",
      "title": "Sue Adair / Autumn sunshine in Childwall Woods",
      "caption": "Autumn sunshine in Childwall Woods. In 2004 Childwall Woods, one of Liverpool's wildlife havens, was awarded one of the highest accolades in the conservation world. Childwall Woods and Fields was named a Local Nature Reserve (LNR) area, the first in the city for 20 years. The site has been given the accolade because of its wide range of urban wildlife which includes small blue, small copper and red admiral butterflies, linnets and sparrow-hawks, English bluebell and southern marsh orchids. Bats, voles and foxes are also regular inhabitants of the area."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/85/All_Saints_Church%2C_Childwall.jpg",
      "title": "Sue Adair / All Saints Parish Church, Childwall",
      "caption": "All Saints Church. The ancient All Saints Parish Church, often called Childwall Abbey, which is in fact the nearby inn! Parts of this beautiful church date back to the 14th century, though some of the building materials have Norman or even Anglo-Saxon origins. There was probably a chapel here in the 11th century and the current name is probably of relatively recent origin; a document from the 14th century suggests that the church was dedicated to St. Peter at that time."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Childwall_Abbey_Inn_-_geograph.org.uk_-_71002.jpg",
      "title": "Sue Adair / Childwall Abbey Inn",
      "caption": "Childwall Abbey Inn. Childwall is an ancient village, it was mentioned in the Domesday book and the inn originated as a coach house dating back to 1484. Childwall Hall used to stand nearby, a mock-mediaeval castle that was demolished in the mid-20th century, it also sported the local penchant for turrets."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/95/Park%2C_Score_Lane%2C_Childwall_-_geograph.org.uk_-_338818.jpg",
      "title": "Sue Adair / Park, Score Lane, Childwall",
      "caption": "Park, Score Lane. The small park on Score Lane, adjacent to the ancient Parish Church. Between park and church graveyard is a small overgrown area known as \"Bloody Acre\" which takes its name from a skirmish during the Civil War."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/83/Childwall_Playing_Fields_from_the_Trans-Pennine_Way_-_geograph.org.uk_-_338825.jpg",
      "title": "Sue Adair / Childwall Playing Fields from the Trans-Pennine Way",
      "caption": "Playing Fields from the Trans-Pennine Way. Playing Fields and the houses of Barnham Drive, taken from the Trans-Pennine Way at Well Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/15/Childwall_Cross_-_geograph.org.uk_-_1225976.jpg",
      "title": "Sue Adair / Childwall Cross",
      "caption": "Childwall Cross. Thought to be a market cross approximately 600 years old, Childwall cross was re-erected just a few yards from where it was found in 1935, partly buried in a field. In total 22 sandstone blocks were found, three steps and the base but no sign of the original shaft. Lord Salisbury provided the new site and a donation to enable the cross to be rebuilt in its present position on Childwall Lane."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f6/Childwall_Valley_with_Belle_Vale_Shopping_Centre_in_middle_distance._-_geograph.org.uk_-_938393.jpg",
      "title": "Colin Pyle / Childwall Valley with Belle Vale Shopping Centre in middle distance.",
      "caption": "Childwall Valley with Belle Vale Shopping Centre in middle distance. Taken from Gateacre Comprehensive School and looking across the Valley to Belle Vale Shopping Centre. The line of trees nearer is the defunct Cheshire Lines railway embankment, now part of the Trans-Pennine Trail. It linked the Liverpool to Manchester CLC route with North Liverpool and carried Grand National excursions until the 1960's. In the right distance can be seen Fiddlers Ferry power station."
    }
  ],
  "distance_km": 2.0,
  "description": "Follow the nature trails around this small area of woodland in the suburbs of Liverpool. It's a lovely place to get away from the hustle and bustle of the city in peaceful surroundings. In the woods you'll find lots of pretty woodland flowers including Bluebell, marsh orchids and buttercups over the grasslands. There's also a variety of birds to look out for and nice views towards the Lancashire and Cheshire plain. At the north eastern tip of the woods you will find All Saints' Church. It's a designated Grade I listed building, and the only medieval church remaining in the Metropolitan borough of Liverpool. The chancel dates from the 14th century, and the south aisle and porch are probably from the 15th century. It's easy to extend your walk by following the Trans Pennine Trail to the nearby Calderstones Park and Sefton Park where you'll find lakes, gardens and more woodland trails.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "It's well worth strolling into the nearby village where you can find some interesting old buildings including the Childwall Abbey Hotel. It's set in a fine looking historic building which is thought to date back to the 11th century Domesday Book. The tap room in the pub also hosted The Beatles in their former incarnation as The Quarrymen in the 1950s. They have a good menu and a lovely garden area for warmer days. They can be found on Abbey Road at postcode L16 5EY."
    },
    {
      "subtitle": "Dog Walking",
      "content": "As you'd imagine the woodland trails are ideal for dog walking. You'll probably meet other owners with their pets on a fine day. The Abbey Hotel mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Head north and you could visit the splendid Croxteth Country Park. There's a fine old hall surrounded by 500 acres of woodland and parkland here. Knowsley Hall Park with its 15th century hall and safari park attraction can also be found in this area. For more walking ideas in the area see the Merseyside Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/7BJap5xkZUo",
  "district": "Liverpool",
  "region": "North West",
  "country": "England",
  "gazetteer_found": true
}