{
  "created_at": "2025-01-06T00:56:07.867294+00:00",
  "objectID": "ee78e0ce2413049dbf5bfd9b9d675f41",
  "ref": "chorleywood-walking-route",
  "title": "Chorleywood - Common, River Chess and Chenies Circular Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Chorleywood_Common_-_geograph.org.uk_-_95872.jpg",
  "nearby": [
    {
      "description": "Chess Valley Walk",
      "objectID": "ce8cc125db051e68ef2096d4c8ce5453",
      "ref": "chess-valley-walk-walking-route"
    },
    {
      "description": "Chess Valley Circular Walk",
      "objectID": "8de86afcd105ea4be681a8fc8b308565",
      "ref": "chess-valley-circular-walk-walking-route"
    },
    {
      "description": "Little Chalfont",
      "objectID": "470cd0633dc23ea5bd94f476c2ccc155",
      "ref": "little-chalfont-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ee78e0ce2413049dbf5bfd9b9d675f41.gpx",
  "_geoloc": {
    "lat": 51.6554033234,
    "lng": -0.5182012716
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Chorleywood_Common_-_geograph.org.uk_-_95872.jpg",
      "title": "Nigel Cox / Chorleywood Common, via Wikimedia Commons",
      "caption": "Chorleywood Common. Viewed looking south eastwards along one of the wide rides through the wood."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Chorleywood_Common_with_light_snow.jpg",
      "title": "Nigel Cox [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Chorleywood Common, Hertfordshire. Viewed looking north eastwards from the Chorleywood Bottom railway bridge with some snow flurries"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/de/Chorleywood_Common_Cricket_Ground_-_geograph.org.uk_-_1592089.jpg",
      "title": "Colin Pyle / Chorleywood Common Cricket Ground, via Wikimedia Commons",
      "caption": "Chorleywood Common Cricket Ground"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/6c/River_Chess_-_geograph.org.uk_-_411356.jpg",
      "title": "Adrian Perkins / River Chess, via Wikimedia Commons",
      "caption": "River Chess"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Frogmore_Meadows_and_River_Chess_2.JPG/512px-Frogmore_Meadows_and_River_Chess_2.JPG",
      "title": "Dudley Miles [CC BY-SA 4.0 (https://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons",
      "caption": "Frogmore Meadows and River Chess"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Chenies_-_The_Manor_House_-_geograph.org.uk_-_139226.jpg",
      "title": "Nigel Cox / Chenies: The Manor House, via Wikimedia Commons",
      "caption": "Chenies: The Manor House"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a1/Chenies_Manor-20209975.jpg",
      "title": "ThisParticularGreg [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Lovely gardens at Chenies"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/84/Chenies_Manor-20209978.jpg",
      "title": "ThisParticularGreg [CC BY-SA 2.0 (https://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons",
      "caption": "Topiary and trees at Chenies"
    }
  ],
  "distance_km": 8.7,
  "description": "This village in the Three Rivers District of Hertfordshire has some nice walks to try. This circular walk takes you to some of the highlights of the area including Chorleywood Common, the River Chess and Chenies Manor House. The village is easily accessible from London on the Metropolitan line of the London Underground. The walk starts from the Chorleywood underground station which is a short stroll from the common. You can pick up the Chess Valley Walk just north of the station and follow it east to the open space which consists of 200 acres of common land and woodland. After heading through the common you pass Chorleywood House. The 200-year-old manor house is surrounded by an estate with nice countryside and woodland. On certain open days you can enjoy walks in the grounds of the house. Soon after passing the old house you will come to the River Chess. Follow the trail north to Sarratt Bottom where the river bends to the east to take you through the Frogmore Meadows Nature Reserve. This lowland meadow is rich in wildflowers with different types of butterfly to look out for. At Chenies Bottom you cross the river and head south towards Chenies Manor House. The Tudor House is a Grade I listed building and is surrounded by award-winning gardens. Original 13th Century features including a Medieval well, a dungeon and a reputed priest hole. You can tour the house and garden for a fee, from April to October. After exploring the house the route then heads south on a bridleway through Carpenter's Wood before returning to the centre of Chorleywood. To continue your walking in the area head south to Rickmansworth where there are nice footpaths along the River Colne and the Grand Union Canal.",
  "details": [
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The Chess Valley Circular Walk starts at Chorleywood underground station as well. It follows sections of the Chess Valley Walk and the Chiltern Way to create a circular walk around the area. It's a slightly longer route which additionally visits Latimer and West Wood. The northern end of the walk passes close to the picture postcard village of Sarratt. The delightful settlement is well worth a visit with a pretty village green, quaint old cottages, a pond and a fine old pub. A couple of miles to the east of the town you can pick up the Croxley Green Boundary Walk. This waymarked circular walk explores the area around the worthy village, visiting the canal and the River Gade on the way Just to the west you could visit the worthy village of Little Chalfont where you could pay a visit to the Little Chalfont Nature Park. The lovely little park includes a rare wild flower meadow, old woodlands and relics of its past as a farm and a cherry orchard. There's information boards where you can learn about the variety of flora and fauna at the site. You can find them on Cokes Lane at postcode HP7 9QB for sat navs. For more walking ideas in the area see the Buckinghamshire Walks and the Hertfordshire Walks pages."
    }
  ],
  "video_url": "https://www.youtube.com/embed/5YH0SoNnA68",
  "district": "Three Rivers",
  "county": "Hertfordshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "6, Colleyland, Chorleywood, Three Rivers, Hertfordshire, England, WD3 5LL, United Kingdom",
  "postcode": "WD3 5LL",
  "state": "England"
}