{
  "created_at": "2025-01-06T02:03:19.821978+00:00",
  "objectID": "eec84ad71b6541ce7a0ed4e4c05ef87a",
  "ref": "flatford-mill-walking-route",
  "title": "Flatford Mill Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/da/River_Stour%2C_Flatford_Mill_-_geograph.org.uk_-_158156.jpg",
  "nearby": [
    {
      "description": "Dedham Vale",
      "objectID": "23861d638b53f649b1111e45fbc5f183",
      "ref": "dedham-vale-walking-route"
    },
    {
      "description": "Alton Water",
      "objectID": "d3fca2368c9ce61686e44895ca236cf2",
      "ref": "alton-water-walking-and-cycle-route"
    },
    {
      "description": "Stour Valley Path",
      "objectID": "6520fddacf3da51173f572c2fb90f7d2",
      "ref": "stour-valley-path-walking-route"
    },
    {
      "description": "St Edmund Way",
      "objectID": "40befcc98f0036085f815e38b0a9bdec",
      "ref": "st-edmund-way-walking-route"
    },
    {
      "description": "Essex Way",
      "objectID": "d9046b5c14755e51bd15de0c582f5292",
      "ref": "essex-way-walking-route"
    },
    {
      "description": "Polstead",
      "objectID": "cf36d08184ea3c9ea72a1e58299785a2",
      "ref": "polstead-walking-route"
    },
    {
      "description": "East Bergholt",
      "objectID": "47f5efcfdf24145e717874bbd07be061",
      "ref": "east-bergholt-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/eec84ad71b6541ce7a0ed4e4c05ef87a.gpx",
  "_geoloc": {
    "lat": 51.9616932857,
    "lng": 1.0200677909
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/da/River_Stour%2C_Flatford_Mill_-_geograph.org.uk_-_158156.jpg",
      "title": "Stephen McKay / River Stour, Flatford Mill",
      "caption": "This shows Flatford Mill from the right bank (south side) of the river at this popular National Trust spot."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/87/Lock_near_Flatford_Mill_-_geograph.org.uk_-_1481610.jpg",
      "title": "Andrew Hill / Lock near Flatford Mill",
      "caption": "Lock near Flatford Mill. A lock in a separate channel by the River Stour, very close to the famous mill."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/79/River_Stour_between_Dedham_and_Flatford_Mill_-_geograph.org.uk_-_487882.jpg",
      "title": "David Kemp / River Stour between Dedham and Flatford Mill",
      "caption": "Stour Valley Path between Dedham and Flatford Mill. Taken from the Stour Valley Path on the Essex bank of the river."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Dry_dock_near_Flatford_Mill_-_geograph.org.uk_-_208978.jpg",
      "title": "Alan Walker / Dry dock near Flatford Mill",
      "caption": "Dry dock near Flatford Mill. This photograph shows the dry dock that features in John Constable\u0092s painting of 1814 called \u0091Boat-building near Flatford Mill.\u0092 The steps and trestles are in the same position as those shown in the painting. The brick floor, though 19th century, is a later addition. When the dock was excavated the farthest trestle was badly decayed and had to be replaced. Each winter the dock is \u0091flooded\u0092 to protect the brick floor from frost."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/05/Constable%27s_%22Boat_Building_near_Flatford_Mill%22_-_geograph.org.uk_-_1195737.jpg",
      "title": "Zorba the Geek / Constable's \"Boat Building near Flatford Mill\"",
      "caption": "Constable's \"Boat Building near Flatford Mill\". The painting in the V&A Museum was painted of that same spot. The story goes that the dry dock was filled in and forgotten but then traced from the evidence of the painting and rediscovered and excavated, and now open to view."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/2e/The_Granary_Barn%2C_Flatford_Mill_-_geograph.org.uk_-_1196.jpg",
      "title": "Andy Stephenson / The Granary Barn, Flatford Mill",
      "caption": "The Granary Barn. Looking across the River Stour. Now the Granary Barn Rural Bygones Museum."
    }
  ],
  "distance_km": 2.5,
  "description": "Visit the site of Constable's most famous painting and enjoy a short stroll along the River Stour on this easy walk in the Dedham Vale AONB. There's wonderful old buildings, lovely river views and a nice National Trust tea room where you can enjoy refreshments after your walk. Start your walk from the Flatford Mill car park and head past the mill to Willy Lott's Cottage, scene of The Hay Wain. The pretty Grade I listed cottage dates from the 16th century. The watermill is also Grade I listed and dates from the 18th century. It includes a 17th-century miller's cottage. After passing the buildings, footpaths take you past a pretty lake to the River Stour. You can then pick up the Stour Valley Path to take you back to the car park. You can virtually explore part of the site using the google street view link below! To extend your walking in the area you could try our Dedham Vale circular walk which takes you on a wider tour of the countryside and woodland of the AONB. The Stour Valley Path also runs past the mill so you could pick this up and continue along the riverside path towards the lovely Alton Water. The waymarked path can be followed to the mill from the nearby village of Dedham. Also nearby is the RSPB Cattawade Marshes where you can look out for water loving birdlife including Little Egret, Shoveler, Teal, Tufted Duck and Water Rail.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "There's a delightful National Trust Tea Room where you can sit on a balcony overlooking the river if the weather is good. It's a lovely spot to relax in and take the weight of your feet."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The mill is a nice place to take your dog for a walk. You are requested to keep them on leads though please. The tea room mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The East Bergholt circular walk starts from the noteworthy village just to the north of the mill. The village is notable as the birthplace of Constable in 1776. It contains Bridge Cottage a 16th-century dwelling used as a location by Constable. There's also a 15th century church and a noteworthy 14th century pub to investigate. Head north west from the site on the Stour Valley Path and you can visit the villages of Stratford St Mary and Stoke By Nayland. Here you'll find another picturesque village with many cottages and fine old timber-framed houses. There's also a noteworthy village church which dates from the 15th century and features several times in Constable's paintings. Polstead with its village green and 17th century inn is also located in this area. For more walking ideas in the area see the Suffolk Walks page."
    }
  ],
  "video_url": "https://www.youtube.com/embed/BE1FRDv8pRE",
  "postcode": "CO7 6UJ",
  "county": "Suffolk",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Flatford Lane, Flatford, East Bergholt, Babergh, Suffolk, England, CO7 6UJ, United Kingdom",
  "district": "Babergh",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "1.5 - 2.5 hours",
  "difficulty": "easy",
  "terrain": [
    "river",
    "woodland"
  ],
  "points_of_interest": [
    "historical buildings",
    "watermill",
    "lake",
    "bird watching"
  ],
  "facilities": [
    "car park",
    "tea room",
    "visitor center",
    "dog friendly"
  ],
  "route_type": "circular",
  "activity_type": [
    "walking"
  ]
}