{
  "created_at": "2025-01-06T01:49:15.313016+00:00",
  "objectID": "ef55de88b80bc586be7558455191aa68",
  "ref": "hackpen-hill-walking-route",
  "title": "Hackpen Hill Walking Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Hackpen_Hill_-_geograph.org.uk_-_504966.jpg",
  "nearby": [
    {
      "description": "The Ridgeway",
      "objectID": "2384cde76809687efb1a502a57345f61",
      "ref": "the-ridgeway-walking-route"
    },
    {
      "description": "Barbury Castle Country Park",
      "objectID": "dac43ab1de4dbc69a488ec062b3e632b",
      "ref": "barbury-castle-country-park-walking-route"
    },
    {
      "description": "Wessex Ridgeway",
      "objectID": "43cab8ae3f5228bfec0a5cd93960fe13",
      "ref": "wessex-ridgeway-walking-route"
    },
    {
      "description": "White Horse Trail",
      "objectID": "f8439cbeac9e3bb5a4852659b79a5429",
      "ref": "white-horse-trail-walking-route"
    },
    {
      "description": "Cherhill White Horse",
      "objectID": "66bf3dd0621fdf25f8c5635bec31aec9",
      "ref": "cherhill-white-horse-walking-route"
    },
    {
      "description": "Avebury Stones",
      "objectID": "131fc4cd3eaa13cde0fc3361fc0d2e7a",
      "ref": "avebury-stones-walking-route"
    },
    {
      "description": "Sarsen Way",
      "objectID": "1b0701f5ce1a49954a0139a465bd6dfc",
      "ref": "sarsen-way-walking-route"
    },
    {
      "description": "Alton Barnes White Horse",
      "objectID": "010a251326922871866292a843035c1e",
      "ref": "alton-barnes-white-horse-walking-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ef55de88b80bc586be7558455191aa68.gpx",
  "_geoloc": {
    "lat": 51.4714038961,
    "lng": -1.8158821464
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d1/Hackpen_Hill_-_geograph.org.uk_-_504966.jpg",
      "title": "Pam Brophy / Hackpen Hill",
      "caption": "Standing on Hackpen Hill overlooking the valley."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/89/Hackpen_White_Horse%2C_Hackpen_-_geograph.org.uk_-_477326.jpg",
      "title": "Brian Robert Marshall / Hackpen White Horse, Hackpen",
      "caption": "Hackpen White Horse. View of this recently restored Wiltshire white horse"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ea/View_towards_Broad_Hinton_from_Hackpen_Hill_-_geograph.org.uk_-_1086009.jpg",
      "title": "Nigel Brown / View towards Broad Hinton from Hackpen Hill",
      "caption": "View over the fields towards Broad Hinton from hill"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/1d/A_view_across_North_Wiltshire_from_the_Ridgeway_-_geograph.org.uk_-_477256.jpg",
      "title": "Brian Robert Marshall / A view across North Wiltshire from the Ridgeway",
      "caption": "A view across North Wiltshire from the Ridgeway, just to the north of the hill. The Ridgeway passes along the chalk scarp here from Avebury to the north-east across a fertile valley. The Ridgeway provides a popular viewpoint here and there is a convenient parking area nearby for those less mobile."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/82/Barbury_Castle_-_geograph.org.uk_-_701655.jpg",
      "title": "Andrew Smith / Barbury Castle",
      "caption": "Barbury Castle. This is towards the southwest of the hill-fort which is said to date from the 6th century BC. The land in the middle distance is in the western half of the same grid-square. The Ridgeway runs along the top of the ploughed field."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/9/94/Rockley_Duck_Pond_-_geograph.org.uk_-_104101.jpg",
      "title": "Colin Bates / Rockley Duck Pond",
      "caption": "Rockley Duck Pond"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/68/The_Ridgeway%2C_south_of_Hackpen_Hill_-_geograph.org.uk_-_885321.jpg",
      "title": "Brian Robert Marshall / The Ridgeway, south of Hackpen Hill",
      "caption": "The Ridgeway, south of the hill. Berwick Bassett Clump is visible on the skyline. The Ridgeway connects with the A4 highway at West Kennett."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Horse_Jump_above_Hackpen_Hill_-_geograph.org.uk_-_634861.jpg",
      "title": "Trish Steel, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Horse Jump above the hill. Taken from the Ridgeway."
    }
  ],
  "distance_km": 14.6,
  "description": "This circular walk visits the Hackpen White Horse hill figure on the Marlborough Downs. The route then goes on to explore the surrounding countryside of the Downs, heading to Barbury Castle Country Park and Rockley. The walk starts from the Hackpen Hill car park, a couple of miles south east of Broad Hinton (postcode SN8 1RS). There's an excellent viewpoint here with far reaching views over the Wiltshire countryside. You can follow a footpath north west from the car park to reach the white horse. The horse is one of nine white horse hill figures located in Wiltshire and also known as the Broad Hinton White Horse. It was created in 1838 to commemorate the coronation of Queen Victoria which took place that year in Westminster Abbey. The route then returns to the car park to pick up The Ridgeway National Trail. You can follow this waymarked footpath north east for just over a mile to reach Barbury Castle. The iron-age hillfort has remained undisturbed since ancient times and is one of the best examples of its type. After exploring the fort the route picks up a bridle track and follows it south towads Rockley Manor. You head north west from here to pick up a section of the Wessex Ridgeway along the Herepath or Green Street. You then head north passing near to the Grey Wethers Sarsen Stones on Monkton Down. The final section then takes you past Berwick Bassett Down and Winterbourne Down to return to the car park.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "Head into nearby Broad Hinton and you can pay a visit to The Crown. They do excellent food and also have a lovely large garden area with fabulous views. It's the perfect place to relax after your exercise on warmer days. Inside is very attractive too with a cosy fire for the winter. You can find them at a postcode of SN4 9PA."
    },
    {
      "subtitle": "Dog Walking",
      "content": "The downs are a great place for fit dogs. The Crown mentioned above is also dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "The are around the hill is criss crossed by bridleways so its als suitable for cyclists. The hill is on the epic White Horse Trail which visits several of the hill figures in the area. You could follow it to the nearby Cherhill White Horse and the popular Avebury Stones. The area was a favourite of local writer Richard Jeffries who was inspired by the rolling hills. If you head a few miles north east from the hill you could visit the fascinating Richard Jeffries Museum. Jeffries was a Victorian nature writer with a passion for the English countryside. He even gave us a name for it all: wild life. He was born in Coate at the delightful 17th century thatched house which is now a museum to his life and work. The house is also surrounded by lush gardens making it a lovely place for a stroll after your climb. You can find the museum at postcode SN3 6AA, just to the north east of Coate Water Country Park. The expansive park also has some fine waterside trails to try. The Sarsen Way passes the hill. The long distance trail runs through Wiltshire from Coate Water Country Park in Swindon to Salisbury Cathedral. It passes many other fascinating ancient sites including Old Sarum Castle and the Alton Barnes White Horse on Milk Hill. For more walking ideas in the area see the North Wessex Downs Walks page."
    }
  ],
  "county": "Wiltshire",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "The Ridgeway, Broad Hinton, Winterbourne Bassett, Wiltshire, England, SN4 9NR, United Kingdom",
  "postcode": "SN4 9NR",
  "district": "Winterbourne Bassett",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "hill",
    "path"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints",
    "archaeological sites"
  ],
  "facilities": [
    "car park",
    "footpath"
  ],
  "route_type": "circular",
  "activities": [
    "walking"
  ]
}