{
  "created_at": "2025-01-06T03:29:39.445376+00:00",
  "objectID": "ef7b3a7d76a6f2abfe05b9b7e14cf6c1",
  "ref": "elton-walking-route",
  "title": "Elton Walks",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Elton_Hall_and_gardens_%28geograph_5515547%29.jpg/512px-Elton_Hall_and_gardens_%28geograph_5515547%29.jpg",
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ef7b3a7d76a6f2abfe05b9b7e14cf6c1.gpx",
  "_geoloc": {
    "lat": 52.5309521161,
    "lng": -0.3959559366
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Elton_Hall_and_gardens_%28geograph_5515547%29.jpg/512px-Elton_Hall_and_gardens_%28geograph_5515547%29.jpg",
      "title": "Richard Humphrey / Elton Hall and gardens",
      "caption": "Elton Hall and gardens. The grand baronial has served as the family seat of the Proby family, also known as the Earls of Carysfort, since 1660. The hall is part of a vast 3,800-acre estate, traversed by the River Nene, featuring architectural elements from the 15th, 17th, 18th, and 19th centuries. It is recognised as a Grade I listed building. Located just 2 miles from Fotheringhay Castle, the site of Mary, Queen of Scots' execution in 1587, Elton Hall holds a significant place in English history."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Pond_and_garden_at_Elton_Hall_-_geograph.org.uk_-_4589719.jpg/512px-Pond_and_garden_at_Elton_Hall_-_geograph.org.uk_-_4589719.jpg",
      "title": "Pond and garden at Elton Hall by Richard Humphrey, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Pond and garden at Elton Hall. The Victorian gardens at Elton Hall have been meticulously revitalised in recent times, showcasing a knot garden, a newly established rose and herbaceous garden, exquisite hedges, and a Gothic orangery, constructed in celebration of the Millennium. These gardens are supported by the Campaign to Protect Rural England."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/b/bb/Village_Hall%2C_Elton_-_geograph.org.uk_-_4856313.jpg",
      "title": "Village Hall, Elton by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Village Hall, Elton. Elton used to have a railway station but it closed in 1953. It is now a popular walk."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Fields_north_of_the_village_street%2C_Elton_-_geograph.org.uk_-_2358571.jpg/512px-Fields_north_of_the_village_street%2C_Elton_-_geograph.org.uk_-_2358571.jpg",
      "title": "Fields north of the village street, Elton by Andrew Hill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Fields north of the village street"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/East_End%2C_Elton_-_geograph.org.uk_-_2359102.jpg/512px-East_End%2C_Elton_-_geograph.org.uk_-_2359102.jpg",
      "title": "East End, Elton by Andrew Hill, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "East End"
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/0/09/Church_of_All_Saints_-_geograph.org.uk_-_4856330.jpg",
      "title": "Church of All Saints by N Chadwick, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
      "caption": "Church of All Saints"
    }
  ],
  "distance_km": 2.0,
  "description": "This Cambridgeshire village is located a few miles west of Peterborough. Other local settlements include Fotheringhay, Warmington and Nassington. The village notably includes Elton Hall, a part Gothic house, surrounded by beautiful parkland and gardens. The hall is open to the public during the summer months and a lovely place for a stroll. The River Nene, ranking as the UK's tenth longest river, also gracefully flows by Elton, offering idyllic banks ideal for walking, picnicking, or fishing. Please scroll down for the full list of walks near and around Elton. The detailed maps below also show a range of footpaths, bridleways and cycle paths in the area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The Crown Inn serves good quality dishes and has a nice garden to relax in. It dates to the 17th century and is situated in a nice spot by the village green. You can find them at 8 Duck Street, PE8 6RQ. The inn is dog friendly."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "History of the village: Elton's history, previously known as Adelington, spans over 2,000 years. Archaeological findings in Nether End, at the village's northern end, point to a 2nd-century settlement. The earliest documented mention of Elton dates back to 1035, involving a visit from Danish King Canute. During this visit, the then Danish lord, inebriated, impulsively offered to sell the village for “50 marks of gold before daybreak.” Aethelric, Bishop of Dorchester, gathered the sum from associates and bought the village the following morning, later bestowing it upon Ramsey Abbey, just 20 miles away. Following this transaction, the village was renamed Aethelington. Since then, Elton has had only two primary owners: the Sapcote family from 1300 to 1600, and the current proprietors, the Proby Family. This limited succession has contributed to Elton's remarkable historical records, some of the most comprehensive in Europe, dating back to 1279. Elton is also recorded in the Domesday Book of 1086, commissioned by William the Conqueror. The entry notes three manors, 37 households, a church, 28 ploughlands, 184 acres of meadow, and two water mills within the village's lands. More details about Elton Hall: The south front of the house, known as the garden front, features the 15th-century tower and chapel constructed during the reign of Henry VII. The Marble Hall and the main staircase, designed by Henry Ashton, are outstanding examples of mid-Victorian architecture reviving mid-18th-century style. The Drawing Room, the largest room in the house, was originally the medieval chapel, transformed around 1740. While the 18th-century ceiling with its detailed cornice and frieze is retained, the current decoration dates back to 1860. The Dining Room, also an Ashton design from 1860, includes three large Gothic windows replicating those from the medieval chapel's north wall. The Library boasts a significant collection of books, reflecting the Proby family's long-standing literary interests. A passage from the Main Library leads to the Inner Library, located in the medieval Sapcote Tower. Noteworthy rooms include the Lower and Upper Octagon rooms, the Yellow Drawing Room, and the Ante Dining room. The present chapel has been created from a part of the undercroft of the original Sapcotes' chapel, featuring 15th-century vaulting."
    }
  ],
  "video_url": "https://www.youtube.com/embed/l7oPRl96LkU?si=ZxPRquap2QS2Ry9M",
  "postcode": "PE8 6RD",
  "district": "Huntingdonshire",
  "county": "Cambridgeshire",
  "region": "Cambridgeshire and Peterborough",
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Middle Street, Elton, Huntingdonshire, Cambridgeshire, Cambridgeshire and Peterborough, England, PE8 6RD, United Kingdom",
  "state": "England",
  "llama_cpp": false,
  "estimated_duration": "half day",
  "difficulty": "easy",
  "terrain": [
    "river",
    "parkland",
    "garden"
  ],
  "points_of_interest": [
    "historical sites",
    "viewpoints"
  ],
  "facilities": [
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking",
    "fishing"
  ]
}