{
  "created_at": "2025-01-06T01:25:28.962254+00:00",
  "objectID": "ef83d9fcf0c06fd142b76a312a49c598",
  "ref": "colne-valley-way-walking-route",
  "title": "Colne Valley Way Walking Route",
  "nearby": [
    {
      "description": "Harmondsworth Moor",
      "objectID": "6845e01b7c233ac9c90abbe7119bfc64",
      "ref": "harmondsworth-moor-walking-route"
    },
    {
      "description": "Staines Moor",
      "objectID": "dee4fb3fbeb3261a6e6a487beb27d936",
      "ref": "staines-moor-walking-route"
    },
    {
      "description": "Colne Valley Trail",
      "objectID": "e2dd72c89baa5d0473703a87e5bb4a94",
      "ref": "colne-valley-trail-walking-and-cycle-route"
    }
  ],
  "gpx_url": "https://raw.githubusercontent.com/rm-hull/gps-routes-api/refs/heads/main/data/routes/e/ef83d9fcf0c06fd142b76a312a49c598.gpx",
  "_geoloc": {
    "lat": 51.4356364972,
    "lng": -0.5198204334
  },
  "distance_km": 17.0,
  "description": "Travel through the Colne Valley on this walk from Staines to Uxbridge. The walk starts by the River Thames in Staines and begins with a lovely section around King George VI and Wraysbury Reservoirs that takes you to Colnbrook. This section also passes across the delightful Staines Moor where you enjoy views of the Wraysbury River and River Colne. The area of grassland attracts grazing horses and cattle with a variety of birdlife around the streams and reservoirs. From Colnbrook you continue north with a waterside section along the River Colne with views of Little Britain lake. The walk finishes at Uxbridge in the London Borough of Hillingdon. The trail also runs close to the pretty Harmondsworth Moor Country Park. Just to the east of Staines Moor the park has some nice footpaths and two lakes. The path also runs close to Runnymede Park in Egham. Here you can see the Magna Carta monument, enjoy woodland trails and visit the Langham Ponds wetland area.",
  "details": [
    {
      "subtitle": "Pubs/Cafes",
      "content": "The route finishes at the West London town of Uxbridge which has an interesting history as the site of the attempted negotiations between King Charles I and the Parliamentary Army during the English Civil War. The public house at the centre of those events, since renamed the Crown & Treaty, still stands and is worthy of some investigation. The pub is Grade II* listed, and dates from 1576. There is even an album named after the pub by mercury prize nominated band Sweet Billy Pilgrim. The pub does very good food and also has a fine outdoor bar for the summer months. You can find the historic inn on Oxford Road at postcode UB8 1LU for your sat navs."
    },
    {
      "subtitle": "Further Information and Other Local Ideas",
      "content": "Just to the east of Uxbridge you can pick up the Celandine Route. The trail runs along the River Pinn from Cowley to Pinner. It is named after the pretty Lesser Celandine flowers you can see on the walk."
    }
  ],
  "postcode": "TW18 4ZB",
  "district": "Spelthorne",
  "county": "Surrey",
  "region": null,
  "country": "United Kingdom",
  "gazetteer_found": true,
  "nominatim_found": true,
  "display_address": "Church Street, Spelthorne, Surrey, England, TW18 4ZB, United Kingdom",
  "state": "England",
  "llama_cpp": true,
  "estimated_duration": "2-3 hours",
  "difficulty": "moderate",
  "terrain": [
    "grassland",
    "woodland",
    "water"
  ],
  "points_of_interest": [
    "park",
    "lake",
    "monument",
    "wetland area"
  ],
  "facilities": [
    "visitor center",
    "car park",
    "dog friendly"
  ],
  "route_type": "out and back",
  "activities": [
    "walking"
  ]
}