{
  "objectID": "efb638dcc6f550aa5ba80ee4aa90d001",
  "created_at": "2024-12-18T11:11:59.692963+00:00",
  "ref": "greenway-bank-country-park-walking-route",
  "title": "Greenway Bank and Knypersley Reservoir Walk Route",
  "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Knypersley_Pool_-_geograph.org.uk_-_942763.jpg",
  "nearby": [
    {
      "description": "Caldon Canal",
      "objectID": "868acee010162c5fa010ee3e05ff772f",
      "ref": "caldon-canal-walking-route"
    },
    {
      "description": "Biddulph Grange Country Park",
      "objectID": "7032de924453c04005416cef9c021681",
      "ref": "biddulph-grange-country-park-walking-route"
    }
  ],
  "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/4716C39649C8AF3880257CB3005243A2/$FILE/Greenway Bank Country Park.gpx",
  "_geoloc": {
    "lat": 53.0920889783,
    "lng": -2.1587993382
  },
  "images": [
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Knypersley_Pool_-_geograph.org.uk_-_942763.jpg",
      "title": "Kate Jewell / Knypersley Pool, via Wikimedia Commons",
      "caption": "Knypersley Pool photo. The area of the Knypersley reservoir nearest the dam is known as Knypersley Pool. This commemorates the old mill pool that was lost when the reservoir was created. A watermill was demolished and rebuilt further down the valley beyond the dam and in 2006, when the water level was lowered during extensive restoration work on the reservoir, the old mill dam was exposed. Photograph taken from Greenway Bank where it goes along the top of the dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/2/22/Knypersley_Reservoir_-_geograph.org.uk_-_942739.jpg",
      "title": "Kate Jewell / Knypersley Reservoir, via Wikimedia Commons",
      "caption": "Owned by British Waterways, Knypersley Reservoir feeds the Caldon Canal and the Trent & Mersey Canal. This sign is by Greenway Bank, the road that goes along the dam."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Knypersley_Reservoir_-_geograph.org.uk_-_890224.jpg",
      "title": "Kate Jewell / Knypersley Reservoir, via Wikimedia Commons",
      "caption": "This is the lower, and newer, of the two reservoirs in the park. Both are owned by British Waterways and are the major feeders for the local canal system. The Serpentine Pool, was constructed in the 1780s to supply water to the Caldon canal but by the early 1820s the traffic on the canals in the area had increased so much that the water supply was insufficient. To alleviate this civil engineering giant Thomas Telford designed the adjoining Knypersley reservoir as a further feeder, together with canal engineer James Potter."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d6/The_Serpentine%2C_Greenway_Bank_Country_Park_-_geograph.org.uk_-_879854.jpg",
      "title": "Kate Jewell / The Serpentine, Greenway Bank Country Park",
      "caption": "The Serpentine, Greenway Bank Country Park. This is the upper section of the reservoir system at Greenway Bank Country Park, stocked with bream, roach, carp and pike. Steep wooded banks edge the water with occasional fishing platforms round the edge. This reservoir is owned by British Waterways. Together, with the lower Knypersley reservoir, it holds a massive 930,000 cubic metres of water and provides a constant feed for the Caldon Canal and from there into the Trent & Mersey Canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/16/Countryside_near_Greenway_Bank_Country_Park_-_geograph.org.uk_-_942947.jpg",
      "title": "Kate Jewell / Countryside near Greenway Bank Country Park",
      "caption": "Countryside near Greenway Bank Country Park. View from the upper car park at the country park. Knypersley Reservoir lies in the valley just beyond the trees in the centre of the photograph. The hills in the distance are almost in the next square east."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/d/d3/On_the_edge_of_Greenway_Bank_Country_Park_-_geograph.org.uk_-_879773.jpg",
      "title": "Kate Jewell / On the edge of Greenway Bank Country Park",
      "caption": "On the edge of the park. This small pool, just to the west of the footpath that leads from the Greenway Bank car-park and Visitor Centre down through the woodland to the reservoir, is well colonised by Yellow Flag."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/45/The_Serpentine_dam%2C_Greenway_Bank_Country_Park_-_geograph.org.uk_-_889460.jpg",
      "title": "Kate Jewell / The Serpentine dam, Greenway Bank Country Park",
      "caption": "The Serpentine dam. This dam separates the Serpentine Pool to the right, from the reservoir to the left. Both stretches of water are owned by British Waterways and provide a constant feed for the Trent & Mersey canal via the Caldon canal."
    },
    {
      "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Greenway_Bank_pond_-_geograph.org.uk_-_1766992.jpg/512px-Greenway_Bank_pond_-_geograph.org.uk_-_1766992.jpg",
      "title": "Jonathan Kington / Greenway Bank pond ",
      "caption": "Greenway Bank pond. This is a view of the pond in early Spring. The Spring Crocuses make a lovely patch of colour in the foreground, these were probably planted when this was part of the gardens of Greenway Bank estate."
    }
  ],
  "distance_km": 3.2,
  "description": "Enjoy a short waterside walk around Knypersley Reservoir in this country park near Biddulph. In the park you will find quiet woodland, a lovely waterfall and the Serpentine Pool. There are also lawns and shrubberies, which are ablaze with colour from rhododendrons, azaleas and daffodils in the spring months. The park is located just south of Biddulph. This circular walk runs around the reservoirs for a distance of about 2 miles. After your exercise head to the visitor centre where there is a nice cafe for refreshments. The Staffordshire Moorlands Walks long distance trail runs through the park. To extend your walk you could pick it up at the southern edge of the reservoir and follow it south along the canal feeder. This will lead you to the Caldon Canal where there are more nice waterside footpaths to try. If you head north along the waymarked path it will take you to Biddulph Grange Country Park where there's some beautiful National Trust gardens.",
  "video_url": "https://www.youtube.com/embed/VeH_Kx4AOrc",
  "postcode": "ST8 7QY",
  "county": "Staffordshire",
  "region": "West Midlands",
  "country": "England"
}