{
    "objectID": "efc8370f0695f7b2b051530a856e5b18",
    "created_at": "2024-12-18T11:37:41.180159+00:00",
    "ref": "crook-peak-walking-route",
    "title": "Crook Peak Circular Walk Route",
    "headline_image_url": "https://upload.wikimedia.org/wikipedia/commons/4/47/On_Crook_Peak_-_geograph.org.uk_-_1219901.jpg",
    "nearby": [
        {
            "description": "Cheddar Gorge",
            "objectID": "670588568e5784bafdbeb40078ef6507",
            "ref": "cheddar-gorge-walking-route"
        },
        {
            "description": "Cheddar Reservoir",
            "objectID": "e10c903d2daf1b8614b1867cc5a3e388",
            "ref": "cheddar-reservoir-walking-route"
        },
        {
            "description": "West Mendip Way",
            "objectID": "ae4e6d155e5bd663f57deea08ad1ed66",
            "ref": "west-mendip-way-walking-route"
        },
        {
            "description": "Brent Knoll",
            "objectID": "a5732ed4ac1b705e70d4abbc0f9f5cf0",
            "ref": "brent-knoll-walking-route"
        },
        {
            "description": "Bleadon Hill",
            "objectID": "3e1566d7c2f889c322422d6bafe7b8a3",
            "ref": "bleadon-hill-walking-route"
        }
    ],
    "gpx_url": "http://gps-routes.co.uk/A55CD9/home.nsf/All/794BC242A3C9C65F802580BB00796D41/$FILE/Crook Peak.gpx",
    "_geoloc": {
        "lat": 51.2924980272,
        "lng": -2.8679920436
    },
    "images": [
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/On_Crook_Peak_-_geograph.org.uk_-_1219901.jpg",
            "title": "Derek Harper / On Crook Peak, via Wikimedia Commons",
            "caption": "On Crook Peak. These little escarpments of carboniferous limestone create the crag at the top of Crook Peak. To the left in the background, Compton Hill and Wavering Down carry the line of the Mendips eastwards."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/dc/Crook_Peak_towards_Compton_Hill.jpg",
            "title": "George Evans / Crook Peak towards Compton Hill, via Wikimedia Commons",
            "caption": "The summit of Crook Peak looking northeast towards Compton Hill. The peak is part of the Crook Peak to Shute Shelve Hill geological and biological Site of Special Scientific Interest. The site spans approximately 5 kilometres from west to east, offering a range of landscapes and historical significance. Crook Peak is located at the western end of the ridge. It is a well-known landmark visible from the surrounding area, including the M5 motorway. The peak has historical importance, having served as a beacon site during the time of the Spanish Armada. Nearby, the ridge known as 'The Razor' is used by the West Mendip Soaring Association for model aircraft flying, given the favourable wind conditions in the area."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/3/35/Summit_of_Crook_Peak_-_geograph.org.uk_-_1219880.jpg",
            "title": "Derek Harper / Summit of Crook Peak, via Wikimedia Commons",
            "caption": "Summit of Crook Peak A tilting series of miniature limestone escarpments forms the distinctive crag at the top of the hill, which dominates the stretch of the M5 seen below. Evidence of early human occupation includes a polished flint axe discovered at the Peak. The site also features earthworks on Cross Plain, indicative of past agricultural enclosures. Geologically, the area transitions from sandstone to limestone, a change visible within the 165-metre-long tunnel that was part of the now-defunct Cheddar Valley Line railway. This tunnel is currently used by pedestrians and cyclists as part of a recreational path."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Approaching_Crook_Peak_-_geograph.org.uk_-_1219823.jpg",
            "title": "Derek Harper / Approaching Crook Peak, via Wikimedia Commons",
            "caption": "Outcrops of carboniferous limestone with uniform dip echo the shape of the summit, out of sight ahead. Shute Shelve Hill is primarily composed of Carboniferous Limestone that dates back approximately 350 million years to the Dinantian period. The hill, which reaches an elevation of 233 metres (764 feet) above sea level, forms a ridge created by the southern limb of a heavily eroded anticline. This geological structure features younger limestones on its lower slopes. The Black Rock Limestone, a characteristic type of limestone from the region, is visible in several areas but is often overlain by Burrington Oolite, a different type of limestone formation. Picken's Hole, located at the southern end of Crook Peak, is a significant archaeological site due to its well-preserved sequence of deposits and faunal remains from the Devensian glaciation period. This cave, situated 8 metres below the plateau and 27 metres above the valley floor, has provided a wealth of Middle Palaeolithic artefacts, including two Neanderthal teeth dated to around 55,000 years ago. Faunal remains such as those of spotted hyena, lion, Arctic fox, mammoth, woolly rhinoceros, horse, reindeer, suslik, and northern vole have been discovered here, dating back approximately 35,000 years. Shute Shelve Cavern, also on Shute Shelve Hill, is a natural cave system that was mined for yellow ochre until the 1920s. This cave is notable for its phreatic features and contains speleothem fossils that are over 350,000 years old, providing valuable insights into the geological history of the area."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/7/7d/East_from_Crook_Peak_-_geograph.org.uk_-_1219835.jpg",
            "title": "Derek Harper / East from Crook Peak, via Wikimedia Commons",
            "caption": "On the east side of the hilltop. A ridge descends to the east-south-east. The ecology of the site is diverse, featuring various habitats that support a wide range of species. The area predominantly consists of unimproved calcareous grassland, which is characterised by its low fertility and the presence of calcium-rich soil. This type of grassland is crucial for maintaining a variety of plant species that are adapted to these specific conditions. Alongside this, there is a mixture of ancient and secondary semi-natural broadleaved woodland, as well as patches of acidic dry dwarf-shrub heath. Some of the habitats found here, such as the calcareous grassland communities and certain woodland types, are rare in the UK. The combination of calcareous grassland and acidic dry dwarf-shrub heath is particularly uncommon and supports a number of rare and notable species. These include the Cheddar pink, dwarf sedge, and dwarf mouse-ear, all of which are considered nationally rare. Additionally, the area is home to seven notable plant species. Ancient woodlands like Rose Wood and King's Wood are part of this landscape. King's Wood features coppiced hazel and the nationally important small-leaved lime. Rose Wood is notable for housing the nationally rare purple gromwell."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Gate_onto_Crook_Peak_-_geograph.org.uk_-_1219442.jpg/256px-Gate_onto_Crook_Peak_-_geograph.org.uk_-_1219442.jpg",
            "title": "Derek Harper / Gate onto Crook Peak, via Wikimedia Commons",
            "caption": "Gate onto Crook Peak Opposite the car park on Webbington Road. The gate gives onto a steep climb up the side of the Mendips."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Compton_Bishop_and_Wavering_Down_-_geograph.org.uk_-_542139.jpg",
            "title": "Sharon Loxton / Compton Bishop and Wavering Down, via Wikimedia Commons",
            "caption": "Compton Bishop and Wavering Down. A view of the northern most houses of Compton Bishop and the southern slope of the Mendip hills (the closest area being Wavering Down). In the distance Axbridge reservoir can just be made out (a blue line top right of the photograph). Wavering Down, reaches a height of 210 metres (690 feet) and is marked by a triangulation station. The village of Cross, located nearby, was home to British comedian Frankie Howerd, whose house now serves as a museum and tourist attraction."
        },
        {
            "src": "https://upload.wikimedia.org/wikipedia/commons/d/d9/Drystone_wall%2C_Compton_Hill_-_geograph.org.uk_-_1219978.jpg",
            "title": "Derek Harper / Drystone wall, Compton Hill, via Wikimedia Commons",
            "caption": "Drystone wall, Compton Hill. The wall marks the Sedgemoor/North Somerset boundary."
        }
    ],
    "distance_km": 9.0,
    "description": "Climb to Crook Peak from the village of Compton Bishop on this fine circular walk in the Mendip Hills . The hill and the adjacent Wavering Down are a splendid place for a walk with wonderful views over the countryside to the coast. The route uses part of the West Mendip Way to take you across the downs where you will reach a height of nearly 700ft. On a clear day you can see all the way to Brean Down and Porthkerry on the Welsh coast. The area is a designated geological and biological Site of Special Scientific Interest run by the National Trust. It consists of a variety of interesting flora including ancient woodland, calcareous grassland and the pretty Cheddar Pink flower. You can start the walk from the village of Compton Bishop which is only about a mile from Crook Peak. After visiting the peak you head east across Wavering Down passing Compton Hill on the way. At King's Wood you turn south and descend to the village of Cross on some nice woodland trails. At Cross, you turn west and follow footpaths back to Compton Bishop. You can also start the walk from the car park at King's Wood. It's located off Winscombe Hill Road at the eastern side of Wavering Down. The eastern end of the walk also comes close to Axbridge where you can visit Cheddar Reservoir and the spectacular Cheddar Gorge . These are both good options if you wish to extend your walk. Also nearby is the climb to Brent Knoll . The prominent hill is located near the coast at Burnham-on-Sea and can be seen from the Crook Peak summit.",
    "video_url": "https://www.youtube.com/embed/PlmzhZWUTQQ",
    "postcode": "BS26 2HL",
    "district": "Compton Bishop",
    "county": "Somerset",
    "region": "South West",
    "country": "England"
}
